{"2412.11952": {"publish_time": "2024-12-16", "title": "Advancing Comprehensive Aesthetic Insight with Multi-Scale Text-Guided Self-Supervised Learning", "paper_summary": "Image Aesthetic Assessment (IAA) is a vital and intricate task that entails\nanalyzing and assessing an image's aesthetic values, and identifying its\nhighlights and areas for improvement. Traditional methods of IAA often\nconcentrate on a single aesthetic task and suffer from inadequate labeled\ndatasets, thus impairing in-depth aesthetic comprehension. Despite efforts to\novercome this challenge through the application of Multi-modal Large Language\nModels (MLLMs), such models remain underdeveloped for IAA purposes. To address\nthis, we propose a comprehensive aesthetic MLLM capable of nuanced aesthetic\ninsight. Central to our approach is an innovative multi-scale text-guided\nself-supervised learning technique. This technique features a multi-scale\nfeature alignment module and capitalizes on a wealth of unlabeled data in a\nself-supervised manner to structurally and functionally enhance aesthetic\nability. The empirical evidence indicates that accompanied with extensive\ninstruct-tuning, our model sets new state-of-the-art benchmarks across multiple\ntasks, including aesthetic scoring, aesthetic commenting, and personalized\nimage aesthetic assessment. Remarkably, it also demonstrates zero-shot learning\ncapabilities in the emerging task of aesthetic suggesting. Furthermore, for\npersonalized image aesthetic assessment, we harness the potential of in-context\nlearning and showcase its inherent advantages.", "paper_summary_zh": "影像美學評估 (IAA) 是一項重要且複雜的任務，需要分析和評估影像的美學價值，並找出其亮點和需要改進的地方。傳統的 IAA 方法通常專注於單一美學任務，且受限於標註資料集不足，因此影響深入的美學理解。儘管透過應用多模態大型語言模型 (MLLM) 來克服這項挑戰，但此類模型在 IAA 用途上仍未發展成熟。為了解決這個問題，我們提出一個全面的美學 MLLM，具備細緻入微的美學見解。我們的方法核心是一個創新的多尺度文字引導式自監督學習技術。此技術具備多尺度特徵對齊模組，並利用大量未標註資料以自監督的方式，在結構和功能上提升美學能力。實證證據顯示，在廣泛的指令微調下，我們的模型在多項任務中設定新的最先進基準，包括美學評分、美學評論和個人化影像美學評估。值得注意的是，它還在美學建議的新興任務中展現出零次學習能力。此外，對於個人化影像美學評估，我們利用情境學習的潛力，並展示其固有優勢。", "author": "Yuti Liu et.al.", "authors": "Yuti Liu, Shice Liu, Junyuan Gao, Pengtao Jiang, Hao Zhang, Jinwei Chen, Bo Li", "id": "2412.11952v1", "paper_url": "http://arxiv.org/abs/2412.11952v1", "repo": "null"}}