{"2407.02888": {"publish_time": "2024-07-03", "title": "Joint Optimization of Resource Allocation and Data Selection for Fast and Cost-Efficient Federated Edge Learning", "paper_summary": "Deploying federated learning at the wireless edge introduces federated edge\nlearning (FEEL). Given FEEL's limited communication resources and potential\nmislabeled data on devices, improper resource allocation or data selection can\nhurt convergence speed and increase training costs. Thus, to realize an\nefficient FEEL system, this paper emphasizes jointly optimizing resource\nallocation and data selection. Specifically, in this work, through rigorously\nmodeling the training process and deriving an upper bound on FEEL's one-round\nconvergence rate, we establish a problem of joint resource allocation and data\nselection, which, unfortunately, cannot be solved directly. Toward this end, we\nequivalently transform the original problem into a solvable form via a variable\nsubstitution and then break it into two subproblems, that is, the resource\nallocation problem and the data selection problem. The two subproblems are\nmixed-integer non-convex and integer non-convex problems, respectively, and\nachieving their optimal solutions is a challenging task. Based on the matching\ntheory and applying the convex-concave procedure and gradient projection\nmethods, we devise a low-complexity suboptimal algorithm for the two\nsubproblems, respectively. Finally, the superiority of our proposed scheme of\njoint resource allocation and data selection is validated by numerical results.", "paper_summary_zh": "在無線邊緣部署聯合學習引入了聯合邊緣學習 (FEEL)。鑒於 FEEL 的通訊資源有限，裝置上潛在的標籤錯誤資料，不適當的資源配置或資料選取會損害收斂速度，並增加訓練成本。因此，為了實現高效的 FEEL 系統，本文強調聯合最佳化資源配置和資料選取。具體來說，在這項工作中，透過嚴謹地對訓練過程建模，並推導出 FEEL 一輪收斂率的上限，我們建立了一個聯合資源配置和資料選取的問題，不幸的是，這個問題無法直接解決。為此，我們透過變數替換將原始問題等效轉換為可解的形式，然後將其分解為兩個子問題，即資源配置問題和資料選取問題。這兩個子問題分別是混合整數非凸問題和整數非凸問題，而取得它們的最適解是一項艱鉅的任務。基於匹配理論並應用凸凹程序和梯度投影方法，我們分別為這兩個子問題設計了一個低複雜度的次最佳演算法。最後，我們提出的聯合資源配置和資料選取方案的優越性已通過數值結果得到驗證。", "author": "Yunjian Jia et.al.", "authors": "Yunjian Jia, Zhen Huang, Jiping Yan, Yulu Zhang, Kun Luo, Wanli Wen", "id": "2407.02888v1", "paper_url": "http://arxiv.org/abs/2407.02888v1", "repo": "null"}}