{"2409.20424": {"publish_time": "2024-09-30", "title": "World to Code: Multi-modal Data Generation via Self-Instructed Compositional Captioning and Filtering", "paper_summary": "Recent advances in Vision-Language Models (VLMs) and the scarcity of\nhigh-quality multi-modal alignment data have inspired numerous researches on\nsynthetic VLM data generation. The conventional norm in VLM data construction\nuses a mixture of specialists in caption and OCR, or stronger VLM APIs and\nexpensive human annotation. In this paper, we present World to Code (W2C), a\nmeticulously curated multi-modal data construction pipeline that organizes the\nfinal generation output into a Python code format. The pipeline leverages the\nVLM itself to extract cross-modal information via different prompts and filter\nthe generated outputs again via a consistency filtering strategy. Experiments\nhave demonstrated the high quality of W2C by improving various existing visual\nquestion answering and visual grounding benchmarks across different VLMs.\nFurther analysis also demonstrates that the new code parsing ability of VLMs\npresents better cross-modal equivalence than the commonly used detail caption\nability. Our code is available at\nhttps://github.com/foundation-multimodal-models/World2Code.", "paper_summary_zh": "近期在視覺語言模型 (VLM) 的進展以及高品質多模態對齊資料的稀缺，激發了許多關於合成 VLM 資料產生的研究。VLM 資料建構中的傳統規範使用標題和 OCR 專家，或更強大的 VLM API 和昂貴的人工標註的混合。在本文中，我們提出世界到程式碼 (W2C)，一個精心策劃的多模態資料建構管道，它將最終產生的輸出組織成 Python 程式碼格式。該管道利用 VLM 本身透過不同的提示來萃取跨模態資訊，並透過一致性過濾策略再次過濾產生的輸出。實驗已透過改善不同 VLM 中的各種現有視覺問答和視覺基礎基準來證明 W2C 的高品質。進一步的分析也證明 VLM 的新程式碼解析能力呈現出比一般使用的詳細標題能力更好的跨模態等價性。我們的程式碼可在 https://github.com/foundation-multimodal-models/World2Code 取得。", "author": "Jiacong Wang et.al.", "authors": "Jiacong Wang, Bohong Wu, Haiyong Jiang, Xun Zhou, Xin Xiao, Haoyuan Guo, Jun Xiao", "id": "2409.20424v1", "paper_url": "http://arxiv.org/abs/2409.20424v1", "repo": "null"}}