{"2504.15266": {"publish_time": "2025-04-21", "title": "Roll the dice & look before you leap: Going beyond the creative limits of next-token prediction", "paper_summary": "We design a suite of minimal algorithmic tasks that are a loose abstraction\nof open-ended real-world tasks. This allows us to cleanly and controllably\nquantify the creative limits of the present-day language model. Much like\nreal-world tasks that require a creative, far-sighted leap of thought, our\ntasks require an implicit, open-ended stochastic planning step that either (a)\ndiscovers new connections in an abstract knowledge graph (like in wordplay,\ndrawing analogies, or research) or (b) constructs new patterns (like in\ndesigning math problems or new proteins). In these tasks, we empirically and\nconceptually argue how next-token learning is myopic and memorizes excessively;\ncomparatively, multi-token approaches, namely teacherless training and\ndiffusion models, excel in producing diverse and original output. Secondly, in\nour tasks, we find that to elicit randomness from the Transformer without\nhurting coherence, it is better to inject noise right at the input layer (via a\nmethod we dub hash-conditioning) rather than defer to temperature sampling from\nthe output layer. Thus, our work offers a principled, minimal test-bed for\nanalyzing open-ended creative skills, and offers new arguments for going beyond\nnext-token learning and softmax-based sampling. We make part of the code\navailable under https://github.com/chenwu98/algorithmic-creativity", "paper_summary_zh": "<paragraph>我們設計了一套最小化的演算法任務，這些任務是對開放式現實世界任務的鬆散抽象。這使我們能夠清晰且可控地量化當今語言模型的創造力極限。就像現實世界中需要創造性、有遠見的思維飛躍的任務一樣，我們的任務需要一個隱含的、開放式的隨機規劃步驟，它可以 (a)在抽象的知識圖譜中發現新的聯繫（例如在文字遊戲、類比或研究中），或 (b) 構建新的模式（例如在設計數學問題或新蛋白質中）。在這些任務中，我們從經驗上和概念上論證了「下一個詞元」學習是如何短視和過度記憶的；相比之下，多詞元方法，即無監督訓練和擴散模型，在產生多樣化和原創的輸出方面表現出色。其次，在我們的任務中，我們發現為了從 Transformer 中引發隨機性而不損害連貫性，最好將雜訊直接注入輸入層（通過我們稱為雜湊條件化的方法），而不是延遲到從輸出層進行溫度採樣。因此，我們的工作提供了一個有原則的、最小化的測試平台，用於分析開放式的創造性技能，並為超越「下一個詞元」學習和基於 softmax 的採樣提供了新的論據。我們將部分程式碼發佈在 https://github.com/chenwu98/algorithmic-creativity</paragraph>\n", "author": "Vaishnavh Nagarajan et.al.", "authors": "Vaishnavh Nagarajan, Chen Henry Wu, Charles Ding, Aditi Raghunathan", "id": "2504.15266v1", "paper_url": "http://arxiv.org/abs/2504.15266v1", "repo": "https://github.com/chenwu98/algorithmic-creativity"}}