{"2407.05766": {"publish_time": "2024-07-08", "title": "Multi-agent Reinforcement Learning-based Network Intrusion Detection System", "paper_summary": "Intrusion Detection Systems (IDS) play a crucial role in ensuring the\nsecurity of computer networks. Machine learning has emerged as a popular\napproach for intrusion detection due to its ability to analyze and detect\npatterns in large volumes of data. However, current ML-based IDS solutions\noften struggle to keep pace with the ever-changing nature of attack patterns\nand the emergence of new attack types. Additionally, these solutions face\nchallenges related to class imbalance, where the number of instances belonging\nto different classes (normal and intrusions) is significantly imbalanced, which\nhinders their ability to effectively detect minor classes. In this paper, we\npropose a novel multi-agent reinforcement learning (RL) architecture, enabling\nautomatic, efficient, and robust network intrusion detection. To enhance the\ncapabilities of the proposed model, we have improved the DQN algorithm by\nimplementing the weighted mean square loss function and employing\ncost-sensitive learning techniques. Our solution introduces a resilient\narchitecture designed to accommodate the addition of new attacks and\neffectively adapt to changes in existing attack patterns. Experimental results\nrealized using CIC-IDS-2017 dataset, demonstrate that our approach can\neffectively handle the class imbalance problem and provide a fine grained\nclassification of attacks with a very low false positive rate. In comparison to\nthe current state-of-the-art works, our solution demonstrates a significant\nsuperiority in both detection rate and false positive rate.", "paper_summary_zh": "入侵偵測系統 (IDS) 在確保電腦網路安全方面扮演著至關重要的角色。機器學習因其分析和偵測大量資料中模式的能力，已成為入侵偵測的熱門方法。然而，目前基於機器學習的 IDS 解決方案常常難以跟上不斷變化的攻擊模式本質和新攻擊類型的出現。此外，這些解決方案面臨與類別不平衡相關的挑戰，其中屬於不同類別（正常和入侵）的實例數量顯著不平衡，這阻礙了它們有效偵測次要類別的能力。在本文中，我們提出了一種新穎的多重代理強化學習 (RL) 架構，實現自動、高效且強健的網路入侵偵測。為了增強所提出模型的能力，我們透過實作加權平均平方損失函數和採用成本敏感學習技術來改進 DQN 演算法。我們的解決方案引入了一種有韌性的架構，旨在容納新攻擊的增加，並有效適應現有攻擊模式的變化。使用 CIC-IDS-2017 資料集實現的實驗結果證明，我們的做法可以有效處理類別不平衡問題，並以極低的誤報率提供細緻的攻擊分類。與目前最先進的作品相比，我們的解決方案在偵測率和誤報率方面都展現出顯著的優越性。", "author": "Amine Tellache et.al.", "authors": "Amine Tellache, Amdjed Mokhtari, Abdelaziz Amara Korba, Yacine Ghamri-Doudane", "id": "2407.05766v1", "paper_url": "http://arxiv.org/abs/2407.05766v1", "repo": "null"}}