{"2504.13161": {"publish_time": "2025-04-17", "title": "CLIMB: CLustering-based Iterative Data Mixture Bootstrapping for Language Model Pre-training", "paper_summary": "Pre-training datasets are typically collected from web content and lack\ninherent domain divisions. For instance, widely used datasets like Common Crawl\ndo not include explicit domain labels, while manually curating labeled datasets\nsuch as The Pile is labor-intensive. Consequently, identifying an optimal\npre-training data mixture remains a challenging problem, despite its\nsignificant benefits for pre-training performance. To address these challenges,\nwe propose CLustering-based Iterative Data Mixture Bootstrapping (CLIMB), an\nautomated framework that discovers, evaluates, and refines data mixtures in a\npre-training setting. Specifically, CLIMB embeds and clusters large-scale\ndatasets in a semantic space and then iteratively searches for optimal mixtures\nusing a smaller proxy model and a predictor. When continuously trained on 400B\ntokens with this mixture, our 1B model exceeds the state-of-the-art\nLlama-3.2-1B by 2.0%. Moreover, we observe that optimizing for a specific\ndomain (e.g., Social Sciences) yields a 5% improvement over random sampling.\nFinally, we introduce ClimbLab, a filtered 1.2-trillion-token corpus with 20\nclusters as a research playground, and ClimbMix, a compact yet powerful\n400-billion-token dataset designed for efficient pre-training that delivers\nsuperior performance under an equal token budget. We analyze the final data\nmixture, elucidating the characteristics of an optimal data mixture. Our data\nis available at: https://research.nvidia.com/labs/lpr/climb/", "paper_summary_zh": "預訓練資料集通常是從網路內容中收集而來的，缺乏固有的領域劃分。例如，廣泛使用的資料集，像是 Common Crawl就沒有明確的領域標籤，而手動整理帶標籤的資料集（例如 The Pile）則相當耗費人力。因此，儘管對預訓練效能有顯著的益處，但要找出最佳的預訓練資料組合仍然是一項挑戰。為了應對這些挑戰，我們提出了基於分群的迭代式資料組合引導法（CLIMB），這是一個在預訓練環境中探索、評估和精煉資料組合的自動化框架。具體來說，CLIMB 會將大規模資料集嵌入到語義空間中並進行分群，然後使用較小的代理模型和預測器迭代搜尋最佳組合。當使用此組合連續訓練 400B 個 token 時，我們的 1B 模型的效能超越了最先進的Llama-3.2-1B 模型 2.0%。此外，我們觀察到針對特定領域（例如社會科學）進行優化，相比隨機取樣，效能提升了 5%。最後，我們推出了 ClimbLab，一個經過篩選的 1.2 兆 token 的語料庫，包含 20 個叢集，作為研究的平台；以及 ClimbMix，一個精簡但功能強大的4000 億 token 的資料集，專為高效預訓練而設計，在相同的 token 預算下可提供卓越的效能。我們分析了最終的資料組合，闡明了最佳資料組合的特徵。我們的資料可在以下網址取得：https://research.nvidia.com/labs/lpr/climb/\n", "author": "Shizhe Diao et.al.", "authors": "Shizhe Diao, Yu Yang, Yonggan Fu, Xin Dong, Dan Su, Markus Kliegl, Zijia Chen, Peter Belcak, Yoshi Suhara, Hongxu Yin, Mostofa Patwary, Yingyan, Lin, Jan Kautz, Pavlo Molchanov", "id": "2504.13161v1", "paper_url": "http://arxiv.org/abs/2504.13161v1", "repo": "null"}}