{"2406.06032": {"publish_time": "2024-06-10", "title": "The Curse of Popularity: Popular Entities have Catastrophic Side Effects when Deleting Knowledge from Language Models", "paper_summary": "Language models (LMs) encode world knowledge in their internal parameters\nthrough training. However, LMs may learn personal and confidential information\nfrom the training data, leading to privacy concerns such as data leakage.\nTherefore, research on knowledge deletion from LMs is essential. This study\nfocuses on the knowledge stored in LMs and analyzes the relationship between\nthe side effects of knowledge deletion and the entities related to the\nknowledge. Our findings reveal that deleting knowledge related to popular\nentities can have catastrophic side effects. Furthermore, this research is the\nfirst to analyze knowledge deletion in models trained on synthetic knowledge\ngraphs, indicating a new direction for controlled experiments.", "paper_summary_zh": "語言模型 (LM) 透過訓練將世界知識編碼在其內部參數中。然而，LM 可能會從訓練資料中學習到個人和機密資訊，導致資料外洩等隱私問題。因此，研究從 LM 中刪除知識至關重要。本研究著重於儲存在 LM 中的知識，並分析知識刪除的副作用與與知識相關的實體之間的關係。我們的研究結果揭示，刪除與熱門實體相關的知識可能會造成災難性的副作用。此外，本研究首次分析在合成知識圖譜上訓練的模型中的知識刪除，指出受控實驗的新方向。", "author": "Ryosuke Takahashi et.al.", "authors": "Ryosuke Takahashi, Go Kamoda, Benjamin Heinzerling, Keisuke Sakaguchi, Kentaro Inui", "id": "2406.06032v1", "paper_url": "http://arxiv.org/abs/2406.06032v1", "repo": "null"}}