{"2407.02039": {"publish_time": "2024-07-02", "title": "Prompt Stability Scoring for Text Annotation with Large Language Models", "paper_summary": "Researchers are increasingly using language models (LMs) for text annotation.\nThese approaches rely only on a prompt telling the model to return a given\noutput according to a set of instructions. The reproducibility of LM outputs\nmay nonetheless be vulnerable to small changes in the prompt design. This calls\ninto question the replicability of classification routines. To tackle this\nproblem, researchers have typically tested a variety of semantically similar\nprompts to determine what we call \"prompt stability.\" These approaches remain\nad-hoc and task specific. In this article, we propose a general framework for\ndiagnosing prompt stability by adapting traditional approaches to intra- and\ninter-coder reliability scoring. We call the resulting metric the Prompt\nStability Score (PSS) and provide a Python package PromptStability for its\nestimation. Using six different datasets and twelve outcomes, we classify >150k\nrows of data to: a) diagnose when prompt stability is low; and b) demonstrate\nthe functionality of the package. We conclude by providing best practice\nrecommendations for applied researchers.", "paper_summary_zh": "研究人員越來越常使用語言模型 (LM) 進行文字註解。\n這些方法僅依賴提示，指示模型根據一組說明回傳給定的輸出。\n儘管如此，LM 輸出的可複製性仍可能受到提示設計中的微小變更影響。\n這對分類例程的可重複性提出質疑。為了解決這個問題，研究人員通常會測試各種語義相似的提示，以確定我們所說的「提示穩定性」。這些方法仍然是臨時且特定於任務的。在本文中，我們提出了一個通用框架，用於透過調整傳統方法來診斷提示穩定性，以進行組內和組間編碼器可靠性評分。我們將產生的指標稱為提示穩定性分數 (PSS)，並提供一個 Python 套件 PromptStability 來估計它。我們使用六個不同的資料集和十二個結果，將超過 150k 列的資料分類為：a) 診斷提示穩定性低的情況；以及 b) 展示套件的功能。我們最後提供最佳實務建議，供應用研究人員參考。", "author": "Christopher Barrie et.al.", "authors": "Christopher Barrie, Elli Palaiologou, Petter Törnberg", "id": "2407.02039v1", "paper_url": "http://arxiv.org/abs/2407.02039v1", "repo": "null"}}