{"2408.09640": {"publish_time": "2024-08-19", "title": "Acquiring Bidirectionality via Large and Small Language Models", "paper_summary": "Using token representation from bidirectional language models (LMs) such as\nBERT is still a widely used approach for token-classification tasks. Even\nthough there exist much larger unidirectional LMs such as Llama-2, they are\nrarely used to replace the token representation of bidirectional LMs. In this\nwork, we hypothesize that their lack of bidirectionality is keeping them\nbehind. To that end, we propose to newly train a small backward LM and\nconcatenate its representations to those of existing LM for downstream tasks.\nThrough experiments in named entity recognition, we demonstrate that\nintroducing backward model improves the benchmark performance more than 10\npoints. Furthermore, we show that the proposed method is especially effective\nfor rare domains and in few-shot learning settings.", "paper_summary_zh": "使用來自雙向語言模型 (LM) 的標記表示法（例如 BERT）仍然是標記分類任務中廣泛使用的方法。儘管存在更大的單向 LM，例如 Llama-2，但它們很少用於替換雙向 LM 的標記表示法。在這項工作中，我們假設它們缺乏雙向性，讓它們落後。為此，我們提議重新訓練一個小的後向 LM，並將其表示與現有 LM 的表示串接，以用於下游任務。透過命名實體識別的實驗，我們證明了引入後向模型將基準效能提升了 10 個點以上。此外，我們表明所提出的方法對於罕見領域和少次學習設定特別有效。", "author": "Takumi Goto et.al.", "authors": "Takumi Goto, Hiroyoshi Nagao, Yuta Koreeda", "id": "2408.09640v1", "paper_url": "http://arxiv.org/abs/2408.09640v1", "repo": "null"}}