{"2411.09181": {"publish_time": "2024-11-14", "title": "DeBaTeR: Denoising Bipartite Temporal Graph for Recommendation", "paper_summary": "Due to the difficulty of acquiring large-scale explicit user feedback,\nimplicit feedback (e.g., clicks or other interactions) is widely applied as an\nalternative source of data, where user-item interactions can be modeled as a\nbipartite graph. Due to the noisy and biased nature of implicit real-world\nuser-item interactions, identifying and rectifying noisy interactions are vital\nto enhance model performance and robustness. Previous works on purifying\nuser-item interactions in collaborative filtering mainly focus on mining the\ncorrelation between user/item embeddings and noisy interactions, neglecting the\nbenefit of temporal patterns in determining noisy interactions. Time\ninformation, while enhancing the model utility, also bears its natural\nadvantage in helping to determine noisy edges, e.g., if someone usually watches\nhorror movies at night and talk shows in the morning, a record of watching a\nhorror movie in the morning is more likely to be noisy interaction. Armed with\nthis observation, we introduce a simple yet effective mechanism for generating\ntime-aware user/item embeddings and propose two strategies for denoising\nbipartite temporal graph in recommender systems (DeBaTeR): the first is through\nreweighting the adjacency matrix (DeBaTeR-A), where a reliability score is\ndefined to reweight the edges through both soft assignment and hard assignment;\nthe second is through reweighting the loss function (DeBaTeR-L), where weights\nare generated to reweight user-item samples in the losses. Extensive\nexperiments have been conducted to demonstrate the efficacy of our methods and\nillustrate how time information indeed helps identifying noisy edges.", "paper_summary_zh": "由於難以取得大規模的明確使用者回饋，隱含回饋（例如，點擊或其他互動）廣泛用作資料的替代來源，其中使用者與項目互動可以建模為二部圖。由於隱含的真實世界使用者與項目互動的雜訊和偏差性質，識別和修正雜訊互動對於增強模型效能和穩健性至關重要。先前在協同過濾中淨化使用者與項目互動的研究，主要集中在探勘使用者／項目嵌入與雜訊互動之間的關聯性，忽略了時間模式在決定雜訊互動中的好處。時間資訊在增強模型效用的同時，在幫助確定雜訊邊緣方面也具有其自然優勢，例如，如果某人通常在晚上看恐怖片，在早上看談話性節目，那麼在早上觀看恐怖片的記錄更有可能是雜訊互動。根據此觀察，我們引入了一種簡單但有效的機制來產生時間感知使用者／項目嵌入，並提出了兩種策略，用於在推薦系統中對二部時間圖進行去雜訊（DeBaTeR）：第一個是透過重新加權鄰接矩陣（DeBaTeR-A），其中定義了一個可靠性分數，透過軟指派和硬指派重新加權邊緣；第二個是透過重新加權損失函數（DeBaTeR-L），其中產生權重以重新加權損失中的使用者與項目樣本。已進行廣泛的實驗，以證明我們方法的有效性，並說明時間資訊確實有助於識別雜訊邊緣。", "author": "Xinyu He et.al.", "authors": "Xinyu He, Jose Sepulveda, Mostafa Rahmani, Alyssa Woo, Fei Wang, Hanghang Tong", "id": "2411.09181v1", "paper_url": "http://arxiv.org/abs/2411.09181v1", "repo": "null"}}