{"2410.09541": {"publish_time": "2024-10-12", "title": "LINKED: Eliciting, Filtering and Integrating Knowledge in Large Language Model for Commonsense Reasoning", "paper_summary": "Large language models (LLMs) sometimes demonstrate poor performance on\nknowledge-intensive tasks, commonsense reasoning is one of them. Researchers\ntypically address these issues by retrieving related knowledge from knowledge\ngraphs or employing self-enhancement methods to elicit knowledge in LLMs.\nHowever, noisy knowledge and invalid reasoning issues hamper their ability to\nanswer questions accurately. To this end, we propose a novel method named\neliciting, filtering and integrating knowledge in large language model\n(LINKED). In it, we design a reward model to filter out the noisy knowledge and\ntake the marginal consistent reasoning module to reduce invalid reasoning. With\nour comprehensive experiments on two complex commonsense reasoning benchmarks,\nour method outperforms SOTA baselines (up to 9.0% improvement of accuracy).\nBesides, to measure the positive and negative impact of the injected knowledge,\nwe propose a new metric called effectiveness-preservation score for the\nknowledge enhancement works. Finally, through extensive experiments, we conduct\nan in-depth analysis and find many meaningful conclusions about LLMs in\ncommonsense reasoning tasks.", "paper_summary_zh": "大型語言模型（LLM）有時在知識密集型任務上表現不佳，常識推理就是其中之一。研究人員通常通過從知識圖譜中檢索相關知識或採用自我增強方法來引發 LLM 中的知識來解決這些問題。然而，嘈雜的知識和無效的推理問題阻礙了它們準確回答問題的能力。為此，我們提出了一種名為大型語言模型中知識的引出、過濾和整合（LINKED）的新方法。在其中，我們設計了一個獎勵模型來過濾掉嘈雜的知識，並採用邊際一致推理模組來減少無效推理。通過我們在兩個複雜的常識推理基準上的全面實驗，我們的模型優於 SOTA 基準（準確率提高了 9.0%）。此外，為了衡量注入知識的正面和負面影響，我們提出了一種新的指標，稱為知識增強工作的有效性保留分數。最後，通過大量的實驗，我們進行了深入的分析，並在常識推理任務中發現了許多關於 LLM 的有意義的結論。", "author": "Jiachun Li et.al.", "authors": "Jiachun Li, Pengfei Cao, Chenhao Wang, Zhuoran Jin, Yubo Chen, Kang Liu, Xiaojian Jiang, Jiexin Xu, Jun Zhao", "id": "2410.09541v1", "paper_url": "http://arxiv.org/abs/2410.09541v1", "repo": "https://github.com/bugmakerzzz/linked_code"}}