{"2411.02930": {"publish_time": "2024-11-05", "title": "Textual Aesthetics in Large Language Models", "paper_summary": "Image aesthetics is a crucial metric in the field of image generation.\nHowever, textual aesthetics has not been sufficiently explored. With the\nwidespread application of large language models (LLMs), previous work has\nprimarily focused on the correctness of content and the helpfulness of\nresponses. Nonetheless, providing responses with textual aesthetics is also an\nimportant factor for LLMs, which can offer a cleaner layout and ensure greater\nconsistency and coherence in content. In this work, we introduce a pipeline for\naesthetics polishing and help construct a textual aesthetics dataset named\nTexAes. We propose a textual aesthetics-powered fine-tuning method based on\ndirect preference optimization, termed TAPO, which leverages textual aesthetics\nwithout compromising content correctness. Additionally, we develop two\nevaluation methods for textual aesthetics based on text and image analysis,\nrespectively. Our experiments demonstrate that using textual aesthetics data\nand employing the TAPO fine-tuning method not only improves aesthetic scores\nbut also enhances performance on general evaluation datasets such as\nAlpacalEval and Anera-hard.", "paper_summary_zh": "圖像美學是影像生成領域中一項至關重要的指標。\n然而，文本美學尚未被充分探討。隨著大型語言模型 (LLM) 的廣泛應用，先前的研究主要集中於內容的正確性和回應的有用性。儘管如此，提供具有文本美學的回應對於 LLM 來說也是一個重要的因素，它可以提供更簡潔的版面並確保內容具有更高的前後一致性和連貫性。在這項工作中，我們引入了一個用於美學潤色的管道，並協助建構一個名為 TexAes 的文本美學資料集。我們提出了一種基於直接偏好最佳化的文本美學驅動微調方法，稱為 TAPO，它利用文本美學而不影響內容正確性。此外，我們分別基於文本和影像分析開發了兩種文本美學評估方法。我們的實驗證明，使用文本美學資料並採用 TAPO 微調方法不僅提高了美學分數，還提升了在一般評估資料集（例如 AlpacalEval 和 Anera-hard）上的效能。", "author": "Lingjie Jiang et.al.", "authors": "Lingjie Jiang, Shaohan Huang, Xun Wu, Furu Wei", "id": "2411.02930v1", "paper_url": "http://arxiv.org/abs/2411.02930v1", "repo": "https://github.com/JackLingjie/Textual-Aesthetics"}}