{"2410.22736": {"publish_time": "2024-10-30", "title": "Constructing Multimodal Datasets from Scratch for Rapid Development of a Japanese Visual Language Model", "paper_summary": "To develop high-performing Visual Language Models (VLMs), it is essential to\nprepare multimodal resources, such as image-text pairs, interleaved data, and\ninstruction data. While multimodal resources for English are abundant, there is\na significant lack of corresponding resources for non-English languages, such\nas Japanese. To address this problem, we take Japanese as a non-English\nlanguage and propose a method for rapidly creating Japanese multimodal datasets\nfrom scratch. We collect Japanese image-text pairs and interleaved data from\nweb archives and generate Japanese instruction data directly from images using\nan existing VLM. Our experimental results show that a VLM trained on these\nnative datasets outperforms those relying on machine-translated content.", "paper_summary_zh": "為了開發高性能視覺語言模型 (VLM)，準備多模態資源至關重要，例如圖文配對、交錯資料和指令資料。雖然英文的多模態資源豐富，但非英文語言（如日文）的對應資源卻嚴重不足。為了解決這個問題，我們將日文視為非英文語言，並提出一個從頭開始快速建立日文多模態資料集的方法。我們從網路檔案館收集日文圖文配對和交錯資料，並使用現有的 VLM 直接從圖片產生日文指令資料。我們的實驗結果顯示，使用這些原生資料集訓練的 VLM 優於依賴機器翻譯內容的 VLM。", "author": "Keito Sasagawa et.al.", "authors": "Keito Sasagawa, Koki Maeda, Issa Sugiura, Shuhei Kurita, Naoaki Okazaki, Daisuke Kawahara", "id": "2410.22736v1", "paper_url": "http://arxiv.org/abs/2410.22736v1", "repo": "null"}}