{"2405.04442": {"publish_time": "2024-05-07", "title": "AugmenTory: A Fast and Flexible Polygon Augmentation Library", "paper_summary": "Data augmentation is a key technique for addressing the challenge of limited\ndatasets, which have become a major component in the training procedures of\nimage processing. Techniques such as geometric transformations and color space\nadjustments have been thoroughly tested for their ability to artificially\nexpand training datasets and generate semi-realistic data for training\npurposes. Data augmentation is the most important key to addressing the\nchallenge of limited datasets, which have become a major component of image\nprocessing training procedures. Data augmentation techniques, such as geometric\ntransformations and color space adjustments, are thoroughly tested for their\nability to artificially expand training datasets and generate semi-realistic\ndata for training purposes. Polygons play a crucial role in instance\nsegmentation and have seen a surge in use across advanced models, such as\nYOLOv8. Despite their growing popularity, the lack of specialized libraries\nhampers the polygon-augmentation process. This paper introduces a novel\nsolution to this challenge, embodied in the newly developed AugmenTory library.\nNotably, AugmenTory offers reduced computational demands in both time and space\ncompared to existing methods. Additionally, the library includes a\npostprocessing thresholding feature. The AugmenTory package is publicly\navailable on GitHub, where interested users can access the source code:\nhttps://github.com/Smartory/AugmenTory", "paper_summary_zh": "資料擴充是解決有限資料集挑戰的一項關鍵技術，這已成為影像處理訓練程序中的主要組成部分。幾何轉換和色彩空間調整等技術已徹底測試其人工擴充訓練資料集和產生半擬真資料以進行訓練目的的能力。資料擴充是解決有限資料集挑戰最重要的關鍵，這已成為影像處理訓練程序的主要組成部分。資料擴充技術，例如幾何轉換和色彩空間調整，已徹底測試其人工擴充訓練資料集和產生半擬真資料以進行訓練目的的能力。多邊形在實例分割中扮演至關重要的角色，並已在 YOLOv8 等進階模型中廣泛使用。儘管它們越來越受歡迎，但缺乏專門的函式庫會阻礙多邊形擴充程序。本文介紹了解決此挑戰的一項創新方案，體現在新開發的 AugmenTory 函式庫中。值得注意的是，與現有方法相比，AugmenTory 在時間和空間上都降低了運算需求。此外，該函式庫還包含後處理閾值功能。AugmenTory 套件已在 GitHub 上公開，有興趣的使用者可以在其中存取原始程式碼：\nhttps://github.com/Smartory/AugmenTory", "author": "Tanaz Ghahremani et.al.", "authors": "Tanaz Ghahremani, Mohammad Hoseyni, Mohammad Javad Ahmadi, Pouria Mehrabi, Amirhossein Nikoofard", "id": "2405.04442v1", "paper_url": "http://arxiv.org/abs/2405.04442v1", "repo": "null"}}