{"2405.07436": {"publish_time": "2024-05-13", "title": "Can Language Models Explain Their Own Classification Behavior?", "paper_summary": "Large language models (LLMs) perform well at a myriad of tasks, but\nexplaining the processes behind this performance is a challenge. This paper\ninvestigates whether LLMs can give faithful high-level explanations of their\nown internal processes. To explore this, we introduce a dataset,\nArticulateRules, of few-shot text-based classification tasks generated by\nsimple rules. Each rule is associated with a simple natural-language\nexplanation. We test whether models that have learned to classify inputs\ncompetently (both in- and out-of-distribution) are able to articulate freeform\nnatural language explanations that match their classification behavior. Our\ndataset can be used for both in-context and finetuning evaluations. We evaluate\na range of LLMs, demonstrating that articulation accuracy varies considerably\nbetween models, with a particularly sharp increase from GPT-3 to GPT-4. We then\ninvestigate whether we can improve GPT-3's articulation accuracy through a\nrange of methods. GPT-3 completely fails to articulate 7/10 rules in our test,\neven after additional finetuning on correct explanations. We release our\ndataset, ArticulateRules, which can be used to test self-explanation for LLMs\ntrained either in-context or by finetuning.", "paper_summary_zh": "大型語言模型 (LLM) 在大量任務中表現良好，但要解釋這種表現背後的過程卻是一項挑戰。本文探討 LLM 是否能對其自身的內部過程提供忠實的高層次解釋。為了探討這一點，我們引入了一個數據集 ArticulateRules，其中包含由簡單規則生成的少量基於文本的分類任務。每個規則都與一個簡單的自然語言解釋相關聯。我們測試了已學會對輸入進行分類的模型（無論是在分佈內還是分佈外）是否能夠表達出與其分類行為相符的自由形式自然語言解釋。我們的數據集可用於上下文和微調評估。我們評估了一系列 LLM，證明了模型之間的表達準確性差異很大，特別是從 GPT-3 到 GPT-4 的大幅提升。然後，我們探討了是否能夠通過一系列方法來提高 GPT-3 的表達準確性。即使在對正確的解釋進行了額外的微調後，GPT-3 仍然完全無法表達我們測試中的 7/10 條規則。我們發布了我們的數據集 ArticulateRules，它可用於測試在上下文中或通過微調訓練的 LLM 的自我解釋。", "author": "Dane Sherburn et.al.", "authors": "Dane Sherburn, Bilal Chughtai, Owain Evans", "id": "2405.07436v1", "paper_url": "http://arxiv.org/abs/2405.07436v1", "repo": "https://github.com/danesherbs/articulate-rules"}}