{"2409.18084": {"publish_time": "2024-09-26", "title": "GSON: A Group-based Social Navigation Framework with Large Multimodal Model", "paper_summary": "As the number of service robots and autonomous vehicles in human-centered\nenvironments grows, their requirements go beyond simply navigating to a\ndestination. They must also take into account dynamic social contexts and\nensure respect and comfort for others in shared spaces, which poses significant\nchallenges for perception and planning. In this paper, we present a group-based\nsocial navigation framework GSON to enable mobile robots to perceive and\nexploit the social group of their surroundings by leveling the visual reasoning\ncapability of the Large Multimodal Model (LMM). For perception, we apply visual\nprompting techniques to zero-shot extract the social relationship among\npedestrians and combine the result with a robust pedestrian detection and\ntracking pipeline to alleviate the problem of low inference speed of the LMM.\nGiven the perception result, the planning system is designed to avoid\ndisrupting the current social structure. We adopt a social structure-based\nmid-level planner as a bridge between global path planning and local motion\nplanning to preserve the global context and reactive response. The proposed\nmethod is validated on real-world mobile robot navigation tasks involving\ncomplex social structure understanding and reasoning. Experimental results\ndemonstrate the effectiveness of the system in these scenarios compared with\nseveral baselines.", "paper_summary_zh": "隨著以人為中心的環境中服務機器人和自動駕駛車輛的數量增加，它們的要求已超越了單純導航到目的地。它們還必須考慮動態的社交背景，並確保在共享空間中尊重和安慰他人，這對感知和規劃提出了重大挑戰。在本文中，我們提出了一個基於群組的社交導航框架 GSON，以使移動機器人能夠通過提升大型多模態模型 (LMM) 的視覺推理能力來感知和利用周圍環境中的社交群組。對於感知，我們將視覺提示技術應用於零次學習，以提取行人之間的社交關係，並將結果與強大的行人檢測和追蹤管道相結合，以緩解 LMM 推論速度低的問題。根據感知結果，規劃系統被設計為避免破壞當前的社交結構。我們採用基於社會結構的中級規劃器作為全局路徑規劃和局部運動規劃之間的橋樑，以保留全局背景和反應性響應。所提出的方法在涉及複雜社會結構理解和推理的真實世界移動機器人導航任務中得到驗證。實驗結果證明了該系統在這些場景中的有效性，並與幾個基線進行了比較。", "author": "Shangyi Luo et.al.", "authors": "Shangyi Luo, Ji Zhu, Peng Sun, Yuhong Deng, Cunjun Yu, Anxing Xiao, Xueqian Wang", "id": "2409.18084v1", "paper_url": "http://arxiv.org/abs/2409.18084v1", "repo": "null"}}