{"2412.12606": {"publish_time": "2024-12-17", "title": "Multi-Dimensional Insights: Benchmarking Real-World Personalization in Large Multimodal Models", "paper_summary": "The rapidly developing field of large multimodal models (LMMs) has led to the\nemergence of diverse models with remarkable capabilities. However, existing\nbenchmarks fail to comprehensively, objectively and accurately evaluate whether\nLMMs align with the diverse needs of humans in real-world scenarios. To bridge\nthis gap, we propose the Multi-Dimensional Insights (MDI) benchmark, which\nincludes over 500 images covering six common scenarios of human life. Notably,\nthe MDI-Benchmark offers two significant advantages over existing evaluations:\n(1) Each image is accompanied by two types of questions: simple questions to\nassess the model's understanding of the image, and complex questions to\nevaluate the model's ability to analyze and reason beyond basic content. (2)\nRecognizing that people of different age groups have varying needs and\nperspectives when faced with the same scenario, our benchmark stratifies\nquestions into three age categories: young people, middle-aged people, and\nolder people. This design allows for a detailed assessment of LMMs'\ncapabilities in meeting the preferences and needs of different age groups. With\nMDI-Benchmark, the strong model like GPT-4o achieve 79% accuracy on age-related\ntasks, indicating that existing LMMs still have considerable room for\nimprovement in addressing real-world applications. Looking ahead, we anticipate\nthat the MDI-Benchmark will open new pathways for aligning real-world\npersonalization in LMMs. The MDI-Benchmark data and evaluation code are\navailable at https://mdi-benchmark.github.io/", "paper_summary_zh": "大型多模态模型 (LMM) 快速发展的领域已经\n导致了具有卓越功能的不同模型的出现。然而，现有的\n基准无法全面、客观和准确地评估\nLMM 是否符合人类在现实场景中的不同需求。为了弥合\n这一差距，我们提出了多维洞察 (MDI) 基准，其中\n包括涵盖人类生活六个常见场景的 500 多张图像。值得注意的是，\nMDI 基准比现有评估具有两个显着优势：\n(1) 每张图像都附带两种类型的问题：简单问题以\n评估模型对图像的理解，以及复杂问题以\n评估模型分析和推理超越基本内容的能力。(2)\n认识到不同年龄组的人在面对相同场景时有不同的需求和\n观点，我们的基准将问题分层为三个年龄类别：年轻人、中年人和\n老年人。这种设计允许对 LMM 的能力进行详细评估\n满足不同年龄组的偏好和需求。使用\nMDI 基准，GPT-4o 等强大模型在与年龄相关的\n任务上实现了 79% 的准确率，表明现有的 LMM 仍然有很大的\n改进空间来解决现实世界的应用程序。展望未来，我们预计\nMDI 基准将为在 LMM 中调整现实世界的个性化开辟新途径。MDI 基准数据和评估代码可在 https://mdi-benchmark.github.io/ 获得", "author": "YiFan Zhang et.al.", "authors": "YiFan Zhang, Shanglin Lei, Runqi Qiao, Zhuoma GongQue, Xiaoshuai Song, Guanting Dong, Qiuna Tan, Zhe Wei, Peiqing Yang, Ye Tian, Yadong Xue, Xiaofei Wang, Honggang Zhang", "id": "2412.12606v1", "paper_url": "http://arxiv.org/abs/2412.12606v1", "repo": "null"}}