{"2501.01010": {"publish_time": "2025-01-02", "title": "CryptoMamba: Leveraging State Space Models for Accurate Bitcoin Price Prediction", "paper_summary": "Predicting Bitcoin price remains a challenging problem due to the high\nvolatility and complex non-linear dynamics of cryptocurrency markets.\nTraditional time-series models, such as ARIMA and GARCH, and recurrent neural\nnetworks, like LSTMs, have been widely applied to this task but struggle to\ncapture the regime shifts and long-range dependencies inherent in the data. In\nthis work, we propose CryptoMamba, a novel Mamba-based State Space Model (SSM)\narchitecture designed to effectively capture long-range dependencies in\nfinancial time-series data. Our experiments show that CryptoMamba not only\nprovides more accurate predictions but also offers enhanced generalizability\nacross different market conditions, surpassing the limitations of previous\nmodels. Coupled with trading algorithms for real-world scenarios, CryptoMamba\ndemonstrates its practical utility by translating accurate forecasts into\nfinancial outcomes. Our findings signal a huge advantage for SSMs in stock and\ncryptocurrency price forecasting tasks.", "paper_summary_zh": "由於加密貨幣市場的高波動性和複雜的非線性動態，預測比特幣價格仍然是一個具有挑戰性的問題。\n傳統的時間序列模型，例如 ARIMA 和 GARCH，以及遞迴神經網路，例如 LSTM，已被廣泛應用於此任務，但難以捕捉資料中固有的政權轉移和長程依賴性。\n在這項工作中，我們提出了 CryptoMamba，一種基於 Mamba 的新穎狀態空間模型 (SSM) 架構，旨在有效捕捉財務時間序列資料中的長程依賴性。我們的實驗表明，CryptoMamba 不僅提供了更準確的預測，還提供了跨不同市場條件的增強泛化能力，超越了先前模型的限制。結合用於實際場景的交易演算法，CryptoMamba 通過將準確的預測轉化為財務成果，展示了其實用性。我們的發現表明 SSM 在股票和加密貨幣價格預測任務中具有巨大的優勢。", "author": "Mohammad Shahab Sepehri et.al.", "authors": "Mohammad Shahab Sepehri, Asal Mehradfar, Mahdi Soltanolkotabi, Salman Avestimehr", "id": "2501.01010v1", "paper_url": "http://arxiv.org/abs/2501.01010v1", "repo": "null"}}