{"2406.17305": {"publish_time": "2024-06-25", "title": "Retrieval Augmented Instruction Tuning for Open NER with Large Language Models", "paper_summary": "The strong capability of large language models (LLMs) has been applied to\ninformation extraction (IE) through either retrieval augmented prompting or\ninstruction tuning (IT). However, the best way to incorporate information with\nLLMs for IE remains an open question. In this paper, we explore Retrieval\nAugmented Instruction Tuning (RA-IT) for IE, focusing on the task of open named\nentity recognition (NER). Specifically, for each training sample, we retrieve\nsemantically similar examples from the training dataset as the context and\nprepend them to the input of the original instruction. To evaluate our RA-IT\napproach more thoroughly, we construct a Chinese IT dataset for open NER and\nevaluate RA-IT in both English and Chinese scenarios. Experimental results\nverify the effectiveness of RA-IT across various data sizes and in both English\nand Chinese scenarios. We also conduct thorough studies to explore the impacts\nof various retrieval strategies in the proposed RA-IT framework. Code and data\nare available at: https://github.com/Emma1066/Retrieval-Augmented-IT-OpenNER", "paper_summary_zh": "大型語言模型 (LLM) 的強大功能已透過檢索擴充提示或指令微調 (IT) 應用於資訊萃取 (IE)。然而，將資訊與 LLM 整合以進行 IE 的最佳方式仍是一個開放性的問題。在本文中，我們探討了用於 IE 的檢索擴充指令微調 (RA-IT)，重點放在開放式命名實體辨識 (NER) 的任務上。具體來說，對於每個訓練範例，我們從訓練資料集中擷取語義上相似的範例作為背景，並將它們加到原始指令的輸入之前。為了更徹底地評估我們的 RA-IT 方法，我們建構了一個用於開放式 NER 的中文 IT 資料集，並在英文和中文場景中評估 RA-IT。實驗結果驗證了 RA-IT 在各種資料大小以及英文和中文場景中的有效性。我們也進行了徹底的研究，以探討在提議的 RA-IT 架構中各種檢索策略的影響。程式碼和資料可在 https://github.com/Emma1066/Retrieval-Augmented-IT-OpenNER 取得", "author": "Tingyu Xie et.al.", "authors": "Tingyu Xie, Jian Zhang, Yan Zhang, Yuanyuan Liang, Qi Li, Hongwei Wang", "id": "2406.17305v1", "paper_url": "http://arxiv.org/abs/2406.17305v1", "repo": "https://github.com/emma1066/retrieval-augmented-it-openner"}}