{"2409.11056": {"publish_time": "2024-09-17", "title": "Large Language Models are Good Multi-lingual Learners : When LLMs Meet Cross-lingual Prompts", "paper_summary": "With the advent of Large Language Models (LLMs), generating rule-based data\nfor real-world applications has become more accessible. Due to the inherent\nambiguity of natural language and the complexity of rule sets, especially in\nlong contexts, LLMs often struggle to follow all specified rules, frequently\nomitting at least one. To enhance the reasoning and understanding of LLMs on\nlong and complex contexts, we propose a novel prompting strategy Multi-Lingual\nPrompt, namely MLPrompt, which automatically translates the error-prone rule\nthat an LLM struggles to follow into another language, thus drawing greater\nattention to it. Experimental results on public datasets across various tasks\nhave shown MLPrompt can outperform state-of-the-art prompting methods such as\nChain of Thought, Tree of Thought, and Self-Consistency. Additionally, we\nintroduce a framework integrating MLPrompt with an auto-checking mechanism for\nstructured data generation, with a specific case study in text-to-MIP\ninstances. Further, we extend the proposed framework for text-to-SQL to\ndemonstrate its generation ability towards structured data synthesis.", "paper_summary_zh": "隨著大型語言模型 (LLM) 的出現，生成基於規則的資料\n對於真實世界的應用程式來說變得更容易取得。由於自然語言的內在\n模糊性和規則集的複雜性，特別是在長語境中，LLM 常常難以遵循所有指定的規則，經常\n至少遺漏一個。為了增強 LLM 在長且複雜的語境中的推理和理解，我們提出一個新穎的提示策略多語言\n提示，即 MLPrompt，它自動將 LLM 難以遵循的容易出錯的規則翻譯成另一種語言，從而引起更大的\n注意它。在各種任務的公用資料集上的實驗結果顯示，MLPrompt 可以優於最先進的提示方法，例如\n思考鏈、思考樹和自我一致性。此外，我們\n引入了將 MLPrompt 與自動檢查機制整合的框架，用於結構化資料生成，並以文字轉換為 MIP\n實例為具體案例研究。此外，我們擴充了建議的文字轉換為 SQL 框架，以展示其對結構化資料合成的生成能力。", "author": "Teng Wang et.al.", "authors": "Teng Wang, Zhenqi He, Wing-Yin Yu, Xiaojin Fu, Xiongwei Han", "id": "2409.11056v1", "paper_url": "http://arxiv.org/abs/2409.11056v1", "repo": "null"}}