{"2410.19219": {"publish_time": "2024-10-25", "title": "Robot Behavior Personalization from Sparse User Feedback", "paper_summary": "As service robots become more general-purpose, they will need to adapt to\ntheir users' preferences over a large set of all possible tasks that they can\nperform. This includes preferences regarding which actions the users prefer to\ndelegate to robots as opposed to doing themselves. Existing personalization\napproaches require task-specific data for each user. To handle diversity across\nall household tasks and users, and nuances in user preferences across tasks, we\npropose to learn a task adaptation function independently, which can be used in\ntandem with any universal robot policy to customize robot behavior. We create\nTask Adaptation using Abstract Concepts (TAACo) framework. TAACo can learn to\npredict the user's preferred manner of assistance with any given task, by\nmediating reasoning through a representation composed of abstract concepts\nbuilt based on user feedback. TAACo can generalize to an open set of household\ntasks from small amount of user feedback and explain its inferences through\nintuitive concepts. We evaluate our model on a dataset we collected of 5\npeople's preferences, and show that TAACo outperforms GPT-4 by 16% and a\nrule-based system by 54%, on prediction accuracy, with 40 samples of user\nfeedback.", "paper_summary_zh": "隨著服務機器人變得更加通用，它們需要適應用戶在所有可能執行任務的大型集合中的偏好。這包括關於用戶偏好委派給機器人或自己執行哪些動作的偏好。現有的個性化方法需要每個用戶的特定任務數據。為了處理所有家務和用戶的多樣性，以及用戶在任務中的偏好差異，我們建議獨立學習任務適應功能，該功能可以與任何通用機器人策略結合使用來自定義機器人行為。我們使用抽象概念（TAACo）框架創建任務適應。TAACo 可以通過調解通過基於用戶反饋構建的抽象概念組成的表示來推理，從而學會預測用戶在任何給定任務中的首選協助方式。TAACo 可以從少量用戶反饋中概化到一系列開放的家務任務，並通過直觀的概念解釋其推論。我們在我們收集的 5 人偏好數據集上評估我們的模型，並表明 TAACo 在預測準確率上比 GPT-4 高 16%，比基於規則的系統高 54%，有 40 個用戶反饋樣本。", "author": "Maithili Patel et.al.", "authors": "Maithili Patel, Sonia Chernova", "id": "2410.19219v1", "paper_url": "http://arxiv.org/abs/2410.19219v1", "repo": "null"}}