{"2406.09272": {"publish_time": "2024-06-13", "title": "Action2Sound: Ambient-Aware Generation of Action Sounds from Egocentric Videos", "paper_summary": "Generating realistic audio for human interactions is important for many\napplications, such as creating sound effects for films or virtual reality\ngames. Existing approaches implicitly assume total correspondence between the\nvideo and audio during training, yet many sounds happen off-screen and have\nweak to no correspondence with the visuals -- resulting in uncontrolled ambient\nsounds or hallucinations at test time. We propose a novel ambient-aware audio\ngeneration model, AV-LDM. We devise a novel audio-conditioning mechanism to\nlearn to disentangle foreground action sounds from the ambient background\nsounds in in-the-wild training videos. Given a novel silent video, our model\nuses retrieval-augmented generation to create audio that matches the visual\ncontent both semantically and temporally. We train and evaluate our model on\ntwo in-the-wild egocentric video datasets Ego4D and EPIC-KITCHENS. Our model\noutperforms an array of existing methods, allows controllable generation of the\nambient sound, and even shows promise for generalizing to computer graphics\ngame clips. Overall, our work is the first to focus video-to-audio generation\nfaithfully on the observed visual content despite training from uncurated clips\nwith natural background sounds.", "paper_summary_zh": "生成逼真的人类互动音频对于许多应用非常重要，例如为电影或虚拟现实游戏创建音效。现有方法在训练期间隐式地假定视频和音频之间完全对应，但许多声音发生在屏幕外，与视觉效果几乎或完全没有对应关系，从而导致在测试时出现不受控制的环境声音或幻觉。我们提出了一个新颖的环境感知音频生成模型 AV-LDM。我们设计了一种新颖的音频调节机制，以学习从野外训练视频中的环境背景声音中解开前景动作声音。给定一个新颖的无声视频，我们的模型使用检索增强生成来创建与视觉内容在语义和时间上都匹配的音频。我们在两个野外自我中心视频数据集 Ego4D 和 EPIC-KITCHENS 上训练和评估我们的模型。我们的模型优于现有的多种方法，允许可控生成环境声音，甚至显示出推广到计算机图形游戏剪辑的希望。总体而言，我们的工作首次专注于视频到音频生成，忠实于观察到的视觉内容，尽管是从具有自然背景声音的未经整理的剪辑中进行训练的。", "author": "Changan Chen et.al.", "authors": "Changan Chen, Puyuan Peng, Ami Baid, Zihui Xue, Wei-Ning Hsu, David Harwarth, Kristen Grauman", "id": "2406.09272v1", "paper_url": "http://arxiv.org/abs/2406.09272v1", "repo": "null"}}