{"2405.12779": {"publish_time": "2024-05-21", "title": "Transformer in Touch: A Survey", "paper_summary": "The Transformer model, initially achieving significant success in the field\nof natural language processing, has recently shown great potential in the\napplication of tactile perception. This review aims to comprehensively outline\nthe application and development of Transformers in tactile technology. We first\nintroduce the two fundamental concepts behind the success of the Transformer:\nthe self-attention mechanism and large-scale pre-training. Then, we delve into\nthe application of Transformers in various tactile tasks, including but not\nlimited to object recognition, cross-modal generation, and object manipulation,\noffering a concise summary of the core methodologies, performance benchmarks,\nand design highlights. Finally, we suggest potential areas for further research\nand future work, aiming to generate more interest within the community, tackle\nexisting challenges, and encourage the use of Transformer models in the tactile\nfield.", "paper_summary_zh": "Transformer 模型最初在自然語言處理領域取得了顯著的成功，最近在觸覺感知的應用中也展現了巨大的潛力。本綜述旨在全面概述 Transformer 在觸覺技術中的應用和發展。我們首先介紹 Transformer 成功背後的兩個基本概念：自注意力機制和大規模預訓練。然後，我們深入探討 Transformer 在各種觸覺任務中的應用，包括但不限於物體識別、跨模態生成和物體操作，簡要總結了核心方法、性能基準和設計亮點。最後，我們提出了進一步研究和未來工作的潛在領域，旨在激發社區內部更多的興趣，應對現有挑戰，並鼓勵在觸覺領域使用 Transformer 模型。", "author": "Jing Gao et.al.", "authors": "Jing Gao, Ning Cheng, Bin Fang, Wenjuan Han", "id": "2405.12779v1", "paper_url": "http://arxiv.org/abs/2405.12779v1", "repo": "null"}}