{"2406.19966": {"publish_time": "2024-06-28", "title": "Simulating Financial Market via Large Language Model based Agents", "paper_summary": "Most economic theories typically assume that financial market participants\nare fully rational individuals and use mathematical models to simulate human\nbehavior in financial markets. However, human behavior is often not entirely\nrational and is challenging to predict accurately with mathematical models. In\nthis paper, we propose \\textbf{A}gent-based \\textbf{S}imulated\n\\textbf{F}inancial \\textbf{M}arket (ASFM), which first constructs a simulated\nstock market with a real order matching system. Then, we propose a large\nlanguage model based agent as the stock trader, which contains the profile,\nobservation, and tool-learning based action module. The trading agent can\ncomprehensively understand current market dynamics and financial policy\ninformation, and make decisions that align with their trading strategy. In the\nexperiments, we first verify that the reactions of our ASFM are consistent with\nthe real stock market in two controllable scenarios. In addition, we also\nconduct experiments in two popular economics research directions, and we find\nthat conclusions drawn in our \\model align with the preliminary findings in\neconomics research. Based on these observations, we believe our proposed ASFM\nprovides a new paradigm for economic research.", "paper_summary_zh": "大多數經濟理論通常假設金融市場參與者是完全理性的個體，並使用數學模型來模擬金融市場中的人類行為。然而，人類行為通常並非完全理性，且難以使用數學模型準確預測。在本文中，我們提出基於代理的模擬金融市場 (ASFM)，它首先構建一個具有真實訂單匹配系統的模擬股票市場。然後，我們提出一個基於大型語言模型的代理作為股票交易者，其中包含個人資料、觀察和基於工具學習的動作模組。交易代理可以全面了解當前的市場動態和財務政策資訊，並根據其交易策略做出決策。在實驗中，我們首先驗證我們的 ASFM 的反應與兩個可控場景中的真實股票市場一致。此外，我們還在兩個流行的經濟學研究方向中進行了實驗，我們發現我們模型中得出的結論與經濟學研究中的初步發現一致。根據這些觀察，我們相信我們提出的 ASFM 為經濟研究提供了新的範例。", "author": "Shen Gao et.al.", "authors": "Shen Gao, Yuntao Wen, Minghang Zhu, Jianing Wei, Yuhan Cheng, Qunzi Zhang, Shuo Shang", "id": "2406.19966v1", "paper_url": "http://arxiv.org/abs/2406.19966v1", "repo": "null"}}