{"2502.15677": {"publish_time": "2025-02-21", "title": "FLEKE: Federated Locate-then-Edit Knowledge Editing", "paper_summary": "Locate-then-Edit Knowledge Editing (LEKE) is a key technique for updating\nlarge language models (LLMs) without full retraining. However, existing methods\nassume a single-user setting and become inefficient in real-world multi-client\nscenarios, where decentralized organizations (e.g., hospitals, financial\ninstitutions) independently update overlapping knowledge, leading to redundant\nmediator knowledge vector (MKV) computations and privacy concerns. To address\nthese challenges, we introduce Federated Locate-then-Edit Knowledge Editing\n(FLEKE), a novel task that enables multiple clients to collaboratively perform\nLEKE while preserving privacy and reducing computational overhead. To achieve\nthis, we propose FedEdit, a two-stage framework that optimizes MKV selection\nand reuse. In the first stage, clients locally apply LEKE and upload the\ncomputed MKVs. In the second stage, rather than relying solely on server-based\nMKV sharing, FLEKE allows clients retrieve relevant MKVs based on cosine\nsimilarity, enabling knowledge re-edit and minimizing redundant computations.\nExperimental results on two benchmark datasets demonstrate that FedEdit retains\nover 96% of the performance of non-federated LEKE while significantly\noutperforming a FedAvg-based baseline by approximately twofold. Besides, we\nfind that MEMIT performs more consistently than PMET in the FLEKE task with our\nFedEdit framework. Our code is available at https://github.com/zongkaiz/FLEKE.", "paper_summary_zh": "定位後編輯知識編輯 (LEKE) 是在不進行完整重新訓練的情況下更新大型語言模型 (LLM) 的關鍵技術。然而，現有方法假設單用戶設定，且在實際的多用戶案例中會變得低效，在這些案例中，分散式組織（例如醫院、金融機構）會獨立更新重疊的知識，導致重複的調解者知識向量 (MKV) 運算和隱私問題。為了應對這些挑戰，我們引入了聯邦定位後編輯知識編輯 (FLEKE)，這是一個新穎的任務，可讓多個用戶在保護隱私和降低運算負擔的同時，協作執行 LEKE。為了達成此目的，我們提出了 FedEdit，這是一個兩階段架構，用於最佳化 MKV 選擇和重複使用。在第一階段，用戶在本地套用 LEKE 並上傳計算出的 MKV。在第二階段，FLEKE 並不只依賴基於伺服器的 MKV 共享，而是允許用戶根據餘弦相似性擷取相關 MKV，這能讓知識重新編輯並將重複運算降到最低。在兩個基準資料集上的實驗結果顯示，FedEdit 保留了超過 96% 的非聯邦 LEKE 效能，同時大幅優於基於 FedAvg 的基準，大約高出兩倍。此外，我們發現 MEMIT 在使用 FedEdit 架構的 FLEKE 任務中，比 PMET 的執行更一致。我們的程式碼可以在 https://github.com/zongkaiz/FLEKE 取得。", "author": "Zongkai Zhao et.al.", "authors": "Zongkai Zhao, Guozeng Xu, Xiuhua Li, Kaiwen Wei, Jiang Zhong", "id": "2502.15677v1", "paper_url": "http://arxiv.org/abs/2502.15677v1", "repo": "null"}}