{"2410.10812": {"publish_time": "2024-10-14", "title": "HART: Efficient Visual Generation with Hybrid Autoregressive Transformer", "paper_summary": "We introduce Hybrid Autoregressive Transformer (HART), an autoregressive (AR)\nvisual generation model capable of directly generating 1024x1024 images,\nrivaling diffusion models in image generation quality. Existing AR models face\nlimitations due to the poor image reconstruction quality of their discrete\ntokenizers and the prohibitive training costs associated with generating 1024px\nimages. To address these challenges, we present the hybrid tokenizer, which\ndecomposes the continuous latents from the autoencoder into two components:\ndiscrete tokens representing the big picture and continuous tokens representing\nthe residual components that cannot be represented by the discrete tokens. The\ndiscrete component is modeled by a scalable-resolution discrete AR model, while\nthe continuous component is learned with a lightweight residual diffusion\nmodule with only 37M parameters. Compared with the discrete-only VAR tokenizer,\nour hybrid approach improves reconstruction FID from 2.11 to 0.30 on MJHQ-30K,\nleading to a 31% generation FID improvement from 7.85 to 5.38. HART also\noutperforms state-of-the-art diffusion models in both FID and CLIP score, with\n4.5-7.7x higher throughput and 6.9-13.4x lower MACs. Our code is open sourced\nat https://github.com/mit-han-lab/hart.", "paper_summary_zh": "<paragraph>我們介紹了混合自迴歸Transformer (HART)，這是一個自迴歸 (AR) 視覺生成模型，能夠直接生成 1024x1024 影像，在影像生成品質上與擴散模型匹敵。現有的 AR 模型由於其離散符號化器的影像重建品質不佳，以及生成 1024px 影像時相關的訓練成本過高，因此面臨限制。為了應對這些挑戰，我們提出了混合符號化器，它將來自自動編碼器的連續潛在變數分解成兩個組成部分：代表大局的離散符號，以及代表無法由離散符號表示的殘差組成的連續符號。離散組成部分由可調整解析度的離散 AR 模型建模，而連續組成部分則使用僅有 37M 參數的輕量級殘差擴散模組進行學習。與僅有離散的 VAR 符號化器相比，我們的混合方法將 MJHQ-30K 上的重建 FID 從 2.11 改善到 0.30，導致生成 FID 從 7.85 改善到 5.38，提升了 31%。HART 在 FID 和 CLIP 分數上也優於最先進的擴散模型，且處理量高出 4.5-7.7 倍，MACs 低 6.9-13.4 倍。我們的程式碼已在 https://github.com/mit-han-lab/hart 開源。</paragraph>", "author": "Haotian Tang et.al.", "authors": "Haotian Tang, Yecheng Wu, Shang Yang, Enze Xie, Junsong Chen, Junyu Chen, Zhuoyang Zhang, Han Cai, Yao Lu, Song Han", "id": "2410.10812v1", "paper_url": "http://arxiv.org/abs/2410.10812v1", "repo": "https://github.com/mit-han-lab/hart"}}