{"2406.04598": {"publish_time": "2024-06-07", "title": "OCDB: Revisiting Causal Discovery with a Comprehensive Benchmark and Evaluation Framework", "paper_summary": "Large language models (LLMs) have excelled in various natural language\nprocessing tasks, but challenges in interpretability and trustworthiness\npersist, limiting their use in high-stakes fields. Causal discovery offers a\npromising approach to improve transparency and reliability. However, current\nevaluations are often one-sided and lack assessments focused on\ninterpretability performance. Additionally, these evaluations rely on synthetic\ndata and lack comprehensive assessments of real-world datasets. These lead to\npromising methods potentially being overlooked. To address these issues, we\npropose a flexible evaluation framework with metrics for evaluating differences\nin causal structures and causal effects, which are crucial attributes that help\nimprove the interpretability of LLMs. We introduce the Open Causal Discovery\nBenchmark (OCDB), based on real data, to promote fair comparisons and drive\noptimization of algorithms. Additionally, our new metrics account for\nundirected edges, enabling fair comparisons between Directed Acyclic Graphs\n(DAGs) and Completed Partially Directed Acyclic Graphs (CPDAGs). Experimental\nresults show significant shortcomings in existing algorithms' generalization\ncapabilities on real data, highlighting the potential for performance\nimprovement and the importance of our framework in advancing causal discovery\ntechniques.", "paper_summary_zh": "大型語言模型 (LLM) 在各種自然語言處理任務中表現出色，但可解釋性和可信度方面的挑戰仍然存在，限制了它們在高風險領域中的使用。因果發現提供了一種有前景的方法來提高透明度和可靠性。然而，目前的評估通常是一方面的，缺乏針對可解釋性表現的評估。此外，這些評估依賴於合成數據，並且缺乏對現實世界數據集的全面評估。這導致有前景的方法可能被忽視。為了解決這些問題，我們提出了一個靈活的評估框架，其中包含用於評估因果結構和因果效應差異的指標，這些都是有助於提高 LLM 可解釋性的關鍵屬性。我們基於真實數據引入了開放因果發現基準 (OCDB)，以促進公平的比較並推動算法的優化。此外，我們的新指標考慮了無向邊，從而可以在有向無環圖 (DAG) 和已完成的部分有向無環圖 (CPDAG) 之間進行公平的比較。實驗結果表明，現有算法在真實數據上的泛化能力存在顯著缺陷，突出了性能改進的潛力以及我們框架在推進因果發現技術中的重要性。", "author": "Wei Zhou et.al.", "authors": "Wei Zhou, Hong Huang, Guowen Zhang, Ruize Shi, Kehan Yin, Yuanyuan Lin, Bang Liu", "id": "2406.04598v1", "paper_url": "http://arxiv.org/abs/2406.04598v1", "repo": "null"}}