{"2409.17146": {"publish_time": "2024-09-25", "title": "Molmo and PixMo: Open Weights and Open Data for State-of-the-Art Multimodal Models", "paper_summary": "Today's most advanced multimodal models remain proprietary. The strongest\nopen-weight models rely heavily on synthetic data from proprietary VLMs to\nachieve good performance, effectively distilling these closed models into open\nones. As a result, the community is still missing foundational knowledge about\nhow to build performant VLMs from scratch. We present Molmo, a new family of\nVLMs that are state-of-the-art in their class of openness. Our key innovation\nis a novel, highly detailed image caption dataset collected entirely from human\nannotators using speech-based descriptions. To enable a wide array of user\ninteractions, we also introduce a diverse dataset mixture for fine-tuning that\nincludes in-the-wild Q&A and innovative 2D pointing data. The success of our\napproach relies on careful choices for the model architecture details, a\nwell-tuned training pipeline, and, most critically, the quality of our newly\ncollected datasets, all of which will be released. The best-in-class 72B model\nwithin the Molmo family not only outperforms others in the class of open weight\nand data models but also compares favorably against proprietary systems like\nGPT-4o, Claude 3.5, and Gemini 1.5 on both academic benchmarks and human\nevaluation.\n  We will be releasing all of our model weights, captioning and fine-tuning\ndata, and source code in the near future. Select model weights, inference code,\nand demo are available at https://molmo.allenai.org.", "paper_summary_zh": "<paragraph>當今最先進的多模式模型仍然是專有的。最強大的開放權重模型極度依賴於來自專有 VLM 的合成資料，才能達到良好的效能，有效地將這些封閉模型提煉成開放模型。因此，社群仍然缺乏如何從頭打造效能良好的 VLM 的基礎知識。我們提出 Molmo，一個新的 VLM 家族，在開放性方面屬於其類別中的最先進技術。我們的關鍵創新是使用語音描述從人類註釋員那裡完全收集而來的一組新穎且極為詳細的影像標題資料集。為了支援各種使用者互動，我們還引進一個多元的資料集混合體進行微調，其中包括實際的問答和創新的 2D 指向資料。我們方法的成功有賴於模型架構細節的仔細選擇、調整良好的訓練管道，以及最關鍵的是我們新收集的資料集的品質，所有這些都將發布。Molmo 家族中最好的 72B 模型不僅優於開放權重和資料模型類別中的其他模型，而且在學術基準和人類評估中，也與 GPT-4o、Claude 3.5 和 Gemini 1.5 等專有系統相比之下毫不遜色。我們將在不久的將來釋出我們所有的模型權重、字幕和微調資料，以及原始程式碼。部分模型權重、推論程式碼和示範可於 https://molmo.allenai.org 取得。</paragraph>", "author": "Matt Deitke et.al.", "authors": "Matt Deitke, Christopher Clark, Sangho Lee, Rohun Tripathi, Yue Yang, Jae Sung Park, Mohammadreza Salehi, Niklas Muennighoff, Kyle Lo, Luca Soldaini, Jiasen Lu, Taira Anderson, Erin Bransom, Kiana Ehsani, Huong Ngo, YenSung Chen, Ajay Patel, Mark Yatskar, Chris Callison-Burch, Andrew Head, Rose Hendrix, Favyen Bastani, Eli VanderBilt, Nathan Lambert, Yvonne Chou, Arnavi Chheda, Jenna Sparks, Sam Skjonsberg, Michael Schmitz, Aaron Sarnat, Byron Bischoff, Pete Walsh, Chris Newell, Piper Wolters, Tanmay Gupta, Kuo-Hao Zeng, Jon Borchardt, Dirk Groeneveld, Jen Dumas, Crystal Nam, Sophie Lebrecht, Caitlin Wittlif, Carissa Schoenick, Oscar Michel, Ranjay Krishna, Luca Weihs, Noah A. Smith, Hannaneh Hajishirzi, Ross Girshick, Ali Farhadi, Aniruddha Kembhavi", "id": "2409.17146v1", "paper_url": "http://arxiv.org/abs/2409.17146v1", "repo": "null"}}