{"2502.17403": {"publish_time": "2025-02-24", "title": "Large Language Models are Powerful EHR Encoders", "paper_summary": "Electronic Health Records (EHRs) offer rich potential for clinical\nprediction, yet their inherent complexity and heterogeneity pose significant\nchallenges for traditional machine learning approaches. Domain-specific EHR\nfoundation models trained on large collections of unlabeled EHR data have\ndemonstrated promising improvements in predictive accuracy and generalization;\nhowever, their training is constrained by limited access to diverse,\nhigh-quality datasets and inconsistencies in coding standards and healthcare\npractices. In this study, we explore the possibility of using general-purpose\nLarge Language Models (LLMs) based embedding methods as EHR encoders. By\nserializing patient records into structured Markdown text, transforming codes\ninto human-readable descriptors, we leverage the extensive generalization\ncapabilities of LLMs pretrained on vast public corpora, thereby bypassing the\nneed for proprietary medical datasets. We systematically evaluate two\nstate-of-the-art LLM-embedding models, GTE-Qwen2-7B-Instruct and\nLLM2Vec-Llama3.1-8B-Instruct, across 15 diverse clinical prediction tasks from\nthe EHRSHOT benchmark, comparing their performance to an EHRspecific foundation\nmodel, CLIMBR-T-Base, and traditional machine learning baselines. Our results\ndemonstrate that LLM-based embeddings frequently match or exceed the\nperformance of specialized models, even in few-shot settings, and that their\neffectiveness scales with the size of the underlying LLM and the available\ncontext window. Overall, our findings demonstrate that repurposing LLMs for EHR\nencoding offers a scalable and effective approach for clinical prediction,\ncapable of overcoming the limitations of traditional EHR modeling and\nfacilitating more interoperable and generalizable healthcare applications.", "paper_summary_zh": "電子健康紀錄 (EHR) 為臨床預測提供了豐富的潛力，但其固有的複雜性和異質性對傳統機器學習方法構成了重大挑戰。針對大量未標記 EHR 資料訓練的特定領域 EHR 基礎模型已證明在預測準確性和概括性方面有顯著的進步；然而，其訓練受到對多樣化、高品質資料集的有限存取以及編碼標準和醫療保健實務的不一致性所限制。在本研究中，我們探討了使用基於通用大型語言模型 (LLM) 的嵌入方法作為 EHR 編碼器的可能性。透過將病歷序列化為結構化的 Markdown 文字，將代碼轉換為人類可讀的描述符，我們利用在廣泛的公共語料庫上預先訓練的 LLM 的廣泛概括能力，從而繞過對專有醫療資料集的需求。我們系統地評估了兩個最先進的 LLM 嵌入模型，GTE-Qwen2-7B-Instruct 和 LLM2Vec-Llama3.1-8B-Instruct，涵蓋了 EHRSHOT 基準中的 15 項不同的臨床預測任務，並將其效能與 EHR 特定的基礎模型 CLIMBR-T-Base 和傳統機器學習基準進行比較。我們的結果表明，基於 LLM 的嵌入通常與專用模型的效能相匹配或超過專用模型的效能，即使在少次嘗試的設定中也是如此，而且其效能會隨著基礎 LLM 的大小和可用的上下文視窗而擴展。總體而言，我們的研究結果表明，將 LLM 轉用於 EHR 編碼為臨床預測提供了一個可擴展且有效的方法，能夠克服傳統 EHR 建模的限制，並促進更具互操作性和可概括性的醫療保健應用。", "author": "Stefan Hegselmann et.al.", "authors": "Stefan Hegselmann, Georg von Arnim, Tillmann Rheude, Noel Kronenberg, David Sontag, Gerhard Hindricks, Roland Eils, Benjamin Wild", "id": "2502.17403v1", "paper_url": "http://arxiv.org/abs/2502.17403v1", "repo": "null"}}