{"2502.02283": {"publish_time": "2025-02-04", "title": "GP-GS: Gaussian Processes for Enhanced Gaussian Splatting", "paper_summary": "3D Gaussian Splatting has emerged as an efficient photorealistic novel view\nsynthesis method. However, its reliance on sparse Structure-from-Motion (SfM)\npoint clouds consistently compromises the scene reconstruction quality. To\naddress these limitations, this paper proposes a novel 3D reconstruction\nframework Gaussian Processes Gaussian Splatting (GP-GS), where a multi-output\nGaussian Process model is developed to achieve adaptive and uncertainty-guided\ndensification of sparse SfM point clouds. Specifically, we propose a dynamic\nsampling and filtering pipeline that adaptively expands the SfM point clouds by\nleveraging GP-based predictions to infer new candidate points from the input 2D\npixels and depth maps. The pipeline utilizes uncertainty estimates to guide the\npruning of high-variance predictions, ensuring geometric consistency and\nenabling the generation of dense point clouds. The densified point clouds\nprovide high-quality initial 3D Gaussians to enhance reconstruction\nperformance. Extensive experiments conducted on synthetic and real-world\ndatasets across various scales validate the effectiveness and practicality of\nthe proposed framework.", "paper_summary_zh": "3D 高斯濺射已成為一種有效的光寫實新視圖合成方法。然而，它依賴於稀疏的結構運動 (SfM) 點雲，始終會影響場景重建品質。為了解決這些限制，本文提出了一種新的 3D 重建框架高斯程序高斯濺射 (GP-GS)，其中開發了一個多輸出高斯程序模型，以實現稀疏 SfM 點雲的自適應和不確定性引導致密化。具體來說，我們提出了一個動態採樣和過濾管道，通過利用基於 GP 的預測從輸入 2D 像素和深度圖推斷新的候選點，自適應地擴展 SfM 點雲。該管道利用不確定性估計來引導高方差預測的剪枝，確保幾何一致性並生成密集點雲。致密點雲提供了高品質的初始 3D 高斯函數，以增強重建性能。在各種規模的合成和真實世界數據集上進行的廣泛實驗驗證了所提出框架的有效性和實用性。", "author": "Zhihao Guo et.al.", "authors": "Zhihao Guo, Jingxuan Su, Shenglin Wang, Jinlong Fan, Jing Zhang, Liangxiu Han, Peng Wang", "id": "2502.02283v1", "paper_url": "http://arxiv.org/abs/2502.02283v1", "repo": "null"}}