{"2409.05022": {"publish_time": "2024-09-08", "title": "Sequential Recommendation via Adaptive Robust Attention with Multi-dimensional Embeddings", "paper_summary": "Sequential recommendation models have achieved state-of-the-art performance\nusing self-attention mechanism. It has since been found that moving beyond only\nusing item ID and positional embeddings leads to a significant accuracy boost\nwhen predicting the next item. In recent literature, it was reported that a\nmulti-dimensional kernel embedding with temporal contextual kernels to capture\nusers' diverse behavioral patterns results in a substantial performance\nimprovement. In this study, we further improve the sequential recommender\nmodel's robustness and generalization by introducing a mix-attention mechanism\nwith a layer-wise noise injection (LNI) regularization. We refer to our\nproposed model as adaptive robust sequential recommendation framework (ADRRec),\nand demonstrate through extensive experiments that our model outperforms\nexisting self-attention architectures.", "paper_summary_zh": "序列推薦模型已經使用自注意力機制達到了最先進的效能。從那時起，人們發現僅使用項目 ID 和位置嵌入就已經可以顯著提升預測下一項目的準確度。在最近的文獻中，有報導指出，使用具有時間脈絡核的多維核嵌入來擷取使用者的各種行為模式，可以大幅提升效能。在本研究中，我們透過引入具有逐層雜訊注入 (LNI) 正則化的混合注意力機制，進一步提升序列推薦模型的穩健性和泛化性。我們將我們提出的模型稱為自適應穩健序列推薦架構 (ADRRec)，並透過廣泛的實驗證明我們的模型優於現有的自注意力架構。", "author": "Linsey Pang et.al.", "authors": "Linsey Pang, Amir Hossein Raffiee, Wei Liu, Keld Lundgaard", "id": "2409.05022v1", "paper_url": "http://arxiv.org/abs/2409.05022v1", "repo": "null"}}