{"2409.04909": {"publish_time": "2024-09-07", "title": "Efficient Training of Transformers for Molecule Property Prediction on Small-scale Datasets", "paper_summary": "The blood-brain barrier (BBB) serves as a protective barrier that separates\nthe brain from the circulatory system, regulating the passage of substances\ninto the central nervous system. Assessing the BBB permeability of potential\ndrugs is crucial for effective drug targeting. However, traditional\nexperimental methods for measuring BBB permeability are challenging and\nimpractical for large-scale screening. Consequently, there is a need to develop\ncomputational approaches to predict BBB permeability. This paper proposes a GPS\nTransformer architecture augmented with Self Attention, designed to perform\nwell in the low-data regime. The proposed approach achieved a state-of-the-art\nperformance on the BBB permeability prediction task using the BBBP dataset,\nsurpassing existing models. With a ROC-AUC of 78.8%, the approach sets a\nstate-of-the-art by 5.5%. We demonstrate that standard Self Attention coupled\nwith GPS transformer performs better than other variants of attention coupled\nwith GPS Transformer.", "paper_summary_zh": "血腦屏障 (BBB) 是一個保護性屏障，將大腦與循環系統分開，調節物質進入中樞神經系統。評估潛在藥物的 BBB 滲透性對於有效藥物靶向至關重要。然而，傳統的測量 BBB 滲透性的實驗方法具有挑戰性，且不切實際用於大規模篩選。因此，需要開發計算方法來預測 BBB 滲透性。本文提出了一個增強了自我注意力的 GPS Transformer 架構，旨在在低數據量環境中表現良好。所提出的方法在使用 BBBP 數據集的 BBB 滲透性預測任務中取得了最先進的性能，超越了現有模型。通過 78.8% 的 ROC-AUC，該方法將最先進的技術提高了 5.5%。我們證明了標準自我注意力與 GPS Transformer 相結合的性能優於與 GPS Transformer 相結合的其他注意力變體。", "author": "Shivesh Prakash et.al.", "authors": "Shivesh Prakash", "id": "2409.04909v1", "paper_url": "http://arxiv.org/abs/2409.04909v1", "repo": "null"}}