{"2409.18644": {"publish_time": "2024-09-27", "title": "Incorporating Precedents for Legal Judgement Prediction on European Court of Human Rights Cases", "paper_summary": "Inspired by the legal doctrine of stare decisis, which leverages precedents\n(prior cases) for informed decision-making, we explore methods to integrate\nthem into LJP models. To facilitate precedent retrieval, we train a retriever\nwith a fine-grained relevance signal based on the overlap ratio of alleged\narticles between cases. We investigate two strategies to integrate precedents:\ndirect incorporation at inference via label interpolation based on case\nproximity and during training via a precedent fusion module using a\nstacked-cross attention model. We employ joint training of the retriever and\nLJP models to address latent space divergence between them. Our experiments on\nLJP tasks from the ECHR jurisdiction reveal that integrating precedents during\ntraining coupled with joint training of the retriever and LJP model,\noutperforms models without precedents or with precedents incorporated only at\ninference, particularly benefiting sparser articles.", "paper_summary_zh": "受遵循先例的法律原则启发，该原则利用先例（先前的案例）进行明智的决策，我们探索将它们整合到 LJP 模型中的方法。为了促进先例检索，我们训练了一个检索器，其基于案例之间涉嫌文章的重叠率来获得细粒度的相关性信号。我们调查了两种整合先例的策略：在推理时通过基于案例接近度的标签插值直接纳入，以及在训练期间通过使用堆叠交叉注意力模型的先例融合模块纳入。我们采用检索器和 LJP 模型的联合训练来解决它们之间的潜在空间差异。我们在欧洲人权法院管辖区的 LJP 任务上的实验表明，在训练期间整合先例，并结合检索器和 LJP 模型的联合训练，优于没有先例或仅在推理时纳入先例的模型，特别是对稀疏文章有益。", "author": "T. Y. S. S. Santosh et.al.", "authors": "T. Y. S. S. Santosh, Mohamed Hesham Elganayni, Stanisław Sójka, Matthias Grabmair", "id": "2409.18644v1", "paper_url": "http://arxiv.org/abs/2409.18644v1", "repo": "null"}}