{"2406.17415": {"publish_time": "2024-06-25", "title": "Layer-Wise Quantization: A Pragmatic and Effective Method for Quantizing LLMs Beyond Integer Bit-Levels", "paper_summary": "We present a simple variable quantization approach that quantizes different\nlayers of a large language model (LLM) at different bit levels. Specifically,\nwe quantize the most important layers to higher bit precision and less\nimportant layers to lower bits to achieve floating point quantization levels.\nWe propose two effective strategies to measure the importance of layers within\nLLMs: the first measures the importance of a layer based on how different its\noutput embeddings are from the input embeddings (the higher the better); the\nsecond estimates the importance of a layer using the number of layer weights\nthat are much larger than average (the smaller the better). We show that\nquantizing different layers at varying bits according to our importance scores\nresults in minimal performance drop with a far more compressed model size.\nFinally, we present several practical key takeaways from our variable\nlayer-wise quantization experiments: (a) LLM performance under variable\nquantization remains close to the original model until 25-50% of layers are\nmoved in lower quantization using our proposed ordering but only until 5-10% if\nmoved using no specific ordering; (b) Quantizing LLMs to lower bits performs\nsubstantially better than pruning unless extreme quantization (2-bit) is used;\nand (c) Layer-wise quantization to lower bits works better in the case of\nlarger LLMs with more layers compared to smaller LLMs with fewer layers. The\ncode used to run the experiments is available at:\nhttps://github.com/RazvanDu/LayerwiseQuant.", "paper_summary_zh": "<paragraph>我們提出一個簡單的變數量化方法，以不同的位元級別量化大型語言模型 (LLM) 的不同層。具體來說，我們將最重要的層量化為更高的位元精度，而將較不重要的層量化為較低的位元，以實現浮點量化級別。我們提出了兩種有效的策略來衡量 LLM 內層的重要性：第一個策略根據層的輸出嵌入與輸入嵌入的差異來衡量層的重要性（差異越大越好）；第二個策略使用遠大於平均值的層權重的數量來估計層的重要性（越小越好）。我們表明，根據我們的重要性分數，以不同的位元量化不同的層，會導致效能下降極小，但模型大小卻大幅壓縮。最後，我們從可變層級量化實驗中提出幾個實用的關鍵結論：(a) 在可變量化下，LLM 效能接近原始模型，直到 25-50% 的層使用我們建議的排序移至較低量化，但如果使用沒有特定排序，則只會接近 5-10%；(b) 將 LLM 量化為較低的位元比修剪執行得更好，除非使用極端量化 (2 位元)；(c) 與具有較少層的小型 LLM 相比，層級量化到較低位元在具有較多層的大型 LLM 中效果更好。用於執行實驗的程式碼可在以下位置取得：https://github.com/RazvanDu/LayerwiseQuant。</paragraph>", "author": "Razvan-Gabriel Dumitru et.al.", "authors": "Razvan-Gabriel Dumitru, Vikas Yadav, Rishabh Maheshwary, Paul-Ioan Clotan, Sathwik Tejaswi Madhusudhan, Mihai Surdeanu", "id": "2406.17415v2", "paper_url": "http://arxiv.org/abs/2406.17415v2", "repo": "null"}}