{"2405.12669": {"publish_time": "2024-05-21", "title": "A Survey on Multi-modal Machine Translation: Tasks, Methods and Challenges", "paper_summary": "In recent years, multi-modal machine translation has attracted significant\ninterest in both academia and industry due to its superior performance. It\ntakes both textual and visual modalities as inputs, leveraging visual context\nto tackle the ambiguities in source texts. In this paper, we begin by offering\nan exhaustive overview of 99 prior works, comprehensively summarizing\nrepresentative studies from the perspectives of dominant models, datasets, and\nevaluation metrics. Afterwards, we analyze the impact of various factors on\nmodel performance and finally discuss the possible research directions for this\ntask in the future. Over time, multi-modal machine translation has developed\nmore types to meet diverse needs. Unlike previous surveys confined to the early\nstage of multi-modal machine translation, our survey thoroughly concludes these\nemerging types from different aspects, so as to provide researchers with a\nbetter understanding of its current state.", "paper_summary_zh": "近年來，多模態機器翻譯由於其卓越的性能，在學術界和產業界都引起了極大的興趣。它將文本和視覺模式作為輸入，利用視覺語境來解決源文本中的歧義。在本文中，我們首先提供 99 項先前工作的詳盡概述，全面總結了從主要模型、資料集和評估指標角度的代表性研究。之後，我們分析了各種因素對模型效能的影響，最後討論了未來此任務可能的研究方向。隨著時間推移，多模態機器翻譯已發展出更多類型，以滿足不同的需求。與先前僅限於多模態機器翻譯早期階段的調查不同，我們的調查從不同面向徹底總結了這些新興類型，以便讓研究人員更了解其現狀。", "author": "Huangjun Shen et.al.", "authors": "Huangjun Shen, Liangying Shao, Wenbo Li, Zhibin Lan, Zhanyu Liu, Jinsong Su", "id": "2405.12669v1", "paper_url": "http://arxiv.org/abs/2405.12669v1", "repo": "null"}}