{"2408.10683": {"publish_time": "2024-08-20", "title": "Rejection in Abstract Argumentation: Harder Than Acceptance?", "paper_summary": "Abstract argumentation is a popular toolkit for modeling, evaluating, and\ncomparing arguments. Relationships between arguments are specified in\nargumentation frameworks (AFs), and conditions are placed on sets (extensions)\nof arguments that allow AFs to be evaluated. For more expressiveness, AFs are\naugmented with \\emph{acceptance conditions} on directly interacting arguments\nor a constraint on the admissible sets of arguments, resulting in dialectic\nframeworks or constrained argumentation frameworks. In this paper, we consider\nflexible conditions for \\emph{rejecting} an argument from an extension, which\nwe call rejection conditions (RCs). On the technical level, we associate each\nargument with a specific logic program. We analyze the resulting complexity,\nincluding the structural parameter treewidth. Rejection AFs are highly\nexpressive, giving rise to natural problems on higher levels of the polynomial\nhierarchy.", "paper_summary_zh": "抽象論證是一種用於建模、評估和比較論證的熱門工具包。論證之間的關係在論證框架 (AF) 中指定，並對允許評估 AF 的論證集（擴充）設定條件。為了更具表現力，AF 會在直接交互論證或對可接受論證集的約束上加上「接受條件」，產生辯證框架或受約束論證框架。在本文中，我們考慮了從擴充中「拒絕」論證的彈性條件，我們稱之為拒絕條件 (RC)。在技術層面上，我們將每個論證與特定的邏輯程式關聯起來。我們分析了由此產生的複雜性，包括結構參數樹寬。拒絕 AF 具有高度表現力，導致多項式層次結構中較高層級的自然問題。", "author": "Johannes K. Fichte et.al.", "authors": "Johannes K. Fichte, Markus Hecher, Yasir Mahmood, Arne Meier", "id": "2408.10683v1", "paper_url": "http://arxiv.org/abs/2408.10683v1", "repo": "null"}}