{"2409.17622": {"publish_time": "2024-09-26", "title": "Neural P$^3$M: A Long-Range Interaction Modeling Enhancer for Geometric GNNs", "paper_summary": "Geometric graph neural networks (GNNs) have emerged as powerful tools for\nmodeling molecular geometry. However, they encounter limitations in effectively\ncapturing long-range interactions in large molecular systems. To address this\nchallenge, we introduce Neural P$^3$M, a versatile enhancer of geometric GNNs\nto expand the scope of their capabilities by incorporating mesh points\nalongside atoms and reimaging traditional mathematical operations in a\ntrainable manner. Neural P$^3$M exhibits flexibility across a wide range of\nmolecular systems and demonstrates remarkable accuracy in predicting energies\nand forces, outperforming on benchmarks such as the MD22 dataset. It also\nachieves an average improvement of 22% on the OE62 dataset while integrating\nwith various architectures.", "paper_summary_zh": "幾何圖形神經網路 (GNN) 已成為用於建模分子幾何形狀的強大工具。然而，它們在有效捕捉大型分子系統中的長程交互作用方面遇到限制。為了應對這一挑戰，我們引入了 Neural P$^3$M，這是一種幾何 GNN 的多功能增強器，通過整合網格點和原子，並以可訓練的方式重新構想傳統數學運算，來擴展其功能範圍。Neural P$^3$M 在廣泛的分子系統中表現出靈活性，並在預測能量和力方面表現出顯著的準確性，在 MD22 資料集等基準測試中表現優異。它還與各種架構整合，在 OE62 資料集上實現了平均 22% 的改進。", "author": "Yusong Wang et.al.", "authors": "Yusong Wang, Chaoran Cheng, Shaoning Li, Yuxuan Ren, Bin Shao, Ge Liu, Pheng-Ann Heng, Nanning Zheng", "id": "2409.17622v1", "paper_url": "http://arxiv.org/abs/2409.17622v1", "repo": "null"}}