{"2502.04103": {"publish_time": "2025-02-06", "title": "VTutor: An Open-Source SDK for Generative AI-Powered Animated Pedagogical Agents with Multi-Media Output", "paper_summary": "The rapid evolution of large language models (LLMs) has transformed\nhuman-computer interaction (HCI), but the interaction with LLMs is currently\nmainly focused on text-based interactions, while other multi-model approaches\nremain under-explored. This paper introduces VTutor, an open-source Software\nDevelopment Kit (SDK) that combines generative AI with advanced animation\ntechnologies to create engaging, adaptable, and realistic APAs for human-AI\nmulti-media interactions. VTutor leverages LLMs for real-time personalized\nfeedback, advanced lip synchronization for natural speech alignment, and WebGL\nrendering for seamless web integration. Supporting various 2D and 3D character\nmodels, VTutor enables researchers and developers to design emotionally\nresonant, contextually adaptive learning agents. This toolkit enhances learner\nengagement, feedback receptivity, and human-AI interaction while promoting\ntrustworthy AI principles in education. VTutor sets a new standard for\nnext-generation APAs, offering an accessible, scalable solution for fostering\nmeaningful and immersive human-AI interaction experiences. The VTutor project\nis open-sourced and welcomes community-driven contributions and showcases.", "paper_summary_zh": "大型語言模型 (LLM) 的快速演進轉變了人機互動 (HCI)，但與 LLM 的互動目前主要集中在基於文字的互動上，而其他多模式方法仍未得到充分探索。本文介紹了 VTutor，這是一個開源軟體開發套件 (SDK)，它將生成式 AI 與先進的動畫技術相結合，為人機多媒體互動創造了引人入勝、適應性強且逼真的 APA。VTutor 利用 LLM 進行即時個性化回饋、先進的唇形同步以實現自然的語音對齊，以及 WebGL 渲染以實現無縫的網路整合。VTutor 支援各種 2D 和 3D 角色模型，使研究人員和開發人員能夠設計出情感共鳴且適應脈絡的學習代理。此工具包增強了學習者的參與度、回饋接受度和人機互動，同時在教育中宣導值得信賴的 AI 原則。VTutor 為下一代 APA 設定了新標準，提供了一個可存取、可擴充的解決方案，以促進有意義且身臨其境的 AI 人機互動體驗。VTutor 這個專案是開源的，歡迎社群驅動的貢獻和展示。", "author": "Eason Chen et.al.", "authors": "Eason Chen, Chengyu Lin, Xinyi Tang, Aprille Xi, Canwen Wang, Jionghao Lin, Kenneth R Koedinger", "id": "2502.04103v1", "paper_url": "http://arxiv.org/abs/2502.04103v1", "repo": "null"}}