{"2412.18552": {"publish_time": "2024-12-24", "title": "Distilling Fine-grained Sentiment Understanding from Large Language Models", "paper_summary": "Fine-grained sentiment analysis (FSA) aims to extract and summarize user\nopinions from vast opinionated text. Recent studies demonstrate that large\nlanguage models (LLMs) possess exceptional sentiment understanding\ncapabilities. However, directly deploying LLMs for FSA applications incurs high\ninference costs. Therefore, this paper investigates the distillation of\nfine-grained sentiment understanding from LLMs into small language models\n(SLMs). We prompt LLMs to examine and interpret the sentiments of given reviews\nand then utilize the generated content to pretrain SLMs. Additionally, we\ndevelop a comprehensive FSA benchmark to evaluate both SLMs and LLMs. Extensive\nexperiments on this benchmark reveal that: (1) distillation significantly\nenhances the performance of SLMs in FSA tasks, achieving a 6.00\\% improvement\nin $F_1$-score, and the distilled model can outperform Llama-2-7b with only\n220M parameters; (2) distillation equips SLMs with excellent zero-shot\nsentiment classification capabilities, enabling them to match or even exceed\ntheir teacher models. These results suggest that distillation from LLMs is a\nhighly promising direction for FSA. We will release our code, data, and\npretrained model weights at\n\\url{https://github.com/HITSZ-HLT/FSA-Distillation}.", "paper_summary_zh": "細粒度情緒分析 (FSA) 旨在從大量的意見文本中提取和總結使用者的意見。最近的研究表明，大型語言模型 (LLM) 具有卓越的情緒理解能力。然而，直接部署 LLM 進行 FSA 應用會產生高昂的推論成本。因此，本文探討將 LLM 中的細粒度情緒理解蒸餾到小型語言模型 (SLM) 中。我們提示 LLM 檢查和詮釋給定評論的情緒，然後利用產生的內容預訓練 SLM。此外，我們開發了一個全面的 FSA 基準來評估 SLM 和 LLM。在這個基準上的廣泛實驗揭示：(1) 蒸餾顯著提升 SLM 在 FSA 任務中的表現，在 $F_1$-score 中提升 6.00%，而且蒸餾模型僅使用 220M 個參數就能超越 Llama-2-7b；(2) 蒸餾賦予 SLM 優異的零次學習情緒分類能力，使其能夠匹配甚至超越其教師模型。這些結果表明，從 LLM 進行蒸餾是 FSA 一個極具前景的方向。我們將在\n\\url{https://github.com/HITSZ-HLT/FSA-Distillation} 發布我們的程式碼、資料和預訓練模型權重。", "author": "Yice Zhang et.al.", "authors": "Yice Zhang, Guangyu Xie, Hongling Xu, Kaiheng Hou, Jianzhu Bao, Qianlong Wang, Shiwei Chen, Ruifeng Xu", "id": "2412.18552v1", "paper_url": "http://arxiv.org/abs/2412.18552v1", "repo": "https://github.com/hitsz-hlt/fsa-distillation"}}