{"2412.08195": {"publish_time": "2024-12-11", "title": "Semantic Scene Completion Based 3D Traversability Estimation for Off-Road Terrains", "paper_summary": "Off-road environments present significant challenges for autonomous ground\nvehicles due to the absence of structured roads and the presence of complex\nobstacles, such as uneven terrain, vegetation, and occlusions. Traditional\nperception algorithms, designed primarily for structured environments, often\nfail under these conditions, leading to inaccurate traversability estimations.\nIn this paper, ORDformer, a novel multimodal method that combines LiDAR point\nclouds with monocular images, is proposed to generate dense traversable\noccupancy predictions from a forward-facing perspective. By integrating\nmultimodal data, environmental feature extraction is enhanced, which is crucial\nfor accurate occupancy estimation in complex terrains. Furthermore, RELLIS-OCC,\na dataset with 3D traversable occupancy annotations, is introduced,\nincorporating geometric features such as step height, slope, and unevenness.\nThrough a comprehensive analysis of vehicle obstacle-crossing conditions and\nthe incorporation of vehicle body structure constraints, four traversability\ncost labels are generated: lethal, medium-cost, low-cost, and free.\nExperimental results demonstrate that ORDformer outperforms existing approaches\nin 3D traversable area recognition, particularly in off-road environments with\nirregular geometries and partial occlusions. Specifically, ORDformer achieves\nover a 20\\% improvement in scene completion IoU compared to other models. The\nproposed framework is scalable and adaptable to various vehicle platforms,\nallowing for adjustments to occupancy grid parameters and the integration of\nadvanced dynamic models for traversability cost estimation.", "paper_summary_zh": "越野環境由於缺乏結構化的道路，且存在不平坦的地形、植被和遮擋物等複雜障礙，因此對自主地面車輛構成重大挑戰。傳統的感知演算法主要設計用於結構化的環境，在這些條件下通常會失敗，導致無法精確估計可通行性。在本文中，提出了一種名為 ORDformer 的新多模式方法，它將 LiDAR 點雲與單目影像結合起來，從朝前的視角產生密集的可通行佔用預測。透過整合多模式資料，增強了環境特徵萃取，這對於在複雜地形中精確估計佔用率至關重要。此外，還引入了 RELLIS-OCC，這是一個具有 3D 可通行佔用標註的資料集，其中包含階梯高度、坡度和不平整度等幾何特徵。透過對車輛障礙物穿越條件進行全面分析，並結合車身結構約束，生成了四個可通行成本標籤：致命、中成本、低成本和自由。實驗結果表明，ORDformer 在 3D 可通行區域識別方面優於現有方法，特別是在具有不規則幾何形狀和部分遮擋物的越野環境中。具體而言，與其他模型相比，ORDformer 在場景完成 IoU 方面提高了 20% 以上。所提出的框架具有可擴充性和可適應性，適用於各種車輛平台，允許調整佔用率網格參數，並整合先進的動態模型以估計可通行成本。", "author": "Zitong Chen et.al.", "authors": "Zitong Chen, Chao Sun, Shida Nie, Chen Min, Changjiu Ning, Haoyu Li, Bo Wang", "id": "2412.08195v1", "paper_url": "http://arxiv.org/abs/2412.08195v1", "repo": "null"}}