{"2411.07529": {"publish_time": "2024-11-12", "title": "Evaluating ChatGPT-3.5 Efficiency in Solving Coding Problems of Different Complexity Levels: An Empirical Analysis", "paper_summary": "ChatGPT and other large language models (LLMs) promise to revolutionize\nsoftware development by automatically generating code from program\nspecifications. We assess the performance of ChatGPT's GPT-3.5-turbo model on\nLeetCode, a popular platform with algorithmic coding challenges for technical\ninterview practice, across three difficulty levels: easy, medium, and hard. We\ntest three main hypotheses. First, ChatGPT solves fewer problems as difficulty\nrises (Hypothesis 1). Second, prompt engineering improves ChatGPT's\nperformance, with greater gains on easier problems and diminishing returns on\nharder ones (Hypothesis 2). Third, ChatGPT performs better in popular languages\nlike Python, Java, and C++ than in less common ones like Elixir, Erlang, and\nRacket (Hypothesis 3). To investigate these hypotheses, we conduct automated\nexperiments using Python scripts to generate prompts that instruct ChatGPT to\ncreate Python solutions. These solutions are stored and manually submitted on\nLeetCode to check their correctness. For Hypothesis 1, results show the\nGPT-3.5-turbo model successfully solves 92% of easy, 79% of medium, and 51% of\nhard problems. For Hypothesis 2, prompt engineering yields improvements: 14-29%\nfor Chain of Thought Prompting, 38-60% by providing failed test cases in a\nsecond feedback prompt, and 33-58% by switching to GPT-4. From a random subset\nof problems ChatGPT solved in Python, it also solved 78% in Java, 50% in C++,\nand none in Elixir, Erlang, or Racket. These findings generally validate all\nthree hypotheses.", "paper_summary_zh": "ChatGPT 和其他大型语言模型 (LLM) 承诺通过根据程序规格自动生成代码来革新软件开发。我们评估了 ChatGPT 的 GPT-3.5-turbo 模型在 LeetCode 上的表现，这是一个流行的平台，提供算法编码挑战，用于技术面试实践，涵盖三个难度级别：简单、中等和困难。我们测试了三个主要假设。首先，随着难度的增加，ChatGPT 解决的问题更少（假设 1）。其次，提示工程提高了 ChatGPT 的性能，在较简单的题目上获得了更大的收益，而在较难的题目上收益递减（假设 2）。第三，ChatGPT 在 Python、Java 和 C++ 等流行语言中的表现优于在 Elixir、Erlang 和 Racket 等不太常见的语言中的表现（假设 3）。为了调查这些假设，我们使用 Python 脚本进行自动化实验，生成提示，指示 ChatGPT 创建 Python 解决方案。这些解决方案被存储并手动提交到 LeetCode 以检查其正确性。对于假设 1，结果显示 GPT-3.5-turbo 模型成功解决了 92% 的简单问题、79% 的中等问题和 51% 的困难问题。对于假设 2，提示工程产生了改进：思维链提示提高了 14-29%，在第二个反馈提示中提供了失败的测试用例提高了 38-60%，切换到 GPT-4 提高了 33-58%。从 ChatGPT 用 Python 解决的问题的随机子集中，它还用 Java 解决 78% 的问题，用 C++ 解决 50% 的问题，用 Elixir、Erlang 或 Racket 解决 0 个问题。这些发现总体上验证了所有三个假设。", "author": "Minda Li et.al.", "authors": "Minda Li, Bhaskar Krishnamachari", "id": "2411.07529v1", "paper_url": "http://arxiv.org/abs/2411.07529v1", "repo": "null"}}