{"2408.11492": {"publish_time": "2024-08-21", "title": "Estimating Peer Direct and Indirect Effects in Observational Network Data", "paper_summary": "Estimating causal effects is crucial for decision-makers in many\napplications, but it is particularly challenging with observational network\ndata due to peer interactions. Many algorithms have been proposed to estimate\ncausal effects involving network data, particularly peer effects, but they\noften overlook the variety of peer effects. To address this issue, we propose a\ngeneral setting which considers both peer direct effects and peer indirect\neffects, and the effect of an individual's own treatment, and provide\nidentification conditions of these causal effects and proofs. To estimate these\ncausal effects, we utilize attention mechanisms to distinguish the influences\nof different neighbors and explore high-order neighbor effects through\nmulti-layer graph neural networks (GNNs). Additionally, to control the\ndependency between node features and representations, we incorporate the\nHilbert-Schmidt Independence Criterion (HSIC) into the GNN, fully utilizing the\nstructural information of the graph, to enhance the robustness and accuracy of\nthe model. Extensive experiments on two semi-synthetic datasets confirm the\neffectiveness of our approach. Our theoretical findings have the potential to\nimprove intervention strategies in networked systems, with applications in\nareas such as social networks and epidemiology.", "paper_summary_zh": "在許多應用中，估計因果關係對於決策者至關重要，但由於同儕互動，在觀察網路資料中特別具有挑戰性。許多演算法已被提出用於估計涉及網路資料的因果關係，特別是同儕效應，但它們常常忽略同儕效應的多樣性。為了解決這個問題，我們提出一個通用的設定，同時考慮同儕直接效應和同儕間接效應，以及個人自身治療的效果，並提供這些因果關係和證明的識別條件。為了估計這些因果關係，我們利用注意力機制來區分不同鄰居的影響，並透過多層圖神經網路 (GNN) 探索高階鄰居效應。此外，為了控制節點特徵和表示之間的依賴性，我們將希爾伯特-施密特獨立準則 (HSIC) 納入 GNN 中，充分利用圖形的結構資訊，以增強模型的穩健性和準確性。在兩個半合成資料集上的大量實驗證實了我們方法的有效性。我們的理論發現有可能改善網路系統中的干預策略，其應用領域包括社交網路和流行病學等。", "author": "Xiaojing Du et.al.", "authors": "Xiaojing Du, Jiuyong Li, Debo Cheng, Lin Liu, Wentao Gao, Xiongren Chen", "id": "2408.11492v1", "paper_url": "http://arxiv.org/abs/2408.11492v1", "repo": "null"}}