{"2405.18369": {"publish_time": "2024-05-28", "title": "PromptWizard: Task-Aware Agent-driven Prompt Optimization Framework", "paper_summary": "Large language models (LLMs) have revolutionized AI across diverse domains,\nshowcasing remarkable capabilities. Central to their success is the concept of\nprompting, which guides model output generation. However, manual prompt\nengineering is labor-intensive and domain-specific, necessitating automated\nsolutions. This paper introduces PromptWizard, a novel framework leveraging\nLLMs to iteratively synthesize and refine prompts tailored to specific tasks.\nUnlike existing approaches, PromptWizard optimizes both prompt instructions and\nin-context examples, maximizing model performance. The framework iteratively\nrefines prompts by mutating instructions and incorporating negative examples to\ndeepen understanding and ensure diversity. It further enhances both\ninstructions and examples with the aid of a critic, synthesizing new\ninstructions and examples enriched with detailed reasoning steps for optimal\nperformance. PromptWizard offers several key features and capabilities,\nincluding computational efficiency compared to state-of-the-art approaches,\nadaptability to scenarios with varying amounts of training data, and\neffectiveness with smaller LLMs. Rigorous evaluation across 35 tasks on 8\ndatasets demonstrates PromptWizard's superiority over existing prompt\nstrategies, showcasing its efficacy and scalability in prompt optimization.", "paper_summary_zh": "大型語言模型 (LLM) 在各種領域徹底革新了 AI，展現出非凡的能力。它們成功的核心在於提示的概念，這引導了模型輸出生成。然而，手動提示工程需要大量人力且特定於領域，因此需要自動化解決方案。本文介紹了 PromptWizard，這是一個新穎的框架，利用 LLM 迭代合成和精煉針對特定任務量身定制的提示。與現有方法不同，PromptWizard 同時最佳化提示說明和情境範例，最大化模型效能。該框架透過變異說明並納入負面範例來迭代精煉提示，以加深理解並確保多樣性。它進一步透過批評者的協助來增強說明和範例，合成新的說明和範例，並加入詳細的推理步驟以獲得最佳效能。PromptWizard 提供了幾個關鍵功能，包括與最先進的方法相比的運算效率、適應具有不同訓練資料量的情境，以及使用較小的 LLM 的有效性。在 8 個資料集上的 35 個任務中進行的嚴格評估證明了 PromptWizard 優於現有的提示策略，展示了其在提示最佳化中的功效和可擴充性。", "author": "Eshaan Agarwal et.al.", "authors": "Eshaan Agarwal, Vivek Dani, Tanuja Ganu, Akshay Nambi", "id": "2405.18369v1", "paper_url": "http://arxiv.org/abs/2405.18369v1", "repo": "null"}}