{"2502.14529": {"publish_time": "2025-02-20", "title": "CORBA: Contagious Recursive Blocking Attacks on Multi-Agent Systems Based on Large Language Models", "paper_summary": "Large Language Model-based Multi-Agent Systems (LLM-MASs) have demonstrated\nremarkable real-world capabilities, effectively collaborating to complete\ncomplex tasks. While these systems are designed with safety mechanisms, such as\nrejecting harmful instructions through alignment, their security remains\nlargely unexplored. This gap leaves LLM-MASs vulnerable to targeted\ndisruptions. In this paper, we introduce Contagious Recursive Blocking Attacks\n(Corba), a novel and simple yet highly effective attack that disrupts\ninteractions between agents within an LLM-MAS. Corba leverages two key\nproperties: its contagious nature allows it to propagate across arbitrary\nnetwork topologies, while its recursive property enables sustained depletion of\ncomputational resources. Notably, these blocking attacks often involve\nseemingly benign instructions, making them particularly challenging to mitigate\nusing conventional alignment methods. We evaluate Corba on two widely-used\nLLM-MASs, namely, AutoGen and Camel across various topologies and commercial\nmodels. Additionally, we conduct more extensive experiments in open-ended\ninteractive LLM-MASs, demonstrating the effectiveness of Corba in complex\ntopology structures and open-source models. Our code is available at:\nhttps://github.com/zhrli324/Corba.", "paper_summary_zh": "基於大型語言模型的多主體系統（LLM-MAS）已展現出卓越的真實世界能力，有效地協作以完成複雜任務。儘管這些系統設計有安全機制，例如透過對齊拒絕有害指令，但其安全性仍未得到充分探討。此一缺口讓 LLM-MAS 易受針對性的破壞。在本文中，我們介紹了傳染性遞迴封鎖攻擊（Corba），這是一種新穎且簡單但極為有效的攻擊，會破壞 LLM-MAS 中主體之間的互動。Corba 利用了兩個關鍵特性：其傳染性使其能夠在任意網路拓撲中傳播，而其遞迴特性則能持續耗盡運算資源。值得注意的是，這些封鎖攻擊通常涉及看似良性的指令，這使得使用傳統對齊方法來減輕攻擊特別具有挑戰性。我們在兩個廣泛使用的 LLM-MAS，即 AutoGen 和 Camel 上評估了 Corba，涵蓋了各種拓撲和商業模型。此外，我們在開放式互動 LLM-MAS 中進行了更廣泛的實驗，證明了 Corba 在複雜拓撲結構和開源模型中的有效性。我們的程式碼可在以下網址取得：https://github.com/zhrli324/Corba。", "author": "Zhenhong Zhou et.al.", "authors": "Zhenhong Zhou, Zherui Li, Jie Zhang, Yuanhe Zhang, Kun Wang, Yang Liu, Qing Guo", "id": "2502.14529v1", "paper_url": "http://arxiv.org/abs/2502.14529v1", "repo": "null"}}