{"2412.15822": {"publish_time": "2024-12-20", "title": "S$^2$DN: Learning to Denoise Unconvincing Knowledge for Inductive Knowledge Graph Completion", "paper_summary": "Inductive Knowledge Graph Completion (KGC) aims to infer missing facts\nbetween newly emerged entities within knowledge graphs (KGs), posing a\nsignificant challenge. While recent studies have shown promising results in\ninferring such entities through knowledge subgraph reasoning, they suffer from\n(i) the semantic inconsistencies of similar relations, and (ii) noisy\ninteractions inherent in KGs due to the presence of unconvincing knowledge for\nemerging entities. To address these challenges, we propose a Semantic\nStructure-aware Denoising Network (S$^2$DN) for inductive KGC. Our goal is to\nlearn adaptable general semantics and reliable structures to distill consistent\nsemantic knowledge while preserving reliable interactions within KGs.\nSpecifically, we introduce a semantic smoothing module over the enclosing\nsubgraphs to retain the universal semantic knowledge of relations. We\nincorporate a structure refining module to filter out unreliable interactions\nand offer additional knowledge, retaining robust structure surrounding target\nlinks. Extensive experiments conducted on three benchmark KGs demonstrate that\nS$^2$DN surpasses the performance of state-of-the-art models. These results\ndemonstrate the effectiveness of S$^2$DN in preserving semantic consistency and\nenhancing the robustness of filtering out unreliable interactions in\ncontaminated KGs.", "paper_summary_zh": "歸納知識圖譜完成功能（KGC）旨在推論知識圖譜（KG）中新出現實體之間的遺失事實，這是一個重大的挑戰。雖然最近的研究表明通過知識子圖推理推論此類實體的結果很有希望，但它們存在（i）相似關係的語義不一致，以及（ii）由於存在針對新興實體的不可信知識，因此 KG 中固有的雜訊交互。為了應對這些挑戰，我們提出了用於歸納 KGC 的語義結構感知去噪網路（S$^2$DN）。我們的目標是學習適應性的通用語義和可靠的結構，以在保留 KG 內部可靠交互的同時提取一致的語義知識。具體來說，我們在封閉子圖上引入了一個語義平滑模組，以保留關係的通用語義知識。我們整合了一個結構精煉模組，以過濾掉不可靠的交互並提供額外的知識，從而保留目標鏈接周圍的強健結構。在三個基準 KG 上進行的廣泛實驗表明 S$^2$DN 超越了最先進模型的效能。這些結果證明了 S$^2$DN 在保留語義一致性和增強過濾受污染 KG 中不可靠交互的穩健性方面的有效性。", "author": "Tengfei Ma et.al.", "authors": "Tengfei Ma, Yujie Chen, Liang Wang, Xuan Lin, Bosheng Song, Xiangxiang Zeng", "id": "2412.15822v1", "paper_url": "http://arxiv.org/abs/2412.15822v1", "repo": "null"}}