{"2406.19690": {"publish_time": "2024-06-28", "title": "Deep Fusion Model for Brain Tumor Classification Using Fine-Grained Gradient Preservation", "paper_summary": "Brain tumors are one of the most common diseases that lead to early death if\nnot diagnosed at an early stage. Traditional diagnostic approaches are\nextremely time-consuming and prone to errors. In this context, computer\nvision-based approaches have emerged as an effective tool for accurate brain\ntumor classification. While some of the existing solutions demonstrate\nnoteworthy accuracy, the models become infeasible to deploy in areas where\ncomputational resources are limited. This research addresses the need for\naccurate and fast classification of brain tumors with a priority of deploying\nthe model in technologically underdeveloped regions. The research presents a\nnovel architecture for precise brain tumor classification fusing pretrained\nResNet152V2 and modified VGG16 models. The proposed architecture undergoes a\ndiligent fine-tuning process that ensures fine gradients are preserved in deep\nneural networks, which are essential for effective brain tumor classification.\nThe proposed solution incorporates various image processing techniques to\nimprove image quality and achieves an astounding accuracy of 98.36% and 98.04%\nin Figshare and Kaggle datasets respectively. This architecture stands out for\nhaving a streamlined profile, with only 2.8 million trainable parameters. We\nhave leveraged 8-bit quantization to produce a model of size 73.881 MB,\nsignificantly reducing it from the previous size of 289.45 MB, ensuring smooth\ndeployment in edge devices even in resource-constrained areas. Additionally,\nthe use of Grad-CAM improves the interpretability of the model, offering\ninsightful information regarding its decision-making process. Owing to its high\ndiscriminative ability, this model can be a reliable option for accurate brain\ntumor classification.", "paper_summary_zh": "腦瘤是最常見的疾病之一，如果沒有在早期診斷出來，可能會導致早逝。傳統的診斷方法極為耗時且容易出錯。在此背景下，基於電腦視覺的方法已成為準確分類腦瘤的有效工具。雖然一些現有的解決方案展示出顯著的準確性，但這些模型在計算資源有限的地區部署起來變得不可行。本研究解決了準確快速分類腦瘤的需求，優先在技術落後的地區部署模型。本研究提出了一種新穎的架構，用於精確分類腦瘤，融合預訓練的 ResNet152V2 和修改後的 VGG16 模型。所提出的架構經過了勤奮的微調過程，確保在深度神經網路中保留精細的梯度，這對於有效的腦瘤分類至關重要。所提出的解決方案結合了各種影像處理技術來改善影像品質，並分別在 Figshare 和 Kaggle 資料集中達到了驚人的 98.36% 和 98.04% 的準確度。此架構的特點是簡化的特徵，只有 280 萬個可訓練參數。我們利用 8 位元量化產生大小為 73.881 MB 的模型，從先前的 289.45 MB 大小顯著減少，確保即使在資源受限的地區也能順利部署於邊緣裝置。此外，使用 Grad-CAM 提高了模型的可解釋性，提供了關於其決策過程的見解資訊。由於其高度的判別能力，此模型可以成為準確分類腦瘤的可靠選項。", "author": "Niful Islam et.al.", "authors": "Niful Islam, Mohaiminul Islam Bhuiyan, Jarin Tasnim Raya, Nur Shazwani Kamarudin, Khan Md Hasib, M. F. Mridha, Dewan Md. Farid", "id": "2406.19690v1", "paper_url": "http://arxiv.org/abs/2406.19690v1", "repo": "null"}}