{"2405.07527": {"publish_time": "2024-05-13", "title": "Train Faster, Perform Better: Modular Adaptive Training in Over-Parameterized Models", "paper_summary": "Despite their prevalence in deep-learning communities, over-parameterized\nmodels convey high demands of computational costs for proper training. This\nwork studies the fine-grained, modular-level learning dynamics of\nover-parameterized models to attain a more efficient and fruitful training\nstrategy. Empirical evidence reveals that when scaling down into network\nmodules, such as heads in self-attention models, we can observe varying\nlearning patterns implicitly associated with each module's trainability. To\ndescribe such modular-level learning capabilities, we introduce a novel concept\ndubbed modular neural tangent kernel (mNTK), and we demonstrate that the\nquality of a module's learning is tightly associated with its mNTK's principal\neigenvalue $\\lambda_{\\max}$. A large $\\lambda_{\\max}$ indicates that the module\nlearns features with better convergence, while those miniature ones may impact\ngeneralization negatively. Inspired by the discovery, we propose a novel\ntraining strategy termed Modular Adaptive Training (MAT) to update those\nmodules with their $\\lambda_{\\max}$ exceeding a dynamic threshold selectively,\nconcentrating the model on learning common features and ignoring those\ninconsistent ones. Unlike most existing training schemes with a complete BP\ncycle across all network modules, MAT can significantly save computations by\nits partially-updating strategy and can further improve performance.\nExperiments show that MAT nearly halves the computational cost of model\ntraining and outperforms the accuracy of baselines.", "paper_summary_zh": "儘管在深度學習社群中很普遍，但過度參數化的模型對適當訓練提出了高計算成本需求。這項研究探討過度參數化模型的細粒度、模組層級學習動態，以達成更有效率且有成效的訓練策略。實證證據顯示，當縮小到網路模組（例如自注意力模型中的 heads）時，我們可以觀察到與每個模組的可訓練性隱含關聯的不同學習模式。為了描述這種模組層級學習能力，我們引進一個新概念，稱為模組神經切線核（mNTK），並證明模組學習品質與其 mNTK 的主特徵值 $\\lambda_{\\max}$ 緊密相關。大的 $\\lambda_{\\max}$ 表示模組學習具有較佳收斂性的特徵，而那些微小的特徵可能會對泛化產生負面影響。受到這個發現的啟發，我們提出一個新訓練策略，稱為模組適應訓練（MAT），以選擇性地更新那些 $\\lambda_{\\max}$ 超過動態閾值的模組，將模型集中在學習常見特徵上，並忽略那些不一致的特徵。與大多數現有訓練方案在所有網路模組中進行完整 BP 循環不同，MAT 可以透過其部分更新策略大幅節省運算，並進一步提升效能。實驗顯示，MAT 幾乎將模型訓練的計算成本減半，並優於基準的準確度。", "author": "Yubin Shi et.al.", "authors": "Yubin Shi, Yixuan Chen, Mingzhi Dong, Xiaochen Yang, Dongsheng Li, Yujiang Wang, Robert P. Dick, Qin Lv, Yingying Zhao, Fan Yang, Tun Lu, Ning Gu, Li Shang", "id": "2405.07527v1", "paper_url": "http://arxiv.org/abs/2405.07527v1", "repo": "null"}}