{"2410.22118": {"publish_time": "2024-10-29", "title": "The Impact of Inference Acceleration Strategies on Bias of LLMs", "paper_summary": "Last few years have seen unprecedented advances in capabilities of Large\nLanguage Models (LLMs). These advancements promise to deeply benefit a vast\narray of application domains. However, due to their immense size, performing\ninference with LLMs is both costly and slow. Consequently, a plethora of recent\nwork has proposed strategies to enhance inference efficiency, e.g.,\nquantization, pruning, and caching. These acceleration strategies reduce the\ninference cost and latency, often by several factors, while maintaining much of\nthe predictive performance measured via common benchmarks. In this work, we\nexplore another critical aspect of LLM performance: demographic bias in model\ngenerations due to inference acceleration optimizations. Using a wide range of\nmetrics, we probe bias in model outputs from a number of angles. Analysis of\noutputs before and after inference acceleration shows significant change in\nbias. Worryingly, these bias effects are complex and unpredictable. A\ncombination of an acceleration strategy and bias type may show little bias\nchange in one model but may lead to a large effect in another. Our results\nhighlight a need for in-depth and case-by-case evaluation of model bias after\nit has been modified to accelerate inference.", "paper_summary_zh": "在過去幾年中，大型語言模型 (LLM) 的功能有了前所未有的進步。這些進步有望極大地惠及廣泛的應用領域。然而，由於其規模龐大，使用 LLM 執行推理既昂貴又緩慢。因此，大量的近期工作提出了提高推理效率的策略，例如量化、修剪和快取。這些加速策略降低了推理成本和延遲，通常降低了幾個因素，同時通過常見基準測量來維持大部分預測性能。在這項工作中，我們探討了 LLM 性能的另一個關鍵方面：由於推理加速優化而導致模型生成中的人口統計偏差。使用廣泛的指標，我們從多個角度探討模型輸出的偏差。對推理加速前後的輸出進行分析，顯示偏差發生了顯著變化。令人擔憂的是，這些偏差效應複雜且不可預測。加速策略和偏差類型的組合可能在一個模型中顯示出很小的偏差變化，但在另一個模型中可能導致很大的影響。我們的結果強調了在修改模型以加速推理後，需要對模型偏差進行深入和逐案評估。", "author": "Elisabeth Kirsten et.al.", "authors": "Elisabeth Kirsten, Ivan Habernal, Vedant Nanda, Muhammad Bilal Zafar", "id": "2410.22118v1", "paper_url": "http://arxiv.org/abs/2410.22118v1", "repo": "null"}}