{"2405.14715": {"publish_time": "2024-05-23", "title": "Towards Cross-modal Backward-compatible Representation Learning for Vision-Language Models", "paper_summary": "Modern retrieval systems often struggle with upgrading to new and more\npowerful models due to the incompatibility of embeddings between the old and\nnew models. This necessitates a costly process known as backfilling, which\ninvolves re-computing the embeddings for a large number of data samples. In\nvision, Backward-compatible Training (BT) has been proposed to ensure that the\nnew model aligns with the old model's embeddings. This paper extends the\nconcept of vision-only BT to the field of cross-modal retrieval, marking the\nfirst attempt to address Cross-modal BT (XBT). Our goal is to achieve\nbackward-compatibility between Vision-Language Pretraining (VLP) models, such\nas CLIP, for the cross-modal retrieval task. To address XBT challenges, we\npropose an efficient solution: a projection module that maps the new model's\nembeddings to those of the old model. This module, pretrained solely with text\ndata, significantly reduces the number of image-text pairs required for XBT\nlearning, and, once it is pretrained, it avoids using the old model during\ntraining. Furthermore, we utilize parameter-efficient training strategies that\nimprove efficiency and preserve the off-the-shelf new model's knowledge by\navoiding any modifications. Experimental results on cross-modal retrieval\ndatasets demonstrate the effectiveness of XBT and its potential to enable\nbackfill-free upgrades when a new VLP model emerges.", "paper_summary_zh": "現代檢索系統常因舊模型與新模型的嵌入式不符，而難以升級至更新且功能更強大的模型。這需要一個名為回填的昂貴程序，其中涉及重新計算大量數據樣本的嵌入式。在視覺上，已提出向後相容訓練 (BT) 以確保新模型與舊模型的嵌入式對齊。本文將視覺專用 BT 的概念延伸至跨模態檢索領域，標誌著首次嘗試解決跨模態 BT (XBT)。我們的目標是達成視覺語言預訓練 (VLP) 模型（例如 CLIP）之間的向後相容性，以進行跨模態檢索任務。為了解決 XBT 挑戰，我們提出了一個有效的解決方案：一個投影模組，將新模型的嵌入式對應至舊模型的嵌入式。此模組僅使用文字資料預先訓練，大幅減少 XBT 學習所需的影像文字配對數量，且預先訓練後，在訓練期間便不再使用舊模型。此外，我們利用參數有效訓練策略來提升效率並保留現成的全新模型知識，藉由避免任何修改。跨模態檢索資料集上的實驗結果證明了 XBT 的有效性，以及當新的 VLP 模型出現時，它能進行無回填升級的潛力。", "author": "Young Kyun Jang et.al.", "authors": "Young Kyun Jang, Ser-nam Lim", "id": "2405.14715v1", "paper_url": "http://arxiv.org/abs/2405.14715v1", "repo": "null"}}