{"2501.14399": {"publish_time": "2025-01-24", "title": "Handling Heterophily in Recommender Systems with Wavelet Hypergraph Diffusion", "paper_summary": "Recommender systems are pivotal in delivering personalised user experiences\nacross various domains. However, capturing the heterophily patterns and the\nmulti-dimensional nature of user-item interactions poses significant\nchallenges. To address this, we introduce FWHDNN (Fusion-based Wavelet\nHypergraph Diffusion Neural Networks), an innovative framework aimed at\nadvancing representation learning in hypergraph-based recommendation tasks. The\nmodel incorporates three key components: (1) a cross-difference relation\nencoder leveraging heterophily-aware hypergraph diffusion to adapt\nmessage-passing for diverse class labels, (2) a multi-level cluster-wise\nencoder employing wavelet transform-based hypergraph neural network layers to\ncapture multi-scale topological relationships, and (3) an integrated\nmulti-modal fusion mechanism that combines structural and textual information\nthrough intermediate and late-fusion strategies. Extensive experiments on\nreal-world datasets demonstrate that FWHDNN surpasses state-of-the-art methods\nin accuracy, robustness, and scalability in capturing high-order\ninterconnections between users and items.", "paper_summary_zh": "推薦系統在提供個人化使用者體驗方面至關重要，橫跨各種領域。然而，捕捉異質性模式和使用者與項目互動的多維本質會造成重大的挑戰。為了解決這個問題，我們引進了 FWHDNN（基於融合的波形超圖擴散神經網路），這是一個創新的架構，旨在推動超圖推薦任務中的表徵學習。這個模型包含了三個關鍵組成部分：(1) 跨差異關係編碼器，利用異質性感知超圖擴散來調整訊息傳遞以適應不同的類別標籤，(2) 多層級叢集編碼器，採用基於小波轉換的超圖神經網路層，以捕捉多尺度拓撲關係，以及 (3) 整合多模式融合機制，透過中間融合和後期融合策略，結合結構化和文字資訊。在真實世界資料集上進行的廣泛實驗證明，FWHDNN 在捕捉使用者和項目之間的高階互連方面，超越了最先進的方法，在準確性、穩健性和可擴充性上都有所提升。", "author": "Darnbi Sakong et.al.", "authors": "Darnbi Sakong, Thanh Tam Nguyen", "id": "2501.14399v1", "paper_url": "http://arxiv.org/abs/2501.14399v1", "repo": "null"}}