{"2409.04142": {"publish_time": "2024-09-06", "title": "Context is the Key: Backdoor Attacks for In-Context Learning with Vision Transformers", "paper_summary": "Due to the high cost of training, large model (LM) practitioners commonly use\npretrained models downloaded from untrusted sources, which could lead to owning\ncompromised models. In-context learning is the ability of LMs to perform\nmultiple tasks depending on the prompt or context. This can enable new attacks,\nsuch as backdoor attacks with dynamic behavior depending on how models are\nprompted.\n  In this paper, we leverage the ability of vision transformers (ViTs) to\nperform different tasks depending on the prompts. Then, through data poisoning,\nwe investigate two new threats: i) task-specific backdoors where the attacker\nchooses a target task to attack, and only the selected task is compromised at\ntest time under the presence of the trigger. At the same time, any other task\nis not affected, even if prompted with the trigger. We succeeded in attacking\nevery tested model, achieving up to 89.90\\% degradation on the target task. ii)\nWe generalize the attack, allowing the backdoor to affect \\emph{any} task, even\ntasks unseen during the training phase. Our attack was successful on every\ntested model, achieving a maximum of $13\\times$ degradation. Finally, we\ninvestigate the robustness of prompts and fine-tuning as techniques for\nremoving the backdoors from the model. We found that these methods fall short\nand, in the best case, reduce the degradation from 89.90\\% to 73.46\\%.", "paper_summary_zh": "由於訓練成本高，大型模型 (LM) 的從業者通常會使用從不可信來源下載的預訓練模型，這可能導致擁有受損的模型。情境學習是 LM 根據提示或情境執行多項任務的能力。這可能會導致新的攻擊，例如根據模型提示方式而具有動態行為的後門攻擊。\n在本文中，我們利用視覺Transformer (ViT) 根據提示執行不同任務的能力。然後，透過資料中毒，我們調查兩種新的威脅：i) 任務特定的後門，攻擊者選擇要攻擊的目標任務，並且在觸發器存在下，只有所選的任務在測試時受到損害。同時，任何其他任務都不受影響，即使提示了觸發器。我們成功攻擊了每個受測模型，在目標任務上實現了高達 89.90% 的降解。ii) 我們概括攻擊，允許後門影響任何任務，即使是在訓練階段中未見過的任務。我們的攻擊對每個受測模型都成功，實現了最高 $13\\times$ 的降解。最後，我們調查了提示和微調作為從模型中移除後門的技術的穩健性。我們發現這些方法不足，並且在最好的情況下，將降解從 89.90% 降低到 73.46%。", "author": "Gorka Abad et.al.", "authors": "Gorka Abad, Stjepan Picek, Lorenzo Cavallaro, Aitor Urbieta", "id": "2409.04142v1", "paper_url": "http://arxiv.org/abs/2409.04142v1", "repo": "null"}}