{"2501.14012": {"publish_time": "2025-01-23", "title": "Transfer Learning of Surrogate Models via Domain Affine Transformation Across Synthetic and Real-World Benchmarks", "paper_summary": "Surrogate models are frequently employed as efficient substitutes for the\ncostly execution of real-world processes. However, constructing a high-quality\nsurrogate model often demands extensive data acquisition. A solution to this\nissue is to transfer pre-trained surrogate models for new tasks, provided that\ncertain invariances exist between tasks. This study focuses on transferring\nnon-differentiable surrogate models (e.g., random forest) from a source\nfunction to a target function, where we assume their domains are related by an\nunknown affine transformation, using only a limited amount of transfer data\npoints evaluated on the target. Previous research attempts to tackle this\nchallenge for differentiable models, e.g., Gaussian process regression, which\nminimizes the empirical loss on the transfer data by tuning the affine\ntransformations. In this paper, we extend the previous work to the random\nforest model and assess its effectiveness on a widely-used artificial problem\nset - Black-Box Optimization Benchmark (BBOB) testbed, and on four real-world\ntransfer learning problems. The results highlight the significant practical\nadvantages of the proposed method, particularly in reducing both the data\nrequirements and computational costs of training surrogate models for complex\nreal-world scenarios.", "paper_summary_zh": "代理模型經常被用作真實世界過程中昂貴執行的高效替代品。然而，構建一個高品質的代理模型通常需要廣泛的數據採集。這個問題的解決方案是轉移預先訓練好的代理模型以執行新任務，前提是任務之間存在某些不變性。本研究重點在於從源函數轉移不可微分的代理模型（例如，隨機森林）到目標函數，其中我們假設它們的域由未知的仿射轉換相關聯，僅使用在目標上評估的有限數量的轉移數據點。先前的研究嘗試解決可微分模型的這個挑戰，例如，高斯過程回歸，它通過調整仿射轉換來最小化轉移數據的經驗損失。在本文中，我們將先前的研究延伸到隨機森林模型，並評估其在廣泛使用的人工問題集 - 黑盒最佳化基準 (BBOB) 測試平台以及四個真實世界的轉移學習問題上的有效性。結果突出了所提出方法的顯著實用優勢，特別是在減少複雜現實世界場景中訓練代理模型的數據需求和計算成本方面。", "author": "Shuaiqun Pan et.al.", "authors": "Shuaiqun Pan, Diederick Vermetten, Manuel López-Ibáñez, Thomas Bäck, Hao Wang", "id": "2501.14012v1", "paper_url": "http://arxiv.org/abs/2501.14012v1", "repo": "null"}}