{"2503.07587": {"publish_time": "2025-03-10", "title": "Robusto-1 Dataset: Comparing Humans and VLMs on real out-of-distribution Autonomous Driving VQA from Peru", "paper_summary": "As multimodal foundational models start being deployed experimentally in\nSelf-Driving cars, a reasonable question we ask ourselves is how similar to\nhumans do these systems respond in certain driving situations -- especially\nthose that are out-of-distribution? To study this, we create the Robusto-1\ndataset that uses dashcam video data from Peru, a country with one of the worst\n(aggressive) drivers in the world, a high traffic index, and a high ratio of\nbizarre to non-bizarre street objects likely never seen in training. In\nparticular, to preliminarly test at a cognitive level how well Foundational\nVisual Language Models (VLMs) compare to Humans in Driving, we move away from\nbounding boxes, segmentation maps, occupancy maps or trajectory estimation to\nmulti-modal Visual Question Answering (VQA) comparing both humans and machines\nthrough a popular method in systems neuroscience known as Representational\nSimilarity Analysis (RSA). Depending on the type of questions we ask and the\nanswers these systems give, we will show in what cases do VLMs and Humans\nconverge or diverge allowing us to probe on their cognitive alignment. We find\nthat the degree of alignment varies significantly depending on the type of\nquestions asked to each type of system (Humans vs VLMs), highlighting a gap in\ntheir alignment.", "paper_summary_zh": "隨著多模態基礎模型開始在自動駕駛汽車中進行實驗性部署，我們不禁要問自己一個合理的問題：這些系統在某些駕駛情況下（尤其是在超出分佈範圍的情況下）的反應與人類有多相似？為了研究這個問題，我們創建了 Robusto-1 數據集，該數據集使用來自秘魯的行車記錄儀視頻數據。秘魯是世界上駕駛最糟糕（侵略性）的國家之一，交通擁堵指數高，而且奇異與非奇異街道物體的比例很高，這些物體在訓練中可能從未見過。特別是，為了在認知層面上初步測試基礎視覺語言模型 (VLM) 與人類在駕駛方面的比較，我們不再使用邊界框、分割圖、佔用圖或軌跡估計，而是使用多模態視覺問答 (VQA)，並通過系統神經科學中一種流行的方法（稱為表徵相似性分析 (RSA)）來比較人類和機器。根據我們提出的問題類型以及這些系統給出的答案，我們將展示 VLM 和人類在哪些情況下會趨同或趨異，從而使我們能夠探究它們的認知一致性。我們發現，一致性程度會因向每種類型系統（人類與 VLM）提出的問題類型而異，這突顯了它們一致性方面的差距。\n", "author": "Dunant Cusipuma et.al.", "authors": "Dunant Cusipuma, David Ortega, Victor Flores-Benites, Arturo Deza", "id": "2503.07587v1", "paper_url": "http://arxiv.org/abs/2503.07587v1", "repo": "null"}}