{"2409.11579": {"publish_time": "2024-09-17", "title": "HEARTS: A Holistic Framework for Explainable, Sustainable and Robust Text Stereotype Detection", "paper_summary": "Stereotypes are generalised assumptions about societal groups, and even\nstate-of-the-art LLMs using in-context learning struggle to identify them\naccurately. Due to the subjective nature of stereotypes, where what constitutes\na stereotype can vary widely depending on cultural, social, and individual\nperspectives, robust explainability is crucial. Explainable models ensure that\nthese nuanced judgments can be understood and validated by human users,\npromoting trust and accountability. We address these challenges by introducing\nHEARTS (Holistic Framework for Explainable, Sustainable, and Robust Text\nStereotype Detection), a framework that enhances model performance, minimises\ncarbon footprint, and provides transparent, interpretable explanations. We\nestablish the Expanded Multi-Grain Stereotype Dataset (EMGSD), comprising\n57,201 labeled texts across six groups, including under-represented\ndemographics like LGBTQ+ and regional stereotypes. Ablation studies confirm\nthat BERT models fine-tuned on EMGSD outperform those trained on individual\ncomponents. We then analyse a fine-tuned, carbon-efficient ALBERT-V2 model\nusing SHAP to generate token-level importance values, ensuring alignment with\nhuman understanding, and calculate explainability confidence scores by\ncomparing SHAP and LIME outputs. Finally, HEARTS is applied to assess\nstereotypical bias in 12 LLM outputs, revealing a gradual reduction in bias\nover time within model families.", "paper_summary_zh": "刻板印象是对社会群体的概括性假设，即使是使用情境学习的最新 LLM 也难以准确识别它们。由于刻板印象的主观性，根据文化、社会和个人的观点，构成刻板印象的内容可能差异很大，因此，稳健的可解释性至关重要。可解释模型确保人类用户可以理解和验证这些细微的判断，从而促进信任和问责制。我们通过引入 HEARTS（可解释、可持续和稳健文本刻板印象检测的整体框架）来应对这些挑战，该框架增强了模型性能，最大程度地减少了碳足迹，并提供了透明、可解释的解释。我们建立了扩展的多粒度刻板印象数据集 (EMGSD)，其中包含 57,201 个跨六个组的标记文本，包括 LGBTQ+ 和区域刻板印象等代表性不足的人口统计数据。消融研究证实，在 EMGSD 上微调的 BERT 模型优于在各个组件上训练的模型。然后，我们使用 SHAP 分析经过微调的、碳效率高的 ALBERT-V2 模型，以生成令牌级重要性值，确保与人类理解保持一致，并通过比较 SHAP 和 LIME 输出计算可解释性置信度分数。最后，HEARTS 用于评估 12 个 LLM 输出中的刻板印象偏差，揭示了模型系列中随着时间的推移偏差逐渐减少。", "author": "Theo King et.al.", "authors": "Theo King, Zekun Wu, Adriano Koshiyama, Emre Kazim, Philip Treleaven", "id": "2409.11579v1", "paper_url": "http://arxiv.org/abs/2409.11579v1", "repo": "null"}}