{"2410.10481": {"publish_time": "2024-10-14", "title": "Model-Based Differentially Private Knowledge Transfer for Large Language Models", "paper_summary": "As large language models (LLMs) become increasingly prevalent in web\nservices, effectively leveraging domain-specific knowledge while ensuring\nprivacy has become critical. Existing methods, such as retrieval-augmented\ngeneration (RAG) and differentially private data synthesis, often compromise\neither the utility of domain knowledge or the privacy of sensitive data,\nlimiting their applicability in specialized domains. To address these\nchallenges, we propose \\textit{Llamdex}, a novel framework that integrates\nprivacy-preserving, domain-specific models into LLMs. Our approach\nsignificantly enhances the accuracy of domain-specific tasks, achieving up to a\n26\\% improvement compared to existing methods under the same differential\nprivacy constraints. Experimental results show that Llamdex not only improves\nthe accuracy of LLM responses but also maintains comparable inference\nefficiency to the original LLM, highlighting its potential for real-world\napplications.", "paper_summary_zh": "随着大型语言模型 (LLM) 在网络服务中变得越来越普遍，有效地利用特定领域的知识，同时确保隐私已变得至关重要。现有的方法，例如检索增强生成 (RAG) 和差异化隐私数据合成，通常会损害领域知识的效用或敏感数据的隐私，从而限制它们在特定领域的适用性。为了应对这些挑战，我们提出了 \\textit{Llamdex}，这是一个将隐私保护的特定领域模型集成到 LLM 中的新框架。我们的方法显着提高了特定领域任务的准确性，与在相同差异隐私约束下的现有方法相比，提高了 26%。实验结果表明，Llamdex 不仅提高了 LLM 响应的准确性，而且还保持了与原始 LLM 相当的推理效率，突出了其在现实世界应用中的潜力。", "author": "Zhaomin Wu et.al.", "authors": "Zhaomin Wu, Jizhou Guo, Junyi Hou, Bingsheng He, Lixin Fan, Qiang Yang", "id": "2410.10481v1", "paper_url": "http://arxiv.org/abs/2410.10481v1", "repo": "null"}}