{"2407.16564": {"publish_time": "2024-07-23", "title": "Audio Prompt Adapter: Unleashing Music Editing Abilities for Text-to-Music with Lightweight Finetuning", "paper_summary": "Text-to-music models allow users to generate nearly realistic musical audio\nwith textual commands. However, editing music audios remains challenging due to\nthe conflicting desiderata of performing fine-grained alterations on the audio\nwhile maintaining a simple user interface. To address this challenge, we\npropose Audio Prompt Adapter (or AP-Adapter), a lightweight addition to\npretrained text-to-music models. We utilize AudioMAE to extract features from\nthe input audio, and construct attention-based adapters to feedthese features\ninto the internal layers of AudioLDM2, a diffusion-based text-to-music model.\nWith 22M trainable parameters, AP-Adapter empowers users to harness both global\n(e.g., genre and timbre) and local (e.g., melody) aspects of music, using the\noriginal audio and a short text as inputs. Through objective and subjective\nstudies, we evaluate AP-Adapter on three tasks: timbre transfer, genre\ntransfer, and accompaniment generation. Additionally, we demonstrate its\neffectiveness on out-of-domain audios containing unseen instruments during\ntraining.", "paper_summary_zh": "文字轉音樂模型允許使用者使用文字指令產生近乎真實的音樂音訊。然而，編輯音樂音訊仍然具有挑戰性，因為在音訊上進行細微的變更與維持簡單的使用者介面之間存在衝突的期望。為了應對這個挑戰，我們提出音訊提示適配器（或 AP-Adapter），這是預先訓練好的文字轉音樂模型的輕量級附加功能。我們利用 AudioMAE 從輸入音訊中萃取特徵，並建構基於注意力的適配器，將這些特徵輸入到基於擴散的文字轉音樂模型 AudioLDM2 的內部層級。AP-Adapter 擁有 22M 個可訓練參數，讓使用者能夠利用原始音訊和簡短文字作為輸入，同時運用音樂的全局（例如，類型和音色）和局部（例如，旋律）面向。透過客觀和主觀研究，我們在三個任務上評估 AP-Adapter：音色轉移、類型轉移和伴奏產生。此外，我們展示了它在訓練期間包含未見樂器的領域外音訊上的有效性。", "author": "Fang-Duo Tsai et.al.", "authors": "Fang-Duo Tsai, Shih-Lun Wu, Haven Kim, Bo-Yu Chen, Hao-Chung Cheng, Yi-Hsuan Yang", "id": "2407.16564v1", "paper_url": "http://arxiv.org/abs/2407.16564v1", "repo": "https://github.com/fundwotsai2001/ap-adapter"}}