{"2404.16621": {"publish_time": "2024-04-25", "title": "Hippocrates: An Open-Source Framework for Advancing Large Language Models in Healthcare", "paper_summary": "The integration of Large Language Models (LLMs) into healthcare promises to\ntransform medical diagnostics, research, and patient care. Yet, the progression\nof medical LLMs faces obstacles such as complex training requirements, rigorous\nevaluation demands, and the dominance of proprietary models that restrict\nacademic exploration. Transparent, comprehensive access to LLM resources is\nessential for advancing the field, fostering reproducibility, and encouraging\ninnovation in healthcare AI. We present Hippocrates, an open-source LLM\nframework specifically developed for the medical domain. In stark contrast to\nprevious efforts, it offers unrestricted access to its training datasets,\ncodebase, checkpoints, and evaluation protocols. This open approach is designed\nto stimulate collaborative research, allowing the community to build upon,\nrefine, and rigorously evaluate medical LLMs within a transparent ecosystem.\nAlso, we introduce Hippo, a family of 7B models tailored for the medical\ndomain, fine-tuned from Mistral and LLaMA2 through continual pre-training,\ninstruction tuning, and reinforcement learning from human and AI feedback. Our\nmodels outperform existing open medical LLMs models by a large-margin, even\nsurpassing models with 70B parameters. Through Hippocrates, we aspire to unlock\nthe full potential of LLMs not just to advance medical knowledge and patient\ncare but also to democratize the benefits of AI research in healthcare, making\nthem available across the globe.", "paper_summary_zh": "大型語言模型 (LLM) 整合到醫療保健中，有望轉化醫療診斷、研究和患者照護。然而，醫療 LLM 的進展面臨複雜的訓練需求、嚴格的評估需求和專有模型的主導地位等障礙，這些障礙限制了學術探索。透明、全面的 LLM 資源管道對於推進該領域、促進可複製性以及鼓勵醫療保健 AI 的創新至關重要。我們提出 Hippocrates，一個專門為醫療領域開發的開源 LLM 框架。與之前的努力形成鮮明對比的是，它提供對其訓練資料集、程式碼庫、檢查點和評估協定的無限制存取。這種開放的方法旨在刺激協作研究，讓社群可以在透明的生態系統中建立、改進和嚴格評估醫療 LLM。此外，我們還介紹了 Hippo，一個針對醫療領域量身打造的 7B 模型系列，透過持續預訓練、指令調整和人類與 AI 回饋的強化學習，從 Mistral 和 LLaMA2 中微調。我們的模型大幅優於現有的開放式醫療 LLM 模型，甚至超越了擁有 70B 參數的模型。透過 Hippocrates，我們渴望釋放 LLM 的全部潛力，不僅促進醫療知識和患者照護，還要民主化醫療保健中 AI 研究的優點，讓其在全球各地都可用。", "author": "Emre Can Acikgoz et.al.", "authors": "Emre Can Acikgoz, Osman Batur İnce, Rayene Bench, Arda Anıl Boz, İlker Kesen, Aykut Erdem, Erkut Erdem", "id": "2404.16621v1", "paper_url": "http://arxiv.org/abs/2404.16621v1", "repo": "https://github.com/hiyouga/llama-factory"}}