{"2412.18391": {"publish_time": "2024-12-24", "title": "TPAoI: Ensuring Fresh Service Status at the Network Edge in Compute-First Networking", "paper_summary": "In compute-first networking, maintaining fresh and accurate status\ninformation at the network edge is crucial for effective access to remote\nservices. This process typically involves three phases: Status updating, user\naccessing, and user requesting. However, current studies on status\neffectiveness, such as Age of Information at Query (QAoI), do not\ncomprehensively cover all these phases. Therefore, this paper introduces a\nnovel metric, TPAoI, aimed at optimizing update decisions by measuring the\nfreshness of service status. The stochastic nature of edge environments,\ncharacterized by unpredictable communication delays in updating, requesting,\nand user access times, poses a significant challenge when modeling. To address\nthis, we model the problem as a Markov Decision Process (MDP) and employ a\nDueling Double Deep Q-Network (D3QN) algorithm for optimization. Extensive\nexperiments demonstrate that the proposed TPAoI metric effectively minimizes\nAoI, ensuring timely and reliable service updates in dynamic edge environments.\nResults indicate that TPAoI reduces AoI by an average of 47\\% compared to QAoI\nmetrics and decreases update frequency by an average of 48\\% relative to\nconventional AoI metrics, showing significant improvement.", "paper_summary_zh": "在計算優先網路中，在網路邊緣維護最新且準確的狀態資訊對於有效存取遠端服務至關重要。此程序通常包含三個階段：狀態更新、使用者存取和使用者要求。但是，目前關於狀態有效性的研究，例如查詢資訊年齡（QAoI），並未全面涵蓋所有這些階段。因此，本文介紹了一種新的指標 TPAoI，旨在透過衡量服務狀態的新鮮度來最佳化更新決策。邊緣環境的隨機性質，其特徵是在更新、要求和使用者存取時間中具有不可預測的通訊延遲，在建模時會構成重大挑戰。為了解決這個問題，我們將問題建模為馬可夫決策過程（MDP），並採用決鬥雙深度 Q 網路（D3QN）演算法進行最佳化。廣泛的實驗證明，所提出的 TPAoI 指標可有效最小化 AoI，確保在動態邊緣環境中及時且可靠的服務更新。結果表明，與 QAoI 指標相比，TPAoI 將 AoI 降低了平均 47%，並且與傳統 AoI 指標相比，將更新頻率降低了平均 48%，顯示出顯著的改善。", "author": "Haosheng He et.al.", "authors": "Haosheng He, Jianpeng Qi, Chao Liu, Junyu Dong, Yanwei Yu", "id": "2412.18391v1", "paper_url": "http://arxiv.org/abs/2412.18391v1", "repo": "null"}}