{"2412.13998": {"publish_time": "2024-12-18", "title": "Few-shot Steerable Alignment: Adapting Rewards and LLM Policies with Neural Processes", "paper_summary": "As large language models (LLMs) become increasingly embedded in everyday\napplications, ensuring their alignment with the diverse preferences of\nindividual users has become a critical challenge. Currently deployed approaches\ntypically assume homogeneous user objectives and rely on single-objective\nfine-tuning. However, human preferences are inherently heterogeneous,\ninfluenced by various unobservable factors, leading to conflicting signals in\npreference data. Existing solutions addressing this diversity often require\ncostly datasets labelled for specific objectives and involve training multiple\nreward models or LLM policies, which is computationally expensive and\nimpractical. In this work, we present a novel framework for few-shot steerable\nalignment, where users' underlying preferences are inferred from a small sample\nof their choices. To achieve this, we extend the Bradley-Terry-Luce model to\nhandle heterogeneous preferences with unobserved variability factors and\npropose its practical implementation for reward modelling and LLM fine-tuning.\nThanks to our proposed approach of functional parameter-space conditioning,\nLLMs trained with our framework can be adapted to individual preferences at\ninference time, generating outputs over a continuum of behavioural modes. We\nempirically validate the effectiveness of methods, demonstrating their ability\nto capture and align with diverse human preferences in a data-efficient manner.\nOur code is made available at:\nhttps://github.com/kasia-kobalczyk/few-shot-steerable-alignment.", "paper_summary_zh": "隨著大型語言模型（LLM）日益嵌入日常應用程式中，確保它們與個別使用者的多元化偏好保持一致已成為一項重大的挑戰。目前部署的方法通常假設使用者目標同質，並依賴於單一目標微調。然而，人類偏好本質上是異質的，受各種不可觀察的因素影響，導致偏好資料中的訊號相互衝突。現有的解決方案解決此多元性通常需要標記特定目標的昂貴資料集，並涉及訓練多重獎勵模型或 LLM 政策，這在計算上昂貴且不切實際。在這項工作中，我們提出了一個新穎的框架，用於少次引導對齊，其中使用者的潛在偏好從一小部分的選擇中推論出來。為達成此目的，我們擴充 Bradley-Terry-Luce 模型，以處理具有未觀察變異因子的異質偏好，並提出其在獎勵建模和 LLM 微調中的實際實作。感謝我們提出的函數參數空間條件化方法，使用我們的框架訓練的 LLM 可以適應推理時間中的個別偏好，在行為模式的連續體上產生輸出。我們憑經驗驗證了方法的有效性，證明了它們能夠以資料有效率的方式捕捉和與多元化的人類偏好保持一致。我們的程式碼可在以下網址取得：\nhttps://github.com/kasia-kobalczyk/few-shot-steerable-alignment。", "author": "Katarzyna Kobalczyk et.al.", "authors": "Katarzyna Kobalczyk, Claudio Fanconi, Hao Sun, Mihaela van der Schaar", "id": "2412.13998v1", "paper_url": "http://arxiv.org/abs/2412.13998v1", "repo": "https://github.com/kasia-kobalczyk/few-shot-steerable-alignment"}}