{"2405.19996": {"publish_time": "2024-05-30", "title": "DP-IQA: Utilizing Diffusion Prior for Blind Image Quality Assessment in the Wild", "paper_summary": "Image quality assessment (IQA) plays a critical role in selecting\nhigh-quality images and guiding compression and enhancement methods in a series\nof applications. The blind IQA, which assesses the quality of in-the-wild\nimages containing complex authentic distortions without reference images, poses\ngreater challenges. Existing methods are limited to modeling a uniform\ndistribution with local patches and are bothered by the gap between low and\nhigh-level visions (caused by widely adopted pre-trained classification\nnetworks). In this paper, we propose a novel IQA method called diffusion\npriors-based IQA (DP-IQA), which leverages the prior knowledge from the\npre-trained diffusion model with its excellent powers to bridge semantic gaps\nin the perception of the visual quality of images. Specifically, we use\npre-trained stable diffusion as the backbone, extract multi-level features from\nthe denoising U-Net during the upsampling process at a specified timestep, and\ndecode them to estimate the image quality score. The text and image adapters\nare adopted to mitigate the domain gap for downstream tasks and correct the\ninformation loss caused by the variational autoencoder bottleneck. Finally, we\ndistill the knowledge in the above model into a CNN-based student model,\nsignificantly reducing the parameter to enhance applicability, with the student\nmodel performing similarly or even better than the teacher model surprisingly.\nExperimental results demonstrate that our DP-IQA achieves state-of-the-art\nresults on various in-the-wild datasets with better generalization capability,\nwhich shows the superiority of our method in global modeling and utilizing the\nhierarchical feature clues of diffusion for evaluating image quality.", "paper_summary_zh": "影像品質評估 (IQA) 在選擇高品質影像並引導一系列應用中的壓縮和增強方法中扮演關鍵角色。盲測 IQA 評估包含複雜真實失真的野生影像品質，而沒有參考影像，這提出了更大的挑戰。現有方法僅限於使用局部區塊建模均勻分佈，並受到低階和高階視覺之間的差距（由廣泛採用的預訓練分類網路造成）的困擾。在本文中，我們提出一個名為擴散先驗基礎 IQA (DP-IQA) 的新穎 IQA 方法，它利用預訓練擴散模型的先驗知識，並具備優秀的能力，可以彌合影像視覺品質感知中的語義差距。具體來說，我們使用預訓練的穩定擴散作為主幹，在特定時間步長的上採樣過程中從去噪 U-Net 中提取多層級特徵，並將它們解碼以估計影像品質分數。採用文字和影像適配器來減輕下游任務的領域差距，並修正變異自動編碼器瓶頸造成的資訊損失。最後，我們將上述模型中的知識提煉到基於 CNN 的學生模型中，大幅減少參數以增強適用性，令人驚訝的是，學生模型的表現與教師模型相似甚至更好。實驗結果證明，我們的 DP-IQA 在各種野生資料集上達成最先進的結果，並具有更好的泛化能力，這顯示了我們的方法在整體建模和利用擴散的階層式特徵線索來評估影像品質方面的優越性。", "author": "Honghao Fu et.al.", "authors": "Honghao Fu, Yufei Wang, Wenhan Yang, Bihan Wen", "id": "2405.19996v2", "paper_url": "http://arxiv.org/abs/2405.19996v2", "repo": "https://github.com/RomGai/DP-IQA"}}