{"2503.13423": {"publish_time": "2025-03-17", "title": "SuperBPE: Space Travel for Language Models", "paper_summary": "The assumption across nearly all language model (LM) tokenization schemes is\nthat tokens should be subwords, i.e., contained within word boundaries. While\nproviding a seemingly reasonable inductive bias, is this common practice\nlimiting the potential of modern LMs? Whitespace is not a reliable delimiter of\nmeaning, as evidenced by multi-word expressions (e.g., \"by the way\"),\ncrosslingual variation in the number of words needed to express a concept\n(e.g., \"spacesuit helmet\" in German is \"raumanzughelm\"), and languages that do\nnot use whitespace at all (e.g., Chinese). To explore the potential of\ntokenization beyond subwords, we introduce a \"superword\" tokenizer, SuperBPE,\nwhich incorporates a simple pretokenization curriculum into the byte-pair\nencoding (BPE) algorithm to first learn subwords, then superwords that bridge\nwhitespace. This brings dramatic improvements in encoding efficiency: when\nfixing the vocabulary size to 200k, SuperBPE encodes a fixed piece of text with\nup to 33% fewer tokens than BPE on average. In experiments, we pretrain 8B\ntransformer LMs from scratch while fixing the model size, vocabulary size, and\ntrain compute, varying *only* the algorithm for learning the vocabulary. Our\nmodel trained with SuperBPE achieves an average +4.0% absolute improvement over\nthe BPE baseline across 30 downstream tasks (including +8.2% on MMLU), while\nsimultaneously requiring 27% less compute at inference time. In analysis, we\nfind that SuperBPE results in segmentations of text that are more uniform in\nper-token difficulty. Qualitatively, this may be because SuperBPE tokens often\ncapture common multi-word expressions that function semantically as a single\nunit. SuperBPE is a straightforward, local modification to tokenization that\nimproves both encoding efficiency and downstream performance, yielding better\nlanguage models overall.", "paper_summary_zh": "<paragraph>幾乎所有語言模型 (LM) 分詞方案都假設分詞應該為子詞，亦即包含在詞彙邊界內。雖然這提供了一個看似合理的歸納偏差，但這種常見做法是否限制了現代 LM 的潛力？空格並不是一個可靠的語義分隔符，多詞表達式（例如「順便一提」）、跨語言表達概念所需詞彙數量的差異（例如，德語中的「太空衣頭盔」是「raumanzughelm」），以及完全不使用空格的語言（例如中文）都證明了這一點。為了探索子詞以外的分詞的潛力，我們引入了一個「超級詞」分詞器 SuperBPE，它在字節對編碼 (BPE) 演算法中加入了一個簡單的預分詞課程，首先學習子詞，然後學習跨越空格的超級詞。這顯著提高了編碼效率：當詞彙量固定為 20 萬時，SuperBPE 對一段固定文本的編碼平均比 BPE 少 33% 的分詞。在實驗中，我們從頭開始預訓練 8Btransformer LM，同時固定模型大小、詞彙量和訓練計算量，*僅*改變學習詞彙的演算法。使用 SuperBPE 訓練的模型在 30 個下游任務中比 BPE 基線平均提高了 +4.0%（包括在 MMLU 上提高了 +8.2%），同時在推理時所需的計算量減少了 27%。在分析中，我們發現 SuperBPE 產生的文本分段在每個分詞的難度上更為一致。定性地說，這可能是因為 SuperBPE 分詞通常會捕捉到語義上作為單一單元運作的常見多詞表達式。SuperBPE 是一種簡單的、局部的分詞修改，它提高了編碼效率和下游性能，從而產生了更好的語言模型。</paragraph>\n", "author": "Alisa Liu et.al.", "authors": "Alisa Liu, Jonathan Hayase, Valentin Hofmann, Sewoong Oh, Noah A. Smith, Yejin Choi", "id": "2503.13423v1", "paper_url": "http://arxiv.org/abs/2503.13423v1", "repo": "null"}}