{"2410.22971": {"publish_time": "2024-10-30", "title": "Private Synthetic Text Generation with Diffusion Models", "paper_summary": "How capable are diffusion models of generating synthetics texts? Recent\nresearch shows their strengths, with performance reaching that of\nauto-regressive LLMs. But are they also good in generating synthetic data if\nthe training was under differential privacy? Here the evidence is missing, yet\nthe promises from private image generation look strong. In this paper we\naddress this open question by extensive experiments. At the same time, we\ncritically assess (and reimplement) previous works on synthetic private text\ngeneration with LLMs and reveal some unmet assumptions that might have led to\nviolating the differential privacy guarantees. Our results partly contradict\nprevious non-private findings and show that fully open-source LLMs outperform\ndiffusion models in the privacy regime. Our complete source codes, datasets,\nand experimental setup is publicly available to foster future research.", "paper_summary_zh": "擴散模型生成合成文本的能力有多強？最近的研究顯示出它們的優勢，其效能已達到自迴歸 LLM 的水準。但是，如果訓練是在差分隱私下進行，它們在生成合成資料方面是否也表現良好？這方面的證據目前還付之闕如，但從私人影像生成中得到的承諾看起來很強。在本文中，我們透過廣泛的實驗來探討這個開放性的問題。同時，我們批判性地評估（並重新實作）先前使用 LLM 進行合成私人文字生成的相關研究，並揭露一些可能導致違反差分隱私保證的未滿足假設。我們的結果部分地與先前的非私人研究結果相矛盾，並顯示完全開源的 LLM 在隱私保護機制中優於擴散模型。我們的完整原始碼、資料集和實驗設定已公開，以促進未來的研究。", "author": "Sebastian Ochs et.al.", "authors": "Sebastian Ochs, Ivan Habernal", "id": "2410.22971v1", "paper_url": "http://arxiv.org/abs/2410.22971v1", "repo": "null"}}