{"2501.12557": {"publish_time": "2025-01-22", "title": "Understanding the LLM-ification of CHI: Unpacking the Impact of LLMs at CHI through a Systematic Literature Review", "paper_summary": "Large language models (LLMs) have been positioned to revolutionize HCI, by\nreshaping not only the interfaces, design patterns, and sociotechnical systems\nthat we study, but also the research practices we use. To-date, however, there\nhas been little understanding of LLMs' uptake in HCI. We address this gap via a\nsystematic literature review of 153 CHI papers from 2020-24 that engage with\nLLMs. We taxonomize: (1) domains where LLMs are applied; (2) roles of LLMs in\nHCI projects; (3) contribution types; and (4) acknowledged limitations and\nrisks. We find LLM work in 10 diverse domains, primarily via empirical and\nartifact contributions. Authors use LLMs in five distinct roles, including as\nresearch tools or simulated users. Still, authors often raise validity and\nreproducibility concerns, and overwhelmingly study closed models. We outline\nopportunities to improve HCI research with and on LLMs, and provide guiding\nquestions for researchers to consider the validity and appropriateness of\nLLM-related work.", "paper_summary_zh": "大型語言模型 (LLM) 已被定位為革命性的 HCI，不僅重塑我們研究的介面、設計模式和社會技術系統，還重塑我們使用的研究實務。然而，到目前為止，對於 LLM 在 HCI 中的採用了解甚少。我們透過系統性地回顧 2020-24 年間 153 篇與 LLM 相關的 CHI 論文，來解決這個差距。我們分類：(1) 應用 LLM 的領域；(2) LLM 在 HCI 專案中的角色；(3) 貢獻類型；以及 (4) 已知的限制和風險。我們發現 LLM 的工作分佈在 10 個不同的領域，主要是透過實證和人工製品的貢獻。作者在五個不同的角色中使用 LLM，包括作為研究工具或模擬使用者。儘管如此，作者經常提出有效性和可複製性的疑慮，並且絕大多數研究封閉模型。我們概述了利用 LLM 和研究 LLM 來改善 HCI 研究的機會，並提供指導性問題，供研究人員考量與 LLM 相關工作的有效性和適切性。", "author": "Rock Yuren Pang et.al.", "authors": "Rock Yuren Pang, Hope Schroeder, Kynnedy Simone Smith, Solon Barocas, Ziang Xiao, Emily Tseng, Danielle Bragg", "id": "2501.12557v1", "paper_url": "http://arxiv.org/abs/2501.12557v1", "repo": "null"}}