{"2408.15128": {"publish_time": "2024-08-27", "title": "Evaluating the Energy Consumption of Machine Learning: Systematic Literature Review and Experiments", "paper_summary": "Monitoring, understanding, and optimizing the energy consumption of Machine\nLearning (ML) are various reasons why it is necessary to evaluate the energy\nusage of ML. However, there exists no universal tool that can answer this\nquestion for all use cases, and there may even be disagreement on how to\nevaluate energy consumption for a specific use case. Tools and methods are\nbased on different approaches, each with their own advantages and drawbacks,\nand they need to be mapped out and explained in order to select the most\nsuitable one for a given situation. We address this challenge through two\napproaches. First, we conduct a systematic literature review of all tools and\nmethods that permit to evaluate the energy consumption of ML (both at training\nand at inference), irrespective of whether they were originally designed for\nmachine learning or general software. Second, we develop and use an\nexperimental protocol to compare a selection of these tools and methods. The\ncomparison is both qualitative and quantitative on a range of ML tasks of\ndifferent nature (vision, language) and computational complexity. The\nsystematic literature review serves as a comprehensive guide for understanding\nthe array of tools and methods used in evaluating energy consumption of ML, for\nvarious use cases going from basic energy monitoring to consumption\noptimization. Two open-source repositories are provided for further\nexploration. The first one contains tools that can be used to replicate this\nwork or extend the current review. The second repository houses the\nexperimental protocol, allowing users to augment the protocol with new ML\ncomputing tasks and additional energy evaluation tools.", "paper_summary_zh": "<paragraph>監控、了解和優化機器學習 (ML) 的能源消耗是評估 ML 能源使用的各種原因。然而，目前尚無萬能工具可以針對所有使用案例回答這個問題，甚至可能對於如何評估特定使用案例的能源消耗存在分歧。工具和方法基於不同的方法，各自有其優點和缺點，並且需要將它們繪製出來並加以說明，才能為特定情況選擇最合適的方法。我們透過兩種方法來解決這個挑戰。首先，我們對所有允許評估 ML 能源消耗（在訓練和推理時）的工具和方法進行系統性的文獻回顧，無論它們最初是為機器學習或一般軟體設計的。其次，我們開發並使用實驗協定來比較這些工具和方法的選項。比較在性質不同（視覺、語言）和計算複雜性範圍的 ML 任務上是定性和定量的。系統性的文獻回顧作為一個全面的指南，用於了解評估 ML 能源消耗所使用的工具和方法陣列，適用於從基本能源監控到消耗優化的各種使用案例。提供兩個開源儲存庫以供進一步探索。第一個包含可複製這項工作或擴展目前回顧的工具。第二個儲存庫容納實驗協定，允許使用者使用新的 ML 計算任務和額外的能源評估工具來擴充協定。</paragraph>", "author": "Charlotte Rodriguez et.al.", "authors": "Charlotte Rodriguez, Laura Degioanni, Laetitia Kameni, Richard Vidal, Giovanni Neglia", "id": "2408.15128v1", "paper_url": "http://arxiv.org/abs/2408.15128v1", "repo": "null"}}