{"2406.09112": {"publish_time": "2024-06-13", "title": "Large-Scale Evaluation of Open-Set Image Classification Techniques", "paper_summary": "The goal for classification is to correctly assign labels to unseen samples.\nHowever, most methods misclassify samples with unseen labels and assign them to\none of the known classes. Open-Set Classification (OSC) algorithms aim to\nmaximize both closed and open-set recognition capabilities. Recent studies\nshowed the utility of such algorithms on small-scale data sets, but limited\nexperimentation makes it difficult to assess their performances in real-world\nproblems. Here, we provide a comprehensive comparison of various OSC\nalgorithms, including training-based (SoftMax, Garbage, EOS) and\npost-processing methods (Maximum SoftMax Scores, Maximum Logit Scores, OpenMax,\nEVM, PROSER), the latter are applied on features from the former. We perform\nour evaluation on three large-scale protocols that mimic real-world challenges,\nwhere we train on known and negative open-set samples, and test on known and\nunknown instances. Our results show that EOS helps to improve performance of\nalmost all post-processing algorithms. Particularly, OpenMax and PROSER are\nable to exploit better-trained networks, demonstrating the utility of hybrid\nmodels. However, while most algorithms work well on negative test samples --\nsamples of open-set classes seen during training -- they tend to perform poorly\nwhen tested on samples of previously unseen unknown classes, especially in\nchallenging conditions.", "paper_summary_zh": "分類的目標是正確地將標籤分配給未見過樣本。\n然而，大多數方法會錯誤地分類具有未見過標籤的樣本，並將它們分配到已知的類別之一。開放式分類 (OSC) 演算法旨在最大化封閉式和開放式識別功能。最近的研究顯示此類演算法在小規模資料集上的效用，但有限的實驗使得難以評估它們在實際問題中的效能。在此，我們提供了各種 OSC 演算法的綜合比較，包括基於訓練的 (SoftMax、Garbage、EOS) 和後處理方法 (Maximum SoftMax Scores、Maximum Logit Scores、OpenMax、EVM、PROSER)，後者應用於前者的特徵。我們在三個模擬現實世界挑戰的大規模協定上執行評估，我們在已知和負的開放式樣本上進行訓練，並在已知和未知的實例上進行測試。我們的結果顯示，EOS 有助於改善幾乎所有後處理演算法的效能。特別是，OpenMax 和 PROSER 能夠利用訓練良好的網路，證明了混合模型的效用。然而，雖然大多數演算法在負面測試樣本上運作良好，也就是在訓練期間看到的開放式類別樣本，但當在先前未見過的未知類別樣本上進行測試時，它們往往表現不佳，尤其是在具有挑戰性的條件下。", "author": "Halil Bisgin et.al.", "authors": "Halil Bisgin, Andres Palechor, Mike Suter, Manuel Günther", "id": "2406.09112v1", "paper_url": "http://arxiv.org/abs/2406.09112v1", "repo": "https://github.com/aiml-ifi/openset-imagenet-comparison"}}