{"2411.02730": {"publish_time": "2024-11-05", "title": "A Natural Language Processing Approach to Support Biomedical Data Harmonization: Leveraging Large Language Models", "paper_summary": "Biomedical research requires large, diverse samples to produce unbiased\nresults. Automated methods for matching variables across datasets can\naccelerate this process. Research in this area has been limited, primarily\nfocusing on lexical matching and ontology based semantic matching. We aimed to\ndevelop new methods, leveraging large language models (LLM) and ensemble\nlearning, to automate variable matching. Methods: We utilized data from two\nGERAS cohort (European and Japan) studies to develop variable matching methods.\nWe first manually created a dataset by matching 352 EU variables with 1322\ncandidate JP variables, where matched variable pairs were positive and\nunmatched pairs were negative instances. Using this dataset, we developed and\nevaluated two types of natural language processing (NLP) methods, which matched\nvariables based on variable labels and definitions from data dictionaries: (1)\nLLM-based and (2) fuzzy matching. We then developed an ensemble-learning\nmethod, using the Random Forest model, to integrate individual NLP methods. RF\nwas trained and evaluated on 50 trials. Each trial had a random split (4:1) of\ntraining and test sets, with the model's hyperparameters optimized through\ncross-validation on the training set. For each EU variable, 1322 candidate JP\nvariables were ranked based on NLP-derived similarity scores or RF's\nprobability scores, denoting their likelihood to match the EU variable. Ranking\nperformance was measured by top-n hit ratio (HRn) and mean reciprocal rank\n(MRR). Results:E5 performed best among individual methods, achieving 0.90 HR-30\nand 0.70 MRR. RF performed better than E5 on all metrics over 50 trials (P less\nthan 0.001) and achieved an average HR 30 of 0.98 and MRR of 0.73. LLM-derived\nfeatures contributed most to RF's performance. One major cause of errors in\nautomatic variable matching was ambiguous variable definitions within data\ndictionaries.", "paper_summary_zh": "<paragraph>生物医学研究需要大量多样的样本才能产生无偏结果。跨数据集匹配变量的自动化方法可以加速此过程。该领域的研究一直受到限制，主要集中在词法匹配和基于本体的语义匹配上。我们旨在开发新方法，利用大型语言模型 (LLM) 和集成学习，实现变量匹配自动化。方法：我们利用来自两个 GERAS 队列（欧洲和日本）研究的数据来开发变量匹配方法。我们首先通过将 352 个欧盟变量与 1322 个候选日本变量进行匹配来手动创建数据集，其中匹配的变量对为正例，未匹配的对为反例。使用此数据集，我们开发并评估了两种类型的自然语言处理 (NLP) 方法，这些方法根据数据词典中的变量标签和定义匹配变量：(1) 基于 LLM 的方法和 (2) 模糊匹配。然后，我们开发了一种集成学习方法，使用随机森林模型来集成各个 NLP 方法。RF 在 50 次试验中接受训练和评估。每次试验都随机拆分 (4:1) 训练集和测试集，并通过训练集上的交叉验证优化模型的超参数。对于每个欧盟变量，1322 个候选日本变量根据 NLP 导出的相似性得分或 RF 的概率得分进行排名，表示它们与欧盟变量匹配的可能性。排名性能通过前 n 命中率 (HRn) 和平均倒数排名 (MRR) 来衡量。结果：E5 在各个方法中表现最佳，达到 0.90 HR-30 和 0.70 MRR。RF 在 50 次试验中在所有指标上都优于 E5（P 小于 0.001），并实现了平均 HR 30 为 0.98 和 MRR 为 0.73。LLM 衍生的特征对 RF 的性能贡献最大。自动变量匹配中错误的一个主要原因是数据词典中变量定义不明确。</paragraph>", "author": "Zexu Li et.al.", "authors": "Zexu Li, Suraj P. Prabhu, Zachary T. Popp, Shubhi S. Jain, Vijetha Balakundi, Ting Fang Alvin Ang, Rhoda Au, Jinying Chen", "id": "2411.02730v1", "paper_url": "http://arxiv.org/abs/2411.02730v1", "repo": "null"}}