{"2409.03203": {"publish_time": "2024-09-05", "title": "An Effective Deployment of Diffusion LM for Data Augmentation in Low-Resource Sentiment Classification", "paper_summary": "Sentiment classification (SC) often suffers from low-resource challenges such\nas domain-specific contexts, imbalanced label distributions, and few-shot\nscenarios. The potential of the diffusion language model (LM) for textual data\naugmentation (DA) remains unexplored, moreover, textual DA methods struggle to\nbalance the diversity and consistency of new samples. Most DA methods either\nperform logical modifications or rephrase less important tokens in the original\nsequence with the language model. In the context of SC, strong emotional tokens\ncould act critically on the sentiment of the whole sequence. Therefore,\ncontrary to rephrasing less important context, we propose DiffusionCLS to\nleverage a diffusion LM to capture in-domain knowledge and generate pseudo\nsamples by reconstructing strong label-related tokens. This approach ensures a\nbalance between consistency and diversity, avoiding the introduction of noise\nand augmenting crucial features of datasets. DiffusionCLS also comprises a\nNoise-Resistant Training objective to help the model generalize. Experiments\ndemonstrate the effectiveness of our method in various low-resource scenarios\nincluding domain-specific and domain-general problems. Ablation studies confirm\nthe effectiveness of our framework's modules, and visualization studies\nhighlight optimal deployment conditions, reinforcing our conclusions.", "paper_summary_zh": "情緒分類（SC）通常會面臨低資源挑戰，例如特定網域脈絡、標籤分佈不平衡及少樣本情境。擴散語言模型（LM）在文字資料擴充（DA）的潛力仍未被探索，此外，文字 DA 方法難以平衡新樣本的多樣性和一致性。大多數 DA 方法會對原始序列中較不重要的標記進行邏輯修改或重新表述，並使用語言模型。在 SC 的脈絡中，強烈的情緒標記可能會對整個序列的情緒產生關鍵影響。因此，與重新表述較不重要的脈絡相反，我們提出 DiffusionCLS，以利用擴散 LM 來擷取網域內知識，並透過重建與標籤相關的強標記來產生偽樣本。此方法可確保一致性和多樣性之間的平衡，避免引入雜訊並擴充資料集的關鍵特徵。DiffusionCLS 也包含一個抗雜訊訓練目標，以幫助模型進行概化。實驗證明了我們的方法在各種低資源情境中的有效性，包括特定網域和一般網域問題。消融研究證實了我們架構模組的有效性，而視覺化研究則突顯了最佳部署條件，強化了我們的結論。", "author": "Zhuowei Chen et.al.", "authors": "Zhuowei Chen, Lianxi Wang, Yuben Wu, Xinfeng Liao, Yujia Tian, Junyang Zhong", "id": "2409.03203v1", "paper_url": "http://arxiv.org/abs/2409.03203v1", "repo": "null"}}