{"2412.03487": {"publish_time": "2024-12-04", "title": "Flow Matching with General Discrete Paths: A Kinetic-Optimal Perspective", "paper_summary": "The design space of discrete-space diffusion or flow generative models are\nsignificantly less well-understood than their continuous-space counterparts,\nwith many works focusing only on a simple masked construction. In this work, we\naim to take a holistic approach to the construction of discrete generative\nmodels based on continuous-time Markov chains, and for the first time, allow\nthe use of arbitrary discrete probability paths, or colloquially, corruption\nprocesses. Through the lens of optimizing the symmetric kinetic energy, we\npropose velocity formulas that can be applied to any given probability path,\ncompletely decoupling the probability and velocity, and giving the user the\nfreedom to specify any desirable probability path based on expert knowledge\nspecific to the data domain. Furthermore, we find that a special construction\nof mixture probability paths optimizes the symmetric kinetic energy for the\ndiscrete case. We empirically validate the usefulness of this new design space\nacross multiple modalities: text generation, inorganic material generation, and\nimage generation. We find that we can outperform the mask construction even in\ntext with kinetic-optimal mixture paths, while we can make use of\ndomain-specific constructions of the probability path over the visual domain.", "paper_summary_zh": "離散空間擴散或流動生成模型的設計空間，與其連續空間的對應物相比，顯著地不甚明瞭，許多作品僅專注於簡單的遮罩構造。在這項工作中，我們旨在採用整體方法來建構基於連續時間馬可夫鏈的離散生成模型，並首次允許使用任意離散機率路徑，或通俗地說，損壞程序。透過最佳化對稱動能的觀點，我們提出可以應用於任何給定機率路徑的速度公式，完全解耦機率和速度，並讓使用者能夠根據特定於資料領域的專家知識，指定任何理想的機率路徑。此外，我們發現混合機率路徑的特殊構造，會最佳化離散情況的對稱動能。我們透過多種方式驗證此新設計空間的效用：文字生成、無機材料生成和影像生成。我們發現，即使在具有動能最佳混合路徑的文字中，我們也可以優於遮罩構造，同時我們可以在視覺領域中使用機率路徑的特定於領域的構造。", "author": "Neta Shaul et.al.", "authors": "Neta Shaul, Itai Gat, Marton Havasi, Daniel Severo, Anuroop Sriram, Peter Holderrieth, Brian Karrer, Yaron Lipman, Ricky T. Q. Chen", "id": "2412.03487v1", "paper_url": "http://arxiv.org/abs/2412.03487v1", "repo": "null"}}