{"2502.12118": {"publish_time": "2025-02-17", "title": "Scaling Test-Time Compute Without Verification or RL is Suboptimal", "paper_summary": "Despite substantial advances in scaling test-time compute, an ongoing debate\nin the community is how it should be scaled up to enable continued and\nefficient improvements with scaling. There are largely two approaches: first,\ndistilling successful search or thinking traces; and second, using verification\n(e.g., 0/1 outcome rewards, reward models, or verifiers) to guide reinforcement\nlearning (RL) and search algorithms. In this paper, we prove that finetuning\nLLMs with verifier-based (VB) methods based on RL or search is far superior to\nverifier-free (VF) approaches based on distilling or cloning search traces,\ngiven a fixed amount of compute/data budget. Further, we show that as we scale\ntest-time compute (measured as the output token length) and training data,\nsuboptimality of VF methods scales poorly compared to VB when the base\npre-trained LLM presents a heterogeneous distribution over correct solution\ntraces (e.g., different lengths, styles, etc.) and admits a non-sharp\ndistribution over rewards on traces sampled from it. We formalize this\ncondition using anti-concentration [Erd\\H{o}s, 1945]. This implies a stronger\nresult that VB methods scale better asymptotically, with the performance gap\nbetween VB and VF methods widening as test-time budget grows. We corroborate\nour theory empirically on both didactic and math reasoning problems with\n3/8/32B-sized pre-trained LLMs, where we find verification is crucial for\nscaling test-time compute.", "paper_summary_zh": "儘管在擴展測試時間計算方面取得了重大進展，但社群中持續的辯論是如何擴展它以持續有效地改善擴展。大致有兩種方法：首先，提煉成功的搜尋或思考軌跡；其次，使用驗證（例如，0/1 結果獎勵、獎勵模型或驗證器）來指導強化學習 (RL) 和搜尋演算法。在本文中，我們證明使用基於 RL 或搜尋的驗證器為基礎 (VB) 方法微調 LLM 遠優於基於提煉或複製搜尋軌跡的驗證器免費 (VF) 方法，給定固定數量的計算/資料預算。此外，我們表明，當我們擴展測試時間計算（以輸出標記長度衡量）和訓練資料時，與 VB 相比，VF 方法的次最佳性擴展效果不佳，當基礎預先訓練的 LLM 在正確的解決方案軌跡上呈現異質分佈（例如，不同的長度、樣式等）並承認從其中取樣的軌跡上獎勵的分佈不尖銳時。我們使用反集中 [Erd\\H{o}s，1945] 將此條件形式化。這暗示了一個更強的結果，即 VB 方法在漸近上擴展得更好，VB 和 VF 方法之間的效能差距隨著測試時間預算的增加而擴大。我們在具有 3/8/32B 大小的預先訓練 LLM 的教學和數學推理問題上對我們的理論進行實證驗證，我們發現驗證對於擴展測試時間計算至關重要。", "author": "Amrith Setlur et.al.", "authors": "Amrith Setlur, Nived Rajaraman, Sergey Levine, Aviral Kumar", "id": "2502.12118v1", "paper_url": "http://arxiv.org/abs/2502.12118v1", "repo": "null"}}