{"2410.14929": {"publish_time": "2024-10-19", "title": "Water quality polluted by total suspended solids classified within an Artificial Neural Network approach", "paper_summary": "This study investigates the application of an artificial neural network\nframework for analysing water pollution caused by solids. Water pollution by\nsuspended solids poses significant environmental and health risks. Traditional\nmethods for assessing and predicting pollution levels are often time-consuming\nand resource-intensive. To address these challenges, we developed a model that\nleverages a comprehensive dataset of water quality from total suspended solids.\nA convolutional neural network was trained under a transfer learning approach\nusing data corresponding to different total suspended solids concentrations,\nwith the goal of accurately predicting low, medium and high pollution levels\nbased on various input variables. Our model demonstrated high predictive\naccuracy, outperforming conventional statistical methods in terms of both speed\nand reliability. The results suggest that the artificial neural network\nframework can serve as an effective tool for real-time monitoring and\nmanagement of water pollution, facilitating proactive decision-making and\npolicy formulation. This approach not only enhances our understanding of\npollution dynamics but also underscores the potential of machine learning\ntechniques in environmental science.", "paper_summary_zh": "本研究探討人工神經網路架構在分析固體造成水污染的應用。懸浮固體造成的水污染會帶來顯著的環境與健康風險。傳統評估與預測污染程度的方法通常耗時且耗費資源。為了應對這些挑戰，我們開發了一個模型，利用總懸浮固體的全面水質資料集。卷積神經網路在遷移學習方法下接受訓練，使用對應於不同總懸浮固體濃度的資料，目標是根據各種輸入變數準確預測低、中和高污染程度。我們的模型展現出高預測準確度，在速度和可靠度方面都優於傳統統計方法。結果顯示，人工神經網路架構可用作水污染的即時監控和管理的有效工具，促進主動決策制定和政策制定。這種方法不僅增進我們對污染動態的了解，也強調了機器學習技術在環境科學中的潛力。", "author": "I. Luviano Soto et.al.", "authors": "I. Luviano Soto, Y. Concha Sánchez, A. Raya", "id": "2410.14929v1", "paper_url": "http://arxiv.org/abs/2410.14929v1", "repo": "null"}}