{"2502.11751": {"publish_time": "2025-02-17", "title": "Language Models Can See Better: Visual Contrastive Decoding For LLM Multimodal Reasoning", "paper_summary": "Although Large Language Models (LLMs) excel in reasoning and generation for\nlanguage tasks, they are not specifically designed for multimodal challenges.\nTraining Multimodal Large Language Models (MLLMs), however, is\nresource-intensive and constrained by various training limitations. In this\npaper, we propose the Modular-based Visual Contrastive Decoding (MVCD)\nframework to move this obstacle. Our framework leverages LLMs' In-Context\nLearning (ICL) capability and the proposed visual contrastive-example decoding\n(CED), specifically tailored for this framework, without requiring any\nadditional training. By converting visual signals into text and focusing on\ncontrastive output distributions during decoding, we can highlight the new\ninformation introduced by contextual examples, explore their connections, and\navoid over-reliance on prior encoded knowledge. MVCD enhances LLMs' visual\nperception to make it see and reason over the input visuals. To demonstrate\nMVCD's effectiveness, we conduct experiments with four LLMs across five\nquestion answering datasets. Our results not only show consistent improvement\nin model accuracy but well explain the effective components inside our decoding\nstrategy. Our code will be available at https://github.com/Pbhgit/MVCD.", "paper_summary_zh": "儘管大型語言模型 (LLM) 在語言任務的推理和生成方面表現優異，但它們並非專門針對多模態挑戰而設計。然而，訓練多模態大型語言模型 (MLLM) 十分耗費資源，並受到各種訓練限制。在本文中，我們提出基於模組的視覺對比解碼 (MVCD) 架構來克服這個障礙。我們的架構利用 LLM 的情境學習 (ICL) 能力和專門為此架構量身打造的視覺對比範例解碼 (CED)，而無需任何額外訓練。透過將視覺信號轉換為文字，並在解碼過程中專注於對比輸出分佈，我們可以突顯情境範例引入的新資訊，探索它們的關聯性，並避免過度依賴先前編碼的知識。MVCD 增強了 LLM 的視覺感知能力，使其能夠觀察並推論輸入視覺效果。為了證明 MVCD 的有效性，我們使用四個 LLM 在五個問答資料集上進行實驗。我們的結果不僅顯示模型準確度持續提升，還能清楚說明我們的解碼策略中的有效組成部分。我們的程式碼將在 https://github.com/Pbhgit/MVCD 公開。", "author": "Yuqi Pang et.al.", "authors": "Yuqi Pang, Bowen Yang, Haoqin Tu, Yun Cao, Zeyu Zhang", "id": "2502.11751v1", "paper_url": "http://arxiv.org/abs/2502.11751v1", "repo": "null"}}