{"2407.21153": {"publish_time": "2024-07-30", "title": "Event-Arguments Extraction Corpus and Modeling using BERT for Arabic", "paper_summary": "Event-argument extraction is a challenging task, particularly in Arabic due\nto sparse linguistic resources. To fill this gap, we introduce the \\hadath\ncorpus ($550$k tokens) as an extension of Wojood, enriched with event-argument\nannotations. We used three types of event arguments: $agent$, $location$, and\n$date$, which we annotated as relation types. Our inter-annotator agreement\nevaluation resulted in $82.23\\%$ $Kappa$ score and $87.2\\%$ $F_1$-score.\nAdditionally, we propose a novel method for event relation extraction using\nBERT, in which we treat the task as text entailment. This method achieves an\n$F_1$-score of $94.01\\%$. To further evaluate the generalization of our\nproposed method, we collected and annotated another out-of-domain corpus (about\n$80$k tokens) called \\testNLI and used it as a second test set, on which our\napproach achieved promising results ($83.59\\%$ $F_1$-score). Last but not\nleast, we propose an end-to-end system for event-arguments extraction. This\nsystem is implemented as part of SinaTools, and both corpora are publicly\navailable at {\\small \\url{https://sina.birzeit.edu/wojood}}", "paper_summary_zh": "事件論元萃取是一項具有挑戰性的任務，特別是對於阿拉伯語，因為語言資源稀少。為了填補這個空白，我們引入了\\hadath語料庫（55 萬個詞彙），作為Wojood的延伸，並加入了事件論元註解。我們使用了三種類型的事件論元：$agent$、$location$和$date$，我們將它們註解為關係類型。我們的標註者間一致性評估得出的Kappa評分為82.23%，F1評分為87.2%。此外，我們提出了一種使用BERT進行事件關係萃取的新方法，在該方法中，我們將任務視為文本蘊涵。此方法達到了94.01%的F1評分。為了進一步評估我們提出的方法的泛化性，我們收集並註解了另一個領域外的語料庫（約8萬個詞彙），稱為\\testNLI，並將其用作第二個測試集，我們的做法在該測試集上取得了有希望的結果（F1評分為83.59%）。最後但並非最不重要的一點是，我們提出了一個事件論元萃取的端到端系統。此系統作為SinaTools的一部分實作，並且兩個語料庫都可以在{\\small \\url{https://sina.birzeit.edu/wojood}}公開取得。", "author": "Alaa Aljabari et.al.", "authors": "Alaa Aljabari, Lina Duaibes, Mustafa Jarrar, Mohammed Khalilia", "id": "2407.21153v1", "paper_url": "http://arxiv.org/abs/2407.21153v1", "repo": "null"}}