{"2411.09289": {"publish_time": "2024-11-14", "title": "StreamAdapter: Efficient Test Time Adaptation from Contextual Streams", "paper_summary": "In-context learning (ICL) allows large language models (LLMs) to adapt to new\ntasks directly from the given demonstrations without requiring gradient\nupdates. While recent advances have expanded context windows to accommodate\nmore demonstrations, this approach increases inference costs without\nnecessarily improving performance. To mitigate these issues, We propose\nStreamAdapter, a novel approach that directly updates model parameters from\ncontext at test time, eliminating the need for explicit in-context\ndemonstrations. StreamAdapter employs context mapping and weight absorption\nmechanisms to dynamically transform ICL demonstrations into parameter updates\nwith minimal additional parameters. By reducing reliance on numerous in-context\nexamples, StreamAdapter significantly reduce inference costs and allows for\nefficient inference with constant time complexity, regardless of demonstration\ncount. Extensive experiments across diverse tasks and model architectures\ndemonstrate that StreamAdapter achieves comparable or superior adaptation\ncapability to ICL while requiring significantly fewer demonstrations. The\nsuperior task adaptation and context encoding capabilities of StreamAdapter on\nboth language understanding and generation tasks provides a new perspective for\nadapting LLMs at test time using context, allowing for more efficient\nadaptation across scenarios and more cost-effective inference", "paper_summary_zh": "語境學習 (ICL) 讓大型語言模型 (LLM) 能直接從給定的示範中適應新任務，而不需要梯度更新。雖然最近的進展已擴展語境窗口以容納更多示範，但此方法會增加推論成本，卻不一定能改善效能。為了減輕這些問題，我們提出 StreamAdapter，這是一種新穎的方法，它在測試時直接從語境更新模型參數，消除了對明確語境示範的需求。StreamAdapter 採用語境對應和權重吸收機制，將 ICL 示範動態轉換為參數更新，同時將額外參數減至最少。透過減少對大量語境範例的依賴，StreamAdapter 大幅降低推論成本，並允許以恆定的時間複雜度進行有效率的推論，與示範數量無關。跨不同任務和模型架構的廣泛實驗證明，StreamAdapter 達到與 ICL 相當或更優異的適應能力，同時所需的示範數量卻少得多。StreamAdapter 在語言理解和生成任務上都具有優異的任務適應和語境編碼能力，為在測試時使用語境來適應 LLM 提供了新的觀點，允許跨場景進行更有效率的適應和更具成本效益的推論。", "author": "Dilxat Muhtar et.al.", "authors": "Dilxat Muhtar, Yelong Shen, Yaming Yang, Xiaodong Liu, Yadong Lu, Jianfeng Liu, Yuefeng Zhan, Hao Sun, Weiwei Deng, Feng Sun, Xueliang Zhang, Jianfeng Gao, Weizhu Chen, Qi Zhang", "id": "2411.09289v1", "paper_url": "http://arxiv.org/abs/2411.09289v1", "repo": "null"}}