{"2407.04543": {"publish_time": "2024-07-05", "title": "Strengthening Structural Inductive Biases by Pre-training to Perform Syntactic Transformations", "paper_summary": "Models need appropriate inductive biases to effectively learn from small\namounts of data and generalize systematically outside of the training\ndistribution. While Transformers are highly versatile and powerful, they can\nstill benefit from enhanced structural inductive biases for seq2seq tasks,\nespecially those involving syntactic transformations, such as converting active\nto passive voice or semantic parsing. In this paper, we propose to strengthen\nthe structural inductive bias of a Transformer by intermediate pre-training to\nperform synthetically generated syntactic transformations of dependency trees\ngiven a description of the transformation. Our experiments confirm that this\nhelps with few-shot learning of syntactic tasks such as chunking, and also\nimproves structural generalization for semantic parsing. Our analysis shows\nthat the intermediate pre-training leads to attention heads that keep track of\nwhich syntactic transformation needs to be applied to which token, and that the\nmodel can leverage these attention heads on downstream tasks.", "paper_summary_zh": "模型需要適當的歸納偏誤，才能從少量資料中有效學習，並在訓練分佈之外進行系統化概化。雖然 Transformer 非常靈活且強大，但它們仍可以從增強的結構歸納偏誤中受益，特別是那些涉及句法轉換的 seq2seq 任務，例如將主動語態轉換為被動語態或語義解析。在本文中，我們建議透過中間預訓練來加強 Transformer 的結構歸納偏誤，以執行從屬樹的合成生成句法轉換，並提供轉換說明。我們的實驗證實，這有助於句法任務的少量學習，例如分塊，並改善語義解析的結構概化。我們的分析顯示，中間預訓練會導致關注點頭部追蹤哪些句法轉換需要應用於哪些標記，以及模型可以在下游任務中利用這些關注點頭部。", "author": "Matthias Lindemann et.al.", "authors": "Matthias Lindemann, Alexander Koller, Ivan Titov", "id": "2407.04543v1", "paper_url": "http://arxiv.org/abs/2407.04543v1", "repo": "null"}}