{"2405.15765": {"publish_time": "2024-05-24", "title": "Scaling Laws for Discriminative Classification in Large Language Models", "paper_summary": "Modern large language models (LLMs) represent a paradigm shift in what can\nplausibly be expected of machine learning models. The fact that LLMs can\neffectively generate sensible answers to a diverse range of queries suggests\nthat they would be useful in customer support applications. While powerful,\nLLMs have been observed to be prone to hallucination which unfortunately makes\ntheir near term use in customer support applications challenging. To address\nthis issue we present a system that allows us to use an LLM to augment our\ncustomer support advocates by re-framing the language modeling task as a\ndiscriminative classification task. In this framing, we seek to present the\ntop-K best template responses for a customer support advocate to use when\nresponding to a customer. We present the result of both offline and online\nexperiments where we observed offline gains and statistically significant\nonline lifts for our experimental system. Along the way, we present observed\nscaling curves for validation loss and top-K accuracy, resulted from model\nparameter ablation studies. We close by discussing the space of trade-offs with\nrespect to model size, latency, and accuracy as well as and suggesting future\napplications to explore.", "paper_summary_zh": "現代大型語言模型 (LLM) 代表了機器學習模型合理預期中的一個典範轉移。LLM 能夠有效地對各種查詢產生合理的答案，這表明它們在客戶支援應用程式中會很有用。雖然功能強大，但已觀察到 LLM 容易產生幻覺，這很不幸地讓它們在客戶支援應用程式中的近期使用面臨挑戰。為了解決這個問題，我們提出一個系統，允許我們使用 LLM 來擴充我們的客戶支援倡導者，方法是將語言建模任務重新定義為一個判別分類任務。在此框架中，我們尋求呈現給客戶支援倡導者前 K 個最佳範本回應，以便在回應客戶時使用。我們呈現離線和線上實驗的結果，在這些實驗中，我們觀察到離線收益和我們實驗系統的統計顯著線上提升。在此過程中，我們呈現了驗證損失和前 K 個準確度的觀察縮放曲線，這些曲線來自模型參數消融研究。最後，我們討論了模型大小、延遲和準確度方面的取捨空間，並建議探索未來的應用程式。", "author": "Dean Wyatte et.al.", "authors": "Dean Wyatte, Fatemeh Tahmasbi, Ming Li, Thomas Markovich", "id": "2405.15765v1", "paper_url": "http://arxiv.org/abs/2405.15765v1", "repo": "null"}}