{"2405.08553": {"publish_time": "2024-05-14", "title": "Improving Transformers with Dynamically Composable Multi-Head Attention", "paper_summary": "Multi-Head Attention (MHA) is a key component of Transformer. In MHA,\nattention heads work independently, causing problems such as low-rank\nbottleneck of attention score matrices and head redundancy. We propose\nDynamically Composable Multi-Head Attention (DCMHA), a parameter and\ncomputation efficient attention architecture that tackles the shortcomings of\nMHA and increases the expressive power of the model by dynamically composing\nattention heads. At the core of DCMHA is a $\\it{Compose}$ function that\ntransforms the attention score and weight matrices in an input-dependent way.\nDCMHA can be used as a drop-in replacement of MHA in any transformer\narchitecture to obtain the corresponding DCFormer. DCFormer significantly\noutperforms Transformer on different architectures and model scales in language\nmodeling, matching the performance of models with ~1.7x-2.0x compute. For\nexample, DCPythia-6.9B outperforms open source Pythia-12B on both pretraining\nperplexity and downstream task evaluation. The code and models are available at\nhttps://github.com/Caiyun-AI/DCFormer.", "paper_summary_zh": "多頭注意力 (MHA) 是 Transformer 的關鍵組成部分。在 MHA 中，注意力頭部獨立運作，導致注意力分數矩陣的低秩瓶頸和頭部冗餘等問題。我們提出動態可組成多頭注意力 (DCMHA)，這是一種參數和計算效率高的注意力架構，可解決 MHA 的缺點並透過動態組成注意力頭部來增加模型的表達能力。DCMHA 的核心是一個 $\\it{Compose}$ 函數，它以輸入依賴的方式轉換注意力分數和權重矩陣。DCMHA 可用於取代任何 Transformer 架構中的 MHA，以取得對應的 DCFormer。DCFormer 在不同的架構和語言建模中的模型規模上顯著優於 Transformer，其效能與運算量約為 1.7x-2.0x 的模型相匹配。例如，DCPythia-6.9B 在預訓練困惑度和下游任務評估中都優於開源 Pythia-12B。程式碼和模型可在 https://github.com/Caiyun-AI/DCFormer 取得。", "author": "Da Xiao et.al.", "authors": "Da Xiao, Qingye Meng, Shengping Li, Xingyuan Yuan", "id": "2405.08553v1", "paper_url": "http://arxiv.org/abs/2405.08553v1", "repo": "https://github.com/caiyun-ai/dcformer"}}