{"2407.15588": {"publish_time": "2024-07-22", "title": "Unsupervised Robust Cross-Lingual Entity Alignment via Joint Modeling of Entity and Relation Texts", "paper_summary": "Cross-lingual entity alignment (EA) enables the integration of multiple\nknowledge graphs (KGs) across different languages, providing users with\nseamless access to diverse and comprehensive knowledge.Existing methods, mostly\nsupervised, face challenges in obtaining labeled entity pairs. To address this,\nrecent studies have shifted towards a self-supervised and unsupervised\nframeworks. Despite their effectiveness, these approaches have limitations: (1)\nthey mainly focus on entity features, neglecting the semantic information of\nrelations, (2) they assume isomorphism between source and target graphs,\nleading to noise and reduced alignment accuracy, and (3) they are susceptible\nto noise in the textual features, especially when encountering inconsistent\ntranslations or Out-Of-Vocabulary (OOV) problems.\n  In this paper, we propose ERAlign, an unsupervised and robust cross-lingual\nEA framework that jointly performs Entity-level and Relation-level Alignment\nusing semantic textual features of relations and entities. Its refinement\nprocess iteratively enhances results by fusing entity-level and relation-level\nalignments based on neighbor triple matching. The additional verification\nprocess examines the entities' neighbor triples as the linearized text. This\n\\textit{Align-and-Verify} pipeline that rigorously assesses alignment results,\nachieving near-perfect alignment even in the presence of noisy textual features\nof entities. Our extensive experiments demonstrate that robustness and general\napplicability of \\proposed improved the accuracy and effectiveness of EA tasks,\ncontributing significantly to knowledge-oriented applications.", "paper_summary_zh": "跨語言實體對齊 (EA) 能夠整合不同語言中的多個知識圖譜 (KG)，讓使用者能無縫地存取多元且全面的知識。現有方法大多是有監督的，在取得標記實體對時面臨挑戰。為了解決這個問題，最近的研究已轉向自監督和無監督的架構。儘管這些方法很有效，但它們有以下限制：(1) 它們主要關注實體特徵，忽略關係的語義資訊，(2) 它們假設來源圖譜和目標圖譜之間同構，導致雜訊和對齊準確度降低，(3) 它們容易受到文字特徵中的雜訊影響，特別是在遇到不一致的翻譯或詞彙外問題 (OOV) 時。\n在本文中，我們提出 ERAlign，一個無監督且穩健的跨語言 EA 架構，它使用關係和實體的語義文字特徵，同時執行實體層級和關係層級對齊。它的精煉程序透過根據鄰接三元組匹配融合實體層級和關係層級對齊，反覆增強結果。額外的驗證程序將實體的鄰接三元組視為線性化文字進行檢查。這個嚴格評估對齊結果的「對齊和驗證」管線，即使在存在實體的雜訊文字特徵時也能達成近乎完美的對齊。我們廣泛的實驗證明，\\proposed 的穩健性和普遍適用性提升了 EA 任務的準確度和有效性，對知識導向應用程式有顯著的貢獻。", "author": "Soojin Yoon et.al.", "authors": "Soojin Yoon, Sungho Ko, Tongyoung Kim, SeongKu Kang, Jinyoung Yeo, Dongha Lee", "id": "2407.15588v1", "paper_url": "http://arxiv.org/abs/2407.15588v1", "repo": "https://github.com/eralign/eralign"}}