{"2411.07519": {"publish_time": "2024-11-12", "title": "TIPS: Threat Actor Informed Prioritization of Applications using SecEncoder", "paper_summary": "This paper introduces TIPS: Threat Actor Informed Prioritization using\nSecEncoder, a specialized language model for security. TIPS combines the\nstrengths of both encoder and decoder language models to detect and prioritize\ncompromised applications. By integrating threat actor intelligence, TIPS\nenhances the accuracy and relevance of its detections. Extensive experiments\nwith a real-world benchmark dataset of applications demonstrate TIPS's high\nefficacy, achieving an F-1 score of 0.90 in identifying malicious applications.\nAdditionally, in real-world scenarios, TIPS significantly reduces the backlog\nof investigations for security analysts by 87%, thereby streamlining the threat\nresponse process and improving overall security posture.", "paper_summary_zh": "本文介紹 TIPS：威脅行為者資訊優先順序，使用 SecEncoder，一種專門用於安全性的語言模型。TIPS 結合編碼器和解碼器語言模型的優點，以偵測和優先處理受入侵的應用程式。透過整合威脅行為者情報，TIPS 提升其偵測的準確性和相關性。使用真實世界基準資料集的應用程式的廣泛實驗證明了 TIPS 的高效率，在識別惡意應用程式時達到 0.90 的 F-1 分數。此外，在真實世界場景中，TIPS 將安全分析師的調查積壓減少了 87%，從而簡化了威脅應變程序並改善整體安全態勢。", "author": "Muhammed Fatih Bulut et.al.", "authors": "Muhammed Fatih Bulut, Acar Tamersoy, Naveed Ahmad, Yingqi Liu, Lloyd Greenwald", "id": "2411.07519v1", "paper_url": "http://arxiv.org/abs/2411.07519v1", "repo": "null"}}