{"2409.08406": {"publish_time": "2024-09-12", "title": "Knowledge Tagging with Large Language Model based Multi-Agent System", "paper_summary": "Knowledge tagging for questions is vital in modern intelligent educational\napplications, including learning progress diagnosis, practice question\nrecommendations, and course content organization. Traditionally, these\nannotations have been performed by pedagogical experts, as the task demands not\nonly a deep semantic understanding of question stems and knowledge definitions\nbut also a strong ability to link problem-solving logic with relevant knowledge\nconcepts. With the advent of advanced natural language processing (NLP)\nalgorithms, such as pre-trained language models and large language models\n(LLMs), pioneering studies have explored automating the knowledge tagging\nprocess using various machine learning models. In this paper, we investigate\nthe use of a multi-agent system to address the limitations of previous\nalgorithms, particularly in handling complex cases involving intricate\nknowledge definitions and strict numerical constraints. By demonstrating its\nsuperior performance on the publicly available math question knowledge tagging\ndataset, MathKnowCT, we highlight the significant potential of an LLM-based\nmulti-agent system in overcoming the challenges that previous methods have\nencountered. Finally, through an in-depth discussion of the implications of\nautomating knowledge tagging, we underscore the promising results of deploying\nLLM-based algorithms in educational contexts.", "paper_summary_zh": "知識標記對於現代智慧教育應用程式來說至關重要，包括學習進度診斷、練習題建議和課程內容組織。傳統上，這些標記是由教學專家執行，因為這項任務不僅需要對問題主幹和知識定義有深入的語義理解，還需要將問題解決邏輯與相關知識概念聯繫起來的強大能力。隨著先進的自然語言處理 (NLP) 演算法的出現，例如預先訓練的語言模型和大語言模型 (LLM)，開創性的研究已經探索使用各種機器學習模型自動化知識標記流程。在本文中，我們研究使用多代理系統來解決先前演算法的限制，特別是在處理涉及複雜知識定義和嚴格數值約束的複雜案例時。通過證明其在公開可用的數學問題知識標記資料集 MathKnowCT 上的優異效能，我們強調了基於 LLM 的多代理系統在克服先前方法遇到的挑戰方面的巨大潛力。最後，通過深入討論自動化知識標記的影響，我們強調了在教育環境中部署基於 LLM 的演算法的有希望的結果。", "author": "Hang Li et.al.", "authors": "Hang Li, Tianlong Xu, Ethan Chang, Qingsong Wen", "id": "2409.08406v1", "paper_url": "http://arxiv.org/abs/2409.08406v1", "repo": "null"}}