{"2412.04075": {"publish_time": "2024-12-05", "title": "Does your model understand genes? A benchmark of gene properties for biological and text models", "paper_summary": "The application of deep learning methods, particularly foundation models, in\nbiological research has surged in recent years. These models can be text-based\nor trained on underlying biological data, especially omics data of various\ntypes. However, comparing the performance of these models consistently has\nproven to be a challenge due to differences in training data and downstream\ntasks. To tackle this problem, we developed an architecture-agnostic\nbenchmarking approach that, instead of evaluating the models directly,\nleverages entity representation vectors from each model and trains simple\npredictive models for each benchmarking task. This ensures that all types of\nmodels are evaluated using the same input and output types. Here we focus on\ngene properties collected from professionally curated bioinformatics databases.\nThese gene properties are categorized into five major groups: genomic\nproperties, regulatory functions, localization, biological processes, and\nprotein properties. Overall, we define hundreds of tasks based on these\ndatabases, which include binary, multi-label, and multi-class classification\ntasks. We apply these benchmark tasks to evaluate expression-based models,\nlarge language models, protein language models, DNA-based models, and\ntraditional baselines. Our findings suggest that text-based models and protein\nlanguage models generally outperform expression-based models in genomic\nproperties and regulatory functions tasks, whereas expression-based models\ndemonstrate superior performance in localization tasks. These results should\naid in the development of more informed artificial intelligence strategies for\nbiological understanding and therapeutic discovery. To ensure the\nreproducibility and transparency of our findings, we have made the source code\nand benchmark data publicly accessible for further investigation and expansion\nat github.com/BiomedSciAI/gene-benchmark.", "paper_summary_zh": "<paragraph>近年来，深度学习方法，尤其是基础模型，在生物研究中的应用激增。这些模型可以基于文本，也可以在底层生物数据上进行训练，尤其是各种类型的组学数据。然而，由于训练数据和下游任务的差异，对这些模型的性能进行一致的比较已被证明是一项挑战。为了解决这个问题，我们开发了一种与架构无关的基准测试方法，该方法不是直接评估模型，而是利用每个模型中的实体表示向量并为每个基准测试任务训练简单的预测模型。这确保了使用相同的输入和输出类型来评估所有类型的模型。在这里，我们重点关注从专业策划的生物信息学数据库中收集的基因特性。这些基因特性被分为五类：基因组特性、调控功能、定位、生物过程和蛋白质特性。总体而言，我们基于这些数据库定义了数百个任务，其中包括二元、多标签和多类分类任务。我们将这些基准任务应用于基于表达的模型、大型语言模型、蛋白质语言模型、基于 DNA 的模型和传统基线。我们的研究结果表明，基于文本的模型和蛋白质语言模型通常在基因组特性和调控功能任务中优于基于表达的模型，而基于表达的模型在定位任务中表现出优越的性能。这些结果应有助于开发更明智的人工智能策略，以用于生物学理解和治疗发现。为了确保我们研究结果的可重复性和透明性，我们已将源代码和基准数据公开，以便在 github.com/BiomedSciAI/gene-benchmark 上进行进一步调查和扩展。</paragraph>", "author": "Yoav Kan-Tor et.al.", "authors": "Yoav Kan-Tor, Michael Morris Danziger, Eden Zohar, Matan Ninio, Yishai Shimoni", "id": "2412.04075v1", "paper_url": "http://arxiv.org/abs/2412.04075v1", "repo": "null"}}