{"2411.17309": {"publish_time": "2024-11-26", "title": "PIM-AI: A Novel Architecture for High-Efficiency LLM Inference", "paper_summary": "Large Language Models (LLMs) have become essential in a variety of\napplications due to their advanced language understanding and generation\ncapabilities. However, their computational and memory requirements pose\nsignificant challenges to traditional hardware architectures.\nProcessing-in-Memory (PIM), which integrates computational units directly into\nmemory chips, offers several advantages for LLM inference, including reduced\ndata transfer bottlenecks and improved power efficiency.\n  This paper introduces PIM-AI, a novel DDR5/LPDDR5 PIM architecture designed\nfor LLM inference without modifying the memory controller or DDR/LPDDR memory\nPHY. We have developed a simulator to evaluate the performance of PIM-AI in\nvarious scenarios and demonstrate its significant advantages over conventional\narchitectures. In cloud-based scenarios, PIM-AI reduces the 3-year TCO per\nqueries-per-second by up to 6.94x compared to state-of-the-art GPUs, depending\non the LLM model used. In mobile scenarios, PIM-AI achieves a 10- to 20-fold\nreduction in energy per token compared to state-of-the-art mobile SoCs,\nresulting in 25 to 45~\\% more queries per second and 6.9x to 13.4x less energy\nper query, extending battery life and enabling more inferences per charge.\n  These results highlight PIM-AI's potential to revolutionize LLM deployments,\nmaking them more efficient, scalable, and sustainable.", "paper_summary_zh": "大型語言模型 (LLM) 由於其先進的語言理解和生成能力，已成為各種應用程式中不可或缺的一部分。然而，它們的運算和記憶體需求對傳統硬體架構構成重大挑戰。處理記憶體 (PIM) 將運算單元直接整合到記憶體晶片中，為 LLM 推論提供了多項優點，包括減少資料傳輸瓶頸和提升電力效率。這篇論文介紹了 PIM-AI，一種新穎的 DDR5/LPDDR5 PIM 架構，設計用於 LLM 推論，且不修改記憶體控制器或 DDR/LPDDR 記憶體 PHY。我們開發了一個模擬器來評估 PIM-AI 在各種場景中的效能，並展示其相較於傳統架構的顯著優勢。在雲端場景中，PIM-AI 將每秒查詢的 3 年 TCO 降低了多達 6.94 倍，具體取決於所使用的 LLM 模型，與最先進的 GPU 相比。在行動場景中，PIM-AI 每個代幣的能耗降低了 10 到 20 倍，與最先進的行動 SoC 相比，每秒查詢數量增加了 25% 到 45%，每項查詢的能耗降低了 6.9 倍到 13.4 倍，延長了電池續航力，並在每次充電時能進行更多推論。這些結果突顯了 PIM-AI 徹底變革 LLM 部署的潛力，使其更有效率、更具可擴充性和永續性。", "author": "Cristobal Ortega et.al.", "authors": "Cristobal Ortega, Yann Falevoz, Renaud Ayrignac", "id": "2411.17309v1", "paper_url": "http://arxiv.org/abs/2411.17309v1", "repo": "null"}}