{"2406.04770": {"publish_time": "2024-06-07", "title": "WildBench: Benchmarking LLMs with Challenging Tasks from Real Users in the Wild", "paper_summary": "We introduce WildBench, an automated evaluation framework designed to\nbenchmark large language models (LLMs) using challenging, real-world user\nqueries. WildBench consists of 1,024 tasks carefully selected from over one\nmillion human-chatbot conversation logs. For automated evaluation with\nWildBench, we have developed two metrics, WB-Reward and WB-Score, which are\ncomputable using advanced LLMs such as GPT-4-turbo. WildBench evaluation uses\ntask-specific checklists to evaluate model outputs systematically and provides\nstructured explanations that justify the scores and comparisons, resulting in\nmore reliable and interpretable automatic judgments. WB-Reward employs\nfine-grained pairwise comparisons between model responses, generating five\npotential outcomes: much better, slightly better, slightly worse, much worse,\nor a tie. Unlike previous evaluations that employed a single baseline model, we\nselected three baseline models at varying performance levels to ensure a\ncomprehensive pairwise evaluation. Additionally, we propose a simple method to\nmitigate length bias, by converting outcomes of ``slightly better/worse'' to\n``tie'' if the winner response exceeds the loser one by more than $K$\ncharacters. WB-Score evaluates the quality of model outputs individually,\nmaking it a fast and cost-efficient evaluation metric. WildBench results\ndemonstrate a strong correlation with the human-voted Elo ratings from Chatbot\nArena on hard tasks. Specifically, WB-Reward achieves a Pearson correlation of\n0.98 with top-ranking models. Additionally, WB-Score reaches 0.95, surpassing\nboth ArenaHard's 0.91 and AlpacaEval2.0's 0.89 for length-controlled win rates,\nas well as the 0.87 for regular win rates.", "paper_summary_zh": "<paragraph>我們推出 WildBench，一個自動化評估框架，旨在使用具有挑戰性的真實世界使用者查詢來對大型語言模型 (LLM) 進行基準測試。WildBench 包含 1,024 項任務，從超過一百萬筆人機對話記錄中仔細挑選。對於使用 WildBench 進行自動化評估，我們開發了兩個指標，WB-Reward 和 WB-Score，可以使用 GPT-4-turbo 等先進 LLM 進行運算。WildBench 評估使用特定於任務的檢查清單來系統性地評估模型輸出，並提供結構化的說明來證明評分和比較，從而產生更可靠且可解釋的自動判斷。WB-Reward 採用模型回應之間的細緻成對比較，產生五種潛在結果：好很多、稍好、稍差、差很多或平手。與採用單一基準模型的先前評估不同，我們選擇了三個效能等級不同的基準模型，以確保全面的成對評估。此外，我們提出一個簡單的方法來減輕長度偏差，方法是將「稍好/稍差」的結果轉換為「平手」，如果獲勝回應超過失敗者超過 $K$ 個字元。WB-Score 個別評估模型輸出的品質，使其成為快速且具有成本效益的評估指標。WildBench 結果顯示與 Chatbot Arena 中由人類投票的 Elo 評分在困難任務中具有強烈的相關性。具體來說，WB-Reward 與排名最高的模型達到 0.98 的 Pearson 相關性。此外，WB-Score 達到 0.95，在長度控制獲勝率方面超越了 ArenaHard 的 0.91 和 AlpacaEval2.0 的 0.89，以及常規獲勝率的 0.87。</paragraph>", "author": "Bill Yuchen Lin et.al.", "authors": "Bill Yuchen Lin, Yuntian Deng, Khyathi Chandu, Faeze Brahman, Abhilasha Ravichander, Valentina Pyatkin, Nouha Dziri, Ronan Le Bras, Yejin Choi", "id": "2406.04770v1", "paper_url": "http://arxiv.org/abs/2406.04770v1", "repo": "https://github.com/allenai/wildbench"}}