{"2410.12750": {"publish_time": "2024-10-16", "title": "Comparative Analysis of Extrinsic Factors for NER in French", "paper_summary": "Named entity recognition (NER) is a crucial task that aims to identify\nstructured information, which is often replete with complex, technical terms\nand a high degree of variability. Accurate and reliable NER can facilitate the\nextraction and analysis of important information. However, NER for other than\nEnglish is challenging due to limited data availability, as the high expertise,\ntime, and expenses are required to annotate its data. In this paper, by using\nthe limited data, we explore various factors including model structure, corpus\nannotation scheme and data augmentation techniques to improve the performance\nof a NER model for French. Our experiments demonstrate that these approaches\ncan significantly improve the model's F1 score from original CRF score of 62.41\nto 79.39. Our findings suggest that considering different extrinsic factors and\ncombining these techniques is a promising approach for improving NER\nperformance where the size of data is limited.", "paper_summary_zh": "命名實體辨識 (NER) 是一項關鍵的任務，旨在辨識結構化的資訊，這些資訊通常充斥著複雜的技術術語和高度的可變性。準確且可靠的 NER 能夠促進重要資訊的萃取和分析。然而，除了英文之外的 NER 具有挑戰性，因為資料的取得有限，而且標註資料需要高度的專業知識、時間和金錢成本。在本文中，我們透過使用有限的資料，探討各種因素，包括模型結構、語料標註方案和資料擴充技術，以提升法語 NER 模型的效能。我們的實驗證明，這些方法可以顯著地提升模型的 F1 分數，從原本的 CRF 分數 62.41 提升至 79.39。我們的研究結果顯示，考慮不同的外在因素並結合這些技術，對於提升資料量有限情況下的 NER 效能而言是一種有前途的方法。", "author": "Grace Yang et.al.", "authors": "Grace Yang, Zhiyi Li, Yandong Liu, Jungyeul Park", "id": "2410.12750v1", "paper_url": "http://arxiv.org/abs/2410.12750v1", "repo": "null"}}