{"2504.17704": {"publish_time": "2025-04-24", "title": "Safety in Large Reasoning Models: A Survey", "paper_summary": "Large Reasoning Models (LRMs) have exhibited extraordinary prowess in tasks\nlike mathematics and coding, leveraging their advanced reasoning capabilities.\nNevertheless, as these capabilities progress, significant concerns regarding\ntheir vulnerabilities and safety have arisen, which can pose challenges to\ntheir deployment and application in real-world settings. This paper presents a\ncomprehensive survey of LRMs, meticulously exploring and summarizing the newly\nemerged safety risks, attacks, and defense strategies. By organizing these\nelements into a detailed taxonomy, this work aims to offer a clear and\nstructured understanding of the current safety landscape of LRMs, facilitating\nfuture research and development to enhance the security and reliability of\nthese powerful models.", "paper_summary_zh": "大型推理模型 (LRM) 在數學和編碼等任務中展現出非凡的能力，充分利用了它們先進的推理能力。然而，隨著這些能力的進步，人們也開始關注它們的漏洞和安全性，這可能會對它們在現實世界中的部署和應用造成挑戰。本文全面綜述了 LRM，仔細探討和總結了新出現的安全風險、攻擊和防禦策略。通過將這些要素組織成一個詳細的分類法，這項工作旨在提供對 LRM 當前安全狀況的清晰和結構化的理解，促進未來的研究和開發，以增強這些強大模型的安全性和可靠性。\n", "author": "Cheng Wang et.al.", "authors": "Cheng Wang, Yue Liu, Baolong Li, Duzhen Zhang, Zhongzhi Li, Junfeng Fang", "id": "2504.17704v1", "paper_url": "http://arxiv.org/abs/2504.17704v1", "repo": "null"}}