{"2409.02691": {"publish_time": "2024-09-04", "title": "LLM-Assisted Visual Analytics: Opportunities and Challenges", "paper_summary": "We explore the integration of large language models (LLMs) into visual\nanalytics (VA) systems to transform their capabilities through intuitive\nnatural language interactions. We survey current research directions in this\nemerging field, examining how LLMs are integrated into data management,\nlanguage interaction, visualisation generation, and language generation\nprocesses. We highlight the new possibilities that LLMs bring to VA, especially\nhow they can change VA processes beyond the usual use cases. We especially\nhighlight building new visualisation-language models, allowing access of a\nbreadth of domain knowledge, multimodal interaction, and opportunities with\nguidance. Finally, we carefully consider the prominent challenges of using\ncurrent LLMs in VA tasks. Our discussions in this paper aim to guide future\nresearchers working on LLM-assisted VA systems and help them navigate common\nobstacles when developing these systems.", "paper_summary_zh": "我們探討將大型語言模型 (LLM) 整合到視覺分析 (VA) 系統中，以透過直觀的自然語言互動來轉換其功能。我們調查這個新興領域中當前的研究方向，探討 LLM 如何整合到資料管理、語言互動、視覺化產生和語言產生過程中。我們重點說明 LLM 為 VA 帶來的各種新可能性，特別是它們如何改變 VA 過程，超越一般常見的用例。我們特別強調建立新的視覺化語言模型，允許存取廣泛的領域知識、多模態互動和指導機會。最後，我們仔細考量在 VA 任務中使用目前 LLM 的顯著挑戰。我們在本文中的討論旨在引導未來研究人員從事 LLM 輔助的 VA 系統，並幫助他們在開發這些系統時克服常見的障礙。", "author": "Maeve Hutchinson et.al.", "authors": "Maeve Hutchinson, Radu Jianu, Aidan Slingsby, Pranava Madhyastha", "id": "2409.02691v1", "paper_url": "http://arxiv.org/abs/2409.02691v1", "repo": "null"}}