{"2410.21113": {"publish_time": "2024-10-28", "title": "Zero-Shot Action Recognition in Surveillance Videos", "paper_summary": "The growing demand for surveillance in public spaces presents significant\nchallenges due to the shortage of human resources. Current AI-based video\nsurveillance systems heavily rely on core computer vision models that require\nextensive finetuning, which is particularly difficult in surveillance settings\ndue to limited datasets and difficult setting (viewpoint, low quality, etc.).\nIn this work, we propose leveraging Large Vision-Language Models (LVLMs), known\nfor their strong zero and few-shot generalization, to tackle video\nunderstanding tasks in surveillance. Specifically, we explore VideoLLaMA2, a\nstate-of-the-art LVLM, and an improved token-level sampling method,\nSelf-Reflective Sampling (Self-ReS). Our experiments on the UCF-Crime dataset\nshow that VideoLLaMA2 represents a significant leap in zero-shot performance,\nwith 20% boost over the baseline. Self-ReS additionally increases zero-shot\naction recognition performance to 44.6%. These results highlight the potential\nof LVLMs, paired with improved sampling techniques, for advancing surveillance\nvideo analysis in diverse scenarios.", "paper_summary_zh": "由於人力資源短缺，對公共場所監控需求的增加帶來了重大的挑戰。當前的基於人工智能的影片監控系統嚴重依賴於核心電腦視覺模型，這些模型需要廣泛的微調，而這在監控設置中特別困難，因為資料集有限且設置困難（視角、低品質等）。在這項工作中，我們建議利用大型視覺語言模型 (LVLMs)，它們以強大的零次和少次泛化而聞名，來處理監控中的影片理解任務。具體來說，我們探討了 VideoLLaMA2，一種最先進的 LVLM，以及一種改進的符號級別採樣方法，自反採樣 (Self-ReS)。我們在 UCF-Crime 資料集上的實驗表明，VideoLLaMA2 在零次表現上代表了一個重大的飛躍，比基準提升了 20%。Self-ReS 還將零次動作識別性能提高到 44.6%。這些結果突顯了 LVLMs 與改進的採樣技術相結合的潛力，用於推進各種場景中的監控影片分析。", "author": "Joao Pereira et.al.", "authors": "Joao Pereira, Vasco Lopes, David Semedo, Joao Neves", "id": "2410.21113v1", "paper_url": "http://arxiv.org/abs/2410.21113v1", "repo": "null"}}