{"2409.07098": {"publish_time": "2024-09-11", "title": "Redundancy-Aware Camera Selection for Indoor Scene Neural Rendering", "paper_summary": "Novel view synthesis of indoor scenes can be achieved by capturing a\nmonocular video sequence of the environment. However, redundant information\ncaused by artificial movements in the input video data reduces the efficiency\nof scene modeling. In this work, we tackle this challenge from the perspective\nof camera selection. We begin by constructing a similarity matrix that\nincorporates both the spatial diversity of the cameras and the semantic\nvariation of the images. Based on this matrix, we use the Intra-List Diversity\n(ILD) metric to assess camera redundancy, formulating the camera selection task\nas an optimization problem. Then we apply a diversity-based sampling algorithm\nto optimize the camera selection. We also develop a new dataset, IndoorTraj,\nwhich includes long and complex camera movements captured by humans in virtual\nindoor environments, closely mimicking real-world scenarios. Experimental\nresults demonstrate that our strategy outperforms other approaches under time\nand memory constraints. Remarkably, our method achieves performance comparable\nto models trained on the full dataset, while using only an average of 15% of\nthe frames and 75% of the allotted time.", "paper_summary_zh": "室內場景的新穎視圖合成，可透過擷取環境的單眼影片序列來達成。然而，輸入影片資料中的人工動作所造成的冗餘資訊降低了場景建模的效率。在這項研究中，我們從相機選擇的角度來應對這項挑戰。我們首先建構一個相似矩陣，其中包含相機的空間多樣性和影像的語義變化。根據這個矩陣，我們使用 Intra-List Diversity (ILD) 指標來評估相機冗餘，將相機選擇任務制定為一個最佳化問題。接著，我們套用一個基於多樣性的取樣演算法來最佳化相機選擇。我們也開發了一個新的資料集 IndoorTraj，其中包含人類在虛擬室內環境中擷取的長而複雜的相機動作，非常接近真實世界的場景。實驗結果顯示，我們的策略在時間和記憶體限制下優於其他方法。值得注意的是，我們的模型在僅使用平均 15% 的影格和 75% 的分配時間的情況下，就能達到與在完整資料集上訓練的模型相當的效能。", "author": "Zehao Wang et.al.", "authors": "Zehao Wang, Han Zhou, Matthew B. Blaschko, Tinne Tuytelaars, Minye Wu", "id": "2409.07098v1", "paper_url": "http://arxiv.org/abs/2409.07098v1", "repo": "null"}}