{"2406.02329": {"publish_time": "2024-06-04", "title": "On Affine Homotopy between Language Encoders", "paper_summary": "Pre-trained language encoders -- functions that represent text as vectors --\nare an integral component of many NLP tasks. We tackle a natural question in\nlanguage encoder analysis: What does it mean for two encoders to be similar? We\ncontend that a faithful measure of similarity needs to be \\emph{intrinsic},\nthat is, task-independent, yet still be informative of \\emph{extrinsic}\nsimilarity -- the performance on downstream tasks. It is common to consider two\nencoders similar if they are \\emph{homotopic}, i.e., if they can be aligned\nthrough some transformation. In this spirit, we study the properties of\n\\emph{affine} alignment of language encoders and its implications on extrinsic\nsimilarity. We find that while affine alignment is fundamentally an asymmetric\nnotion of similarity, it is still informative of extrinsic similarity. We\nconfirm this on datasets of natural language representations. Beyond providing\nuseful bounds on extrinsic similarity, affine intrinsic similarity also allows\nus to begin uncovering the structure of the space of pre-trained encoders by\ndefining an order over them.", "paper_summary_zh": "預訓練語言編碼器（將文字表示為向量的函數）是許多自然語言處理任務的組成部分。我們處理語言編碼器分析中的一個自然問題：兩個編碼器相似是什麼意思？我們認為，相似的忠實衡量標準應該是「內在的」，也就是與任務無關，但仍然對「外在」相似性（下游任務的效能）具有資訊性。如果兩個編碼器是「同倫的」，也就是說，如果它們可以透過某種轉換來對齊，通常會認為它們是相似的。本著這種精神，我們研究語言編碼器的「仿射」對齊特性及其對外在相似性的影響。我們發現，儘管仿射對齊基本上是一種不對稱的相似性概念，但它仍然對外在相似性具有資訊性。我們在自然語言表示資料集上確認了這一點。除了提供外在相似性的有用界線外，仿射內在相似性也讓我們能夠透過定義編碼器的順序，開始揭示預訓練編碼器空間的結構。", "author": "Robin SM Chan et.al.", "authors": "Robin SM Chan, Reda Boumasmoud, Anej Svete, Yuxin Ren, Qipeng Guo, Zhijing Jin, Shauli Ravfogel, Mrinmaya Sachan, Bernhard Schölkopf, Mennatallah El-Assady, Ryan Cotterell", "id": "2406.02329v1", "paper_url": "http://arxiv.org/abs/2406.02329v1", "repo": "null"}}