{"2412.02189": {"publish_time": "2024-12-03", "title": "Comparative Performance of Machine Learning Algorithms for Early Genetic Disorder and Subclass Classification", "paper_summary": "A great deal of effort has been devoted to discovering a particular genetic\ndisorder, but its classification across a broad spectrum of disorder classes\nand types remains elusive. Early diagnosis of genetic disorders enables timely\ninterventions and improves outcomes. This study implements machine learning\nmodels using basic clinical indicators measurable at birth or infancy to enable\ndiagnosis in preliminary life stages. Supervised learning algorithms were\nimplemented on a dataset of 22083 instances with 42 features like family\nhistory, newborn metrics, and basic lab tests. Extensive hyperparameter tuning,\nfeature engineering, and selection were undertaken. Two multi-class classifiers\nwere developed: one for predicting disorder classes (mitochondrial,\nmultifactorial, and single-gene) and one for subtypes (9 disorders).\nPerformance was evaluated using accuracy, precision, recall, and the F1-score.\nThe CatBoost classifier achieved the highest accuracy of 77% for predicting\ngenetic disorder classes. For subtypes, SVM attained a maximum accuracy of 80%.\nThe study demonstrates the feasibility of using basic clinical data in machine\nlearning models for early categorization and diagnosis across various genetic\ndisorders. Applying ML with basic clinical indicators can enable timely\ninterventions once validated on larger datasets. It is necessary to conduct\nfurther studies to improve model performance on this dataset.", "paper_summary_zh": "<paragraph>許多研究致力於發現特定遺傳性疾病，但其在廣泛的疾病類型和分類中的分類仍然難以捉摸。遺傳性疾病的早期診斷能及時介入並改善結果。本研究實作機器學習模型，使用出生或嬰兒時期可測量的基本臨床指標，以在生命的早期階段進行診斷。監督式學習演算法實作在一個包含 22083 個實例的資料集上，其中包含 42 個特徵，例如家族史、新生兒指標和基本實驗室檢驗。進行了廣泛的超參數調整、特徵工程和選擇。開發了兩個多類別分類器：一個用於預測疾病類型（粒線體、多因素和單基因），另一個用於預測亞型（9 種疾病）。使用準確度、精確度、召回率和 F1 分數評估效能。CatBoost 分類器在預測遺傳性疾病類型方面達到了 77% 的最高準確度。對於亞型，SVM 達到了 80% 的最高準確度。本研究證明了在機器學習模型中使用基本臨床資料進行早期分類和診斷各種遺傳性疾病的可行性。將機器學習應用於基本臨床指標，可以在較大的資料集上驗證後及時進行干預。有必要進行進一步的研究以改善此資料集上的模型效能。</paragraph>", "author": "Abu Bakar Siddik et.al.", "authors": "Abu Bakar Siddik, Faisal R. Badal, Afroza Islam", "id": "2412.02189v1", "paper_url": "http://arxiv.org/abs/2412.02189v1", "repo": "null"}}