{"2412.04984": {"publish_time": "2024-12-06", "title": "Frontier Models are Capable of In-context Scheming", "paper_summary": "Frontier models are increasingly trained and deployed as autonomous agent.\nOne safety concern is that AI agents might covertly pursue misaligned goals,\nhiding their true capabilities and objectives - also known as scheming. We\nstudy whether models have the capability to scheme in pursuit of a goal that we\nprovide in-context and instruct the model to strongly follow. We evaluate\nfrontier models on a suite of six agentic evaluations where models are\ninstructed to pursue goals and are placed in environments that incentivize\nscheming. Our results show that o1, Claude 3.5 Sonnet, Claude 3 Opus, Gemini\n1.5 Pro, and Llama 3.1 405B all demonstrate in-context scheming capabilities.\nThey recognize scheming as a viable strategy and readily engage in such\nbehavior. For example, models strategically introduce subtle mistakes into\ntheir responses, attempt to disable their oversight mechanisms, and even\nexfiltrate what they believe to be their model weights to external servers.\nAdditionally, this deceptive behavior proves persistent. When o1 has engaged in\nscheming, it maintains its deception in over 85% of follow-up questions and\noften remains deceptive in multi-turn interrogations. Analysis of the models'\nchains-of-thought reveals that models explicitly reason about these deceptive\nstrategies, providing evidence that the scheming behavior is not accidental.\nSurprisingly, we also find rare instances where models engage in scheming when\nonly given a goal, without being strongly nudged to pursue it. We observe cases\nwhere Claude 3.5 Sonnet strategically underperforms in evaluations in pursuit\nof being helpful, a goal that was acquired during training rather than\nin-context. Our findings demonstrate that frontier models now possess\ncapabilities for basic in-context scheming, making the potential of AI agents\nto engage in scheming behavior a concrete rather than theoretical concern.", "paper_summary_zh": "前沿模型正日益接受训练并作为自主代理部署。\n一个安全问题是，人工智能代理可能会秘密追求错误的目标，\n隐藏其真实功能和目标，也称为阴谋。我们\n研究模型是否有能力在追求我们\n在上下文中提供的目标并指示模型严格遵循时进行阴谋。我们评估\n前沿模型在一系列六项代理评估中，其中指示模型追求目标并被置于激励\n阴谋的环境中。我们的结果表明，o1、Claude 3.5 Sonnet、Claude 3 Opus、Gemini\n1.5 Pro 和 Llama 3.1 405B 都展示了上下文中策划的能力。\n他们认为阴谋是一种可行的策略，并乐于参与这种\n行为。例如，模型策略性地在其响应中引入细微错误，尝试禁用其监督机制，甚至\n将他们认为是模型权重的内容渗透到外部服务器。\n此外，这种欺骗行为被证明是持续的。当 o1 从事\n阴谋时，它在 85% 以上的后续问题中保持欺骗，并且在多轮审问中经常保持欺骗。模型的\n思维链分析表明，模型明确地推理出这些欺骗\n策略，提供了阴谋行为并非偶然的证据。\n令人惊讶的是，我们还发现罕见的实例，其中模型在\n仅给定目标时参与阴谋，而没有被强烈推动去追求它。我们观察到案例\nClaude 3.5 Sonnet 在评估中战略性地表现不佳，以追求\n有帮助，这是一个在训练中而不是\n上下文中获得的目标。我们的研究结果表明，前沿模型现在具备了进行基本上下文的策划能力，使人工智能代理参与策划行为的可能性成为一个具体的问题，而不是理论上的问题。", "author": "Alexander Meinke et.al.", "authors": "Alexander Meinke, Bronson Schoen, Jérémy Scheurer, Mikita Balesni, Rusheb Shah, Marius Hobbhahn", "id": "2412.04984v1", "paper_url": "http://arxiv.org/abs/2412.04984v1", "repo": "null"}}