{"2407.06093": {"publish_time": "2024-07-08", "title": "Artificial Intuition: Efficient Classification of Scientific Abstracts", "paper_summary": "It is desirable to coarsely classify short scientific texts, such as grant or\npublication abstracts, for strategic insight or research portfolio management.\nThese texts efficiently transmit dense information to experts possessing a rich\nbody of knowledge to aid interpretation. Yet this task is remarkably difficult\nto automate because of brevity and the absence of context. To address this gap,\nwe have developed a novel approach to generate and appropriately assign coarse\ndomain-specific labels. We show that a Large Language Model (LLM) can provide\nmetadata essential to the task, in a process akin to the augmentation of\nsupplemental knowledge representing human intuition, and propose a workflow. As\na pilot study, we use a corpus of award abstracts from the National Aeronautics\nand Space Administration (NASA). We develop new assessment tools in concert\nwith established performance metrics.", "paper_summary_zh": "粗略分類簡短的科學文本（例如補助金或出版摘要）有助於策略見解或研究組合管理。這些文本有效地將密集的資訊傳達給擁有豐富知識的專家，以協助詮釋。然而，由於簡短且缺乏背景，這項任務難以自動化。為了解決這個問題，我們開發了一種新方法來產生和適當地分配粗略的特定領域標籤。我們展示大型語言模型 (LLM) 可以提供對任務至關重要的元資料，這個過程類似於補充代表人類直覺的知識，並提出一個工作流程。作為試驗研究，我們使用美國國家航空暨太空總署 (NASA) 的獎項摘要語料庫。我們與既定的效能指標協調開發新的評量工具。", "author": "Harsh Sakhrani et.al.", "authors": "Harsh Sakhrani, Naseela Pervez, Anirudh Ravi Kumar, Fred Morstatter, Alexandra Graddy Reed, Andrea Belz", "id": "2407.06093v1", "paper_url": "http://arxiv.org/abs/2407.06093v1", "repo": "null"}}