{"2502.01295": {"publish_time": "2025-02-03", "title": "Common Foundations for SHACL, ShEx, and PG-Schema", "paper_summary": "Graphs have emerged as an important foundation for a variety of applications,\nincluding capturing and reasoning over factual knowledge, semantic data\nintegration, social networks, and providing factual knowledge for machine\nlearning algorithms. To formalise certain properties of the data and to ensure\ndata quality, there is a need to describe the schema of such graphs. Because of\nthe breadth of applications and availability of different data models, such as\nRDF and property graphs, both the Semantic Web and the database community have\nindependently developed graph schema languages: SHACL, ShEx, and PG-Schema.\nEach language has its unique approach to defining constraints and validating\ngraph data, leaving potential users in the dark about their commonalities and\ndifferences. In this paper, we provide formal, concise definitions of the core\ncomponents of each of these schema languages. We employ a uniform framework to\nfacilitate a comprehensive comparison between the languages and identify a\ncommon set of functionalities, shedding light on both overlapping and\ndistinctive features of the three languages.", "paper_summary_zh": "圖表已成為各種應用的重要基礎，包括擷取和推理事實知識、語義資料整合、社群網路，以及為機器學習演算法提供事實知識。為了形式化資料的特定屬性並確保資料品質，有必要描述此類圖表的架構。由於應用範圍廣泛且有不同的資料模型可用，例如 RDF 和屬性圖表，因此語義網路和資料庫社群已獨立開發圖表架構語言：SHACL、ShEx 和 PG-Schema。每種語言都有其定義約束和驗證圖表資料的獨特方法，讓潛在使用者不清楚它們的共性和差異。在本文中，我們提供這些架構語言中每個核心元件的正式簡潔定義。我們採用統一的框架來促進語言之間的全面比較，並找出功能的共同集合，說明這三種語言的重疊和獨特功能。", "author": "S. Ahmetaj et.al.", "authors": "S. Ahmetaj, I. Boneva, J. Hidders, K. Hose, M. Jakubowski, J. E. Labra-Gayo, W. Martens, F. Mogavero, F. Murlak, C. Okulmus, A. Polleres, O. Savkovic, M. Simkus, D. Tomaszuk", "id": "2502.01295v1", "paper_url": "http://arxiv.org/abs/2502.01295v1", "repo": "null"}}