{"2405.09567": {"publish_time": "2024-05-08", "title": "ECG-SMART-NET: A Deep Learning Architecture for Precise ECG Diagnosis of Occlusion Myocardial Infarction", "paper_summary": "In this paper we describe ECG-SMART-NET for identification of occlusion\nmyocardial infarction (OMI). OMI is a severe form of heart attack characterized\nby complete blockage of one or more coronary arteries requiring immediate\nreferral for cardiac catheterization to restore blood flow to the heart. Two\nthirds of OMI cases are difficult to visually identify from a 12-lead\nelectrocardiogram (ECG) and can be potentially fatal if not identified in a\ntimely fashion. Previous works on this topic are scarce, and current\nstate-of-the-art evidence suggests that both random forests with engineered\nfeatures and convolutional neural networks (CNNs) are promising approaches to\nimprove the ECG detection of OMI. While the ResNet architecture has been\nsuccessfully adapted for use with ECG recordings, it is not ideally suited to\ncapture informative temporal features within each lead and the spatial\nconcordance or discordance across leads. We propose a clinically informed\nmodification of the ResNet-18 architecture. The model first learns temporal\nfeatures through temporal convolutional layers with 1xk kernels followed by a\nspatial convolutional layer, after the residual blocks, with 12x1 kernels to\nlearn spatial features. The new ECG-SMART-NET was benchmarked against the\noriginal ResNet-18 and other state-of-the-art models on a multisite real-word\nclinical dataset that consists of 10,893 ECGs from 7,297 unique patients (rate\nof OMI = 6.5%). ECG-SMART-NET outperformed other models in the classification\nof OMI with a test AUC score of 0.889 +/- 0.027 and a test average precision\nscore of 0.587 +/- 0.087.", "paper_summary_zh": "<paragraph>在本文中，我們描述了 ECG-SMART-NET，用於識別閉塞性心肌梗塞 (OMI)。OMI 是一種嚴重的心臟病發作形式，其特徵是完全阻塞一個或多個冠狀動脈，需要立即轉診進行心導管檢查以恢復心臟的血液流動。三分之二的 OMI 病例很難從 12 導程心電圖 (ECG) 中視覺識別，如果不能及時識別，可能會致命。關於這個主題的先前研究很少，目前的最新證據表明，具有工程特徵的隨機森林和卷積神經網路 (CNN) 是改善 OMI 的 ECG 檢測的有前途的方法。雖然 ResNet 架構已成功適應於 ECG 記錄，但它並不適合捕捉每個導程內的資訊性時間特徵以及導程之間的空間一致性或不一致性。我們提出了對 ResNet-18 架構的臨床知情修改。該模型首先通過具有 1xk 核的時間卷積層學習時間特徵，然後是空間卷積層，在殘差塊之後，使用 12x1 核學習空間特徵。新的 ECG-SMART-NET 與原始 ResNet-18 和其他最先進的模型在一個多站點真實世界臨床數據集上進行了基準測試，該數據集包含來自 7,297 名唯一患者的 10,893 個 ECG（OMI 發生率 = 6.5%）。ECG-SMART-NET 在 OMI 的分類中優於其他模型，測試 AUC 得分為 0.889 +/- 0.027，測試平均準確度得分為 0.587 +/- 0.087。</paragraph>", "author": "Nathan T. Riek et.al.", "authors": "Nathan T. Riek, Murat Akcakaya, Zeineb Bouzid, Tanmay Gokhale, Stephanie Helman, Karina Kraevsky-Philips, Rui Qi Ji, Ervin Sejdic, Jessica K. Zègre-Hemsey, Christian Martin-Gill, Clifton W. Callaway, Samir Saba, Salah Al-Zaiti", "id": "2405.09567v1", "paper_url": "http://arxiv.org/abs/2405.09567v1", "repo": "null"}}