{"2409.09652": {"publish_time": "2024-09-15", "title": "Unveiling Gender Bias in Large Language Models: Using Teacher's Evaluation in Higher Education As an Example", "paper_summary": "This paper investigates gender bias in Large Language Model (LLM)-generated\nteacher evaluations in higher education setting, focusing on evaluations\nproduced by GPT-4 across six academic subjects. By applying a comprehensive\nanalytical framework that includes Odds Ratio (OR) analysis, Word Embedding\nAssociation Test (WEAT), sentiment analysis, and contextual analysis, this\npaper identified patterns of gender-associated language reflecting societal\nstereotypes. Specifically, words related to approachability and support were\nused more frequently for female instructors, while words related to\nentertainment were predominantly used for male instructors, aligning with the\nconcepts of communal and agentic behaviors. The study also found moderate to\nstrong associations between male salient adjectives and male names, though\ncareer and family words did not distinctly capture gender biases. These\nfindings align with prior research on societal norms and stereotypes,\nreinforcing the notion that LLM-generated text reflects existing biases.", "paper_summary_zh": "本研究探討大型語言模型 (LLM) 在高等教育環境中產生的教師評量中的性別偏見，重點關注 GPT-4 在六個學術科目中產生的評量。透過應用包含機率比 (OR) 分析、詞嵌入關聯測試 (WEAT)、情緒分析和情境分析的全面分析架構，本研究找出反映社會刻板印象的性別相關語言模式。具體來說，與女性教師相關的詞彙較常使用親切和支持，而與男性教師相關的詞彙則主要使用娛樂，這與群體和能動行為的概念一致。研究還發現男性顯著形容詞和男性姓名之間有中度到強烈的關聯，儘管職業和家庭詞彙並未明確捕捉到性別偏見。這些發現與先前關於社會規範和刻板印象的研究一致，強化了 LLM 生成的文字反映既有偏見的概念。", "author": "Yuanning Huang et.al.", "authors": "Yuanning Huang", "id": "2409.09652v1", "paper_url": "http://arxiv.org/abs/2409.09652v1", "repo": "null"}}