{"2410.10814": {"publish_time": "2024-10-14", "title": "Your Mixture-of-Experts LLM Is Secretly an Embedding Model For Free", "paper_summary": "While large language models (LLMs) excel on generation tasks, their\ndecoder-only architecture often limits their potential as embedding models if\nno further representation finetuning is applied. Does this contradict their\nclaim of generalists? To answer the question, we take a closer look at\nMixture-of-Experts (MoE) LLMs. Our study shows that the expert routers in MoE\nLLMs can serve as an off-the-shelf embedding model with promising performance\non a diverse class of embedding-focused tasks, without requiring any\nfinetuning. Moreover, our extensive analysis shows that the MoE routing weights\n(RW) is complementary to the hidden state (HS) of LLMs, a widely-used\nembedding. Compared to HS, we find that RW is more robust to the choice of\nprompts and focuses on high-level semantics. Motivated by the analysis, we\npropose MoEE combining RW and HS, which achieves better performance than using\neither separately. Our exploration of their combination and prompting strategy\nshed several novel insights, e.g., a weighted sum of RW and HS similarities\noutperforms the similarity on their concatenation. Our experiments are\nconducted on 6 embedding tasks with 20 datasets from the Massive Text Embedding\nBenchmark (MTEB). The results demonstrate the significant improvement brought\nby MoEE to LLM-based embedding without further finetuning.", "paper_summary_zh": "儘管大型語言模型 (LLM) 在生成任務中表現出色，但其僅解碼器的架構通常會限制其作為嵌入模型的潛力，除非應用進一步的表示微調。這是否與其通才的說法相矛盾？為了回答這個問題，我們仔細研究了專家混合 (MoE) LLM。我們的研究表明，MoE LLM 中的專家路由器可以用作現成的嵌入模型，在各種以嵌入為中心的任務上具有令人滿意的效能，而無需任何微調。此外，我們的廣泛分析表明，MoE 路由權重 (RW) 與 LLM 的隱藏狀態 (HS)（一種廣泛使用的嵌入）是互補的。與 HS 相比，我們發現 RW 對提示的選擇更具魯棒性，並且專注於高層次語義。受分析的啟發，我們提出了結合 RW 和 HS 的 MoEE，其效能優於單獨使用任一方法。我們對其組合和提示策略的探索揭示了幾個新穎的見解，例如，RW 和 HS 相似性的加權和優於它們串聯的相似性。我們的實驗是在大規模文字嵌入基準 (MTEB) 中的 20 個資料集上的 6 個嵌入任務中進行的。結果證明了 MoEE 在沒有進一步微調的情況下為基於 LLM 的嵌入帶來的顯著改進。", "author": "Ziyue Li et.al.", "authors": "Ziyue Li, Tianyi Zhou", "id": "2410.10814v1", "paper_url": "http://arxiv.org/abs/2410.10814v1", "repo": "null"}}