{"2502.01942": {"publish_time": "2025-02-04", "title": "Boundary-Driven Table-Filling with Cross-Granularity Contrastive Learning for Aspect Sentiment Triplet Extraction", "paper_summary": "The Aspect Sentiment Triplet Extraction (ASTE) task aims to extract aspect\nterms, opinion terms, and their corresponding sentiment polarity from a given\nsentence. It remains one of the most prominent subtasks in fine-grained\nsentiment analysis. Most existing approaches frame triplet extraction as a 2D\ntable-filling process in an end-to-end manner, focusing primarily on word-level\ninteractions while often overlooking sentence-level representations. This\nlimitation hampers the model's ability to capture global contextual\ninformation, particularly when dealing with multi-word aspect and opinion terms\nin complex sentences. To address these issues, we propose boundary-driven\ntable-filling with cross-granularity contrastive learning (BTF-CCL) to enhance\nthe semantic consistency between sentence-level representations and word-level\nrepresentations. By constructing positive and negative sample pairs, the model\nis forced to learn the associations at both the sentence level and the word\nlevel. Additionally, a multi-scale, multi-granularity convolutional method is\nproposed to capture rich semantic information better. Our approach can capture\nsentence-level contextual information more effectively while maintaining\nsensitivity to local details. Experimental results show that the proposed\nmethod achieves state-of-the-art performance on public benchmarks according to\nthe F1 score.", "paper_summary_zh": "面向方面的情感三元組抽取 (ASTE) 任務旨在從給定的句子中抽取面向詞、意見詞及其對應的情感極性。它仍然是細粒度情感分析中最突出的子任務之一。大多數現有方法將三元組抽取構建為端到端方式中的 2D 表格填充過程，主要關注詞級互動，同時經常忽視句子級表示。這種限制阻礙了模型捕獲全局上下文信息的的能力，特別是在處理複雜句子中的多詞面向和意見詞時。為了解決這些問題，我們提出了具有跨粒度對比學習的邊界驅動表格填充 (BTF-CCL) 來增強句子級表示和詞級表示之間的語義一致性。通過構造正負樣本對，模型被迫學習句子級和詞級的關聯。此外，提出了一種多尺度、多粒度卷積方法來更好地捕獲豐富的語義信息。我們的做法可以更有效地捕獲句子級上下文信息，同時保持對局部細節的敏感性。實驗結果表明，根據 F1 分數，所提出的方法在公共基準上實現了最先進的性能。", "author": "Qingling Li et.al.", "authors": "Qingling Li, Wushao Wen, Jinghui Qin", "id": "2502.01942v1", "paper_url": "http://arxiv.org/abs/2502.01942v1", "repo": "null"}}