{"2405.19363": {"publish_time": "2024-05-24", "title": "Medformer: A Multi-Granularity Patching Transformer for Medical Time-Series Classification", "paper_summary": "Medical time series data, such as Electroencephalography (EEG) and\nElectrocardiography (ECG), play a crucial role in healthcare, such as\ndiagnosing brain and heart diseases. Existing methods for medical time series\nclassification primarily rely on handcrafted biomarkers extraction and\nCNN-based models, with limited exploration of transformers tailored for medical\ntime series. In this paper, we introduce Medformer, a multi-granularity\npatching transformer tailored specifically for medical time series\nclassification. Our method incorporates three novel mechanisms to leverage the\nunique characteristics of medical time series: cross-channel patching to\nleverage inter-channel correlations, multi-granularity embedding for capturing\nfeatures at different scales, and two-stage (intra- and inter-granularity)\nmulti-granularity self-attention for learning features and correlations within\nand among granularities. We conduct extensive experiments on five public\ndatasets under both subject-dependent and challenging subject-independent\nsetups. Results demonstrate Medformer's superiority over 10 baselines,\nachieving top averaged ranking across five datasets on all six evaluation\nmetrics. These findings underscore the significant impact of our method on\nhealthcare applications, such as diagnosing Myocardial Infarction, Alzheimer's,\nand Parkinson's disease. We release the source code at\n\\url{https://github.com/DL4mHealth/Medformer}.", "paper_summary_zh": "醫學時間序列資料，例如腦電圖 (EEG) 和心電圖 (ECG)，在醫療保健中扮演著至關重要的角色，例如診斷腦部和心臟疾病。現有的醫學時間序列分類方法主要依賴於手工製作的生物標記萃取和基於 CNN 的模型，對於專門針對醫學時間序列量身打造的轉換器則探索有限。在本文中，我們介紹了 Medformer，一個專門針對醫學時間序列分類量身打造的多粒度補丁轉換器。我們的技術結合了三種新穎的機制來利用醫學時間序列的獨特特徵：跨通道補丁以利用通道間相關性、多粒度嵌入以擷取不同尺度的特徵，以及兩階段（粒度內和粒度間）多粒度自我注意，以學習粒度內和粒度間的特徵和相關性。我們在五個公共資料集上進行了廣泛的實驗，包括依賴受試者和具有挑戰性的獨立受試者設定。結果顯示 Medformer 優於 10 個基準，在所有六個評估指標上，在五個資料集上獲得最高的平均排名。這些發現強調了我們的方法對醫療保健應用（例如診斷心肌梗塞、阿茲海默症和帕金森氏症）的重大影響。我們在 \\url{https://github.com/DL4mHealth/Medformer} 釋出原始碼。", "author": "Yihe Wang et.al.", "authors": "Yihe Wang, Nan Huang, Taida Li, Yujun Yan, Xiang Zhang", "id": "2405.19363v1", "paper_url": "http://arxiv.org/abs/2405.19363v1", "repo": "null"}}