{"2410.10332": {"publish_time": "2024-10-14", "title": "Disentangling Hate Across Target Identities", "paper_summary": "Hate speech (HS) classifiers do not perform equally well in detecting hateful\nexpressions towards different target identities. They also demonstrate\nsystematic biases in predicted hatefulness scores. Tapping on two recently\nproposed functionality test datasets for HS detection, we quantitatively\nanalyze the impact of different factors on HS prediction. Experiments on\npopular industrial and academic models demonstrate that HS detectors assign a\nhigher hatefulness score merely based on the mention of specific target\nidentities. Besides, models often confuse hatefulness and the polarity of\nemotions. This result is worrisome as the effort to build HS detectors might\nharm the vulnerable identity groups we wish to protect: posts expressing anger\nor disapproval of hate expressions might be flagged as hateful themselves. We\nalso carry out a study inspired by social psychology theory, which reveals that\nthe accuracy of hatefulness prediction correlates strongly with the intensity\nof the stereotype.", "paper_summary_zh": "仇恨言論 (HS) 分類器在偵測針對不同目標身分的仇恨言論時，表現並不相同。它們在預測的仇恨分數中也表現出系統性的偏見。利用最近提出的兩個 HS 偵測功能測試資料集，我們定量分析了不同因素對 HS 預測的影響。在熱門產業和學術模型上的實驗證明，HS 偵測器僅根據特定目標身分的提及，就分配了較高的仇恨分數。此外，模型經常混淆仇恨和情緒的極性。這個結果令人擔憂，因為建立 HS 偵測器的努力可能會傷害我們希望保護的弱勢身分群體：表達憤怒或不認同仇恨言論的貼文可能會被標記為仇恨言論。我們還進行了一項受社會心理學理論啟發的研究，結果顯示仇恨預測的準確性與刻板印象的強度密切相關。", "author": "Yiping Jin et.al.", "authors": "Yiping Jin, Leo Wanner, Aneesh Moideen Koya", "id": "2410.10332v1", "paper_url": "http://arxiv.org/abs/2410.10332v1", "repo": "https://github.com/yipingnus/disentangle-hate"}}