{"2409.13094": {"publish_time": "2024-09-19", "title": "DenoMamba: A fused state-space model for low-dose CT denoising", "paper_summary": "Low-dose computed tomography (LDCT) lower potential risks linked to radiation\nexposure while relying on advanced denoising algorithms to maintain diagnostic\nquality in reconstructed images. The reigning paradigm in LDCT denoising is\nbased on neural network models that learn data-driven image priors to separate\nnoise evoked by dose reduction from underlying tissue signals. Naturally, the\nfidelity of these priors depend on the model's ability to capture the broad\nrange of contextual features evident in CT images. Earlier convolutional neural\nnetworks (CNN) are highly adept at efficiently capturing short-range spatial\ncontext, but their limited receptive fields reduce sensitivity to interactions\nover longer distances. Although transformers based on self-attention mechanisms\nhave recently been posed to increase sensitivity to long-range context, they\ncan suffer from suboptimal performance and efficiency due to elevated model\ncomplexity, particularly for high-resolution CT images. For high-quality\nrestoration of LDCT images, here we introduce DenoMamba, a novel denoising\nmethod based on state-space modeling (SSM), that efficiently captures short-\nand long-range context in medical images. Following an hourglass architecture\nwith encoder-decoder stages, DenoMamba employs a spatial SSM module to encode\nspatial context and a novel channel SSM module equipped with a secondary gated\nconvolution network to encode latent features of channel context at each stage.\nFeature maps from the two modules are then consolidated with low-level input\nfeatures via a convolution fusion module (CFM). Comprehensive experiments on\nLDCT datasets with 25\\% and 10\\% dose reduction demonstrate that DenoMamba\noutperforms state-of-the-art denoisers with average improvements of 1.4dB PSNR,\n1.1% SSIM, and 1.6% RMSE in recovered image quality.", "paper_summary_zh": "低劑量電腦斷層掃描 (LDCT) 降低與輻射有關的潛在風險，同時依賴進階的去噪演算法，以維持重建影像的診斷品質。LDCT 去噪的主流典範基於神經網路模型，該模型會學習資料驅動的影像先驗，以區分劑量降低所產生的雜訊與底層組織訊號。自然而然，這些先驗的保真度取決於模型擷取 CT 影像中廣泛脈絡特徵的能力。較早的卷積神經網路 (CNN) 非常擅長有效擷取短程空間脈絡，但其有限的感受野會降低對較長距離交互作用的敏感度。儘管基於自我注意機制的Transformer最近被提出用於增加對長程脈絡的敏感度，但由於模型複雜度提高，它們可能會因次佳效能和效率而受限，特別是對於高解析度 CT 影像。為了高品質復原 LDCT 影像，我們在此介紹 DenoMamba，這是一種基於狀態空間模型 (SSM) 的創新去噪方法，它能有效擷取醫學影像中的短程和長程脈絡。DenoMamba 採用具有編碼器-解碼器階段的沙漏架構，並使用空間 SSM 模組來編碼空間脈絡，以及配備次要閘控卷積網路的新型通道 SSM 模組，以編碼各個階段中通道脈絡的潛在特徵。然後透過卷積融合模組 (CFM) 將兩個模組中的特徵圖與低階輸入特徵合併。在劑量降低 25% 和 10% 的 LDCT 資料集上進行的全面實驗證明，DenoMamba 的效能優於最先進的去噪器，在復原影像品質方面平均改善了 1.4dB PSNR、1.1% SSIM 和 1.6% RMSE。", "author": "Şaban Öztürk et.al.", "authors": "Şaban Öztürk, Oğuz Can Duran, Tolga Çukur", "id": "2409.13094v1", "paper_url": "http://arxiv.org/abs/2409.13094v1", "repo": "null"}}