{"2408.08147": {"publish_time": "2024-08-15", "title": "P/D-Serve: Serving Disaggregated Large Language Model at Scale", "paper_summary": "Serving disaggregated large language models (LLMs) over tens of thousands of\nxPU devices (GPUs or NPUs) with reliable performance faces multiple challenges.\n1) Ignoring the diversity (various prefixes and tidal requests), treating all\nthe prompts in a mixed pool is inadequate. To facilitate the similarity per\nscenario and minimize the inner mismatch on P/D (prefill and decoding)\nprocessing, fine-grained organization is required, dynamically adjusting P/D\nratios for better performance. 2) Due to inaccurate estimation on workload\n(queue status or maintained connections), the global scheduler easily incurs\nunnecessary timeouts in prefill. 3) Block-fixed device-to-device (D2D) KVCache\ntransfer over cluster-level RDMA (remote direct memory access) fails to achieve\ndesired D2D utilization as expected. To overcome previous problems, this paper\nproposes an end-to-end system P/D-Serve, complying with the paradigm of MLOps\n(machine learning operations), which models end-to-end (E2E) P/D performance\nand enables: 1) fine-grained P/D organization, mapping the service with RoCE\n(RDMA over converged ethernet) as needed, to facilitate similar processing and\ndynamic adjustments on P/D ratios; 2) on-demand forwarding upon rejections for\nidle prefill, decoupling the scheduler from regular inaccurate reports and\nlocal queues, to avoid timeouts in prefill; and 3) efficient KVCache transfer\nvia optimized D2D access. P/D-Serve is implemented upon Ascend and MindSpore,\nhas been deployed over tens of thousands of NPUs for more than eight months in\ncommercial use, and further achieves 60\\%, 42\\% and 46\\% improvements on E2E\nthroughput, time-to-first-token (TTFT) SLO (service level objective) and D2D\ntransfer time. As the E2E system with optimizations, P/D-Serve achieves 6.7x\nincrease on throughput, compared with aggregated LLMs.", "paper_summary_zh": "<paragraph>在數萬個 xPU 裝置（GPU 或 NPU）上提供具備可靠效能的分散式大型語言模型 (LLM)，會面臨多項挑戰。1) 忽略多樣性（各種前綴和潮汐要求），將所有提示視為混合池是不夠的。為了促進每個場景的相似性並最小化 P/D（預填和解碼）處理中的內部不匹配，需要細緻的組織，動態調整 P/D 比例以獲得更好的效能。2) 由於對工作負載（佇列狀態或維護連線）的估計不準確，因此全域排程器很容易在預填時造成不必要的逾時。3) 區塊固定的裝置對裝置 (D2D) KVCache 傳輸透過叢集層級的 RDMA（遠端直接記憶體存取）無法達到預期的理想 D2D 使用率。為了克服以前的問題，本文提出了一個端對端系統 P/D-Serve，符合 MLOps（機器學習作業）的範例，它建構了端對端 (E2E) P/D 效能，並啟用：1) 細緻的 P/D 組織，根據需要將服務對應到 RoCE（聚合乙太網路上的 RDMA），以促進類似的處理和 P/D 比例的動態調整；2) 在拒絕閒置預填時進行依需求轉發，將排程器從定期不準確的報告和本機佇列中分離出來，以避免預填逾時；3) 透過最佳化的 D2D 存取進行有效的 KVCache 傳輸。P/D-Serve 是在 Ascend 和 MindSpore 上實作的，已在數萬個 NPU 上部署超過八個月，在商業用途上進一步實現了 E2E 吞吐量、首次代幣時間 (TTFT) SLO（服務等級目標）和 D2D 傳輸時間分別提升了 60%、42% 和 46%。作為具備最佳化的 E2E 系統，P/D-Serve 在吞吐量上實現了 6.7 倍的提升，與聚集式 LLM 相比。</paragraph>", "author": "Yibo Jin et.al.", "authors": "Yibo Jin, Tao Wang, Huimin Lin, Mingyang Song, Peiyang Li, Yipeng Ma, Yicheng Shan, Zhengfan Yuan, Cailong Li, Yajing Sun, Tiandeng Wu, Xing Chu, Ruizhi Huan, Li Ma, Xiao You, Wenting Zhou, Yunpeng Ye, Wen Liu, Xiangkun Xu, Yongsheng Zhang, Tiantian Dong, Jiawei Zhu, Zhe Wang, Xijian Ju, Jianxun Song, Haoliang Cheng, Xiaojing Li, Jiandong Ding, Hefei Guo, Zhengyong Zhang", "id": "2408.08147v1", "paper_url": "http://arxiv.org/abs/2408.08147v1", "repo": "null"}}