{"2408.02239": {"publish_time": "2024-08-05", "title": "BOTS-LM: Training Large Language Models for Setswana", "paper_summary": "In this work we present BOTS-LM, a series of bilingual language models\nproficient in both Setswana and English. Leveraging recent advancements in data\navailability and efficient fine-tuning, BOTS-LM achieves performance similar to\nmodels significantly larger than itself while maintaining computational\nefficiency. Our initial release features an 8 billion parameter generative\nlarge language model, with upcoming 0.5 billion and 1 billion parameter large\nlanguage models and a 278 million parameter encoder-only model soon to be\nreleased. We find the 8 billion parameter model significantly outperforms\nLlama-3-70B and Aya 23 on English-Setswana translation tasks, approaching the\nperformance of dedicated machine translation models, while approaching 70B\nparameter performance on Setswana reasoning as measured by a machine translated\nsubset of the MMLU benchmark. To accompany the BOTS-LM series of language\nmodels, we release the largest Setswana web dataset, SetsText, totalling over\n267 million tokens. In addition, we release the largest machine translated\nSetswana dataset, the first and largest synthetic Setswana dataset, training\nand evaluation code, training logs, and MMLU-tsn, a machine translated subset\nof MMLU.", "paper_summary_zh": "在這項工作中，我們展示了 BOTS-LM，這是一系列精通塞茨瓦納語和英語的雙語語言模型。利用數據可用性和高效微調的最新進展，BOTS-LM 達到了與自身大得多的模型相似的性能，同時保持了計算效率。我們的初始版本具有 80 億個參數的生成式大型語言模型，即將推出的 0.5 億和 10 億個參數大型語言模型，以及一個 2.78 億個參數的僅編碼器模型。我們發現，80 億個參數的模型在英語-塞茨瓦納語翻譯任務中顯著優於 Llama-3-70B 和 Aya 23，接近專用機器翻譯模型的性能，同時在通過機器翻譯的 MMLU 基準子集測量的塞茨瓦納語推理方面接近 70B 參數性能。為了配合 BOTS-LM 系列語言模型，我們發布了最大的塞茨瓦納語網路數據集 SetsText，總計超過 2.67 億個令牌。此外，我們發布了最大的機器翻譯塞茨瓦納語數據集、第一個也是最大的合成塞茨瓦納語數據集、訓練和評估代碼、訓練日誌和 MMLU-tsn，這是 MMLU 的機器翻譯子集。", "author": "Nathan Brown et.al.", "authors": "Nathan Brown, Vukosi Marivate", "id": "2408.02239v1", "paper_url": "http://arxiv.org/abs/2408.02239v1", "repo": "null"}}