{"2501.01785": {"publish_time": "2025-01-03", "title": "Can Synthetic Data be Fair and Private? A Comparative Study of Synthetic Data Generation and Fairness Algorithms", "paper_summary": "The increasing use of machine learning in learning analytics (LA) has raised\nsignificant concerns around algorithmic fairness and privacy. Synthetic data\nhas emerged as a dual-purpose tool, enhancing privacy and improving fairness in\nLA models. However, prior research suggests an inverse relationship between\nfairness and privacy, making it challenging to optimize both. This study\ninvestigates which synthetic data generators can best balance privacy and\nfairness, and whether pre-processing fairness algorithms, typically applied to\nreal datasets, are effective on synthetic data. Our results highlight that the\nDEbiasing CAusal Fairness (DECAF) algorithm achieves the best balance between\nprivacy and fairness. However, DECAF suffers in utility, as reflected in its\npredictive accuracy. Notably, we found that applying pre-processing fairness\nalgorithms to synthetic data improves fairness even more than when applied to\nreal data. These findings suggest that combining synthetic data generation with\nfairness pre-processing offers a promising approach to creating fairer LA\nmodels.", "paper_summary_zh": "機器學習在學習分析 (LA) 中的應用日益增加，對演算法公平性和隱私提出了重大疑慮。合成資料已成為一種雙重用途的工具，增強了隱私並改善了 LA 模型的公平性。然而，先前的研究表明公平性和隱私之間存在反比關係，這使得同時優化兩者具有挑戰性。本研究探討了哪些合成資料產生器可以最好地平衡隱私和公平性，以及通常應用於實際資料集的預處理公平性演算法是否對合成資料有效。我們的結果強調，DEbiasing CAusal Fairness (DECAF) 演算法在隱私和公平性之間取得了最佳平衡。然而，DECAF 在效用方面有所不足，這反映在其預測準確度上。值得注意的是，我們發現將預處理公平性演算法應用於合成資料比應用於實際資料時更能改善公平性。這些發現表明，將合成資料產生與公平性預處理結合起來，提供了一種很有前途的方法來建立更公平的 LA 模型。", "author": "Qinyi Liu et.al.", "authors": "Qinyi Liu, Oscar Deho, Farhad Vadiee, Mohammad Khalil, Srecko Joksimovic, George Siemens", "id": "2501.01785v1", "paper_url": "http://arxiv.org/abs/2501.01785v1", "repo": "null"}}