{"2406.15173": {"publish_time": "2024-06-21", "title": "Évaluation des capacités de réponse de larges modèles de langage (LLM) pour des questions d'historiens", "paper_summary": "Large Language Models (LLMs) like ChatGPT or Bard have revolutionized\ninformation retrieval and captivated the audience with their ability to\ngenerate custom responses in record time, regardless of the topic. In this\narticle, we assess the capabilities of various LLMs in producing reliable,\ncomprehensive, and sufficiently relevant responses about historical facts in\nFrench. To achieve this, we constructed a testbed comprising numerous\nhistory-related questions of varying types, themes, and levels of difficulty.\nOur evaluation of responses from ten selected LLMs reveals numerous\nshortcomings in both substance and form. Beyond an overall insufficient\naccuracy rate, we highlight uneven treatment of the French language, as well as\nissues related to verbosity and inconsistency in the responses provided by\nLLMs.", "paper_summary_zh": "大型語言模型 (LLM)，例如 ChatGPT 或 Bard，徹底革新了資訊檢索，並以其在創紀錄的時間內生成自訂回應的能力，無論主題為何，都讓受眾著迷。在本文中，我們評估了各種 LLM 在產生可靠、全面且足夠相關的法國歷史事實回應方面的能力。為此，我們構建了一個測試平台，其中包含許多不同類型、主題和難度等級的與歷史相關的問題。我們對十個選定的 LLM 的回應進行評估，揭示了實質和形式上的眾多缺點。除了整體準確率不足之外，我們還強調了法語處理的不均衡，以及 LLM 提供的回應中冗長和不一致的問題。", "author": "Mathieu Chartier et.al.", "authors": "Mathieu Chartier, Nabil Dakkoune, Guillaume Bourgeois, Stéphane Jean", "id": "2406.15173v1", "paper_url": "http://arxiv.org/abs/2406.15173v1", "repo": "null"}}