{"2408.15294": {"publish_time": "2024-08-27", "title": "Evaluating the Predictive Features of Person-Centric Knowledge Graph Embeddings: Unfolding Ablation Studies", "paper_summary": "Developing novel predictive models with complex biomedical information is\nchallenging due to various idiosyncrasies related to heterogeneity,\nstandardization or sparseness of the data. We previously introduced a\nperson-centric ontology to organize information about individual patients, and\na representation learning framework to extract person-centric knowledge graphs\n(PKGs) and to train Graph Neural Networks (GNNs). In this paper, we propose a\nsystematic approach to examine the results of GNN models trained with both\nstructured and unstructured information from the MIMIC-III dataset. Through\nablation studies on different clinical, demographic, and social data, we show\nthe robustness of this approach in identifying predictive features in PKGs for\nthe task of readmission prediction.", "paper_summary_zh": "開發具有複雜生物醫學資訊的新穎預測模型具有挑戰性，這是由於與資料的異質性、標準化或稀疏性相關的各種特殊性。我們之前引入了以人為中心的本体，以組織有關個別患者的資訊，並建立了一個表示學習架構，以提取以人為中心的知識圖譜 (PKG) 並訓練圖神經網路 (GNN)。在本文中，我們提出了一種系統性的方法，以檢查使用來自 MIMIC-III 資料集的結構化和非結構化資訊訓練的 GNN 模型的結果。透過對不同的臨床、人口統計和社會資料進行消融研究，我們展示了這種方法在識別 PKG 中的預測特徵以進行再入院預測任務時的穩健性。", "author": "Christos Theodoropoulos et.al.", "authors": "Christos Theodoropoulos, Natasha Mulligan, Joao Bettencourt-Silva", "id": "2408.15294v1", "paper_url": "http://arxiv.org/abs/2408.15294v1", "repo": "null"}}