{"2405.04135": {"publish_time": "2024-05-07", "title": "In-context Learning for Automated Driving Scenarios", "paper_summary": "One of the key challenges in current Reinforcement Learning (RL)-based\nAutomated Driving (AD) agents is achieving flexible, precise, and human-like\nbehavior cost-effectively. This paper introduces an innovative approach\nutilizing Large Language Models (LLMs) to intuitively and effectively optimize\nRL reward functions in a human-centric way. We developed a framework where\ninstructions and dynamic environment descriptions are input into the LLM. The\nLLM then utilizes this information to assist in generating rewards, thereby\nsteering the behavior of RL agents towards patterns that more closely resemble\nhuman driving. The experimental results demonstrate that this approach not only\nmakes RL agents more anthropomorphic but also reaches better performance.\nAdditionally, various strategies for reward-proxy and reward-shaping are\ninvestigated, revealing the significant impact of prompt design on shaping an\nAD vehicle's behavior. These findings offer a promising direction for the\ndevelopment of more advanced and human-like automated driving systems. Our\nexperimental data and source code can be found here.", "paper_summary_zh": "在當前基於強化學習 (RL) 的自動駕駛 (AD) 代理中，關鍵挑戰之一是以具有成本效益的方式實現靈活、精確且類人的行為。本文介紹了一種創新的方法，利用大型語言模型 (LLM) 以直觀且有效的方式以人為中心的方式最佳化 RL 獎勵函數。我們開發了一個框架，其中將指令和動態環境描述輸入到 LLM 中。然後，LLM 利用這些資訊來協助產生獎勵，從而引導 RL 代理的行為朝更接近人類駕駛的模式。實驗結果表明，這種方法不僅使 RL 代理更擬人化，而且還達到了更好的性能。此外，研究了各種獎勵代理和獎勵塑造策略，揭示了提示設計對塑造 AD 車輛行為的重大影響。這些發現為開發更先進、更類人的自動駕駛系統提供了有希望的方向。我們的實驗數據和源代碼可以在這裡找到。", "author": "Ziqi Zhou et.al.", "authors": "Ziqi Zhou, Jingyue Zhang, Jingyuan Zhang, Boyue Wang, Tianyu Shi, Alaa Khamis", "id": "2405.04135v1", "paper_url": "http://arxiv.org/abs/2405.04135v1", "repo": "null"}}