{"2502.03979": {"publish_time": "2025-02-06", "title": "Towards Unified Music Emotion Recognition across Dimensional and Categorical Models", "paper_summary": "One of the most significant challenges in Music Emotion Recognition (MER)\ncomes from the fact that emotion labels can be heterogeneous across datasets\nwith regard to the emotion representation, including categorical (e.g., happy,\nsad) versus dimensional labels (e.g., valence-arousal). In this paper, we\npresent a unified multitask learning framework that combines these two types of\nlabels and is thus able to be trained on multiple datasets. This framework uses\nan effective input representation that combines musical features (i.e., key and\nchords) and MERT embeddings. Moreover, knowledge distillation is employed to\ntransfer the knowledge of teacher models trained on individual datasets to a\nstudent model, enhancing its ability to generalize across multiple tasks. To\nvalidate our proposed framework, we conducted extensive experiments on a\nvariety of datasets, including MTG-Jamendo, DEAM, PMEmo, and EmoMusic.\nAccording to our experimental results, the inclusion of musical features,\nmultitask learning, and knowledge distillation significantly enhances\nperformance. In particular, our model outperforms the state-of-the-art models,\nincluding the best-performing model from the MediaEval 2021 competition on the\nMTG-Jamendo dataset. Our work makes a significant contribution to MER by\nallowing the combination of categorical and dimensional emotion labels in one\nunified framework, thus enabling training across datasets.", "paper_summary_zh": "音樂情緒辨識 (MER) 中最顯著的挑戰之一是，情緒標籤在資料集之間可能不盡相同，這取決於情緒表徵，包括分類標籤（例如：快樂、悲傷）與維度標籤（例如：效價-喚醒）。在本文中，我們提出一個統一的多任務學習架構，結合這兩種標籤類型，因此能夠在多個資料集上進行訓練。此架構使用一種有效的輸入表徵，結合音樂特徵（即，音調和弦）和 MERT 嵌入。此外，知識蒸餾用於將在個別資料集上訓練的教師模型的知識傳輸給學生模型，增強其跨多個任務進行概括的能力。為了驗證我們提出的架構，我們對各種資料集進行了廣泛的實驗，包括 MTG-Jamendo、DEAM、PMEmo 和 EmoMusic。根據我們的實驗結果，音樂特徵、多任務學習和知識蒸餾的加入顯著提升了效能。特別是，我們的模型優於最先進的模型，包括 MediaEval 2021 競賽中在 MTG-Jamendo 資料集上表現最佳的模型。我們的研究透過允許在一個統一的架構中結合分類和維度情緒標籤，對 MER 做出重大貢獻，從而能夠跨資料集進行訓練。", "author": "Jaeyong Kang et.al.", "authors": "Jaeyong Kang, Dorien Herremans", "id": "2502.03979v1", "paper_url": "http://arxiv.org/abs/2502.03979v1", "repo": "null"}}