{"2407.03181": {"publish_time": "2024-07-03", "title": "Fine-Tuning with Divergent Chains of Thought Boosts Reasoning Through Self-Correction in Language Models", "paper_summary": "Requiring a Large Language Model to generate intermediary reasoning steps has\nbeen shown to be an effective way of boosting performance. In fact, it has been\nfound that instruction tuning on these intermediary reasoning steps improves\nmodel performance. In this work, we present a novel method of further improving\nperformance by requiring models to compare multiple reasoning chains before\ngenerating a solution in a single inference step. We call this method Divergent\nCoT (DCoT). We find that instruction tuning on DCoT datasets boosts the\nperformance of even smaller, and therefore more accessible, LLMs. Through a\nrigorous set of experiments spanning a wide range of tasks that require various\nreasoning types, we show that fine-tuning on DCoT consistently improves\nperformance over the CoT baseline across model families and scales (1.3B to\n70B). Through a combination of empirical and manual evaluation, we additionally\nshow that these performance gains stem from models generating multiple\ndivergent reasoning chains in a single inference step, indicative of the\nenabling of self-correction in language models. Our code and data are publicly\navailable at https://github.com/UKPLab/arxiv2024-divergent-cot.", "paper_summary_zh": "<paragraph>要求大型语言模型生成中间推理步骤已被证明是提升性能的有效方法。事实上，已经发现对这些中间推理步骤的指令微调可以提升模型性能。在这项工作中，我们提出了一种通过要求模型在单个推理步骤中生成解决方案之前比较多个推理链来进一步提升性能的新方法。我们称这种方法为发散 CoT (DCoT)。我们发现对 DCoT 数据集的指令微调可以提升更小且因此更容易获取的 LLM 的性能。通过一组严格的实验，涵盖需要各种推理类型的广泛任务，我们表明在 DCoT 上进行微调可以持续提升 CoT 基线在模型系列和规模（1.3B 到 70B）上的性能。通过实证和手动评估的结合，我们还表明这些性能提升源于模型在单个推理步骤中生成多个发散推理链，这表明语言模型中启用了自我纠正。我们的代码和数据已公开发布在 https://github.com/UKPLab/arxiv2024-divergent-cot。</paragraph>", "author": "Haritz Puerto et.al.", "authors": "Haritz Puerto, Tilek Chubakov, Xiaodan Zhu, Harish Tayyar Madabushi, Iryna Gurevych", "id": "2407.03181v1", "paper_url": "http://arxiv.org/abs/2407.03181v1", "repo": "https://github.com/ukplab/arxiv2024-divergent-cot"}}