{"2407.21041": {"publish_time": "2024-07-21", "title": "They Look Like Each Other: Case-based Reasoning for Explainable Depression Detection on Twitter using Large Language Models", "paper_summary": "Depression is a common mental health issue that requires prompt diagnosis and\ntreatment. Despite the promise of social media data for depression detection,\nthe opacity of employed deep learning models hinders interpretability and\nraises bias concerns. We address this challenge by introducing ProtoDep, a\nnovel, explainable framework for Twitter-based depression detection. ProtoDep\nleverages prototype learning and the generative power of Large Language Models\nto provide transparent explanations at three levels: (i) symptom-level\nexplanations for each tweet and user, (ii) case-based explanations comparing\nthe user to similar individuals, and (iii) transparent decision-making through\nclassification weights. Evaluated on five benchmark datasets, ProtoDep achieves\nnear state-of-the-art performance while learning meaningful prototypes. This\nmulti-faceted approach offers significant potential to enhance the reliability\nand transparency of depression detection on social media, ultimately aiding\nmental health professionals in delivering more informed care.", "paper_summary_zh": "憂鬱症是一種常見的精神健康問題，需要及時診斷和治療。儘管社群媒體資料有望用於憂鬱症偵測，但所採用的深度學習模型的不透明性阻礙了解，並引發偏見疑慮。我們透過引入 ProtoDep 來解決這個挑戰，這是一個新穎且可解釋的架構，用於基於 Twitter 的憂鬱症偵測。ProtoDep 利用原型學習和大型語言模型的生成能力，在三個層級提供透明的解釋：(i) 對每則推文和使用者的症狀層級解釋，(ii) 將使用者與類似個體進行比較的情境式解釋，以及 (iii) 透過分類權重進行透明的決策制定。在五個基準資料集上進行評估，ProtoDep 在學習有意義的原型時，達到了接近最先進的效能。這種多面向的方法提供了顯著的潛力，以增強社群媒體上憂鬱症偵測的可靠性和透明度，最終協助心理健康專業人員提供更明智的照護。", "author": "Mohammad Saeid Mahdavinejad et.al.", "authors": "Mohammad Saeid Mahdavinejad, Peyman Adibi, Amirhassan Monadjemi, Pascal Hitzler", "id": "2407.21041v1", "paper_url": "http://arxiv.org/abs/2407.21041v1", "repo": "null"}}