{"2408.02976": {"publish_time": "2024-08-06", "title": "Empathy Level Alignment via Reinforcement Learning for Empathetic Response Generation", "paper_summary": "Empathetic response generation, aiming at understanding the user's situation\nand feelings and respond empathically, is crucial in building human-like\ndialogue systems. Previous methods mainly focus on using maximum likelihood\nestimation as the optimization objective for training response generation\nmodels, without taking into account the empathy level alignment between\ngenerated responses and target responses. To this end, we propose an empathetic\nresponse generation using reinforcement learning (EmpRL) framework. The\nframework designs an effective empathy reward function and generates empathetic\nresponses by maximizing the expected reward through reinforcement learning.\nGiven the powerful text generation capability of pre-trained language models,\nEmpRL utilizes the pre-trained T5 model as the generator and conducts further\ntraining to initialize the policy. To align the empathy level between generated\nresponses and target responses in the context, an empathy reward function\ncontaining three empathy communication mechanisms, i.e., emotional reaction,\ninterpretation, and exploration, is constructed using pre-designed and\npre-trained empathy identifiers. Finally, the proximal policy optimization\nalgorithm is used to further train the policy to produce empathetic responses.\nBoth automatic and manual evaluations demonstrate that the proposed EmpRL\nframework can improve the quality of generated responses, enhance the empathy\nlevel similarity between generated and target responses, and produce empathetic\nresponses covering both affective and cognitive aspects.", "paper_summary_zh": "同理心回應生成，旨在理解使用者的處境和感受，並以同理心回應，對於建立類人對話系統至關重要。先前的研究方法主要著重於使用最大似然估計作為訓練回應生成模型的最佳化目標，而未考量生成回應與目標回應之間的同理心層級對齊。為此，我們提出了一個使用強化學習（EmpRL）架構的同理心回應生成方法。該架構設計了一個有效的同理心回饋函數，並透過強化學習最大化預期回饋來產生同理心回應。鑑於預先訓練的語言模型強大的文字生成能力，EmpRL 使用預先訓練的 T5 模型作為生成器，並進行進一步的訓練來初始化政策。為了在脈絡中對齊生成回應與目標回應的同理心層級，我們使用預先設計和預先訓練的同理心識別符號，建構了一個包含三種同理心溝通機制的同理心回饋函數，即情緒反應、詮釋和探索。最後，我們使用近端政策最佳化演算法進一步訓練政策，以產生同理心回應。自動和手動評估均顯示，所提出的 EmpRL 架構可以提升生成回應的品質，增強生成回應與目標回應之間的同理心層級相似性，並產生涵蓋情感和認知層面的同理心回應。", "author": "Hui Ma et.al.", "authors": "Hui Ma, Bo Zhang, Bo Xu, Jian Wang, Hongfei Lin, Xiao Sun", "id": "2408.02976v1", "paper_url": "http://arxiv.org/abs/2408.02976v1", "repo": "null"}}