{"2410.09045": {"publish_time": "2024-10-11", "title": "MiRAGeNews: Multimodal Realistic AI-Generated News Detection", "paper_summary": "The proliferation of inflammatory or misleading \"fake\" news content has\nbecome increasingly common in recent years. Simultaneously, it has become\neasier than ever to use AI tools to generate photorealistic images depicting\nany scene imaginable. Combining these two -- AI-generated fake news content --\nis particularly potent and dangerous. To combat the spread of AI-generated fake\nnews, we propose the MiRAGeNews Dataset, a dataset of 12,500 high-quality real\nand AI-generated image-caption pairs from state-of-the-art generators. We find\nthat our dataset poses a significant challenge to humans (60% F-1) and\nstate-of-the-art multi-modal LLMs (< 24% F-1). Using our dataset we train a\nmulti-modal detector (MiRAGe) that improves by +5.1% F-1 over state-of-the-art\nbaselines on image-caption pairs from out-of-domain image generators and news\npublishers. We release our code and data to aid future work on detecting\nAI-generated content.", "paper_summary_zh": "近年來，煽動性或誤導性的「假」新聞內容的散布越來越普遍。同時，使用 AI 工具來產生描繪任何場景的逼真影像也比以往任何時候都容易。結合這兩者——AI 生成的假新聞內容——特別有效且危險。為了打擊 AI 生成的假新聞散布，我們提出了 MiRAGeNews 資料集，這是一個包含 12,500 個來自最先進生成器的優質真實和 AI 生成的圖像標題配對的資料集。我們發現我們的資料集對人類（60% F-1）和最先進的多模態 LLM（< 24% F-1）構成重大挑戰。使用我們的資料集，我們訓練了一個多模態檢測器 (MiRAGe)，它在來自領域外圖像生成器和新聞發布者的圖像標題配對上比最先進的基準提高了 +5.1% F-1。我們發布我們的程式碼和資料，以幫助未來檢測 AI 生成的內容的工作。", "author": "Runsheng Huang et.al.", "authors": "Runsheng Huang, Liam Dugan, Yue Yang, Chris Callison-Burch", "id": "2410.09045v1", "paper_url": "http://arxiv.org/abs/2410.09045v1", "repo": "null"}}