{"2405.15568": {"publish_time": "2024-05-24", "title": "OMNI-EPIC: Open-endedness via Models of human Notions of Interestingness with Environments Programmed in Code", "paper_summary": "Open-ended and AI-generating algorithms aim to continuously generate and\nsolve increasingly complex tasks indefinitely, offering a promising path toward\nmore general intelligence. To accomplish this grand vision, learning must occur\nwithin a vast array of potential tasks. Existing approaches to automatically\ngenerating environments are constrained within manually predefined, often\nnarrow distributions of environment, limiting their ability to create any\nlearning environment. To address this limitation, we introduce a novel\nframework, OMNI-EPIC, that augments previous work in Open-endedness via Models\nof human Notions of Interestingness (OMNI) with Environments Programmed in Code\n(EPIC). OMNI-EPIC leverages foundation models to autonomously generate code\nspecifying the next learnable (i.e., not too easy or difficult for the agent's\ncurrent skill set) and interesting (e.g., worthwhile and novel) tasks.\nOMNI-EPIC generates both environments (e.g., an obstacle course) and reward\nfunctions (e.g., progress through the obstacle course quickly without touching\nred objects), enabling it, in principle, to create any simulatable learning\ntask. We showcase the explosive creativity of OMNI-EPIC, which continuously\ninnovates to suggest new, interesting learning challenges. We also highlight\nhow OMNI-EPIC can adapt to reinforcement learning agents' learning progress,\ngenerating tasks that are of suitable difficulty. Overall, OMNI-EPIC can\nendlessly create learnable and interesting environments, further propelling the\ndevelopment of self-improving AI systems and AI-Generating Algorithms. Project\nwebsite with videos: https://dub.sh/omniepic", "paper_summary_zh": "開放式和 AI 生成演算法旨在持續生成和解決越來越複雜的任務，提供一條通往更通用智慧的道路。為了實現這個宏偉的願景，學習必須發生在大量的潛在任務中。自動產生環境的現有方法受限於手動預定義的、通常狹窄的環境分佈，限制了它們建立任何學習環境的能力。為了解決這個限制，我們引入了一個新的框架 OMNI-EPIC，它透過人類有趣概念模型 (OMNI) 的開放性，以及用程式碼編寫的環境 (EPIC) 來擴充先前的研究。OMNI-EPIC 利用基礎模型來自主產生程式碼，指定下一個可學習的（例如，對於代理目前的技能組來說不太容易或太困難）且有趣的（例如，有價值且新穎）任務。OMNI-EPIC 產生環境（例如，障礙賽）和獎勵函數（例如，快速通過障礙賽而不接觸紅色物體），在原則上，它能夠建立任何可模擬的學習任務。我們展示了 OMNI-EPIC 的爆炸性創造力，它不斷創新，提出新的、有趣的學習挑戰。我們也強調 OMNI-EPIC 如何適應強化學習代理的學習進度，產生難度適中的任務。總而言之，OMNI-EPIC 可以無止盡地建立可學習且有趣的環境，進一步推動自我提升 AI 系統和 AI 生成演算法的發展。專案網站和影片：https://dub.sh/omniepic", "author": "Maxence Faldor et.al.", "authors": "Maxence Faldor, Jenny Zhang, Antoine Cully, Jeff Clune", "id": "2405.15568v1", "paper_url": "http://arxiv.org/abs/2405.15568v1", "repo": "null"}}