{"2410.05076": {"publish_time": "2024-10-07", "title": "TidalDecode: Fast and Accurate LLM Decoding with Position Persistent Sparse Attention", "paper_summary": "Large language models (LLMs) have driven significant advancements across\ndiverse NLP tasks, with long-context models gaining prominence for handling\nextended inputs. However, the expanding key-value (KV) cache size required by\nTransformer architectures intensifies the memory constraints, particularly\nduring the decoding phase, creating a significant bottleneck. Existing sparse\nattention mechanisms designed to address this bottleneck have two limitations:\n(1) they often fail to reliably identify the most relevant tokens for\nattention, and (2) they overlook the spatial coherence of token selection\nacross consecutive Transformer layers, which can lead to performance\ndegradation and substantial overhead in token selection. This paper introduces\nTidalDecode, a simple yet effective algorithm and system for fast and accurate\nLLM decoding through position persistent sparse attention. TidalDecode\nleverages the spatial coherence of tokens selected by existing sparse attention\nmethods and introduces a few token selection layers that perform full attention\nto identify the tokens with the highest attention scores, while all other\nlayers perform sparse attention with the pre-selected tokens. This design\nenables TidalDecode to substantially reduce the overhead of token selection for\nsparse attention without sacrificing the quality of the generated results.\nEvaluation on a diverse set of LLMs and tasks shows that TidalDecode closely\nmatches the generative performance of full attention methods while reducing the\nLLM decoding latency by up to 2.1x.", "paper_summary_zh": "大型語言模型 (LLM) 已推動各種 NLP 任務的顯著進展，其中長語境模型在處理擴充輸入方面越來越重要。然而，Transformer 架構所需的擴充鍵值 (KV) 快取大小加劇了記憶體限制，特別是在解碼階段，造成顯著的瓶頸。現有的稀疏注意力機制旨在解決此瓶頸，但有兩個限制：(1) 它們通常無法可靠地識別最相關的注意力權重，以及 (2) 它們忽略了跨連續 Transformer 層的權重選擇空間一致性，這可能導致權重選擇效能下降和大量開銷。本文介紹 TidalDecode，一種透過位置持續稀疏注意力進行快速且準確的 LLM 解碼的簡單但有效的演算法和系統。TidalDecode 利用現有稀疏注意力方法所選權重的空間一致性，並引入幾個執行完整注意力的權重選擇層，以識別具有最高注意力分數的權重，而所有其他層則對預先選取的權重執行稀疏注意力。此設計使 TidalDecode 能夠大幅減少稀疏注意力的權重選擇開銷，而不會犧牲生成結果的品質。在各種 LLM 和任務上的評估顯示，TidalDecode 與完整注意力方法的生成效能非常接近，同時將 LLM 解碼延遲減少多達 2.1 倍。", "author": "Lijie Yang et.al.", "authors": "Lijie Yang, Zhihao Zhang, Zhuofu Chen, Zikun Li, Zhihao Jia", "id": "2410.05076v1", "paper_url": "http://arxiv.org/abs/2410.05076v1", "repo": "null"}}