{"2407.04179": {"publish_time": "2024-07-04", "title": "Defense Against Syntactic Textual Backdoor Attacks with Token Substitution", "paper_summary": "Textual backdoor attacks present a substantial security risk to Large\nLanguage Models (LLM). It embeds carefully chosen triggers into a victim model\nat the training stage, and makes the model erroneously predict inputs\ncontaining the same triggers as a certain class. Prior backdoor defense methods\nprimarily target special token-based triggers, leaving syntax-based triggers\ninsufficiently addressed. To fill this gap, this paper proposes a novel online\ndefense algorithm that effectively counters syntax-based as well as special\ntoken-based backdoor attacks. The algorithm replaces semantically meaningful\nwords in sentences with entirely different ones but preserves the syntactic\ntemplates or special tokens, and then compares the predicted labels before and\nafter the substitution to determine whether a sentence contains triggers.\nExperimental results confirm the algorithm's performance against these two\ntypes of triggers, offering a comprehensive defense strategy for model\nintegrity.", "paper_summary_zh": "文本後門攻擊對大型語言模型 (LLM) 構成重大安全風險。它在訓練階段將精心挑選的觸發器嵌入受害者模型中，並讓模型錯誤地預測包含與特定類別相同的觸發器的輸入。先前的後門防禦方法主要針對基於特殊令牌的觸發器，而語法觸發器則處理不足。為了填補這一空白，本文提出了一種新穎的在線防禦演算法，可以有效地對抗基於語法的後門攻擊以及基於特殊令牌的後門攻擊。該演算法用完全不同的詞彙取代句子中具有語義意義的詞彙，但保留語法範本或特殊令牌，然後比較替換前後預測的標籤，以確定句子是否包含觸發器。實驗結果證實了該演算法對這兩種觸發器的效能，為模型完整性提供了一個全面的防禦策略。", "author": "Xinglin Li et.al.", "authors": "Xinglin Li, Xianwen He, Yao Li, Minhao Cheng", "id": "2407.04179v1", "paper_url": "http://arxiv.org/abs/2407.04179v1", "repo": "null"}}