{"2405.04245": {"publish_time": "2024-05-07", "title": "Exploring Correlations of Self-supervised Tasks for Graphs", "paper_summary": "Graph self-supervised learning has sparked a research surge in training\ninformative representations without accessing any labeled data. However, our\nunderstanding of graph self-supervised learning remains limited, and the\ninherent relationships between various self-supervised tasks are still\nunexplored. Our paper aims to provide a fresh understanding of graph\nself-supervised learning based on task correlations. Specifically, we evaluate\nthe performance of the representations trained by one specific task on other\ntasks and define correlation values to quantify task correlations. Through this\nprocess, we unveil the task correlations between various self-supervised tasks\nand can measure their expressive capabilities, which are closely related to\ndownstream performance. By analyzing the correlation values between tasks\nacross various datasets, we reveal the complexity of task correlations and the\nlimitations of existing multi-task learning methods. To obtain more capable\nrepresentations, we propose Graph Task Correlation Modeling (GraphTCM) to\nillustrate the task correlations and utilize it to enhance graph\nself-supervised training. The experimental results indicate that our method\nsignificantly outperforms existing methods across various downstream tasks.", "paper_summary_zh": "圖形自我監督學習激發了在不存取任何標籤資料的情況下訓練資訊表徵的研究熱潮。然而，我們對圖形自我監督學習的理解仍然有限，而且各種自我監督任務之間的內在關係仍然未被探索。我們的論文旨在根據任務相關性提供對圖形自我監督學習的新理解。具體來說，我們評估由特定任務訓練的表徵在其他任務上的效能，並定義相關性值以量化任務相關性。透過這個過程，我們揭示了各種自我監督任務之間的任務相關性，並可以衡量它們的表達能力，這與下游效能密切相關。透過分析跨各種資料集的任務之間的相關性值，我們揭示了任務相關性的複雜性以及現有多任務學習方法的限制。為了獲得更強大的表徵，我們提出了圖形任務相關性建模 (GraphTCM) 來說明任務相關性，並利用它來增強圖形自我監督訓練。實驗結果表明，我們的模型在各種下游任務中都顯著優於現有模型。", "author": "Taoran Fang et.al.", "authors": "Taoran Fang, Wei Zhou, Yifei Sun, Kaiqiao Han, Lvbin Ma, Yang Yang", "id": "2405.04245v1", "paper_url": "http://arxiv.org/abs/2405.04245v1", "repo": "null"}}