{"2408.12325": {"publish_time": "2024-08-22", "title": "Improving Factuality in Large Language Models via Decoding-Time Hallucinatory and Truthful Comparators", "paper_summary": "Despite their remarkable capabilities, Large Language Models (LLMs) are prone\nto generate responses that contradict verifiable facts, i.e., unfaithful\nhallucination content. Existing efforts generally focus on optimizing model\nparameters or editing semantic representations, which compromise the internal\nfactual knowledge of target LLMs. In addition, hallucinations typically exhibit\nmultifaceted patterns in downstream tasks, limiting the model's holistic\nperformance across tasks. In this paper, we propose a Comparator-driven\nDecoding-Time (CDT) framework to alleviate the response hallucination. Firstly,\nwe construct hallucinatory and truthful comparators with multi-task fine-tuning\nsamples. In this case, we present an instruction prototype-guided mixture of\nexperts strategy to enhance the ability of the corresponding comparators to\ncapture different hallucination or truthfulness patterns in distinct task\ninstructions. CDT constrains next-token predictions to factuality-robust\ndistributions by contrasting the logit differences between the target LLMs and\nthese comparators. Systematic experiments on multiple downstream tasks show\nthat our framework can significantly improve the model performance and response\nfactuality.", "paper_summary_zh": "儘管大型語言模型 (LLM) 有其非凡的能力，但它們容易產生與可驗證事實相矛盾的回應，也就是不忠實的幻覺內容。現有的努力通常專注於最佳化模型參數或編輯語意表示，這會損害目標 LLM 的內部事實知識。此外，幻覺通常在下游任務中表現出多方面的模式，限制了模型跨任務的整體效能。在本文中，我們提出一個比較器驅動的解碼時間 (CDT) 架構來減輕回應幻覺。首先，我們使用多任務微調範例建構幻覺和真實比較器。在這種情況下，我們提出了一個指令原型引導的專家混合策略，以增強對應比較器擷取不同任務指令中不同幻覺或真實模式的能力。CDT 透過對比目標 LLM 和這些比較器之間的 logit 差異，將下一個代幣預測限制在穩健的事實分佈中。在多個下游任務上的系統實驗表明，我們的架構可以顯著改善模型效能和回應事實性。", "author": "Dingkang Yang et.al.", "authors": "Dingkang Yang, Dongling Xiao, Jinjie Wei, Mingcheng Li, Zhaoyu Chen, Ke Li, Lihua Zhang", "id": "2408.12325v1", "paper_url": "http://arxiv.org/abs/2408.12325v1", "repo": "null"}}