{"2410.18027": {"publish_time": "2024-10-23", "title": "Cross-lingual Transfer of Reward Models in Multilingual Alignment", "paper_summary": "Reinforcement learning with human feedback (RLHF) is shown to largely benefit\nfrom precise reward models (RMs). However, recent studies in reward modeling\nschemes are skewed towards English, limiting the applicability of RLHF in\nmultilingual alignments. In this work, we investigate the cross-lingual\ntransfer of RMs trained in diverse languages, primarily from English. Our\nexperimental results demonstrate the strong cross-lingual transfer of English\nRMs, exceeding target language RMs by 3~4% average increase in Multilingual\nRewardBench. Furthermore, we analyze the cross-lingual transfer of RMs through\nthe representation shifts. Finally, we perform multilingual alignment to\nexemplify how cross-lingual transfer in RM propagates to enhanced multilingual\ninstruction-following capability, along with extensive analyses on\noff-the-shelf RMs. We release the code, model, and data.", "paper_summary_zh": "強化學習搭配人類回饋（RLHF）已證實可從精準的獎勵模型（RM）中獲益良多。然而，最近在獎勵模型配置方面的研究偏向於英文，這限制了 RLHF 在多語言比對中的適用性。在這項研究中，我們探討以不同語言（主要是英文）訓練的 RM 之間的跨語言轉移。我們的實驗結果證明了英文 RM 的強大跨語言轉移能力，在多語言 RewardBench 中平均增加了 3~4%，超過了目標語言 RM。此外，我們透過表徵轉移分析了 RM 的跨語言轉移。最後，我們執行多語言比對，以說明 RM 中的跨語言轉移如何傳播到增強的多語言指令遵循能力，並對現成 RM 進行廣泛分析。我們將釋出程式碼、模型和資料。", "author": "Jiwoo Hong et.al.", "authors": "Jiwoo Hong, Noah Lee, Rodrigo Martínez-Castaño, César Rodríguez, James Thorne", "id": "2410.18027v1", "paper_url": "http://arxiv.org/abs/2410.18027v1", "repo": "null"}}