{"2410.18393": {"publish_time": "2024-10-24", "title": "SPEED++: A Multilingual Event Extraction Framework for Epidemic Prediction and Preparedness", "paper_summary": "Social media is often the first place where communities discuss the latest\nsocietal trends. Prior works have utilized this platform to extract\nepidemic-related information (e.g. infections, preventive measures) to provide\nearly warnings for epidemic prediction. However, these works only focused on\nEnglish posts, while epidemics can occur anywhere in the world, and early\ndiscussions are often in the local, non-English languages. In this work, we\nintroduce the first multilingual Event Extraction (EE) framework SPEED++ for\nextracting epidemic event information for a wide range of diseases and\nlanguages. To this end, we extend a previous epidemic ontology with 20 argument\nroles; and curate our multilingual EE dataset SPEED++ comprising 5.1K tweets in\nfour languages for four diseases. Annotating data in every language is\ninfeasible; thus we develop zero-shot cross-lingual cross-disease models (i.e.,\ntraining only on English COVID data) utilizing multilingual pre-training and\nshow their efficacy in extracting epidemic-related events for 65 diverse\nlanguages across different diseases. Experiments demonstrate that our framework\ncan provide epidemic warnings for COVID-19 in its earliest stages in Dec 2019\n(3 weeks before global discussions) from Chinese Weibo posts without any\ntraining in Chinese. Furthermore, we exploit our framework's argument\nextraction capabilities to aggregate community epidemic discussions like\nsymptoms and cure measures, aiding misinformation detection and public\nattention monitoring. Overall, we lay a strong foundation for multilingual\nepidemic preparedness.", "paper_summary_zh": "<paragraph>社群媒體通常是社群討論最新社會趨勢的第一個地方。先前的研究利用此平台提取與流行病相關的資訊（例如感染、預防措施），以提供流行病預測的早期預警。然而，這些研究僅關注英文貼文，而流行病可能發生在世界任何地方，而且早期討論通常使用當地非英文語言。在這項研究中，我們介紹了第一個多語言事件萃取 (EE) 架構 SPEED++，用於萃取各種疾病和語言的流行病事件資訊。為此，我們將先前的流行病本體擴充為 20 個論證角色；並策劃我們的多語言 EE 資料集 SPEED++，其中包含四種語言中四種疾病的 5.1K 則推文。以每種語言註解資料是不可行的；因此，我們開發了零次學習跨語言跨疾病模型（即僅針對英文 COVID 資料進行訓練），利用多語言預訓練，並展示了它們在為 65 種不同疾病的不同語言中萃取與流行病相關事件的功效。實驗證明，我們的架構可以在 2019 年 12 月（全球討論前 3 週）的早期階段，從沒有接受過中文訓練的中文微博貼文中提供 COVID-19 的流行病警告。此外，我們利用架構的論證萃取功能來彙整社群流行病討論，例如症狀和治療措施，協助錯誤資訊偵測和公眾關注監控。總而言之，我們為多語言流行病防範奠定了堅實的基礎。</paragraph>", "author": "Tanmay Parekh et.al.", "authors": "Tanmay Parekh, Jeffrey Kwan, Jiarui Yu, Sparsh Johri, Hyosang Ahn, Sreya Muppalla, Kai-Wei Chang, Wei Wang, Nanyun Peng", "id": "2410.18393v1", "paper_url": "http://arxiv.org/abs/2410.18393v1", "repo": "null"}}