{"2411.13738": {"publish_time": "2024-11-20", "title": "Assessing Gender Bias in LLMs: Comparing LLM Outputs with Human Perceptions and Official Statistics", "paper_summary": "This study investigates gender bias in large language models (LLMs) by\ncomparing their gender perception to that of human respondents, U.S. Bureau of\nLabor Statistics data, and a 50% no-bias benchmark. We created a new evaluation\nset using occupational data and role-specific sentences. Unlike common\nbenchmarks included in LLM training data, our set is newly developed,\npreventing data leakage and test set contamination. Five LLMs were tested to\npredict the gender for each role using single-word answers. We used\nKullback-Leibler (KL) divergence to compare model outputs with human\nperceptions, statistical data, and the 50% neutrality benchmark. All LLMs\nshowed significant deviation from gender neutrality and aligned more with\nstatistical data, still reflecting inherent biases.", "paper_summary_zh": "本研究透過將大型語言模型 (LLM) 的性別感知與人類受訪者、美國勞工統計局資料和 50% 無偏見基準進行比較，來調查大型語言模型中的性別偏見。我們使用職業資料和角色特定句子建立了一個新的評量集。與 LLM 訓練資料中常見的基準不同，我們的集合是新開發的，可防止資料外洩和測試集污染。測試了五個 LLM，使用單字答案來預測每個角色的性別。我們使用 Kullback-Leibler (KL) 距離來比較模型輸出與人類感知、統計資料和 50% 中立基準。所有 LLM 都顯示出與性別中立有顯著偏差，並且更符合統計資料，仍然反映出固有的偏見。", "author": "Tetiana Bas et.al.", "authors": "Tetiana Bas", "id": "2411.13738v1", "paper_url": "http://arxiv.org/abs/2411.13738v1", "repo": "https://github.com/tetianabas/llm_biases"}}