{"2502.14113": {"publish_time": "2025-02-19", "title": "Object-centric Binding in Contrastive Language-Image Pretraining", "paper_summary": "Recent advances in vision language models (VLM) have been driven by\ncontrastive models such as CLIP, which learn to associate visual information\nwith their corresponding text descriptions. However, these models have\nlimitations in understanding complex compositional scenes involving multiple\nobjects and their spatial relationships. To address these challenges, we\npropose a novel approach that diverges from commonly used strategies, which\nrely on the design of hard-negative augmentations. Instead, our work focuses on\nintegrating inductive biases into pre-trained CLIP-like models to improve their\ncompositional understanding without using any additional hard-negatives. To\nthat end, we introduce a binding module that connects a scene graph, derived\nfrom a text description, with a slot-structured image representation,\nfacilitating a structured similarity assessment between the two modalities. We\nalso leverage relationships as text-conditioned visual constraints, thereby\ncapturing the intricate interactions between objects and their contextual\nrelationships more effectively. Our resulting model not only enhances the\nperformance of CLIP-based models in multi-object compositional understanding\nbut also paves the way towards more accurate and sample-efficient image-text\nmatching of complex scenes.", "paper_summary_zh": "最近视觉语言模型 (VLM) 的进步是由对比模型（例如 CLIP）推动的，该模型学习将视觉信息与其对应的文本描述联系起来。然而，这些模型在理解涉及多个对象及其空间关系的复杂组合场景方面存在局限性。为了应对这些挑战，我们提出了一种新颖的方法，它偏离了常用的策略，即依赖于硬负增强设计。相反，我们的工作重点是将归纳偏差集成到预训练的类似 CLIP 的模型中，以提高其组合理解能力，而无需使用任何其他硬否定。为此，我们引入了一个绑定模块，它将从文本描述中派生的场景图与槽结构图像表示连接起来，从而促进了两种模式之间的结构化相似性评估。我们还利用关系作为文本条件的视觉约束，从而更有效地捕捉对象及其上下文关系之间的复杂交互。我们由此产生的模型不仅增强了基于 CLIP 的模型在多对象组合理解中的性能，而且还为复杂场景的更准确和样本高效的图像文本匹配铺平了道路。", "author": "Rim Assouel et.al.", "authors": "Rim Assouel, Pietro Astolfi, Florian Bordes, Michal Drozdzal, Adriana Romero-Soriano", "id": "2502.14113v1", "paper_url": "http://arxiv.org/abs/2502.14113v1", "repo": "null"}}