{"2407.09888": {"publish_time": "2024-07-13", "title": "FarFetched: Entity-centric Reasoning and Claim Validation for the Greek Language based on Textually Represented Environments", "paper_summary": "Our collective attention span is shortened by the flood of online\ninformation. With \\textit{FarFetched}, we address the need for automated claim\nvalidation based on the aggregated evidence derived from multiple online news\nsources. We introduce an entity-centric reasoning framework in which latent\nconnections between events, actions, or statements are revealed via entity\nmentions and represented in a graph database. Using entity linking and semantic\nsimilarity, we offer a way for collecting and combining information from\ndiverse sources in order to generate evidence relevant to the user's claim.\nThen, we leverage textual entailment recognition to quantitatively determine\nwhether this assertion is credible, based on the created evidence. Our approach\ntries to fill the gap in automated claim validation for less-resourced\nlanguages and is showcased on the Greek language, complemented by the training\nof relevant semantic textual similarity (STS) and natural language inference\n(NLI) models that are evaluated on translated versions of common benchmarks.", "paper_summary_zh": "網路資訊的洪流縮短了我們的集體注意力時間。透過 \\textit{FarFetched}，我們解決了根據從多個線上新聞來源彙總的證據進行自動化聲明驗證的需求。我們引入了一個以實體為中心的推理框架，其中事件、動作或陳述之間的潛在關聯透過實體提及被揭露，並在圖形資料庫中表示。使用實體連結和語義相似性，我們提供一種方式來收集和組合來自不同來源的資訊，以產生與使用者聲明相關的證據。然後，我們利用文本蘊涵識別來根據建立的證據量化確定此斷言是否可信。我們的做法試圖填補資源較少的語言的自動化聲明驗證方面的空白，並在希臘語中展示，輔以對相關語義文本相似性 (STS) 和自然語言推論 (NLI) 模型的訓練，這些模型在常見基準的翻譯版本上進行評估。", "author": "Dimitris Papadopoulos et.al.", "authors": "Dimitris Papadopoulos, Katerina Metropoulou, Nikolaos Matsatsinis, Nikolaos Papadakis", "id": "2407.09888v1", "paper_url": "http://arxiv.org/abs/2407.09888v1", "repo": "null"}}