{"2501.12430": {"publish_time": "2025-01-21", "title": "SCFCRC: Simultaneously Counteract Feature Camouflage and Relation Camouflage for Fraud Detection", "paper_summary": "In fraud detection, fraudsters often interact with many benign users,\ncamouflaging their features or relations to hide themselves. Most existing work\nconcentrates solely on either feature camouflage or relation camouflage, or\ndecoupling feature learning and relation learning to avoid the two camouflage\nfrom affecting each other. However, this inadvertently neglects the valuable\ninformation derived from features or relations, which could mutually enhance\ntheir adversarial camouflage strategies. In response to this gap, we propose\nSCFCRC, a Transformer-based fraud detector that Simultaneously Counteract\nFeature Camouflage and Relation Camouflage. SCFCRC consists of two components:\nFeature Camouflage Filter and Relation Camouflage Refiner. The feature\ncamouflage filter utilizes pseudo labels generated through label propagation to\ntrain the filter and uses contrastive learning that combines instance-wise and\nprototype-wise to improve the quality of features. The relation camouflage\nrefiner uses Mixture-of-Experts(MoE) network to disassemble the multi-relations\ngraph into multiple substructures and divide and conquer them to mitigate the\ndegradation of detection performance caused by relation camouflage.\nFurthermore, we introduce a regularization method for MoE to enhance the\nrobustness of the model. Extensive experiments on two fraud detection benchmark\ndatasets demonstrate that our method outperforms state-of-the-art baselines.", "paper_summary_zh": "<paragraph>在欺詐偵測中，欺詐者通常會與許多良性使用者互動，偽裝其特徵或關係以隱藏自己。大多數現有工作僅專注於特徵偽裝或關係偽裝，或解耦特徵學習和關係學習，以避免兩種偽裝互相影響。然而，這無意中忽視了從特徵或關係中衍生的有價值資訊，這可能會相互增強其對抗性偽裝策略。為了應對這一差距，我們提出了 SCFCRC，這是一個基於 Transformer 的欺詐檢測器，可同時對抗特徵偽裝和關係偽裝。SCFCRC 由兩個組成部分組成：特徵偽裝濾波器和關係偽裝精煉器。特徵偽裝濾波器利用透過標籤傳播產生的偽標籤來訓練濾波器，並使用結合了實例級和原型級的對比學習來提高特徵品質。關係偽裝精煉器使用 Mixture-of-Experts(MoE) 網路將多關係圖分解成多個子結構，並分而治之，以減輕關係偽裝造成的偵測效能下降。此外，我們為 MoE 引入了一個正規化方法，以增強模型的穩健性。在兩個欺詐偵測基準資料集上進行的廣泛實驗證明，我們的模型優於最先進的基準。</paragraph>", "author": "Xiaocheng Zhang et.al.", "authors": "Xiaocheng Zhang, Zhuangzhuang Ye, GuoPing Zhao, Jianing Wang, Xiaohong Su", "id": "2501.12430v1", "paper_url": "http://arxiv.org/abs/2501.12430v1", "repo": "null"}}