{"2408.05786": {"publish_time": "2024-08-11", "title": "HiLight: A Hierarchy-aware Light Global Model with Hierarchical Local ConTrastive Learning", "paper_summary": "Hierarchical text classification (HTC) is a special sub-task of multi-label\nclassification (MLC) whose taxonomy is constructed as a tree and each sample is\nassigned with at least one path in the tree. Latest HTC models contain three\nmodules: a text encoder, a structure encoder and a multi-label classification\nhead. Specially, the structure encoder is designed to encode the hierarchy of\ntaxonomy. However, the structure encoder has scale problem. As the taxonomy\nsize increases, the learnable parameters of recent HTC works grow rapidly.\nRecursive regularization is another widely-used method to introduce\nhierarchical information but it has collapse problem and generally relaxed by\nassigning with a small weight (ie. 1e-6). In this paper, we propose a\nHierarchy-aware Light Global model with Hierarchical local conTrastive learning\n(HiLight), a lightweight and efficient global model only consisting of a text\nencoder and a multi-label classification head. We propose a new learning task\nto introduce the hierarchical information, called Hierarchical Local\nContrastive Learning (HiLCL). Extensive experiments are conducted on two\nbenchmark datasets to demonstrate the effectiveness of our model.", "paper_summary_zh": "階層式文字分類 (HTC) 是多標籤分類 (MLC) 的一個特殊子任務，其分類法建構為一棵樹，且每個範例都至少分配到樹中的某一條路徑。最新的 HTC 模型包含三個模組：文字編碼器、結構編碼器和多標籤分類頭部。特別地，結構編碼器被設計用來編碼分類法的階層。然而，結構編碼器有規模問題。隨著分類法大小的增加，最近 HTC 作品的可學習參數快速增長。遞迴正則化是另一個廣泛使用的引入階層資訊的方法，但它有崩潰問題，且通常透過分配一個小權重 (例如 1e-6) 來放寬。在本文中，我們提出了一個具有階層局部對比學習 (HiLight) 的階層感知輕量級全局模型，這是一個僅由文字編碼器和多標籤分類頭部組成的輕量級且高效的全局模型。我們提出了一個新的學習任務來引入階層資訊，稱為階層局部對比學習 (HiLCL)。我們在兩個基準資料集上進行了廣泛的實驗，以證明我們模型的有效性。", "author": "Zhijian Chen et.al.", "authors": "Zhijian Chen, Zhonghua Li, Jianxin Yang, Ye Qi", "id": "2408.05786v1", "paper_url": "http://arxiv.org/abs/2408.05786v1", "repo": "null"}}