{"2412.02626": {"publish_time": "2024-12-03", "title": "Time-Reversal Provides Unsupervised Feedback to LLMs", "paper_summary": "Large Language Models (LLMs) are typically trained to predict in the forward\ndirection of time. However, recent works have shown that prompting these models\nto look back and critique their own generations can produce useful feedback.\nMotivated by this, we explore the question of whether LLMs can be empowered to\nthink (predict and score) backwards to provide unsupervised feedback that\ncomplements forward LLMs. Towards this, we introduce Time Reversed Language\nModels (TRLMs), which can score and generate queries when conditioned on\nresponses, effectively functioning in the reverse direction of time. Further,\nto effectively infer in the response to query direction, we pre-train and\nfine-tune a language model (TRLM-Ba) in the reverse token order from scratch.\nWe show empirically (and theoretically in a stylized setting) that\ntime-reversed models can indeed complement forward model predictions when used\nto score the query given response for re-ranking multiple forward generations.\nWe obtain up to 5\\% improvement on the widely used AlpacaEval Leaderboard over\nthe competent baseline of best-of-N re-ranking using self log-perplexity\nscores. We further show that TRLM scoring outperforms conventional forward\nscoring of response given query, resulting in significant gains in applications\nsuch as citation generation and passage retrieval. We next leverage the\ngenerative ability of TRLM to augment or provide unsupervised feedback to input\nsafety filters of LLMs, demonstrating a drastic reduction in false negative\nrate with negligible impact on false positive rates against several attacks\npublished on the popular JailbreakBench leaderboard.", "paper_summary_zh": "大型語言模型（LLM）通常會接受訓練以預測時間的正向方向。然而，最近的研究表明，提示這些模型回顧並批評它們自己的世代可以產生有用的回饋。受此啟發，我們探討了 LLM 能否被賦予向後思考（預測和評分）的能力，以提供補充正向 LLM 的無監督回饋。為此，我們引入了時間反向語言模型（TRLM），它可以在回應的條件下評分和產生查詢，有效地運作於時間的反向。此外，為了有效地推論對查詢方向的回應，我們從頭開始以反向符號順序預先訓練和微調語言模型（TRLM-Ba）。我們透過經驗（以及在樣式化設定中的理論）表明，時間反向模型確實可以在用於評分查詢給定的回應以重新排列多個正向生成時，補充正向模型預測。我們在廣泛使用的 AlpacaEval 排行榜上獲得了高達 5% 的改進，優於使用自我對數困惑度評分的最佳 N 次重新排列的基準。我們進一步表明，TRLM 評分優於對給定查詢的傳統正向評分，從而顯著提升了引用生成和段落檢索等應用。接下來，我們利用 TRLM 的生成能力來擴充或提供無監督回饋給 LLM 的輸入安全過濾器，證明在針對流行的 JailbreakBench 排行榜上發布的幾次攻擊中，假陰性率大幅降低，而假陽性率幾乎沒有影響。", "author": "Yerram Varun et.al.", "authors": "Yerram Varun, Rahul Madhavan, Sravanti Addepalli, Arun Suggala, Karthikeyan Shanmugam, Prateek Jain", "id": "2412.02626v1", "paper_url": "http://arxiv.org/abs/2412.02626v1", "repo": "null"}}