{"2405.00728": {"publish_time": "2024-04-27", "title": "Evaluating the Application of ChatGPT in Outpatient Triage Guidance: A Comparative Study", "paper_summary": "The integration of Artificial Intelligence (AI) in healthcare presents a\ntransformative potential for enhancing operational efficiency and health\noutcomes. Large Language Models (LLMs), such as ChatGPT, have shown their\ncapabilities in supporting medical decision-making. Embedding LLMs in medical\nsystems is becoming a promising trend in healthcare development. The potential\nof ChatGPT to address the triage problem in emergency departments has been\nexamined, while few studies have explored its application in outpatient\ndepartments. With a focus on streamlining workflows and enhancing efficiency\nfor outpatient triage, this study specifically aims to evaluate the consistency\nof responses provided by ChatGPT in outpatient guidance, including both\nwithin-version response analysis and between-version comparisons. For\nwithin-version, the results indicate that the internal response consistency for\nChatGPT-4.0 is significantly higher than ChatGPT-3.5 (p=0.03) and both have a\nmoderate consistency (71.2% for 4.0 and 59.6% for 3.5) in their top\nrecommendation. However, the between-version consistency is relatively low\n(mean consistency score=1.43/3, median=1), indicating few recommendations match\nbetween the two versions. Also, only 50% top recommendations match perfectly in\nthe comparisons. Interestingly, ChatGPT-3.5 responses are more likely to be\ncomplete than those from ChatGPT-4.0 (p=0.02), suggesting possible differences\nin information processing and response generation between the two versions. The\nfindings offer insights into AI-assisted outpatient operations, while also\nfacilitating the exploration of potentials and limitations of LLMs in\nhealthcare utilization. Future research may focus on carefully optimizing LLMs\nand AI integration in healthcare systems based on ergonomic and human factors\nprinciples, precisely aligning with the specific needs of effective outpatient\ntriage.", "paper_summary_zh": "", "author": "Dou Liu et.al.", "authors": "Dou Liu,Ying Han,Xiandi Wang,Xiaomei Tan,Di Liu,Guangwu Qian,Kang Li,Dan Pu,Rong Yin", "id": "2405.00728v1", "paper_url": "http://arxiv.org/abs/2405.00728v1", "repo": "null"}}