{"2501.02573": {"publish_time": "2025-01-05", "title": "LeetDecoding: A PyTorch Library for Exponentially Decaying Causal Linear Attention with CUDA Implementations", "paper_summary": "The machine learning and data science community has made significant while\ndispersive progress in accelerating transformer-based large language models\n(LLMs), and one promising approach is to replace the original causal attention\nin a generative pre-trained transformer (GPT) with \\emph{exponentially decaying\ncausal linear attention}. In this paper, we present LeetDecoding, which is the\nfirst Python package that provides a large set of computation routines for this\nfundamental operator. The launch of LeetDecoding was motivated by the current\nlack of (1) clear understanding of the complexity regarding this operator, (2)\na comprehensive collection of existing computation methods (usually spread in\nseemingly unrelated fields), and (3) CUDA implementations for fast inference on\nGPU. LeetDecoding's design is easy to integrate with existing linear-attention\nLLMs, and allows for researchers to benchmark and evaluate new computation\nmethods for exponentially decaying causal linear attention. The usage of\nLeetDecoding does not require any knowledge of GPU programming and the\nunderlying complexity analysis, intentionally making LeetDecoding accessible to\nLLM practitioners. The source code of LeetDecoding is provided at\n\\href{https://github.com/Computational-Machine-Intelligence/LeetDecoding}{this\nGitHub repository}, and users can simply install LeetDecoding by the command\n\\texttt{pip install leet-decoding}.", "paper_summary_zh": "機器學習和資料科學社群在加速以 Transformer 為基礎的大型語言模型 (LLM) 方面取得了顯著但分散的進展，其中一種有前途的方法是將生成式預訓練 Transformer (GPT) 中的原始因果注意力替換為「指數衰減因果線性注意力」。在本文中，我們介紹 LeetDecoding，這是第一個 Python 套件，為這個基本運算子提供了一組大量的運算常式。LeetDecoding 的推出是基於目前 (1) 缺乏對這個運算子複雜度的清楚理解、(2) 現有運算方法的全面收集（通常分散在看似不相關的領域中），以及 (3) CUDA 實作，以在 GPU 上進行快速推論。LeetDecoding 的設計很容易與現有的線性注意力 LLM 整合，並允許研究人員對指數衰減因果線性注意力的新運算方法進行基準測試和評估。使用 LeetDecoding 不需要任何 GPU 程式設計和基礎複雜度分析的知識，有意地讓 LLM 實務人員可以使用 LeetDecoding。LeetDecoding 的原始程式碼提供於 \\href{https://github.com/Computational-Machine-Intelligence/LeetDecoding}{這個 GitHub 儲存庫}，使用者可以透過指令 \\texttt{pip install leet-decoding} 輕鬆安裝 LeetDecoding。", "author": "Jiaping Wang et.al.", "authors": "Jiaping Wang, Simiao Zhang, Qiao-Chu He, Yifan Chen", "id": "2501.02573v1", "paper_url": "http://arxiv.org/abs/2501.02573v1", "repo": "https://github.com/computational-machine-intelligence/leetdecoding"}}