{"2502.15261": {"publish_time": "2025-02-21", "title": "Corrections Meet Explanations: A Unified Framework for Explainable Grammatical Error Correction", "paper_summary": "Grammatical Error Correction (GEC) faces a critical challenge concerning\nexplainability, notably when GEC systems are designed for language learners.\nExisting research predominantly focuses on explaining grammatical errors\nextracted in advance, thus neglecting the relationship between explanations and\ncorrections. To address this gap, we introduce EXGEC, a unified explainable GEC\nframework that integrates explanation and correction tasks in a generative\nmanner, advocating that these tasks mutually reinforce each other. Experiments\nhave been conducted on EXPECT, a recent human-labeled dataset for explainable\nGEC, comprising around 20k samples. Moreover, we detect significant noise\nwithin EXPECT, potentially compromising model training and evaluation.\nTherefore, we introduce an alternative dataset named EXPECT-denoised, ensuring\na more objective framework for training and evaluation. Results on various NLP\nmodels (BART, T5, and Llama3) show that EXGEC models surpass single-task\nbaselines in both tasks, demonstrating the effectiveness of our approach.", "paper_summary_zh": "文法錯誤校正 (GEC) 面臨一個關於可解釋性的重大挑戰，特別是當 GEC 系統是為語言學習者設計時。現有研究主要集中在解釋預先提取的文法錯誤，因此忽略了解釋與校正之間的關係。為了解決這個差距，我們引入了 EXGEC，一個統一的可解釋 GEC 框架，它以生成的方式整合了解釋和校正任務，主張這些任務會互相加強。實驗已經在 EXPECT 上進行，EXPECT 是最近一個可解釋 GEC 的人工標記資料集，包含大約 20k 個樣本。此外，我們在 EXPECT 中偵測到大量的雜訊，可能會損害模型訓練和評估。因此，我們引入了另一個名為 EXPECT-denoised 的資料集，確保了一個更客觀的訓練和評估框架。各種 NLP 模型 (BART、T5 和 Llama3) 的結果顯示，EXGEC 模型在兩個任務中都超越了單任務基準，證明了我們方法的有效性。", "author": "Jingheng Ye et.al.", "authors": "Jingheng Ye, Shang Qin, Yinghui Li, Hai-Tao Zheng, Shen Wang, Qingsong Wen", "id": "2502.15261v1", "paper_url": "http://arxiv.org/abs/2502.15261v1", "repo": "null"}}