{"2405.18113": {"publish_time": "2024-05-28", "title": "Facilitating Multi-Role and Multi-Behavior Collaboration of Large Language Models for Online Job Seeking and Recruiting", "paper_summary": "The emergence of online recruitment services has revolutionized the\ntraditional landscape of job seeking and recruitment, necessitating the\ndevelopment of high-quality industrial applications to improve person-job\nfitting. Existing methods generally rely on modeling the latent semantics of\nresumes and job descriptions and learning a matching function between them.\nInspired by the powerful role-playing capabilities of Large Language Models\n(LLMs), we propose to introduce a mock interview process between LLM-played\ninterviewers and candidates. The mock interview conversations can provide\nadditional evidence for candidate evaluation, thereby augmenting traditional\nperson-job fitting based solely on resumes and job descriptions. However,\ncharacterizing these two roles in online recruitment still presents several\nchallenges, such as developing the skills to raise interview questions,\nformulating appropriate answers, and evaluating two-sided fitness. To this end,\nwe propose MockLLM, a novel applicable framework that divides the person-job\nmatching process into two modules: mock interview generation and two-sided\nevaluation in handshake protocol, jointly enhancing their performance through\ncollaborative behaviors between interviewers and candidates. We design a\nrole-playing framework as a multi-role and multi-behavior paradigm to enable a\nsingle LLM agent to effectively behave with multiple functions for both\nparties. Moreover, we propose reflection memory generation and dynamic prompt\nmodification techniques to refine the behaviors of both sides, enabling\ncontinuous optimization of the augmented additional evidence. Extensive\nexperimental results show that MockLLM can achieve the best performance on\nperson-job matching accompanied by high mock interview quality, envisioning its\nemerging application in real online recruitment in the future.", "paper_summary_zh": "線上招募服務的出現，徹底改變了求職和招募的傳統模式，因此需要開發高品質的產業應用程式，以改善人職配對。現有方法通常仰賴模擬履歷和職務說明的潛在語意，並學習它們之間的配對功能。受到大型語言模型 (LLM) 強大的角色扮演能力啟發，我們建議在 LLM 扮演的面試官和應徵者之間，導入模擬面試流程。模擬面試對話可以提供額外的證據，用於應徵者評估，從而擴增僅根據履歷和職務說明所做的傳統人職配對。然而，在線上招募中，這兩個角色的特性仍然存在一些挑戰，例如培養提出面試問題、擬定適當答案以及評估雙方適性的技能。為此，我們提出 MockLLM，一個新穎且適用的架構，將人職配對流程分為兩個模組：模擬面試產生，以及握手協定的雙向評估，透過面試官和應徵者之間的協作行為，共同提升其效能。我們設計一個角色扮演架構，作為一個多角色和多行為的範例，以使單一 LLM 代理人能夠有效地為雙方執行多項功能。此外，我們提出反省記憶產生和動態提示修改技術，以改善雙方的行為，讓擴增的額外證據能夠持續最佳化。廣泛的實驗結果顯示，MockLLM 能夠在人職配對中達成最佳效能，並伴隨著高品質的模擬面試，預見其在未來真實線上招募中的新興應用。", "author": "Hongda Sun et.al.", "authors": "Hongda Sun, Hongzhan Lin, Haiyu Yan, Chen Zhu, Yang Song, Xin Gao, Shuo Shang, Rui Yan", "id": "2405.18113v1", "paper_url": "http://arxiv.org/abs/2405.18113v1", "repo": "null"}}