{"2412.14444": {"publish_time": "2024-12-19", "title": "GenHMR: Generative Human Mesh Recovery", "paper_summary": "Human mesh recovery (HMR) is crucial in many computer vision applications;\nfrom health to arts and entertainment. HMR from monocular images has\npredominantly been addressed by deterministic methods that output a single\nprediction for a given 2D image. However, HMR from a single image is an\nill-posed problem due to depth ambiguity and occlusions. Probabilistic methods\nhave attempted to address this by generating and fusing multiple plausible 3D\nreconstructions, but their performance has often lagged behind deterministic\napproaches. In this paper, we introduce GenHMR, a novel generative framework\nthat reformulates monocular HMR as an image-conditioned generative task,\nexplicitly modeling and mitigating uncertainties in the 2D-to-3D mapping\nprocess. GenHMR comprises two key components: (1) a pose tokenizer to convert\n3D human poses into a sequence of discrete tokens in a latent space, and (2) an\nimage-conditional masked transformer to learn the probabilistic distributions\nof the pose tokens, conditioned on the input image prompt along with randomly\nmasked token sequence. During inference, the model samples from the learned\nconditional distribution to iteratively decode high-confidence pose tokens,\nthereby reducing 3D reconstruction uncertainties. To further refine the\nreconstruction, a 2D pose-guided refinement technique is proposed to directly\nfine-tune the decoded pose tokens in the latent space, which forces the\nprojected 3D body mesh to align with the 2D pose clues. Experiments on\nbenchmark datasets demonstrate that GenHMR significantly outperforms\nstate-of-the-art methods. Project website can be found at\nhttps://m-usamasaleem.github.io/publication/GenHMR/GenHMR.html", "paper_summary_zh": "人體網格重建（HMR）在許多電腦視覺應用中至關重要；\n從健康到藝術和娛樂。單目影像的 HMR 主要由確定性方法解決，\n該方法針對給定的 2D 影像輸出單一預測。然而，由於深度模糊和遮擋，\n單一影像的 HMR 是個病態問題。機率方法嘗試透過產生和融合多個合理的 3D\n重建來解決此問題，但其效能通常落後於確定性方法。在本文中，我們介紹\nGenHMR，這是一個新穎的生成式架構，將單目 HMR 重新表述為一個影像條件生成任務，\n明確建模和減輕 2D 到 3D 對應過程中的不確定性。GenHMR 包含兩個關鍵組成部分：\n（1）姿勢標記化器，將 3D 人體姿勢轉換為潛在空間中的離散標記序列，以及\n（2）影像條件遮罩轉換器，以輸入影像提示以及隨機遮罩標記序列為條件，\n學習姿勢標記的機率分佈。在推論期間，模型從學習到的條件分佈中取樣，\n以反覆解碼高置信度姿勢標記，從而減少 3D 重建的不確定性。為了進一步優化\n重建，提出了一種 2D 姿勢引導的優化技術，以直接微調潛在空間中解碼的姿勢標記，\n這迫使投影的 3D 身體網格與 2D 姿勢線索對齊。基準資料集上的實驗證明，\nGenHMR 明顯優於最先進的方法。專案網站可以在\nhttps://m-usamasaleem.github.io/publication/GenHMR/GenHMR.html 找到", "author": "Muhammad Usama Saleem et.al.", "authors": "Muhammad Usama Saleem, Ekkasit Pinyoanuntapong, Pu Wang, Hongfei Xue, Srijan Das, Chen Chen", "id": "2412.14444v1", "paper_url": "http://arxiv.org/abs/2412.14444v1", "repo": "null"}}