{"2407.14796": {"publish_time": "2024-07-20", "title": "PASSION: Towards Effective Incomplete Multi-Modal Medical Image Segmentation with Imbalanced Missing Rates", "paper_summary": "Incomplete multi-modal image segmentation is a fundamental task in medical\nimaging to refine deployment efficiency when only partial modalities are\navailable. However, the common practice that complete-modality data is visible\nduring model training is far from realistic, as modalities can have imbalanced\nmissing rates in clinical scenarios. In this paper, we, for the first time,\nformulate such a challenging setting and propose Preference-Aware\nSelf-diStillatION (PASSION) for incomplete multi-modal medical image\nsegmentation under imbalanced missing rates. Specifically, we first construct\npixel-wise and semantic-wise self-distillation to balance the optimization\nobjective of each modality. Then, we define relative preference to evaluate the\ndominance of each modality during training, based on which to design task-wise\nand gradient-wise regularization to balance the convergence rates of different\nmodalities. Experimental results on two publicly available multi-modal datasets\ndemonstrate the superiority of PASSION against existing approaches for modality\nbalancing. More importantly, PASSION is validated to work as a plug-and-play\nmodule for consistent performance improvement across different backbones. Code\nis available at https://github.com/Jun-Jie-Shi/PASSION.", "paper_summary_zh": "不完整的多模態影像分割是醫學影像中的一項基本任務，用於在只有部分模態可用時精進部署效率。然而，在模型訓練期間可見完整模態資料的常見做法並不切實際，因為在臨床場景中，模態可能會有不平衡的遺漏率。在本文中，我們首次制定了這樣一個具有挑戰性的設定，並提出了不平衡遺漏率下不完整多模態醫學影像分割的偏好感知自蒸餾 (PASSION)。具體來說，我們首先建構像素級和語義級自蒸餾，以平衡每個模態的最佳化目標。然後，我們定義相對偏好來評估訓練期間每個模態的主導地位，並根據此設計任務級和梯度級正則化，以平衡不同模態的收斂率。在兩個公開的多模態資料集上的實驗結果證明了 PASSION 優於現有模態平衡方法。更重要的是，PASSION 被驗證為即插即用模組，可在不同的主幹中持續提升效能。程式碼可在 https://github.com/Jun-Jie-Shi/PASSION 取得。", "author": "Junjie Shi et.al.", "authors": "Junjie Shi, Caozhi Shang, Zhaobin Sun, Li Yu, Xin Yang, Zengqiang Yan", "id": "2407.14796v1", "paper_url": "http://arxiv.org/abs/2407.14796v1", "repo": "https://github.com/jun-jie-shi/passion"}}