{"2411.00866": {"publish_time": "2024-10-30", "title": "Emory Knee Radiograph (MRKR) Dataset", "paper_summary": "The Emory Knee Radiograph (MRKR) dataset is a large, demographically diverse\ncollection of 503,261 knee radiographs from 83,011 patients, 40% of which are\nAfrican American. This dataset provides imaging data in DICOM format along with\ndetailed clinical information, including patient-reported pain scores,\ndiagnostic codes, and procedural codes, which are not commonly available in\nsimilar datasets. The MRKR dataset also features imaging metadata such as image\nlaterality, view type, and presence of hardware, enhancing its value for\nresearch and model development. MRKR addresses significant gaps in existing\ndatasets by offering a more representative sample for studying osteoarthritis\nand related outcomes, particularly among minority populations, thereby\nproviding a valuable resource for clinicians and researchers.", "paper_summary_zh": "埃默里膝部 X 光片 (MRKR) 資料集是一個龐大、人口統計資料多元的資料集，包含來自 83,011 名患者的 503,261 張膝部 X 光片，其中 40% 為非裔美國人。此資料集提供 DICOM 格式的影像資料，以及詳細的臨床資訊，包括患者回報的疼痛評分、診斷碼和程序碼，這些資料在類似的資料集中並不常見。MRKR 資料集也包含影像的後設資料，例如影像的左右側、檢視類型和硬體的存在，提升其在研究和模型開發方面的價值。MRKR 透過提供更具代表性的樣本，來探討骨關節炎和相關結果，特別是在少數族群中，從而填補現有資料集中顯著的缺口，為臨床醫生和研究人員提供有價值的資源。", "author": "Brandon Price et.al.", "authors": "Brandon Price, Jason Adleberg, Kaesha Thomas, Zach Zaiman, Aawez Mansuri, Beatrice Brown-Mulry, Chima Okecheukwu, Judy Gichoya, Hari Trivedi", "id": "2411.00866v1", "paper_url": "http://arxiv.org/abs/2411.00866v1", "repo": "null"}}