{"2408.11490": {"publish_time": "2024-08-21", "title": "DocTabQA: Answering Questions from Long Documents Using Tables", "paper_summary": "We study a new problem setting of question answering (QA), referred to as\nDocTabQA. Within this setting, given a long document, the goal is to respond to\nquestions by organizing the answers into structured tables derived directly\nfrom the document's content. Unlike traditional QA approaches which\npredominantly rely on unstructured text to formulate responses, DocTabQA aims\nto leverage structured tables as answers to convey information clearly and\nsystematically, thereby enhancing user comprehension and highlighting\nrelationships between data points. To the best of our knowledge, this problem\nhas not been previously explored. In this paper, we introduce the QTabA\ndataset, encompassing 300 financial documents, accompanied by manually\nannotated 1.5k question-table pairs. Initially, we leverage Large Language\nModels (LLMs) such as GPT-4 to establish a baseline. However, it is widely\nacknowledged that LLMs encounter difficulties when tasked with generating\nintricate, structured outputs from long input sequences. To overcome these\nchallenges, we present a two-stage framework, called DocTabTalk, which\ninitially retrieves relevant sentences from extensive documents and\nsubsequently generates hierarchical tables based on these identified sentences.\nDocTabTalk incorporates two key technological innovations: AlignLLaMA and\nTabTalk, which are specifically tailored to assist GPT-4 in tackling DocTabQA,\nenabling it to generate well-structured, hierarchical tables with improved\norganization and clarity. Comprehensive experimental evaluations conducted on\nboth QTabA and RotoWire datasets demonstrate that our DocTabTalk significantly\nenhances the performances of the GPT-4 in our proposed DocTabQA task and the\ntable generation task. The code and dataset are available at\nhttps://github.com/SmileWHC/DocTabQA for further research.", "paper_summary_zh": "<paragraph>我們研究了一個新的問題設定，即問答（QA），稱為 DocTabQA。在此設定中，給定一個長文檔，目標是通過將答案組織成直接從文檔內容中得出的結構化表格來回答問題。與傳統的 QA 方法不同，傳統的 QA 方法主要依賴非結構化文本來制定回應，而 DocTabQA 旨在利用結構化表格作為答案來清晰系統地傳達信息，從而增強用戶理解並突出數據點之間的關係。據我們所知，這個問題以前沒有被探索過。在本文中，我們介紹了 QTabA 數據集，其中包含 300 份財務文件，並附有手動註釋的 1.5k 個問題表對。最初，我們利用大型語言模型 (LLM)，例如 GPT-4 來建立基準。然而，人們普遍認為，LLM 在從長輸入序列生成複雜的結構化輸出時會遇到困難。為了克服這些挑戰，我們提出了稱為 DocTabTalk 的兩階段框架，該框架最初從廣泛的文檔中檢索相關句子，然後根據這些已識別的句子生成分層表格。DocTabTalk 結合了兩項關鍵技術創新：AlignLLaMA 和 TabTalk，它們專門定制為協助 GPT-4 處理 DocTabQA，使其能夠生成結構良好、分層清晰且組織性更強的表格。在 QTabA 和 RotoWire 數據集上進行的綜合實驗評估表明，我們的 DocTabTalk 在我們提出的 DocTabQA 任務和表格生成任務中顯著提升了 GPT-4 的性能。代碼和數據集可在 https://github.com/SmileWHC/DocTabQA 上獲得，以供進一步研究。</paragraph>", "author": "Haochen Wang et.al.", "authors": "Haochen Wang, Kai Hu, Haoyu Dong, Liangcai Gao", "id": "2408.11490v1", "paper_url": "http://arxiv.org/abs/2408.11490v1", "repo": "null"}}