{"2502.03188": {"publish_time": "2025-02-05", "title": "EuskañolDS: A Naturally Sourced Corpus for Basque-Spanish Code-Switching", "paper_summary": "Code-switching (CS) remains a significant challenge in Natural Language\nProcessing (NLP), mainly due a lack of relevant data. In the context of the\ncontact between the Basque and Spanish languages in the north of the Iberian\nPeninsula, CS frequently occurs in both formal and informal spontaneous\ninteractions. However, resources to analyse this phenomenon and support the\ndevelopment and evaluation of models capable of understanding and generating\ncode-switched language for this language pair are almost non-existent. We\nintroduce a first approach to develop a naturally sourced corpus for\nBasque-Spanish code-switching. Our methodology consists of identifying CS texts\nfrom previously available corpora using language identification models, which\nare then manually validated to obtain a reliable subset of CS instances. We\npresent the properties of our corpus and make it available under the name\nEuska\\~nolDS.", "paper_summary_zh": "代碼切換 (CS) 仍然是自然語言處理 (NLP) 中的一項重大挑戰，這主要是由於缺乏相關數據。在伊比利半島北部巴斯克語和西班牙語接觸的背景下，CS 經常出現在正式和非正式的自然互動中。然而，幾乎沒有資源可以分析這種現象並支持能夠理解和生成此語言對的代碼切換語言的模型的開發和評估。我們提出了一種開發巴斯克語-西班牙語代碼切換自然採集語料庫的第一種方法。我們的做法包括使用語言識別模型從以前可用的語料庫中識別 CS 文本，然後手動驗證這些文本以獲得可靠的 CS 實例子集。我們展示了我們語料庫的屬性，並以 Euska\\~nolDS 的名稱提供該語料庫。", "author": "Maite Heredia et.al.", "authors": "Maite Heredia, Jeremy Barnes, Aitor Soroa", "id": "2502.03188v1", "paper_url": "http://arxiv.org/abs/2502.03188v1", "repo": "null"}}