{"2405.09308": {"publish_time": "2024-05-15", "title": "TimeX++: Learning Time-Series Explanations with Information Bottleneck", "paper_summary": "Explaining deep learning models operating on time series data is crucial in\nvarious applications of interest which require interpretable and transparent\ninsights from time series signals. In this work, we investigate this problem\nfrom an information theoretic perspective and show that most existing measures\nof explainability may suffer from trivial solutions and distributional shift\nissues. To address these issues, we introduce a simple yet practical objective\nfunction for time series explainable learning. The design of the objective\nfunction builds upon the principle of information bottleneck (IB), and modifies\nthe IB objective function to avoid trivial solutions and distributional shift\nissues. We further present TimeX++, a novel explanation framework that\nleverages a parametric network to produce explanation-embedded instances that\nare both in-distributed and label-preserving. We evaluate TimeX++ on both\nsynthetic and real-world datasets comparing its performance against leading\nbaselines, and validate its practical efficacy through case studies in a\nreal-world environmental application. Quantitative and qualitative evaluations\nshow that TimeX++ outperforms baselines across all datasets, demonstrating a\nsubstantial improvement in explanation quality for time series data. The source\ncode is available at \\url{https://github.com/zichuan-liu/TimeXplusplus}.", "paper_summary_zh": "說明運作於時間序列資料的深度學習模型，對於各種需要從時間序列訊號中取得可解釋且透明見解的應用程式至關重要。在本文中，我們從資訊理論的角度探討這個問題，並說明大多數現有的可解釋性測量方法都可能受到平凡解和分佈轉移問題的影響。為了解決這些問題，我們為時間序列可解釋式學習引入了簡單卻實用的目標函數。目標函數的設計建立在資訊瓶頸 (IB) 原理之上，並修改 IB 目標函數以避免平凡解和分佈轉移問題。我們進一步提出了 TimeX++，一種新穎的說明架構，它利用參數網路產生說明內嵌的實例，這些實例同時在分佈中且保留標籤。我們在合成和真實世界資料集上評估 TimeX++，將其效能與領先基準進行比較，並透過實際環境應用中的案例研究驗證其實用效能。定量和定性評估顯示，TimeX++ 在所有資料集上都優於基準，證明時間序列資料的說明品質有顯著改善。原始碼可在 \\url{https://github.com/zichuan-liu/TimeXplusplus} 取得。", "author": "Zichuan Liu et.al.", "authors": "Zichuan Liu, Tianchun Wang, Jimeng Shi, Xu Zheng, Zhuomin Chen, Lei Song, Wenqian Dong, Jayantha Obeysekera, Farhad Shirani, Dongsheng Luo", "id": "2405.09308v1", "paper_url": "http://arxiv.org/abs/2405.09308v1", "repo": "https://github.com/zichuan-liu/timexplusplus"}}