{"2405.03010": {"publish_time": "2024-05-05", "title": "High Order Reasoning for Time Critical Recommendation in Evidence-based Medicine", "paper_summary": "In time-critical decisions, human decision-makers can interact with\nAI-enabled situation-aware software to evaluate many imminent and possible\nscenarios, retrieve billions of facts, and estimate different outcomes based on\ntrillions of parameters in a fraction of a second. In high-order reasoning,\n\"what-if\" questions can be used to challenge the assumptions or pre-conditions\nof the reasoning, \"why-not\" questions can be used to challenge on the method\napplied in the reasoning, \"so-what\" questions can be used to challenge the\npurpose of the decision, and \"how-about\" questions can be used to challenge the\napplicability of the method. When above high-order reasoning questions are\napplied to assist human decision-making, it can help humans to make\ntime-critical decisions and avoid false-negative or false-positive types of\nerrors. In this paper, we present a model of high-order reasoning to offer\nrecommendations in evidence-based medicine in a time-critical fashion for the\napplications in ICU. The Large Language Model (LLM) is used in our system. The\nexperiments demonstrated the LLM exhibited optimal performance in the \"What-if\"\nscenario, achieving a similarity of 88.52% with the treatment plans of human\ndoctors. In the \"Why-not\" scenario, the best-performing model tended to opt for\nalternative treatment plans in 70% of cases for patients who died after being\ndischarged from the ICU. In the \"So-what\" scenario, the optimal model provided\na detailed analysis of the motivation and significance of treatment plans for\nICU patients, with its reasoning achieving a similarity of 55.6% with actual\ndiagnostic information. In the \"How-about\" scenario, the top-performing LLM\ndemonstrated a content similarity of 66.5% in designing treatment plans\ntransferring for similar diseases. Meanwhile, LLMs managed to predict the life\nstatus of patients after their discharge from the ICU with an accuracy of 70%.", "paper_summary_zh": "", "author": "Manjiang Yu et.al.", "authors": "Manjiang Yu,Xue Li", "id": "2405.03010v1", "paper_url": "http://arxiv.org/abs/2405.03010v1", "repo": "null"}}