{"2501.04436": {"publish_time": "2025-01-08", "title": "Federated Fine-Tuning of LLMs: Framework Comparison and Research Directions", "paper_summary": "Federated learning (FL) provides a privacy-preserving solution for\nfine-tuning pre-trained large language models (LLMs) using distributed private\ndatasets, enabling task-specific adaptation while preserving data privacy.\nHowever, fine-tuning the extensive parameters in LLMs is particularly\nchallenging in resource-constrained federated scenarios due to the significant\ncommunication and computational costs. To gain a deeper understanding of how\nthese challenges can be addressed, this article conducts a comparative analysis\nthree advanced federated LLM (FedLLM) frameworks that integrate knowledge\ndistillation (KD) and split learning (SL) to mitigate these issues: 1) FedLLMs,\nwhere clients upload model parameters or gradients to enable straightforward\nand effective fine-tuning; 2) KD-FedLLMs, which leverage KD for efficient\nknowledge sharing via logits; and 3) Split-FedLLMs, which split the LLMs into\ntwo parts, with one part executed on the client and the other one on the\nserver, to balance the computational load. Each framework is evaluated based on\nkey performance metrics, including model accuracy, communication overhead, and\nclient-side computational load, offering insights into their effectiveness for\nvarious federated fine-tuning scenarios. Through this analysis, we identify\nframework-specific optimization opportunities to enhance the efficiency of\nFedLLMs and discuss broader research directions, highlighting open\nopportunities to better adapt FedLLMs for real-world applications. A use case\nis presented to demonstrate the performance comparison of these three\nframeworks under varying configurations and settings.", "paper_summary_zh": "<paragraph>聯合學習 (FL) 提供了一個隱私保護解決方案，用於使用分布式私有資料集微調預先訓練的大型語言模型 (LLM)，同時在保護資料隱私的同時實現特定任務的適應。\n然而，在資源受限的聯合場景中微調 LLM 中的廣泛參數特別具有挑戰性，這是因為它會帶來顯著的通訊和計算成本。為了更深入地了解如何應對這些挑戰，本文對三個先進的聯合 LLM (FedLLM) 框架進行了比較分析，這些框架集成了知識蒸餾 (KD) 和分割學習 (SL) 以減輕這些問題：1) FedLLM，客戶端上傳模型參數或梯度以實現直接而有效的微調；2) KD-FedLLM，它利用 KD 通過邏輯值進行有效的知識共享；3) Split-FedLLM，它將 LLM 分成兩部分，一部分在客戶端執行，另一部分在伺服器上執行，以平衡計算負載。每個框架都根據關鍵效能指標進行評估，包括模型準確度、通訊開銷和客戶端計算負載，從而深入了解它們在各種聯合微調場景中的有效性。通過此分析，我們確定了特定於框架的最佳化機會，以提高 FedLLM 的效率，並討論了更廣泛的研究方向，強調了為實際應用更好地適應 FedLLM 的公開機會。提供了一個用例來說明這三個框架在不同配置和設定下的效能比較。</paragraph>", "author": "Na Yan et.al.", "authors": "Na Yan, Yang Su, Yansha Deng, Robert Schober", "id": "2501.04436v1", "paper_url": "http://arxiv.org/abs/2501.04436v1", "repo": "null"}}