{"2407.13700": {"publish_time": "2024-07-18", "title": "Cross-Task Attack: A Self-Supervision Generative Framework Based on Attention Shift", "paper_summary": "Studying adversarial attacks on artificial intelligence (AI) systems helps\ndiscover model shortcomings, enabling the construction of a more robust system.\nMost existing adversarial attack methods only concentrate on single-task\nsingle-model or single-task cross-model scenarios, overlooking the multi-task\ncharacteristic of artificial intelligence systems. As a result, most of the\nexisting attacks do not pose a practical threat to a comprehensive and\ncollaborative AI system. However, implementing cross-task attacks is highly\ndemanding and challenging due to the difficulty in obtaining the real labels of\ndifferent tasks for the same picture and harmonizing the loss functions across\ndifferent tasks. To address this issue, we propose a self-supervised Cross-Task\nAttack framework (CTA), which utilizes co-attention and anti-attention maps to\ngenerate cross-task adversarial perturbation. Specifically, the co-attention\nmap reflects the area to which different visual task models pay attention,\nwhile the anti-attention map reflects the area that different visual task\nmodels neglect. CTA generates cross-task perturbations by shifting the\nattention area of samples away from the co-attention map and closer to the\nanti-attention map. We conduct extensive experiments on multiple vision tasks\nand the experimental results confirm the effectiveness of the proposed design\nfor adversarial attacks.", "paper_summary_zh": "研究人工智慧 (AI) 系統的對抗攻擊有助於\n發現模型的缺點，從而能夠建構更強大的系統。\n現有的對抗攻擊方法大多只專注於單一任務\n單一模型或單一任務跨模型場景，忽略了人工智慧系統的多任務\n特性。因此，現有的攻擊大多對全面且\n協作式 AI 系統不構成實際威脅。然而，由於難以取得\n同一張圖片不同任務的真實標籤，以及調和不同任務的損失函數，因此實作跨任務攻擊非常\n要求且具有挑戰性。為了解決這個問題，我們提出一個自我監督的跨任務\n攻擊架構 (CTA)，它利用共同注意和反注意地圖來\n產生跨任務對抗擾動。特別是，共同注意地圖反映不同視覺任務模型注意到的區域，\n而反注意地圖反映不同視覺任務模型忽略的區域。CTA 透過將\n樣本的注意區域從共同注意地圖移開並靠近\n反注意地圖來產生跨任務擾動。我們對多個視覺任務進行廣泛的實驗\n並且實驗結果證實了所提出的設計對於對抗攻擊的有效性。", "author": "Qingyuan Zeng et.al.", "authors": "Qingyuan Zeng, Yunpeng Gong, Min Jiang", "id": "2407.13700v1", "paper_url": "http://arxiv.org/abs/2407.13700v1", "repo": "null"}}