{"2411.12600": {"publish_time": "2024-11-19", "title": "Provable unlearning in topic modeling and downstream tasks", "paper_summary": "Machine unlearning algorithms are increasingly important as legal concerns\narise around the provenance of training data, but verifying the success of\nunlearning is often difficult. Provable guarantees for unlearning are often\nlimited to supervised learning settings. In this paper, we provide the first\ntheoretical guarantees for unlearning in the pre-training and fine-tuning\nparadigm by studying topic models, simple bag-of-words language models that can\nbe adapted to solve downstream tasks like retrieval and classification. First,\nwe design a provably effective unlearning algorithm for topic models that\nincurs a computational overhead independent of the size of the original\ndataset. Our analysis additionally quantifies the deletion capacity of the\nmodel -- i.e., the number of examples that can be unlearned without incurring a\nsignificant cost in model performance. Finally, we formally extend our analyses\nto account for adaptation to a given downstream task. In particular, we design\nan efficient algorithm to perform unlearning after fine-tuning the topic model\nvia a linear head. Notably, we show that it is easier to unlearn pre-training\ndata from models that have been fine-tuned to a particular task, and one can\nunlearn this data without modifying the base model.", "paper_summary_zh": "机器遗忘算法越来越重要，因为法律问题围绕训练数据的出处而出现，但验证遗忘的成功通常很困难。遗忘的可证明保证通常仅限于监督学习设置。在本文中，我们通过研究主题模型（可以适应求解诸如检索和分类之类的下游任务的简单的词袋语言模型）提供了预训练和微调范式中遗忘的第一个理论保证。首先，我们为主题模型设计了一种可证明有效的遗忘算法，该算法产生的计算开销与原始数据集的大小无关。我们的分析还量化了模型的删除容量——即，可以在不产生模型性能显着成本的情况下遗忘的示例数量。最后，我们正式扩展了我们的分析，以解释对给定下游任务的适应。特别是，我们设计了一种有效的算法，用于通过线性头部微调主题模型后执行遗忘。值得注意的是，我们表明从已针对特定任务微调的模型中遗忘预训练数据更容易，并且可以在不修改基础模型的情况下遗忘此数据。", "author": "Stanley Wei et.al.", "authors": "Stanley Wei, Sadhika Malladi, Sanjeev Arora, Amartya Sanyal", "id": "2411.12600v1", "paper_url": "http://arxiv.org/abs/2411.12600v1", "repo": "null"}}