{"2412.04106": {"publish_time": "2024-12-04", "title": "MRGen: Diffusion-based Controllable Data Engine for MRI Segmentation towards Unannotated Modalities", "paper_summary": "Medical image segmentation has recently demonstrated impressive progress with\ndeep neural networks, yet the heterogeneous modalities and scarcity of mask\nannotations limit the development of segmentation models on unannotated\nmodalities. This paper investigates a new paradigm for leveraging generative\nmodels in medical applications: controllably synthesizing data for unannotated\nmodalities, without requiring registered data pairs. Specifically, we make the\nfollowing contributions in this paper: (i) we collect and curate a large-scale\nradiology image-text dataset, MedGen-1M, comprising modality labels,\nattributes, region, and organ information, along with a subset of organ mask\nannotations, to support research in controllable medical image generation; (ii)\nwe propose a diffusion-based data engine, termed MRGen, which enables\ngeneration conditioned on text prompts and masks, synthesizing MR images for\ndiverse modalities lacking mask annotations, to train segmentation models on\nunannotated modalities; (iii) we conduct extensive experiments across various\nmodalities, illustrating that our data engine can effectively synthesize\ntraining samples and extend MRI segmentation towards unannotated modalities.", "paper_summary_zh": "醫學影像分割最近已透過深度神經網路展現驚人的進展，但異質模態和標籤稀少限制了在未標註模態上開發分割模型。本文探討了一個新典範，以利用生成模型在醫學應用中：可控地合成未標註模態的資料，而無需註冊資料對。具體來說，我們在本文中做出以下貢獻：(i) 我們收集並策劃了一個大規模的放射影像文字資料集 MedGen-1M，包含模態標籤、屬性、區域和器官資訊，以及一部分器官標籤，以支援可控醫學影像生成的相關研究；(ii) 我們提出了一個基於擴散的資料引擎，稱為 MRGen，它能夠根據文字提示和標籤生成條件，合成缺乏標籤註解的不同模態的 MR 影像，以訓練未標註模態的分割模型；(iii) 我們在各種模態中進行了廣泛的實驗，說明我們的資料引擎可以有效地合成訓練樣本，並將 MRI 分割延伸至未標註的模態。", "author": "Haoning Wu et.al.", "authors": "Haoning Wu, Ziheng Zhao, Ya Zhang, Weidi Xie, Yanfeng Wang", "id": "2412.04106v1", "paper_url": "http://arxiv.org/abs/2412.04106v1", "repo": "null"}}