{"2406.07081": {"publish_time": "2024-06-11", "title": "Efficiently Exploring Large Language Models for Document-Level Machine Translation with In-context Learning", "paper_summary": "Large language models (LLMs) exhibit outstanding performance in machine\ntranslation via in-context learning. In contrast to sentence-level translation,\ndocument-level translation (DOCMT) by LLMs based on in-context learning faces\ntwo major challenges: firstly, document translations generated by LLMs are\noften incoherent; secondly, the length of demonstration for in-context learning\nis usually limited. To address these issues, we propose a Context-Aware\nPrompting method (CAP), which enables LLMs to generate more accurate, cohesive,\nand coherent translations via in-context learning. CAP takes into account\nmulti-level attention, selects the most relevant sentences to the current one\nas context, and then generates a summary from these collected sentences.\nSubsequently, sentences most similar to the summary are retrieved from the\ndatastore as demonstrations, which effectively guide LLMs in generating\ncohesive and coherent translations. We conduct extensive experiments across\nvarious DOCMT tasks, and the results demonstrate the effectiveness of our\napproach, particularly in zero pronoun translation (ZPT) and literary\ntranslation tasks.", "paper_summary_zh": "大型語言模型 (LLM) 在機器翻譯中透過情境學習展現出傑出的表現。與句子層級翻譯相比，LLM 基於情境學習的文件層級翻譯 (DOCMT) 面臨兩項主要挑戰：首先，LLM 生成的文件翻譯常常不連貫；其次，情境學習的示範長度通常有限。為了解決這些問題，我們提出一個情境感知提示方法 (CAP)，它能讓 LLM 透過情境學習產生更準確、有凝聚力且連貫的翻譯。CAP 考量了多層級注意力，選擇與當前句子最相關的句子作為情境，然後從這些收集的句子產生摘要。隨後，從資料庫中擷取與摘要最相似的句子作為示範，有效引導 LLM 產生有凝聚力且連貫的翻譯。我們在各種 DOCMT 任務中進行廣泛的實驗，結果證明了我們方法的有效性，特別是在零代名詞翻譯 (ZPT) 和文學翻譯任務中。", "author": "Menglong Cui et.al.", "authors": "Menglong Cui, Jiangcun Du, Shaolin Zhu, Deyi Xiong", "id": "2406.07081v1", "paper_url": "http://arxiv.org/abs/2406.07081v1", "repo": "null"}}