{"2408.12320": {"publish_time": "2024-08-22", "title": "PolyRouter: A Multi-LLM Querying System", "paper_summary": "With the rapid growth of Large Language Models (LLMs) across various domains,\nnumerous new LLMs have emerged, each possessing domain-specific expertise. This\nproliferation has highlighted the need for quick, high-quality, and\ncost-effective LLM query response methods. Yet, no single LLM exists to\nefficiently balance this trilemma. Some models are powerful but extremely\ncostly, while others are fast and inexpensive but qualitatively inferior. To\naddress this challenge, we present PolyRouter, a non-monolithic LLM querying\nsystem that seamlessly integrates various LLM experts into a single query\ninterface and dynamically routes incoming queries to the most high-performant\nexpert based on query's requirements. Through extensive experiments, we\ndemonstrate that when compared to standalone expert models, PolyRouter improves\nquery efficiency by up to 40%, and leads to significant cost reductions of up\nto 30%, while maintaining or enhancing model performance by up to 10%.", "paper_summary_zh": "隨著大型語言模型 (LLM) 在各個領域快速發展，\n許多新的 LLM 應運而生，每個 LLM 都擁有特定領域的專業知識。這種激增凸顯了快速、高品質且\n具成本效益的 LLM 查詢回應方法的需求。然而，沒有任何單一 LLM 能有效平衡這個三難困境。有些模型功能強大但成本極高，而其他模型則快速且便宜但品質較差。為了應對這個挑戰，我們提出了 PolyRouter，一個非單體式 LLM 查詢系統，它將各種 LLM 專家無縫整合到單一查詢介面中，並根據查詢需求動態路由傳入查詢到效能最高的專家。透過廣泛的實驗，我們證明與獨立的專家模型相比，PolyRouter 將查詢效率提升了 40%，並將成本大幅降低了 30%，同時將模型效能提升或提高了 10%。", "author": "Dimitris Stripelis et.al.", "authors": "Dimitris Stripelis, Zijian Hu, Jipeng Zhang, Zhaozhuo Xu, Alay Shah, Han Jin, Yuhang Yao, Salman Avestimehr, Chaoyang He", "id": "2408.12320v1", "paper_url": "http://arxiv.org/abs/2408.12320v1", "repo": "null"}}