{"2501.02816": {"publish_time": "2025-01-06", "title": "InpDiffusion: Image Inpainting Localization via Conditional Diffusion Models", "paper_summary": "As artificial intelligence advances rapidly, particularly with the advent of\nGANs and diffusion models, the accuracy of Image Inpainting Localization (IIL)\nhas become increasingly challenging. Current IIL methods face two main\nchallenges: a tendency towards overconfidence, leading to incorrect\npredictions; and difficulty in detecting subtle tampering boundaries in\ninpainted images. In response, we propose a new paradigm that treats IIL as a\nconditional mask generation task utilizing diffusion models. Our method,\nInpDiffusion, utilizes the denoising process enhanced by the integration of\nimage semantic conditions to progressively refine predictions. During\ndenoising, we employ edge conditions and introduce a novel edge supervision\nstrategy to enhance the model's perception of edge details in inpainted\nobjects. Balancing the diffusion model's stochastic sampling with edge\nsupervision of tampered image regions mitigates the risk of incorrect\npredictions from overconfidence and prevents the loss of subtle boundaries that\ncan result from overly stochastic processes. Furthermore, we propose an\ninnovative Dual-stream Multi-scale Feature Extractor (DMFE) for extracting\nmulti-scale features, enhancing feature representation by considering both\nsemantic and edge conditions of the inpainted images. Extensive experiments\nacross challenging datasets demonstrate that the InpDiffusion significantly\noutperforms existing state-of-the-art methods in IIL tasks, while also\nshowcasing excellent generalization capabilities and robustness.", "paper_summary_zh": "随着人工智能的快速发展，特别是随着 GAN 和扩散模型的出现，图像修复定位 (IIL) 的准确性变得越来越具有挑战性。当前的 IIL 方法面临着两个主要挑战：过分自信的倾向，导致预测不正确；以及难以检测修复图像中的细微篡改边界。对此，我们提出了一个新的范例，将 IIL 视为利用扩散模型的条件掩码生成任务。我们的方法 InpDiffusion 利用了通过集成图像语义条件而增强的去噪过程来逐步细化预测。在去噪过程中，我们采用边缘条件并引入了一种新颖的边缘监督策略，以增强模型对修复对象中边缘细节的感知。通过边缘监督对扩散模型的随机采样和篡改图像区域进行平衡，可以降低因过度自信而导致预测不正确的风险，并防止因过度随机过程而导致的细微边界丢失。此外，我们提出了一种创新的双流多尺度特征提取器 (DMFE) 来提取多尺度特征，通过同时考虑修复图像的语义和边缘条件来增强特征表示。在具有挑战性的数据集上的大量实验表明，InpDiffusion 在 IIL 任务中明显优于现有的最先进方法，同时还展示了出色的泛化能力和鲁棒性。", "author": "Kai Wang et.al.", "authors": "Kai Wang, Shaozhang Niu, Qixian Hao, Jiwei Zhang", "id": "2501.02816v1", "paper_url": "http://arxiv.org/abs/2501.02816v1", "repo": "null"}}