{"2410.22071": {"publish_time": "2024-10-29", "title": "Distinguishing Ignorance from Error in LLM Hallucinations", "paper_summary": "Large language models (LLMs) are susceptible to hallucinations-outputs that\nare ungrounded, factually incorrect, or inconsistent with prior generations. We\nfocus on close-book Question Answering (CBQA), where previous work has not\nfully addressed the distinction between two possible kinds of hallucinations,\nnamely, whether the model (1) does not hold the correct answer in its\nparameters or (2) answers incorrectly despite having the required knowledge. We\nargue that distinguishing these cases is crucial for detecting and mitigating\nhallucinations. Specifically, case (2) may be mitigated by intervening in the\nmodel's internal computation, as the knowledge resides within the model's\nparameters. In contrast, in case (1) there is no parametric knowledge to\nleverage for mitigation, so it should be addressed by resorting to an external\nknowledge source or abstaining. To help distinguish between the two cases, we\nintroduce Wrong Answer despite having Correct Knowledge (WACK), an approach for\nconstructing model-specific datasets for the second hallucination type. Our\nprobing experiments indicate that the two kinds of hallucinations are\nrepresented differently in the model's inner states. Next, we show that\ndatasets constructed using WACK exhibit variations across models, demonstrating\nthat even when models share knowledge of certain facts, they still vary in the\nspecific examples that lead to hallucinations. Finally, we show that training a\nprobe on our WACK datasets leads to better hallucination detection of case (2)\nhallucinations than using the common generic one-size-fits-all datasets. The\ncode is available at\nhttps://github.com/technion-cs-nlp/hallucination-mitigation .", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 容易出現幻覺輸出，這些輸出沒有根據、事實不正確或與先前的世代不一致。我們專注於閉卷問答 (CBQA)，其中先前的研究尚未完全解決兩種可能的幻覺之間的區別，即模型 (1) 沒有在其參數中保存正確的答案，或 (2) 儘管擁有必要的知識，但回答不正確。我們認為區分這些情況對於檢測和減輕幻覺至關重要。具體來說，案例 (2) 可以通過干預模型的內部計算來減輕，因為知識存在於模型的參數中。相比之下，在案例 (1) 中沒有參數知識可以利用來減輕，因此應該訴諸於外部知識來源或放棄。為了幫助區分這兩種情況，我們引入了錯誤答案儘管有正確知識 (WACK)，這是一種為第二種類型的幻覺構建特定於模型的數據集的方法。我們的探測實驗表明，這兩種幻覺在模型的內部狀態中以不同的方式表示。接下來，我們展示了使用 WACK 構建的數據集在模型之間表現出差異，這表明即使模型共享某些事實的知識，它們在導致幻覺的具體示例中仍然有所不同。最後，我們展示了在我們的 WACK 數據集上訓練探測器比使用通用的通用統一數據集能更好地檢測案例 (2) 幻覺。代碼可在\nhttps://github.com/technion-cs-nlp/hallucination-mitigation 獲得。</paragraph>", "author": "Adi Simhi et.al.", "authors": "Adi Simhi, Jonathan Herzig, Idan Szpektor, Yonatan Belinkov", "id": "2410.22071v1", "paper_url": "http://arxiv.org/abs/2410.22071v1", "repo": "https://github.com/technion-cs-nlp/hallucination-mitigation"}}