{"2409.19886": {"publish_time": "2024-09-30", "title": "RouterDC: Query-Based Router by Dual Contrastive Learning for Assembling Large Language Models", "paper_summary": "Recent works show that assembling multiple off-the-shelf large language\nmodels (LLMs) can harness their complementary abilities. To achieve this,\nrouting is a promising method, which learns a router to select the most\nsuitable LLM for each query. However, existing routing models are ineffective\nwhen multiple LLMs perform well for a query. To address this problem, in this\npaper, we propose a method called query-based Router by Dual Contrastive\nlearning (RouterDC). The RouterDC model consists of an encoder and LLM\nembeddings, and we propose two contrastive learning losses to train the\nRouterDC model. Experimental results show that RouterDC is effective in\nassembling LLMs and largely outperforms individual top-performing LLMs as well\nas existing routing methods on both in-distribution (+2.76\\%) and\nout-of-distribution (+1.90\\%) tasks. Source code is available at\nhttps://github.com/shuhao02/RouterDC.", "paper_summary_zh": "最近的研究表明，组装多个现成的、大型语言模型 (LLM) 可以利用它们的互补能力。为了实现这一目标，路由是一种很有前景的方法，它学习路由器为每个查询选择最合适的 LLM。然而，当多个 LLM 对查询执行良好时，现有的路由模型无效。为了解决这个问题，在本文中，我们提出了一种基于查询的路由器方法，即双对比学习 (RouterDC)。RouterDC 模型由编码器和 LLM 嵌入组成，我们提出了两种对比学习损失来训练 RouterDC 模型。实验结果表明，RouterDC 在组装 LLM 方面是有效的，并且在分布内 (+2.76%) 和分布外 (+1.90%) 任务中都大大优于单独的顶级 LLM 以及现有的路由方法。源代码可在 https://github.com/shuhao02/RouterDC 获得。", "author": "Shuhao Chen et.al.", "authors": "Shuhao Chen, Weisen Jiang, Baijiong Lin, James T. Kwok, Yu Zhang", "id": "2409.19886v1", "paper_url": "http://arxiv.org/abs/2409.19886v1", "repo": "https://github.com/shuhao02/routerdc"}}