{"2405.18358": {"publish_time": "2024-05-28", "title": "MMCTAgent: Multi-modal Critical Thinking Agent Framework for Complex Visual Reasoning", "paper_summary": "Recent advancements in Multi-modal Large Language Models (MLLMs) have\nsignificantly improved their performance in tasks combining vision and\nlanguage. However, challenges persist in detailed multi-modal understanding,\ncomprehension of complex tasks, and reasoning over multi-modal information.\nThis paper introduces MMCTAgent, a novel multi-modal critical thinking agent\nframework designed to address the inherent limitations of current MLLMs in\ncomplex visual reasoning tasks. Inspired by human cognitive processes and\ncritical thinking, MMCTAgent iteratively analyzes multi-modal information,\ndecomposes queries, plans strategies, and dynamically evolves its reasoning.\nAdditionally, MMCTAgent incorporates critical thinking elements such as\nverification of final answers and self-reflection through a novel approach that\ndefines a vision-based critic and identifies task-specific evaluation criteria,\nthereby enhancing its decision-making abilities. Through rigorous evaluations\nacross various image and video understanding benchmarks, we demonstrate that\nMMCTAgent (with and without the critic) outperforms both foundational MLLMs and\nother tool-augmented pipelines.", "paper_summary_zh": "最近多模态大型语言模型 (MLLM) 的进步显著改善了它们在结合视觉和语言的任务中的性能。然而，在详细的多模态理解、复杂任务的理解以及对多模态信息进行推理方面仍然存在挑战。本文介绍了 MMCTAgent，这是一个新颖的多模态批判性思维代理框架，旨在解决当前 MLLM 在复杂视觉推理任务中的固有局限性。受人类认知过程和批判性思维的启发，MMCTAgent 迭代分析多模态信息，分解查询，规划策略，并动态地发展其推理。此外，MMCTAgent 结合了批判性思维元素，例如通过一种新颖的方法验证最终答案和自我反省，该方法定义了一个基于视觉的批评者并识别了特定任务的评估标准，从而增强了其决策能力。通过对各种图像和视频理解基准进行严格的评估，我们证明了 MMCTAgent（有和没有批评者）都优于基础 MLLM 和其他工具增强管道。", "author": "Somnath Kumar et.al.", "authors": "Somnath Kumar, Yash Gadhia, Tanuja Ganu, Akshay Nambi", "id": "2405.18358v1", "paper_url": "http://arxiv.org/abs/2405.18358v1", "repo": "null"}}