{"2411.17451": {"publish_time": "2024-11-26", "title": "VLRewardBench: A Challenging Benchmark for Vision-Language Generative Reward Models", "paper_summary": "Vision-language generative reward models (VL-GenRMs) play a crucial role in\naligning and evaluating multimodal AI systems, yet their own evaluation remains\nunder-explored. Current assessment methods primarily rely on AI-annotated\npreference labels from traditional VL tasks, which can introduce biases and\noften fail to effectively challenge state-of-the-art models. To address these\nlimitations, we introduce VL-RewardBench, a comprehensive benchmark spanning\ngeneral multimodal queries, visual hallucination detection, and complex\nreasoning tasks. Through our AI-assisted annotation pipeline combining sample\nselection with human verification, we curate 1,250 high-quality examples\nspecifically designed to probe model limitations. Comprehensive evaluation\nacross 16 leading large vision-language models, demonstrates VL-RewardBench's\neffectiveness as a challenging testbed, where even GPT-4o achieves only 65.4%\naccuracy, and state-of-the-art open-source models such as Qwen2-VL-72B,\nstruggle to surpass random-guessing. Importantly, performance on VL-RewardBench\nstrongly correlates (Pearson's r > 0.9) with MMMU-Pro accuracy using Best-of-N\nsampling with VL-GenRMs. Analysis experiments uncover three critical insights\nfor improving VL-GenRMs: (i) models predominantly fail at basic visual\nperception tasks rather than reasoning tasks; (ii) inference-time scaling\nbenefits vary dramatically by model capacity; and (iii) training VL-GenRMs to\nlearn to judge substantially boosts judgment capability (+14.7% accuracy for a\n7B VL-GenRM). We believe VL-RewardBench along with the experimental insights\nwill become a valuable resource for advancing VL-GenRMs.", "paper_summary_zh": "視覺語言生成獎勵模型 (VL-GenRM) 在調整和評估多模態 AI 系統中扮演著關鍵角色，但它們自己的評估仍然未被充分探討。目前的評估方法主要依賴於傳統 VL 任務中 AI 標註的偏好標籤，這可能會引入偏差，而且常常無法有效挑戰最先進的模型。為了解決這些限制，我們引入了 VL-RewardBench，這是一個涵蓋一般多模態查詢、視覺幻覺偵測和複雜推理任務的綜合基準測試。透過我們將樣本選擇與人工驗證相結合的 AI 輔助標註管道，我們策劃了 1,250 個高品質範例，專門用於探測模型限制。對 16 個領先的大型視覺語言模型進行的綜合評估證明了 VL-RewardBench 作為一個具有挑戰性的測試平台的有效性，其中即使 GPT-4o 也只達到了 65.4% 的準確度，而最先進的開源模型，例如 Qwen2-VL-72B，則難以超越隨機猜測。重要的是，VL-RewardBench 上的表現與使用 VL-GenRM 的 Best-of-N 採樣 MMMU-Pro 準確度密切相關（Pearson's r > 0.9）。分析實驗揭示了三項改進 VL-GenRM 的關鍵見解：(i) 模型主要在基本的視覺感知任務中失敗，而不是推理任務；(ii) 推論時間縮放的效益因模型容量而異；(iii) 訓練 VL-GenRM 學習判斷會大幅提升判斷能力（7B VL-GenRM 的準確度提高了 +14.7%）。我們相信 VL-RewardBench 連同實驗見解將成為推進 VL-GenRM 的寶貴資源。", "author": "Lei Li et.al.", "authors": "Lei Li, Yuancheng Wei, Zhihui Xie, Xuqing Yang, Yifan Song, Peiyi Wang, Chenxin An, Tianyu Liu, Sujian Li, Bill Yuchen Lin, Lingpeng Kong, Qi Liu", "id": "2411.17451v1", "paper_url": "http://arxiv.org/abs/2411.17451v1", "repo": "null"}}