{"2405.18208": {"publish_time": "2024-05-28", "title": "A Human-Like Reasoning Framework for Multi-Phases Planning Task with Large Language Models", "paper_summary": "Recent studies have highlighted their proficiency in some simple tasks like\nwriting and coding through various reasoning strategies. However, LLM agents\nstill struggle with tasks that require comprehensive planning, a process that\nchallenges current models and remains a critical research issue. In this study,\nwe concentrate on travel planning, a Multi-Phases planning problem, that\ninvolves multiple interconnected stages, such as outlining, information\ngathering, and planning, often characterized by the need to manage various\nconstraints and uncertainties. Existing reasoning approaches have struggled to\neffectively address this complex task. Our research aims to address this\nchallenge by developing a human-like planning framework for LLM agents, i.e.,\nguiding the LLM agent to simulate various steps that humans take when solving\nMulti-Phases problems. Specifically, we implement several strategies to enable\nLLM agents to generate a coherent outline for each travel query, mirroring\nhuman planning patterns. Additionally, we integrate Strategy Block and\nKnowledge Block into our framework: Strategy Block facilitates information\ncollection, while Knowledge Block provides essential information for detailed\nplanning. Through our extensive experiments, we demonstrate that our framework\nsignificantly improves the planning capabilities of LLM agents, enabling them\nto tackle the travel planning task with improved efficiency and effectiveness.\nOur experimental results showcase the exceptional performance of the proposed\nframework; when combined with GPT-4-Turbo, it attains $10\\times$ the\nperformance gains in comparison to the baseline framework deployed on\nGPT-4-Turbo.", "paper_summary_zh": "最近的研究強調了 LLM 代理在一些簡單任務（例如透過各種推理策略進行寫作和編碼）上的熟練度。然而，LLM 代理在需要全面規劃的任務上仍有困難，這個過程挑戰了當前的模型，並仍然是一個重要的研究議題。在這項研究中，我們專注於旅遊規劃，這是一個多階段規劃問題，涉及多個相互關聯的階段，例如概述、資訊收集和規劃，通常以需要管理各種限制和不確定性為特徵。現有的推理方法難以有效地解決這個複雜的任務。我們的研究旨在透過為 LLM 代理開發一個類人規劃架構來應對這個挑戰，也就是引導 LLM 代理模擬人類在解決多階段問題時採取的各種步驟。具體來說，我們實施了幾種策略，讓 LLM 代理能夠為每個旅遊查詢產生一個連貫的綱要，反映人類的規劃模式。此外，我們將策略區塊和知識區塊整合到我們的架構中：策略區塊促進資訊收集，而知識區塊則提供詳細規劃的必要資訊。透過我們廣泛的實驗，我們證明了我們的架構顯著地改善了 LLM 代理的規劃能力，使它們能夠以更高的效率和效能來應對旅遊規劃任務。我們的實驗結果展示了所提出的架構的卓越效能；當與 GPT-4-Turbo 結合使用時，與部署在 GPT-4-Turbo 上的基準架構相比，它達到了 $10\\times$ 的效能提升。", "author": "Chengxing Xie et.al.", "authors": "Chengxing Xie, Difan Zou", "id": "2405.18208v1", "paper_url": "http://arxiv.org/abs/2405.18208v1", "repo": "null"}}