{"2409.15813": {"publish_time": "2024-09-24", "title": "Layer-wise Model Merging for Unsupervised Domain Adaptation in Segmentation Tasks", "paper_summary": "Merging parameters of multiple models has resurfaced as an effective strategy\nto enhance task performance and robustness, but prior work is limited by the\nhigh costs of ensemble creation and inference. In this paper, we leverage the\nabundance of freely accessible trained models to introduce a cost-free approach\nto model merging. It focuses on a layer-wise integration of merged models,\naiming to maintain the distinctiveness of the task-specific final layers while\nunifying the initial layers, which are primarily associated with feature\nextraction. This approach ensures parameter consistency across all layers,\nessential for boosting performance. Moreover, it facilitates seamless\nintegration of knowledge, enabling effective merging of models from different\ndatasets and tasks. Specifically, we investigate its applicability in\nUnsupervised Domain Adaptation (UDA), an unexplored area for model merging, for\nSemantic and Panoptic Segmentation. Experimental results demonstrate\nsubstantial UDA improvements without additional costs for merging\nsame-architecture models from distinct datasets ($\\uparrow 2.6\\%$ mIoU) and\ndifferent-architecture models with a shared backbone ($\\uparrow 6.8\\%$ mIoU).\nFurthermore, merging Semantic and Panoptic Segmentation models increases mPQ by\n$\\uparrow 7\\%$. These findings are validated across a wide variety of UDA\nstrategies, architectures, and datasets.", "paper_summary_zh": "<paragraph>合併多個模型的參數已重新浮現為一種有效的策略，用以提升任務效能與穩健性，但先前的研究受限於整體建立與推論的高成本。在本文中，我們利用大量免費取得的已訓練模型，導入一種無成本的模型合併方法。它專注於合併模型的逐層整合，目標在於維持特定任務的最終層的獨特性，同時統一最初的層，這些層主要與特徵萃取相關。這種方法確保所有層的參數一致性，這對於提升效能至關重要。此外，它促進知識的無縫整合，讓來自不同資料集和任務的模型得以有效合併。具體來說，我們探討其在模型合併的未探索領域中用於無監督域適應 (UDA) 的適用性，以進行語義和全景分割。實驗結果顯示，在不增加合併成本的情況下，大幅改善 UDA，包括來自不同資料集的相同架構模型（mIoU 提升 2.6%）和具有共用主幹的不同架構模型（mIoU 提升 6.8%）。此外，合併語義和全景分割模型將 mPQ 提升 7%。這些發現已透過各種 UDA 策略、架構和資料集驗證。</paragraph>", "author": "Roberto Alcover-Couso et.al.", "authors": "Roberto Alcover-Couso, Juan C. SanMiguel, Marcos Escudero-Viñolo, Jose M Martínez", "id": "2409.15813v1", "paper_url": "http://arxiv.org/abs/2409.15813v1", "repo": "null"}}