{"2407.21630": {"publish_time": "2024-07-31", "title": "TAROT: Task-Oriented Authorship Obfuscation Using Policy Optimization Methods", "paper_summary": "Authorship obfuscation aims to disguise the identity of an author within a\ntext by altering the writing style, vocabulary, syntax, and other linguistic\nfeatures associated with the text author. This alteration needs to balance\nprivacy and utility. While strong obfuscation techniques can effectively hide\nthe author's identity, they often degrade the quality and usefulness of the\ntext for its intended purpose. Conversely, maintaining high utility tends to\nprovide insufficient privacy, making it easier for an adversary to de-anonymize\nthe author. Thus, achieving an optimal trade-off between these two conflicting\nobjectives is crucial. In this paper, we propose TAROT: Task-Oriented\nAuthorship Obfuscation Using Policy Optimization, a new unsupervised authorship\nobfuscation method whose goal is to optimize the privacy-utility trade-off by\nregenerating the entire text considering its downstream utility. Our approach\nleverages policy optimization as a fine-tuning paradigm over small language\nmodels in order to rewrite texts by preserving author identity and downstream\ntask utility. We show that our approach largely reduce the accuracy of\nattackers while preserving utility. We make our code and models publicly\navailable.", "paper_summary_zh": "作者混淆旨在通过改变与文本作者相关的写作风格、词汇、语法和其他语言特征来隐藏作者在文本中的身份。这种改变需要平衡隐私和实用性。虽然强大的混淆技术可以有效地隐藏作者的身份，但它们通常会降低文本的质量和实用性，使其无法达到预期目的。相反，维持高实用性往往会提供不足的隐私，使得对手更容易对作者进行去匿名化。因此，在两个相互冲突的目标之间取得最佳平衡至关重要。在本文中，我们提出了 TAROT：面向任务的作者混淆，使用策略优化，这是一种新的无监督作者混淆方法，其目标是通过重新生成考虑其下游实用性的整个文本来优化隐私实用性权衡。我们的方法利用策略优化作为小型语言模型上的微调范式，以便通过保留作者身份和下游任务实用性来重写文本。我们表明，我们的方法在保留实用性的同时大大降低了攻击者的准确性。我们将我们的代码和模型公开提供。", "author": "Gabriel Loiseau et.al.", "authors": "Gabriel Loiseau, Damien Sileo, Damien Riquet, Maxime Meyer, Marc Tommasi", "id": "2407.21630v1", "paper_url": "http://arxiv.org/abs/2407.21630v1", "repo": "null"}}