{"2406.11143": {"publish_time": "2024-06-17", "title": "Scorecards for Synthetic Medical Data Evaluation and Reporting", "paper_summary": "The growing utilization of synthetic medical data (SMD) in training and\ntesting AI-driven tools in healthcare necessitates a systematic framework for\nassessing SMD quality. The current lack of a standardized methodology to\nevaluate SMD, particularly in terms of its applicability in various medical\nscenarios, is a significant hindrance to its broader acceptance and utilization\nin healthcare applications. Here, we outline an evaluation framework designed\nto meet the unique requirements of medical applications, and introduce the\nconcept of SMD scorecards, which can serve as comprehensive reports that\naccompany artificially generated datasets. This can help standardize evaluation\nand enable SMD developers to assess and further enhance the quality of SMDs by\nidentifying areas in need of attention and ensuring that the synthetic data\nmore accurately approximate patient data.", "paper_summary_zh": "隨著合成醫療資料 (SMD) 在訓練和測試醫療保健中的人工智慧驅動工具的利用率日益提高，需要一個系統性的架構來評估 SMD 的品質。目前缺乏標準化的評估 SMD 的方法，特別是在其於各種醫療場景中的適用性方面，這嚴重阻礙了其在醫療保健應用中的更廣泛接受和利用。在此，我們概述了一個評估架構，旨在滿足醫療應用的獨特需求，並引入了 SMD 記分卡的概念，它可以作為人工生成資料集的綜合報告。這有助於標準化評估，並使 SMD 開發人員能夠評估和進一步提高 SMD 的品質，方法是找出需要關注的領域，並確保合成資料更準確地近似於患者資料。", "author": "Ghada Zamzmi et.al.", "authors": "Ghada Zamzmi, Adarsh Subbaswamy, Elena Sizikova, Edward Margerrison, Jana Delfino, Aldo Badano", "id": "2406.11143v1", "paper_url": "http://arxiv.org/abs/2406.11143v1", "repo": "null"}}