{"2406.17304": {"publish_time": "2024-06-25", "title": "Leveraging LLMs for Dialogue Quality Measurement", "paper_summary": "In task-oriented conversational AI evaluation, unsupervised methods poorly\ncorrelate with human judgments, and supervised approaches lack generalization.\nRecent advances in large language models (LLMs) show robust zeroshot and\nfew-shot capabilities across NLP tasks. This paper explores using LLMs for\nautomated dialogue quality evaluation, experimenting with various\nconfigurations on public and proprietary datasets. Manipulating factors such as\nmodel size, in-context examples, and selection techniques, we examine\n\"chain-of-thought\" (CoT) reasoning and label extraction procedures. Our results\nshow that (1) larger models yield more accurate dialogue labels; (2)\nalgorithmic selection of in-context examples outperforms random selection; (3)\nCoT reasoning where an LLM is asked to provide justifications before outputting\nfinal labels improves performance; and (4) fine-tuned LLMs outperform\nout-of-the-box ones. Our results indicate that LLMs that are suitably\nfine-tuned and have sufficient reasoning capabilities can be leveraged for\nautomated dialogue evaluation.", "paper_summary_zh": "在面向任務的對話式 AI 評估中，非監督式方法與人類判斷關聯性低，而監督式方法缺乏概括性。大型語言模型 (LLM) 的最新進展在各種 NLP 任務中展現出強大的零次學習和少次學習能力。本文探討使用 LLM 進行自動對話品質評估，並在公開和專有資料集上嘗試各種設定。我們透過調整模型大小、脈絡範例和選擇技術等因素，檢視「思維鏈」(CoT) 推理和標籤萃取程序。我們的結果顯示：(1) 較大的模型產生更準確的對話標籤；(2) 脈絡範例的演算法選擇優於隨機選擇；(3) CoT 推理，其中要求 LLM 在輸出最終標籤前提供依據，可改善效能；(4) 微調後的 LLM 優於開箱即用的 LLM。我們的結果表明，適當地微調且具備足夠推理能力的 LLM 可用於自動對話評估。", "author": "Jinghan Jia et.al.", "authors": "Jinghan Jia, Abi Komma, Timothy Leffel, Xujun Peng, Ajay Nagesh, Tamer Soliman, Aram Galstyan, Anoop Kumar", "id": "2406.17304v1", "paper_url": "http://arxiv.org/abs/2406.17304v1", "repo": "null"}}