{"2405.14853": {"publish_time": "2024-05-23", "title": "Privileged Sensing Scaffolds Reinforcement Learning", "paper_summary": "We need to look at our shoelaces as we first learn to tie them but having\nmastered this skill, can do it from touch alone. We call this phenomenon\n\"sensory scaffolding\": observation streams that are not needed by a master\nmight yet aid a novice learner. We consider such sensory scaffolding setups for\ntraining artificial agents. For example, a robot arm may need to be deployed\nwith just a low-cost, robust, general-purpose camera; yet its performance may\nimprove by having privileged training-time-only access to informative albeit\nexpensive and unwieldy motion capture rigs or fragile tactile sensors. For\nthese settings, we propose \"Scaffolder\", a reinforcement learning approach\nwhich effectively exploits privileged sensing in critics, world models, reward\nestimators, and other such auxiliary components that are only used at training\ntime, to improve the target policy. For evaluating sensory scaffolding agents,\nwe design a new \"S3\" suite of ten diverse simulated robotic tasks that explore\na wide range of practical sensor setups. Agents must use privileged camera\nsensing to train blind hurdlers, privileged active visual perception to help\nrobot arms overcome visual occlusions, privileged touch sensors to train robot\nhands, and more. Scaffolder easily outperforms relevant prior baselines and\nfrequently performs comparably even to policies that have test-time access to\nthe privileged sensors. Website: https://penn-pal-lab.github.io/scaffolder/", "paper_summary_zh": "我們在學習綁鞋帶時需要看著鞋帶，但一旦掌握了這項技能，就可以只靠觸覺就能完成。我們稱這種現象為「感官鷹架」：對大師來說不需要的觀察流，卻可能有助於新手學習。我們考慮將這種感官鷹架設置用於訓練人工代理。例如，機器人手臂可能只需要配備一個低成本、強固、通用的相機；然而，如果在訓練期間獨家取得昂貴且笨重的動作捕捉裝置或脆弱的觸覺感測器的存取權，其性能可能會有所提升。對於這些設定，我們提出「鷹架」，一種強化學習方法，有效利用批評者、世界模型、獎勵估計器和其他此類輔助元件中的特權感測，這些元件只在訓練期間使用，以改善目標策略。為了評估感官鷹架代理，我們設計了一套名為「S3」的新模擬機器人任務套件，其中包含十項不同的任務，探討了廣泛的實用感測器設置。代理必須使用特權相機感測器來訓練盲人跨欄者，使用特權主動視覺感知來幫助機器人手臂克服視覺遮擋，使用特權觸覺感測器來訓練機器人手，等等。鷹架輕鬆超越了相關的先前基準，而且即使對於在測試時可以存取特權感測器的策略，其表現也經常相當。網站：https://penn-pal-lab.github.io/scaffolder/", "author": "Edward S. Hu et.al.", "authors": "Edward S. Hu, James Springer, Oleh Rybkin, Dinesh Jayaraman", "id": "2405.14853v1", "paper_url": "http://arxiv.org/abs/2405.14853v1", "repo": "null"}}