{"2406.15325": {"publish_time": "2024-06-21", "title": "Bug In the Code Stack: Can LLMs Find Bugs in Large Python Code Stacks", "paper_summary": "Recent research in Needle-in-a-Haystack (NIAH) benchmarks has explored the\ncapabilities of Large Language Models (LLMs) in retrieving contextual\ninformation from large text documents. However, as LLMs become increasingly\nintegrated into software development processes, it is crucial to evaluate their\nperformance in code-based environments. As LLMs are further developed for\nprogram synthesis, we need to ensure that LLMs can understand syntax and write\nsyntactically correct code. As a step in ensuring LLMs understand syntax, LLMs\ncan be evaluated in their ability to find and detect syntax bugs. Our\nbenchmark, Bug In The Code Stack (BICS), is designed to assess the ability of\nLLMs to identify simple syntax bugs within large source code. Our findings\nreveal three key insights: (1) code-based environments pose significantly more\nchallenge compared to text-based environments for retrieval tasks, (2) there is\na substantial performance disparity among different models, and (3) there is a\nnotable correlation between longer context lengths and performance degradation,\nthough the extent of this degradation varies between models.", "paper_summary_zh": "最近在針頭在草堆（NIAH）基準測試中的研究探索了大型語言模型（LLM）從大型文本文件中檢索上下文資訊的能力。然而，隨著 LLM 愈來愈整合到軟體開發流程中，評估它們在基於程式碼的環境中的效能至關重要。由於 LLM 進一步開發用於程式合成，我們需要確保 LLM 能夠理解語法並撰寫語法正確的程式碼。作為確保 LLM 理解語法的步驟，可以評估 LLM 找出和偵測語法錯誤的能力。我們的基準測試，程式碼堆疊中的錯誤（BICS），旨在評估 LLM 識別大型原始碼中簡單語法錯誤的能力。我們的發現揭示了三個關鍵見解：(1) 與基於文字的環境相比，基於程式碼的環境對檢索任務構成更大的挑戰，(2) 不同模型之間存在顯著的效能差異，以及 (3) 較長的上下文長度和效能下降之間存在顯著相關性，雖然這種下降的程度在不同模型之間有所不同。", "author": "Hokyung Lee et.al.", "authors": "Hokyung Lee, Sumanyu Sharma, Bing Hu", "id": "2406.15325v1", "paper_url": "http://arxiv.org/abs/2406.15325v1", "repo": "null"}}