{"2501.01367": {"publish_time": "2025-01-02", "title": "Contrastive Learning from Exploratory Actions: Leveraging Natural Interactions for Preference Elicitation", "paper_summary": "People have a variety of preferences for how robots behave. To understand and\nreason about these preferences, robots aim to learn a reward function that\ndescribes how aligned robot behaviors are with a user's preferences. Good\nrepresentations of a robot's behavior can significantly reduce the time and\neffort required for a user to teach the robot their preferences. Specifying\nthese representations -- what \"features\" of the robot's behavior matter to\nusers -- remains a difficult problem; Features learned from raw data lack\nsemantic meaning and features learned from user data require users to engage in\ntedious labeling processes. Our key insight is that users tasked with\ncustomizing a robot are intrinsically motivated to produce labels through\nexploratory search; they explore behaviors that they find interesting and\nignore behaviors that are irrelevant. To harness this novel data source of\nexploratory actions, we propose contrastive learning from exploratory actions\n(CLEA) to learn trajectory features that are aligned with features that users\ncare about. We learned CLEA features from exploratory actions users performed\nin an open-ended signal design activity (N=25) with a Kuri robot, and evaluated\nCLEA features through a second user study with a different set of users (N=42).\nCLEA features outperformed self-supervised features when eliciting user\npreferences over four metrics: completeness, simplicity, minimality, and\nexplainability.", "paper_summary_zh": "人們對於機器人的行為方式有各種偏好。為了理解和推論這些偏好，機器人旨在學習一個獎勵函數，說明機器人的行為與使用者的偏好有多麼一致。良好的機器人行為表示可以大幅減少使用者教導機器人其偏好所需的時間和精力。說明這些表示——機器人行為的哪些「特徵」對使用者來說很重要——仍然是一個困難的問題；從原始資料學習到的特徵缺乏語意意義，而從使用者資料學習到的特徵需要使用者參與繁瑣的標籤處理程序。我們的關鍵見解是，負責自訂機器人的使用者本質上會透過探索性搜尋產生標籤；他們會探索他們覺得有趣的行為，並忽略不相關的行為。為了利用這個探索性動作的新穎資料來源，我們提出從探索性動作中進行對比學習 (CLEA)，以學習與使用者關心的特徵一致的軌跡特徵。我們從使用者在與 Kuri 機器人的開放式訊號設計活動 (N=25) 中執行的探索性動作中學習了 CLEA 特徵，並透過第二個使用者研究對 CLEA 特徵進行評估，該研究使用了一組不同的使用者 (N=42)。在引出使用者偏好時，CLEA 特徵在四個指標上優於自監督特徵：完整性、簡潔性、最小性、可解釋性。", "author": "Nathaniel Dennler et.al.", "authors": "Nathaniel Dennler, Stefanos Nikolaidis, Maja Matarić", "id": "2501.01367v1", "paper_url": "http://arxiv.org/abs/2501.01367v1", "repo": "null"}}