{"2502.17372": {"publish_time": "2025-02-24", "title": "Experimental validation of UAV search and detection system in real wilderness environment", "paper_summary": "Search and rescue (SAR) missions require reliable search methods to locate\nsurvivors, especially in challenging or inaccessible environments. This is why\nintroducing unmanned aerial vehicles (UAVs) can be of great help to enhance the\nefficiency of SAR missions while simultaneously increasing the safety of\neveryone involved in the mission. Motivated by this, we design and experiment\nwith autonomous UAV search for humans in a Mediterranean karst environment. The\nUAVs are directed using Heat equation-driven area coverage (HEDAC) ergodic\ncontrol method according to known probability density and detection function.\nThe implemented sensing framework consists of a probabilistic search model,\nmotion control system, and computer vision object detection. It enables\ncalculation of the probability of the target being detected in the SAR mission,\nand this paper focuses on experimental validation of proposed probabilistic\nframework and UAV control. The uniform probability density to ensure the even\nprobability of finding the targets in the desired search area is achieved by\nassigning suitably thought-out tasks to 78 volunteers. The detection model is\nbased on YOLO and trained with a previously collected ortho-photo image\ndatabase. The experimental search is carefully planned and conducted, while as\nmany parameters as possible are recorded. The thorough analysis consists of the\nmotion control system, object detection, and the search validation. The\nassessment of the detection and search performance provides strong indication\nthat the designed detection model in the UAV control algorithm is aligned with\nreal-world results.", "paper_summary_zh": "搜救 (SAR) 任務需要可靠的搜索方法來定位倖存者，特別是在具有挑戰性或無法進入的環境中。這就是為什麼引入無人機 (UAV) 可以極大地幫助提高 SAR 任務的效率，同時提高參與任務的所有人的安全性。受此啟發，我們設計並試驗了在地中海喀斯特環境中無人機自主搜索人類。根據已知的概率密度和檢測函數，使用熱方程式驅動區域覆蓋 (HEDAC) 爾格控制方法來引導無人機。實施的感測架構包含機率搜索模型、運動控制系統和電腦視覺物件偵測。它能夠計算在 SAR 任務中檢測到目標的機率，本文重點在於所提出的機率架構和無人機控制的實驗驗證。透過指派適當考慮周全的任務給 78 位志工，可以達成均勻的機率密度，以確保在所需的搜索區域中找到目標的機率均等。檢測模型基於 YOLO，並使用先前收集的正射影像資料庫進行訓練。實驗搜索經過仔細規劃和執行，同時記錄盡可能多的參數。徹底的分析包含運動控制系統、物件偵測和搜索驗證。對檢測和搜索效能的評估提供了強烈的跡象，表明無人機控制演算法中的設計檢測模型與真實世界的結果是一致的。", "author": "Stella Dumenčić et.al.", "authors": "Stella Dumenčić, Luka Lanča, Karlo Jakac, Stefan Ivić", "id": "2502.17372v1", "paper_url": "http://arxiv.org/abs/2502.17372v1", "repo": "null"}}