{"2504.07954": {"publish_time": "2025-04-10", "title": "Perception-R1: Pioneering Perception Policy with Reinforcement Learning", "paper_summary": "Inspired by the success of DeepSeek-R1, we explore the potential of\nrule-based reinforcement learning (RL) in MLLM post-training for perception\npolicy learning. While promising, our initial experiments reveal that\nincorporating a thinking process through RL does not consistently lead to\nperformance gains across all visual perception tasks. This leads us to delve\ninto the essential role of RL in the context of visual perception. In this\nwork, we return to the fundamentals and explore the effects of RL on different\nperception tasks. We observe that the perceptual complexity is a major factor\nin determining the effectiveness of RL. We also observe that reward design\nplays a crucial role in further approching the upper limit of model perception.\nTo leverage these findings, we propose Perception-R1, a scalable RL framework\nusing GRPO during MLLM post-training. With a standard Qwen2.5-VL-3B-Instruct,\nPerception-R1 achieves +4.2% on RefCOCO+, +17.9% on PixMo-Count, +4.2% on\nPageOCR, and notably, 31.9% AP on COCO2017 val for the first time, establishing\na strong baseline for perception policy learning.", "paper_summary_zh": "受到 DeepSeek-R1 的成功啟發，我們探索基於規則的強化學習 (RL) 在多模態大型語言模型 (MLLM) 後訓練中，用於感知策略學習的潛力。雖然前景看好，但我們最初的實驗表明，透過強化學習納入思維過程並不能在所有視覺感知任務中都帶來一致的效能提升。這促使我們深入研究強化學習在視覺感知領域中的重要作用。在這項工作中，我們回歸基礎，探索強化學習對不同感知任務的影響。我們觀察到，感知的複雜性是決定強化學習有效性的一個主要因素。我們還觀察到，獎勵設計在進一步逼近模型感知上限方面起著至關重要的作用。為了利用這些發現，我們提出了 Perception-R1，這是一個在 MLLM 後訓練期間使用 GRPO 的可擴展強化學習框架。透過標準的 Qwen2.5-VL-3B-Instruct 模型，Perception-R1 在 RefCOCO+ 上提升了 4.2%，在 PixMo-Count 上提升了 17.9%，在 PageOCR 上提升了 4.2%，尤其是在 COCO2017 val 上首次達到了 31.9% 的 AP，為感知策略學習建立了強大的基準。\n", "author": "En Yu et.al.", "authors": "En Yu, Kangheng Lin, Liang Zhao, Jisheng Yin, Yana Wei, Yuang Peng, Haoran Wei, Jianjian Sun, Chunrui Han, Zheng Ge, Xiangyu Zhang, Daxin Jiang, Jingyu Wang, Wenbing Tao", "id": "2504.07954v1", "paper_url": "http://arxiv.org/abs/2504.07954v1", "repo": "null"}}