{"2412.04236": {"publish_time": "2024-12-05", "title": "A History of Philosophy in Colombia through Topic Modelling", "paper_summary": "Data-driven approaches to philosophy have emerged as a valuable tool for\nstudying the history of the discipline. However, most studies in this area have\nfocused on a limited number of journals from specific regions and subfields. We\nexpand the scope of this research by applying dynamic topic modelling\ntechniques to explore the history of philosophy in Colombia and Latin America.\nOur study examines the Colombian philosophy journal Ideas y Valores, founded in\n1951 and currently one of the most influential academic philosophy journals in\nthe region. By analyzing the evolution of topics across the journal's history,\nwe identify various trends and specific dynamics in philosophical discourse\nwithin the Colombian and Latin American context. Our findings reveal that the\nmost prominent topics are value theory (including ethics, political philosophy,\nand aesthetics), epistemology, and the philosophy of science. We also trace the\nevolution of articles focusing on the historical and interpretive aspects of\nphilosophical texts, and we note a notable emphasis on German philosophers such\nas Kant, Husserl, and Hegel on various topics throughout the journal's\nlifetime. Additionally, we investigate whether articles with a historical focus\nhave decreased over time due to editorial pressures. Our analysis suggests no\nsignificant decline in such articles. Finally, we propose ideas for extending\nthis research to other Latin American journals and suggest improvements for\nnatural language processing workflows in non-English languages.", "paper_summary_zh": "<paragraph>資料驅動的哲學方法已成為研究該學科歷史的寶貴工具。然而，此領域的大多數研究都集中在特定區域和子領域的少量期刊上。我們透過應用動態主題建模技術來探索哥倫比亞和拉丁美洲的哲學歷史，以擴展這項研究的範圍。我們的研究探討了創立於 1951 年的哥倫比亞哲學期刊《Ideas y Valores》，它目前是該地區最具影響力的學術哲學期刊之一。透過分析期刊歷史中主題的演變，我們找出哥倫比亞和拉丁美洲背景中哲學論述中的各種趨勢和具體動態。我們的研究結果顯示，最突出的主題是價值理論（包括倫理學、政治哲學和美學）、認識論和科學哲學。我們也追溯了專注於哲學文本的歷史和詮釋面向的文章的演變，並注意到在期刊的整個生命週期中，對康德、胡塞爾和黑格爾等德國哲學家的各種主題都有顯著的重視。此外，我們調查了具有歷史焦點的文章是否因編輯壓力而隨著時間推移而減少。我們的分析表明，此類文章並未顯著減少。最後，我們提出了將這項研究擴展到其他拉丁美洲期刊的想法，並建議改善非英語語言的自然語言處理工作流程。</paragraph>", "author": "Juan R. Loaiza et.al.", "authors": "Juan R. Loaiza, Miguel González-Duque", "id": "2412.04236v1", "paper_url": "http://arxiv.org/abs/2412.04236v1", "repo": "null"}}