{"2501.13042": {"publish_time": "2025-01-22", "title": "Does Table Source Matter? Benchmarking and Improving Multimodal Scientific Table Understanding and Reasoning", "paper_summary": "Recent large language models (LLMs) have advanced table understanding\ncapabilities but rely on converting tables into text sequences. While\nmultimodal large language models (MLLMs) enable direct visual processing, they\nface limitations in handling scientific tables due to fixed input image\nresolutions and insufficient numerical reasoning capabilities. We present a\ncomprehensive framework for multimodal scientific table understanding and\nreasoning with dynamic input image resolutions. Our framework consists of three\nkey components: (1) MMSci-Pre, a domain-specific table structure learning\ndataset of 52K scientific table structure recognition samples, (2) MMSci-Ins,\nan instruction tuning dataset with 12K samples across three table-based tasks,\nand (3) MMSci-Eval, a benchmark with 3,114 testing samples specifically\ndesigned to evaluate numerical reasoning capabilities. Extensive experiments\ndemonstrate that our domain-specific approach with 52K scientific table images\nachieves superior performance compared to 150K general-domain tables,\nhighlighting the importance of data quality over quantity. Our proposed\ntable-based MLLMs with dynamic input resolutions show significant improvements\nin both general table understanding and numerical reasoning capabilities, with\nstrong generalisation to held-out datasets. Our code and data are publicly\navailable at https://github.com/Bernard-Yang/MMSci_Table.", "paper_summary_zh": "最近的大型語言模型 (LLM) 提升了表格理解能力，但依賴於將表格轉換為文字序列。雖然多模態大型語言模型 (MLLM) 能直接進行視覺處理，但由於固定的輸入影像解析度和不足的數字推理能力，在處理科學表格時面臨限制。我們提出一個多模態科學表格理解和推理的全面架構，並採用動態輸入影像解析度。我們的架構包含三個關鍵組成部分：(1) MMSci-Pre，一個特定領域的表格結構學習資料集，包含 52K 個科學表格結構辨識範例，(2) MMSci-Ins，一個指令調整資料集，在三項基於表格的任務中包含 12K 個範例，以及 (3) MMSci-Eval，一個基準，包含 3,114 個測試範例，專門用於評估數字推理能力。廣泛的實驗證明，我們採用 52K 個科學表格影像的特定領域方法，與 150K 個一般領域表格相比，能達成更好的效能，突顯資料品質比數量重要的概念。我們提出的基於表格的 MLLM 採用動態輸入解析度，在一般表格理解和數字推理能力方面都展現顯著的進步，並能有效泛化到保留的資料集。我們的程式碼和資料已公開發布於 https://github.com/Bernard-Yang/MMSci_Table。", "author": "Bohao Yang et.al.", "authors": "Bohao Yang, Yingji Zhang, Dong Liu, André Freitas, Chenghua Lin", "id": "2501.13042v1", "paper_url": "http://arxiv.org/abs/2501.13042v1", "repo": "https://github.com/bernard-yang/mmsci_table"}}