{"2406.18115": {"publish_time": "2024-06-26", "title": "Open-vocabulary Mobile Manipulation in Unseen Dynamic Environments with 3D Semantic Maps", "paper_summary": "Open-Vocabulary Mobile Manipulation (OVMM) is a crucial capability for\nautonomous robots, especially when faced with the challenges posed by unknown\nand dynamic environments. This task requires robots to explore and build a\nsemantic understanding of their surroundings, generate feasible plans to\nachieve manipulation goals, adapt to environmental changes, and comprehend\nnatural language instructions from humans. To address these challenges, we\npropose a novel framework that leverages the zero-shot detection and grounded\nrecognition capabilities of pretraining visual-language models (VLMs) combined\nwith dense 3D entity reconstruction to build 3D semantic maps. Additionally, we\nutilize large language models (LLMs) for spatial region abstraction and online\nplanning, incorporating human instructions and spatial semantic context. We\nhave built a 10-DoF mobile manipulation robotic platform JSR-1 and demonstrated\nin real-world robot experiments that our proposed framework can effectively\ncapture spatial semantics and process natural language user instructions for\nzero-shot OVMM tasks under dynamic environment settings, with an overall\nnavigation and task success rate of 80.95% and 73.33% over 105 episodes, and\nbetter SFT and SPL by 157.18% and 19.53% respectively compared to the baseline.\nFurthermore, the framework is capable of replanning towards the next most\nprobable candidate location based on the spatial semantic context derived from\nthe 3D semantic map when initial plans fail, keeping an average success rate of\n76.67%.", "paper_summary_zh": "開放詞彙行動操作 (OVMM) 是自主機器人的關鍵能力，尤其是在面對未知和動態環境所帶來的挑戰時。此任務需要機器人探索並建立其周圍環境的語義理解、產生可行的計畫以達成操作目標、適應環境變化，以及理解人類的自然語言指令。為了應對這些挑戰，我們提出一個新穎的架構，該架構利用預訓練視覺語言模型 (VLM) 的零次方偵測和紮根識別能力，結合密集的 3D 實體重建，以建立 3D 語義地圖。此外，我們利用大型語言模型 (LLM) 進行空間區域抽象化和線上規劃，並納入人類指令和空間語義背景。我們已經建立了一個 10-DoF 行動操作機器人平台 JSR-1，並在真實世界的機器人實驗中證明，我們提出的架構可以在動態環境設定下有效擷取空間語義和處理自然語言使用者指令，以進行零次方 OVMM 任務，在 105 個回合中的整體導航和任務成功率分別為 80.95% 和 73.33%，與基線相比，SFT 和 SPL 分別提高了 157.18% 和 19.53%。此外，當初始計畫失敗時，該架構能夠根據從 3D 語義地圖衍生的空間語義背景，重新計畫到下一個最可能的候選位置，保持平均成功率為 76.67%。", "author": "Dicong Qiu et.al.", "authors": "Dicong Qiu, Wenzong Ma, Zhenfu Pan, Hui Xiong, Junwei Liang", "id": "2406.18115v1", "paper_url": "http://arxiv.org/abs/2406.18115v1", "repo": "null"}}