{"2409.02245": {"publish_time": "2024-09-03", "title": "FastVoiceGrad: One-step Diffusion-Based Voice Conversion with Adversarial Conditional Diffusion Distillation", "paper_summary": "Diffusion-based voice conversion (VC) techniques such as VoiceGrad have\nattracted interest because of their high VC performance in terms of speech\nquality and speaker similarity. However, a notable limitation is the slow\ninference caused by the multi-step reverse diffusion. Therefore, we propose\nFastVoiceGrad, a novel one-step diffusion-based VC that reduces the number of\niterations from dozens to one while inheriting the high VC performance of the\nmulti-step diffusion-based VC. We obtain the model using adversarial\nconditional diffusion distillation (ACDD), leveraging the ability of generative\nadversarial networks and diffusion models while reconsidering the initial\nstates in sampling. Evaluations of one-shot any-to-any VC demonstrate that\nFastVoiceGrad achieves VC performance superior to or comparable to that of\nprevious multi-step diffusion-based VC while enhancing the inference speed.\nAudio samples are available at\nhttps://www.kecl.ntt.co.jp/people/kaneko.takuhiro/projects/fastvoicegrad/.", "paper_summary_zh": "<paragraph>基於擴散的語音轉換 (VC) 技術，例如 VoiceGrad，因其在語音品質和說話者相似度方面的出色 VC 效能而備受關注。然而，一個顯著的限制是多步驟反向擴散所造成的緩慢推論。因此，我們提出 FastVoiceGrad，一種新穎的單步驟基於擴散的 VC，它將迭代次數從數十次減少到一次，同時繼承了基於多步驟擴散的 VC 的高 VC 效能。我們使用對抗條件擴散蒸餾 (ACDD) 獲取模型，利用生成對抗網路和擴散模型的能力，同時重新考慮採樣中的初始狀態。單次任意到任意 VC 的評估表明，FastVoiceGrad 達到了優於或等於先前基於多步驟擴散的 VC 的 VC 效能，同時提高了推論速度。音訊範例可在 https://www.kecl.ntt.co.jp/people/kaneko.takuhiro/projects/fastvoicegrad/ 取得。</paragraph>", "author": "Takuhiro Kaneko et.al.", "authors": "Takuhiro Kaneko, Hirokazu Kameoka, Kou Tanaka, Yuto Kondo", "id": "2409.02245v1", "paper_url": "http://arxiv.org/abs/2409.02245v1", "repo": "null"}}