{"2502.02904": {"publish_time": "2025-02-05", "title": "ScholaWrite: A Dataset of End-to-End Scholarly Writing Process", "paper_summary": "Writing is a cognitively demanding task involving continuous decision-making,\nheavy use of working memory, and frequent switching between multiple\nactivities. Scholarly writing is particularly complex as it requires authors to\ncoordinate many pieces of multiform knowledge. To fully understand writers'\ncognitive thought process, one should fully decode the end-to-end writing data\n(from individual ideas to final manuscript) and understand their complex\ncognitive mechanisms in scholarly writing. We introduce ScholaWrite dataset,\nthe first-of-its-kind keystroke logs of an end-to-end scholarly writing process\nfor complete manuscripts, with thorough annotations of cognitive writing\nintentions behind each keystroke. Our dataset includes LaTeX-based keystroke\ndata from five preprints with nearly 62K total text changes and annotations\nacross 4 months of paper writing. ScholaWrite shows promising usability and\napplications (e.g., iterative self-writing) for the future development of AI\nwriting assistants for academic research, which necessitate complex methods\nbeyond LLM prompting. Our experiments clearly demonstrated the importance of\ncollection of end-to-end writing data, rather than the final manuscript, for\nthe development of future writing assistants to support the cognitive thinking\nprocess of scientists. Our de-identified dataset, demo, and code repository are\navailable on our project page.", "paper_summary_zh": "<paragraph>寫作是一項認知要求很高的任務，涉及持續的決策制定、大量使用工作記憶，以及在多項活動之間頻繁切換。學術寫作尤其複雜，因為它要求作者協調許多形式多樣的知識。為了充分理解作家的認知思維過程，應該充分解碼端到端的寫作數據（從單個想法到最終手稿），並理解他們在學術寫作中的複雜認知機制。我們介紹了 ScholaWrite 數據集，這是第一個端到端學術寫作過程的鍵盤記錄，適用於完整手稿，並對每個鍵擊背後的認知寫作意圖進行了徹底註解。我們的數據集包括來自五篇預印本的基於 LaTeX 的鍵擊數據，在 4 個月的論文寫作過程中，總共進行了近 62K 次文本更改和註解。ScholaWrite 展示了有希望的可用性和應用（例如，迭代自寫），用於未來開發學術研究的 AI 寫作助手，這需要超越 LLM 提示的複雜方法。我們的實驗清楚地證明了收集端到端寫作數據（而不是最終手稿）對於開發未來的寫作助手以支持科學家的認知思維過程的重要性。我們的去識別數據集、演示和代碼存儲庫可在我們的項目頁面上找到。</paragraph>", "author": "Linghe Wang et.al.", "authors": "Linghe Wang, Minhwa Lee, Ross Volkov, Luan Tuyen Chau, Dongyeop Kang", "id": "2502.02904v1", "paper_url": "http://arxiv.org/abs/2502.02904v1", "repo": "null"}}