{"2406.08018": {"publish_time": "2024-06-12", "title": "SHACL2FOL: An FOL Toolkit for SHACL Decision Problems", "paper_summary": "Recent studies on the Shapes Constraint Language (SHACL), a W3C specification\nfor validating RDF graphs, rely on translating the language into first-order\nlogic in order to provide formally-grounded solutions to the validation,\ncontainment and satisfiability decision problems. Continuing on this line of\nresearch, we introduce SHACL2FOL, the first automatic tool that (i) translates\nSHACL documents into FOL sentences and (ii) computes the answer to the two\nstatic analysis problems of satisfiability and containment; it also allow to\ntest the validity of a graph with respect to a set of constraints. By\nintegrating with existing theorem provers, such as E and Vampire, the tool\ncomputes the answer to the aforementioned decision problems and outputs the\ncorresponding first-order logic theories in the standard TPTP format. We\nbelieve this tool can contribute to further theoretical studies of SHACL, by\nproviding an automatic first-order logic interpretation of its semantics, while\nalso benefiting SHACL practitioners, by supplying static analysis capabilities\nto help the creation and management of SHACL constraints.", "paper_summary_zh": "最近對形狀約束語言 (SHACL) 的研究，W3C 規範用於驗證 RDF 圖形，依賴於將語言轉譯成一階邏輯，以便針對驗證、包含和可滿足性決策問題提供正式依據的解決方案。延續這條研究路線，我們介紹 SHACL2FOL，第一個自動工具：(i) 將 SHACL 文件轉譯成 FOL 句子，以及 (ii) 計算可滿足性和包含這兩個靜態分析問題的答案；它也允許測試圖形相對於一組約束的有效性。藉由整合現有的定理證明器，例如 E 和 Vampire，此工具計算前述決策問題的答案，並輸出標準 TPTP 格式中對應的一階邏輯理論。我們相信此工具有助於進一步的 SHACL 理論研究，藉由提供其語意的自動一階邏輯詮釋，同時也讓 SHACL 從業人員受益，藉由提供靜態分析功能來協助建立和管理 SHACL 約束。", "author": "Paolo Pareti et.al.", "authors": "Paolo Pareti", "id": "2406.08018v1", "paper_url": "http://arxiv.org/abs/2406.08018v1", "repo": "https://github.com/paolo7/shacl2fol"}}