{"2408.16634": {"publish_time": "2024-08-29", "title": "RLCP: A Reinforcement Learning-based Copyright Protection Method for Text-to-Image Diffusion Model", "paper_summary": "The increasing sophistication of text-to-image generative models has led to\ncomplex challenges in defining and enforcing copyright infringement criteria\nand protection. Existing methods, such as watermarking and dataset\ndeduplication, fail to provide comprehensive solutions due to the lack of\nstandardized metrics and the inherent complexity of addressing copyright\ninfringement in diffusion models. To deal with these challenges, we propose a\nReinforcement Learning-based Copyright Protection(RLCP) method for\nText-to-Image Diffusion Model, which minimizes the generation of\ncopyright-infringing content while maintaining the quality of the\nmodel-generated dataset. Our approach begins with the introduction of a novel\ncopyright metric grounded in copyright law and court precedents on\ninfringement. We then utilize the Denoising Diffusion Policy Optimization\n(DDPO) framework to guide the model through a multi-step decision-making\nprocess, optimizing it using a reward function that incorporates our proposed\ncopyright metric. Additionally, we employ KL divergence as a regularization\nterm to mitigate some failure modes and stabilize RL fine-tuning. Experiments\nconducted on 3 mixed datasets of copyright and non-copyright images demonstrate\nthat our approach significantly reduces copyright infringement risk while\nmaintaining image quality.", "paper_summary_zh": "文本到图像生成模型日益复杂，导致在定义和执行版权侵权标准和保护方面面临复杂的挑战。现有的方法（例如水印和数据集去重）由于缺乏标准化指标和解决扩散模型中版权侵权的固有复杂性而无法提供全面的解决方案。为了应对这些挑战，我们提出了一种基于强化学习的文本到图像扩散模型版权保护（RLCP）方法，该方法最大程度地减少了侵犯版权内容的生成，同时保持了模型生成数据集的质量。我们的方法首先引入了一种新的版权度量，该度量基于版权法和侵权方面的法院判例。然后，我们利用去噪扩散策略优化（DDPO）框架指导模型完成多步骤决策过程，使用包含我们提出的版权度量的奖励函数对其进行优化。此外，我们采用 KL 散度作为正则化项，以减轻一些故障模式并稳定 RL 微调。在 3 个包含版权和非版权图像的混合数据集上进行的实验表明，我们的方法显著降低了版权侵权风险，同时保持了图像质量。", "author": "Zhuan Shi et.al.", "authors": "Zhuan Shi, Jing Yan, Xiaoli Tang, Lingjuan Lyu, Boi Faltings", "id": "2408.16634v1", "paper_url": "http://arxiv.org/abs/2408.16634v1", "repo": "null"}}