{"2408.16634": {"publish_time": "2024-08-29", "title": "RLCP: A Reinforcement Learning-based Copyright Protection Method for Text-to-Image Diffusion Model", "paper_summary": "The increasing sophistication of text-to-image generative models has led to\ncomplex challenges in defining and enforcing copyright infringement criteria\nand protection. Existing methods, such as watermarking and dataset\ndeduplication, fail to provide comprehensive solutions due to the lack of\nstandardized metrics and the inherent complexity of addressing copyright\ninfringement in diffusion models. To deal with these challenges, we propose a\nReinforcement Learning-based Copyright Protection(RLCP) method for\nText-to-Image Diffusion Model, which minimizes the generation of\ncopyright-infringing content while maintaining the quality of the\nmodel-generated dataset. Our approach begins with the introduction of a novel\ncopyright metric grounded in copyright law and court precedents on\ninfringement. We then utilize the Denoising Diffusion Policy Optimization\n(DDPO) framework to guide the model through a multi-step decision-making\nprocess, optimizing it using a reward function that incorporates our proposed\ncopyright metric. Additionally, we employ KL divergence as a regularization\nterm to mitigate some failure modes and stabilize RL fine-tuning. Experiments\nconducted on 3 mixed datasets of copyright and non-copyright images demonstrate\nthat our approach significantly reduces copyright infringement risk while\nmaintaining image quality.", "paper_summary_zh": "隨著文字轉圖片生成模型的複雜性日益提升，在定義和執行著作權侵權標準及保護方面產生了複雜的挑戰。現有的方法，例如浮水印和資料集去重，由於缺乏標準化指標和處理擴散模型中著作權侵權的固有複雜性，無法提供全面的解決方案。為了解決這些挑戰，我們提出了一種基於強化學習的文字轉圖片擴散模型著作權保護 (RLCP) 方法，該方法在維持模型生成資料集品質的同時，將著作權侵權內容的生成降至最低。我們的做法始於引入一種新的著作權指標，該指標基於著作權法和侵權方面的法院判例。然後，我們利用去噪擴散策略最佳化 (DDPO) 架構引導模型進行多步驟決策制定，使用結合我們提出的著作權指標的獎勵函數對其進行最佳化。此外，我們採用 KL 散度作為正則化項，以減輕某些失敗模式並穩定 RL 微調。在 3 個著作權和非著作權圖像的混合資料集上進行的實驗表明，我們的做法顯著降低了著作權侵權風險，同時維持了圖像品質。", "author": "Zhuan Shi et.al.", "authors": "Zhuan Shi, Jing Yan, Xiaoli Tang, Lingjuan Lyu, Boi Faltings", "id": "2408.16634v2", "paper_url": "http://arxiv.org/abs/2408.16634v2", "repo": "null"}}