{"2502.03080": {"publish_time": "2025-02-05", "title": "IAO Prompting: Making Knowledge Flow Explicit in LLMs through Structured Reasoning Templates", "paper_summary": "While Large Language Models (LLMs) demonstrate impressive reasoning\ncapabilities, understanding and validating their knowledge utilization remains\nchallenging. Chain-of-thought (CoT) prompting partially addresses this by\nrevealing intermediate reasoning steps, but the knowledge flow and application\nremain implicit. We introduce IAO (Input-Action-Output) prompting, a structured\ntemplate-based method that explicitly models how LLMs access and apply their\nknowledge during complex reasoning tasks. IAO decomposes problems into\nsequential steps, each clearly identifying the input knowledge being used, the\naction being performed, and the resulting output. This structured decomposition\nenables us to trace knowledge flow, verify factual consistency, and identify\npotential knowledge gaps or misapplications. Through experiments across diverse\nreasoning tasks, we demonstrate that IAO not only improves zero-shot\nperformance but also provides transparency in how LLMs leverage their stored\nknowledge. Human evaluation confirms that this structured approach enhances our\nability to verify knowledge utilization and detect potential hallucinations or\nreasoning errors. Our findings provide insights into both knowledge\nrepresentation within LLMs and methods for more reliable knowledge application.", "paper_summary_zh": "儘管大型語言模型 (LLM) 展現出令人印象深刻的推理能力，但了解和驗證其知識應用仍然具有挑戰性。思想鏈 (CoT) 提示透過揭示中間推理步驟來部分解決此問題，但知識流和應用仍然是隱含的。我們引入了 IAO（輸入-動作-輸出）提示，一種結構化的基於範本的方法，用於明確建模 LLM 在複雜推理任務期間如何存取和應用其知識。IAO 將問題分解為連續步驟，每個步驟清楚地識別所使用的輸入知識、執行的動作和產生的輸出。這種結構化分解使我們能夠追蹤知識流、驗證事實一致性，並找出潛在的知識差距或誤用。透過在各種推理任務中進行實驗，我們證明 IAO 不僅改善了零次學習效能，還提供了 LLM 如何利用其儲存知識的透明度。人類評估證實，這種結構化方法增強了我們驗證知識利用和偵測潛在幻覺或推理錯誤的能力。我們的發現提供了對 LLM 內部知識表示和更可靠知識應用方法的見解。", "author": "Aissatou Diallo et.al.", "authors": "Aissatou Diallo, Antonis Bikakis, Luke Dickens, Anthony Hunter, Rob Miller", "id": "2502.03080v1", "paper_url": "http://arxiv.org/abs/2502.03080v1", "repo": "null"}}