{"2410.10303": {"publish_time": "2024-10-14", "title": "A Comparative Study of Translation Bias and Accuracy in Multilingual Large Language Models for Cross-Language Claim Verification", "paper_summary": "The rise of digital misinformation has heightened interest in using\nmultilingual Large Language Models (LLMs) for fact-checking. This study\nsystematically evaluates translation bias and the effectiveness of LLMs for\ncross-lingual claim verification across 15 languages from five language\nfamilies: Romance, Slavic, Turkic, Indo-Aryan, and Kartvelian. Using the XFACT\ndataset to assess their impact on accuracy and bias, we investigate two\ndistinct translation methods: pre-translation and self-translation. We use\nmBERT's performance on the English dataset as a baseline to compare\nlanguage-specific accuracies. Our findings reveal that low-resource languages\nexhibit significantly lower accuracy in direct inference due to\nunderrepresentation in the training data. Furthermore, larger models\ndemonstrate superior performance in self-translation, improving translation\naccuracy and reducing bias. These results highlight the need for balanced\nmultilingual training, especially in low-resource languages, to promote\nequitable access to reliable fact-checking tools and minimize the risk of\nspreading misinformation in different linguistic contexts.", "paper_summary_zh": "數位錯誤資訊的興起，加劇了人們對於使用多語言大型語言模型 (LLM) 進行事實查核的興趣。本研究系統性地評估了翻譯偏差以及 LLM 在 15 種語言中進行跨語言聲明驗證的有效性，這些語言來自五個語言家族：羅曼語族、斯拉夫語族、突厥語族、印度-雅利安語族和卡特維爾語族。我們使用 XFACT 資料集來評估它們對準確性和偏差的影響，並研究了兩種不同的翻譯方法：預翻譯和自翻譯。我們使用 mBERT 在英語資料集上的表現作為基準，來比較特定語言的準確性。我們的研究結果顯示，由於在訓練資料中代表性不足，低資源語言在直接推論中表現出顯著較低的準確性。此外，較大的模型在自翻譯中表現出優異的表現，提高了翻譯準確性並減少了偏差。這些結果突顯了平衡多語言訓練的必要性，特別是在低資源語言中，以促進對可靠事實查核工具的公平使用，並最大程度地降低在不同語言環境中散布錯誤資訊的風險。", "author": "Aryan Singhal et.al.", "authors": "Aryan Singhal, Veronica Shao, Gary Sun, Ryan Ding, Jonathan Lu, Kevin Zhu", "id": "2410.10303v1", "paper_url": "http://arxiv.org/abs/2410.10303v1", "repo": "https://github.com/3x-dev/Comparative-Study-of-Bias-and-Accuracy-in-Multilingual-LLMs-for-Cross-Language-Claim-Verification"}}