{"2408.03819": {"publish_time": "2024-08-07", "title": "Leveraging Variation Theory in Counterfactual Data Augmentation for Optimized Active Learning", "paper_summary": "Active Learning (AL) allows models to learn interactively from user feedback.\nThis paper introduces a counterfactual data augmentation approach to AL,\nparticularly addressing the selection of datapoints for user querying, a\npivotal concern in enhancing data efficiency. Our approach is inspired by\nVariation Theory, a theory of human concept learning that emphasizes the\nessential features of a concept by focusing on what stays the same and what\nchanges. Instead of just querying with existing datapoints, our approach\nsynthesizes artificial datapoints that highlight potential key similarities and\ndifferences among labels using a neuro-symbolic pipeline combining large\nlanguage models (LLMs) and rule-based models. Through an experiment in the\nexample domain of text classification, we show that our approach achieves\nsignificantly higher performance when there are fewer annotated data. As the\nannotated training data gets larger the impact of the generated data starts to\ndiminish showing its capability to address the cold start problem in AL. This\nresearch sheds light on integrating theories of human learning into the\noptimization of AL.", "paper_summary_zh": "主動學習 (AL) 允許模型從使用者回饋中互動式地學習。\n本文介紹一種反事實資料擴充方法到 AL，\n特別處理使用者查詢資料點的選擇，這是提升資料效率的關鍵問題。我們的做法受到變異理論的啟發，一種強調概念的本質特徵，著重於什麼保持不變和什麼改變的人類概念學習理論。我們的做法並非僅使用現有資料點查詢，而是使用結合大型語言模型 (LLM) 和基於規則模型的神經符號管線，合成人工資料點，以突顯標籤之間的潛在關鍵相似性和差異。透過在文字分類範例領域中的實驗，我們顯示我們的做法在註解資料較少時，可達到顯著更高的效能。隨著註解訓練資料變大，生成資料的影響開始減弱，顯示其解決 AL 中冷啟動問題的能力。這項研究說明了將人類學習理論整合到 AL 最佳化中的方法。", "author": "Simret Araya Gebreegziabher et.al.", "authors": "Simret Araya Gebreegziabher, Kuangshi Ai, Zheng Zhang, Elena L. Glassman, Toby Jia-Jun Li", "id": "2408.03819v1", "paper_url": "http://arxiv.org/abs/2408.03819v1", "repo": "null"}}