{"2405.04453": {"publish_time": "2024-05-07", "title": "Towards Continual Knowledge Graph Embedding via Incremental Distillation", "paper_summary": "Traditional knowledge graph embedding (KGE) methods typically require\npreserving the entire knowledge graph (KG) with significant training costs when\nnew knowledge emerges. To address this issue, the continual knowledge graph\nembedding (CKGE) task has been proposed to train the KGE model by learning\nemerging knowledge efficiently while simultaneously preserving decent old\nknowledge. However, the explicit graph structure in KGs, which is critical for\nthe above goal, has been heavily ignored by existing CKGE methods. On the one\nhand, existing methods usually learn new triples in a random order, destroying\nthe inner structure of new KGs. On the other hand, old triples are preserved\nwith equal priority, failing to alleviate catastrophic forgetting effectively.\nIn this paper, we propose a competitive method for CKGE based on incremental\ndistillation (IncDE), which considers the full use of the explicit graph\nstructure in KGs. First, to optimize the learning order, we introduce a\nhierarchical strategy, ranking new triples for layer-by-layer learning. By\nemploying the inter- and intra-hierarchical orders together, new triples are\ngrouped into layers based on the graph structure features. Secondly, to\npreserve the old knowledge effectively, we devise a novel incremental\ndistillation mechanism, which facilitates the seamless transfer of entity\nrepresentations from the previous layer to the next one, promoting old\nknowledge preservation. Finally, we adopt a two-stage training paradigm to\navoid the over-corruption of old knowledge influenced by under-trained new\nknowledge. Experimental results demonstrate the superiority of IncDE over\nstate-of-the-art baselines. Notably, the incremental distillation mechanism\ncontributes to improvements of 0.2%-6.5% in the mean reciprocal rank (MRR)\nscore.", "paper_summary_zh": "<paragraph>傳統知識圖表嵌入 (KGE) 方法通常需要在出現新知識時保留整個知識圖表 (KG)，這會產生大量的訓練成本。為了解決這個問題，已經提出持續知識圖表嵌入 (CKGE) 任務，透過有效率地學習新興知識並同時保留良好的舊知識，來訓練 KGE 模型。然而，現有的 CKGE 方法嚴重忽略了 KG 中對上述目標至關重要的明確圖表結構。一方面，現有方法通常以隨機順序學習新的三元組，破壞了新 KG 的內部結構。另一方面，舊的三元組以同等的優先順序被保留，無法有效減輕災難性遺忘。在本文中，我們提出了一個基於增量蒸餾 (IncDE) 的 CKGE 競爭方法，它考慮了 KG 中明確圖表結構的充分利用。首先，為了優化學習順序，我們引入了一種分層策略，對新的三元組進行分層學習的排序。透過同時使用層間和層內順序，新的三元組會根據圖表結構特徵分組到不同的層中。其次，為了有效保留舊知識，我們設計了一種新的增量蒸餾機制，它促進了實體表示從前一層到下一層的無縫傳遞，促進了舊知識的保留。最後，我們採用兩階段訓練範例，以避免受訓練不足的新知識影響而導致舊知識過度損壞。實驗結果證明了 IncDE 優於最先進的基準。值得注意的是，增量蒸餾機制有助於平均倒數排名 (MRR) 分數提高 0.2%-6.5%。</paragraph>", "author": "Jiajun Liu et.al.", "authors": "Jiajun Liu, Wenjun Ke, Peng Wang, Ziyu Shang, Jinhua Gao, Guozheng Li, Ke Ji, Yanhe Liu", "id": "2405.04453v1", "paper_url": "http://arxiv.org/abs/2405.04453v1", "repo": "https://github.com/seukgcode/incde"}}