{"2412.08108": {"publish_time": "2024-12-11", "title": "Doubly-Universal Adversarial Perturbations: Deceiving Vision-Language Models Across Both Images and Text with a Single Perturbation", "paper_summary": "Large Vision-Language Models (VLMs) have demonstrated remarkable performance\nacross multimodal tasks by integrating vision encoders with large language\nmodels (LLMs). However, these models remain vulnerable to adversarial attacks.\nAmong such attacks, Universal Adversarial Perturbations (UAPs) are especially\npowerful, as a single optimized perturbation can mislead the model across\nvarious input images. In this work, we introduce a novel UAP specifically\ndesigned for VLMs: the Doubly-Universal Adversarial Perturbation (Doubly-UAP),\ncapable of universally deceiving VLMs across both image and text inputs. To\nsuccessfully disrupt the vision encoder's fundamental process, we analyze the\ncore components of the attention mechanism. After identifying value vectors in\nthe middle-to-late layers as the most vulnerable, we optimize Doubly-UAP in a\nlabel-free manner with a frozen model. Despite being developed as a black-box\nto the LLM, Doubly-UAP achieves high attack success rates on VLMs, consistently\noutperforming baseline methods across vision-language tasks. Extensive ablation\nstudies and analyses further demonstrate the robustness of Doubly-UAP and\nprovide insights into how it influences internal attention mechanisms.", "paper_summary_zh": "大型視覺語言模型 (VLM) 透過整合視覺編碼器與大型語言模型 (LLM)，在多模態任務中展現出卓越的效能。然而，這些模型仍然容易受到對抗性攻擊。在這些攻擊中，通用對抗擾動 (UAP) 特別強大，因為單一最佳化的擾動可以誤導模型跨越各種輸入影像。在這項工作中，我們引入一種專門為 VLM 設計的新型 UAP：雙重通用對抗擾動 (Doubly-UAP)，它能夠普遍欺騙跨越影像和文字輸入的 VLM。為了成功破壞視覺編碼器的基本過程，我們分析了注意力機制的核心組成部分。在將中間到後面的層中的值向量識別為最脆弱的層後，我們使用凍結模型以無標籤的方式最佳化 Doubly-UAP。儘管是作為 LLM 的黑盒子開發，Doubly-UAP 在 VLM 上實現了很高的攻擊成功率，在視覺語言任務中始終優於基線方法。廣泛的消融研究和分析進一步證明了 Doubly-UAP 的穩健性，並提供了它如何影響內部注意力機制的見解。", "author": "Hee-Seon Kim et.al.", "authors": "Hee-Seon Kim, Minbeom Kim, Changick Kim", "id": "2412.08108v1", "paper_url": "http://arxiv.org/abs/2412.08108v1", "repo": "null"}}