{"2410.12318": {"publish_time": "2024-10-16", "title": "UTF:Undertrained Tokens as Fingerprints A Novel Approach to LLM Identification", "paper_summary": "Fingerprinting large language models (LLMs) is essential for verifying model\nownership, ensuring authenticity, and preventing misuse. Traditional\nfingerprinting methods often require significant computational overhead or\nwhite-box verification access. In this paper, we introduce UTF, a novel and\nefficient approach to fingerprinting LLMs by leveraging under-trained tokens.\nUnder-trained tokens are tokens that the model has not fully learned during its\ntraining phase. By utilizing these tokens, we perform supervised fine-tuning to\nembed specific input-output pairs into the model. This process allows the LLM\nto produce predetermined outputs when presented with certain inputs,\neffectively embedding a unique fingerprint. Our method has minimal overhead and\nimpact on model's performance, and does not require white-box access to target\nmodel's ownership identification. Compared to existing fingerprinting methods,\nUTF is also more effective and robust to fine-tuning and random guess.", "paper_summary_zh": "大型語言模型 (LLM) 指紋辨識對於驗證模型所有權、確保真實性及防止濫用至關重要。傳統指紋辨識方法通常需要大量的運算負擔或白盒驗證存取權。在本文中，我們介紹 UTF，一種新穎且有效率的方法，透過利用未充分訓練的符號來辨識 LLM 指紋。未充分訓練的符號是模型在其訓練階段中尚未完全學會的符號。透過利用這些符號，我們執行監督微調，將特定輸入輸出對嵌入到模型中。此程序允許 LLM 在呈現特定輸入時產生預先決定的輸出，有效地嵌入唯一的指紋。我們的技術對模型效能的負擔和影響很小，且不需要白盒存取權就能辨識目標模型的所有權。與現有的指紋辨識方法相比，UTF 對微調和隨機猜測也更有效且更強健。", "author": "Jiacheng Cai et.al.", "authors": "Jiacheng Cai, Jiahao Yu, Yangguang Shao, Yuhang Wu, Xinyu Xing", "id": "2410.12318v1", "paper_url": "http://arxiv.org/abs/2410.12318v1", "repo": "null"}}