{"2408.15664": {"publish_time": "2024-08-28", "title": "Auxiliary-Loss-Free Load Balancing Strategy for Mixture-of-Experts", "paper_summary": "For Mixture-of-Experts (MoE) models, an unbalanced expert load will lead to\nrouting collapse or increased computational overhead. Existing methods commonly\nemploy an auxiliary loss to encourage load balance, but a large auxiliary loss\nwill introduce non-negligible interference gradients into training and thus\nimpair the model performance. In order to control load balance while not\nproducing undesired gradients during training, we propose Loss-Free Balancing,\nfeatured by an auxiliary-loss-free load balancing strategy. To be specific,\nbefore the top-K routing decision, Loss-Free Balancing will first apply an\nexpert-wise bias to the routing scores of each expert. By dynamically updating\nthe bias of each expert according to its recent load, Loss-Free Balancing can\nconsistently maintain a balanced distribution of expert load. In addition,\nsince Loss-Free Balancing does not produce any interference gradients, it also\nelevates the upper bound of model performance gained from MoE training. We\nvalidate the performance of Loss-Free Balancing on MoE models with up to 3B\nparameters trained on up to 200B tokens. Experimental results show that\nLoss-Free Balancing achieves both better performance and better load balance\ncompared with traditional auxiliary-loss-controlled load balancing strategies.", "paper_summary_zh": "對於 Mixture-of-Experts (MoE) 模型，不平衡的專家負載將導致路由崩潰或增加計算開銷。現有方法通常採用輔助損失來鼓勵負載平衡，但大的輔助損失會在訓練中引入不可忽略的干擾梯度，從而損害模型效能。為了在訓練期間控制負載平衡，同時不產生不必要的梯度，我們提出無損失平衡，其特點是無輔助損失負載平衡策略。具體來說，在頂部 K 路由決策之前，無損失平衡將首先對每個專家的路由分數應用專家偏差。透過根據每個專家的最新負載動態更新偏差，無損失平衡可以持續維持專家負載的平衡分佈。此外，由於無損失平衡不會產生任何干擾梯度，因此它也提升了從 MoE 訓練中獲得的模型效能的上限。我們在訓練多達 200B 個代幣的多達 3B 個參數的 MoE 模型上驗證了無損失平衡的效能。實驗結果表明，與傳統的輔助損失控制負載平衡策略相比，無損失平衡實現了更好的效能和負載平衡。", "author": "Lean Wang et.al.", "authors": "Lean Wang, Huazuo Gao, Chenggang Zhao, Xu Sun, Damai Dai", "id": "2408.15664v1", "paper_url": "http://arxiv.org/abs/2408.15664v1", "repo": "null"}}