{"2409.12042": {"publish_time": "2024-09-18", "title": "ASR Benchmarking: Need for a More Representative Conversational Dataset", "paper_summary": "Automatic Speech Recognition (ASR) systems have achieved remarkable\nperformance on widely used benchmarks such as LibriSpeech and Fleurs. However,\nthese benchmarks do not adequately reflect the complexities of real-world\nconversational environments, where speech is often unstructured and contains\ndisfluencies such as pauses, interruptions, and diverse accents. In this study,\nwe introduce a multilingual conversational dataset, derived from TalkBank,\nconsisting of unstructured phone conversation between adults. Our results show\na significant performance drop across various state-of-the-art ASR models when\ntested in conversational settings. Furthermore, we observe a correlation\nbetween Word Error Rate and the presence of speech disfluencies, highlighting\nthe critical need for more realistic, conversational ASR benchmarks.", "paper_summary_zh": "自動語音辨識 (ASR) 系統在 LibriSpeech 和 Fleurs 等廣泛使用的基準上已達到顯著的效能表現。然而，這些基準並未充分反映現實世界對話環境的複雜性，在這些環境中，語音通常是不結構化的，並包含停頓、中斷和各種口音等不流暢現象。在本研究中，我們引進一個多語言對話資料集，其源自 TalkBank，包含成人之間非結構化的電話對話。我們的結果顯示，在對話式設定中進行測試時，各種最先進的 ASR 模型的效能表現大幅下降。此外，我們觀察到詞彙錯誤率與語音不流暢現象之間存在相關性，這突顯了對更真實、更對話式的 ASR 基準的迫切需求。", "author": "Gaurav Maheshwari et.al.", "authors": "Gaurav Maheshwari, Dmitry Ivanov, Théo Johannet, Kevin El Haddad", "id": "2409.12042v1", "paper_url": "http://arxiv.org/abs/2409.12042v1", "repo": "null"}}