{"2410.09043": {"publish_time": "2024-10-11", "title": "Transforming In-Vehicle Network Intrusion Detection: VAE-based Knowledge Distillation Meets Explainable AI", "paper_summary": "In the evolving landscape of autonomous vehicles, ensuring robust in-vehicle\nnetwork (IVN) security is paramount. This paper introduces an advanced\nintrusion detection system (IDS) called KD-XVAE that uses a Variational\nAutoencoder (VAE)-based knowledge distillation approach to enhance both\nperformance and efficiency. Our model significantly reduces complexity,\noperating with just 1669 parameters and achieving an inference time of 0.3 ms\nper batch, making it highly suitable for resource-constrained automotive\nenvironments. Evaluations in the HCRL Car-Hacking dataset demonstrate\nexceptional capabilities, attaining perfect scores (Recall, Precision, F1 Score\nof 100%, and FNR of 0%) under multiple attack types, including DoS, Fuzzing,\nGear Spoofing, and RPM Spoofing. Comparative analysis on the CICIoV2024 dataset\nfurther underscores its superiority over traditional machine learning models,\nachieving perfect detection metrics. We furthermore integrate Explainable AI\n(XAI) techniques to ensure transparency in the model's decisions. The VAE\ncompresses the original feature space into a latent space, on which the\ndistilled model is trained. SHAP(SHapley Additive exPlanations) values provide\ninsights into the importance of each latent dimension, mapped back to original\nfeatures for intuitive understanding. Our paper advances the field by\nintegrating state-of-the-art techniques, addressing critical challenges in the\ndeployment of efficient, trustworthy, and reliable IDSes for autonomous\nvehicles, ensuring enhanced protection against emerging cyber threats.", "paper_summary_zh": "在自動駕駛車不斷演進的領域中，確保車載網路 (IVN) 安全至關重要。本文介紹了一種名為 KD-XVAE 的進階入侵偵測系統 (IDS)，它使用基於變異自動編碼器 (VAE) 的知識蒸餾方法，同時提升效能和效率。我們的模型大幅降低複雜度，僅使用 1669 個參數運作，並在每次批次中達到 0.3 毫秒的推論時間，使其非常適合資源受限的汽車環境。在 HCRL Car-Hacking 資料集中的評估證明了其卓越的能力，在包括 DoS、模糊測試、齒輪欺騙和 RPM 欺騙在內的各種攻擊類型下，都獲得了完美的評分（召回率、準確率、F1 分數為 100%，FNR 為 0%）。在 CICIoV2024 資料集上的比較分析進一步強調了它優於傳統機器學習模型，並達到了完美的偵測指標。此外，我們整合了可解釋 AI (XAI) 技術，以確保模型決策的透明度。VAE 將原始特徵空間壓縮成潛在空間，蒸餾模型在此空間上進行訓練。SHAP（SHapley 加法解釋）值提供了對每個潛在維度重要性的見解，並映射回原始特徵以進行直觀理解。我們的論文透過整合最先進的技術，來解決在部署高效、可信賴且可靠的自動駕駛車 IDS 時遇到的關鍵挑戰，進而確保對新興網路威脅的加強防護。", "author": "Muhammet Anil Yagiz et.al.", "authors": "Muhammet Anil Yagiz, Pedram MohajerAnsari, Mert D. Pese, Polat Goktas", "id": "2410.09043v1", "paper_url": "http://arxiv.org/abs/2410.09043v1", "repo": "null"}}