{"2407.18367": {"publish_time": "2024-07-25", "title": "Robust Claim Verification Through Fact Detection", "paper_summary": "Claim verification can be a challenging task. In this paper, we present a\nmethod to enhance the robustness and reasoning capabilities of automated claim\nverification through the extraction of short facts from evidence. Our novel\napproach, FactDetect, leverages Large Language Models (LLMs) to generate\nconcise factual statements from evidence and label these facts based on their\nsemantic relevance to the claim and evidence. The generated facts are then\ncombined with the claim and evidence. To train a lightweight supervised model,\nwe incorporate a fact-detection task into the claim verification process as a\nmultitasking approach to improve both performance and explainability. We also\nshow that augmenting FactDetect in the claim verification prompt enhances\nperformance in zero-shot claim verification using LLMs. Our method demonstrates\ncompetitive results in the supervised claim verification model by 15% on the F1\nscore when evaluated for challenging scientific claim verification datasets. We\nalso demonstrate that FactDetect can be augmented with claim and evidence for\nzero-shot prompting (AugFactDetect) in LLMs for verdict prediction. We show\nthat AugFactDetect outperforms the baseline with statistical significance on\nthree challenging scientific claim verification datasets with an average of\n17.3% performance gain compared to the best performing baselines.", "paper_summary_zh": "聲明驗證可能是一項具有挑戰性的任務。在本文中，我們提出了一種透過從證據中萃取簡短事實來增強自動化聲明驗證的穩健性和推理能力的方法。我們創新的方法 FactDetect 利用大型語言模型 (LLM) 從證據中產生簡潔的事實陳述，並根據這些事實與聲明和證據的語義相關性標記這些事實。然後將產生的事實與聲明和證據結合。為了訓練一個輕量化的監督模型，我們將事實偵測任務融入聲明驗證過程中，作為一種多任務方法來提升效能和可解釋性。我們也顯示在聲明驗證提示中擴充 FactDetect 可透過 LLM 增強零次學習聲明驗證的效能。我們的這項方法在有監督的聲明驗證模型中展現出競爭力的結果，在針對具有挑戰性的科學聲明驗證資料集進行評估時，F1 分數提升了 15%。我們也展示 FactDetect 可以擴充聲明和證據，以在 LLM 中進行零次學習提示（AugFactDetect），用於判決預測。我們顯示 AugFactDetect 在三個具有挑戰性的科學聲明驗證資料集上以統計顯著性優於基準，與效能表現最佳的基準相比，平均效能提升 17.3%。", "author": "Nazanin Jafari et.al.", "authors": "Nazanin Jafari, James Allan", "id": "2407.18367v1", "paper_url": "http://arxiv.org/abs/2407.18367v1", "repo": "null"}}