{"2411.18212": {"publish_time": "2024-11-27", "title": "SCoTT: Wireless-Aware Path Planning with Vision Language Models and Strategic Chains-of-Thought", "paper_summary": "Path planning is a complex problem for many practical applications,\nparticularly in robotics. Existing algorithms, however, are exhaustive in\nnature and become increasingly complex when additional side constraints are\nincorporated alongside distance minimization. In this paper, a novel approach\nusing vision language models (VLMs) is proposed for enabling path planning in\ncomplex wireless-aware environments. To this end, insights from a digital twin\n(DT) with real-world wireless ray tracing data are explored in order to\nguarantee an average path gain threshold while minimizing the trajectory\nlength. First, traditional approaches such as A* are compared to several\nwireless-aware extensions, and an optimal iterative dynamic programming\napproach (DP-WA*) is derived, which fully takes into account all path gains and\ndistance metrics within the DT. On the basis of these baselines, the role of\nVLMs as an alternative assistant for path planning is investigated, and a\nstrategic chain-of-thought tasking (SCoTT) approach is proposed. SCoTT divides\nthe complex planning task into several subproblems and solves each with\nadvanced CoT prompting. Results show that SCoTT achieves very close average\npath gains compared to DP-WA* while at the same time yielding consistently\nshorter path lengths. The results also show that VLMs can be used to accelerate\nDP-WA* by efficiently reducing the algorithm's search space and thus saving up\nto 62\\% in execution time. This work underscores the potential of VLMs in\nfuture digital systems as capable assistants for solving complex tasks, while\nenhancing user interaction and accelerating rapid prototyping under diverse\nwireless constraints.", "paper_summary_zh": "路徑規劃對許多實務應用而言是一項複雜的問題，特別是在機器人技術中。然而，現有的演算法本質上是窮舉的，並且在距離最小化時加入額外的邊界限制時會變得越來越複雜。在本文中，提出了一種使用視覺語言模型 (VLM) 的新方法，用於在複雜的無線感知環境中進行路徑規劃。為此，探索了具有真實世界無線射線追蹤資料的數位雙胞胎 (DT) 的見解，以在最小化軌跡長度的同時保證平均路徑增益閾值。首先，將傳統方法（例如 A*）與多種無線感知延伸功能進行比較，並推導出最佳的迭代動態規劃方法 (DP-WA*)，該方法充分考慮了 DT 中的所有路徑增益和距離度量。在這些基準的基礎上，研究了 VLM 作為路徑規劃的替代輔助工具的角色，並提出了一種策略性的思考鏈任務 (SCoTT) 方法。SCoTT 將複雜的規劃任務分解為幾個子問題，並使用進階的 CoT 提示解決每個子問題。結果顯示，與 DP-WA* 相比，SCoTT 達到了非常接近的平均路徑增益，同時產生持續更短的路徑長度。結果還表明，VLM 可用於加速 DP-WA*，方法是有效地減少演算法的搜尋空間，從而將執行時間節省高達 62%。這項工作強調了 VLM 在未來數位系統中作為解決複雜任務的強大輔助工具的潛力，同時增強使用者互動並在不同的無線限制下加速快速原型製作。", "author": "Aladin Djuhera et.al.", "authors": "Aladin Djuhera, Vlad C. Andrei, Amin Seffo, Holger Boche, Walid Saad", "id": "2411.18212v1", "paper_url": "http://arxiv.org/abs/2411.18212v1", "repo": "null"}}