{"2406.11589": {"publish_time": "2024-06-17", "title": "CoSQA+: Enhancing Code Search Dataset with Matching Code", "paper_summary": "Semantic code search, retrieving code that matches a given natural language\nquery, is an important task to improve productivity in software engineering.\nExisting code search datasets are problematic: either using unrealistic\nqueries, or with mismatched codes, and typically using one-to-one query-code\npairing, which fails to reflect the reality that a query might have multiple\nvalid code matches. This paper introduces CoSQA+, pairing high-quality queries\n(reused from CoSQA) with multiple suitable codes. We collect code candidates\nfrom diverse sources and form candidate pairs by pairing queries with these\ncodes. Utilizing the power of large language models (LLMs), we automate pair\nannotation, filtering, and code generation for queries without suitable\nmatches. Through extensive experiments, CoSQA+ has demonstrated superior\nquality over CoSQA. Models trained on CoSQA+ exhibit improved performance.\nFurthermore, we propose a new metric Mean Multi-choice Reciprocal Rank (MMRR),\nto assess one-to-N code search performance. We provide the code and data at\nhttps://github.com/DeepSoftwareAnalytics/CoSQA_Plus.", "paper_summary_zh": "語意程式碼搜尋，擷取與給定的自然語言查詢相符的程式碼，是提升軟體工程生產力的重要任務。\n現有的程式碼搜尋資料集存在問題：不是使用不切實際的查詢，就是程式碼不匹配，而且通常使用一對一的查詢程式碼配對，無法反映查詢可能有多個有效程式碼配對的現實。本文介紹 CoSQA+，將高品質查詢（重新使用自 CoSQA）與多個合適的程式碼配對。我們從不同的來源收集程式碼候選項，並透過將查詢與這些程式碼配對來形成候選配對。利用大型語言模型 (LLM) 的功能，我們自動執行配對註解、篩選，以及為沒有合適配對的查詢產生程式碼。透過廣泛的實驗，CoSQA+ 已證明其品質優於 CoSQA。在 CoSQA+ 上訓練的模型表現出更好的效能。此外，我們提出一個新的指標平均多選倒數排名 (MMRR)，用於評估一對多程式碼搜尋效能。我們在 https://github.com/DeepSoftwareAnalytics/CoSQA_Plus 提供程式碼和資料。", "author": "Jing Gong et.al.", "authors": "Jing Gong, Yanghui Wu, Linxi Liang, Zibin Zheng, Yanlin Wang", "id": "2406.11589v1", "paper_url": "http://arxiv.org/abs/2406.11589v1", "repo": "https://github.com/DeepSoftwareAnalytics/CoSQA_Plus"}}