{"2405.04829": {"publish_time": "2024-05-08", "title": "Fine-tuning Pre-trained Named Entity Recognition Models For Indian Languages", "paper_summary": "Named Entity Recognition (NER) is a useful component in Natural Language\nProcessing (NLP) applications. It is used in various tasks such as Machine\nTranslation, Summarization, Information Retrieval, and Question-Answering\nsystems. The research on NER is centered around English and some other major\nlanguages, whereas limited attention has been given to Indian languages. We\nanalyze the challenges and propose techniques that can be tailored for\nMultilingual Named Entity Recognition for Indian Languages. We present a human\nannotated named entity corpora of 40K sentences for 4 Indian languages from two\nof the major Indian language families. Additionally,we present a multilingual\nmodel fine-tuned on our dataset, which achieves an F1 score of 0.80 on our\ndataset on average. We achieve comparable performance on completely unseen\nbenchmark datasets for Indian languages which affirms the usability of our\nmodel.", "paper_summary_zh": "命名實體識別 (NER) 是自然語言處理 (NLP) 應用中一個有用的組成部分。它用於各種任務，例如機器翻譯、摘要、資訊檢索和問答系統。NER 的研究主要集中在英語和其他一些主要語言上，而對印度語言的關注則較少。我們分析挑戰並提出可以針對印度語言的多語言命名實體識別量身打造的技術。我們提供了一個由人類標註的命名實體語料庫，其中包含來自兩個主要印度語言家族的 4 種印度語言的 40K 個句子。此外，我們還提供了一個針對我們的資料集進行微調的多語言模型，它在我們的資料集上的平均 F1 分數為 0.80。我們在印度語言的完全未見基準資料集上達到了相當的效能，這肯定了我們模型的可用性。", "author": "Sankalp Bahad et.al.", "authors": "Sankalp Bahad, Pruthwik Mishra, Karunesh Arora, Rakesh Chandra Balabantaray, Dipti Misra Sharma, Parameswari Krishnamurthy", "id": "2405.04829v1", "paper_url": "http://arxiv.org/abs/2405.04829v1", "repo": "null"}}