{"2404.18975": {"publish_time": "2024-04-29", "title": "M3H: Multimodal Multitask Machine Learning for Healthcare", "paper_summary": "Recent breakthroughs in AI are poised to fundamentally enhance our study and\nunderstanding of healthcare. The development of an integrated many-to-many\nframework that leverages multiple data modality inputs for the analytical\nmodeling of multiple medical tasks, is critical for a unified understanding of\nmodern medicine. In this work, we introduce M3H, an explainable Multimodal\nMultitask Machine Learning for Healthcare framework that consolidates learning\nfrom diverse multimodal inputs across a broad spectrum of medical task\ncategories and machine learning problem classes. The modular design of the\nframework ensures its generalizable data processing, task definition, and rapid\nmodel prototyping, applicable to both clinical and operational healthcare\nsettings. We evaluate the M3H framework by validating models trained from four\nmodalities (tabular, time-series, language, and vision) on 41 medical tasks\nacross 4 machine learning problem classes. Our results demonstrate that M3H\nconsistently produces multitask models that outperform canonical single-task\nmodels (by 1.1- 37.2%) across 37 disease diagnoses from 16 medical departments,\nthree hospital operation forecasts, and one patient phenotyping task: spanning\nML problem classes of supervised binary classification, multiclass\nclassification, regression, and clustering. Additionally, the framework\nintroduces a novel attention mechanism to balance self-exploitation (focus on\nlearning source task), and cross-exploration (encourage learning from other\ntasks). Furthermore, M3H provides explainability insights on how joint learning\nof additional tasks impacts the learning of source task using a proposed TIM\nscore, shedding light into the dynamics of task interdependencies. Its\nadaptable architecture facilitates the customization and integration,\nestablishing it as a robust and scalable candidate solution for future\nAI-driven healthcare systems.", "paper_summary_zh": "", "author": "Dimitris Bertsimas et.al.", "authors": "Dimitris Bertsimas,Yu Ma", "id": "2404.18975v1", "paper_url": "http://arxiv.org/abs/2404.18975v1", "repo": "null"}}