{"2404.18975": {"publish_time": "2024-04-29", "title": "M3H: Multimodal Multitask Machine Learning for Healthcare", "paper_summary": "Developing an integrated many-to-many framework leveraging multimodal data\nfor multiple tasks is crucial to unifying healthcare applications ranging from\ndiagnoses to operations. In resource-constrained hospital environments, a\nscalable and unified machine learning framework that improves previous forecast\nperformances could improve hospital operations and save costs. We introduce\nM3H, an explainable Multimodal Multitask Machine Learning for Healthcare\nframework that consolidates learning from tabular, time-series, language, and\nvision data for supervised binary/multiclass classification, regression, and\nunsupervised clustering. It features a novel attention mechanism balancing\nself-exploitation (learning source-task), and cross-exploration (learning\ncross-tasks), and offers explainability through a proposed TIM score, shedding\nlight on the dynamics of task learning interdependencies. M3H encompasses an\nunprecedented range of medical tasks and machine learning problem classes and\nconsistently outperforms traditional single-task models by on average 11.6%\nacross 40 disease diagnoses from 16 medical departments, three hospital\noperation forecasts, and one patient phenotyping task. The modular design of\nthe framework ensures its generalizability in data processing, task definition,\nand rapid model prototyping, making it production ready for both clinical and\noperational healthcare settings, especially those in constrained environments.", "paper_summary_zh": "<paragraph>開發一個整合式多對多架構，利用多模態數據來執行多項任務，對於統一醫療保健應用程式（從診斷到手術）至關重要。在資源受限的醫院環境中，一個可擴充且統一的機器學習架構，可以改善先前的預測效能，進而改善醫院營運並節省成本。我們推出 M3H，一個可解釋的多模態多任務機器學習醫療保健架構，它整合了表格、時間序列、語言和影像數據的學習，用於監督式二元/多類別分類、回歸和非監督式聚類。它的特色在於一種新的注意力機制，平衡自我開發（學習來源任務）和跨探索（學習跨任務），並透過提議的 TIM 分數提供可解釋性，說明任務學習相互依賴的動態。M3H 涵蓋了前所未有的醫療任務和機器學習問題類別，並且在 16 個醫療科別的 40 種疾病診斷、三個醫院營運預測和一個患者表型任務中，平均優於傳統的單一任務模型 11.6%。這個架構的模組化設計確保了它在資料處理、任務定義和快速模型原型製作中的通用性，使其適用於臨床和營運醫療保健環境的生產，特別是在受限環境中。</paragraph>", "author": "Dimitris Bertsimas et.al.", "authors": "Dimitris Bertsimas, Yu Ma", "id": "2404.18975v3", "paper_url": "http://arxiv.org/abs/2404.18975v3", "repo": "null"}}