{"2404.18975": {"publish_time": "2024-04-29", "title": "M3H: Multimodal Multitask Machine Learning for Healthcare", "paper_summary": "Artificial intelligence holds promise to fundamentally enhance healthcare.\nDeveloping an integrated many-to-many framework leveraging multimodal data for\nmultiple tasks is essential to unifying modern medicine. We introduce M3H, an\nexplainable Multimodal Multitask Machine Learning for Healthcare framework that\nconsolidates learning from tabular, time-series, language, and vision data for\nsupervised binary/multiclass classification, regression, and unsupervised\nclustering. M3H encompasses an unprecedented range of medical tasks and problem\ndomains and consistently outperforms traditional single-task models by on\naverage 11.6% across 40 disease diagnoses from 16 medical departments, three\nhospital operation forecasts, and one patient phenotyping task. It features a\nnovel attention mechanism balancing self-exploitation (learning source-task),\nand cross-exploration (learning cross-tasks), and offers explainability through\na proposed TIM score, shedding light on the dynamics of task learning\ninterdependencies. Its adaptable architecture supports easy customization and\nintegration of new data modalities and tasks, establishing it as a robust,\nscalable solution for advancing AI-driven healthcare systems.", "paper_summary_zh": "人工智慧有望從根本上提升醫療保健。\n開發一個整合式多對多架構，利用多模態資料進行多重任務，對於統一現代醫學至關重要。我們介紹 M3H，一個可解釋的多模態多任務機器學習醫療保健架構，它整合了表格、時間序列、語言和視覺資料的學習，用於監督式二元/多類別分類、回歸和非監督式聚類。M3H 涵蓋了前所未有的醫療任務和問題領域範圍，並且在 16 個醫療部門的 40 種疾病診斷、三個醫院運營預測和一個患者表型任務中，平均比傳統的單一任務模型高出 11.6%。它的特點是新穎的注意力機制，平衡了自我開發（學習來源任務）和跨探索（學習跨任務），並通過提議的 TIM 分數提供可解釋性，闡明了任務學習相互依賴的動態。其適應性架構支援輕鬆自訂和整合新的資料模式和任務，使其成為推動 AI 驅動醫療保健系統的強大、可擴充的解決方案。", "author": "Dimitris Bertsimas et.al.", "authors": "Dimitris Bertsimas, Yu Ma", "id": "2404.18975v2", "paper_url": "http://arxiv.org/abs/2404.18975v2", "repo": "null"}}