{"2408.02237": {"publish_time": "2024-08-05", "title": "Do Large Language Models Speak All Languages Equally? A Comparative Study in Low-Resource Settings", "paper_summary": "Large language models (LLMs) have garnered significant interest in natural\nlanguage processing (NLP), particularly their remarkable performance in various\ndownstream tasks in resource-rich languages. Recent studies have highlighted\nthe limitations of LLMs in low-resource languages, primarily focusing on binary\nclassification tasks and giving minimal attention to South Asian languages.\nThese limitations are primarily attributed to constraints such as dataset\nscarcity, computational costs, and research gaps specific to low-resource\nlanguages. To address this gap, we present datasets for sentiment and hate\nspeech tasks by translating from English to Bangla, Hindi, and Urdu,\nfacilitating research in low-resource language processing. Further, we\ncomprehensively examine zero-shot learning using multiple LLMs in English and\nwidely spoken South Asian languages. Our findings indicate that GPT-4\nconsistently outperforms Llama 2 and Gemini, with English consistently\ndemonstrating superior performance across diverse tasks compared to\nlow-resource languages. Furthermore, our analysis reveals that natural language\ninference (NLI) exhibits the highest performance among the evaluated tasks,\nwith GPT-4 demonstrating superior capabilities.", "paper_summary_zh": "大型語言模型 (LLM) 在自然語言處理 (NLP) 中引起了極大的興趣，特別是它們在資源豐富的語言中執行各種下游任務的出色表現。最近的研究強調了 LLM 在低資源語言中的局限性，主要關注二元分類任務，並對南亞語言的關注最少。這些限制主要歸因於諸如數據集稀缺、計算成本和特定於低資源語言的研究差距等約束。為了解決這個差距，我們通過將英語翻譯成孟加拉語、印地語和烏爾都語來提供情緒和仇恨言論任務的數據集，促進低資源語言處理的研究。此外，我們全面檢查了使用多個 LLM 在英語和廣泛使用的南亞語言中進行零次學習。我們的研究結果表明，GPT-4 持續優於 Llama 2 和 Gemini，與低資源語言相比，英語在各種任務中持續表現出優異的表現。此外，我們的分析表明，自然語言推理 (NLI) 在評估任務中表現最佳，而 GPT-4 則表現出卓越的能力。", "author": "Md. Arid Hasan et.al.", "authors": "Md. Arid Hasan, Prerona Tarannum, Krishno Dey, Imran Razzak, Usman Naseem", "id": "2408.02237v1", "paper_url": "http://arxiv.org/abs/2408.02237v1", "repo": "null"}}