{"2503.19455": {"publish_time": "2025-03-25", "title": "Data-centric Federated Graph Learning with Large Language Models", "paper_summary": "In federated graph learning (FGL), a complete graph is divided into multiple\nsubgraphs stored in each client due to privacy concerns, and all clients\njointly train a global graph model by only transmitting model parameters. A\npain point of FGL is the heterogeneity problem, where nodes or structures\npresent non-IID properties among clients (e.g., different node label\ndistributions), dramatically undermining the convergence and performance of\nFGL. To address this, existing efforts focus on design strategies at the model\nlevel, i.e., they design models to extract common knowledge to mitigate\nheterogeneity. However, these model-level strategies fail to fundamentally\naddress the heterogeneity problem as the model needs to be designed from\nscratch when transferring to other tasks. Motivated by large language models\n(LLMs) having achieved remarkable success, we aim to utilize LLMs to fully\nunderstand and augment local text-attributed graphs, to address data\nheterogeneity at the data level. In this paper, we propose a general framework\nLLM4FGL that innovatively decomposes the task of LLM for FGL into two sub-tasks\ntheoretically. Specifically, for each client, it first utilizes the LLM to\ngenerate missing neighbors and then infers connections between generated nodes\nand raw nodes. To improve the quality of generated nodes, we design a novel\nfederated generation-and-reflection mechanism for LLMs, without the need to\nmodify the parameters of the LLM but relying solely on the collective feedback\nfrom all clients. After neighbor generation, all the clients utilize a\npre-trained edge predictor to infer the missing edges. Furthermore, our\nframework can seamlessly integrate as a plug-in with existing FGL methods.\nExperiments on three real-world datasets demonstrate the superiority of our\nmethod compared to advanced baselines.", "paper_summary_zh": "<paragraph>在聯邦圖學習 (FGL) 中，由於隱私問題，一個完整的圖會被劃分為多個子圖，儲存在每個客戶端，所有客戶端僅透過傳輸模型參數來共同訓練一個全局圖模型。FGL 的一個痛點是異質性問題，即節點或結構在客戶端之間呈現非獨立同分布 (non-IID) 屬性（例如，不同的節點標籤分布），這會顯著降低 FGL 的收斂性和性能。為了應對此問題，現有的工作主要集中在模型層面的設計策略，即設計模型來提取共同知識以減輕異質性。然而，這些模型層面的策略未能從根本上解決異質性問題，因為在轉移到其他任務時，需要從頭開始設計模型。受大型語言模型 (LLM) 取得顯著成功的啟發，我們的目標是利用 LLM 來充分理解和增強本地文本屬性圖，以在數據層面解決數據異質性。在本文中，我們提出了一個通用框架 LLM4FGL，它在理論上創新地將 LLM 應用於 FGL 的任務分解為兩個子任務。具體來說，對於每個客戶端，它首先利用 LLM 生成缺失的鄰居，然後推斷生成的節點與原始節點之間的連接。為了提高生成節點的質量，我們為 LLM 設計了一種新穎的聯邦生成和反思機制，無需修改 LLM 的參數，而僅依靠所有客戶端的集體回饋。在鄰居生成之後，所有客戶端都使用預先訓練的邊緣預測器來推斷缺失的邊緣。此外，我們的框架可以作為插件與現有的 FGL 方法無縫集成。在三個真實世界數據集上的實驗證明了我們的方法相較於先進基線的優越性。</paragraph>\n", "author": "Bo Yan et.al.", "authors": "Bo Yan, Zhongjian Zhang, Huabin Sun, Mengmei Zhang, Yang Cao, Chuan Shi", "id": "2503.19455v1", "paper_url": "http://arxiv.org/abs/2503.19455v1", "repo": "null"}}