{"2408.02899": {"publish_time": "2024-08-06", "title": "SETN: Stock Embedding Enhanced with Textual and Network Information", "paper_summary": "Stock embedding is a method for vector representation of stocks. There is a\ngrowing demand for vector representations of stock, i.e., stock embedding, in\nwealth management sectors, and the method has been applied to various tasks\nsuch as stock price prediction, portfolio optimization, and similar fund\nidentifications. Stock embeddings have the advantage of enabling the\nquantification of relative relationships between stocks, and they can extract\nuseful information from unstructured data such as text and network data. In\nthis study, we propose stock embedding enhanced with textual and network\ninformation (SETN) using a domain-adaptive pre-trained transformer-based model\nto embed textual information and a graph neural network model to grasp network\ninformation. We evaluate the performance of our proposed model on related\ncompany information extraction tasks. We also demonstrate that stock embeddings\nobtained from the proposed model perform better in creating thematic funds than\nthose obtained from baseline methods, providing a promising pathway for various\napplications in the wealth management industry.", "paper_summary_zh": "股票嵌入是一種股票向量表示方法。在財富管理部門中，對股票向量表示（即股票嵌入）的需求日益增長，並且該方法已應用於各種任務，例如股票價格預測、投資組合最佳化和類似基金識別。股票嵌入的優點在於能夠量化股票之間的相對關係，並且它們可以從非結構化數據（例如文本和網路數據）中提取有用的資訊。在本研究中，我們提出使用領域自適應預訓練轉換器模型來嵌入文本資訊，並使用圖神經網路模型來掌握網路資訊，以增強文本和網路資訊的股票嵌入 (SETN)。我們在相關公司資訊萃取任務上評估我們所提出的模型的效能。我們也證明，從所提出的模型中取得的股票嵌入在建立主題基金時，表現優於從基線方法中取得的股票嵌入，為財富管理產業中的各種應用提供了有希望的途徑。", "author": "Takehiro Takayanagi et.al.", "authors": "Takehiro Takayanagi, Hiroki Sakaji, Kiyoshi Izumi", "id": "2408.02899v1", "paper_url": "http://arxiv.org/abs/2408.02899v1", "repo": "null"}}