{"2406.17523": {"publish_time": "2024-06-25", "title": "On the consistency of hyper-parameter selection in value-based deep reinforcement learning", "paper_summary": "Deep reinforcement learning (deep RL) has achieved tremendous success on\nvarious domains through a combination of algorithmic design and careful\nselection of hyper-parameters. Algorithmic improvements are often the result of\niterative enhancements built upon prior approaches, while hyper-parameter\nchoices are typically inherited from previous methods or fine-tuned\nspecifically for the proposed technique. Despite their crucial impact on\nperformance, hyper-parameter choices are frequently overshadowed by algorithmic\nadvancements. This paper conducts an extensive empirical study focusing on the\nreliability of hyper-parameter selection for value-based deep reinforcement\nlearning agents, including the introduction of a new score to quantify the\nconsistency and reliability of various hyper-parameters. Our findings not only\nhelp establish which hyper-parameters are most critical to tune, but also help\nclarify which tunings remain consistent across different training regimes.", "paper_summary_zh": "深度強化學習（深度 RL）透過演算法設計與仔細選擇超參數的結合，在各種領域取得巨大的成功。演算法的改進通常是建立在先前方法上的反覆增強的結果，而超參數的選擇通常承襲自先前的技術，或針對建議的技術進行微調。儘管超參數的選擇對效能有決定性的影響，但它經常被演算法的進步所掩蓋。本文進行一項廣泛的實證研究，重點在於基於價值的深度強化學習代理程式超參數選擇的可靠性，包括引入一個新的評分，用於量化各種超參數的一致性和可靠性。我們的發現不僅有助於確定哪些超參數最需要調整，還有助於釐清哪些調整在不同的訓練機制中保持一致。", "author": "Johan Obando-Ceron et.al.", "authors": "Johan Obando-Ceron, João G. M. Araújo, Aaron Courville, Pablo Samuel Castro", "id": "2406.17523v1", "paper_url": "http://arxiv.org/abs/2406.17523v1", "repo": "null"}}