{"2406.15859": {"publish_time": "2024-06-22", "title": "LLM-Powered Explanations: Unraveling Recommendations Through Subgraph Reasoning", "paper_summary": "Recommender systems are pivotal in enhancing user experiences across various\nweb applications by analyzing the complicated relationships between users and\nitems. Knowledge graphs(KGs) have been widely used to enhance the performance\nof recommender systems. However, KGs are known to be noisy and incomplete,\nwhich are hard to provide reliable explanations for recommendation results. An\nexplainable recommender system is crucial for the product development and\nsubsequent decision-making. To address these challenges, we introduce a novel\nrecommender that synergies Large Language Models (LLMs) and KGs to enhance the\nrecommendation and provide interpretable results. Specifically, we first\nharness the power of LLMs to augment KG reconstruction. LLMs comprehend and\ndecompose user reviews into new triples that are added into KG. In this way, we\ncan enrich KGs with explainable paths that express user preferences. To enhance\nthe recommendation on augmented KGs, we introduce a novel subgraph reasoning\nmodule that effectively measures the importance of nodes and discovers\nreasoning for recommendation. Finally, these reasoning paths are fed into the\nLLMs to generate interpretable explanations of the recommendation results. Our\napproach significantly enhances both the effectiveness and interpretability of\nrecommender systems, especially in cross-selling scenarios where traditional\nmethods falter. The effectiveness of our approach has been rigorously tested on\nfour open real-world datasets, with our methods demonstrating a superior\nperformance over contemporary state-of-the-art techniques by an average\nimprovement of 12%. The application of our model in a multinational engineering\nand technology company cross-selling recommendation system further underscores\nits practical utility and potential to redefine recommendation practices\nthrough improved accuracy and user trust.", "paper_summary_zh": "推薦系統在分析使用者與項目之間複雜的關係，提升各種網路應用程式的使用者體驗中扮演著關鍵角色。知識圖譜 (KG) 已被廣泛用於提升推薦系統的效能。然而，KG 眾所周知是有雜訊且不完整的，這使得難以提供可靠的推薦結果說明。一個可解釋的推薦系統對於產品開發和後續決策至關重要。為了應對這些挑戰，我們引入了一個新穎的推薦系統，它結合了大型語言模型 (LLM) 和 KG 來加強推薦並提供可解釋的結果。具體來說，我們首先利用 LLM 的力量來擴充 KG 重建。LLM 理解並將使用者評論分解成新的三元組，並將其新增到 KG 中。透過這種方式，我們可以用表達使用者偏好的可解釋路徑來豐富 KG。為了增強在擴充 KG 上的推薦，我們引入了一個新穎的子圖推理模組，它可以有效地衡量節點的重要性，並找出推薦的理由。最後，這些推理路徑被輸入到 LLM 中，以產生推薦結果的可解釋說明。我們的做法大幅提升了推薦系統的有效性和可解釋性，特別是在傳統方法失效的交叉銷售情境中。我們的做法的有效性已在四個開放的真實世界資料集上經過嚴格測試，我們的做法展示出比當代最先進技術更卓越的效能，平均提升了 12%。我們的模型在一家跨國工程和技術公司交叉銷售推薦系統中的應用進一步突顯了它的實用性，以及透過提升準確性和使用者信任來重新定義推薦實務的潛力。", "author": "Guangsi Shi et.al.", "authors": "Guangsi Shi, Xiaofeng Deng, Linhao Luo, Lijuan Xia, Lei Bao, Bei Ye, Fei Du, Shirui Pan, Yuxiao Li", "id": "2406.15859v2", "paper_url": "http://arxiv.org/abs/2406.15859v2", "repo": "null"}}