{"2411.12719": {"publish_time": "2024-11-19", "title": "Rethinking MUSHRA: Addressing Modern Challenges in Text-to-Speech Evaluation", "paper_summary": "Despite rapid advancements in TTS models, a consistent and robust human\nevaluation framework is still lacking. For example, MOS tests fail to\ndifferentiate between similar models, and CMOS's pairwise comparisons are\ntime-intensive. The MUSHRA test is a promising alternative for evaluating\nmultiple TTS systems simultaneously, but in this work we show that its reliance\non matching human reference speech unduly penalises the scores of modern TTS\nsystems that can exceed human speech quality. More specifically, we conduct a\ncomprehensive assessment of the MUSHRA test, focusing on its sensitivity to\nfactors such as rater variability, listener fatigue, and reference bias. Based\non our extensive evaluation involving 471 human listeners across Hindi and\nTamil we identify two primary shortcomings: (i) reference-matching bias, where\nraters are unduly influenced by the human reference, and (ii) judgement\nambiguity, arising from a lack of clear fine-grained guidelines. To address\nthese issues, we propose two refined variants of the MUSHRA test. The first\nvariant enables fairer ratings for synthesized samples that surpass human\nreference quality. The second variant reduces ambiguity, as indicated by the\nrelatively lower variance across raters. By combining these approaches, we\nachieve both more reliable and more fine-grained assessments. We also release\nMANGO, a massive dataset of 47,100 human ratings, the first-of-its-kind\ncollection for Indian languages, aiding in analyzing human preferences and\ndeveloping automatic metrics for evaluating TTS systems.", "paper_summary_zh": "儘管 TTS 模型快速進步，但仍然缺乏一致且穩健的人類評估架構。例如，MOS 測試無法區分類似的模型，而 CMOS 的成對比較非常耗時。MUSHRA 測試是一種很有前途的替代方案，可以同時評估多個 TTS 系統，但我們在這項工作中表明，它依賴於匹配人類參考語音，過度懲罰了可以超越人類語音品質的現代 TTS 系統的分數。更具體地說，我們對 MUSHRA 測試進行了全面的評估，重點關注其對評分者變異性、聽眾疲勞和參考偏差等因素的敏感性。根據我們對 471 位印地語和泰米爾語人類聽眾進行的廣泛評估，我們發現了兩個主要的缺點：(i) 參考匹配偏差，評分者過度受到人類參考的影響，以及 (ii) 判斷模糊性，源於缺乏明確的細粒度準則。為了解決這些問題，我們提出了 MUSHRA 測試的兩個改進版本。第一個變體可以對超越人類參考品質的合成樣本進行更公平的評分。第二個變體減少了模糊性，如評分者之間相對較低的差異所表明的那樣。通過結合這些方法，我們實現了更可靠且更細粒度的評估。我們還發布了 MANGO，這是一個包含 47,100 個人類評分的龐大數據集，這是印度語言中首創的此類集合，有助於分析人類偏好並開發用於評估 TTS 系統的自動化指標。", "author": "Praveen Srinivasa Varadhan et.al.", "authors": "Praveen Srinivasa Varadhan, Amogh Gulati, Ashwin Sankar, Srija Anand, Anirudh Gupta, Anirudh Mukherjee, Shiva Kumar Marepally, Ankur Bhatia, Saloni Jaju, Suvrat Bhooshan, Mitesh M. Khapra", "id": "2411.12719v1", "paper_url": "http://arxiv.org/abs/2411.12719v1", "repo": "null"}}