{"2407.15992": {"publish_time": "2024-07-22", "title": "Multimodal Input Aids a Bayesian Model of Phonetic Learning", "paper_summary": "One of the many tasks facing the typically-developing child language learner\nis learning to discriminate between the distinctive sounds that make up words\nin their native language. Here we investigate whether multimodal\ninformation--specifically adult speech coupled with video frames of speakers'\nfaces--benefits a computational model of phonetic learning. We introduce a\nmethod for creating high-quality synthetic videos of speakers' faces for an\nexisting audio corpus. Our learning model, when both trained and tested on\naudiovisual inputs, achieves up to a 8.1% relative improvement on a phoneme\ndiscrimination battery compared to a model trained and tested on audio-only\ninput. It also outperforms the audio model by up to 3.9% when both are tested\non audio-only data, suggesting that visual information facilitates the\nacquisition of acoustic distinctions. Visual information is especially\nbeneficial in noisy audio environments, where an audiovisual model closes 67%\nof the loss in discrimination performance of the audio model in noise relative\nto a non-noisy environment. These results demonstrate that visual information\nbenefits an ideal learner and illustrate some of the ways that children might\nbe able to leverage visual cues when learning to discriminate speech sounds.", "paper_summary_zh": "對於一般發展中的兒童語言學習者來說，其中一項重大的任務，是學會區分構成其母語單字的獨特聲音。我們在此探討多模式資訊（特別是成人語音搭配說話者臉部的影片畫面）是否對語音學習的運算模型有幫助。我們提出一個方法，用於為現有的音訊語料庫製作高品質的說話者臉部合成影片。我們的學習模型在接受音訊視覺輸入的訓練和測試後，在音素辨別電池上獲得高達 8.1% 的相對進步，與僅接受音訊輸入訓練和測試的模型相比。當兩者都接受音訊輸入的測試時，我們的學習模型也比音訊模型高出 3.9%，這表示視覺資訊有助於獲得音訊區別。在有雜訊的音訊環境中，視覺資訊特別有幫助，在這種環境中，音訊視覺模型彌補了音訊模型在有雜訊環境中，辨別效能相對於無雜訊環境的 67% 損失。這些結果證明視覺資訊對理想的學習者有幫助，並說明了兒童在學習辨別語音時，可能如何利用視覺提示。", "author": "Sophia Zhi et.al.", "authors": "Sophia Zhi, Roger P. Levy, Stephan C. Meylan", "id": "2407.15992v1", "paper_url": "http://arxiv.org/abs/2407.15992v1", "repo": "null"}}