{"2502.04328": {"publish_time": "2025-02-06", "title": "Ola: Pushing the Frontiers of Omni-Modal Language Model with Progressive Modality Alignment", "paper_summary": "Recent advances in large language models, particularly following GPT-4o, have\nsparked increasing interest in developing omni-modal models capable of\nunderstanding more modalities. While some open-source alternatives have\nemerged, there is still a notable lag behind specialized single-modality models\nin performance. In this paper, we present Ola, an Omni-modal language model\nthat achieves competitive performance across image, video, and audio\nunderstanding compared to specialized counterparts. The core design of Ola lies\nin its progressive modality alignment strategy that extends the supporting\nmodality of the language model progressively. Our training pipeline begins with\nthe most distinct modalities: image and text, then gradually expands the skill\nsets of the model using speech data that connects language and audio knowledge,\nand video data that connects all modalities. The progressive learning pipeline\nalso enables us to maintain a relatively small size of the cross-modal\nalignment data, making developing omni-modal from existing vision-language\nmodels easy and less costly. Moreover, to unlock an advanced interactive\nexperience like GPT-4o, we further design a sentence-wise decoding solution for\nstreaming speech generation. Extensive experiments demonstrate that Ola\nsurpasses existing open omni-modal LLMs across all modalities while achieving\nhighly competitive performance compared to state-of-the-art specialized models\nof similar sizes. We aim to make Ola a fully open omni-modal understanding\nsolution to advance future research in this emerging field. Model weights,\ncode, and data are open-sourced at https://github.com/Ola-Omni/Ola.", "paper_summary_zh": "<paragraph>近期大型語言模型的進展，特別是在 GPT-4o 之後，激發了人們對開發全模態模型的興趣，這種模型能夠理解更多模態。雖然已經出現了一些開源替代方案，但在效能上仍顯著落後於專門的單模態模型。在本文中，我們提出 Ola，這是一個全模態語言模型，在影像、影片和音訊理解方面，與專門的對應模型相比，達到了具有競爭力的效能。Ola 的核心設計在於其漸進式模態對齊策略，該策略逐漸擴展語言模型的支援模態。我們的訓練流程從最不同的模態開始：影像和文字，然後使用連接語言和音訊知識的語音資料，以及連接所有模態的影片資料，逐步擴展模型的技能組。漸進式學習流程也讓我們能夠維持相對較小的跨模態對齊資料大小，讓從現有的視覺語言模型開發全模態模型變得容易且成本較低。此外，為了解鎖類似 GPT-4o 的進階互動體驗，我們進一步設計了一個逐句解碼解決方案，用於串流語音生成。廣泛的實驗證明，Ola 在所有模態上都超越了現有的開放全模態 LLM，同時與類似規模的最新專門模型相比，達到了極具競爭力的效能。我們希望讓 Ola 成為一個完全開放的全模態理解解決方案，以推動這個新興領域的未來研究。模型權重、程式碼和資料已在 https://github.com/Ola-Omni/Ola 開源。</paragraph>", "author": "Zuyan Liu et.al.", "authors": "Zuyan Liu, Yuhao Dong, Jiahui Wang, Ziwei Liu, Winston Hu, Jiwen Lu, Yongming Rao", "id": "2502.04328v1", "paper_url": "http://arxiv.org/abs/2502.04328v1", "repo": "null"}}