{"2501.10024": {"publish_time": "2025-01-17", "title": "Automatic Speech Recognition for Sanskrit with Transfer Learning", "paper_summary": "Sanskrit, one of humanity's most ancient languages, has a vast collection of\nbooks and manuscripts on diverse topics that have been accumulated over\nmillennia. However, its digital content (audio and text), which is vital for\nthe training of AI systems, is profoundly limited. Furthermore, its intricate\nlinguistics make it hard to develop robust NLP tools for wider accessibility.\nGiven these constraints, we have developed an automatic speech recognition\nmodel for Sanskrit by employing transfer learning mechanism on OpenAI's Whisper\nmodel. After carefully optimising the hyper-parameters, we obtained promising\nresults with our transfer-learned model achieving a word error rate of 15.42%\non Vaksancayah dataset. An online demo of our model is made available for the\nuse of public and to evaluate its performance firsthand thereby paving the way\nfor improved accessibility and technological support for Sanskrit learning in\nthe modern era.", "paper_summary_zh": "梵語是人類最古老的語言之一，擁有大量關於不同主題的書籍和手稿，這些書籍和手稿在數千年來不斷累積。然而，對於 AI 系統訓練至關重要的數位內容（音訊和文字）卻嚴重受限。此外，其複雜的語言學特徵使得難以開發強大的 NLP 工具以利於更廣泛的存取。有鑑於這些限制，我們採用 OpenAI 的 Whisper 模型上的遷移學習機制，開發了梵語自動語音辨識模型。在仔細最佳化超參數後，我們透過遷移學習模型在 Vaksancayah 資料集上獲得了令人滿意的結果，字元錯誤率為 15.42%。我們已公開模型的線上示範，供大眾使用並親自評估其效能，進而為現代梵語學習的普及和技術支援鋪路。", "author": "Bidit Sadhukhan et.al.", "authors": "Bidit Sadhukhan, Swami Punyeshwarananda", "id": "2501.10024v1", "paper_url": "http://arxiv.org/abs/2501.10024v1", "repo": "null"}}