{"2412.15939": {"publish_time": "2024-12-20", "title": "Reframing Image Difference Captioning with BLIP2IDC and Synthetic Augmentation", "paper_summary": "The rise of the generative models quality during the past years enabled the\ngeneration of edited variations of images at an important scale. To counter the\nharmful effects of such technology, the Image Difference Captioning (IDC) task\naims to describe the differences between two images. While this task is\nsuccessfully handled for simple 3D rendered images, it struggles on real-world\nimages. The reason is twofold: the training data-scarcity, and the difficulty\nto capture fine-grained differences between complex images. To address those\nissues, we propose in this paper a simple yet effective framework to both adapt\nexisting image captioning models to the IDC task and augment IDC datasets. We\nintroduce BLIP2IDC, an adaptation of BLIP2 to the IDC task at low computational\ncost, and show it outperforms two-streams approaches by a significant margin on\nreal-world IDC datasets. We also propose to use synthetic augmentation to\nimprove the performance of IDC models in an agnostic fashion. We show that our\nsynthetic augmentation strategy provides high quality data, leading to a\nchallenging new dataset well-suited for IDC named Syned1.", "paper_summary_zh": "在過去幾年中，生成式模型品質的提升促成了大量編輯過後的影像變體產生。為了對抗這種技術的有害影響，影像差異標題（IDC）任務旨在描述兩張影像之間的差異。雖然這個任務對於簡單的 3D 渲染影像處理得很好，但它在真實世界的影像上卻有困難。原因有兩個：訓練資料的稀少性，以及難以捕捉複雜影像之間的細微差異。為了解決這些問題，我們在這篇論文中提出了一個簡單但有效的架構，既能將現有的影像標題模型調整到 IDC 任務，又能擴充 IDC 資料集。我們引入了 BLIP2IDC，這是 BLIP2 在低計算成本下調整到 IDC 任務的結果，並展示它在真實世界的 IDC 資料集上以顯著的幅度優於雙串流方法。我們還建議使用合成擴充以不可知的方式來提升 IDC 模型的效能。我們展示出我們的合成擴充策略提供了高品質的資料，造就了一個非常適合 IDC 的具有挑戰性的新資料集，名為 Syned1。", "author": "Gautier Evennou et.al.", "authors": "Gautier Evennou, Antoine Chaffin, Vivien Chappelier, Ewa Kijak", "id": "2412.15939v1", "paper_url": "http://arxiv.org/abs/2412.15939v1", "repo": "null"}}