{"2501.09213": {"publish_time": "2025-01-16", "title": "FineMedLM-o1: Enhancing the Medical Reasoning Ability of LLM from Supervised Fine-Tuning to Test-Time Training", "paper_summary": "Recent advancements in large language models (LLMs) have shown promise in\nmedical applications such as disease diagnosis and treatment planning. However,\nmost existing medical LLMs struggle with the advanced reasoning required for\ncomplex clinical scenarios, such as differential diagnosis or personalized\ntreatment suggestions. We proposed FineMedLM-o1, which leverages high-quality\nsynthetic medical data and long-form reasoning data for Supervised Fine-Tuning\n(SFT) and Direct Preference Optimization (DPO), enabling advanced dialogue and\ndeep reasoning capabilities. Additionally, we introduced Test-Time Training\n(TTT) in the medical domain for the first time, facilitating domain adaptation\nand ensuring reliable, accurate reasoning. Experimental results demonstrate\nthat FineMedLM-o1 achieves a 23% average performance improvement over prior\nmodels on key medical benchmarks. Furthermore, the introduction of TTT provides\nan additional 14% performance boost, highlighting its effectiveness in\nenhancing medical reasoning capabilities. To support this process, we also\nproposed a novel method for synthesizing medical dialogue. Compared to other\nopen-source datasets, our dataset stands out as superior in both quality and\ncomplexity. The project and data will be released on GitHub.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展已在疾病診斷和治療規劃等醫療應用中展現出前景。然而，現有的醫療 LLM 大多難以應對複雜臨床情境所需的進階推理，例如鑑別診斷或個人化治療建議。我們提出了 FineMedLM-o1，它利用優質的合成醫療數據和長篇推理數據進行監督微調 (SFT) 和直接偏好最佳化 (DPO)，實現進階對話和深度推理能力。此外，我們首次在醫療領域引入了測試時訓練 (TTT)，促進領域適應並確保推理可靠且準確。實驗結果表明，FineMedLM-o1 在主要醫療基準上比先前的模型平均提升了 23% 的效能。此外，TTT 的引入提供了額外的 14% 效能提升，凸顯其在增強醫療推理能力方面的有效性。為了支援此流程，我們還提出了一種合成醫療對話的新方法。與其他開源數據集相比，我們的數據集在品質和複雜性方面都脫穎而出。該專案和數據將在 GitHub 上發布。", "author": "Hongzhou Yu et.al.", "authors": "Hongzhou Yu, Tianhao Cheng, Ying Cheng, Rui Feng", "id": "2501.09213v1", "paper_url": "http://arxiv.org/abs/2501.09213v1", "repo": "null"}}