{"2406.10210": {"publish_time": "2024-06-14", "title": "Make It Count: Text-to-Image Generation with an Accurate Number of Objects", "paper_summary": "Despite the unprecedented success of text-to-image diffusion models,\ncontrolling the number of depicted objects using text is surprisingly hard.\nThis is important for various applications from technical documents, to\nchildren's books to illustrating cooking recipes. Generating object-correct\ncounts is fundamentally challenging because the generative model needs to keep\na sense of separate identity for every instance of the object, even if several\nobjects look identical or overlap, and then carry out a global computation\nimplicitly during generation. It is still unknown if such representations\nexist. To address count-correct generation, we first identify features within\nthe diffusion model that can carry the object identity information. We then use\nthem to separate and count instances of objects during the denoising process\nand detect over-generation and under-generation. We fix the latter by training\na model that predicts both the shape and location of a missing object, based on\nthe layout of existing ones, and show how it can be used to guide denoising\nwith correct object count. Our approach, CountGen, does not depend on external\nsource to determine object layout, but rather uses the prior from the diffusion\nmodel itself, creating prompt-dependent and seed-dependent layouts. Evaluated\non two benchmark datasets, we find that CountGen strongly outperforms the\ncount-accuracy of existing baselines.", "paper_summary_zh": "儘管文字轉圖片擴散模型取得了前所未有的成功，但使用文字控制描繪物體的數量卻意外困難。這對於各種應用程式來說很重要，從技術文件、兒童讀物到烹飪食譜說明。生成物體正確數量在根本上具有挑戰性，因為生成模型需要為物體的每個實例保留獨立識別感，即使多個物體看起來相同或重疊，然後在生成過程中隱式執行全局計算。目前尚不清楚是否存在此類表徵。為了解決數量正確生成的問題，我們首先識別擴散模型中可以攜帶物體識別資訊的特徵。然後，我們在去噪過程中使用它們來分離和計算物體實例，並偵測過度生成和不足生成。我們透過訓練一個模型來修正後者，該模型根據現有物體的佈局預測遺失物體的形狀和位置，並展示如何使用它來引導具有正確物體數量的去噪。我們的 CountGen 方法不依賴於外部來源來確定物體佈局，而是使用擴散模型本身的先驗，從而建立提示依賴和種子依賴的佈局。在兩個基準資料集上進行評估，我們發現 CountGen 在計數準確度方面明顯優於現有基準。", "author": "Lital Binyamin et.al.", "authors": "Lital Binyamin, Yoad Tewel, Hilit Segev, Eran Hirsch, Royi Rassin, Gal Chechik", "id": "2406.10210v1", "paper_url": "http://arxiv.org/abs/2406.10210v1", "repo": "null"}}