{"2412.12575": {"publish_time": "2024-12-17", "title": "SIDE: Socially Informed Drought Estimation Toward Understanding Societal Impact Dynamics of Environmental Crisis", "paper_summary": "Drought has become a critical global threat with significant societal impact.\nExisting drought monitoring solutions primarily focus on assessing drought\nseverity using quantitative measurements, overlooking the diverse societal\nimpact of drought from human-centric perspectives. Motivated by the collective\nintelligence on social media and the computational power of AI, this paper\nstudies a novel problem of socially informed AI-driven drought estimation that\naims to leverage social and news media information to jointly estimate drought\nseverity and its societal impact. Two technical challenges exist: 1) How to\nmodel the implicit temporal dynamics of drought societal impact. 2) How to\ncapture the social-physical interdependence between the physical drought\ncondition and its societal impact. To address these challenges, we develop\nSIDE, a socially informed AI-driven drought estimation framework that\nexplicitly quantifies the societal impact of drought and effectively models the\nsocial-physical interdependency for joint severity-impact estimation.\nExperiments on real-world datasets from California and Texas demonstrate SIDE's\nsuperior performance compared to state-of-the-art baselines in accurately\nestimating drought severity and its societal impact. SIDE offers valuable\ninsights for developing human-centric drought mitigation strategies to foster\nsustainable and resilient communities.", "paper_summary_zh": "乾旱已成為一個嚴重的全球威脅，對社會造成重大影響。\n現有的乾旱監測解決方案主要著重於使用定量測量來評估乾旱嚴重性，而忽略了乾旱從以人為中心的觀點來看對社會造成的不同影響。本論文受到社群媒體的集體智慧和人工智慧的運算能力的啟發，探討了一個新的問題，即由社會訊息驅動的乾旱估計，其目標是利用社群和新聞媒體的資訊來共同估計乾旱的嚴重性和其對社會的影響。存在兩個技術挑戰：1) 如何建模乾旱對社會影響的隱含時間動態。2) 如何捕捉物理乾旱狀況及其對社會影響之間的社會物理相互依存性。為了應對這些挑戰，我們開發了 SIDE，一個由社會訊息驅動的乾旱估計框架，它明確量化了乾旱對社會的影響，並有效地建模了社會物理相互依存性，以進行聯合嚴重性影響估計。對來自加州和德州的真實世界資料集的實驗證明了 SIDE 在準確估計乾旱嚴重性和其對社會的影響方面優於最先進的基準。SIDE 為制定以人為中心的乾旱緩解策略提供了寶貴的見解，以培養可持續和有韌性的社區。", "author": "Lanyu Shang et.al.", "authors": "Lanyu Shang, Bozhang Chen, Shiwei Liu, Yang Zhang, Ruohan Zong, Anav Vora, Ximing Cai, Na Wei, Dong Wang", "id": "2412.12575v1", "paper_url": "http://arxiv.org/abs/2412.12575v1", "repo": "null"}}