{"2410.12299": {"publish_time": "2024-10-16", "title": "Semantics-Adaptive Activation Intervention for LLMs via Dynamic Steering Vectors", "paper_summary": "Large language models (LLMs) have achieved remarkable performance across many\ntasks, yet aligning them with desired behaviors remains challenging. Activation\nintervention has emerged as an effective and economical method to modify the\nbehavior of LLMs. Despite considerable interest in this area, current\nintervention methods exclusively employ a fixed steering vector to modify model\nactivations, lacking adaptability to diverse input semantics. To address this\nlimitation, we propose Semantics-Adaptive Dynamic Intervention (SADI), a novel\nmethod that constructs a dynamic steering vector to intervene model activations\nat inference time. More specifically, SADI utilizes activation differences in\ncontrastive pairs to precisely identify critical elements of an LLM (i.e.,\nattention heads, hidden states, and neurons) for targeted intervention. During\ninference, SADI dynamically steers model behavior by scaling element-wise\nactivations based on the directions of input semantics. Experimental results\nshow that SADI outperforms established baselines by substantial margins,\nimproving task performance without training. SADI's cost-effectiveness and\ngeneralizability across various LLM backbones and tasks highlight its potential\nas a versatile alignment technique. In addition, we release the code to foster\nresearch along this line:https://github.com/weixuan-wang123/SADI.", "paper_summary_zh": "大型語言模型 (LLM) 已在許多任務中取得顯著的表現，但要讓它們與所需的行為保持一致仍然具有挑戰性。啟動介入已成為一種有效且經濟的方法，可以修改 LLM 的行為。儘管對這個領域有相當大的興趣，但目前的介入方法僅使用固定的導向向量來修改模型啟動，缺乏適應不同輸入語義的能力。為了解決這個限制，我們提出語義自適應動態介入 (SADI)，這是一種創新的方法，用於建立動態導向向量，以便在推理時介入模型啟動。更具體地說，SADI 利用對比對中的啟動差異，精確地識別 LLM 的關鍵元素（即注意力頭、隱藏狀態和神經元），以進行有針對性的介入。在推理期間，SADI 根據輸入語義的方向，通過調整元素級啟動，動態地引導模型行為。實驗結果表明，SADI 以大幅的幅度優於已建立的基準，在沒有訓練的情況下提高了任務性能。SADI 在各種 LLM 主幹和任務中的成本效益和通用性突出了它作為一種多功能對齊技術的潛力。此外，我們發布代碼以促進沿此線的研究：https://github.com/weixuan-wang123/SADI。", "author": "Weixuan Wang et.al.", "authors": "Weixuan Wang, Jingyuan Yang, Wei Peng", "id": "2410.12299v1", "paper_url": "http://arxiv.org/abs/2410.12299v1", "repo": "null"}}