{"2411.13032": {"publish_time": "2024-11-20", "title": "\"It was 80% me, 20% AI\": Seeking Authenticity in Co-Writing with Large Language Models", "paper_summary": "Given the rising proliferation and diversity of AI writing assistance tools,\nespecially those powered by large language models (LLMs), both writers and\nreaders may have concerns about the impact of these tools on the authenticity\nof writing work. We examine whether and how writers want to preserve their\nauthentic voice when co-writing with AI tools and whether personalization of AI\nwriting support could help achieve this goal. We conducted semi-structured\ninterviews with 19 professional writers, during which they co-wrote with both\npersonalized and non-personalized AI writing-support tools. We supplemented\nwriters' perspectives with opinions from 30 avid readers about the written work\nco-produced with AI collected through an online survey. Our findings illuminate\nconceptions of authenticity in human-AI co-creation, which focus more on the\nprocess and experience of constructing creators' authentic selves. While\nwriters reacted positively to personalized AI writing tools, they believed the\nform of personalization needs to target writers' growth and go beyond the phase\nof text production. Overall, readers' responses showed less concern about\nhuman-AI co-writing. Readers could not distinguish AI-assisted work,\npersonalized or not, from writers' solo-written work and showed positive\nattitudes toward writers experimenting with new technology for creative\nwriting.", "paper_summary_zh": "隨著 AI 寫作輔助工具的普及和多樣化，特別是那些由大型語言模型 (LLM) 驅動的工具，寫作者和讀者可能都擔心這些工具對寫作作品真實性的影響。我們探討了在與 AI 工具共同寫作時，寫作者是否以及如何想要保留他們的真實聲音，以及 AI 寫作支援的個人化是否可以幫助實現這一目標。我們對 19 位專業寫作者進行了半結構化訪談，在訪談中，他們與個性化和非個性化的 AI 寫作支援工具共同寫作。我們通過一項線上調查，用 30 位熱心讀者對與 AI 共同創作的書面作品的意見，補充了寫作者的觀點。我們的研究結果闡明了人機共同創作中真實性的概念，其更側重於構建創作者真實自我的過程和體驗。雖然寫作者對個性化的 AI 寫作工具反應積極，但他們認為個性化的形式需要針對寫作者的成長，並超越文本產生的階段。總體而言，讀者的回應對人機共同寫作的關注較少。讀者無法區分 AI 協助的作品（無論是否個性化）和寫作者單獨寫作的作品，並對寫作者嘗試使用新技術進行創意寫作表現出積極的態度。", "author": "Angel Hsing-Chi Hwang et.al.", "authors": "Angel Hsing-Chi Hwang, Q. Vera Liao, Su Lin Blodgett, Alexandra Olteanu, Adam Trischler", "id": "2411.13032v1", "paper_url": "http://arxiv.org/abs/2411.13032v1", "repo": "null"}}