{"2410.04765": {"publish_time": "2024-10-07", "title": "Molecular topological deep learning for polymer property prediction", "paper_summary": "Accurate and efficient prediction of polymer properties is of key importance\nfor polymer design. Traditional experimental tools and density function theory\n(DFT)-based simulations for polymer property evaluation, are both expensive and\ntime-consuming. Recently, a gigantic amount of graph-based molecular models\nhave emerged and demonstrated huge potential in molecular data analysis. Even\nwith the great progresses, these models tend to ignore the high-order and\nmutliscale information within the data. In this paper, we develop molecular\ntopological deep learning (Mol-TDL) for polymer property analysis. Our Mol-TDL\nincorporates both high-order interactions and multiscale properties into\ntopological deep learning architecture. The key idea is to represent polymer\nmolecules as a series of simplicial complices at different scales and build up\nsimplical neural networks accordingly. The aggregated information from\ndifferent scales provides a more accurate prediction of polymer molecular\nproperties.", "paper_summary_zh": "聚合物的特性預測準確且有效，對於聚合物設計至關重要。傳統的實驗工具和基於密度泛函理論 (DFT) 的聚合物特性評估模擬既昂貴又耗時。近期，大量的圖形化分子模型應運而生，在分子數據分析中展現出巨大的潛力。即使有了這些巨大的進展，這些模型還是傾向於忽略數據中的高階和多尺度信息。在本文中，我們開發了分子拓撲深度學習 (Mol-TDL) 來進行聚合物特性分析。我們的 Mol-TDL 將高階交互作用和多尺度特性整合到拓撲深度學習架構中。其關鍵在於將聚合物分子表示為一系列不同尺度的單純復形，並據此建立單純神經網路。來自不同尺度的彙總信息可更準確地預測聚合物分子特性。", "author": "Cong Shen et.al.", "authors": "Cong Shen, Yipeng Zhang, Fei Han, Kelin Xia", "id": "2410.04765v1", "paper_url": "http://arxiv.org/abs/2410.04765v1", "repo": "null"}}