{"2412.15532": {"publish_time": "2024-12-20", "title": "Improved Forecasts of Global Extreme Marine Heatwaves Through a Physics-guided Data-driven Approach", "paper_summary": "The unusually warm sea surface temperature events known as marine heatwaves\n(MHWs) have a profound impact on marine ecosystems. Accurate prediction of\nextreme MHWs has significant scientific and financial worth. However, existing\nmethods still have certain limitations, especially in the most extreme MHWs. In\nthis study, to address these issues, based on the physical nature of MHWs, we\ncreated a novel deep learning neural network that is capable of accurate 10-day\nMHW forecasting. Our framework significantly improves the forecast ability of\nextreme MHWs through two specially designed modules inspired by numerical\nmodels: a coupler and a probabilistic data argumentation. The coupler simulates\nthe driving effect of atmosphere on MHWs while the probabilistic data\nargumentation approaches significantly boost the forecast ability of extreme\nMHWs based on the idea of ensemble forecast. Compared with traditional\nnumerical prediction, our framework has significantly higher accuracy and\nrequires fewer computational resources. What's more, explainable AI methods\nshow that wind forcing is the primary driver of MHW evolution and reveal its\nrelation with air-sea heat exchange. Overall, our model provides a framework\nfor understanding MHWs' driving processes and operational forecasts in the\nfuture.", "paper_summary_zh": "異常溫暖的海面溫度事件，即海洋熱浪 (MHW)，對海洋生態系統產生深遠的影響。準確預測極端 MHW 具有重要的科學和經濟價值。然而，現有方法仍存在一定的局限性，特別是在最極端的 MHW 中。在本研究中，為了解決這些問題，基於 MHW 的物理特性，我們創建了一個新的深度學習神經網路，它能夠準確預測 10 天的 MHW。我們的框架通過兩個特別設計的受數值模型啟發的模組，顯著提高了極端 MHW 的預測能力：一個耦合器和一個概率數據論證。耦合器模擬了大氣對 MHW 的驅動效應，而概率數據論證基於集合預測的思想，顯著提高了極端 MHW 的預測能力。與傳統的數值預測相比，我們的框架具有顯著更高的準確度，並且需要更少的計算資源。此外，可解釋的 AI 方法表明，風力強迫是 MHW 演化的主要驅動力，並揭示了它與空氣-海洋熱交換的關係。總的來說，我們的模型為理解 MHW 的驅動過程和未來的操作預測提供了一個框架。", "author": "Ruiqi Shu et.al.", "authors": "Ruiqi Shu, Hao Wu, Yuan Gao, Fanghua Xu, Ruijian Gou, Xiaomeng Huang", "id": "2412.15532v1", "paper_url": "http://arxiv.org/abs/2412.15532v1", "repo": "null"}}