{"2501.06999": {"publish_time": "2025-01-13", "title": "Likelihood Training of Cascaded Diffusion Models via Hierarchical Volume-preserving Maps", "paper_summary": "Cascaded models are multi-scale generative models with a marked capacity for\nproducing perceptually impressive samples at high resolutions. In this work, we\nshow that they can also be excellent likelihood models, so long as we overcome\na fundamental difficulty with probabilistic multi-scale models: the\nintractability of the likelihood function. Chiefly, in cascaded models each\nintermediary scale introduces extraneous variables that cannot be tractably\nmarginalized out for likelihood evaluation. This issue vanishes by modeling the\ndiffusion process on latent spaces induced by a class of transformations we\ncall hierarchical volume-preserving maps, which decompose spatially structured\ndata in a hierarchical fashion without introducing local distortions in the\nlatent space. We demonstrate that two such maps are well-known in the\nliterature for multiscale modeling: Laplacian pyramids and wavelet transforms.\nNot only do such reparameterizations allow the likelihood function to be\ndirectly expressed as a joint likelihood over the scales, we show that the\nLaplacian pyramid and wavelet transform also produces significant improvements\nto the state-of-the-art on a selection of benchmarks in likelihood modeling,\nincluding density estimation, lossless compression, and out-of-distribution\ndetection. Investigating the theoretical basis of our empirical gains we\nuncover deep connections to score matching under the Earth Mover's Distance\n(EMD), which is a well-known surrogate for perceptual similarity. Code can be\nfound at \\href{https://github.com/lihenryhfl/pcdm}{this https url}.", "paper_summary_zh": "層疊模型是一種多尺度生成模型，具有以高解析度產生令人印象深刻的樣本的顯著能力。在這項工作中，我們表明它們也可以成為出色的可能性模型，只要我們克服概率多尺度模型的一個基本難題：可能性函數的難以處理性。最重要的是，在層疊模型中，每個中間尺度都會引入額外的變數，這些變數無法被合理地邊緣化以進行可能性評估。通過對由我們稱之為分層體積保持映射的一類轉換誘導的潛在空間上的擴散過程進行建模，這個問題消失了，這種轉換以分層方式分解空間結構化的資料，而不會在潛在空間中引入局部失真。我們證明了這類映射中有兩個在多尺度建模的文獻中很有名：拉普拉斯金字塔和波段轉換。這種重新參數化不僅允許可能性函數直接表示為尺度上的聯合可能性，我們還表明，拉普拉斯金字塔和波段轉換也對可能性建模基準中的一系列最先進技術產生了顯著改進，包括密度估計、無損壓縮和分佈外檢測。在探討我們經驗收益的理論基礎時，我們發現了與地球移動距離 (EMD) 下的得分匹配的深層聯繫，而地球移動距離 (EMD) 是感知相似性的眾所周知的替代方法。可以在 \\href{https://github.com/lihenryhfl/pcdm}{這個 https 網址} 找到程式碼。", "author": "Henry Li et.al.", "authors": "Henry Li, Ronen Basri, Yuval Kluger", "id": "2501.06999v1", "paper_url": "http://arxiv.org/abs/2501.06999v1", "repo": "https://github.com/lihenryhfl/pcdm"}}