{"2412.17797": {"publish_time": "2024-12-23", "title": "Observation Interference in Partially Observable Assistance Games", "paper_summary": "We study partially observable assistance games (POAGs), a model of the\nhuman-AI value alignment problem which allows the human and the AI assistant to\nhave partial observations. Motivated by concerns of AI deception, we study a\nqualitatively new phenomenon made possible by partial observability: would an\nAI assistant ever have an incentive to interfere with the human's observations?\nFirst, we prove that sometimes an optimal assistant must take\nobservation-interfering actions, even when the human is playing optimally, and\neven when there are otherwise-equivalent actions available that do not\ninterfere with observations. Though this result seems to contradict the classic\ntheorem from single-agent decision making that the value of perfect information\nis nonnegative, we resolve this seeming contradiction by developing a notion of\ninterference defined on entire policies. This can be viewed as an extension of\nthe classic result that the value of perfect information is nonnegative into\nthe cooperative multiagent setting. Second, we prove that if the human is\nsimply making decisions based on their immediate outcomes, the assistant might\nneed to interfere with observations as a way to query the human's preferences.\nWe show that this incentive for interference goes away if the human is playing\noptimally, or if we introduce a communication channel for the human to\ncommunicate their preferences to the assistant. Third, we show that if the\nhuman acts according to the Boltzmann model of irrationality, this can create\nan incentive for the assistant to interfere with observations. Finally, we use\nan experimental model to analyze tradeoffs faced by the AI assistant in\npractice when considering whether or not to take observation-interfering\nactions.", "paper_summary_zh": "<paragraph>我們研究部分可觀察協助遊戲 (POAG)，這是一種人類-AI 價值對齊問題模型，允許人類和 AI 助理進行部分觀察。由於擔心 AI 欺騙，我們研究了一個由部分可觀察性促成的質性新現象：AI 助理是否會誘使干擾人類的觀察？首先，我們證明有時最佳助理必須採取觀察干擾行動，即使人類表現最佳，即使有其他等效行動不會干擾觀察。儘管這個結果看似與單一代理決策制定中的經典定理相矛盾，即完美資訊的價值是非負的，但我們透過制定定義在整個政策上的干擾概念來解決這個看似矛盾的現象。這可以視為將完美資訊的價值是非負的經典結果延伸到合作的多代理設定中。其次，我們證明如果人類只是根據其立即結果做出決策，助理可能需要干擾觀察作為查詢人類偏好的方法。我們表明，如果人類表現最佳，或者我們引入一個讓人類將其偏好傳達給助理的溝通管道，這種干擾誘因就會消失。第三，我們表明如果人類根據波茲曼非理性模型行事，這可能會誘使助理干擾觀察。最後，我們使用一個實驗模型來分析 AI 助理在實務上考慮是否採取觀察干擾行動時所面臨的權衡。</paragraph>", "author": "Scott Emmons et.al.", "authors": "Scott Emmons, Caspar Oesterheld, Vincent Conitzer, Stuart Russell", "id": "2412.17797v1", "paper_url": "http://arxiv.org/abs/2412.17797v1", "repo": "null"}}