{"2412.03253": {"publish_time": "2024-12-04", "title": "Alignment at Pre-training! Towards Native Alignment for Arabic LLMs", "paper_summary": "The alignment of large language models (LLMs) is critical for developing\neffective and safe language models. Traditional approaches focus on aligning\nmodels during the instruction tuning or reinforcement learning stages, referred\nto in this paper as `post alignment'. We argue that alignment during the\npre-training phase, which we term `native alignment', warrants investigation.\nNative alignment aims to prevent unaligned content from the beginning, rather\nthan relying on post-hoc processing. This approach leverages extensively\naligned pre-training data to enhance the effectiveness and usability of\npre-trained models. Our study specifically explores the application of native\nalignment in the context of Arabic LLMs. We conduct comprehensive experiments\nand ablation studies to evaluate the impact of native alignment on model\nperformance and alignment stability. Additionally, we release open-source\nArabic LLMs that demonstrate state-of-the-art performance on various\nbenchmarks, providing significant benefits to the Arabic LLM community.", "paper_summary_zh": "大型語言模型（LLM）的對齊對於開發有效且安全的語言模型至關重要。傳統方法著重於在指令微調或強化學習階段對齊模型，本文稱之為「後對齊」。我們認為，在預訓練階段進行對齊（我們稱之為「原生對齊」）值得探討。原生對齊旨在從一開始就防止未對齊的內容，而不是依賴事後處理。這種方法充分利用經過大量對齊的預訓練資料，以增強預訓練模型的有效性和可用性。我們的研究特別探討了原生對齊在阿拉伯語 LLM 中的應用。我們進行了全面的實驗和消融研究，以評估原生對齊對模型效能和對齊穩定性的影響。此外，我們發布了開放原始碼的阿拉伯語 LLM，這些 LLM 在各種基準測試中表現出最先進的效能，為阿拉伯語 LLM 社群帶來顯著的好處。", "author": "Juhao Liang et.al.", "authors": "Juhao Liang, Zhenyang Cai, Jianqing Zhu, Huang Huang, Kewei Zong, Bang An, Mosen Alharthi, Juncai He, Lian Zhang, Haizhou Li, Benyou Wang, Jinchao Xu", "id": "2412.03253v1", "paper_url": "http://arxiv.org/abs/2412.03253v1", "repo": "https://github.com/freedomintelligence/acegpt-v2"}}