{"2502.02866": {"publish_time": "2025-02-05", "title": "A Systematic Approach for Assessing Large Language Models' Test Case Generation Capability", "paper_summary": "Software testing ensures the quality and reliability of software products,\nbut manual test case creation is labor-intensive. With the rise of large\nlanguage models (LLMs), there is growing interest in unit test creation with\nLLMs. However, effective assessment of LLM-generated test cases is limited by\nthe lack of standardized benchmarks that comprehensively cover diverse\nprogramming scenarios. To address the assessment of LLM's test case generation\nability and lacking dataset for evaluation, we propose the Generated Benchmark\nfrom Control-Flow Structure and Variable Usage Composition (GBCV) approach,\nwhich systematically generates programs used for evaluating LLMs' test\ngeneration capabilities. By leveraging basic control-flow structures and\nvariable usage, GBCV provides a flexible framework to create a spectrum of\nprograms ranging from simple to complex. Because GPT-4o and GPT-3-Turbo are\npublicly accessible models, to present real-world regular user's use case, we\nuse GBCV to assess LLM performance on them. Our findings indicate that GPT-4o\nperforms better on complex program structures, while all models effectively\ndetect boundary values in simple conditions but face challenges with arithmetic\ncomputations. This study highlights the strengths and limitations of LLMs in\ntest generation, provides a benchmark framework, and suggests directions for\nfuture improvement.", "paper_summary_zh": "軟體測試確保軟體產品的品質和可靠性，\n但手動測試案例的建立需要大量人力。隨著大型語言模型 (LLM) 的興起，使用 LLM 建立單元測試越來越受到關注。然而，由於缺乏全面涵蓋各種程式設計情境的標準化基準，對 LLM 生成的測試案例進行有效的評估受到限制。為了評估 LLM 的測試案例生成能力和缺乏評估用的資料集，我們提出從控制流程結構和變數使用組成 (GBCV) 方法產生的基準，它有系統地產生用於評估 LLM 測試生成能力的程式。透過利用基本的控制流程結構和變數使用，GBCV 提供一個彈性的架構來建立從簡單到複雜的程式範圍。由於 GPT-4o 和 GPT-3-Turbo 是公開存取的模型，為了呈現真實世界的常規使用者的使用案例，我們使用 GBCV 來評估 LLM 在它們上的效能。我們的研究結果指出，GPT-4o 在複雜的程式結構上表現得更好，而所有模型都能有效地偵測簡單條件中的邊界值，但在算術運算方面則面臨挑戰。這項研究突顯了 LLM 在測試生成中的優缺點，提供了一個基準架構，並建議未來改進的方向。", "author": "Hung-Fu Chang et.al.", "authors": "Hung-Fu Chang, Mohammad Shokrolah Shirazi", "id": "2502.02866v1", "paper_url": "http://arxiv.org/abs/2502.02866v1", "repo": "null"}}