{"2405.14608": {"publish_time": "2024-05-23", "title": "ShapeFormer: Shapelet Transformer for Multivariate Time Series Classification", "paper_summary": "Multivariate time series classification (MTSC) has attracted significant\nresearch attention due to its diverse real-world applications. Recently,\nexploiting transformers for MTSC has achieved state-of-the-art performance.\nHowever, existing methods focus on generic features, providing a comprehensive\nunderstanding of data, but they ignore class-specific features crucial for\nlearning the representative characteristics of each class. This leads to poor\nperformance in the case of imbalanced datasets or datasets with similar overall\npatterns but differing in minor class-specific details. In this paper, we\npropose a novel Shapelet Transformer (ShapeFormer), which comprises\nclass-specific and generic transformer modules to capture both of these\nfeatures. In the class-specific module, we introduce the discovery method to\nextract the discriminative subsequences of each class (i.e. shapelets) from the\ntraining set. We then propose a Shapelet Filter to learn the difference\nfeatures between these shapelets and the input time series. We found that the\ndifference feature for each shapelet contains important class-specific\nfeatures, as it shows a significant distinction between its class and others.\nIn the generic module, convolution filters are used to extract generic features\nthat contain information to distinguish among all classes. For each module, we\nemploy the transformer encoder to capture the correlation between their\nfeatures. As a result, the combination of two transformer modules allows our\nmodel to exploit the power of both types of features, thereby enhancing the\nclassification performance. Our experiments on 30 UEA MTSC datasets demonstrate\nthat ShapeFormer has achieved the highest accuracy ranking compared to\nstate-of-the-art methods. The code is available at\nhttps://github.com/xuanmay2701/shapeformer.", "paper_summary_zh": "多變量時間序列分類 (MTSC) 由於其多樣化的真實世界應用而引起了重大的研究關注。最近，利用Transformer進行 MTSC 已實現了最先進的性能。然而，現有方法專注於通用特徵，提供對數據的全面理解，但它們忽略了對學習每個類別的代表性特徵至關重要的類別特定特徵。這導致在不平衡的數據集或具有相似整體模式但類別特定細節不同的數據集的情況下性能不佳。在本文中，我們提出了一個新穎的 Shapelet Transformer（ShapeFormer），它包含類別特定和通用Transformer模組，以擷取這兩個特徵。在類別特定模組中，我們引入了發現方法，從訓練集中提取每個類別的區分子序列（即 shapelets）。然後，我們提出了一個 Shapelet Filter 來學習這些 shapelets 與輸入時間序列之間的差異特徵。我們發現每個 shapelet 的差異特徵包含重要的類別特定特徵，因為它顯示了其類別與其他類別之間的顯著區別。在通用模組中，卷積濾波器用於提取包含區分所有類別的資訊的通用特徵。對於每個模組，我們採用Transformer編碼器來擷取其特徵之間的關聯。因此，兩個Transformer模組的組合使我們的模型能夠利用兩種特徵的力量，從而增強分類性能。我們在 30 個 UEA MTSC 數據集上的實驗表明，與最先進的方法相比，ShapeFormer 已經取得了最高的準確率排名。程式碼可以在 https://github.com/xuanmay2701/shapeformer 獲得。", "author": "Xuan-May Le et.al.", "authors": "Xuan-May Le, Ling Luo, Uwe Aickelin, Minh-Tuan Tran", "id": "2405.14608v1", "paper_url": "http://arxiv.org/abs/2405.14608v1", "repo": "null"}}