{"2410.21216": {"publish_time": "2024-10-28", "title": "HoPE: A Novel Positional Encoding Without Long-Term Decay for Enhanced Context Awareness and Extrapolation", "paper_summary": "Many positional encodings (PEs) are designed to exhibit long-term decay,\nbased on an entrenched and long-standing inductive opinion: tokens farther away\nfrom the current position carry less relevant information. We argue that\nlong-term decay is outdated in the era of LLMs, as LLMs are now applied to\ntasks demanding precise retrieval of in-context information from arbitrary\npositions. Firstly, we present empirical analyses on various PEs, demonstrating\nthat models inherently learn attention with only a local-decay pattern while\nforming a U-shape pattern globally, contradicting the principle of long-term\ndecay. Furthermore, we conduct a detailed analysis of rotary position encoding\n(RoPE, a prevalent relative positional encoding in LLMs), and found that the\nU-shape attention is caused by some learned components, which are also the key\nfactor limiting RoPE's expressiveness and extrapolation.Inspired by these\ninsights, we propose High-frequency rotary Position Encoding (HoPE). HoPE\nreplaces the specific components in RoPE with position-independent ones,\nretaining only high-frequency signals, which also breaks the principle of\nlong-term decay in theory. HoPE achieves two major advantages: (1) Without\nconstraints imposed by long-term decay, contradictory factors that limit\nspontaneous attention optimization and model extrapolation performance are\nremoved. (2) Components representing positions and semantics are are optimized.\nThese enhances model's context awareness and extrapolation, as validated by\nextensive experiments.", "paper_summary_zh": "許多位置編碼（PE）被設計為表現出長期衰減，\n基於根深蒂固且長期的歸納觀點：距離當前位置較遠的符號傳達較不相關的資訊。我們主張\n長期衰減在 LLM 時代已經過時，因為 LLM 現在被應用於\n從任意位置精確擷取上下文資訊的任務。首先，我們對各種 PE 提出實證分析，證明\n模型在形成 U 形模式的同時，本質上只學習具有局部衰減模式的注意力，這與長期衰減的原則相矛盾。此外，我們對旋轉位置編碼（RoPE，LLM 中普遍的相對位置編碼）進行了詳細分析，發現 U 形注意力是由一些學習組成部分造成的，這些組成部分也是限制 RoPE 表現力和外推能力的關鍵因素。受到這些見解的啟發，我們提出了高頻旋轉位置編碼（HoPE）。HoPE 用與位置無關的組成部分取代 RoPE 中的特定組成部分，只保留高頻訊號，這在理論上也打破了長期衰減的原則。HoPE 獲得了兩個主要優點：（1）在不受長期衰減約束的情況下，限制自發注意力最佳化和模型外推效能的矛盾因素被消除了。（2）代表位置和語意的組成部分經過最佳化。這些增強了模型的上下文感知和外推能力，經由廣泛的實驗驗證。", "author": "Yuhan Chen et.al.", "authors": "Yuhan Chen, Ang Lv, Jian Luan, Bin Wang, Wei Liu", "id": "2410.21216v1", "paper_url": "http://arxiv.org/abs/2410.21216v1", "repo": "null"}}