{"2410.06981": {"publish_time": "2024-10-09", "title": "Sparse Autoencoders Reveal Universal Feature Spaces Across Large Language Models", "paper_summary": "We investigate feature universality in large language models (LLMs), a\nresearch field that aims to understand how different models similarly represent\nconcepts in the latent spaces of their intermediate layers. Demonstrating\nfeature universality allows discoveries about latent representations to\ngeneralize across several models. However, comparing features across LLMs is\nchallenging due to polysemanticity, in which individual neurons often\ncorrespond to multiple features rather than distinct ones. This makes it\ndifficult to disentangle and match features across different models. To address\nthis issue, we employ a method known as dictionary learning by using sparse\nautoencoders (SAEs) to transform LLM activations into more interpretable spaces\nspanned by neurons corresponding to individual features. After matching feature\nneurons across models via activation correlation, we apply representational\nspace similarity metrics like Singular Value Canonical Correlation Analysis to\nanalyze these SAE features across different LLMs. Our experiments reveal\nsignificant similarities in SAE feature spaces across various LLMs, providing\nnew evidence for feature universality.", "paper_summary_zh": "我們調查大型語言模型 (LLM) 中的特徵通用性，這是一個研究領域，旨在了解不同的模型如何在其中間層的潛在空間中以相似的方式表示概念。證明特徵通用性允許跨多個模型概括潛在表示的發現。然而，由於多義性，比較 LLM 中的特徵具有挑戰性，其中個別神經元通常對應於多個特徵，而不是不同的特徵。這使得難以解開和匹配不同模型中的特徵。為了解決這個問題，我們採用一種稱為字典學習的方法，使用稀疏自動編碼器 (SAE) 將 LLM 激活轉換為由對應於個別特徵的神經元所跨越的更具可解釋性的空間。在通過激活相關性匹配模型中的特徵神經元後，我們應用表示空間相似性度量，例如奇異值正則相關分析，以分析不同 LLM 中的這些 SAE 特徵。我們的實驗揭示了跨不同 LLM 的 SAE 特徵空間中顯著的相似性，為特徵通用性提供了新的證據。", "author": "Michael Lan et.al.", "authors": "Michael Lan, Philip Torr, Austin Meek, Ashkan Khakzar, David Krueger, Fazl Barez", "id": "2410.06981v1", "paper_url": "http://arxiv.org/abs/2410.06981v1", "repo": "null"}}