{"2410.04931": {"publish_time": "2024-10-07", "title": "The Role of Governments in Increasing Interconnected Post-Deployment Monitoring of AI", "paper_summary": "Language-based AI systems are diffusing into society, bringing positive and\nnegative impacts. Mitigating negative impacts depends on accurate impact\nassessments, drawn from an empirical evidence base that makes causal\nconnections between AI usage and impacts. Interconnected post-deployment\nmonitoring combines information about model integration and use, application\nuse, and incidents and impacts. For example, inference time monitoring of\nchain-of-thought reasoning can be combined with long-term monitoring of\nsectoral AI diffusion, impacts and incidents. Drawing on information sharing\nmechanisms in other industries, we highlight example data sources and specific\ndata points that governments could collect to inform AI risk management.", "paper_summary_zh": "以語言為基礎的人工智慧系統正擴散至社會，帶來正面與負面的影響。減輕負面影響仰賴準確的影響評估，而這些評估則來自於經驗證據基礎，並在人工智慧使用與影響之間建立因果關係。相互連結的部署後監控結合了關於模型整合與使用、應用程式使用、事件與影響的資訊。例如，對思考鏈推理的推論時間監控可以結合對產業人工智慧擴散、影響與事件的長期監控。利用其他產業的資訊分享機制，我們強調了政府可以收集的範例資料來源和特定資料點，以提供人工智慧風險管理資訊。", "author": "Merlin Stein et.al.", "authors": "Merlin Stein, Jamie Bernardi, Connor Dunlop", "id": "2410.04931v1", "paper_url": "http://arxiv.org/abs/2410.04931v1", "repo": "null"}}