{"2410.22197": {"publish_time": "2024-10-29", "title": "Class-Aware Contrastive Optimization for Imbalanced Text Classification", "paper_summary": "The unique characteristics of text data make classification tasks a complex\nproblem. Advances in unsupervised and semi-supervised learning and autoencoder\narchitectures addressed several challenges. However, they still struggle with\nimbalanced text classification tasks, a common scenario in real-world\napplications, demonstrating a tendency to produce embeddings with unfavorable\nproperties, such as class overlap. In this paper, we show that leveraging\nclass-aware contrastive optimization combined with denoising autoencoders can\nsuccessfully tackle imbalanced text classification tasks, achieving better\nperformance than the current state-of-the-art. Concretely, our proposal\ncombines reconstruction loss with contrastive class separation in the embedding\nspace, allowing a better balance between the truthfulness of the generated\nembeddings and the model's ability to separate different classes. Compared with\nan extensive set of traditional and state-of-the-art competing methods, our\nproposal demonstrates a notable increase in performance across a wide variety\nof text datasets.", "paper_summary_zh": "文本資料的獨特特性使分類任務成為一項複雜的問題。無監督和半監督學習以及自動編碼器架構的進展解決了若干挑戰。然而，它們仍然難以應付不平衡的文本分類任務，這是現實世界應用中的常見場景，表現出產生具有不利屬性的嵌入的趨勢，例如類別重疊。在本文中，我們展示了利用類別感知對比最佳化結合去噪自動編碼器可以成功應對不平衡的文本分類任務，實現比當前最先進技術更好的效能。具體而言，我們的提議將重建損失與嵌入空間中的對比類別分離相結合，在生成的嵌入的真實性與模型分離不同類別的能力之間取得更好的平衡。與廣泛的傳統和最先進的競爭方法相比，我們的提議在各種文本資料集上展示了效能的顯著提升。", "author": "Grigorii Khvatskii et.al.", "authors": "Grigorii Khvatskii, Nuno Moniz, Khoa Doan, Nitesh V Chawla", "id": "2410.22197v1", "paper_url": "http://arxiv.org/abs/2410.22197v1", "repo": "null"}}