{"2501.01031": {"publish_time": "2025-01-02", "title": "ValuesRAG: Enhancing Cultural Alignment Through Retrieval-Augmented Contextual Learning", "paper_summary": "Cultural values alignment in Large Language Models (LLMs) is a critical\nchallenge due to their tendency to embed Western-centric biases from training\ndata, leading to misrepresentations and fairness issues in cross-cultural\ncontexts. Recent approaches, such as role-assignment and few-shot learning,\noften struggle with reliable cultural alignment as they heavily rely on\npre-trained knowledge, lack scalability, and fail to capture nuanced cultural\nvalues effectively. To address these issues, we propose ValuesRAG, a novel and\neffective framework that applies Retrieval-Augmented Generation (RAG) with\nin-context learning to integrate cultural and demographic knowledge dynamically\nduring text generation. Leveraging the World Values Survey (WVS) dataset,\nValuesRAG first generates summaries of values for each individual.\nSubsequently, we curated several representative regional datasets to serve as\ntest datasets and retrieve relevant summaries of values based on demographic\nfeatures, followed by a reranking step to select the top-k relevant summaries.\nValuesRAG consistently outperforms baseline methods, both in the main\nexperiment and in the ablation study where only the values summary was\nprovided, highlighting ValuesRAG's potential to foster culturally aligned AI\nsystems and enhance the inclusivity of AI-driven applications.", "paper_summary_zh": "大型語言模型 (LLM) 中的文化價值觀一致性是一項嚴峻的挑戰，因為它們傾向於從訓練資料中嵌入以西方為中心的偏見，導致跨文化脈絡中的錯誤表述和公平性問題。最近的方法，例如角色分配和少次學習，通常難以實現可靠的文化一致性，因為它們嚴重依賴於預先訓練的知識，缺乏可擴充性，並且無法有效捕捉細微的文化價值觀。為了解決這些問題，我們提出了 ValuesRAG，這是一個新穎且有效的框架，它將檢索增強生成 (RAG) 與情境學習應用於在文本生成期間動態整合文化和人口統計知識。利用世界價值觀調查 (WVS) 資料集，ValuesRAG 首先為每個個體生成價值觀摘要。隨後，我們策劃了幾個具有代表性的區域資料集作為測試資料集，並根據人口統計特徵檢索相關的價值觀摘要，然後進行重新排序步驟以選擇前 k 個相關摘要。ValuesRAG 在主要實驗和僅提供價值觀摘要的消融研究中始終優於基準方法，這突顯了 ValuesRAG 促進文化一致的人工智慧系統和增強人工智慧驅動應用包容性的潛力。", "author": "Wonduk Seo et.al.", "authors": "Wonduk Seo, Zonghao Yuan, Yi Bu", "id": "2501.01031v1", "paper_url": "http://arxiv.org/abs/2501.01031v1", "repo": "null"}}