{"2408.10713": {"publish_time": "2024-08-20", "title": "Offline Model-Based Reinforcement Learning with Anti-Exploration", "paper_summary": "Model-based reinforcement learning (MBRL) algorithms learn a dynamics model\nfrom collected data and apply it to generate synthetic trajectories to enable\nfaster learning. This is an especially promising paradigm in offline\nreinforcement learning (RL) where data may be limited in quantity, in addition\nto being deficient in coverage and quality. Practical approaches to offline\nMBRL usually rely on ensembles of dynamics models to prevent exploitation of\nany individual model and to extract uncertainty estimates that penalize values\nin states far from the dataset support. Uncertainty estimates from ensembles\ncan vary greatly in scale, making it challenging to generalize hyperparameters\nwell across even similar tasks. In this paper, we present Morse Model-based\noffline RL (MoMo), which extends the anti-exploration paradigm found in offline\nmodel-free RL to the model-based space. We develop model-free and model-based\nvariants of MoMo and show how the model-free version can be extended to detect\nand deal with out-of-distribution (OOD) states using explicit uncertainty\nestimation without the need for large ensembles. MoMo performs offline MBRL\nusing an anti-exploration bonus to counteract value overestimation in\ncombination with a policy constraint, as well as a truncation function to\nterminate synthetic rollouts that are excessively OOD. Experimentally, we find\nthat both model-free and model-based MoMo perform well, and the latter\noutperforms prior model-based and model-free baselines on the majority of D4RL\ndatasets tested.", "paper_summary_zh": "基於模型的強化學習 (MBRL) 演算法會從收集到的資料中學習動態模型，並套用它來產生合成軌跡，以加速學習。這是一個特別有前景的範例，在離線強化學習 (RL) 中，資料的數量可能有限，而且在涵蓋範圍和品質上也可能不足。實用的離線 MBRL 方法通常依賴動態模型的集合，以防止利用任何個別模型，並提取不確定性估計值，以懲罰遠離資料集支援的狀態中的值。集合的不確定性估計值在規模上可能差異很大，這使得即使在類似的任務中也很難概括超參數。在本文中，我們提出了基於摩斯模型的離線 RL (MoMo)，它將在離線無模型 RL 中發現的反探索範例擴展到基於模型的空間。我們開發了 MoMo 的無模型和基於模型的變體，並展示了如何將無模型版本擴展到偵測和處理非分佈 (OOD) 狀態，使用明確的不確定性估計值，而無需大型集合。MoMo 使用反探索獎勵來抵消價值高估，並結合政策約束，以及一個截斷函數來終止過度 OOD 的合成滾動，以進行離線 MBRL。在實驗中，我們發現無模型和基於模型的 MoMo 表現良好，而後者在測試的大多數 D4RL 資料集上優於先前的基於模型和無模型基準。", "author": "Padmanaba Srinivasan et.al.", "authors": "Padmanaba Srinivasan, William Knottenbelt", "id": "2408.10713v1", "paper_url": "http://arxiv.org/abs/2408.10713v1", "repo": "null"}}