{"2409.10494": {"publish_time": "2024-09-16", "title": "Incorporating Classifier-Free Guidance in Diffusion Model-Based Recommendation", "paper_summary": "This paper presents a diffusion-based recommender system that incorporates\nclassifier-free guidance. Most current recommender systems provide\nrecommendations using conventional methods such as collaborative or\ncontent-based filtering. Diffusion is a new approach to generative AI that\nimproves on previous generative AI approaches such as Variational Autoencoders\n(VAEs) and Generative Adversarial Networks (GANs). We incorporate diffusion in\na recommender system that mirrors the sequence users take when browsing and\nrating items. Although a few current recommender systems incorporate diffusion,\nthey do not incorporate classifier-free guidance, a new innovation in diffusion\nmodels as a whole. In this paper, we present a diffusion recommender system\nthat augments the underlying recommender system model for improved performance\nand also incorporates classifier-free guidance. Our findings show improvements\nover state-of-the-art recommender systems for most metrics for several\nrecommendation tasks on a variety of datasets. In particular, our approach\ndemonstrates the potential to provide better recommendations when data is\nsparse.", "paper_summary_zh": "本文提出了一個基於擴散的推薦系統，它結合了無分類器引導。大多數當前推薦系統使用協同或基於內容的過濾等傳統方法提供推薦。擴散是一種生成式 AI 的新方法，它改進了先前的生成式 AI 方法，例如變異自動編碼器 (VAE) 和生成對抗網路 (GAN)。我們在推薦系統中整合了擴散，它反映了使用者在瀏覽和評分項目時的順序。儘管少數當前推薦系統整合了擴散，但它們沒有整合無分類器引導，這是擴散模型整體的一項創新。在本文中，我們提出了一個擴散推薦系統，它擴充了底層推薦系統模型以提高效能，並整合了無分類器引導。我們的研究結果顯示，在各種資料集的幾個推薦任務中，我們的發現優於大多數指標的最新推薦系統。特別是，我們的做法證明了在資料稀疏時提供更好推薦的潛力。", "author": "Noah Buchanan et.al.", "authors": "Noah Buchanan, Susan Gauch, Quan Mai", "id": "2409.10494v1", "paper_url": "http://arxiv.org/abs/2409.10494v1", "repo": "null"}}