{"2502.17390": {"publish_time": "2025-02-24", "title": "Mitigating Bias in RAG: Controlling the Embedder", "paper_summary": "In retrieval augmented generation (RAG) systems, each individual component --\nthe LLM, embedder, and corpus -- could introduce biases in the form of skews\ntowards outputting certain perspectives or identities. In this work, we study\nthe conflict between biases of each component and their relationship to the\noverall bias of the RAG system, which we call bias conflict. Examining both\ngender and political biases as case studies, we show that bias conflict can be\ncharacterized through a linear relationship among components despite its\ncomplexity in 6 different LLMs. Through comprehensive fine-tuning experiments\ncreating 120 differently biased embedders, we demonstrate how to control bias\nwhile maintaining utility and reveal the importance of reverse-biasing the\nembedder to mitigate bias in the overall system. Additionally, we find that\nLLMs and tasks exhibit varying sensitivities to the embedder bias, a crucial\nfactor to consider for debiasing. Our results underscore that a fair RAG system\ncan be better achieved by carefully controlling the bias of the embedder rather\nthan increasing its fairness.", "paper_summary_zh": "在檢索擴增生成 (RAG) 系統中，每個個別元件（LLM、嵌入器和語料庫）都可能以偏向輸出特定觀點或身分的方式引入偏見。在這項工作中，我們研究每個元件偏見之間的衝突及其與 RAG 系統整體偏見的關係，我們稱之為偏見衝突。以性別和政治偏見作為案例研究，我們證明了偏見衝突可以透過元件之間的線性關係來表徵，儘管其在 6 個不同的 LLM 中很複雜。透過全面的微調實驗，建立了 120 個不同的偏置嵌入器，我們展示了如何在維持效用的同時控制偏見，並揭示了反向偏置嵌入器以減輕整體系統偏見的重要性。此外，我們發現 LLM 和任務對嵌入器偏見表現出不同的敏感度，這是考慮去偏見的重要因素。我們的結果強調，公平的 RAG 系統可以透過仔細控制嵌入器的偏見而不是增加其公平性來更好地實現。", "author": "Taeyoun Kim et.al.", "authors": "Taeyoun Kim, Jacob Springer, Aditi Raghunathan, Maarten Sap", "id": "2502.17390v1", "paper_url": "http://arxiv.org/abs/2502.17390v1", "repo": "null"}}