{"2412.07420": {"publish_time": "2024-12-10", "title": "RAG-based Question Answering over Heterogeneous Data and Text", "paper_summary": "This article presents the QUASAR system for question answering over\nunstructured text, structured tables, and knowledge graphs, with unified\ntreatment of all sources. The system adopts a RAG-based architecture, with a\npipeline of evidence retrieval followed by answer generation, with the latter\npowered by a moderate-sized language model. Additionally and uniquely, QUASAR\nhas components for question understanding, to derive crisper input for evidence\nretrieval, and for re-ranking and filtering the retrieved evidence before\nfeeding the most informative pieces into the answer generation. Experiments\nwith three different benchmarks demonstrate the high answering quality of our\napproach, being on par with or better than large GPT models, while keeping the\ncomputational cost and energy consumption orders of magnitude lower.", "paper_summary_zh": "本文介紹 QUASAR 系統，用於回答非結構化文字、結構化表格和知識圖表中的問題，並統一處理所有來源。該系統採用基於 RAG 的架構，管道包括證據檢索後接答案生成，後者由中等規模的語言模型提供支援。此外，QUASAR 獨特地包含問題理解元件，以衍生更清晰的輸入進行證據檢索，以及在將最有資訊的片段輸入答案生成之前重新排序和過濾檢索到的證據。使用三個不同的基準進行的實驗證明了我們方法的高回答品質，與大型 GPT 模型相當或更好，同時將運算成本和能源消耗降低了幾個數量級。", "author": "Philipp Christmann et.al.", "authors": "Philipp Christmann, Gerhard Weikum", "id": "2412.07420v1", "paper_url": "http://arxiv.org/abs/2412.07420v1", "repo": "null"}}