{"2501.14174": {"publish_time": "2025-01-24", "title": "Dreamweaver: Learning Compositional World Representations from Pixels", "paper_summary": "Humans have an innate ability to decompose their perceptions of the world\ninto objects and their attributes, such as colors, shapes, and movement\npatterns. This cognitive process enables us to imagine novel futures by\nrecombining familiar concepts. However, replicating this ability in artificial\nintelligence systems has proven challenging, particularly when it comes to\nmodeling videos into compositional concepts and generating unseen, recomposed\nfutures without relying on auxiliary data, such as text, masks, or bounding\nboxes. In this paper, we propose Dreamweaver, a neural architecture designed to\ndiscover hierarchical and compositional representations from raw videos and\ngenerate compositional future simulations. Our approach leverages a novel\nRecurrent Block-Slot Unit (RBSU) to decompose videos into their constituent\nobjects and attributes. In addition, Dreamweaver uses a multi-future-frame\nprediction objective to capture disentangled representations for dynamic\nconcepts more effectively as well as static concepts. In experiments, we\ndemonstrate our model outperforms current state-of-the-art baselines for world\nmodeling when evaluated under the DCI framework across multiple datasets.\nFurthermore, we show how the modularized concept representations of our model\nenable compositional imagination, allowing the generation of novel videos by\nrecombining attributes from different objects.", "paper_summary_zh": "人類具有將他們對世界的感知分解成物件及其屬性（例如顏色、形狀和運動模式）的先天能力。這個認知過程讓我們能夠透過重新組合熟悉的概念來想像新穎的未來。然而，在人工智慧系統中複製這種能力已被證明具有挑戰性，特別是在將影片建模成組合概念並產生未見過的、重新組合的未來時，且不依賴輔助資料，例如文字、遮罩或邊界框。在本文中，我們提出了 Dreamweaver，一種神經架構，旨在從原始影片中發現階層式和組合式表示，並產生組合式未來模擬。我們的做法利用一種新穎的遞迴區塊槽單元 (RBSU) 將影片分解成其組成物件和屬性。此外，Dreamweaver 使用多未來幀預測目標，以更有效地擷取動態概念和靜態概念的解糾纏表示。在實驗中，我們證明了我們的模型在多個資料集上根據 DCI 架構評估時，優於當前世界建模技術的最新基準。此外，我們展示了我們模型的模組化概念表示如何啟用組合式想像力，允許透過重新組合來自不同物件的屬性來產生新穎的影片。", "author": "Junyeob Baek et.al.", "authors": "Junyeob Baek, Yi-Fu Wu, Gautam Singh, Sungjin Ahn", "id": "2501.14174v1", "paper_url": "http://arxiv.org/abs/2501.14174v1", "repo": "null"}}