{"2407.02961": {"publish_time": "2024-07-03", "title": "Towards a Scalable Reference-Free Evaluation of Generative Models", "paper_summary": "While standard evaluation scores for generative models are mostly\nreference-based, a reference-dependent assessment of generative models could be\ngenerally difficult due to the unavailability of applicable reference datasets.\nRecently, the reference-free entropy scores, VENDI and RKE, have been proposed\nto evaluate the diversity of generated data. However, estimating these scores\nfrom data leads to significant computational costs for large-scale generative\nmodels. In this work, we leverage the random Fourier features framework to\nreduce the computational price and propose the Fourier-based Kernel Entropy\nApproximation (FKEA) method. We utilize FKEA's approximated eigenspectrum of\nthe kernel matrix to efficiently estimate the mentioned entropy scores.\nFurthermore, we show the application of FKEA's proxy eigenvectors to reveal the\nmethod's identified modes in evaluating the diversity of produced samples. We\nprovide a stochastic implementation of the FKEA assessment algorithm with a\ncomplexity $O(n)$ linearly growing with sample size $n$. We extensively\nevaluate FKEA's numerical performance in application to standard image, text,\nand video datasets. Our empirical results indicate the method's scalability and\ninterpretability applied to large-scale generative models. The codebase is\navailable at https://github.com/aziksh-ospanov/FKEA.", "paper_summary_zh": "儘管生成模型的標準評估分數大多是\n基於參考的，但由於沒有適用的參考資料集，因此生成模型的參考依賴性評估通常很困難。\n最近，已經提出無參考熵分數 VENDI 和 RKE\n來評估生成資料的多樣性。然而，從資料中估計這些分數會導致大規模生成\n模型的顯著計算成本。在這項工作中，我們利用隨機傅立葉特徵架構來\n降低計算成本，並提出基於傅立葉的核熵近似 (FKEA) 方法。我們利用 FKEA 的核矩陣近似特徵譜來有效估計所提到的熵分數。\n此外，我們展示了 FKEA 的代理特徵向量的應用，以揭示\n該方法在評估產生樣本的多樣性時識別出的模式。我們提供 FKEA 評估演算法的隨機實作，其\n複雜度 $O(n)$ 隨樣本大小 $n$ 線性增長。我們廣泛\n評估 FKEA 在應用於標準影像、文字\n和影片資料集中的數值效能。我們的實證結果表明該方法的可擴充性和\n可解釋性適用於大規模生成模型。程式碼庫可在 https://github.com/aziksh-ospanov/FKEA 取得。", "author": "Azim Ospanov et.al.", "authors": "Azim Ospanov, Jingwei Zhang, Mohammad Jalali, Xuenan Cao, Andrej Bogdanov, Farzan Farnia", "id": "2407.02961v1", "paper_url": "http://arxiv.org/abs/2407.02961v1", "repo": "https://github.com/aziksh-ospanov/fkea"}}