{"2405.20304": {"publish_time": "2024-05-30", "title": "Group Robust Preference Optimization in Reward-free RLHF", "paper_summary": "Adapting large language models (LLMs) for specific tasks usually involves\nfine-tuning through reinforcement learning with human feedback (RLHF) on\npreference data. While these data often come from diverse labelers' groups\n(e.g., different demographics, ethnicities, company teams, etc.), traditional\nRLHF approaches adopt a \"one-size-fits-all\" approach, i.e., they\nindiscriminately assume and optimize a single preference model, thus not being\nrobust to unique characteristics and needs of the various groups. To address\nthis limitation, we propose a novel Group Robust Preference Optimization (GRPO)\nmethod to align LLMs to individual groups' preferences robustly. Our approach\nbuilds upon reward-free direct preference optimization methods, but unlike\nprevious approaches, it seeks a robust policy which maximizes the worst-case\ngroup performance. To achieve this, GRPO adaptively and sequentially weights\nthe importance of different groups, prioritizing groups with worse cumulative\nloss. We theoretically study the feasibility of GRPO and analyze its\nconvergence for the log-linear policy class. By fine-tuning LLMs with GRPO\nusing diverse group-based global opinion data, we significantly improved\nperformance for the worst-performing groups, reduced loss imbalances across\ngroups, and improved probability accuracies compared to non-robust baselines.", "paper_summary_zh": "調整大型語言模型（LLM）以執行特定任務通常涉及透過人類回饋（RLHF）進行強化學習微調，並使用偏好資料。雖然這些資料通常來自不同的標籤群組（例如，不同的人口統計、種族、公司團隊等），但傳統 RLHF 方法採用「一體適用」方法，亦即它們不加區別地假設並最佳化單一偏好模型，因此無法針對不同群組的獨特特性和需求保持穩健性。為了解決這個限制，我們提出了一種新穎的群組穩健偏好最佳化（GRPO）方法，以穩健地將 LLM 與個別群組的偏好對齊。我們的做法建立在無獎勵的直接偏好最佳化方法之上，但與先前的做法不同，它尋求一種穩健的政策，以最大化最差情況的群組效能。為了達成此目標，GRPO 會適應性地、依序地加權不同群組的重要性，優先處理累積損失較差的群組。我們從理論上探討 GRPO 的可行性，並分析其對數線性政策類別的收斂性。透過使用 GRPO 微調 LLM，並使用基於群組的多樣化全球意見資料，我們大幅改善了表現最差的群組的效能，減少了群組間的損失失衡，並與非穩健基線相比，改善了機率準確度。", "author": "Shyam Sundhar Ramesh et.al.", "authors": "Shyam Sundhar Ramesh, Yifan Hu, Iason Chaimalas, Viraj Mehta, Pier Giuseppe Sessa, Haitham Bou Ammar, Ilija Bogunovic", "id": "2405.20304v1", "paper_url": "http://arxiv.org/abs/2405.20304v1", "repo": "null"}}