{"2411.04928": {"publish_time": "2024-11-07", "title": "DimensionX: Create Any 3D and 4D Scenes from a Single Image with Controllable Video Diffusion", "paper_summary": "In this paper, we introduce \\textbf{DimensionX}, a framework designed to\ngenerate photorealistic 3D and 4D scenes from just a single image with video\ndiffusion. Our approach begins with the insight that both the spatial structure\nof a 3D scene and the temporal evolution of a 4D scene can be effectively\nrepresented through sequences of video frames. While recent video diffusion\nmodels have shown remarkable success in producing vivid visuals, they face\nlimitations in directly recovering 3D/4D scenes due to limited spatial and\ntemporal controllability during generation. To overcome this, we propose\nST-Director, which decouples spatial and temporal factors in video diffusion by\nlearning dimension-aware LoRAs from dimension-variant data. This controllable\nvideo diffusion approach enables precise manipulation of spatial structure and\ntemporal dynamics, allowing us to reconstruct both 3D and 4D representations\nfrom sequential frames with the combination of spatial and temporal dimensions.\nAdditionally, to bridge the gap between generated videos and real-world scenes,\nwe introduce a trajectory-aware mechanism for 3D generation and an\nidentity-preserving denoising strategy for 4D generation. Extensive experiments\non various real-world and synthetic datasets demonstrate that DimensionX\nachieves superior results in controllable video generation, as well as in 3D\nand 4D scene generation, compared with previous methods.", "paper_summary_zh": "<paragraph>在本文中，我們介紹了 DimensionX，一個旨在僅使用影片擴散從單一影像生成逼真的 3D 和 4D 場景的架構。我們的做法始於這樣的見解：3D 場景的空間結構和 4D 場景的時間演變都可以透過影片畫面的序列有效地呈現。雖然最近的影片擴散模型在產生生動視覺效果方面展現了顯著的成功，但由於生成過程中受限的空間和時間可控性，它們在直接還原 3D/4D 場景方面面臨限制。為了克服這個問題，我們提出了 ST-Director，它透過從維度變異資料學習具有維度感知能力的 LoRA，將影片擴散中的空間和時間因素解耦。這種可控的影片擴散方法能精確地操作空間結構和時間動態，讓我們能夠從連續畫面的空間和時間維度組合中重建 3D 和 4D 表徵。此外，為了彌合生成的影片和真實場景之間的差距，我們引入了用於 3D 生成的軌跡感知機制和用於 4D 生成的身份保留去噪策略。在各種真實世界和合成資料集上的廣泛實驗證明，與先前的技術相比，DimensionX 在可控影片生成以及 3D 和 4D 場景生成方面都取得了卓越的成果。</paragraph>", "author": "Wenqiang Sun et.al.", "authors": "Wenqiang Sun, Shuo Chen, Fangfu Liu, Zilong Chen, Yueqi Duan, Jun Zhang, Yikai Wang", "id": "2411.04928v1", "paper_url": "http://arxiv.org/abs/2411.04928v1", "repo": "null"}}