{"2405.14446": {"publish_time": "2024-05-23", "title": "Worldwide Federated Training of Language Models", "paper_summary": "The reliance of language model training on massive amounts of computation and\nvast datasets scraped from potentially low-quality, copyrighted, or sensitive\ndata has come into question practically, legally, and ethically. Federated\nlearning provides a plausible alternative by enabling previously untapped data\nto be voluntarily gathered from collaborating organizations. However, when\nscaled globally, federated learning requires collaboration across heterogeneous\nlegal, security, and privacy regimes while accounting for the inherent locality\nof language data; this further exacerbates the established challenge of\nfederated statistical heterogeneity. We propose a Worldwide Federated Language\nModel Training~(WorldLM) system based on federations of federations, where each\nfederation has the autonomy to account for factors such as its industry,\noperating jurisdiction, or competitive environment. WorldLM enables such\nautonomy in the presence of statistical heterogeneity via partial model\nlocalization by allowing sub-federations to attentively aggregate key layers\nfrom their constituents. Furthermore, it can adaptively share information\nacross federations via residual layer embeddings. Evaluations of language\nmodeling on naturally heterogeneous datasets show that WorldLM outperforms\nstandard federations by up to $1.91\\times$, approaches the personalized\nperformance of fully local models, and maintains these advantages under\nprivacy-enhancing techniques.", "paper_summary_zh": "語言模型訓練仰賴大量運算和從潛在低品質、受版權保護或敏感資料中擷取的龐大資料集，這在實務、法律和倫理上都受到質疑。聯合學習提供了一個可行的替代方案，讓先前未開發的資料能夠從合作組織自願收集。然而，當聯合學習擴展到全球時，需要在異質的法律、安全和隱私制度中進行合作，同時考量語言資料的內在區域性；這進一步加劇了聯合統計異質性的既有挑戰。我們提出了一個基於聯合聯合的全球聯合語言模型訓練 (WorldLM) 系統，其中每個聯合都有自主權來考量其產業、運作管轄權或競爭環境等因素。WorldLM 透過部分模型在地化，讓子聯合專注於聚合其組成部分中的關鍵層，在存在統計異質性的情況下實現這種自主性。此外，它可以透過殘差層嵌入式適應性地在聯合之間分享資訊。在自然異質資料集上進行的語言建模評估顯示，WorldLM 的表現優於標準聯合，最高達 1.91 倍，接近完全在地化模型的個人化表現，並在隱私增強技術下維持這些優勢。", "author": "Alex Iacob et.al.", "authors": "Alex Iacob, Lorenzo Sani, Bill Marino, Preslav Aleksandrov, Nicholas Donald Lane", "id": "2405.14446v1", "paper_url": "http://arxiv.org/abs/2405.14446v1", "repo": "null"}}