{"2406.08842": {"publish_time": "2024-06-13", "title": "ContraSolver: Self-Alignment of Language Models by Resolving Internal Preference Contradictions", "paper_summary": "While substantial advancements have been made in developing large language\nmodels (LLMs), achieving control over their behavior can be difficult. Direct\npreference optimization (DPO) assumes the existence of a latent reward function\nto evaluate the responses of LLMs. This assumption indicates a strict\npreference ordering of different responses to the same input. However, there\nalways exist contradictions of preference in LLMs according to our experimental\nobservations. In this paper, we construct a graph structure of the preference\nrelationship among different responses with self-annotation to find\ncontradictions in the preference order. We propose ContraSolver, an algorithm\nthat traverses all edges on the preference graph to identify those that might\ncause contradictions. ContraSolver initializes the graph with a maximum\nspanning tree and identifies contradictory edges, prioritizing the resolution\nof low-confidence preferences while preserving high-confidence ones.\nExperimental results on four different generation tasks show that the\nperformance of different LLMs can be largely improved through our completely\nunsupervised self-alignment. Furthermore, by analyzing the preference graphs of\nLLMs with and without self-alignment by ContraSolver, we quantify the reduction\nin contradictions, suggesting that resolving preference contradictions is\ncrucial for achieving better alignment performance.", "paper_summary_zh": "儘管在開發大型語言模型 (LLM) 方面已經取得實質性進展，但要控制其行為可能會很困難。直接偏好最佳化 (DPO) 假設存在一個潛在的獎勵函數來評估 LLM 的回應。此假設表示對相同輸入的不同回應有嚴格的偏好排序。然而，根據我們的實驗觀察，在 LLM 中始終存在偏好的矛盾。在本文中，我們構建了一個偏好關係圖，其中包含不同回應的自我註解，以找出偏好順序中的矛盾。我們提出 ContraSolver，這是一種演算法，用於遍歷偏好圖上的所有邊緣，以找出可能導致矛盾的邊緣。ContraSolver 使用最大生成樹初始化圖形，並找出矛盾的邊緣，優先解決低信心的偏好，同時保留高信心的偏好。在四項不同的生成任務上的實驗結果顯示，透過我們完全無監督的自對齊，可以大幅改善不同 LLM 的效能。此外，透過分析使用 ContraSolver 進行自對齊和未進行自對齊的 LLM 的偏好圖，我們量化了矛盾的減少，這表示解決偏好矛盾對於達成更好的對齊效能至關重要。", "author": "Xu Zhang et.al.", "authors": "Xu Zhang, Xunjian Yin, Xiaojun Wan", "id": "2406.08842v1", "paper_url": "http://arxiv.org/abs/2406.08842v1", "repo": "null"}}