{"2407.08249": {"publish_time": "2024-07-11", "title": "GeNet: A Multimodal LLM-Based Co-Pilot for Network Topology and Configuration", "paper_summary": "Communication network engineering in enterprise environments is traditionally\na complex, time-consuming, and error-prone manual process. Most research on\nnetwork engineering automation has concentrated on configuration synthesis,\noften overlooking changes in the physical network topology. This paper\nintroduces GeNet, a multimodal co-pilot for enterprise network engineers. GeNet\nis a novel framework that leverages a large language model (LLM) to streamline\nnetwork design workflows. It uses visual and textual modalities to interpret\nand update network topologies and device configurations based on user intents.\nGeNet was evaluated on enterprise network scenarios adapted from Cisco\ncertification exercises. Our results demonstrate GeNet's ability to interpret\nnetwork topology images accurately, potentially reducing network engineers'\nefforts and accelerating network design processes in enterprise environments.\nFurthermore, we show the importance of precise topology understanding when\nhandling intents that require modifications to the network's topology.", "paper_summary_zh": "企業環境中的通訊網路工程傳統上是一個複雜、耗時且容易出錯的手動程序。大多數關於網路工程自動化的研究都集中在組態合成，常常忽略實體網路拓撲的變動。本文介紹 GeNet，一個針對企業網路工程師的多模態副駕駛。GeNet 是一個新穎的架構，利用大型語言模型 (LLM) 來簡化網路設計工作流程。它使用視覺和文字模式來根據使用者的意圖，解釋和更新網路拓撲和裝置組態。GeNet 在改編自思科認證練習的企業網路場景中進行評估。我們的結果證明了 GeNet 準確解釋網路拓撲影像的能力，這有可能減少網路工程師的負擔，並加速企業環境中的網路設計程序。此外，我們展示了在處理需要修改網路拓撲的意圖時，精確了解拓撲的重要性。", "author": "Beni Ifland et.al.", "authors": "Beni Ifland, Elad Duani, Rubin Krief, Miro Ohana, Aviram Zilberman, Andres Murillo, Ofir Manor, Ortal Lavi, Hikichi Kenji, Asaf Shabtai, Yuval Elovici, Rami Puzis", "id": "2407.08249v1", "paper_url": "http://arxiv.org/abs/2407.08249v1", "repo": "null"}}