{"2408.13054": {"publish_time": "2024-08-23", "title": "cc-DRL: a Convex Combined Deep Reinforcement Learning Flight Control Design for a Morphing Quadrotor", "paper_summary": "In comparison to common quadrotors, the shape change of morphing quadrotors\nendows it with a more better flight performance but also results in more\ncomplex flight dynamics. Generally, it is extremely difficult or even\nimpossible for morphing quadrotors to establish an accurate mathematical model\ndescribing their complex flight dynamics. To figure out the issue of flight\ncontrol design for morphing quadrotors, this paper resorts to a combination of\nmodel-free control techniques (e.g., deep reinforcement learning, DRL) and\nconvex combination (CC) technique, and proposes a convex-combined-DRL (cc-DRL)\nflight control algorithm for position and attitude of a class of morphing\nquadrotors, where the shape change is realized by the length variation of four\narm rods. In the proposed cc-DRL flight control algorithm, proximal policy\noptimization algorithm that is a model-free DRL algorithm is utilized to\noff-line train the corresponding optimal flight control laws for some selected\nrepresentative arm length modes and hereby a cc-DRL flight control scheme is\nconstructed by the convex combination technique. Finally, simulation results\nare presented to show the effectiveness and merit of the proposed flight\ncontrol algorithm.", "paper_summary_zh": "與一般的四旋翼機相比，變形四旋翼機的形狀變化賦予它更好的飛行性能，但也導致更複雜的飛行力學。一般來說，要為變形四旋翼機建立一個準確的數學模型來描述其複雜的飛行力學極其困難，甚至是不可能的。為了解決變形四旋翼機的飛行控制設計問題，本文採用模型無關控制技術（例如深度強化學習，DRL）和凸組合（CC）技術相結合的方法，並提出了一種凸組合深度強化學習（cc-DRL）飛行控制演算法，用於控制一類變形四旋翼機的位置和姿態，其中形狀變化是由四個臂桿長度的變化來實現的。在所提出的 cc-DRL 飛行控制演算法中，採用近端策略優化演算法（一種模型無關的 DRL 演算法）來離線訓練一些選定的代表性臂長模式對應的最優飛行控制律，並由此通過凸組合技術構造一個 cc-DRL 飛行控制方案。最後，給出模擬結果以展示所提出的飛行控制演算法的有效性和優點。", "author": "Tao Yang et.al.", "authors": "Tao Yang, Huai-Ning Wu, Jun-Wei Wang", "id": "2408.13054v1", "paper_url": "http://arxiv.org/abs/2408.13054v1", "repo": "null"}}