{"2405.10608": {"publish_time": "2024-05-17", "title": "ECATS: Explainable-by-design concept-based anomaly detection for time series", "paper_summary": "Deep learning methods for time series have already reached excellent\nperformances in both prediction and classification tasks, including anomaly\ndetection. However, the complexity inherent in Cyber Physical Systems (CPS)\ncreates a challenge when it comes to explainability methods. To overcome this\ninherent lack of interpretability, we propose ECATS, a concept-based\nneuro-symbolic architecture where concepts are represented as Signal Temporal\nLogic (STL) formulae. Leveraging kernel-based methods for STL, concept\nembeddings are learnt in an unsupervised manner through a cross-attention\nmechanism. The network makes class predictions through these concept\nembeddings, allowing for a meaningful explanation to be naturally extracted for\neach input. Our preliminary experiments with a simple CPS-based dataset show\nthat our model is able to achieve great classification performance while\nensuring local interpretability.", "paper_summary_zh": "深度學習方法在時間序列預測和分類任務中已經取得了極好的表現，包括異常偵測。然而，網路物理系統 (CPS) 固有的複雜性在可解釋性方法方面產生了挑戰。為了克服這種固有的不可解釋性，我們提出了 ECATS，一種基於概念的神經符號架構，其中概念表示為信號時序邏輯 (STL) 公式。利用基於核心的 STL 方法，概念嵌入是透過交叉注意機制以無監督的方式學習的。網路透過這些概念嵌入進行類別預測，允許為每個輸入自然地提取有意義的解釋。我們使用一個簡單的基於 CPS 的資料集進行的初步實驗表明，我們的模型能夠在確保局部可解釋性的同時實現良好的分類效能。", "author": "Irene Ferfoglia et.al.", "authors": "Irene Ferfoglia, Gaia Saveri, Laura Nenzi, Luca Bortolussi", "id": "2405.10608v1", "paper_url": "http://arxiv.org/abs/2405.10608v1", "repo": "null"}}