{"2504.07901": {"publish_time": "2025-04-10", "title": "Redefining Machine Translation on Social Network Services with Large Language Models", "paper_summary": "The globalization of social interactions has heightened the need for machine\ntranslation (MT) on Social Network Services (SNS), yet traditional models\nstruggle with culturally nuanced content like memes, slang, and pop culture\nreferences. While large language models (LLMs) have advanced general-purpose\ntranslation, their performance on SNS-specific content remains limited due to\ninsufficient specialized training data and evaluation benchmarks. This paper\nintroduces RedTrans, a 72B LLM tailored for SNS translation, trained on a novel\ndataset developed through three innovations: (1) Supervised Finetuning with\nDual-LLM Back-Translation Sampling, an unsupervised sampling method using\nLLM-based back-translation to select diverse data for large-scale finetuning;\n(2) Rewritten Preference Optimization (RePO), an algorithm that identifies and\ncorrects erroneous preference pairs through expert annotation, building\nreliable preference corpora; and (3) RedTrans-Bench, the first benchmark for\nSNS translation, evaluating phenomena like humor localization, emoji semantics,\nand meme adaptation. Experiments show RedTrans outperforms state-of-the-art\nLLMs. Besides, RedTrans has already been deployed in a real-world production\nenvironment, demonstrating that domain-specific adaptation, effectively bridges\nthe gap between generic and culturally grounded translation systems.", "paper_summary_zh": "社群互動的全球化提升了社群網路服務 (SNS) 對機器翻譯 (MT) 的需求，但傳統模型難以處理具有文化細微差別的內容，例如迷因、俚語和流行文化引用。雖然大型語言模型 (LLM) 提升了通用翻譯的水平，但由於缺乏專門的訓練數據和評估基準，它們在 SNS 特定內容上的表現仍然有限。本文介紹 RedTrans，一個專為 SNS 翻譯量身打造的 72B LLM，它基於一個透過三項創新開發的新穎數據集進行訓練：(1) 使用雙 LLM 反向翻譯採樣的監督式微調，這是一種無監督採樣方法，使用基於 LLM 的反向翻譯來選擇用於大規模微調的多樣化數據；(2) 重寫偏好優化 (RePO)，一種透過專家註釋識別和糾正錯誤偏好對的演算法，用於構建可靠的偏好語料庫；以及 (3) RedTrans-Bench，第一個用於 SNS 翻譯的基準測試，評估幽默在地化、表情符號語義和迷因改編等現象。實驗表明，RedTrans 的表現優於最先進的 LLM。此外，RedTrans 已經部署在真實世界的生產環境中，證明特定領域的調整有效地彌合了通用翻譯系統和文化基礎翻譯系統之間的差距。\n", "author": "Hongcheng Guo et.al.", "authors": "Hongcheng Guo, Fei Zhao, Shaosheng Cao, Xinze Lyu, Ziyan Liu, Yue Wang, Boyang Wang, Zhoujun Li, Chonggang Lu, Zhe Xu, Yao Hu", "id": "2504.07901v1", "paper_url": "http://arxiv.org/abs/2504.07901v1", "repo": "null"}}