{"2410.24116": {"publish_time": "2024-10-31", "title": "AIDOVECL: AI-generated Dataset of Outpainted Vehicles for Eye-level Classification and Localization", "paper_summary": "Image labeling is a critical bottleneck in the development of computer vision\ntechnologies, often constraining the potential of machine learning models due\nto the time-intensive nature of manual annotations. This work introduces a\nnovel approach that leverages outpainting to address the problem of annotated\ndata scarcity by generating artificial contexts and annotations, significantly\nreducing manual labeling efforts. We apply this technique to a particularly\nacute challenge in autonomous driving, urban planning, and environmental\nmonitoring: the lack of diverse, eye-level vehicle images in desired classes.\nOur dataset comprises AI-generated vehicle images obtained by detecting and\ncropping vehicles from manually selected seed images, which are then outpainted\nonto larger canvases to simulate varied real-world conditions. The outpainted\nimages include detailed annotations, providing high-quality ground truth data.\nAdvanced outpainting techniques and image quality assessments ensure visual\nfidelity and contextual relevance. Augmentation with outpainted vehicles\nimproves overall performance metrics by up to 8\\% and enhances prediction of\nunderrepresented classes by up to 20\\%. This approach, exemplifying outpainting\nas a self-annotating paradigm, presents a solution that enhances dataset\nversatility across multiple domains of machine learning. The code and links to\ndatasets used in this study are available for further research and replication\nat https://github.com/amir-kazemi/aidovecl.", "paper_summary_zh": "影像標籤是電腦視覺技術發展中的關鍵瓶頸，由於手動標記的耗時性質，經常限制了機器學習模型的潛力。這項工作介紹了一種新穎的方法，利用 outpainting 來解決標記資料短缺的問題，透過產生人工背景和標記，大幅減少手動標籤工作。我們將此技術應用於自動駕駛、都市規劃和環境監控中一個特別嚴峻的挑戰：缺乏所需類別的多元化、與視線齊平的車輛影像。我們的資料集包含了 AI 生成的車輛影像，透過從手動選擇的種子影像中偵測和裁剪車輛而取得，然後將其 outpaint 到更大的畫布上，以模擬多變的真實世界條件。outpaint 的影像包含詳細標記，提供高品質的真實數據。進階的 outpaint 技術和影像品質評估確保了視覺保真度和背景相關性。使用 outpaint 車輛進行擴充，將整體效能指標提升了 8%，並將欠代表類別的預測值提升了 20%。這種方法以 outpaint 為自標記範例，提出了一個解決方案，可以提升機器學習中多個領域的資料集多樣性。本研究中使用的程式碼和資料集連結可於 https://github.com/amir-kazemi/aidovecl 取得，以供進一步研究和複製。", "author": "Amir Kazemi et.al.", "authors": "Amir Kazemi, Qurat ul ain Fatima, Volodymyr Kindratenko, Christopher Tessum", "id": "2410.24116v1", "paper_url": "http://arxiv.org/abs/2410.24116v1", "repo": "null"}}