{"2407.08279": {"publish_time": "2024-07-11", "title": "Continually Learn to Map Visual Concepts to Large Language Models in Resource-constrained Environments", "paper_summary": "Learning continually from a stream of non-i.i.d. data is an open challenge in\ndeep learning, even more so when working in resource-constrained environments\nsuch as embedded devices. Visual models that are continually updated through\nsupervised learning are often prone to overfitting, catastrophic forgetting,\nand biased representations. On the other hand, large language models contain\nknowledge about multiple concepts and their relations, which can foster a more\nrobust, informed and coherent learning process. This work proposes Continual\nVisual Mapping (CVM), an approach that continually ground vision\nrepresentations to a knowledge space extracted from a fixed Language model.\nSpecifically, CVM continually trains a small and efficient visual model to map\nits representations into a conceptual space established by a fixed Large\nLanguage Model. Due to their smaller nature, CVM can be used when directly\nadapting large visual pre-trained models is unfeasible due to computational or\ndata constraints. CVM overcome state-of-the-art continual learning methods on\nfive benchmarks and offers a promising avenue for addressing generalization\ncapabilities in continual learning, even in computationally constrained\ndevices.", "paper_summary_zh": "從非獨立同分布資料串流中持續學習是深度學習的一項公開挑戰，尤其是在資源受限的環境中工作時，例如嵌入式裝置。透過監督式學習持續更新的視覺模型通常容易過度擬合、災難性遺忘和有偏差的表示。另一方面，大型語言模型包含了關於多個概念及其關係的知識，這可以促進更強大、更豐富且更一致的學習過程。這項工作提出了持續視覺對應 (CVM)，一種方法是持續將視覺表示基礎於從固定語言模型中提取的知識空間。具體來說，CVM 持續訓練一個小型且高效的視覺模型，將其表示對應到由固定大型語言模型建立的概念空間中。由於其較小的特性，當由於運算或資料限制而無法直接調整大型視覺預訓練模型時，可以使用 CVM。CVM 在五個基準上克服了最先進的持續學習方法，並為解決持續學習中的概化能力提供了一個有前途的途徑，即使在運算受限的裝置上也是如此。", "author": "Clea Rebillard et.al.", "authors": "Clea Rebillard, Julio Hurtado, Andrii Krutsylo, Lucia Passaro, Vincenzo Lomonaco", "id": "2407.08279v1", "paper_url": "http://arxiv.org/abs/2407.08279v1", "repo": "null"}}