{"2412.14566": {"publish_time": "2024-12-19", "title": "AIArena: A Blockchain-Based Decentralized AI Training Platform", "paper_summary": "The rapid advancement of AI has underscored critical challenges in its\ndevelopment and implementation, largely due to centralized control by a few\nmajor corporations. This concentration of power intensifies biases within AI\nmodels, resulting from inadequate governance and oversight mechanisms.\nAdditionally, it limits public involvement and heightens concerns about the\nintegrity of model generation. Such monopolistic control over data and AI\noutputs threatens both innovation and fair data usage, as users inadvertently\ncontribute data that primarily benefits these corporations. In this work, we\npropose AIArena, a blockchain-based decentralized AI training platform designed\nto democratize AI development and alignment through on-chain incentive\nmechanisms. AIArena fosters an open and collaborative environment where\nparticipants can contribute models and computing resources. Its on-chain\nconsensus mechanism ensures fair rewards for participants based on their\ncontributions. We instantiate and implement AIArena on the public Base\nblockchain Sepolia testnet, and the evaluation results demonstrate the\nfeasibility of AIArena in real-world applications.", "paper_summary_zh": "人工智能的快速發展突顯了其開發和實作中的重大挑戰，這在很大程度上是由于少數大型企業的集中控制所致。這種權力集中加劇了人工智能模型中的偏見，這是由於治理和監督機制不足所致。此外，它限制了公眾參與，並加劇了對模型生成完整性的擔憂。這種對數據和人工智能輸出的壟斷控制威脅到創新和公平的數據使用，因為用戶無意中貢獻了主要使這些公司受益的數據。在這項工作中，我們提出了 AIArena，這是一個基於區塊鏈的去中心化人工智能訓練平台，旨在通過鏈上激勵機制實現人工智能開發和對齊的民主化。AIArena 培養了一個開放且協作的環境，參與者可以在其中貢獻模型和計算資源。其鏈上共識機制根據參與者的貢獻確保了公平的獎勵。我們在公共 Base 區塊鏈 Sepolia 測試網上實例化並實施了 AIArena，評估結果證明了 AIArena 在實際應用中的可行性。", "author": "Zhipeng Wang et.al.", "authors": "Zhipeng Wang, Rui Sun, Elizabeth Lui, Tuo Zhou, Yizhe Wen, Jiahao Sun", "id": "2412.14566v1", "paper_url": "http://arxiv.org/abs/2412.14566v1", "repo": "null"}}