{"2410.09252": {"publish_time": "2024-10-11", "title": "ReasonPlanner: Enhancing Autonomous Planning in Dynamic Environments with Temporal Knowledge Graphs and LLMs", "paper_summary": "Planning and performing interactive tasks, such as conducting experiments to\ndetermine the melting point of an unknown substance, is straightforward for\nhumans but poses significant challenges for autonomous agents. We introduce\nReasonPlanner, a novel generalist agent designed for reflective thinking,\nplanning, and interactive reasoning. This agent leverages LLMs to plan\nhypothetical trajectories by building a World Model based on a Temporal\nKnowledge Graph. The agent interacts with the environment using a natural\nlanguage actor-critic module, where the actor translates the imagined\ntrajectory into a sequence of actionable steps, and the critic determines if\nreplanning is necessary. ReasonPlanner significantly outperforms previous\nstate-of-the-art prompting-based methods on the ScienceWorld benchmark by more\nthan 1.8 times, while being more sample-efficient and interpretable. It relies\nsolely on frozen weights thus requiring no gradient updates. ReasonPlanner can\nbe deployed and utilized without specialized knowledge of Machine Learning,\nmaking it accessible to a wide range of users.", "paper_summary_zh": "規劃和執行互動任務，例如進行實驗以確定未知物質的熔點，對人類來說很簡單，但對自主代理來說卻構成重大挑戰。我們引入了 ReasonPlanner，這是一個新穎的通才代理，專門用於反思性思考、規劃和互動推理。此代理利用 LLM 透過建立基於時序知識圖表的 World Model 來規劃假設性軌跡。代理使用自然語言的動作-評論模組與環境互動，其中動作將想像的軌跡轉換為一系列可操作的步驟，而評論則確定是否需要重新規劃。ReasonPlanner 在 ScienceWorld 基準上大幅優於先前的最先進提示式方法，優於 1.8 倍，同時更具樣本效率和可解釋性。它僅依賴凍結權重，因此不需要梯度更新。ReasonPlanner 可以部署和使用，而無需機器學習的專業知識，讓廣泛的使用者都能使用。", "author": "Minh Pham Dinh et.al.", "authors": "Minh Pham Dinh, Munira Syed, Michael G Yankoski, Trenton W. Ford", "id": "2410.09252v1", "paper_url": "http://arxiv.org/abs/2410.09252v1", "repo": "null"}}