{"2407.05434": {"publish_time": "2024-07-07", "title": "LTLBench: Towards Benchmarks for Evaluating Temporal Logic Reasoning in Large Language Models", "paper_summary": "Temporal reasoning (TR) is a critical component of artificial intelligence,\nencompassing understanding and processing temporal information and\nrelationships between events. To discover and study the TR ability in Large\nLanguage Models (LLMs), various datasets have been constructed in different\nways for evaluating various aspects of TR ability. Our work proposes a novel\napproach to design and develop a pipeline for constructing datasets to evaluate\nthe TR ability of LLMs by leveraging random directed graph generation, LTL\nformula, and the NuSMV model checker. Based on the pipeline, we have also\nconstructed a dataset as a benchmark, namely LTLBench, consisting of 2,000 TR\nchallenges and evaluated six LLMs with it. Furthermore, we have conducted\nadditional experiments to discover the impact of increasing the number of\nevents and formula operators on the complexity of TR problems and the\nperformance of LLMs. We have demonstrated that although LLMs exhibit some\npromise in handling TR challenges, they still struggle with complex TR. We\nexpect this work can offer insights into TR ability in LLMs while also\nproviding a valuable tool for future TR evaluations.", "paper_summary_zh": "時間推理 (TR) 是人工智慧的一項關鍵組成部分，\n涵蓋了對時間資訊和事件之間關係的理解和處理。為了發現和研究大型語言模型 (LLM) 中的 TR 能力，已透過各種方式建構各種資料集，用於評估 TR 能力的各個面向。我們的工作提出了一種新穎的方法，用於設計和開發一個建構資料集的管道，以評估 LLM 的 TR 能力，方法是利用隨機有向圖生成、LTL 公式和 NuSMV 模型檢查器。根據這個管道，我們還建構了一個資料集作為基準，即 LTLBench，其中包含 2,000 個 TR 挑戰，並用它評估了六個 LLM。此外，我們還進行了額外的實驗，以發現增加事件數量和公式運算子對 TR 問題複雜性和 LLM 效能的影響。我們已經證明，儘管 LLM 在處理 TR 挑戰方面表現出一些希望，但它們仍然難以處理複雜的 TR。我們預期這項工作可以提供對 LLM 中 TR 能力的見解，同時也為未來的 TR 評估提供一個有價值的工具。", "author": "Weizhi Tang et.al.", "authors": "Weizhi Tang, Vaishak Belle", "id": "2407.05434v1", "paper_url": "http://arxiv.org/abs/2407.05434v1", "repo": "null"}}