{"2407.16537": {"publish_time": "2024-07-23", "title": "Quantifying the Role of Textual Predictability in Automatic Speech Recognition", "paper_summary": "A long-standing question in automatic speech recognition research is how to\nattribute errors to the ability of a model to model the acoustics, versus its\nability to leverage higher-order context (lexicon, morphology, syntax,\nsemantics). We validate a novel approach which models error rates as a function\nof relative textual predictability, and yields a single number, $k$, which\nmeasures the effect of textual predictability on the recognizer. We use this\nmethod to demonstrate that a Wav2Vec 2.0-based model makes greater stronger use\nof textual context than a hybrid ASR model, in spite of not using an explicit\nlanguage model, and also use it to shed light on recent results demonstrating\npoor performance of standard ASR systems on African-American English. We\ndemonstrate that these mostly represent failures of acoustic--phonetic\nmodelling. We show how this approach can be used straightforwardly in\ndiagnosing and improving ASR.", "paper_summary_zh": "長期以來，自動語音辨識研究中的問題是如何將錯誤歸因於模型建構音響的能力，相對於它利用高階脈絡（詞彙、形態、句法、語義）的能力。我們驗證了一種新穎的方法，將錯誤率建模為相對文本可預測性的函數，並產生一個單一數字 $k$，用於衡量文本可預測性對辨識器的影響。我們使用此方法證明，基於 Wav2Vec 2.0 的模型比混合 ASR 模型更能有效利用文本脈絡，儘管沒有使用明確的語言模型，並用它來闡明最近的結果，證明標準 ASR 系統在非裔美國英語上的表現不佳。我們證明，這些大多代表音響語音建模的失敗。我們展示了這種方法如何直接用於診斷和改進 ASR。", "author": "Sean Robertson et.al.", "authors": "Sean Robertson, Gerald Penn, Ewan Dunbar", "id": "2407.16537v1", "paper_url": "http://arxiv.org/abs/2407.16537v1", "repo": "null"}}