{"2410.00536": {"publish_time": "2024-10-01", "title": "Arges: Spatio-Temporal Transformer for Ulcerative Colitis Severity Assessment in Endoscopy Videos", "paper_summary": "Accurate assessment of disease severity from endoscopy videos in ulcerative\ncolitis (UC) is crucial for evaluating drug efficacy in clinical trials.\nSeverity is often measured by the Mayo Endoscopic Subscore (MES) and Ulcerative\nColitis Endoscopic Index of Severity (UCEIS) score. However, expert MES/UCEIS\nannotation is time-consuming and susceptible to inter-rater variability,\nfactors addressable by automation. Automation attempts with frame-level labels\nface challenges in fully-supervised solutions due to the prevalence of\nvideo-level labels in clinical trials. CNN-based weakly-supervised models (WSL)\nwith end-to-end (e2e) training lack generalization to new disease scores and\nignore spatio-temporal information crucial for accurate scoring. To address\nthese limitations, we propose \"Arges\", a deep learning framework that utilizes\na transformer with positional encoding to incorporate spatio-temporal\ninformation from frame features to estimate disease severity scores in\nendoscopy video. Extracted features are derived from a foundation model\n(ArgesFM), pre-trained on a large diverse dataset from multiple clinical trials\n(61M frames, 3927 videos). We evaluate four UC disease severity scores,\nincluding MES and three UCEIS component scores. Test set evaluation indicates\nsignificant improvements, with F1 scores increasing by 4.1% for MES and 18.8%,\n6.6%, 3.8% for the three UCEIS component scores compared to state-of-the-art\nmethods. Prospective validation on previously unseen clinical trial data\nfurther demonstrates the model's successful generalization.", "paper_summary_zh": "<paragraph>在潰瘍性結腸炎 (UC) 中，準確評估內視鏡視頻中的疾病嚴重程度對於評估臨床試驗中的藥物療效至關重要。嚴重程度通常通過 Mayo 內視鏡亞分數 (MES) 和潰瘍性結腸炎內視鏡嚴重程度指數 (UCEIS) 分數來衡量。然而，專家 MES/UCEIS 注釋既費時又容易受到評分者間變異性的影響，而自動化可以解決這些因素。由於臨床試驗中視頻級別標籤的普遍存在，使用幀級標籤的自動化嘗試在完全監督的解決方案中面臨挑戰。具有端到端 (e2e) 訓練的基於 CNN 的弱監督模型 (WSL) 缺乏對新疾病評分的泛化，並且忽視了對準確評分至關重要的時空信息。為了解決這些限制，我們提出了「Arges」，這是一個深度學習框架，它利用具有位置編碼的Transformer將時空信息從幀特徵中提取出來，以估計內視鏡視頻中的疾病嚴重程度評分。提取的特徵來自基礎模型 (ArgesFM)，該模型在來自多個臨床試驗的大型多樣化數據集（6100 萬幀，3927 個視頻）上進行了預訓練。我們評估了四個 UC 疾病嚴重程度評分，包括 MES 和三個 UCEIS 組成部分評分。測試集評估表明有顯著改善，與最先進的方法相比，MES 的 F1 分數提高了 4.1%，三個 UCEIS 組成部分評分的 F1 分數分別提高了 18.8%、6.6% 和 3.8%。在以前未見的臨床試驗數據上的前瞻性驗證進一步證明了該模型成功的泛化。</paragraph>", "author": "Krishna Chaitanya et.al.", "authors": "Krishna Chaitanya, Pablo F. Damasceno, Shreyas Fadnavis, Pooya Mobadersany, Chaitanya Parmar, Emily Scherer, Natalia Zemlianskaia, Lindsey Surace, Louis R. Ghanem, Oana Gabriela Cula, Tommaso Mansi, Kristopher Standish", "id": "2410.00536v1", "paper_url": "http://arxiv.org/abs/2410.00536v1", "repo": "null"}}