{"2406.17667": {"publish_time": "2024-06-25", "title": "This Paper Had the Smartest Reviewers -- Flattery Detection Utilising an Audio-Textual Transformer-Based Approach", "paper_summary": "Flattery is an important aspect of human communication that facilitates\nsocial bonding, shapes perceptions, and influences behavior through strategic\ncompliments and praise, leveraging the power of speech to build rapport\neffectively. Its automatic detection can thus enhance the naturalness of\nhuman-AI interactions. To meet this need, we present a novel audio textual\ndataset comprising 20 hours of speech and train machine learning models for\nautomatic flattery detection. In particular, we employ pretrained AST,\nWav2Vec2, and Whisper models for the speech modality, and Whisper TTS models\ncombined with a RoBERTa text classifier for the textual modality. Subsequently,\nwe build a multimodal classifier by combining text and audio representations.\nEvaluation on unseen test data demonstrates promising results, with Unweighted\nAverage Recall scores reaching 82.46% in audio-only experiments, 85.97% in\ntext-only experiments, and 87.16% using a multimodal approach.", "paper_summary_zh": "奉承是人类沟通中一个重要的方面，它通过策略性的赞美和表扬来促进社交联系、塑造认知并影响行为，利用言语的力量有效地建立融洽关系。因此，对其进行自动检测可以增强人机交互的自然性。为了满足这一需求，我们提供了一个新颖的音视频文本数据集，其中包含 20 小时的语音，并训练机器学习模型以进行自动奉承检测。特别是，我们为语音模式采用了预训练的 AST、Wav2Vec2 和 Whisper 模型，并为文本模式结合了 Whisper TTS 模型和 RoBERTa 文本分类器。随后，我们通过组合文本和音频表示来构建一个多模态分类器。对未见测试数据的评估显示出有希望的结果，在仅音频实验中，未加权平均召回率得分达到 82.46%，在仅文本实验中达到 85.97%，在使用多模态方法时达到 87.16%。", "author": "Lukas Christ et.al.", "authors": "Lukas Christ, Shahin Amiriparian, Friederike Hawighorst, Ann-Kathrin Schill, Angelo Boutalikakis, Lorenz Graf-Vlachy, Andreas König, Björn W. Schuller", "id": "2406.17667v1", "paper_url": "http://arxiv.org/abs/2406.17667v1", "repo": "null"}}