{"2412.09286": {"publish_time": "2024-12-12", "title": "Learning Novel Skills from Language-Generated Demonstrations", "paper_summary": "Current robot learning algorithms for acquiring novel skills often rely on\ndemonstration datasets or environment interactions, resulting in high labor\ncosts and potential safety risks. To address these challenges, this study\nproposes a skill-learning framework that enables robots to acquire novel skills\nfrom natural language instructions. The proposed pipeline leverages\nvision-language models to generate demonstration videos of novel skills, which\nare processed by an inverse dynamics model to extract actions from the\nunlabeled demonstrations. These actions are subsequently mapped to\nenvironmental contexts via imitation learning, enabling robots to learn new\nskills effectively. Experimental evaluations in the MetaWorld simulation\nenvironments demonstrate the pipeline's capability to generate high-fidelity\nand reliable demonstrations. Using the generated demonstrations, various skill\nlearning algorithms achieve an accomplishment rate three times the original on\nnovel tasks. These results highlight a novel approach to robot learning,\noffering a foundation for the intuitive and intelligent acquisition of novel\nrobotic skills.", "paper_summary_zh": "當前機器人學習演算法用於獲取新技能時，通常依賴於示範資料集或環境互動，導致高昂的人力成本和潛在的安全風險。為了應對這些挑戰，本研究提出了一個技能學習架構，使機器人能夠從自然語言指令中獲取新技能。所提出的管道利用視覺語言模型來產生新技能的示範影片，這些影片由逆動力學模型處理，以從未標記的示範中提取動作。這些動作隨後透過模仿學習映射到環境背景，使機器人能夠有效學習新技能。在 MetaWorld 模擬環境中的實驗評估證明了該管道產生高保真度和可靠示範的能力。使用產生的示範，各種技能學習演算法在新的任務上實現了三倍於原來的完成率。這些結果突顯了機器人學習的一種新方法，為直覺和智慧地獲取新的機器人技能奠定了基礎。", "author": "Ao-Qun Jin et.al.", "authors": "Ao-Qun Jin, Tian-Yu Xiang, Xiao-Hu Zhou, Mei-Jiang Gui, Xiao-Liang Xie, Shi-Qi Liu, Shuang-Yi Wang, Yue Cao, Sheng-Bin Duan, Fu-Chao Xie, Zeng-Guang Hou", "id": "2412.09286v1", "paper_url": "http://arxiv.org/abs/2412.09286v1", "repo": "null"}}