{"2405.19883": {"publish_time": "2024-05-30", "title": "From Words to Actions: Unveiling the Theoretical Underpinnings of LLM-Driven Autonomous Systems", "paper_summary": "In this work, from a theoretical lens, we aim to understand why large\nlanguage model (LLM) empowered agents are able to solve decision-making\nproblems in the physical world. To this end, consider a hierarchical\nreinforcement learning (RL) model where the LLM Planner and the Actor perform\nhigh-level task planning and low-level execution, respectively. Under this\nmodel, the LLM Planner navigates a partially observable Markov decision process\n(POMDP) by iteratively generating language-based subgoals via prompting. Under\nproper assumptions on the pretraining data, we prove that the pretrained LLM\nPlanner effectively performs Bayesian aggregated imitation learning (BAIL)\nthrough in-context learning. Additionally, we highlight the necessity for\nexploration beyond the subgoals derived from BAIL by proving that naively\nexecuting the subgoals returned by LLM leads to a linear regret. As a remedy,\nwe introduce an $\\epsilon$-greedy exploration strategy to BAIL, which is proven\nto incur sublinear regret when the pretraining error is small. Finally, we\nextend our theoretical framework to include scenarios where the LLM Planner\nserves as a world model for inferring the transition model of the environment\nand to multi-agent settings, enabling coordination among multiple Actors.", "paper_summary_zh": "<paragraph>在這項工作中，從理論的角度來看，我們旨在理解為什麼大型語言模型 (LLM) 賦能的代理能夠解決物理世界中的決策問題。為此，考慮一個分層強化學習 (RL) 模型，其中 LLM 規劃器和行動者分別執行高級任務規劃和低級執行。在此模型下，LLM 規劃器通過提示反覆生成基於語言的子目標，從而導航部分可觀察馬可夫決策過程 (POMDP)。在對預訓練數據的適當假設下，我們證明了預訓練的 LLM 規劃器通過情境學習有效地執行貝葉斯聚合模仿學習 (BAIL)。此外，我們強調了探索超越 BAIL 推導的子目標的必要性，通過證明天真地執行 LLM 返回的子目標會導致線性遺憾。作為補救措施，我們在 BAIL 中引入了一個 $\\epsilon$-貪婪探索策略，當預訓練誤差很小時，證明會產生次線性遺憾。最後，我們將我們的理論框架擴展到包括 LLM 規劃器作為世界模型用於推斷環境的轉換模型和多主體設置的情況，從而實現多個行動者之間的協調。</paragraph>", "author": "Jianliang He et.al.", "authors": "Jianliang He, Siyu Chen, Fengzhuo Zhang, Zhuoran Yang", "id": "2405.19883v1", "paper_url": "http://arxiv.org/abs/2405.19883v1", "repo": "null"}}