{"2407.12609": {"publish_time": "2024-07-17", "title": "Instance-wise Uncertainty for Class Imbalance in Semantic Segmentation", "paper_summary": "Semantic segmentation is a fundamental computer vision task with a vast\nnumber of applications. State of the art methods increasingly rely on deep\nlearning models, known to incorrectly estimate uncertainty and being\noverconfident in predictions, especially in data not seen during training. This\nis particularly problematic in semantic segmentation due to inherent class\nimbalance. Popular uncertainty quantification approaches are task-agnostic and\nfail to leverage spatial pixel correlations in uncertainty estimates, crucial\nin this task. In this work, a novel training methodology specifically designed\nfor semantic segmentation is presented. Training samples are weighted by\ninstance-wise uncertainty masks computed by an ensemble. This is shown to\nincrease performance on minority classes, boost model generalization and\nrobustness to domain-shift when compared to using the inverse of class\nproportions or no class weights at all. This method addresses the challenges of\nclass imbalance and uncertainty estimation in semantic segmentation,\npotentially enhancing model performance and reliability across various\napplications.", "paper_summary_zh": "語意分割是一項基本的電腦視覺任務，有大量的應用。最先進的方法越來越依賴深度學習模型，已知這些模型會錯誤地估計不確定性，並且對預測過於自信，尤其是在訓練期間未見過的資料中。由於固有的類別不平衡，這在語意分割中特別成問題。流行的不確定性量化方法與任務無關，並且無法在不確定性估計中利用空間像素相關性，這對於此任務至關重要。在這項工作中，提出了一種專門為語意分割設計的新穎訓練方法。訓練樣本由一個整體計算出的實例不確定性遮罩加權。與僅使用類別比例的倒數或根本不使用類別權重相比，這被證明可以提高少數類別的性能、提升模型的泛化能力和對領域轉移的魯棒性。此方法解決了語意分割中類別不平衡和不確定性估計的挑戰，有可能在各種應用中增強模型的性能和可靠性。", "author": "Luís Almeida et.al.", "authors": "Luís Almeida, Inês Dutra, Francesco Renna", "id": "2407.12609v1", "paper_url": "http://arxiv.org/abs/2407.12609v1", "repo": "null"}}