{"2406.17266": {"publish_time": "2024-06-25", "title": "AG-LSEC: Audio Grounded Lexical Speaker Error Correction", "paper_summary": "Speaker Diarization (SD) systems are typically audio-based and operate\nindependently of the ASR system in traditional speech transcription pipelines\nand can have speaker errors due to SD and/or ASR reconciliation, especially\naround speaker turns and regions of speech overlap. To reduce these errors, a\nLexical Speaker Error Correction (LSEC), in which an external language model\nprovides lexical information to correct the speaker errors, was recently\nproposed. Though the approach achieves good Word Diarization error rate (WDER)\nimprovements, it does not use any additional acoustic information and is prone\nto miscorrections. In this paper, we propose to enhance and acoustically ground\nthe LSEC system with speaker scores directly derived from the existing SD\npipeline. This approach achieves significant relative WDER reductions in the\nrange of 25-40% over the audio-based SD, ASR system and beats the LSEC system\nby 15-25% relative on RT03-CTS, Callhome American English and Fisher datasets.", "paper_summary_zh": "說話者日記化 (SD) 系統通常是基於音訊，並獨立於傳統語音轉錄管線中的 ASR 系統運作，且可能因 SD 和/或 ASR 調整而產生說話者錯誤，特別是在說話者輪流發言和語音重疊區域附近。為了減少這些錯誤，最近提出了一個詞彙說話者錯誤修正 (LSEC)，其中外部語言模型提供詞彙資訊來修正說話者錯誤。儘管此方法可有效改善詞彙日記化錯誤率 (WDER)，但它並未使用任何額外的音訊資訊，且容易發生錯誤修正。在本文中，我們提議使用直接從現有 SD 管線衍生的說話者分數來增強和建立 LSEC 系統的音訊基礎。這種方法在音訊基礎 SD、ASR 系統上實現了 25-40% 的顯著相對 WDER 降低，並在 RT03-CTS、Callhome 美式英語和 Fisher 資料集上比 LSEC 系統高出 15-25%。", "author": "Rohit Paturi et.al.", "authors": "Rohit Paturi, Xiang Li, Sundararajan Srinivasan", "id": "2406.17266v1", "paper_url": "http://arxiv.org/abs/2406.17266v1", "repo": "null"}}