{"2406.10073": {"publish_time": "2024-06-14", "title": "Detecting the terminality of speech-turn boundary for spoken interactions in French TV and Radio content", "paper_summary": "Transition Relevance Places are defined as the end of an utterance where the\ninterlocutor may take the floor without interrupting the current speaker\n--i.e., a place where the turn is terminal. Analyzing turn terminality is\nuseful to study the dynamic of turn-taking in spontaneous conversations. This\npaper presents an automatic classification of spoken utterances as Terminal or\nNon-Terminal in multi-speaker settings. We compared audio, text, and fusions of\nboth approaches on a French corpus of TV and Radio extracts annotated with\nturn-terminality information at each speaker change. Our models are based on\npre-trained self-supervised representations. We report results for different\nfusion strategies and varying context sizes. This study also questions the\nproblem of performance variability by analyzing the differences in results for\nmultiple training runs with random initialization. The measured accuracy would\nallow the use of these models for large-scale analysis of turn-taking.", "paper_summary_zh": "轉換相關位置定義為發話結束，對話者可以在不中斷當前發言者的情況下發言\n-- 即轉換為終點的地方。分析轉換終點有助於研究自發對話中輪流發言的動態。本文介紹了在多發言者設置中將口語發言自動分類為終點或非終點。我們在法語電視和廣播摘錄語料庫中比較了音頻、文本和兩種方法的融合，在每個發言者變更時都註明了轉換終點信息。我們的模型基於預訓練的自監督表示。我們報告了不同融合策略和不同上下文大小的結果。本研究還通過分析多次訓練運行（隨機初始化）的結果差異，質疑了性能變異性的問題。測量的準確度將允許使用這些模型進行大規模的輪流發言分析。", "author": "Rémi Uro et.al.", "authors": "Rémi Uro, Marie Tahon, David Doukhan, Antoine Laurent, Albert Rilliard", "id": "2406.10073v1", "paper_url": "http://arxiv.org/abs/2406.10073v1", "repo": "null"}}