{"2406.11817": {"publish_time": "2024-06-17", "title": "Iterative Length-Regularized Direct Preference Optimization: A Case Study on Improving 7B Language Models to GPT-4 Level", "paper_summary": "Direct Preference Optimization (DPO), a standard method for aligning language\nmodels with human preferences, is traditionally applied to offline preferences.\nRecent studies show that DPO benefits from iterative training with online\npreferences labeled by a trained reward model. In this work, we identify a\npitfall of vanilla iterative DPO - improved response quality can lead to\nincreased verbosity. To address this, we introduce iterative length-regularized\nDPO (iLR-DPO) to penalize response length. Our empirical results show that\niLR-DPO can enhance a 7B model to perform on par with GPT-4 without increasing\nverbosity. Specifically, our 7B model achieves a $50.5\\%$ length-controlled win\nrate against $\\texttt{GPT-4 Preview}$ on AlpacaEval 2.0, and excels across\nstandard benchmarks including MT-Bench, Arena-Hard and OpenLLM Leaderboard.\nThese results demonstrate the effectiveness of iterative DPO in aligning\nlanguage models with human feedback.", "paper_summary_zh": "直接偏好最佳化（DPO）是一種將語言模型與人類偏好對齊的標準方法，傳統上應用於離線偏好。最近的研究表明，DPO 受益於使用受過訓練的獎勵模型標記的線上偏好的反覆訓練。在這項工作中，我們發現了香草反覆 DPO 的一個陷阱 - 改善的回應品質可能導致冗長。為了解決這個問題，我們引入了反覆長度正規化的 DPO (iLR-DPO) 來懲罰回應長度。我們的實證結果表明，iLR-DPO 可以增強 7B 模型，使其在不增加冗長的情況下與 GPT-4 相媲美。具體來說，我們的 7B 模型在 AlpacaEval 2.0 上實現了對 $\\texttt{GPT-4 預覽}$ 的 $50.5\\%$ 長度控制勝率，並在包括 MT-Bench、Arena-Hard 和 OpenLLM 排行榜在內的標準基準中表現出色。這些結果證明了反覆 DPO 在將語言模型與人類回饋對齊方面的有效性。", "author": "Jie Liu et.al.", "authors": "Jie Liu, Zhanhui Zhou, Jiaheng Liu, Xingyuan Bu, Chao Yang, Han-Sen Zhong, Wanli Ouyang", "id": "2406.11817v1", "paper_url": "http://arxiv.org/abs/2406.11817v1", "repo": "null"}}