{"2409.03384": {"publish_time": "2024-09-05", "title": "Hardware Acceleration of LLMs: A comprehensive survey and comparison", "paper_summary": "Large Language Models (LLMs) have emerged as powerful tools for natural\nlanguage processing tasks, revolutionizing the field with their ability to\nunderstand and generate human-like text. In this paper, we present a\ncomprehensive survey of the several research efforts that have been presented\nfor the acceleration of transformer networks for Large Language Models using\nhardware accelerators.\n  The survey presents the frameworks that have been proposed and then performs\na qualitative and quantitative comparison regarding the technology, the\nprocessing platform (FPGA, ASIC, In-Memory, GPU), the speedup, the energy\nefficiency, the performance (GOPs), and the energy efficiency (GOPs/W) of each\nframework. The main challenge in comparison is that every proposed scheme is\nimplemented on a different process technology making hard a fair comparison.\nThe main contribution of this paper is that we extrapolate the results of the\nperformance and the energy efficiency on the same technology to make a fair\ncomparison; one theoretical and one more practical. We implement part of the\nLLMs on several FPGA chips to extrapolate the results to the same process\ntechnology and then we make a fair comparison of the performance.", "paper_summary_zh": "大型語言模型 (LLM) 已成為自然語言處理任務的強大工具，它們能夠理解和生成類似人類的文字，因而徹底改變了這個領域。在本文中，我們對使用硬體加速器來加速大型語言模型的Transformer網路所提出的多項研究工作進行了全面的調查。\n調查介紹了已提出的框架，然後對技術、處理平台 (FPGA、ASIC、In-Memory、GPU)、加速、能效、效能 (GOP) 和能效 (GOP/W) 進行定性和定量比較。比較中的主要挑戰在於，每項提出的方案都是在不同的製程技術上實作，這使得公平比較變得困難。本文的主要貢獻在於，我們將效能和能效的結果外推到相同的技術上，以進行公平的比較；一種是理論上的，一種是更實際的。我們在多個 FPGA 晶片上實作部分 LLM，以將結果外推到相同的製程技術，然後公平地比較效能。", "author": "Nikoletta Koilia et.al.", "authors": "Nikoletta Koilia, Christoforos Kachris", "id": "2409.03384v1", "paper_url": "http://arxiv.org/abs/2409.03384v1", "repo": "null"}}