{"2412.07472": {"publish_time": "2024-12-10", "title": "SmartAgent: Chain-of-User-Thought for Embodied Personalized Agent in Cyber World", "paper_summary": "Recent advances in embodied agents with multimodal perception and reasoning\ncapabilities based on large vision-language models (LVLMs), excel in\nautonomously interacting either real or cyber worlds, helping people make\nintelligent decisions in complex environments. However, the current works are\nnormally optimized by golden action trajectories or ideal task-oriented\nsolutions toward a definitive goal. This paradigm considers limited\nuser-oriented factors, which could be the reason for their performance\nreduction in a wide range of personal assistant applications. To address this,\nwe propose Chain-of-User-Thought (COUT), a novel embodied reasoning paradigm\nthat takes a chain of thought from basic action thinking to explicit and\nimplicit personalized preference thought to incorporate personalized factors\ninto autonomous agent learning. To target COUT, we introduce SmartAgent, an\nagent framework perceiving cyber environments and reasoning personalized\nrequirements as 1) interacting with GUI to access an item pool, 2) generating\nusers' explicit requirements implied by previous actions, and 3) recommending\nitems to fulfill users' implicit requirements. To demonstrate SmartAgent's\ncapabilities, we also create a brand-new dataset SmartSpot that offers a\nfull-stage personalized action-involved environment. To our best knowledge, our\nwork is the first to formulate the COUT process, serving as a preliminary\nattempt towards embodied personalized agent learning. Our extensive experiments\non SmartSpot illuminate SmartAgent's functionality among a series of embodied\nand personalized sub-tasks. We will release code and data upon paper\nnotification at \\url{https://github.com/tsinghua-fib-lab/SmartAgent}.", "paper_summary_zh": "<paragraph>最近多模态感知和推理能力的具身代理取得了进展，基于大型视觉语言模型 (LVLMs)，在自动交互真实或网络世界方面表现出色，帮助人们在复杂环境中做出明智的决策。然而，当前的工作通常通过黄金动作轨迹或理想的任务导向解决方案针对明确的目标进行优化。这种范例考虑了有限的用户导向因素，这可能是其在广泛的个人助理应用程序中性能降低的原因。为了解决这个问题，我们提出了用户思想链 (COUT)，一种新颖的具身推理范例，它从基本动作思维到显性和隐式个性化偏好思维，将个性化因素纳入自主代理学习中。为了针对 COUT，我们引入了 SmartAgent，一个代理框架，它可以感知网络环境并推理个性化需求，包括 1) 与 GUI 交互以访问项目池，2) 生成由先前操作暗示的用户显式需求，以及 3) 推荐项目以满足用户的隐式需求。为了展示 SmartAgent 的能力，我们还创建了一个全新的数据集 SmartSpot，它提供了一个全阶段的个性化动作参与环境。据我们所知，我们的工作是第一个制定 COUT 流程，作为面向具身个性化代理学习的初步尝试。我们在 SmartSpot 上进行的广泛实验阐明了 SmartAgent 在一系列具身和个性化子任务中的功能。我们将在 \\url{https://github.com/tsinghua-fib-lab/SmartAgent} 上发布论文通知后的代码和数据。</paragraph>", "author": "Jiaqi Zhang et.al.", "authors": "Jiaqi Zhang, Chen Gao, Liyuan Zhang, Yong Li, Hongzhi Yin", "id": "2412.07472v1", "paper_url": "http://arxiv.org/abs/2412.07472v1", "repo": "https://github.com/tsinghua-fib-lab/smartagent"}}