{"2410.19206": {"publish_time": "2024-10-24", "title": "Inference time LLM alignment in single and multidomain preference spectrum", "paper_summary": "Aligning Large Language Models (LLM) to address subjectivity and nuanced\npreference levels requires adequate flexibility and control, which can be a\nresource-intensive and time-consuming procedure. Existing training-time\nalignment methods require full re-training when a change is needed and\ninference-time ones typically require access to the reward model at each\ninference step. To address these limitations, we introduce inference-time model\nalignment method that learns encoded representations of preference dimensions,\ncalled \\textit{Alignment Vectors} (AV). These representations are computed by\nsubtraction of the base model from the aligned model as in model editing\nenabling dynamically adjusting the model behavior during inference through\nsimple linear operations. Even though the preference dimensions can span\nvarious granularity levels, here we focus on three gradual response levels\nacross three specialized domains: medical, legal, and financial, exemplifying\nits practical potential. This new alignment paradigm introduces adjustable\npreference knobs during inference, allowing users to tailor their LLM outputs\nwhile reducing the inference cost by half compared to the prompt engineering\napproach. Additionally, we find that AVs are transferable across different\nfine-tuning stages of the same model, demonstrating their flexibility. AVs also\nfacilitate multidomain, diverse preference alignment, making the process 12x\nfaster than the retraining approach.", "paper_summary_zh": "大型語言模型 (LLM) 對齊以解決主觀性和細微的偏好層級需要足夠的靈活性與控制，這可能是一個耗費資源且耗時的程序。現有的訓練時間對齊方法需要在需要變更時完全重新訓練，而推論時間方法通常需要在每個推論步驟存取獎勵模型。為了解決這些限制，我們引入了推論時間模型對齊方法，它學習偏好維度的編碼表示，稱為「對齊向量」(AV)。這些表示是透過從對齊模型中減去基本模型來計算的，就像在模型編輯中一樣，能夠在推論期間透過簡單的線性運算動態調整模型行為。儘管偏好維度可以跨越各種粒度層級，但我們在此專注於三個專業領域（醫療、法律和金融）中的三個漸進回應層級，說明其實際潛力。這種新的對齊範例在推論期間引入了可調整的偏好旋鈕，使用戶能夠調整其 LLM 輸出，同時將推論成本與提示工程方法相比減少一半。此外，我們發現 AV 可以轉移到同一個模型的不同微調階段，證明了它們的靈活性。AV 也促進了多領域、多樣化的偏好對齊，使這個過程比重新訓練方法快了 12 倍。", "author": "Sadat Shahriar et.al.", "authors": "Sadat Shahriar, Zheng Qi, Nikolaos Pappas, Srikanth Doss, Monica Sunkara, Kishaloy Halder, Manuel Mager, Yassine Benajiba", "id": "2410.19206v1", "paper_url": "http://arxiv.org/abs/2410.19206v1", "repo": "null"}}