{"2409.12059": {"publish_time": "2024-09-18", "title": "Dual-Layer Training and Decoding of Large Language Model with Simultaneously Thinking and Speaking", "paper_summary": "Large Language Model can reasonably understand and generate human expressions\nbut may lack of thorough thinking and reasoning mechanisms. Recently there have\nbeen several studies which enhance the thinking ability of language models but\nmost of them are not data-driven or training-based. In this paper, we are\nmotivated by the cognitive mechanism in the natural world, and design a novel\nmodel architecture called TaS which allows it to first consider the thoughts\nand then express the response based upon the query. We design several pipelines\nto annotate or generate the thought contents from prompt-response samples, then\nadd language heads in a middle layer which behaves as the thinking layer. We\ntrain the language model by the thoughts-augmented data and successfully let\nthe thinking layer automatically generate reasonable thoughts and finally\noutput more reasonable responses. Both qualitative examples and quantitative\nresults validate the effectiveness and performance of TaS. Our code is\navailable at https://anonymous.4open.science/r/TadE.", "paper_summary_zh": "大型语言模型可以合理地理解和生成人类表达，\n但可能缺乏透彻的思考和推理机制。最近有几项研究增强了语言模型的思考能力，但\n其中大多数不是数据驱动的或基于训练的。在本文中，我们受到自然界认知机制的启发，并设计了一种新颖的\n模型架构称为 TaS，它允许它首先考虑想法，然后根据查询表达响应。我们设计了几个管道\n从提示响应样本中注释或生成思想内容，然后在充当思考层的中间层中添加语言头。我们\n通过思想增强数据训练语言模型，并成功地让思考层自动生成合理的思想，最终\n输出更合理的响应。定性和示例和定量结果验证了 TaS 的有效性和性能。我们的代码可在 https://anonymous.4open.science/r/TadE 获得。", "author": "Ningyuan Xi et.al.", "authors": "Ningyuan Xi, Xiaoyu Wang, Yetao Wu, Teng Chen, Qingqing Gu, Jinxian Qu, Zhonglin Jiang, Yong Chen, Luo Ji", "id": "2409.12059v1", "paper_url": "http://arxiv.org/abs/2409.12059v1", "repo": "null"}}