{"2409.08217": {"publish_time": "2024-09-12", "title": "CliquePH: Higher-Order Information for Graph Neural Networks through Persistent Homology on Clique Graphs", "paper_summary": "Graph neural networks have become the default choice by practitioners for\ngraph learning tasks such as graph classification and node classification.\nNevertheless, popular graph neural network models still struggle to capture\nhigher-order information, i.e., information that goes \\emph{beyond} pairwise\ninteractions. Recent work has shown that persistent homology, a tool from\ntopological data analysis, can enrich graph neural networks with topological\ninformation that they otherwise could not capture. Calculating such features is\nefficient for dimension 0 (connected components) and dimension 1 (cycles).\nHowever, when it comes to higher-order structures, it does not scale well, with\na complexity of $O(n^d)$, where $n$ is the number of nodes and $d$ is the order\nof the structures. In this work, we introduce a novel method that extracts\ninformation about higher-order structures in the graph while still using the\nefficient low-dimensional persistent homology algorithm. On standard benchmark\ndatasets, we show that our method can lead to up to $31\\%$ improvements in test\naccuracy.", "paper_summary_zh": "圖形神經網路已成為從業人員在圖形學習任務（例如圖形分類和節點分類）中的預設選擇。\n儘管如此，流行的圖形神經網路模型仍難以擷取高階資訊，即超越成對互動的資訊。最近的研究顯示，作為拓撲資料分析工具的持續同調，可以用拓撲資訊豐富圖形神經網路，而這些資訊是它們無法擷取的。計算此類特徵對於維度 0（連通元件）和維度 1（循環）來說很有效率。\n然而，當涉及到高階結構時，它的擴充性不佳，複雜度為 $O(n^d)$，其中 $n$ 是節點數，$d$ 是結構的階數。在這項工作中，我們介紹了一種新方法，用於萃取圖形中高階結構的資訊，同時仍使用高效的低維持續同調演算法。在標準基準資料集上，我們顯示我們的模型可以使測試準確度提升多達 $31\\%$。", "author": "Davide Buffelli et.al.", "authors": "Davide Buffelli, Farzin Soleymani, Bastian Rieck", "id": "2409.08217v1", "paper_url": "http://arxiv.org/abs/2409.08217v1", "repo": "null"}}