{"2410.01649": {"publish_time": "2024-10-02", "title": "shapiq: Shapley Interactions for Machine Learning", "paper_summary": "Originally rooted in game theory, the Shapley Value (SV) has recently become\nan important tool in machine learning research. Perhaps most notably, it is\nused for feature attribution and data valuation in explainable artificial\nintelligence. Shapley Interactions (SIs) naturally extend the SV and address\nits limitations by assigning joint contributions to groups of entities, which\nenhance understanding of black box machine learning models. Due to the\nexponential complexity of computing SVs and SIs, various methods have been\nproposed that exploit structural assumptions or yield probabilistic estimates\ngiven limited resources. In this work, we introduce shapiq, an open-source\nPython package that unifies state-of-the-art algorithms to efficiently compute\nSVs and any-order SIs in an application-agnostic framework. Moreover, it\nincludes a benchmarking suite containing 11 machine learning applications of\nSIs with pre-computed games and ground-truth values to systematically assess\ncomputational performance across domains. For practitioners, shapiq is able to\nexplain and visualize any-order feature interactions in predictions of models,\nincluding vision transformers, language models, as well as XGBoost and LightGBM\nwith TreeSHAP-IQ. With shapiq, we extend shap beyond feature attributions and\nconsolidate the application of SVs and SIs in machine learning that facilitates\nfuture research. The source code and documentation are available at\nhttps://github.com/mmschlk/shapiq.", "paper_summary_zh": "起源于博弈论，Shapley 值 (SV) 最近已成为机器学习研究中一项重要的工具。它最引人注目的是被用于可解释人工智能中的特征归因和数据估值。Shapley 交互 (SI) 自然地扩展了 SV，并通过向实体组分配联合贡献来解决其局限性，这增强了对黑盒机器学习模型的理解。由于计算 SV 和 SI 的指数复杂性，已经提出了各种方法来利用结构假设或在资源有限的情况下产生概率估计。在这项工作中，我们引入了 shapiq，一个开源 Python 包，它统一了最先进的算法，以便在与应用程序无关的框架中高效计算 SV 和任意阶 SI。此外，它还包含一个基准套件，其中包含 11 个 SI 的机器学习应用程序，带有预先计算的游戏和真实值，以系统地评估跨域计算性能。对于从业者来说，shapiq 能够解释和可视化模型预测中的任意阶特征交互，包括视觉转换器、语言模型以及带有 TreeSHAP-IQ 的 XGBoost 和 LightGBM。借助 shapiq，我们将 shap 扩展到特征归因之外，并巩固了 SV 和 SI 在机器学习中的应用，这促进了未来的研究。源代码和文档可在 https://github.com/mmschlk/shapiq 获得。", "author": "Maximilian Muschalik et.al.", "authors": "Maximilian Muschalik, Hubert Baniecki, Fabian Fumagalli, Patrick Kolpaczki, Barbara Hammer, Eyke Hüllermeier", "id": "2410.01649v1", "paper_url": "http://arxiv.org/abs/2410.01649v1", "repo": "https://github.com/mmschlk/shapiq"}}