{"2501.15572": {"publish_time": "2025-01-26", "title": "Comparative clinical evaluation of \"memory-efficient\" synthetic 3d generative adversarial networks (gan) head-to-head to state of art: results on computed tomography of the chest", "paper_summary": "Introduction: Generative Adversarial Networks (GANs) are increasingly used to\ngenerate synthetic medical images, addressing the critical shortage of\nannotated data for training Artificial Intelligence (AI) systems. This study\nintroduces a novel memory-efficient GAN architecture, incorporating Conditional\nRandom Fields (CRFs) to generate high-resolution 3D medical images and\nevaluates its performance against the state-of-the-art hierarchical (HA)-GAN\nmodel.\n  Materials and Methods: The CRF-GAN was trained using the open-source lung CT\nLUNA16 dataset. The architecture was compared to HA-GAN through a quantitative\nevaluation, using Frechet Inception Distance (FID) and Maximum Mean Discrepancy\n(MMD) metrics, and a qualitative evaluation, through a two-alternative forced\nchoice (2AFC) test completed by a pool of 12 resident radiologists, in order to\nassess the realism of the generated images.\n  Results: CRF-GAN outperformed HA-GAN with lower FID (0.047 vs. 0.061) and MMD\n(0.084 vs. 0.086) scores, indicating better image fidelity. The 2AFC test\nshowed a significant preference for images generated by CRF-Gan over those\ngenerated by HA-GAN with a p-value of 1.93e-05. Additionally, CRF-GAN\ndemonstrated 9.34% lower memory usage at 256 resolution and achieved up to\n14.6% faster training speeds, offering substantial computational savings.\n  Discussion: CRF-GAN model successfully generates high-resolution 3D medical\nimages with non-inferior quality to conventional models, while being more\nmemory-efficient and faster. Computational power and time saved can be used to\nimprove the spatial resolution and anatomical accuracy of generated images,\nwhich is still a critical factor limiting their direct clinical applicability.", "paper_summary_zh": "<paragraph>引言：生成對抗網路 (GAN) 愈來愈常被用於生成合成醫學影像，以解決人工智慧 (AI) 系統訓練中標註資料嚴重短缺的問題。本研究提出了一種新穎的記憶體高效 GAN 架構，結合條件隨機場 (CRF) 來生成高解析度 3D 醫學影像，並評估其相對於最先進的分層 (HA)-GAN 模型的效能。\n材料和方法：CRF-GAN 使用開源肺部電腦斷層掃描 LUNA16 資料集進行訓練。透過使用 Fréchet Inception Distance (FID) 和 Maximum Mean Discrepancy (MMD) 指標進行量化評估，以及由 12 位住院放射科醫師組成的團隊完成的兩擇一強制選擇 (2AFC) 測試進行定性評估，將該架構與 HA-GAN 進行比較，以評估生成影像的真實性。\n結果：CRF-GAN 以較低的 FID (0.047 對 0.061) 和 MMD (0.084 對 0.086) 分數優於 HA-GAN，表示影像保真度較佳。2AFC 測試顯示，受試者顯著偏好由 CRF-GAN 生成的影像，而非由 HA-GAN 生成的影像，p 值為 1.93e-05。此外，CRF-GAN 在解析度為 256 時的記憶體使用量降低了 9.34%，並將訓練速度提升了 14.6%，提供了大量的運算節省。\n討論：CRF-GAN 模型成功地生成了高解析度 3D 醫學影像，其品質不遜於傳統模型，同時更省記憶體且速度更快。節省的運算能力和時間可用於提升生成影像的空間解析度和解剖精確度，這仍然是限制其直接臨床應用性的關鍵因素。</paragraph>", "author": "Mahshid shiri et.al.", "authors": "Mahshid shiri, Chandra Bortolotto, Alessandro Bruno, Alessio Consonni, Daniela Maria Grasso, Leonardo Brizzi, Daniele Loiacono, Lorenzo Preda", "id": "2501.15572v1", "paper_url": "http://arxiv.org/abs/2501.15572v1", "repo": "null"}}