{"2405.11181": {"publish_time": "2024-05-18", "title": "Towards Knowledge-Infused Automated Disease Diagnosis Assistant", "paper_summary": "With the advancement of internet communication and telemedicine, people are\nincreasingly turning to the web for various healthcare activities. With an\never-increasing number of diseases and symptoms, diagnosing patients becomes\nchallenging. In this work, we build a diagnosis assistant to assist doctors,\nwhich identifies diseases based on patient-doctor interaction. During\ndiagnosis, doctors utilize both symptomatology knowledge and diagnostic\nexperience to identify diseases accurately and efficiently. Inspired by this,\nwe investigate the role of medical knowledge in disease diagnosis through\ndoctor-patient interaction. We propose a two-channel, knowledge-infused,\ndiscourse-aware disease diagnosis model (KI-DDI), where the first channel\nencodes patient-doctor communication using a transformer-based encoder, while\nthe other creates an embedding of symptom-disease using a graph attention\nnetwork (GAT). In the next stage, the conversation and knowledge graph\nembeddings are infused together and fed to a deep neural network for disease\nidentification. Furthermore, we first develop an empathetic conversational\nmedical corpus comprising conversations between patients and doctors, annotated\nwith intent and symptoms information. The proposed model demonstrates a\nsignificant improvement over the existing state-of-the-art models, establishing\nthe crucial roles of (a) a doctor's effort for additional symptom extraction\n(in addition to patient self-report) and (b) infusing medical knowledge in\nidentifying diseases effectively. Many times, patients also show their medical\nconditions, which acts as crucial evidence in diagnosis. Therefore, integrating\nvisual sensory information would represent an effective avenue for enhancing\nthe capabilities of diagnostic assistants.", "paper_summary_zh": "隨著網路通訊和遠距醫療的進步，人們越來越依賴網路進行各種醫療保健活動。隨著疾病和症狀的數量不斷增加，診斷患者變得具有挑戰性。在這項工作中，我們建立了一個診斷助理來協助醫生，根據患者與醫生的互動來識別疾病。在診斷過程中，醫生同時利用症狀學知識和診斷經驗來準確有效地識別疾病。受到此啟發，我們透過醫生與患者的互動來探討醫學知識在疾病診斷中的作用。我們提出了一個雙通道、知識注入、對話感知疾病診斷模型 (KI-DDI)，其中第一個通道使用基於轉換器的編碼器對患者與醫生的溝通進行編碼，而另一個通道使用圖注意力網路 (GAT) 建立症狀疾病的嵌入。在下一階段，對話和知識圖嵌入被注入在一起，並輸入深度神經網路進行疾病識別。此外，我們首先開發了一個同理心對話式醫學語料庫，其中包含患者和醫生之間的對話，並註解了意圖和症狀資訊。所提出的模型展示了對現有最先進模型的顯著改進，確立了 (a) 醫生為額外症狀提取（除了患者自我報告之外）所做的努力以及 (b) 注入醫學知識以有效識別疾病的關鍵作用。很多時候，患者還會展示他們的醫療狀況，這在診斷中扮演著至關重要的證據。因此，整合視覺感官資訊將代表一種增強診斷助理能力的有效途徑。", "author": "Mohit Tomar et.al.", "authors": "Mohit Tomar, Abhisek Tiwari, Sriparna Saha", "id": "2405.11181v1", "paper_url": "http://arxiv.org/abs/2405.11181v1", "repo": "null"}}