{"2410.04366": {"publish_time": "2024-10-06", "title": "RespDiff: An End-to-End Multi-scale RNN Diffusion Model for Respiratory Waveform Estimation from PPG Signals", "paper_summary": "Respiratory rate (RR) is a critical health indicator often monitored under\ninconvenient scenarios, limiting its practicality for continuous monitoring.\nPhotoplethysmography (PPG) sensors, increasingly integrated into wearable\ndevices, offer a chance to continuously estimate RR in a portable manner. In\nthis paper, we propose RespDiff, an end-to-end multi-scale RNN diffusion model\nfor respiratory waveform estimation from PPG signals. RespDiff does not require\nhand-crafted features or the exclusion of low-quality signal segments, making\nit suitable for real-world scenarios. The model employs multi-scale encoders,\nto extract features at different resolutions, and a bidirectional RNN to\nprocess PPG signals and extract respiratory waveform. Additionally, a spectral\nloss term is introduced to optimize the model further. Experiments conducted on\nthe BIDMC dataset demonstrate that RespDiff outperforms notable previous works,\nachieving a mean absolute error (MAE) of 1.18 bpm for RR estimation while\nothers range from 1.66 to 2.15 bpm, showing its potential for robust and\naccurate respiratory monitoring in real-world applications.", "paper_summary_zh": "呼吸速率 (RR) 是一項重要的健康指標，通常在不方便的情況下進行監測，這限制了其在持續監測中的實用性。光電容積描記法 (PPG) 感測器日益整合到可穿戴裝置中，提供了一種以可攜式方式持續估計 RR 的機會。在本文中，我們提出了 RespDiff，這是一個端到端的多分辨率 RNN 擴散模型，用於從 PPG 訊號中估計呼吸波形。RespDiff 不需要人工特徵或排除低品質訊號片段，使其適用於實際場景。該模型採用多分辨率編碼器，以不同解析度提取特徵，並採用雙向 RNN 來處理 PPG 訊號和提取呼吸波形。此外，還引入了頻譜損失項以進一步最佳化模型。在 BIDMC 資料集上進行的實驗表明，RespDiff 優於之前的顯著研究，在 RR 估計中實現了 1.18 bpm 的平均絕對誤差 (MAE)，而其他誤差範圍從 1.66 到 2.15 bpm，顯示了其在實際應用中進行穩健且準確的呼吸監測的潛力。", "author": "Yuyang Miao et.al.", "authors": "Yuyang Miao, Zehua Chen, Chang Li, Danilo Mandic", "id": "2410.04366v1", "paper_url": "http://arxiv.org/abs/2410.04366v1", "repo": "null"}}