{"2410.09016": {"publish_time": "2024-10-11", "title": "Parameter-Efficient Fine-Tuning of State Space Models", "paper_summary": "Deep State Space Models (SSMs), such as Mamba (Gu & Dao, 2024), have emerged\nas powerful tools for language modeling, offering high performance with\nefficient inference and linear scaling in sequence length. However, the\napplication of parameter-efficient fine-tuning (PEFT) methods to SSM-based\nmodels remains largely unexplored. This paper aims to systematically study two\nkey questions: (i) How do existing PEFT methods perform on SSM-based models?\n(ii) Which modules are most effective for fine-tuning? We conduct an empirical\nbenchmark of four basic PEFT methods on SSM-based models. Our findings reveal\nthat prompt-based methods (e.g., prefix-tuning) are no longer effective, an\nempirical result further supported by theoretical analysis. In contrast, LoRA\nremains effective for SSM-based models. We further investigate the optimal\napplication of LoRA within these models, demonstrating both theoretically and\nexperimentally that applying LoRA to linear projection matrices without\nmodifying SSM modules yields the best results, as LoRA is not effective at\ntuning SSM modules. To further improve performance, we introduce LoRA with\nSelective Dimension tuning (SDLoRA), which selectively updates certain channels\nand states on SSM modules while applying LoRA to linear projection matrices.\nExtensive experimental results show that this approach outperforms standard\nLoRA.", "paper_summary_zh": "深度狀態空間模型 (SSM)，例如 Mamba (Gu & Dao, 2024)，已成為語言建模的強大工具，提供高效推理和線性序列長度縮放的高效能。然而，參數有效微調 (PEFT) 方法在基於 SSM 的模型中的應用仍未得到充分探討。本文旨在系統性地研究兩個關鍵問題：(i) 現有的 PEFT 方法在基於 SSM 的模型上表現如何？(ii) 哪些模組對於微調最有效？我們對基於 SSM 的模型進行了四種基本 PEFT 方法的經驗基準測試。我們的研究結果表明，基於提示的方法（例如前綴微調）不再有效，理論分析進一步支持了這一經驗結果。相比之下，LoRA 仍然適用於基於 SSM 的模型。我們進一步研究了 LoRA 在這些模型中的最佳應用，在理論和實驗上證明了將 LoRA 應用於線性投影矩陣而不修改 SSM 模組會產生最佳結果，因為 LoRA 在調整 SSM 模組方面無效。為了進一步提高性能，我們引入了具有選擇性維度調整 (SDLoRA) 的 LoRA，它在將 LoRA 應用於線性投影矩陣的同時有選擇地更新 SSM 模組上的某些通道和狀態。大量的實驗結果表明，這種方法優於標準的 LoRA。", "author": "Kevin Galim et.al.", "authors": "Kevin Galim, Wonjun Kang, Yuchen Zeng, Hyung Il Koo, Kangwook Lee", "id": "2410.09016v1", "paper_url": "http://arxiv.org/abs/2410.09016v1", "repo": "https://github.com/furiosa-ai/ssm-peft"}}