{"2405.19285": {"publish_time": "2024-05-29", "title": "MASSIVE Multilingual Abstract Meaning Representation: A Dataset and Baselines for Hallucination Detection", "paper_summary": "Abstract Meaning Representation (AMR) is a semantic formalism that captures\nthe core meaning of an utterance. There has been substantial work developing\nAMR corpora in English and more recently across languages, though the limited\nsize of existing datasets and the cost of collecting more annotations are\nprohibitive. With both engineering and scientific questions in mind, we\nintroduce MASSIVE-AMR, a dataset with more than 84,000 text-to-graph\nannotations, currently the largest and most diverse of its kind: AMR graphs for\n1,685 information-seeking utterances mapped to 50+ typologically diverse\nlanguages. We describe how we built our resource and its unique features before\nreporting on experiments using large language models for multilingual AMR and\nSPARQL parsing as well as applying AMRs for hallucination detection in the\ncontext of knowledge base question answering, with results shedding light on\npersistent issues using LLMs for structured parsing.", "paper_summary_zh": "抽象語意表示（AMR）是一種語意形式化，用於捕捉語句的核心含義。\n目前已有大量工作致力於開發英文 AMR 語料庫，最近更擴展到跨語言，儘管現有資料集規模有限，且收集更多標註的成本過高。\n考量到工程和科學方面的問題，我們引入了 MASSIVE-AMR，這是一個包含超過 84,000 個文字轉圖形標註的資料集，目前是同類資料集中規模最大且最多樣化的：AMR 圖形涵蓋 1,685 個資訊尋求語句，對應到 50 多種語言類型多樣的語言。\n我們將說明如何建構資源及其獨特功能，然後再報告使用大型語言模型進行多語言 AMR 和 SPARQL 解析的實驗，以及在知識庫問答的背景下應用 AMR 進行幻覺偵測，結果有助於釐清使用 LLM 進行結構化解析時持續存在的問題。", "author": "Michael Regan et.al.", "authors": "Michael Regan, Shira Wein, George Baker, Emilio Monti", "id": "2405.19285v1", "paper_url": "http://arxiv.org/abs/2405.19285v1", "repo": "null"}}