{"2407.06112": {"publish_time": "2024-07-08", "title": "Enhancing Language Model Rationality with Bi-Directional Deliberation Reasoning", "paper_summary": "This paper introduces BI-Directional DEliberation Reasoning (BIDDER), a novel\nreasoning approach to enhance the decision rationality of language models.\nTraditional reasoning methods typically rely on historical information and\nemploy uni-directional (left-to-right) reasoning strategy. This lack of\nbi-directional deliberation reasoning results in limited awareness of potential\nfuture outcomes and insufficient integration of historical context, leading to\nsuboptimal decisions. BIDDER addresses this gap by incorporating principles of\nrational decision-making, specifically managing uncertainty and predicting\nexpected utility. Our approach involves three key processes: Inferring hidden\nstates to represent uncertain information in the decision-making process from\nhistorical data; Using these hidden states to predict future potential states\nand potential outcomes; Integrating historical information (past contexts) and\nlong-term outcomes (future contexts) to inform reasoning. By leveraging\nbi-directional reasoning, BIDDER ensures thorough exploration of both past and\nfuture contexts, leading to more informed and rational decisions. We tested\nBIDDER's effectiveness in two well-defined scenarios: Poker (Limit Texas\nHold'em) and Negotiation. Our experiments demonstrate that BIDDER significantly\nimproves the decision-making capabilities of LLMs and LLM agents.", "paper_summary_zh": "本文介紹了雙向審議推理 (BIDDER)，這是一種新穎的推理方法，用於增強語言模型的決策合理性。傳統的推理方法通常依賴於歷史資訊，並採用單向（從左到右）的推理策略。這種缺乏雙向審議推理導致對潛在未來結果的認識有限，以及對歷史背景的整合不足，從而導致次優決策。BIDDER 透過納入理性決策制定原則來解決這個差距，特別是管理不確定性並預測預期效用。我們的做法涉及三個關鍵流程：從歷史數據中推論隱藏狀態，以表示決策制定過程中不確定的資訊；使用這些隱藏狀態來預測未來的潛在狀態和潛在結果；整合歷史資訊（過去的背景）和長期結果（未來的背景）以告知推理。透過利用雙向推理，BIDDER 確保徹底探索過去和未來的背景，從而做出更明智和理性的決策。我們在兩個定義明確的場景中測試了 BIDDER 的有效性：撲克（限注德州撲克）和協商。我們的實驗表明，BIDDER 大幅提升了 LLM 和 LLM 代理的決策能力。", "author": "Yadong Zhang et.al.", "authors": "Yadong Zhang, Shaoguang Mao, Wenshan Wu, Yan Xia, Tao Ge, Man Lan, Furu Wei", "id": "2407.06112v1", "paper_url": "http://arxiv.org/abs/2407.06112v1", "repo": "null"}}