{"2405.20046": {"publish_time": "2024-05-30", "title": "Cross-Training with Multi-View Knowledge Fusion for Heterogenous Federated Learning", "paper_summary": "Federated learning benefits from cross-training strategies, which enables\nmodels to train on data from distinct sources to improve the generalization\ncapability. However, the data heterogeneity between sources may lead models to\ngradually forget previously acquired knowledge when undergoing cross-training\nto adapt to new tasks or data sources. We argue that integrating personalized\nand global knowledge to gather information from multiple perspectives could\npotentially improve performance. To achieve this goal, this paper presents a\nnovel approach that enhances federated learning through a cross-training scheme\nincorporating multi-view information. Specifically, the proposed method, termed\nFedCT, includes three main modules, where the consistency-aware knowledge\nbroadcasting module aims to optimize model assignment strategies, which\nenhances collaborative advantages between clients and achieves an efficient\nfederated learning process. The multi-view knowledge-guided representation\nlearning module leverages fused prototypical knowledge from both global and\nlocal views to enhance the preservation of local knowledge before and after\nmodel exchange, as well as to ensure consistency between local and global\nknowledge. The mixup-based feature augmentation module aggregates rich\ninformation to further increase the diversity of feature spaces, which enables\nthe model to better discriminate complex samples. Extensive experiments were\nconducted on four datasets in terms of performance comparison, ablation study,\nin-depth analysis and case study. The results demonstrated that FedCT\nalleviates knowledge forgetting from both local and global views, which enables\nit outperform state-of-the-art methods.", "paper_summary_zh": "聯合學習受益於跨訓練策略，這使模型能夠訓練來自不同來源的資料，以改善泛化能力。然而，來源之間的資料異質性可能會導致模型在進行跨訓練以適應新任務或資料來源時逐漸遺忘先前獲得的知識。我們認為，整合個人化和全球知識以從多個角度收集資訊，有可能改善效能。為了達成這個目標，本文提出了一種創新的方法，透過跨訓練方案來增強聯合學習，並納入多視角資訊。具體來說，所提出的方法稱為 FedCT，包括三個主要模組，其中一致性感知知識廣播模組旨在最佳化模型分配策略，這增強了客戶端之間的協作優勢，並實現了高效的聯合學習流程。多視角知識引導表示學習模組利用來自全球和局部視角的融合原型知識，以增強模型交換前後局部知識的保存，並確保局部和全球知識之間的一致性。基於混淆的特徵擴充模組彙總了豐富的資訊，以進一步增加特徵空間的多樣性，這使模型能夠更好地區分複雜的樣本。針對四個資料集進行了廣泛的實驗，包括效能比較、消融研究、深入分析和案例研究。結果證明，FedCT 減輕了來自局部和全球視角的知識遺忘，這使它能夠優於最先進的方法。", "author": "Zhuang Qi et.al.", "authors": "Zhuang Qi, Lei Meng, Weihao He, Ruohan Zhang, Yu Wang, Xin Qi, Xiangxu Meng", "id": "2405.20046v1", "paper_url": "http://arxiv.org/abs/2405.20046v1", "repo": "null"}}