{"2411.15903": {"publish_time": "2024-11-24", "title": "Bimanual Grasp Synthesis for Dexterous Robot Hands", "paper_summary": "Humans naturally perform bimanual skills to handle large and heavy objects.\nTo enhance robots' object manipulation capabilities, generating effective\nbimanual grasp poses is essential. Nevertheless, bimanual grasp synthesis for\ndexterous hand manipulators remains underexplored. To bridge this gap, we\npropose the BimanGrasp algorithm for synthesizing bimanual grasps on 3D\nobjects. The BimanGrasp algorithm generates grasp poses by optimizing an energy\nfunction that considers grasp stability and feasibility. Furthermore, the\nsynthesized grasps are verified using the Isaac Gym physics simulation engine.\nThese verified grasp poses form the BimanGrasp-Dataset, the first large-scale\nsynthesized bimanual dexterous hand grasp pose dataset to our knowledge. The\ndataset comprises over 150k verified grasps on 900 objects, facilitating the\nsynthesis of bimanual grasps through a data-driven approach. Last, we propose\nBimanGrasp-DDPM, a diffusion model trained on the BimanGrasp-Dataset. This\nmodel achieved a grasp synthesis success rate of 69.87\\% and significant\nacceleration in computational speed compared to BimanGrasp algorithm.", "paper_summary_zh": "人類自然會執行雙手技能來處理大型和重型物體。\n為了增強機器人的物體操作能力，產生有效的\n雙手抓握姿勢至關重要。儘管如此，靈巧的手部操縱器的\n雙手抓握合成仍然未得到充分探索。為了彌補這一差距，我們\n提出了 BimanGrasp 演算法，用於在 3D\n物體上合成雙手抓握。BimanGrasp 演算法透過最佳化考量抓握穩定性和可行性的能量函數來產生抓握姿勢。此外，\n合成的抓握使用 Isaac Gym 物理模擬引擎進行驗證。\n這些經過驗證的抓握姿勢構成了 BimanGrasp-Dataset，據我們所知，這是第一個大規模合成的雙手靈巧手抓握姿勢資料集。該\n資料集包含在 900 個物體上經過驗證的 150k 個抓握，促進了透過資料驅動方法合成雙手抓握。最後，我們提出了\nBimanGrasp-DDPM，這是一個在 BimanGrasp-Dataset 上訓練的擴散模型。與 BimanGrasp 演算法相比，此\n模型實現了 69.87% 的抓握合成成功率，並顯著加速了運算速度。", "author": "Yanming Shao et.al.", "authors": "Yanming Shao, Chenxi Xiao", "id": "2411.15903v1", "paper_url": "http://arxiv.org/abs/2411.15903v1", "repo": "null"}}