{"2408.04259": {"publish_time": "2024-08-08", "title": "EfficientRAG: Efficient Retriever for Multi-Hop Question Answering", "paper_summary": "Retrieval-augmented generation (RAG) methods encounter difficulties when\naddressing complex questions like multi-hop queries. While iterative retrieval\nmethods improve performance by gathering additional information, current\napproaches often rely on multiple calls of large language models (LLMs). In\nthis paper, we introduce EfficientRAG, an efficient retriever for multi-hop\nquestion answering. EfficientRAG iteratively generates new queries without the\nneed for LLM calls at each iteration and filters out irrelevant information.\nExperimental results demonstrate that EfficientRAG surpasses existing RAG\nmethods on three open-domain multi-hop question-answering datasets.", "paper_summary_zh": "檢索增強生成（RAG）方法在處理複雜問題（例如多跳查詢）時會遇到困難。雖然反覆檢索方法透過收集額外資訊來提升效能，但目前的作法通常仰賴大型語言模型（LLM）的多重呼叫。在本文中，我們介紹 EfficientRAG，這是一種用於多跳問答的高效檢索器。EfficientRAG 會反覆產生新查詢，而無需在每次反覆時呼叫 LLM，並會過濾掉無關的資訊。實驗結果證明，EfficientRAG 在三個開放領域多跳問答資料集上優於現有的 RAG 方法。", "author": "Ziyuan Zhuang et.al.", "authors": "Ziyuan Zhuang, Zhiyang Zhang, Sitao Cheng, Fangkai Yang, Jia Liu, Shujian Huang, Qingwei Lin, Saravan Rajmohan, Dongmei Zhang, Qi Zhang", "id": "2408.04259v1", "paper_url": "http://arxiv.org/abs/2408.04259v1", "repo": "null"}}