{"2408.13684": {"publish_time": "2024-08-24", "title": "Evaluating Alternative Training Interventions Using Personalized Computational Models of Learning", "paper_summary": "Evaluating different training interventions to determine which produce the\nbest learning outcomes is one of the main challenges faced by instructional\ndesigners. Typically, these designers use A/B experiments to evaluate each\nintervention; however, it is costly and time consuming to run such studies. To\naddress this issue, we explore how computational models of learning might\nsupport designers in reasoning causally about alternative interventions within\na fractions tutor. We present an approach for automatically tuning models to\nspecific individuals and show that personalized models make better predictions\nof students' behavior than generic ones. Next, we conduct simulations to\ngenerate counterfactual predictions of performance and learning for two\nstudents (high and low performing) in different versions of the fractions\ntutor. Our approach makes predictions that align with previous human findings,\nas well as testable predictions that might be evaluated with future human\nexperiments.", "paper_summary_zh": "評估不同的訓練介入措施以確定哪一種能產生最佳學習成果，是教學設計師面臨的主要挑戰之一。一般來說，這些設計師會使用 A/B 測試來評估每種介入措施；然而，執行此類研究的成本高昂且耗時。為了解決這個問題，我們探討如何利用運算學習模型來協助設計師在分數家教中對替代介入措施進行因果推理。我們提出了一種自動調整模型以適應特定個體的方法，並證明個人化模型比一般模型更能準確預測學生的行為。接著，我們進行模擬以產生兩個學生（高表現者和低表現者）在不同版本的分數家教中的反事實效能和學習預測。我們的做法做出的預測與先前的研究結果一致，而且可以透過未來的研究進行驗證。", "author": "Christopher James MacLellan et.al.", "authors": "Christopher James MacLellan, Kimberly Stowers, Lisa Brady", "id": "2408.13684v1", "paper_url": "http://arxiv.org/abs/2408.13684v1", "repo": "null"}}