{"2407.19338": {"publish_time": "2024-07-27", "title": "Semantic Communication Enhanced by Knowledge Graph Representation Learning", "paper_summary": "This paper investigates the advantages of representing and processing\nsemantic knowledge extracted into graphs within the emerging paradigm of\nsemantic communications. The proposed approach leverages semantic and pragmatic\naspects, incorporating recent advances on large language models (LLMs) to\nachieve compact representations of knowledge to be processed and exchanged\nbetween intelligent agents. This is accomplished by using the cascade of LLMs\nand graph neural networks (GNNs) as semantic encoders, where information to be\nshared is selected to be meaningful at the receiver. The embedding vectors\nproduced by the proposed semantic encoder represent information in the form of\ntriplets: nodes (semantic concepts entities), edges(relations between\nconcepts), nodes. Thus, semantic information is associated with the\nrepresentation of relationships among elements in the space of semantic concept\nabstractions. In this paper, we investigate the potential of achieving high\ncompression rates in communication by incorporating relations that link\nelements within graph embeddings. We propose sending semantic symbols solely\nequivalent to node embeddings through the wireless channel and inferring the\ncomplete knowledge graph at the receiver. Numerical simulations illustrate the\neffectiveness of leveraging knowledge graphs to semantically compress and\ntransmit information.", "paper_summary_zh": "本文研究了在语义通信的新兴范例中将提取到图中的语义知识表示和处理的优势。所提出的方法利用语义和语用方面，结合了大语言模型 (LLM) 的最新进展，以实现要处理和在智能代理之间交换的知识的紧凑表示。这是通过使用 LLM 和图神经网络 (GNN) 的级联作为语义编码器来完成的，其中要共享的信息被选择为对接收者有意义。由所提出的语义编码器产生的嵌入向量以三元组的形式表示信息：节点（语义概念实体）、边（概念之间的关系）、节点。因此，语义信息与语义概念抽象空间中元素之间关系的表示相关联。在本文中，我们研究了通过合并将图嵌入中的元素联系起来的关联来实现高压缩率的潜力。我们建议仅通过无线信道发送语义符号，这些符号完全等效于节点嵌入，并在接收器处推断出完整的知识图。数值模拟说明了利用知识图语义压缩和传输信息的有效性。", "author": "Nour Hello et.al.", "authors": "Nour Hello, Paolo Di Lorenzo, Emilio Calvanese Strinati", "id": "2407.19338v1", "paper_url": "http://arxiv.org/abs/2407.19338v1", "repo": "null"}}