{"2411.14725": {"publish_time": "2024-11-22", "title": "Evaluating and Advancing Multimodal Large Language Models in Ability Lens", "paper_summary": "As multimodal large language models (MLLMs) advance rapidly, rigorous\nevaluation has become essential, providing further guidance for their\ndevelopment. In this work, we focus on a unified and robust evaluation of\n\\textbf{vision perception} abilities, the foundational skill of MLLMs. We find\nthat existing perception benchmarks, each focusing on different question types,\ndomains, and evaluation metrics, introduce significant evaluation variance,\ncomplicating comprehensive assessments of perception abilities when relying on\nany single benchmark. To address this, we introduce \\textbf{AbilityLens}, a\nunified benchmark designed to evaluate MLLMs across six key perception\nabilities, focusing on both accuracy and stability, with each ability\nencompassing diverse question types, domains, and metrics. With the assistance\nof AbilityLens, we: (1) identify the strengths and weaknesses of current\nmodels, highlighting stability patterns and revealing a notable performance gap\nbetween open-source and closed-source models; (2) introduce an online\nevaluation mode, which uncovers interesting ability conflict and early\nconvergence phenomena during MLLM training; and (3) design a simple\nability-specific model merging method that combines the best ability checkpoint\nfrom early training stages, effectively mitigating performance decline due to\nability conflict. The benchmark and online leaderboard will be released soon.", "paper_summary_zh": "<paragraph>隨著多模態大型語言模型 (MLLM) 快速進步，嚴謹的評估已變得至關重要，為其開發提供進一步的指導。在這項工作中，我們專注於統一且穩健的評估，即 MLLM 的基礎技能「視覺感知」能力。我們發現現有的感知基準，每個都專注於不同的問題類型、領域和評估指標，引入了顯著的評估差異，在依賴任何單一基準時，會使感知能力的全面評估複雜化。為了解決這個問題，我們引入了 AbilityLens，一個統一的基準，旨在評估 MLLM 的六項關鍵感知能力，重點關注準確性和穩定性，每項能力都包含不同的問題類型、領域和指標。在 AbilityLens 的協助下，我們：(1) 找出當前模型的優缺點，強調穩定性模式並揭示開源模型和閉源模型之間顯著的效能差距；(2) 介紹一種線上評估模式，它揭示了 MLLM 訓練期間有趣的能力衝突和早期收斂現象；(3) 設計了一個簡單的能力特定模型合併方法，它結合了早期訓練階段中最佳的能力檢查點，有效減輕了因能力衝突導致的效能下降。基準和線上排行榜將很快發布。</paragraph>", "author": "Feng Chen et.al.", "authors": "Feng Chen, Chenhui Gou, Jing Liu, Yang Yang, Zhaoyang Li, Jiyuan Zhang, Zhenbang Sun, Bohan Zhuang, Qi Wu", "id": "2411.14725v1", "paper_url": "http://arxiv.org/abs/2411.14725v1", "repo": "null"}}