{"2410.05222": {"publish_time": "2024-10-07", "title": "Precise Model Benchmarking with Only a Few Observations", "paper_summary": "How can we precisely estimate a large language model's (LLM) accuracy on\nquestions belonging to a specific topic within a larger question-answering\ndataset? The standard direct estimator, which averages the model's accuracy on\nthe questions in each subgroup, may exhibit high variance for subgroups\n(topics) with small sample sizes. Synthetic regression modeling, which\nleverages the model's accuracy on questions about other topics, may yield\nbiased estimates that are too unreliable for large subgroups. We prescribe a\nsimple yet effective solution: an empirical Bayes (EB) estimator that balances\ndirect and regression estimates for each subgroup separately, improving the\nprecision of subgroup-level estimates of model performance. Our experiments on\nmultiple datasets show that this approach consistently provides more precise\nestimates of the LLM performance compared to the direct and regression\napproaches, achieving substantial reductions in the mean squared error.\nConfidence intervals for EB estimates also have near-nominal coverage and are\nnarrower compared to those for the direct estimator. Additional experiments on\ntabular and vision data validate the benefits of this EB approach.", "paper_summary_zh": "如何精準估計大型語言模型 (LLM) 在較大型問答資料集內特定主題問題上的準確度？標準直接估計器會針對每個子群組中的問題平均模型的準確度，對於樣本量較小的子群組（主題）可能會出現高變異。合成迴歸模型會利用模型在其他主題問題上的準確度，可能會產生有偏差的估計值，對於大型子群組來說過於不可靠。我們建議一個簡單但有效的解決方案：一個經驗貝氏 (EB) 估計器，分別針對每個子群組平衡直接和迴歸估計值，改善模型效能子群組層級估計值的精準度。我們在多個資料集上的實驗顯示，與直接和迴歸方法相比，這種方法持續提供 LLM 效能更精準的估計值，大幅降低均方誤差。EB 估計值的信心區間也具有近乎名義上的覆蓋率，並且比直接估計器的信心區間更窄。在表格和視覺資料上的其他實驗驗證了這種 EB 方法的好處。", "author": "Riccardo Fogliato et.al.", "authors": "Riccardo Fogliato, Pratik Patil, Nil-Jana Akpinar, Mathew Monfort", "id": "2410.05222v1", "paper_url": "http://arxiv.org/abs/2410.05222v1", "repo": "null"}}