{"2410.13788": {"publish_time": "2024-10-17", "title": "Modeling Future Conversation Turns to Teach LLMs to Ask Clarifying Questions", "paper_summary": "Large language models (LLMs) must often respond to highly ambiguous user\nrequests. In such cases, the LLM's best response may be to ask a clarifying\nquestion to elicit more information. We observe existing LLMs often respond by\npresupposing a single interpretation of such ambiguous requests, frustrating\nusers who intended a different interpretation. We speculate this is caused by\ncurrent preference data labeling practice, where LLM responses are evaluated\nonly on their prior contexts. To address this, we propose to assign preference\nlabels by simulating their expected outcomes in the future turns. This allows\nLLMs to learn to ask clarifying questions when it can generate responses that\nare tailored to each user interpretation in future turns. In experiments on\nopen-domain QA, we compare systems that trained using our proposed preference\nlabeling methods against standard methods, which assign preferences based on\nonly prior context. We evaluate systems based on their ability to ask\nclarifying questions that can recover each user's interpretation and expected\nanswer, and find that our training with our proposed method trains LLMs to ask\nclarifying questions with a 5% improvement in F1 measured against the answer\nset from different interpretations of each query", "paper_summary_zh": "大型語言模型 (LLM) 必須經常回應高度模糊的使用者要求。在這種情況下，LLM 最好的回應可能是提出一個澄清問題以引出更多資訊。我們觀察到現有的 LLM 通常會預設對這些模糊要求的單一解釋，讓預期不同解釋的使用者感到沮喪。我們推測這是由目前的偏好資料標籤實務所造成的，其中 LLM 回應僅根據其先前的背景進行評估。為了解決這個問題，我們建議透過模擬其在未來輪次中的預期結果來分配偏好標籤。這允許 LLM 在能夠產生針對未來輪次中每個使用者解釋量身打造的回應時，學會提出澄清問題。在開放式問答的實驗中，我們比較了使用我們提出的偏好標籤方法訓練的系統與僅根據先前背景分配偏好的標準方法。我們根據系統提出澄清問題的能力來評估它們，這些問題可以恢復每個使用者的解釋和預期答案，並發現我們使用提出的方法進行訓練，可以訓練 LLM 提出澄清問題，相對於從每個查詢的不同解釋中測量的答案集，F1 值提升了 5%。", "author": "Michael J. Q. Zhang et.al.", "authors": "Michael J. Q. Zhang, W. Bradley Knox, Eunsol Choi", "id": "2410.13788v1", "paper_url": "http://arxiv.org/abs/2410.13788v1", "repo": "null"}}