{"2412.05876": {"publish_time": "2024-12-08", "title": "MG-3D: Multi-Grained Knowledge-Enhanced 3D Medical Vision-Language Pre-training", "paper_summary": "3D medical image analysis is pivotal in numerous clinical applications.\nHowever, the scarcity of labeled data and limited generalization capabilities\nhinder the advancement of AI-empowered models. Radiology reports are easily\naccessible and can serve as weakly-supervised signals. However, large-scale\nvision-language pre-training (VLP) remains underexplored in 3D medical image\nanalysis. Specifically, the insufficient investigation into multi-grained\nradiology semantics and their correlations across patients leads to\nunderutilization of large-scale volume-report data.\n  Considering intra-patient cross-modal semantic consistency and inter-patient\nsemantic correlations, we propose a multi-task VLP method, MG-3D, pre-trained\non large-scale data (47.1K), addressing the challenges by the following two\naspects: 1) Establishing the correspondence between volume semantics and\nmulti-grained medical knowledge of each patient with cross-modal global\nalignment and complementary modality-guided local reconstruction, ensuring\nintra-patient features of different modalities cohesively represent the same\nsemantic content; 2) Correlating inter-patient visual semantics based on\nfine-grained report correlations across patients, and keeping sensitivity to\nglobal individual differences via contrastive learning, enhancing the\ndiscriminative feature representation. Furthermore, we delve into the scaling\nlaw to explore potential performance improvements. Comprehensive evaluations\nacross nine uni- and cross-modal clinical tasks are carried out to assess model\nefficacy. Extensive experiments on both internal and external datasets\ndemonstrate the superior transferability, scalability, and generalization of\nMG-3D, showcasing its potential in advancing feature representation for 3D\nmedical image analysis. Code will be available:\nhttps://github.com/Xuefeng-Ni/MG-3D.", "paper_summary_zh": "<paragraph>3D 醫學影像分析在眾多臨床應用中至關重要。\n然而，標記資料的稀缺和有限的概化能力\n阻礙了 AI 賦能模型的進步。放射報告容易獲得，可以用作弱監督信號。然而，大規模\n視覺語言預訓練 (VLP) 在 3D 醫學影像\n分析中仍未得到充分探索。具體來說，對多粒度\n放射語義及其在患者之間的相關性研究不足，導致大規模體積報告數據利用不足。\n考慮到患者內部跨模態語義一致性和患者間\n語義相關性，我們提出了一種多任務 VLP 方法 MG-3D，預訓練\n在大型數據 (47.1K) 上，通過以下兩個方面解決挑戰：1) 建立體積語義和\n每個患者的多粒度醫學知識之間的對應關係，通過跨模態全局\n對齊和互補模態引導的局部重建，確保不同模態的患者內部特徵一致地表示相同的\n語義內容；2) 基於患者之間的細粒度報告相關性對患者間的視覺語義進行關聯，並通過對比學習保持對\n全局個體差異的敏感性，增強判別特徵表示。此外，我們深入研究了擴展\n定律以探索潛在的性能改進。跨越九項單模態和跨模態臨床任務的綜合評估是進行的，以評估模型\n效能。在內部和外部數據集上的廣泛實驗\n證明了 MG-3D 的卓越可傳遞性、可擴展性和泛化性，展示了其在推進 3D\n醫學影像分析特徵表示方面的潛力。代碼將提供：\nhttps://github.com/Xuefeng-Ni/MG-3D。</paragraph>", "author": "Xuefeng Ni et.al.", "authors": "Xuefeng Ni, Linshan Wu, Jiaxin Zhuang, Qiong Wang, Mingxiang Wu, Varut Vardhanabhuti, Lihai Zhang, Hanyu Gao, Hao Chen", "id": "2412.05876v1", "paper_url": "http://arxiv.org/abs/2412.05876v1", "repo": "https://github.com/xuefeng-ni/mg-3d"}}