{"2410.12388": {"publish_time": "2024-10-16", "title": "Prompt Compression for Large Language Models: A Survey", "paper_summary": "Leveraging large language models (LLMs) for complex natural language tasks\ntypically requires long-form prompts to convey detailed requirements and\ninformation, which results in increased memory usage and inference costs. To\nmitigate these challenges, multiple efficient methods have been proposed, with\nprompt compression gaining significant research interest. This survey provides\nan overview of prompt compression techniques, categorized into hard prompt\nmethods and soft prompt methods. First, the technical approaches of these\nmethods are compared, followed by an exploration of various ways to understand\ntheir mechanisms, including the perspectives of attention optimization,\nParameter-Efficient Fine-Tuning (PEFT), modality fusion, and new synthetic\nlanguage. We also examine the downstream adaptations of various prompt\ncompression techniques. Finally, the limitations of current prompt compression\nmethods are analyzed, and several future directions are outlined, such as\noptimizing the compression encoder, combining hard and soft prompts methods,\nand leveraging insights from multimodality.", "paper_summary_zh": "利用大型語言模型 (LLM) 處理複雜的自然語言任務通常需要長篇提示來傳達詳細的要求和資訊，這會增加記憶體使用量和推論成本。為了減輕這些挑戰，已提出多種有效的方法，其中提示壓縮獲得了顯著的研究興趣。本調查提供了提示壓縮技術的概述，分為硬提示方法和軟提示方法。首先，比較這些方法的技術方法，然後探討理解其機制的各種方法，包括關注最佳化、參數有效微調 (PEFT)、模態融合和新的合成語言。我們還檢查了各種提示壓縮技術的下游適應。最後，分析了當前提示壓縮方法的限制，並概述了幾個未來的方向，例如最佳化壓縮編碼器、結合硬提示和軟提示方法，以及利用多模態的見解。", "author": "Zongqian Li et.al.", "authors": "Zongqian Li, Yinhong Liu, Yixuan Su, Nigel Collier", "id": "2410.12388v1", "paper_url": "http://arxiv.org/abs/2410.12388v1", "repo": "null"}}