{"2407.21778": {"publish_time": "2024-07-31", "title": "Tulip Agent -- Enabling LLM-Based Agents to Solve Tasks Using Large Tool Libraries", "paper_summary": "We introduce tulip agent, an architecture for autonomous LLM-based agents\nwith Create, Read, Update, and Delete access to a tool library containing a\npotentially large number of tools. In contrast to state-of-the-art\nimplementations, tulip agent does not encode the descriptions of all available\ntools in the system prompt, which counts against the model's context window, or\nembed the entire prompt for retrieving suitable tools. Instead, the tulip agent\ncan recursively search for suitable tools in its extensible tool library,\nimplemented exemplarily as a vector store. The tulip agent architecture\nsignificantly reduces inference costs, allows using even large tool libraries,\nand enables the agent to adapt and extend its set of tools. We evaluate the\narchitecture with several ablation studies in a mathematics context and\ndemonstrate its generalizability with an application to robotics. A reference\nimplementation and the benchmark are available at\ngithub.com/HRI-EU/tulip_agent.", "paper_summary_zh": "我們介紹了 Tulip 代理，一種基於自主 LLM 的代理架構，可以對包含大量工具的工具庫進行建立、讀取、更新和刪除存取。與最先進的實作相反，Tulip 代理不會將所有可用工具的描述編碼在系統提示中，這會計入模型的內容視窗，或嵌入整個提示以擷取合適的工具。相反地，Tulip 代理可以在其可延伸工具庫中遞迴搜尋合適的工具，範例實作為向量儲存。Tulip 代理架構大幅降低了推論成本，允許使用甚至大型工具庫，並讓代理調整和延伸其工具組。我們在數學背景中使用多項消融研究評估架構，並透過機器人應用程式展示其概括性。可以在 github.com/HRI-EU/tulip_agent 取得參考實作和基準。", "author": "Felix Ocker et.al.", "authors": "Felix Ocker, Daniel Tanneberg, Julian Eggert, Michael Gienger", "id": "2407.21778v1", "paper_url": "http://arxiv.org/abs/2407.21778v1", "repo": "null"}}