{"2408.01050": {"publish_time": "2024-08-02", "title": "The Impact of Hyperparameters on Large Language Model Inference Performance: An Evaluation of vLLM and HuggingFace Pipelines", "paper_summary": "The recent surge of open-source large language models (LLMs) enables\ndevelopers to create AI-based solutions while maintaining control over aspects\nsuch as privacy and compliance, thereby providing governance and ownership of\nthe model deployment process. To utilize these LLMs, inference engines are\nneeded. These engines load the model's weights onto available resources, such\nas GPUs, and process queries to generate responses. The speed of inference, or\nperformance, of the LLM, is critical for real-time applications, as it computes\nmillions or billions of floating point operations per inference. Recently,\nadvanced inference engines such as vLLM have emerged, incorporating novel\nmechanisms such as efficient memory management to achieve state-of-the-art\nperformance. In this paper, we analyze the performance, particularly the\nthroughput (tokens generated per unit of time), of 20 LLMs using two inference\nlibraries: vLLM and HuggingFace's pipelines. We investigate how various\nhyperparameters, which developers must configure, influence inference\nperformance. Our results reveal that throughput landscapes are irregular, with\ndistinct peaks, highlighting the importance of hyperparameter optimization to\nachieve maximum performance. We also show that applying hyperparameter\noptimization when upgrading or downgrading the GPU model used for inference can\nimprove throughput from HuggingFace pipelines by an average of 9.16% and 13.7%,\nrespectively.", "paper_summary_zh": "<paragraph>最近開放原始碼的大型語言模型 (LLM) 的激增，讓開發人員能夠在維護隱私和合規等方面保持控制的情況下建立基於 AI 的解決方案，從而提供模型部署流程的治理和所有權。為了使用這些 LLM，需要推理引擎。這些引擎將模型的權重載入到可用資源（例如 GPU）上，並處理查詢以產生回應。LLM 的推理速度或效能對於即時應用程式至關重要，因為它每進行一次推理就會計算數百萬或數十億個浮點運算。最近，出現了 vLLM 等先進的推理引擎，它結合了高效記憶體管理等新機制來實現最先進的效能。在本文中，我們分析了效能，特別是使用兩個推理庫（vLLM 和 HuggingFace 的管道）的 20 個 LLM 的吞吐量（每單位時間產生的代幣）。我們探討了開發人員必須配置的各種超參數如何影響推理效能。我們的結果顯示，吞吐量狀況是不規則的，有明顯的高峰，這突顯了超參數最佳化對於達成最大效能的重要性。我們還展示了在升級或降級用於推理的 GPU 模型時應用超參數最佳化可以分別將 HuggingFace 管道的吞吐量平均提升 9.16% 和 13.7%。</paragraph>", "author": "Matias Martinez et.al.", "authors": "Matias Martinez", "id": "2408.01050v1", "paper_url": "http://arxiv.org/abs/2408.01050v1", "repo": "null"}}