{"2501.07183": {"publish_time": "2025-01-13", "title": "Kriging and Gaussian Process Interpolation for Georeferenced Data Augmentation", "paper_summary": "Data augmentation is a crucial step in the development of robust supervised\nlearning models, especially when dealing with limited datasets. This study\nexplores interpolation techniques for the augmentation of geo-referenced data,\nwith the aim of predicting the presence of Commelina benghalensis L. in\nsugarcane plots in La R{\\'e}union. Given the spatial nature of the data and the\nhigh cost of data collection, we evaluated two interpolation approaches:\nGaussian processes (GPs) with different kernels and kriging with various\nvariograms. The objectives of this work are threefold: (i) to identify which\ninterpolation methods offer the best predictive performance for various\nregression algorithms, (ii) to analyze the evolution of performance as a\nfunction of the number of observations added, and (iii) to assess the spatial\nconsistency of augmented datasets. The results show that GP-based methods, in\nparticular with combined kernels (GP-COMB), significantly improve the\nperformance of regression algorithms while requiring less additional data.\nAlthough kriging shows slightly lower performance, it is distinguished by a\nmore homogeneous spatial coverage, a potential advantage in certain contexts.", "paper_summary_zh": "資料擴充是穩健監督學習模型開發中至關重要的一步，特別是在處理有限資料集時。本研究探討了地理參考資料擴充的內插技術，目的是預測留尼旺甘蔗田中的孟加拉鳶尾花 L. 的存在。鑑於資料的空間性質和資料收集的高成本，我們評估了兩種內插方法：具有不同核心的高斯過程 (GP) 和具有不同變異函數組的克里金法。這項工作的目標有三方面：(i) 找出哪種內插方法為各種回歸演算法提供最佳預測效能，(ii) 分析效能隨著新增觀測數的演變，以及 (iii) 評估擴充資料集的空間一致性。結果顯示，基於 GP 的方法，特別是具有組合核心的方法 (GP-COMB)，顯著提升了回歸演算法的效能，同時需要較少額外資料。儘管克里金法顯示出稍低的效能，但其特點是空間覆蓋範圍更均勻，在某些情況下可能是一個優勢。", "author": "Frédérick Fabre Ferber et.al.", "authors": "Frédérick Fabre Ferber, Dominique Gay, Jean-Christophe Soulié, Jean Diatta, Odalric-Ambrym Maillard", "id": "2501.07183v1", "paper_url": "http://arxiv.org/abs/2501.07183v1", "repo": "null"}}