{"2501.13772": {"publish_time": "2025-01-23", "title": "Tune In, Act Up: Exploring the Impact of Audio Modality-Specific Edits on Large Audio Language Models in Jailbreak", "paper_summary": "Large Language Models (LLMs) demonstrate remarkable zero-shot performance\nacross various natural language processing tasks. The integration of multimodal\nencoders extends their capabilities, enabling the development of Multimodal\nLarge Language Models that process vision, audio, and text. However, these\ncapabilities also raise significant security concerns, as these models can be\nmanipulated to generate harmful or inappropriate content through jailbreak.\nWhile extensive research explores the impact of modality-specific input edits\non text-based LLMs and Large Vision-Language Models in jailbreak, the effects\nof audio-specific edits on Large Audio-Language Models (LALMs) remain\nunderexplored. Hence, this paper addresses this gap by investigating how\naudio-specific edits influence LALMs inference regarding jailbreak. We\nintroduce the Audio Editing Toolbox (AET), which enables audio-modality edits\nsuch as tone adjustment, word emphasis, and noise injection, and the Edited\nAudio Datasets (EADs), a comprehensive audio jailbreak benchmark. We also\nconduct extensive evaluations of state-of-the-art LALMs to assess their\nrobustness under different audio edits. This work lays the groundwork for\nfuture explorations on audio-modality interactions in LALMs security.", "paper_summary_zh": "大型語言模型 (LLM) 在各種自然語言處理任務中展現了非凡的零次學習表現。多模態編碼器的整合擴展了它們的能力，促成了處理視覺、音訊和文字的多模態大型語言模型的開發。然而，這些能力也引發了重大的安全性疑慮，因為這些模型可以透過越獄操縱來產生有害或不適當的內容。雖然廣泛的研究探索了特定於模態的輸入編輯對越獄中的基於文字的 LLM 和大型視覺語言模型的影響，但特定於音訊的編輯對大型音訊語言模型 (LALM) 的影響仍未充分探討。因此，本文透過探討特定於音訊的編輯如何影響 LALM 對越獄的推論來解決這個差距。我們引入了音訊編輯工具箱 (AET)，它支援音訊模態編輯，例如音調調整、字詞強調和雜訊注入，以及編輯過的音訊資料集 (EAD)，一個全面的音訊越獄基準。我們也對最先進的 LALM 進行廣泛的評估，以評估它們在不同音訊編輯下的穩健性。這項工作為未來探索 LALM 安全性中音訊模態互動奠定了基礎。", "author": "Erjia Xiao et.al.", "authors": "Erjia Xiao, Hao Cheng, Jing Shao, Jinhao Duan, Kaidi Xu, Le Yang, Jindong Gu, Renjing Xu", "id": "2501.13772v1", "paper_url": "http://arxiv.org/abs/2501.13772v1", "repo": "null"}}