{"2408.08600": {"publish_time": "2024-08-16", "title": "MM-UNet: A Mixed MLP Architecture for Improved Ophthalmic Image Segmentation", "paper_summary": "Ophthalmic image segmentation serves as a critical foundation for ocular\ndisease diagnosis. Although fully convolutional neural networks (CNNs) are\ncommonly employed for segmentation, they are constrained by inductive biases\nand face challenges in establishing long-range dependencies. Transformer-based\nmodels address these limitations but introduce substantial computational\noverhead. Recently, a simple yet efficient Multilayer Perceptron (MLP)\narchitecture was proposed for image classification, achieving competitive\nperformance relative to advanced transformers. However, its effectiveness for\nophthalmic image segmentation remains unexplored. In this paper, we introduce\nMM-UNet, an efficient Mixed MLP model tailored for ophthalmic image\nsegmentation. Within MM-UNet, we propose a multi-scale MLP (MMLP) module that\nfacilitates the interaction of features at various depths through a grouping\nstrategy, enabling simultaneous capture of global and local information. We\nconducted extensive experiments on both a private anterior segment optical\ncoherence tomography (AS-OCT) image dataset and a public fundus image dataset.\nThe results demonstrated the superiority of our MM-UNet model in comparison to\nstate-of-the-art deep segmentation networks.", "paper_summary_zh": "眼科影像分割是眼部疾病诊断的关键基础。虽然全卷积神经网络 (CNN) 通常用于分割，但它们受到归纳偏差的限制，并且在建立远程依赖关系时面临挑战。基于 Transformer 的模型解决了这些限制，但引入了大量的计算开销。最近，提出了一种简单但高效的多层感知器 (MLP) 架构用于图像分类，相对于高级 Transformer 实现了有竞争力的性能。然而，其对眼科图像分割的有效性仍未得到探索。在本文中，我们介绍了 MM-UNet，这是一种针对眼科图像分割量身定制的高效混合 MLP 模型。在 MM-UNet 中，我们提出了一个多尺度 MLP (MMLP) 模块，该模块通过分组策略促进了不同深度特征的交互，从而能够同时捕获全局和局部信息。我们在一个私有的前节段光学相干断层扫描 (AS-OCT) 图像数据集和一个公共眼底图像数据集上进行了广泛的实验。结果表明，与最先进的深度分割网络相比，我们的 MM-UNet 模型具有优越性。", "author": "Zunjie Xiao et.al.", "authors": "Zunjie Xiao, Xiaoqing Zhang, Risa Higashita, Jiang Liu", "id": "2408.08600v1", "paper_url": "http://arxiv.org/abs/2408.08600v1", "repo": "null"}}