{"2501.04153": {"publish_time": "2025-01-07", "title": "Multilingual Open QA on the MIA Shared Task", "paper_summary": "Cross-lingual information retrieval (CLIR) ~\\cite{shi2021cross, asai2021one,\njiang2020cross} for example, can find relevant text in any language such as\nEnglish(high resource) or Telugu (low resource) even when the query is posed in\na different, possibly low-resource, language. In this work, we aim to develop\nuseful CLIR models for this constrained, yet important, setting where we do not\nrequire any kind of additional supervision or labelled data for retrieval task\nand hence can work effectively for low-resource languages.\n  \\par We propose a simple and effective re-ranking method for improving\npassage retrieval in open question answering. The re-ranker re-scores retrieved\npassages with a zero-shot multilingual question generation model, which is a\npre-trained language model, to compute the probability of the input question in\nthe target language conditioned on a retrieved passage, which can be possibly\nin a different language. We evaluate our method in a completely zero shot\nsetting and doesn't require any training. Thus the main advantage of our method\nis that our approach can be used to re-rank results obtained by any sparse\nretrieval methods like BM-25. This eliminates the need for obtaining expensive\nlabelled corpus required for the retrieval tasks and hence can be used for low\nresource languages.", "paper_summary_zh": "跨語言資訊檢索 (CLIR) ~\\cite{shi2021cross, asai2021one,\njiang2020cross} 例如，可以在任何語言中找到相關文字，例如英文（高資源）或泰盧固語（低資源），即使查詢是用不同的語言（可能是低資源）提出的。在此研究中，我們旨在為此受限但重要的設定開發有用的 CLIR 模型，在此設定中，我們不需要任何類型的額外監督或標籤資料進行檢索任務，因此可以有效地用於低資源語言。\n\\par 我們提出了一種簡單且有效的重新排序方法，用於改善開放式問答中的段落檢索。重新排序器使用零次學習多語言問題生成模型（一種預訓練語言模型）重新評分檢索到的段落，以計算目標語言中輸入問題在檢索到的段落中的機率，而該段落可能使用不同的語言。我們在完全零次學習的設定中評估我們的模型，不需要任何訓練。因此，我們的方法的主要優點是，我們的方法可以用於重新排序任何稀疏檢索方法（例如 BM-25）獲得的結果。這消除了獲取檢索任務所需昂貴標記語料庫的需要，因此可用於低資源語言。", "author": "Navya Yarrabelly et.al.", "authors": "Navya Yarrabelly, Saloni Mittal, Ketan Todi, Kimihiro Hasegawa", "id": "2501.04153v1", "paper_url": "http://arxiv.org/abs/2501.04153v1", "repo": "null"}}