{"2410.10781": {"publish_time": "2024-10-14", "title": "When Attention Sink Emerges in Language Models: An Empirical View", "paper_summary": "Language Models (LMs) assign significant attention to the first token, even\nif it is not semantically important, which is known as attention sink. This\nphenomenon has been widely adopted in applications such as streaming/long\ncontext generation, KV cache optimization, inference acceleration, model\nquantization, and others. Despite its widespread use, a deep understanding of\nattention sink in LMs is still lacking. In this work, we first demonstrate that\nattention sinks exist universally in LMs with various inputs, even in small\nmodels. Furthermore, attention sink is observed to emerge during the LM\npre-training, motivating us to investigate how optimization, data distribution,\nloss function, and model architecture in LM pre-training influence its\nemergence. We highlight that attention sink emerges after effective\noptimization on sufficient training data. The sink position is highly\ncorrelated with the loss function and data distribution. Most importantly, we\nfind that attention sink acts more like key biases, storing extra attention\nscores, which could be non-informative and not contribute to the value\ncomputation. We also observe that this phenomenon (at least partially) stems\nfrom tokens' inner dependence on attention scores as a result of softmax\nnormalization. After relaxing such dependence by replacing softmax attention\nwith other attention operations, such as sigmoid attention without\nnormalization, attention sinks do not emerge in LMs up to 1B parameters. The\ncode is available at https://github.com/sail-sg/Attention-Sink.", "paper_summary_zh": "語言模型 (LM) 會將顯著的注意力分配給第一個符號，即使它在語義上並不重要，這稱為注意力接收器。這種現象已被廣泛應用於串流/長內容生成、KV 快取最佳化、推論加速、模型量化等應用程式中。儘管它被廣泛使用，但對於 LM 中的注意力接收器仍缺乏深入的了解。在這項工作中，我們首先證明注意力接收器普遍存在於具有各種輸入的 LM 中，即使在小型模型中也是如此。此外，觀察到注意力接收器會在 LM 預訓練期間出現，促使我們探討 LM 預訓練中的最佳化、資料分佈、損失函數和模型架構如何影響其出現。我們強調，在充足的訓練資料上進行有效最佳化後，注意力接收器就會出現。接收器位置與損失函數和資料分佈高度相關。最重要的是，我們發現注意力接收器更像是鍵偏差，儲存額外的注意力分數，這些分數可能是無意義的，而且不會有助於值運算。我們還觀察到，這種現象（至少部分）源於符號對注意力分數的內部依賴性，這是 softmax 正規化的結果。在透過將 softmax 注意力替換為其他注意力運算（例如沒有正規化的 sigmoid 注意力）來放寬這種依賴性後，注意力接收器不會出現在高達 1B 參數的 LM 中。程式碼可在 https://github.com/sail-sg/Attention-Sink 取得。", "author": "Xiangming Gu et.al.", "authors": "Xiangming Gu, Tianyu Pang, Chao Du, Qian Liu, Fengzhuo Zhang, Cunxiao Du, Ye Wang, Min Lin", "id": "2410.10781v1", "paper_url": "http://arxiv.org/abs/2410.10781v1", "repo": "https://github.com/sail-sg/attention-sink"}}