{"2407.18571": {"publish_time": "2024-07-26", "title": "Speech Bandwidth Expansion Via High Fidelity Generative Adversarial Networks", "paper_summary": "Speech bandwidth expansion is crucial for expanding the frequency range of\nlow-bandwidth speech signals, thereby improving audio quality, clarity and\nperceptibility in digital applications. Its applications span telephony,\ncompression, text-to-speech synthesis, and speech recognition. This paper\npresents a novel approach using a high-fidelity generative adversarial network,\nunlike cascaded systems, our system is trained end-to-end on paired narrowband\nand wideband speech signals. Our method integrates various bandwidth upsampling\nratios into a single unified model specifically designed for speech bandwidth\nexpansion applications. Our approach exhibits robust performance across various\nbandwidth expansion factors, including those not encountered during training,\ndemonstrating zero-shot capability. To the best of our knowledge, this is the\nfirst work to showcase this capability. The experimental results demonstrate\nthat our method outperforms previous end-to-end approaches, as well as\ninterpolation and traditional techniques, showcasing its effectiveness in\npractical speech enhancement applications.", "paper_summary_zh": "語音頻寬擴展對於擴展低頻寬語音訊號的頻率範圍至關重要，從而提高數位應用中的音訊品質、清晰度和可感知度。其應用涵蓋電話、壓縮、文字轉語音合成和語音辨識。本文提出了一種使用高保真生成對抗網路的新方法，與串聯系統不同，我們的系統在配對的窄頻和寬頻語音訊號上進行端對端訓練。我們的模型將各種頻寬上採樣比率整合到一個單一的統一模型中，專門設計用於語音頻寬擴展應用。我們的模型在各種頻寬擴展因子中展現出強健的效能，包括在訓練期間未遇到的因子，證明了零次學習能力。據我們所知，這是第一個展示此能力的研究。實驗結果證明，我們的模型優於先前的端對端方法，以及插值和傳統技術，證明了其在實用的語音增強應用中的有效性。", "author": "Mahmoud Salhab et.al.", "authors": "Mahmoud Salhab, Haidar Harmanani", "id": "2407.18571v1", "paper_url": "http://arxiv.org/abs/2407.18571v1", "repo": "null"}}