{"2406.09838": {"publish_time": "2024-06-14", "title": "Vision-Language Models Meet Meteorology: Developing Models for Extreme Weather Events Detection with Heatmaps", "paper_summary": "Real-time detection and prediction of extreme weather protect human lives and\ninfrastructure. Traditional methods rely on numerical threshold setting and\nmanual interpretation of weather heatmaps with Geographic Information Systems\n(GIS), which can be slow and error-prone. Our research redefines Extreme\nWeather Events Detection (EWED) by framing it as a Visual Question Answering\n(VQA) problem, thereby introducing a more precise and automated solution.\nLeveraging Vision-Language Models (VLM) to simultaneously process visual and\ntextual data, we offer an effective aid to enhance the analysis process of\nweather heatmaps. Our initial assessment of general-purpose VLMs (e.g.,\nGPT-4-Vision) on EWED revealed poor performance, characterized by low accuracy\nand frequent hallucinations due to inadequate color differentiation and\ninsufficient meteorological knowledge. To address these challenges, we\nintroduce ClimateIQA, the first meteorological VQA dataset, which includes\n8,760 wind gust heatmaps and 254,040 question-answer pairs covering four\nquestion types, both generated from the latest climate reanalysis data. We also\npropose Sparse Position and Outline Tracking (SPOT), an innovative technique\nthat leverages OpenCV and K-Means clustering to capture and depict color\ncontours in heatmaps, providing ClimateIQA with more accurate color spatial\nlocation information. Finally, we present Climate-Zoo, the first meteorological\nVLM collection, which adapts VLMs to meteorological applications using the\nClimateIQA dataset. Experiment results demonstrate that models from Climate-Zoo\nsubstantially outperform state-of-the-art general VLMs, achieving an accuracy\nincrease from 0% to over 90% in EWED verification. The datasets and models in\nthis study are publicly available for future climate science research:\nhttps://github.com/AlexJJJChen/Climate-Zoo.", "paper_summary_zh": "<paragraph>極端天氣的即時偵測與預測能保護人類生命和基礎建設。傳統方法依賴於數值閾值設定和人工判讀帶有地理資訊系統 (GIS) 的天氣熱圖，這可能會很緩慢且容易出錯。我們的研究透過將極端天氣事件偵測 (EWED) 重新定義為視覺問答 (VQA) 問題，從而提出更精確且自動化的解決方案。我們利用視覺語言模型 (VLM) 來同時處理視覺和文字資料，提供有效的輔助工具來增強天氣熱圖的分析流程。我們對一般用途 VLM（例如 GPT-4-Vision）在 EWED 上的初步評估顯示效能不佳，其特徵是準確度低且頻繁出現幻覺，原因是顏色區分不足且氣象知識不足。為了應對這些挑戰，我們引入了 ClimateIQA，這是第一個氣象 VQA 資料集，其中包含 8,760 個陣風熱圖和 254,040 個問題解答對，涵蓋四種類型的問題，兩者都是從最新的氣候再分析資料中產生的。我們還提出了稀疏位置和輪廓追蹤 (SPOT)，這是一種創新的技術，利用 OpenCV 和 K-Means 聚類來擷取和描繪熱圖中的顏色輪廓，為 ClimateIQA 提供更準確的顏色空間位置資訊。最後，我們展示了 Climate-Zoo，這是第一個氣象 VLM 彙整，它使用 ClimateIQA 資料集將 VLM 調整為氣象應用程式。實驗結果表明，Climate-Zoo 中的模型大幅優於最先進的通用 VLM，在 EWED 驗證中將準確度從 0% 提高到 90% 以上。本研究中的資料集和模型公開提供，供未來的氣候科學研究使用：https://github.com/AlexJJJChen/Climate-Zoo。</paragraph>", "author": "Jian Chen et.al.", "authors": "Jian Chen, Peilin Zhou, Yining Hua, Dading Chong, Meng Cao, Yaowei Li, Zixuan Yuan, Bing Zhu, Junwei Liang", "id": "2406.09838v1", "paper_url": "http://arxiv.org/abs/2406.09838v1", "repo": "https://github.com/AlexJJJChen/Climate-Zoo"}}