{"2408.01221": {"publish_time": "2024-08-02", "title": "Rubric-based Learner Modelling via Noisy Gates Bayesian Networks for Computational Thinking Skills Assessment", "paper_summary": "In modern and personalised education, there is a growing interest in\ndeveloping learners' competencies and accurately assessing them. In a previous\nwork, we proposed a procedure for deriving a learner model for automatic skill\nassessment from a task-specific competence rubric, thus simplifying the\nimplementation of automated assessment tools. The previous approach, however,\nsuffered two main limitations: (i) the ordering between competencies defined by\nthe assessment rubric was only indirectly modelled; (ii) supplementary skills,\nnot under assessment but necessary for accomplishing the task, were not\nincluded in the model. In this work, we address issue (i) by introducing dummy\nobserved nodes, strictly enforcing the skills ordering without changing the\nnetwork's structure. In contrast, for point (ii), we design a network with two\nlayers of gates, one performing disjunctive operations by noisy-OR gates and\nthe other conjunctive operations through logical ANDs. Such changes improve the\nmodel outcomes' coherence and the modelling tool's flexibility without\ncompromising the model's compact parametrisation, interpretability and simple\nexperts' elicitation. We used this approach to develop a learner model for\nComputational Thinking (CT) skills assessment. The CT-cube skills assessment\nframework and the Cross Array Task (CAT) are used to exemplify it and\ndemonstrate its feasibility.", "paper_summary_zh": "在現代化且個人化的教育中，對於培養學習者的能力並準確地評量他們的能力，有越來越高的興趣。在先前的研究中，我們提出了一個程序，用來從特定任務的能力評量標準中，推導出一個學習者模型，用於自動化技能評估，進而簡化自動化評量工具的實作。然而，先前的作法有兩個主要的限制：(i) 由評量標準所定義的能力之間的順序，僅以間接的方式建模；(ii) 額外的技能，雖然沒有在評量中，但對於完成任務而言是必要的，並沒有包含在模型中。在這項研究中，我們透過引入虛擬的觀察節點，來解決問題 (i)，嚴格地強制執行技能的順序，而不會改變網路的結構。相反地，對於重點 (ii)，我們設計了一個具有兩層閘門的網路，一層透過 noisy-OR 閘門執行析取運算，另一層透過邏輯 AND 執行合取運算。這些變更改善了模型結果的一致性，以及建模工具的彈性，而不會影響模型的緊湊參數化、可解釋性，以及簡單的專家引導。我們使用這種方法，來開發一個用於計算思維 (CT) 技能評估的學習者模型。CT 立方技能評估架構和交叉陣列任務 (CAT) 用於舉例說明，並展示其可行性。", "author": "Giorgia Adorni et.al.", "authors": "Giorgia Adorni, Francesca Mangili, Alberto Piatti, Claudio Bonesana, Alessandro Antonucci", "id": "2408.01221v1", "paper_url": "http://arxiv.org/abs/2408.01221v1", "repo": "null"}}