{"2501.01014": {"publish_time": "2025-01-02", "title": "MDSF: Context-Aware Multi-Dimensional Data Storytelling Framework based on Large language Model", "paper_summary": "The exponential growth of data and advancements in big data technologies have\ncreated a demand for more efficient and automated approaches to data analysis\nand storytelling. However, automated data analysis systems still face\nchallenges in leveraging large language models (LLMs) for data insight\ndiscovery, augmented analysis, and data storytelling. This paper introduces the\nMultidimensional Data Storytelling Framework (MDSF) based on large language\nmodels for automated insight generation and context-aware storytelling. The\nframework incorporates advanced preprocessing techniques, augmented analysis\nalgorithms, and a unique scoring mechanism to identify and prioritize\nactionable insights. The use of fine-tuned LLMs enhances contextual\nunderstanding and generates narratives with minimal manual intervention. The\narchitecture also includes an agent-based mechanism for real-time storytelling\ncontinuation control. Key findings reveal that MDSF outperforms existing\nmethods across various datasets in terms of insight ranking accuracy,\ndescriptive quality, and narrative coherence. The experimental evaluation\ndemonstrates MDSF's ability to automate complex analytical tasks, reduce\ninterpretive biases, and improve user satisfaction. User studies further\nunderscore its practical utility in enhancing content structure, conclusion\nextraction, and richness of detail.", "paper_summary_zh": "隨著資料的指數成長與大數據技術的進步，對於更有效率且自動化的資料分析與說故事方法的需求也隨之而生。然而，自動化資料分析系統在利用大型語言模型 (LLM) 進行資料洞察發現、擴增分析和資料說故事時，仍面臨挑戰。本文介紹了基於大型語言模型的多維資料說故事架構 (MDSF)，用於自動洞察產生和情境感知說故事。此架構結合了先進的預處理技術、擴增分析演算法和獨特的計分機制，以識別和優先處理可操作的洞察。微調 LLM 的使用增強了脈絡理解，並在最少人工介入的情況下產生敘述。此架構還包括一個基於代理的機制，用於即時說故事的延續控制。主要發現顯示，MDSF 在洞察排名準確度、描述品質和敘事一致性方面，優於各種資料集中的現有方法。實驗評估證明了 MDSF 自動化複雜分析任務、減少詮釋偏差和提升使用者滿意度的能力。使用者研究進一步強調了其在增強內容結構、結論萃取和豐富細節方面的實用性。", "author": "Chengze Zhang et.al.", "authors": "Chengze Zhang, Changshan Li, Shiyang Gao", "id": "2501.01014v1", "paper_url": "http://arxiv.org/abs/2501.01014v1", "repo": "null"}}