{"2408.04270": {"publish_time": "2024-08-08", "title": "Analysis of Argument Structure Constructions in the Large Language Model BERT", "paper_summary": "This study investigates how BERT processes and represents Argument Structure\nConstructions (ASCs), extending previous LSTM analyses. Using a dataset of 2000\nsentences across four ASC types (transitive, ditransitive, caused-motion,\nresultative), we analyzed BERT's token embeddings across 12 layers.\nVisualizations with MDS and t-SNE and clustering quantified by Generalized\nDiscrimination Value (GDV) were used. Feedforward classifiers (probes)\npredicted construction categories from embeddings. CLS token embeddings\nclustered best in layers 2-4, decreased in intermediate layers, and slightly\nincreased in final layers. DET and SUBJ embeddings showed consistent clustering\nin intermediate layers, VERB embeddings increased in clustering from layer 1 to\n12, and OBJ embeddings peaked in layer 10. Probe accuracies indicated low\nconstruction information in layer 1, with over 90 percent accuracy from layer 2\nonward, revealing latent construction information beyond GDV clustering. Fisher\nDiscriminant Ratio (FDR) analysis of attention weights showed OBJ tokens were\ncrucial for differentiating ASCs, followed by VERB and DET tokens. SUBJ, CLS,\nand SEP tokens had insignificant FDR scores. This study highlights BERT's\nlayered processing of linguistic constructions and its differences from LSTMs.\nFuture research will compare these findings with neuroimaging data to\nunderstand the neural correlates of ASC processing. This research underscores\nneural language models' potential to mirror linguistic processing in the human\nbrain, offering insights into the computational and neural mechanisms\nunderlying language understanding.", "paper_summary_zh": "本研究探討 BERT 如何處理和表示論證結構構作 (ASC)，並擴展先前的 LSTM 分析。我們使用包含四種 ASC 類型的 2000 個句子的資料集（及物、雙及物、致使動態、結果），分析了 BERT 在 12 層中的標記嵌入。我們使用了 MDS 和 t-SNE 視覺化以及由廣義區分值 (GDV) 量化的分群。前饋分類器（探測器）根據嵌入預測構作類別。CLS 標記嵌入在第 2-4 層中最佳分群，在中間層中減少，在最後一層中略有增加。DET 和 SUBJ 嵌入在中間層中顯示一致的分群，VERB 嵌入從第 1 層到第 12 層的分群增加，而 OBJ 嵌入在第 10 層達到峰值。探測準確度表明第 1 層中的構作資訊較低，從第 2 層開始準確度超過 90%，揭示了超越 GDV 分群的潛在構作資訊。注意力權重的 Fisher 判別比 (FDR) 分析顯示，OBJ 標記對於區分 ASC 至關重要，其次是 VERB 和 DET 標記。SUBJ、CLS 和 SEP 標記的 FDR 分數微不足道。本研究強調了 BERT 對語言構作的分層處理及其與 LSTM 的區別。未來的研究將把這些發現與神經影像資料進行比較，以了解 ASC 處理的神經相關性。本研究強調了神經語言模型在反映人類大腦中語言處理方面的潛力，並提供了對語言理解的計算和神經機制的見解。", "author": "Pegah Ramezani et.al.", "authors": "Pegah Ramezani, Achim Schilling, Patrick Krauss", "id": "2408.04270v1", "paper_url": "http://arxiv.org/abs/2408.04270v1", "repo": "null"}}