{"2407.20383": {"publish_time": "2024-07-29", "title": "Appraisal-Guided Proximal Policy Optimization: Modeling Psychological Disorders in Dynamic Grid World", "paper_summary": "The integration of artificial intelligence across multiple domains has\nemphasized the importance of replicating human-like cognitive processes in AI.\nBy incorporating emotional intelligence into AI agents, their emotional\nstability can be evaluated to enhance their resilience and dependability in\ncritical decision-making tasks. In this work, we develop a methodology for\nmodeling psychological disorders using Reinforcement Learning (RL) agents. We\nutilized Appraisal theory to train RL agents in a dynamic grid world\nenvironment with an Appraisal-Guided Proximal Policy Optimization (AG-PPO)\nalgorithm. Additionally, we investigated numerous reward-shaping strategies to\nsimulate psychological disorders and regulate the behavior of the agents. A\ncomparison of various configurations of the modified PPO algorithm identified\nvariants that simulate Anxiety disorder and Obsessive-Compulsive Disorder\n(OCD)-like behavior in agents. Furthermore, we compared standard PPO with\nAG-PPO and its configurations, highlighting the performance improvement in\nterms of generalization capabilities. Finally, we conducted an analysis of the\nagents' behavioral patterns in complex test environments to evaluate the\nassociated symptoms corresponding to the psychological disorders. Overall, our\nwork showcases the benefits of the appraisal-guided PPO algorithm over the\nstandard PPO algorithm and the potential to simulate psychological disorders in\na controlled artificial environment and evaluate them on RL agents.", "paper_summary_zh": "跨多個領域整合人工智慧強調了在人工智慧中複製類人認知過程的重要性。透過將情緒智能納入人工智慧代理中，可以評估它們的情緒穩定性，以增強它們在關鍵決策任務中的復原力和可靠性。在這項工作中，我們開發了一種使用強化學習 (RL) 代理對心理疾病建模的方法。我們利用評估理論在具有評估引導近端策略優化 (AG-PPO) 演算法的動態網格世界環境中訓練 RL 代理。此外，我們研究了許多獎勵塑造策略，以模擬心理疾病並調節代理的行為。比較修改後 PPO 演算法的各種配置，找出模擬代理中焦慮症和強迫症 (OCD) 類似行為的變體。此外，我們將標準 PPO 與 AG-PPO 及其配置進行比較，強調了在泛化能力方面的效能改善。最後，我們對代理在複雜測試環境中的行為模式進行分析，以評估與心理疾病對應的相關症狀。總的來說，我們的研究展示了評估引導 PPO 演算法優於標準 PPO 演算法的優點，以及在受控人工環境中模擬心理疾病並在 RL 代理上評估它們的潛力。", "author": "Hari Prasad et.al.", "authors": "Hari Prasad, Chinnu Jacob, Imthias Ahamed T. P", "id": "2407.20383v1", "paper_url": "http://arxiv.org/abs/2407.20383v1", "repo": "null"}}