{"2409.15950": {"publish_time": "2024-09-24", "title": "TSFeatLIME: An Online User Study in Enhancing Explainability in Univariate Time Series Forecasting", "paper_summary": "Time series forecasting, while vital in various applications, often employs\ncomplex models that are difficult for humans to understand. Effective\nexplainable AI techniques are crucial to bridging the gap between model\npredictions and user understanding. This paper presents a framework -\nTSFeatLIME, extending TSLIME, tailored specifically for explaining univariate\ntime series forecasting. TSFeatLIME integrates an auxiliary feature into the\nsurrogate model and considers the pairwise Euclidean distances between the\nqueried time series and the generated samples to improve the fidelity of the\nsurrogate models. However, the usefulness of such explanations for human beings\nremains an open question. We address this by conducting a user study with 160\nparticipants through two interactive interfaces, aiming to measure how\nindividuals from different backgrounds can simulate or predict model output\nchanges in the treatment group and control group. Our results show that the\nsurrogate model under the TSFeatLIME framework is able to better simulate the\nbehaviour of the black-box considering distance, without sacrificing accuracy.\nIn addition, the user study suggests that the explanations were significantly\nmore effective for participants without a computer science background.", "paper_summary_zh": "時間序列預測雖然在各種應用中至關重要，但通常採用人類難以理解的複雜模型。有效的可解釋 AI 技術對於縮小模型預測和使用者理解之間的差距至關重要。本文提出了一個框架 - TSFeatLIME，擴展 TSLIME，專門用於解釋單變數時間序列預測。TSFeatLIME 將輔助特徵整合到替代模型中，並考慮查詢時間序列與生成樣本之間的成對歐幾里得距離，以提高替代模型的保真度。然而，此類解釋對人類的有用性仍然是一個開放的問題。我們通過一個包含 160 名參與者的使用者研究來解決這個問題，透過兩個互動介面，旨在衡量不同背景的個人如何模擬或預測治療組和對照組中的模型輸出變化。我們的結果表明，TSFeatLIME 框架下的替代模型能夠在不犧牲準確性的情況下，更好地模擬黑箱考慮距離的行為。此外，使用者研究表明，對於沒有電腦科學背景的參與者來說，這些解釋顯著地更有效。", "author": "Hongnan Ma et.al.", "authors": "Hongnan Ma, Kevin McAreavey, Weiru Liu", "id": "2409.15950v1", "paper_url": "http://arxiv.org/abs/2409.15950v1", "repo": "https://github.com/ts-xai/whyforecast"}}