{"2405.15122": {"publish_time": "2024-05-24", "title": "Generalizable and Scalable Multistage Biomedical Concept Normalization Leveraging Large Language Models", "paper_summary": "Background: Biomedical entity normalization is critical to biomedical\nresearch because the richness of free-text clinical data, such as progress\nnotes, can often be fully leveraged only after translating words and phrases\ninto structured and coded representations suitable for analysis. Large Language\nModels (LLMs), in turn, have shown great potential and high performance in a\nvariety of natural language processing (NLP) tasks, but their application for\nnormalization remains understudied.\n  Methods: We applied both proprietary and open-source LLMs in combination with\nseveral rule-based normalization systems commonly used in biomedical research.\nWe used a two-step LLM integration approach, (1) using an LLM to generate\nalternative phrasings of a source utterance, and (2) to prune candidate UMLS\nconcepts, using a variety of prompting methods. We measure results by\n$F_{\\beta}$, where we favor recall over precision, and F1.\n  Results: We evaluated a total of 5,523 concept terms and text contexts from a\npublicly available dataset of human-annotated biomedical abstracts.\nIncorporating GPT-3.5-turbo increased overall $F_{\\beta}$ and F1 in\nnormalization systems +9.5 and +7.3 (MetaMapLite), +13.9 and +10.9 (QuickUMLS),\nand +10.5 and +10.3 (BM25), while the open-source Vicuna model achieved +10.8\nand +12.2 (MetaMapLite), +14.7 and +15 (QuickUMLS), and +15.6 and +18.7 (BM25).\n  Conclusions: Existing general-purpose LLMs, both propriety and open-source,\ncan be leveraged at scale to greatly improve normalization performance using\nexisting tools, with no fine-tuning.", "paper_summary_zh": "<paragraph>背景：生物医学实体标准化对于生物医学研究至关重要，因为自由文本临床数据（例如进展记录）的丰富性通常只有在将单词和短语转换为适合分析的结构化和编码表示后才能得到充分利用。反过来，大语言模型 (LLM) 在各种自然语言处理 (NLP) 任务中显示出巨大的潜力和高性能，但它们在标准化方面的应用仍然未得到充分研究。\n方法：我们将专有和开源 LLM 与生物医学研究中常用的几个基于规则的标准化系统相结合。我们使用了两步 LLM 集成方法，（1）使用 LLM 生成源话语的替代措辞，以及（2）使用各种提示方法来修剪候选 UMLS 概念。我们通过 $F_{\\beta}$ 衡量结果，其中我们更倾向于召回率而不是准确率，以及 F1。\n结果：我们从人类注释的生物医学摘要的公开数据集评估了总共 5,523 个概念术语和文本上下文。结合 GPT-3.5-turbo 使标准化系统中的整体 $F_{\\beta}$ 和 F1 分别提高了 +9.5 和 +7.3（MetaMapLite），+13.9 和 +10.9（QuickUMLS），以及 +10.5 和 +10.3（BM25），而开源 Vicuna 模型分别提高了 +10.8 和 +12.2（MetaMapLite），+14.7 和 +15（QuickUMLS），以及 +15.6 和 +18.7（BM25）。\n结论：现有的通用 LLM，无论是专有的还是开源的，都可以大规模利用，以使用现有工具极大地提高标准化性能，而无需进行微调。</paragraph>", "author": "Nicholas J Dobbins et.al.", "authors": "Nicholas J Dobbins", "id": "2405.15122v1", "paper_url": "http://arxiv.org/abs/2405.15122v1", "repo": "null"}}