{"2410.20749": {"publish_time": "2024-10-28", "title": "Matryoshka: Learning to Drive Black-Box LLMs with LLMs", "paper_summary": "Despite the impressive generative abilities of black-box large language\nmodels (LLMs), their inherent opacity hinders further advancements in\ncapabilities such as reasoning, planning, and personalization. Existing works\naim to enhance LLM capabilities via domain-specific adaptation or in-context\nlearning, which require additional training on accessible model parameters, an\ninfeasible option for black-box LLMs. To address this challenge, we introduce\nMatryoshika, a lightweight white-box LLM controller that guides a large-scale\nblack-box LLM generator by decomposing complex tasks into a series of\nintermediate outputs. Specifically, we consider the black-box LLM as an\nenvironment, with Matryoshika serving as a policy to provide intermediate\nguidance through prompts for driving the black-box LLM. Matryoshika is trained\nto pivot the outputs of the black-box LLM aligning with preferences during\niterative interaction, which enables controllable multi-turn generation and\nself-improvement in optimizing intermediate guidance. Empirical evaluations on\nthree diverse tasks demonstrate that Matryoshika effectively enhances the\ncapabilities of black-box LLMs in complex, long-horizon tasks, including\nreasoning, planning, and personalization. By leveraging this pioneering\ncontroller-generator framework to mitigate dependence on model parameters,\nMatryoshika provides a transparent and practical solution for improving\nblack-box LLMs through controllable multi-turn generation using white-box LLMs.", "paper_summary_zh": "儘管黑盒大型語言模型 (LLM) 具有令人印象深刻的生成能力，但其內在的不透明性阻礙了推理、規劃和個人化等能力的進一步提升。現有作品旨在透過特定領域的適應或情境學習來增強 LLM 的能力，這需要對可存取的模型參數進行額外的訓練，對於黑盒 LLM 來說，這是一個不可行的選項。為了應對這一挑戰，我們引入了 Matryoshika，這是一個輕量級的白盒 LLM 控制器，它透過將複雜任務分解成一系列中間輸出，來引導一個大型的黑盒 LLM 生成器。具體來說，我們將黑盒 LLM 視為一個環境，而 Matryoshika 則扮演一個策略的角色，透過提示來提供中間指導，以驅動黑盒 LLM。Matryoshika 被訓練成在迭代互動期間，根據偏好調整黑盒 LLM 的輸出，這使得可控的多輪生成和在優化中間指導中的自我提升成為可能。在三個不同的任務上的實證評估表明，Matryoshika 有效地增強了黑盒 LLM 在複雜的、長期的任務中的能力，包括推理、規劃和個人化。透過利用這個開創性的控制器生成器框架來減輕對模型參數的依賴性，Matryoshika 提供了一個透明且實用的解決方案，透過使用白盒 LLM 進行可控的多輪生成來改進黑盒 LLM。", "author": "Changhao Li et.al.", "authors": "Changhao Li, Yuchen Zhuang, Rushi Qiang, Haotian Sun, Hanjun Dai, Chao Zhang, Bo Dai", "id": "2410.20749v1", "paper_url": "http://arxiv.org/abs/2410.20749v1", "repo": "null"}}