{"2412.14670": {"publish_time": "2024-12-19", "title": "Analysis and Visualization of Linguistic Structures in Large Language Models: Neural Representations of Verb-Particle Constructions in BERT", "paper_summary": "This study investigates the internal representations of verb-particle\ncombinations within transformer-based large language models (LLMs),\nspecifically examining how these models capture lexical and syntactic nuances\nat different neural network layers. Employing the BERT architecture, we analyse\nthe representational efficacy of its layers for various verb-particle\nconstructions such as 'agree on', 'come back', and 'give up'. Our methodology\nincludes a detailed dataset preparation from the British National Corpus,\nfollowed by extensive model training and output analysis through techniques\nlike multi-dimensional scaling (MDS) and generalized discrimination value (GDV)\ncalculations. Results show that BERT's middle layers most effectively capture\nsyntactic structures, with significant variability in representational accuracy\nacross different verb categories. These findings challenge the conventional\nuniformity assumed in neural network processing of linguistic elements and\nsuggest a complex interplay between network architecture and linguistic\nrepresentation. Our research contributes to a better understanding of how deep\nlearning models comprehend and process language, offering insights into the\npotential and limitations of current neural approaches to linguistic analysis.\nThis study not only advances our knowledge in computational linguistics but\nalso prompts further research into optimizing neural architectures for enhanced\nlinguistic precision.", "paper_summary_zh": "本研究探討基於 Transformer 的大型語言模型 (LLM) 中動詞-介系詞組合的內部表徵，特別檢視這些模型如何在不同的神經網路層捕捉詞彙和語法的細微差別。我們採用 BERT 架構，分析其各層對各種動詞-介系詞結構的表徵效能，例如「agree on」、「come back」和「give up」。我們的研究方法包括從英國國家語料庫中準備詳細的資料集，接著透過多維度縮放 (MDS) 和廣義判別值 (GDV) 計算等技術進行廣泛的模型訓練和輸出分析。結果顯示，BERT 的中間層最有效率地捕捉語法結構，而不同動詞類別在表徵準確性上存在顯著差異。這些發現挑戰了神經網路處理語言元素時假設的傳統均勻性，並暗示網路架構和語言表徵之間存在複雜的交互作用。我們的研究有助於更深入了解深度學習模型如何理解和處理語言，並提供對當前神經方法在語言分析中的潛力和限制的見解。本研究不僅提升了我們在計算語言學方面的知識，也促使進一步研究如何最佳化神經架構以增強語言精確度。", "author": "Hassane Kissane et.al.", "authors": "Hassane Kissane, Achim Schilling, Patrick Krauss", "id": "2412.14670v1", "paper_url": "http://arxiv.org/abs/2412.14670v1", "repo": "null"}}