{"2409.05007": {"publish_time": "2024-09-08", "title": "Audio-Guided Fusion Techniques for Multimodal Emotion Analysis", "paper_summary": "In this paper, we propose a solution for the semi-supervised learning track\n(MER-SEMI) in MER2024. First, in order to enhance the performance of the\nfeature extractor on sentiment classification tasks,we fine-tuned video and\ntext feature extractors, specifically CLIP-vit-large and Baichuan-13B, using\nlabeled data. This approach effectively preserves the original emotional\ninformation conveyed in the videos. Second, we propose an Audio-Guided\nTransformer (AGT) fusion mechanism, which leverages the robustness of\nHubert-large, showing superior effectiveness in fusing both inter-channel and\nintra-channel information. Third, To enhance the accuracy of the model, we\niteratively apply self-supervised learning by using high-confidence unlabeled\ndata as pseudo-labels. Finally, through black-box probing, we discovered an\nimbalanced data distribution between the training and test sets. Therefore, We\nadopt a prior-knowledge-based voting mechanism. The results demonstrate the\neffectiveness of our strategy, ultimately earning us third place in the\nMER-SEMI track.", "paper_summary_zh": "在本文中，我们针对 MER2024 中的半监督学习轨道 (MER-SEMI) 提出了一种解决方案。首先，为了提升特征提取器在情感分类任务中的性能，我们使用标记数据对视频和文本特征提取器（具体来说是 CLIP-vit-large 和 Baichuan-13B）进行了微调。这种方法有效地保留了视频中传达的原始情感信息。其次，我们提出了一种音频引导 Transformer (AGT) 融合机制，它利用了 Hubert-large 的鲁棒性，在融合通道间和通道内信息方面显示出卓越的有效性。第三，为了提高模型的准确性，我们通过使用高置信度未标记数据作为伪标签，迭代地应用自监督学习。最后，通过黑盒探测，我们发现训练集和测试集之间存在数据分布不平衡的问题。因此，我们采用基于先验知识的投票机制。结果证明了我们策略的有效性，最终让我们在 MER-SEMI 轨道中获得了第三名。", "author": "Pujin Shi et.al.", "authors": "Pujin Shi, Fei Gao", "id": "2409.05007v1", "paper_url": "http://arxiv.org/abs/2409.05007v1", "repo": "null"}}