{"2410.17711": {"publish_time": "2024-10-23", "title": "Beware of Calibration Data for Pruning Large Language Models", "paper_summary": "As large language models (LLMs) are widely applied across various fields,\nmodel compression has become increasingly crucial for reducing costs and\nimproving inference efficiency. Post-training pruning is a promising method\nthat does not require resource-intensive iterative training and only needs a\nsmall amount of calibration data to assess the importance of parameters.\nPrevious research has primarily focused on designing advanced pruning methods,\nwhile different calibration data's impact on pruning performance still lacks\nsystematical exploration. We fill this blank and surprisingly observe that the\neffects of calibration data even value more than designing advanced pruning\nstrategies, especially for high sparsity. Our preliminary exploration also\ndiscloses that using calibration data similar to the training data can yield\nbetter performance. As pre-training data is usually inaccessible for advanced\nLLMs, we further provide a self-generating calibration data synthesis strategy\nto construct feasible calibration data. We conduct experiments on the recent\nstrong open-source LLMs (e.g., DCLM, and LLaMA-3), and the results show that\nthe proposed method outperforms commonly used calibration data and can\neffectively enhance strong pruning methods (e.g., Wanda, OWL).", "paper_summary_zh": "隨著大型語言模型 (LLM) 廣泛應用於各個領域，\n模型壓縮對於降低成本和提高推理效率變得越來越重要。訓練後剪枝是一種很有前途的方法，它不需要資源密集的迭代訓練，只需要少量校準數據來評估參數的重要性。\n先前的研究主要集中於設計先進的剪枝方法，\n而不同校準數據對剪枝效能的影響仍然缺乏系統性的探討。我們填補了這個空白，並驚訝地觀察到校準數據的影響甚至比設計先進的剪枝策略更有價值，特別是對於高稀疏性。我們的初步探討也揭示了使用類似於訓練數據的校準數據可以產生更好的效能。由於預訓練數據通常無法用於先進的 LLM，我們進一步提供了一個自生校準數據合成策略來建構可行的校準數據。我們對最近的強大開源 LLM（例如，DCLM 和 LLaMA-3）進行了實驗，結果表明，所提出的方法優於常用的校準數據，並且可以有效增強強大的剪枝方法（例如，Wanda、OWL）。", "author": "Yixin Ji et.al.", "authors": "Yixin Ji, Yang Xiang, Juntao Li, Qingrong Xia, Ping Li, Xinyu Duan, Zhefeng Wang, Min Zhang", "id": "2410.17711v1", "paper_url": "http://arxiv.org/abs/2410.17711v1", "repo": "null"}}