{"2501.17399": {"publish_time": "2025-01-29", "title": "MultiChallenge: A Realistic Multi-Turn Conversation Evaluation Benchmark Challenging to Frontier LLMs", "paper_summary": "We present MultiChallenge, a pioneering benchmark evaluating large language\nmodels (LLMs) on conducting multi-turn conversations with human users, a\ncrucial yet underexamined capability for their applications. MultiChallenge\nidentifies four categories of challenges in multi-turn conversations that are\nnot only common and realistic among current human-LLM interactions, but are\nalso challenging to all current frontier LLMs. All 4 challenges require\naccurate instruction-following, context allocation, and in-context reasoning at\nthe same time. We also develop LLM as judge with instance-level rubrics to\nfacilitate an automatic evaluation method with fair agreement with experienced\nhuman raters. Despite achieving near-perfect scores on existing multi-turn\nevaluation benchmarks, all frontier models have less than 50% accuracy on\nMultiChallenge, with the top-performing Claude 3.5 Sonnet (June 2024) achieving\njust a 41.4% average accuracy.", "paper_summary_zh": "我們提出 MultiChallenge，一個開創性的基準，用於評估大型語言模型 (LLM) 與人類使用者進行多輪對話的能力，這是一個對其應用至關重要但尚未充分探討的能力。MultiChallenge 識別出多輪對話中的四種類別挑戰，這些挑戰不僅在當前人類與 LLM 的互動中常見且真實，而且對於所有當前的前沿 LLM 來說也是具有挑戰性的。所有 4 個挑戰同時需要準確的指令遵循、上下文分配和上下文推理。我們還開發了具有例項級別評分標準的 LLM 作為評審，以促進一種自動評估方法，該方法與經驗豐富的人類評分員達成公平的一致。儘管在現有的多輪評估基準上取得了接近完美的得分，但所有前沿模型在 MultiChallenge 上的準確率都低於 50%，表現最好的 Claude 3.5 Sonnet（2024 年 6 月）僅達到 41.4% 的平均準確率。", "author": "Ved Sirdeshmukh et.al.", "authors": "Ved Sirdeshmukh, Kaustubh Deshpande, Johannes Mols, Lifeng Jin, Ed-Yeremai Cardona, Dean Lee, Jeremy Kritz, Willow Primack, Summer Yue, Chen Xing", "id": "2501.17399v1", "paper_url": "http://arxiv.org/abs/2501.17399v1", "repo": "https://github.com/ekwinox117/multi-challenge"}}