{"2406.15245": {"publish_time": "2024-06-21", "title": "Unsupervised Morphological Tree Tokenizer", "paper_summary": "As a cornerstone in language modeling, tokenization involves segmenting text\ninputs into pre-defined atomic units. Conventional statistical tokenizers often\ndisrupt constituent boundaries within words, thereby corrupting semantic\ninformation. To address this drawback, we introduce morphological structure\nguidance to tokenization and propose a deep model to induce character-level\nstructures of words. Specifically, the deep model jointly encodes internal\nstructures and representations of words with a mechanism named\n$\\textit{MorphOverriding}$ to ensure the indecomposability of morphemes. By\ntraining the model with self-supervised objectives, our method is capable of\ninducing character-level structures that align with morphological rules without\nannotated training data. Based on the induced structures, our algorithm\ntokenizes words through vocabulary matching in a top-down manner. Empirical\nresults indicate that the proposed method effectively retains complete\nmorphemes and outperforms widely adopted methods such as BPE and WordPiece on\nboth morphological segmentation tasks and language modeling tasks. The code\nwill be released later.", "paper_summary_zh": "作為語言模型的基石，分詞涉及將文字輸入分段成預先定義的原子單位。傳統的統計分詞器經常會破壞字詞內的組成界線，進而損害語義資訊。為了解決這個缺點，我們在分詞中加入形態結構指引，並提出一個深度模型來誘導字詞的字元級結構。具體來說，深度模型會透過一種稱為「MorphOverriding」的機制，聯合編碼字詞的內部結構與表徵，以確保形態素的不可分解性。透過以自我監督目標訓練模型，我們的模型能夠在沒有標註訓練資料的情況下，誘導出與形態規則相符的字元級結構。我們的演算法根據誘導出的結構，從上而下地透過詞彙比對對字詞進行分詞。實證結果顯示，所提出的方法有效保留了完整的形態素，並且在形態分詞任務和語言模型任務上都優於廣泛採用的方法，例如 BPE 和 WordPiece。程式碼將在稍後釋出。", "author": "Qingyang Zhu et.al.", "authors": "Qingyang Zhu, Xiang Hu, Pengyu Ji, Wei Wu, Kewei Tu", "id": "2406.15245v1", "paper_url": "http://arxiv.org/abs/2406.15245v1", "repo": "null"}}