{"2410.02660": {"publish_time": "2024-10-03", "title": "How to Train Long-Context Language Models (Effectively)", "paper_summary": "We study continued training and supervised fine-tuning (SFT) of a language\nmodel (LM) to make effective use of long-context information. We first\nestablish a reliable evaluation protocol to guide model development -- Instead\nof perplexity or simple needle-in-a-haystack (NIAH) tests, we use a broad set\nof long-context tasks, and we evaluate models after SFT with instruction data\nas this better reveals long-context abilities. Supported by our robust\nevaluations, we run thorough experiments to decide the data mix for continued\npre-training, the instruction tuning dataset, and many other design choices. We\nfind that (1) code repositories and books are excellent sources of long data,\nbut it is crucial to combine them with high-quality short data; (2) training\nwith a sequence length beyond the evaluation length boosts long-context\nperformance; (3) for SFT, using only short instruction datasets yields strong\nperformance on long-context tasks. Our final model, ProLong-8B, which is\ninitialized from Llama-3 and trained on 40B tokens, demonstrates\nstate-of-the-art long-context performance among similarly sized models at a\nlength of 128K. ProLong outperforms Llama-3.18B-Instruct on the majority of\nlong-context tasks despite having seen only 5% as many tokens during\nlong-context training. Additionally, ProLong can effectively process up to 512K\ntokens, one of the longest context windows of publicly available LMs.", "paper_summary_zh": "<paragraph>我們研究持續訓練和監督微調 (SFT) 語言模型 (LM)，以有效利用長語境資訊。我們首先建立一個可靠的評估協定，以指導模型開發——我們使用廣泛的長語境任務，而不是困惑度或簡單的大海撈針 (NIAH) 測試，並在 SFT 後使用說明資料評估模型，因為這能更好地揭示長語境能力。在我們穩健的評估支持下，我們進行了徹底的實驗，以決定持續預訓練的資料組合、說明微調資料集和許多其他設計選擇。我們發現 (1) 程式碼儲存庫和書籍是長資料的絕佳來源，但將它們與高品質的短資料結合起來至關重要；(2) 使用超過評估長度的序列長度進行訓練會提升長語境效能；(3) 對於 SFT，僅使用短說明資料集會在長語境任務中產生強勁的效能。我們的最終模型 ProLong-8B，由 Llama-3 初始化並在 40B 個代幣上訓練，在長度為 128K 時展現出與類似規模模型相比最先進的長語境效能。儘管在長語境訓練期間僅看到 5% 的代幣，但 ProLong 在大多數長語境任務上都優於 Llama-3.18B-Instruct。此外，ProLong 可以有效處理多達 512K 個代幣，這是公開 LM 中最長的上下文視窗之一。</paragraph>", "author": "Tianyu Gao et.al.", "authors": "Tianyu Gao, Alexander Wettig, Howard Yen, Danqi Chen", "id": "2410.02660v1", "paper_url": "http://arxiv.org/abs/2410.02660v1", "repo": "https://github.com/princeton-nlp/prolong"}}