{"2412.12888": {"publish_time": "2024-12-17", "title": "ArtAug: Enhancing Text-to-Image Generation through Synthesis-Understanding Interaction", "paper_summary": "The emergence of diffusion models has significantly advanced image synthesis.\nThe recent studies of model interaction and self-corrective reasoning approach\nin large language models offer new insights for enhancing text-to-image models.\nInspired by these studies, we propose a novel method called ArtAug for\nenhancing text-to-image models in this paper. To the best of our knowledge,\nArtAug is the first one that improves image synthesis models via model\ninteractions with understanding models. In the interactions, we leverage human\npreferences implicitly learned by image understanding models to provide\nfine-grained suggestions for image synthesis models. The interactions can\nmodify the image content to make it aesthetically pleasing, such as adjusting\nexposure, changing shooting angles, and adding atmospheric effects. The\nenhancements brought by the interaction are iteratively fused into the\nsynthesis model itself through an additional enhancement module. This enables\nthe synthesis model to directly produce aesthetically pleasing images without\nany extra computational cost. In the experiments, we train the ArtAug\nenhancement module on existing text-to-image models. Various evaluation metrics\nconsistently demonstrate that ArtAug enhances the generative capabilities of\ntext-to-image models without incurring additional computational costs. The\nsource code and models will be released publicly.", "paper_summary_zh": "擴散模型的出現顯著地推動了影像合成。\n最近對於模型互動與自我修正推理方法的大型語言模型研究為增強文字轉影像模型提供了新的見解。\n受這些研究啟發，我們在本文中提出了一種稱為 ArtAug 的新方法，用於增強文字轉影像模型。\n據我們所知，ArtAug 是第一個透過模型與理解模型的互動來改善影像合成模型的方法。\n在互動過程中，我們利用影像理解模型隱含學習到的人類偏好，為影像合成模型提供細緻的建議。\n互動可以修改影像內容以使其美觀，例如調整曝光、改變拍攝角度和增加大氣效果。\n互動帶來的增強會透過額外的增強模組反覆融合到合成模型本身中。\n這使合成模型能夠直接產生美觀的影像，而無需任何額外的運算成本。\n在實驗中，我們在現有的文字轉影像模型上訓練 ArtAug 增強模組。\n各種評估指標一致地證明，ArtAug 增強了文字轉影像模型的生成能力，而不會產生額外的運算成本。\n原始碼和模型將公開發布。", "author": "Zhongjie Duan et.al.", "authors": "Zhongjie Duan, Qianyi Zhao, Cen Chen, Daoyuan Chen, Wenmeng Zhou, Yaliang Li, Yingda Chen", "id": "2412.12888v1", "paper_url": "http://arxiv.org/abs/2412.12888v1", "repo": "https://github.com/modelscope/DiffSynth-Studio"}}