{"2406.12402": {"publish_time": "2024-06-18", "title": "Flee the Flaw: Annotating the Underlying Logic of Fallacious Arguments Through Templates and Slot-filling", "paper_summary": "Prior research in computational argumentation has mainly focused on scoring\nthe quality of arguments, with less attention on explicating logical errors. In\nthis work, we introduce four sets of explainable templates for common informal\nlogical fallacies designed to explicate a fallacy's implicit logic. Using our\ntemplates, we conduct an annotation study on top of 400 fallacious arguments\ntaken from LOGIC dataset and achieve a high agreement score (Krippendorf's\nalpha of 0.54) and reasonable coverage (0.83). Finally, we conduct an\nexperiment for detecting the structure of fallacies and discover that\nstate-of-the-art language models struggle with detecting fallacy templates\n(0.47 accuracy). To facilitate research on fallacies, we make our dataset and\nguidelines publicly available.", "paper_summary_zh": "先前的計算論證研究主要集中在評分\n論證的品質，較少關注解釋邏輯謬誤。在\n這項工作中，我們介紹了四組可解釋的範本，用於常見的非正式\n邏輯謬誤，旨在解釋謬誤的隱含邏輯。使用我們的\n範本，我們對來自 LOGIC 資料集的 400 個謬誤論證進行註釋研究，並獲得高一致性分數（Krippendorf\n的 alpha 為 0.54）和合理的涵蓋範圍（0.83）。最後，我們進行了一項\n實驗，用於檢測謬誤的結構，並發現\n最先進的語言模型難以檢測謬誤範本\n（0.47 準確度）。為了促進對謬誤的研究，我們公開了我們的資料集和\n指南。", "author": "Irfan Robbani et.al.", "authors": "Irfan Robbani, Paul Reisert, Naoya Inoue, Surawat Pothong, Camélia Guerraoui, Wenzhi Wang, Shoichi Naito, Jungmin Choi, Kentaro Inui", "id": "2406.12402v1", "paper_url": "http://arxiv.org/abs/2406.12402v1", "repo": "null"}}