{"2410.16397": {"publish_time": "2024-10-21", "title": "Towards a Reliable Offline Personal AI Assistant for Long Duration Spaceflight", "paper_summary": "As humanity prepares for new missions to the Moon and Mars, astronauts will\nneed to operate with greater autonomy, given the communication delays that make\nreal-time support from Earth difficult. For instance, messages between Mars and\nEarth can take up to 24 minutes, making quick responses impossible. This\nlimitation poses a challenge for astronauts who must rely on in-situ tools to\naccess the large volume of data from spacecraft sensors, rovers, and\nsatellites, data that is often fragmented and difficult to use. To bridge this\ngap, systems like the Mars Exploration Telemetry-Driven Information System\n(METIS) are being developed. METIS is an AI assistant designed to handle\nroutine tasks, monitor spacecraft systems, and detect anomalies, all while\nreducing the reliance on mission control. Current Generative Pretrained\nTransformer (GPT) Models, while powerful, struggle in safety-critical\nenvironments. They can generate plausible but incorrect responses, a phenomenon\nknown as \"hallucination,\" which could endanger astronauts. To overcome these\nlimitations, this paper proposes enhancing systems like METIS by integrating\nGPTs, Retrieval-Augmented Generation (RAG), Knowledge Graphs (KGs), and\nAugmented Reality (AR). The idea is to allow astronauts to interact with their\ndata more intuitively, using natural language queries and visualizing real-time\ninformation through AR. KGs will be used to easily access live telemetry and\nmultimodal data, ensuring that astronauts have the right information at the\nright time. By combining AI, KGs, and AR, this new system will empower\nastronauts to work more autonomously, safely, and efficiently during future\nspace missions.", "paper_summary_zh": "隨著人類準備前往月球和火星執行新任務，考量到通訊延遲讓來自地球的即時支援變得困難，太空人將需要以更高的自主性執行任務。例如，火星和地球之間的訊息傳遞可能需要長達 24 分鐘，這使得快速回應變得不可能。這個限制對必須仰賴現場工具才能存取來自太空船感測器、探測車和衛星的大量資料的太空人來說是一項挑戰，而這些資料通常是片段且難以使用的。為了彌合這個差距，像火星探測遙測驅動資訊系統 (METIS) 之類的系統正在開發中。METIS 是一個 AI 助理，旨在處理例行工作、監控太空船系統和偵測異常，同時減少對任務控制的依賴。現有的生成式預訓練Transformer (GPT) 模型雖然強大，但在安全關鍵環境中卻難以發揮作用。它們可能會產生看似合理但錯誤的回應，這種現象稱為「幻覺」，可能會使太空人陷入危險。為了克服這些限制，本文提出透過整合 GPT、檢索增強生成 (RAG)、知識圖譜 (KG) 和擴增實境 (AR) 來增強像 METIS 之類的系統。這個想法是讓太空人能夠更直覺地與他們的資料互動，使用自然語言查詢並透過 AR 視覺化即時資訊。KG 將用於輕鬆存取即時遙測和多模式資料，確保太空人在適當的時間取得適當的資訊。透過結合 AI、KG 和 AR，這個新系統將賦能太空人在未來的太空任務中更自主、安全且有效率地工作。", "author": "Oliver Bensch et.al.", "authors": "Oliver Bensch, Leonie Bensch, Tommy Nilsson, Florian Saling, Wafa M. Sadri, Carsten Hartmann, Tobias Hecking, J. Nathan Kutz", "id": "2410.16397v1", "paper_url": "http://arxiv.org/abs/2410.16397v1", "repo": "null"}}