{"2501.08365": {"publish_time": "2025-01-14", "title": "Towards Best Practices for Open Datasets for LLM Training", "paper_summary": "Many AI companies are training their large language models (LLMs) on data\nwithout the permission of the copyright owners. The permissibility of doing so\nvaries by jurisdiction: in countries like the EU and Japan, this is allowed\nunder certain restrictions, while in the United States, the legal landscape is\nmore ambiguous. Regardless of the legal status, concerns from creative\nproducers have led to several high-profile copyright lawsuits, and the threat\nof litigation is commonly cited as a reason for the recent trend towards\nminimizing the information shared about training datasets by both corporate and\npublic interest actors. This trend in limiting data information causes harm by\nhindering transparency, accountability, and innovation in the broader ecosystem\nby denying researchers, auditors, and impacted individuals access to the\ninformation needed to understand AI models.\n  While this could be mitigated by training language models on open access and\npublic domain data, at the time of writing, there are no such models (trained\nat a meaningful scale) due to the substantial technical and sociological\nchallenges in assembling the necessary corpus. These challenges include\nincomplete and unreliable metadata, the cost and complexity of digitizing\nphysical records, and the diverse set of legal and technical skills required to\nensure relevance and responsibility in a quickly changing landscape. Building\ntowards a future where AI systems can be trained on openly licensed data that\nis responsibly curated and governed requires collaboration across legal,\ntechnical, and policy domains, along with investments in metadata standards,\ndigitization, and fostering a culture of openness.", "paper_summary_zh": "許多 AI 公司在沒有取得著作權所有者許可的情況下，使用資料來訓練大型語言模型 (LLM)。在不同司法管轄區，這種做法的合法性有所不同：在歐盟和日本等國家，在特定限制下允許此做法，而在美國，法律環境則較為模糊。無論法律地位如何，來自創意製作人的疑慮已導致多起引人注目的著作權訴訟，而訴訟威脅通常被視為近期企業和公共利益參與者趨向於盡量減少分享關於訓練資料集資訊的原因。限制資料資訊的趨勢會透過拒絕研究人員、稽核人員和受影響的個人取得理解 AI 模型所需的資訊，進而阻礙更廣泛生態系統中的透明度、問責制和創新，從而造成傷害。儘管透過在開放取用和公有領域資料上訓練語言模型可以減輕這個問題，但在撰寫本文時，由於在彙編必要的語料庫方面存在重大的技術和社會挑戰，因此並不存在此類模型（以有意義的規模訓練）。這些挑戰包括不完整且不可靠的元資料、數位化實體記錄的成本和複雜性，以及在快速變化的環境中確保相關性和責任所需的多樣化法律和技術技能。朝著 AI 系統能夠在負責任地策展和管理的開放授權資料上進行訓練的未來邁進，需要跨法律、技術和政策領域進行合作，並投資於元資料標準、數位化，以及培養開放文化。", "author": "Stefan Baack et.al.", "authors": "Stefan Baack, Stella Biderman, Kasia Odrozek, Aviya Skowron, Ayah Bdeir, Jillian Bommarito, Jennifer Ding, Maximilian Gahntz, Paul Keller, Pierre-Carl Langlais, Greg Lindahl, Sebastian Majstorovic, Nik Marda, Guilherme Penedo, Maarten Van Segbroeck, Jennifer Wang, Leandro von Werra, Mitchell Baker, Julie Belião, Kasia Chmielinski, Marzieh Fadaee, Lisa Gutermuth, Hynek Kydlíček, Greg Leppert, EM Lewis-Jong, Solana Larsen, Shayne Longpre, Angela Oduor Lungati, Cullen Miller, Victor Miller, Max Ryabinin, Kathleen Siminyu, Andrew Strait, Mark Surman, Anna Tumadóttir, Maurice Weber, Rebecca Weiss, Lee White, Thomas Wolf", "id": "2501.08365v1", "paper_url": "http://arxiv.org/abs/2501.08365v1", "repo": "null"}}