{"2409.15764": {"publish_time": "2024-09-24", "title": "Spatial-Temporal Mixture-of-Graph-Experts for Multi-Type Crime Prediction", "paper_summary": "As various types of crime continue to threaten public safety and economic\ndevelopment, predicting the occurrence of multiple types of crimes becomes\nincreasingly vital for effective prevention measures. Although extensive\nefforts have been made, most of them overlook the heterogeneity of different\ncrime categories and fail to address the issue of imbalanced spatial\ndistribution. In this work, we propose a Spatial-Temporal\nMixture-of-Graph-Experts (ST-MoGE) framework for collective multiple-type crime\nprediction. To enhance the model's ability to identify diverse spatial-temporal\ndependencies and mitigate potential conflicts caused by spatial-temporal\nheterogeneity of different crime categories, we introduce an attentive-gated\nMixture-of-Graph-Experts (MGEs) module to capture the distinctive and shared\ncrime patterns of each crime category. Then, we propose Cross-Expert\nContrastive Learning(CECL) to update the MGEs and force each expert to focus on\nspecific pattern modeling, thereby reducing blending and redundancy.\nFurthermore, to address the issue of imbalanced spatial distribution, we\npropose a Hierarchical Adaptive Loss Re-weighting (HALR) approach to eliminate\nbiases and insufficient learning of data-scarce regions. To evaluate the\neffectiveness of our methods, we conduct comprehensive experiments on two\nreal-world crime datasets and compare our results with twelve advanced\nbaselines. The experimental results demonstrate the superiority of our methods.", "paper_summary_zh": "隨著各種犯罪持續威脅公共安全和經濟發展，預測多種類型犯罪的發生對於有效的預防措施變得越來越重要。儘管付出了巨大的努力，但大多數都忽視了不同犯罪類別的異質性，並且未能解決空間分佈不平衡的問題。在這項工作中，我們提出了一個時空混合圖專家 (ST-MoGE) 框架，用於收集多種類型的犯罪預測。為了增強模型識別不同時空依賴性的能力並減輕由不同犯罪類別的時空異質性引起的潛在衝突，我們引入了一個專注門控混合圖專家 (MGE) 模組來擷取每個犯罪類別的獨特和共用犯罪模式。然後，我們提出跨專家對比學習 (CECL) 來更新 MGE 並迫使每個專家專注於特定的模式建模，從而減少混合和冗餘。此外，為了解決空間分佈不平衡的問題，我們提出了一種分層自適應損失重新加權 (HALR) 方法，以消除偏差和資料稀少區域的學習不足。為了評估我們方法的有效性，我們對兩個真實世界的犯罪資料集進行了全面的實驗，並將我們的結果與十二個先進的基準進行了比較。實驗結果證明了我們方法的優越性。", "author": "Ziyang Wu et.al.", "authors": "Ziyang Wu, Fan Liu, Jindong Han, Yuxuan Liang, Hao Liu", "id": "2409.15764v1", "paper_url": "http://arxiv.org/abs/2409.15764v1", "repo": "null"}}