{"2407.12620": {"publish_time": "2024-07-17", "title": "Harnessing the Power of Artificial Intelligence to Vitalize Endangered Indigenous Languages: Technologies and Experiences", "paper_summary": "Since 2022 we have been exploring application areas and technologies in which\nArtificial Intelligence (AI) and modern Natural Language Processing (NLP), such\nas Large Language Models (LLMs), can be employed to foster the usage and\nfacilitate the documentation of Indigenous languages which are in danger of\ndisappearing. We start by discussing the decreasing diversity of languages in\nthe world and how working with Indigenous languages poses unique ethical\nchallenges for AI and NLP. To address those challenges, we propose an\nalternative development AI cycle based on community engagement and usage. Then,\nwe report encouraging results in the development of high-quality machine\nlearning translators for Indigenous languages by fine-tuning state-of-the-art\n(SOTA) translators with tiny amounts of data and discuss how to avoid some\ncommon pitfalls in the process. We also present prototypes we have built in\nprojects done in 2023 and 2024 with Indigenous communities in Brazil, aimed at\nfacilitating writing, and discuss the development of Indigenous Language Models\n(ILMs) as a replicable and scalable way to create spell-checkers, next-word\npredictors, and similar tools. Finally, we discuss how we envision a future for\nlanguage documentation where dying languages are preserved as interactive\nlanguage models.", "paper_summary_zh": "自 2022 年以來，我們一直在探索人工智能 (AI) 和現代自然語言處理 (NLP) 的應用領域和技術，例如大型語言模型 (LLM)，它們可促進瀕臨消失的原住民語言的使用並促進其文件編寫。我們首先討論世界語言的多樣性下降，以及使用原住民語言如何對 AI 和 NLP 構成獨特的倫理挑戰。為了應對這些挑戰，我們提出了一個基於社區參與和使用的替代開發 AI 週期。然後，我們報告了在為原住民語言開發高品質機器學習翻譯器方面令人鼓舞的成果，方法是微調最先進 (SOTA) 翻譯器，並使用極少量數據，並討論如何避免在此過程中遇到一些常見的陷阱。我們還展示了我們在 2023 年和 2024 年與巴西的原住民社區合作完成的專案中建立的原型，旨在促進寫作，並討論原住民語言模型 (ILM) 的開發，作為一種可複製且可擴展的方式來建立拼寫檢查器、下一個單詞預測器和類似工具。最後，我們討論了我們如何設想語言文件編寫的未來，其中瀕臨消亡的語言被保留為互動語言模型。", "author": "Claudio Pinhanez et.al.", "authors": "Claudio Pinhanez, Paulo Cavalin, Luciana Storto, Thomas Fimbow, Alexander Cobbinah, Julio Nogima, Marisa Vasconcelos, Pedro Domingues, Priscila de Souza Mizukami, Nicole Grell, Majoí Gongora, Isabel Gonçalves", "id": "2407.12620v1", "paper_url": "http://arxiv.org/abs/2407.12620v1", "repo": "null"}}