{"2501.14701": {"publish_time": "2025-01-24", "title": "NLP-based assessment of prescription appropriateness from Italian referrals", "paper_summary": "Objective: This study proposes a Natural Language Processing pipeline to\nevaluate prescription appropriateness in Italian referrals, where reasons for\nprescriptions are recorded only as free text, complicating automated\ncomparisons with guidelines. The pipeline aims to derive, for the first time, a\ncomprehensive summary of the reasons behind these referrals and a\nquantification of their appropriateness. While demonstrated in a specific case\nstudy, the approach is designed to generalize to other types of examinations.\n  Methods: Leveraging embeddings from a transformer-based model, the proposed\napproach clusters referral texts, maps clusters to labels, and aligns these\nlabels with existing guidelines. We present a case study on a dataset of\n496,971 referrals, consisting of all referrals for venous echocolordopplers of\nthe lower limbs between 2019 and 2021 in the Lombardy Region. A sample of 1,000\nreferrals was manually annotated to validate the results.\n  Results: The pipeline exhibited high performance for referrals' reasons\n(Prec=92.43%, Rec=83.28%) and excellent results for referrals' appropriateness\n(Prec=93.58%, Rec=91.52%) on the annotated subset. Analysis of the entire\ndataset identified clusters matching guideline-defined reasons - both\nappropriate and inappropriate - as well as clusters not addressed in the\nguidelines. Overall, 34.32% of referrals were marked as appropriate, 34.07%\ninappropriate, 14.37% likely inappropriate, and 17.24% could not be mapped to\nguidelines.\n  Conclusions: The proposed pipeline effectively assessed prescription\nappropriateness across a large dataset, serving as a valuable tool for health\nauthorities. Findings have informed the Lombardy Region's efforts to strengthen\nrecommendations and reduce the burden of inappropriate referrals.", "paper_summary_zh": "<paragraph>目的：本研究提出一個自然語言處理管道，以評估義大利轉介處方的適當性，因為處方原因僅以自由文字記錄，這使得與指南的自動化比較變得複雜。該管道旨在首次得出這些轉介背後原因的全面摘要，並量化其適當性。雖然在具體案例研究中得到證明，但該方法旨在推廣到其他類型的檢查。\n方法：利用基於Transformer的模型中的嵌入，所提出的方法對轉介文本進行分群，將分群對應到標籤，並將這些標籤與現有指南對齊。我們對 496,971 個轉介組成的資料集進行案例研究，其中包括 2019 年至 2021 年倫巴底大區所有下肢靜脈超聲多普勒轉介。手動註釋了 1,000 個轉介樣本以驗證結果。\n結果：該管道對轉介原因表現出高性能（Prec=92.43%，Rec=83.28%），並且在註釋子集中對轉介適當性表現出極好的結果（Prec=93.58%，Rec=91.52%）。對整個資料集的分析識別出與指南定義的原因相匹配的分群 - 適當和不適當 - 以及指南中未涉及的分群。總體而言，34.32% 的轉介被標記為適當，34.07% 不適當，14.37% 可能不適當，17.24% 無法對應到指南。\n結論：所提出的管道有效地評估了大型資料集中的處方適當性，成為衛生主管部門的寶貴工具。研究結果為倫巴底大區加強建議和減少不適當轉介負擔的努力提供了依據。</paragraph>", "author": "Vittorio Torri et.al.", "authors": "Vittorio Torri, Annamaria Bottelli, Michele Ercolanoni, Olivia Leoni, Francesca Ieva", "id": "2501.14701v1", "paper_url": "http://arxiv.org/abs/2501.14701v1", "repo": "null"}}