{"2406.12830": {"publish_time": "2024-06-18", "title": "What Are the Odds? Language Models Are Capable of Probabilistic Reasoning", "paper_summary": "Language models (LM) are capable of remarkably complex linguistic tasks;\nhowever, numerical reasoning is an area in which they frequently struggle. An\nimportant but rarely evaluated form of reasoning is understanding probability\ndistributions. In this paper, we focus on evaluating the probabilistic\nreasoning capabilities of LMs using idealized and real-world statistical\ndistributions. We perform a systematic evaluation of state-of-the-art LMs on\nthree tasks: estimating percentiles, drawing samples, and calculating\nprobabilities. We evaluate three ways to provide context to LMs 1) anchoring\nexamples from within a distribution or family of distributions, 2) real-world\ncontext, 3) summary statistics on which to base a Normal approximation. Models\ncan make inferences about distributions, and can be further aided by the\nincorporation of real-world context, example shots and simplified assumptions,\neven if these assumptions are incorrect or misspecified. To conduct this work,\nwe developed a comprehensive benchmark distribution dataset with associated\nquestion-answer pairs that we will release publicly.", "paper_summary_zh": "語言模型 (LM) 能夠執行相當複雜的語言任務；\n然而，數值推理是一個它們經常會遇到的難題。一個重要但很少被評估的推理形式是理解機率分佈。在本文中，我們專注於使用理想化和真實世界的統計分佈來評估 LM 的機率推理能力。我們對最先進的 LM 進行了一項系統評估，任務有三個：估計百分位數、繪製樣本，以及計算機率。我們評估了三種向 LM 提供背景資訊的方法：1) 錨定來自分佈或分佈族內的範例，2) 真實世界的背景資訊，3) 用於作為常態近似基礎的摘要統計資料。模型可以對分佈進行推論，並且可以進一步透過納入真實世界的背景資訊、範例抽樣和簡化的假設來協助，即使這些假設是不正確或錯誤的。為了進行這項工作，我們開發了一個全面的基準分佈資料集，其中包含相關的問題解答對，我們將公開發布。", "author": "Akshay Paruchuri et.al.", "authors": "Akshay Paruchuri, Jake Garrison, Shun Liao, John Hernandez, Jacob Sunshine, Tim Althoff, Xin Liu, Daniel McDuff", "id": "2406.12830v1", "paper_url": "http://arxiv.org/abs/2406.12830v1", "repo": "null"}}