{"2410.12499": {"publish_time": "2024-10-16", "title": "With a Grain of SALT: Are LLMs Fair Across Social Dimensions?", "paper_summary": "This paper presents an analysis of biases in open-source Large Language\nModels (LLMs) across various genders, religions, and races. We introduce a\nmethodology for generating a bias detection dataset using seven bias triggers:\nGeneral Debate, Positioned Debate, Career Advice, Story Generation,\nProblem-Solving, Cover-Letter Writing, and CV Generation. We use GPT-4o to\ngenerate a diverse set of prompts for each trigger across various genders,\nreligious and racial groups. We evaluate models from Llama and Gemma family on\nthe generated dataset. We anonymise the LLM-generated text associated with each\ngroup using GPT-4o-mini and do a pairwise comparison using GPT-4o-as-a-Judge.\nTo quantify bias in the LLM-generated text we use the number of wins and losses\nin the pairwise comparison. Our analysis spans three languages, English,\nGerman, and Arabic to explore how language influences bias manifestation. Our\nfindings reveal that LLMs exhibit strong polarization toward certain groups\nacross each category, with a notable consistency observed across models.\nHowever, when switching languages, variations and anomalies emerge, often\nattributable to cultural cues and contextual differences.", "paper_summary_zh": "這篇論文分析了開放原始碼大型語言模型 (LLM) 中各種性別、宗教和種族偏見。我們引入了一種生成偏見檢測資料集的方法，使用七個偏見觸發器：一般性辯論、立場辯論、職業建議、故事生成、問題解決、求職信撰寫和履歷生成。我們使用 GPT-4o 為各種性別、宗教和種族群體的每個觸發器生成一組多樣的提示。我們根據生成的資料集評估了 Llama 和 Gemma 家族的模型。我們使用 GPT-4o-mini 對與每個群組相關的 LLM 生成的文字進行匿名化，並使用 GPT-4o-as-a-Judge 進行成對比較。為了量化 LLM 生成的文字中的偏見，我們使用成對比較中的勝利和失敗次數。我們的分析涵蓋了英語、德語和阿拉伯語三種語言，以探討語言如何影響偏見表現。我們的研究結果表明，LLM 對每個類別中的某些群體表現出強烈的兩極分化，並且在各個模型中觀察到顯著的一致性。然而，在切換語言時，會出現變異和異常，通常歸因於文化線索和背景差異。", "author": "Samee Arif et.al.", "authors": "Samee Arif, Zohaib Khan, Agha Ali Raza, Awais Athar", "id": "2410.12499v1", "paper_url": "http://arxiv.org/abs/2410.12499v1", "repo": "null"}}