{"2408.16073": {"publish_time": "2024-08-28", "title": "Using Large Language Models to Create AI Personas for Replication and Prediction of Media Effects: An Empirical Test of 133 Published Experimental Research Findings", "paper_summary": "This report analyzes the potential for large language models (LLMs) to\nexpedite accurate replication of published message effects studies. We tested\nLLM-powered participants (personas) by replicating 133 experimental findings\nfrom 14 papers containing 45 recent studies in the Journal of Marketing\n(January 2023-May 2024). We used a new software tool, Viewpoints AI\n(https://viewpoints.ai/), that takes study designs, stimuli, and measures as\ninput, automatically generates prompts for LLMs to act as a specified sample of\nunique personas, and collects their responses to produce a final output in the\nform of a complete dataset and statistical analysis. The underlying LLM used\nwas Anthropic's Claude Sonnet 3.5. We generated 19,447 AI personas to replicate\nthese studies with the exact same sample attributes, study designs, stimuli,\nand measures reported in the original human research. Our LLM replications\nsuccessfully reproduced 76% of the original main effects (84 out of 111),\ndemonstrating strong potential for AI-assisted replication of studies in which\npeople respond to media stimuli. When including interaction effects, the\noverall replication rate was 68% (90 out of 133). The use of LLMs to replicate\nand accelerate marketing research on media effects is discussed with respect to\nthe replication crisis in social science, potential solutions to\ngeneralizability problems in sampling subjects and experimental conditions, and\nthe ability to rapidly test consumer responses to various media stimuli. We\nalso address the limitations of this approach, particularly in replicating\ncomplex interaction effects in media response studies, and suggest areas for\nfuture research and improvement in AI-assisted experimental replication of\nmedia effects.", "paper_summary_zh": "<paragraph>本報告分析大型語言模型 (LLM) 促進準確複製已發表的訊息效果研究的潛力。我們透過複製《行銷期刊》(2023 年 1 月至 2024 年 5 月) 中 14 篇論文中的 45 項近期研究的 133 項實驗發現，來測試由 LLM 驅動的參與者 (角色)。我們使用一個新的軟體工具 Viewpoints AI (https://viewpoints.ai/)，它將研究設計、刺激和測量作為輸入，自動為 LLM 生成提示，讓 LLM 作為指定樣本的獨特角色，並收集它們的回應，以產生一個完整的資料集和統計分析作為最終輸出。所使用的基礎 LLM 是 Anthropic 的 Claude Sonnet 3.5。我們生成了 19,447 個 AI 角色，以複製這些研究，這些研究具有與原始人類研究中報告的完全相同的樣本屬性、研究設計、刺激和測量。我們的 LLM 複製成功複製了 76% 的原始主要效果 (111 個中的 84 個)，證明了 AI 輔助複製人們對媒體刺激做出回應的研究具有強大的潛力。在納入交互作用時，整體複製率為 68% (133 個中的 90 個)。使用 LLM 來複製和加速媒體效果的行銷研究，會針對社會科學中的複製危機、抽樣主體和實驗條件的概化問題的潛在解決方案，以及快速測試消費者對各種媒體刺激的反應的能力進行討論。我們也探討了這種方法的限制，特別是在複製媒體反應研究中的複雜交互作用時，並建議未來在 AI 輔助的實驗複製媒體效果方面進行研究和改進。</paragraph>", "author": "Leo Yeykelis et.al.", "authors": "Leo Yeykelis, Kaavya Pichai, James J. Cummings, Byron Reeves", "id": "2408.16073v1", "paper_url": "http://arxiv.org/abs/2408.16073v1", "repo": "null"}}