{"2409.09787": {"publish_time": "2024-09-15", "title": "BEnDEM:A Boltzmann Sampler Based on Bootstrapped Denoising Energy Matching", "paper_summary": "Developing an efficient sampler capable of generating independent and\nidentically distributed (IID) samples from a Boltzmann distribution is a\ncrucial challenge in scientific research, e.g. molecular dynamics. In this\nwork, we intend to learn neural samplers given energy functions instead of data\nsampled from the Boltzmann distribution. By learning the energies of the noised\ndata, we propose a diffusion-based sampler, ENERGY-BASED DENOISING ENERGY\nMATCHING, which theoretically has lower variance and more complexity compared\nto related works. Furthermore, a novel bootstrapping technique is applied to\nEnDEM to balance between bias and variance. We evaluate EnDEM and BEnDEM on a\n2-dimensional 40 Gaussian Mixture Model (GMM) and a 4-particle double-welling\npotential (DW-4). The experimental results demonstrate that BEnDEM can achieve\nstate-of-the-art performance while being more robust.", "paper_summary_zh": "開發一個能從波茲曼分佈產生獨立且同分布 (IID) 樣本的高效取樣器，是科學研究（例如分子動力學）中的一項重要挑戰。在這項工作中，我們打算學習神經取樣器，給定能量函數，而不是從波茲曼分佈中取樣到的資料。透過學習雜訊資料的能量，我們提出一個基於擴散的取樣器，基於能量的去雜訊能量匹配，理論上與相關工作相比，具有較低的變異數和較高的複雜度。此外，將一種新穎的自舉技術應用於 EnDEM，以平衡偏差和變異。我們在 2 維 40 高斯混合模型 (GMM) 和 4 粒子雙阱位能 (DW-4) 上評估 EnDEM 和 BEnDEM。實驗結果表明，BEnDEM 可以實現最先進的效能，同時更具有穩健性。", "author": "RuiKang OuYang et.al.", "authors": "RuiKang OuYang, Bo Qiang, José Miguel Hernández-Lobato", "id": "2409.09787v1", "paper_url": "http://arxiv.org/abs/2409.09787v1", "repo": "null"}}