{"2407.08906": {"publish_time": "2024-07-12", "title": "AirSketch: Generative Motion to Sketch", "paper_summary": "Illustration is a fundamental mode of human expression and communication.\nCertain types of motion that accompany speech can provide this illustrative\nmode of communication. While Augmented and Virtual Reality technologies (AR/VR)\nhave introduced tools for producing drawings with hand motions (air drawing),\nthey typically require costly hardware and additional digital markers, thereby\nlimiting their accessibility and portability. Furthermore, air drawing demands\nconsiderable skill to achieve aesthetic results. To address these challenges,\nwe introduce the concept of AirSketch, aimed at generating faithful and\nvisually coherent sketches directly from hand motions, eliminating the need for\ncomplicated headsets or markers. We devise a simple augmentation-based\nself-supervised training procedure, enabling a controllable image diffusion\nmodel to learn to translate from highly noisy hand tracking images to clean,\naesthetically pleasing sketches, while preserving the essential visual cues\nfrom the original tracking data. We present two air drawing datasets to study\nthis problem. Our findings demonstrate that beyond producing photo-realistic\nimages from precise spatial inputs, controllable image diffusion can\neffectively produce a refined, clear sketch from a noisy input. Our work serves\nas an initial step towards marker-less air drawing and reveals distinct\napplications of controllable diffusion models to AirSketch and AR/VR in\ngeneral.", "paper_summary_zh": "插圖是人類表達和溝通的基本模式。\n某些伴隨言語的動作類型可以提供這種說明性的溝通模式。儘管擴增實境和虛擬實境技術 (AR/VR) 已引入使用手部動作繪製圖畫的工具 (空中繪圖)，但它們通常需要昂貴的硬體和額外的數位標記，從而限制了它們的可及性和可攜性。此外，空中繪圖需要相當的技巧才能達到美學效果。為了應對這些挑戰，我們引入了 AirSketch 的概念，旨在直接從手部動作中產生逼真且視覺連貫的草圖，無需複雜的頭戴式裝置或標記。我們設計了一個基於簡單擴增的自監督訓練程序，使可控制的影像擴散模型能夠學習從極度雜訊的手部追蹤影像轉換成乾淨、美觀的草圖，同時保留原始追蹤資料中的基本視覺線索。我們提供了兩個空中繪圖資料集來研究這個問題。我們的研究結果表明，除了根據精確的空間輸入產生逼真的影像之外，可控制的影像擴散還能有效地根據雜訊輸入產生精緻、清晰的草圖。我們的研究作為無標記空中繪圖的初步步驟，並揭示了可控制擴散模型在 AirSketch 和 AR/VR 中的獨特應用。", "author": "Hui Xian Grace Lim et.al.", "authors": "Hui Xian Grace Lim, Xuanming Cui, Yogesh S Rawat, Ser-Nam Lim", "id": "2407.08906v1", "paper_url": "http://arxiv.org/abs/2407.08906v1", "repo": "null"}}