{"2411.02708": {"publish_time": "2024-11-05", "title": "Exploring Response Uncertainty in MLLMs: An Empirical Evaluation under Misleading Scenarios", "paper_summary": "Ensuring that Multimodal Large Language Models (MLLMs) maintain consistency\nin their responses is essential for developing trustworthy multimodal\nintelligence. However, existing benchmarks include many samples where all MLLMs\n\\textit{exhibit high response uncertainty when encountering misleading\ninformation}, requiring even 5-15 response attempts per sample to effectively\nassess uncertainty. Therefore, we propose a two-stage pipeline: first, we\ncollect MLLMs' responses without misleading information, and then gather\nmisleading ones via specific misleading instructions. By calculating the\nmisleading rate, and capturing both correct-to-incorrect and\nincorrect-to-correct shifts between the two sets of responses, we can\neffectively metric the model's response uncertainty. Eventually, we establish a\n\\textbf{\\underline{M}}ultimodal \\textbf{\\underline{U}}ncertainty\n\\textbf{\\underline{B}}enchmark (\\textbf{MUB}) that employs both explicit and\nimplicit misleading instructions to comprehensively assess the vulnerability of\nMLLMs across diverse domains. Our experiments reveal that all open-source and\nclose-source MLLMs are highly susceptible to misleading instructions, with an\naverage misleading rate exceeding 86\\%. To enhance the robustness of MLLMs, we\nfurther fine-tune all open-source MLLMs by incorporating explicit and implicit\nmisleading data, which demonstrates a significant reduction in misleading\nrates. Our code is available at:\n\\href{https://github.com/Yunkai696/MUB}{https://github.com/Yunkai696/MUB}", "paper_summary_zh": "<paragraph>確保多模態大型語言模型 (MLLM) 在其回應中保持一致性，對於開發值得信賴的多模態智能至關重要。然而，現有的基準包含許多範例，其中所有 MLLM \\textit{在遇到誤導性資訊時展現出高度的回應不確定性}，需要每個範例 5-15 次的回應嘗試才能有效評估不確定性。因此，我們提出一個兩階段流程：首先，我們收集 MLLM 在沒有誤導性資訊下的回應，然後透過特定的誤導性指示收集誤導性資訊。透過計算誤導率，並擷取兩組回應之間從正確到不正確以及從不正確到正確的轉變，我們可以有效地衡量模型的回應不確定性。最後，我們建立一個\\textbf{\\underline{M}}ultimodal \\textbf{\\underline{U}}ncertainty \\textbf{\\underline{B}}enchmark (\\textbf{MUB})，它採用明確和隱含的誤導性指示，以全面評估 MLLM 在不同領域的脆弱性。我們的實驗揭露，所有開源和閉源 MLLM 都極易受到誤導性指示的影響，平均誤導率超過 86%。為了提升 MLLM 的穩健性，我們進一步微調所有開源 MLLM，方法是納入明確和隱含的誤導性資料，這證明誤導率有顯著的降低。我們的程式碼可在以下位置取得：\n\\href{https://github.com/Yunkai696/MUB}{https://github.com/Yunkai696/MUB}</paragraph>", "author": "Yunkai Dang et.al.", "authors": "Yunkai Dang, Mengxi Gao, Yibo Yan, Xin Zou, Yanggan Gu, Aiwei Liu, Xuming Hu", "id": "2411.02708v1", "paper_url": "http://arxiv.org/abs/2411.02708v1", "repo": "null"}}