{"2504.13180": {"publish_time": "2025-04-17", "title": "PerceptionLM: Open-Access Data and Models for Detailed Visual Understanding", "paper_summary": "Vision-language models are integral to computer vision research, yet many\nhigh-performing models remain closed-source, obscuring their data, design and\ntraining recipe. The research community has responded by using distillation\nfrom black-box models to label training data, achieving strong benchmark\nresults, at the cost of measurable scientific progress. However, without\nknowing the details of the teacher model and its data sources, scientific\nprogress remains difficult to measure. In this paper, we study building a\nPerception Language Model (PLM) in a fully open and reproducible framework for\ntransparent research in image and video understanding. We analyze standard\ntraining pipelines without distillation from proprietary models and explore\nlarge-scale synthetic data to identify critical data gaps, particularly in\ndetailed video understanding. To bridge these gaps, we release 2.8M\nhuman-labeled instances of fine-grained video question-answer pairs and\nspatio-temporally grounded video captions. Additionally, we introduce\nPLM-VideoBench, a suite for evaluating challenging video understanding tasks\nfocusing on the ability to reason about \"what\", \"where\", \"when\", and \"how\" of a\nvideo. We make our work fully reproducible by providing data, training recipes,\ncode & models.", "paper_summary_zh": "<paragraph>視覺語言模型是電腦視覺研究不可或缺的一部分，然而許多高效能模型仍然是閉源的，遮蔽了它們的數據、設計和訓練方法。研究社群的應對方式是使用從黑盒模型中提取的知識來標記訓練數據，從而在基準測試中取得了不錯的成績，但卻犧牲了可衡量的科學進展。然而，如果不知道教師模型的細節及其數據來源，就很難衡量科學進展。在本文中，我們研究了在完全開放和可復現的框架下構建感知語言模型 (PLM)，以促進圖像和視頻理解方面的透明研究。我們分析了不使用專有模型蒸餾的標準訓練流程，並探索了大規模合成數據，以識別關鍵的數據缺口，尤其是在詳細的視頻理解方面。為了彌合這些缺口，我們發布了 280 萬個人工標記的細粒度視頻問答對和時空定位的視頻字幕實例。此外，我們還推出了 PLM-VideoBench，這是一套用於評估具有挑戰性的視頻理解任務的工具，重點關注對視頻的「什麼」、「哪裡」、「何時」和「如何」進行推理的能力。我們通過提供數據、訓練方法、程式碼和模型，使我們的工作完全可復現。</paragraph>\n", "author": "Jang Hyun Cho et.al.", "authors": "Jang Hyun Cho, Andrea Madotto, Effrosyni Mavroudi, Triantafyllos Afouras, Tushar Nagarajan, Muhammad Maaz, Yale Song, Tengyu Ma, Shuming Hu, Suyog Jain, Miguel Martin, Huiyu Wang, Hanoona Rasheed, Peize Sun, Po-Yao Huang, Daniel Bolya, Nikhila Ravi, Shashank Jain, Tammy Stark, Shane Moon, Babak Damavandi, Vivian Lee, Andrew Westbury, Salman Khan, Philipp Krähenbühl, Piotr Dollár, Lorenzo Torresani, Kristen Grauman, Christoph Feichtenhofer", "id": "2504.13180v1", "paper_url": "http://arxiv.org/abs/2504.13180v1", "repo": "null"}}