{"2407.06056": {"publish_time": "2024-07-08", "title": "Stranger Danger! Identifying and Avoiding Unpredictable Pedestrians in RL-based Social Robot Navigation", "paper_summary": "Reinforcement learning (RL) methods for social robot navigation show great\nsuccess navigating robots through large crowds of people, but the performance\nof these learning-based methods tends to degrade in particularly challenging or\nunfamiliar situations due to the models' dependency on representative training\ndata. To ensure human safety and comfort, it is critical that these algorithms\nhandle uncommon cases appropriately, but the low frequency and wide diversity\nof such situations present a significant challenge for these data-driven\nmethods. To overcome this challenge, we propose modifications to the learning\nprocess that encourage these RL policies to maintain additional caution in\nunfamiliar situations. Specifically, we improve the Socially Attentive\nReinforcement Learning (SARL) policy by (1) modifying the training process to\nsystematically introduce deviations into a pedestrian model, (2) updating the\nvalue network to estimate and utilize pedestrian-unpredictability features, and\n(3) implementing a reward function to learn an effective response to pedestrian\nunpredictability. Compared to the original SARL policy, our modified policy\nmaintains similar navigation times and path lengths, while reducing the number\nof collisions by 82% and reducing the proportion of time spent in the\npedestrians' personal space by up to 19 percentage points for the most\ndifficult cases. We also describe how to apply these modifications to other RL\npolicies and demonstrate that some key high-level behaviors of our approach\ntransfer to a physical robot.", "paper_summary_zh": "社交機器人導航的強化學習 (RL) 方法在引導機器人在大量人群中穿梭時展現出極佳的成功，但這些基於學習的方法的表現往往會在特別具有挑戰性或不熟悉的情況下下降，這是由於模型依賴於具有代表性的訓練資料。為了確保人類的安全和舒適，這些演算法必須適當地處理不常見的情況至關重要，但這些情況的低頻率和廣泛多樣性對這些資料驅動的方法構成了重大挑戰。為了克服這個挑戰，我們建議對學習過程進行修改，以鼓勵這些 RL 政策在不熟悉的情況下保持額外的謹慎。具體來說，我們透過 (1) 修改訓練過程以系統性地將偏差引入行人模型、(2) 更新價值網路以估計和利用行人不可預測性特徵，以及 (3) 實施獎勵函數來學習對行人不可預測性的有效反應來改進社交注意力強化學習 (SARL) 政策。與原始 SARL 政策相比，我們的修改政策維持類似的導航時間和路徑長度，同時將碰撞次數減少 82%，並將在行人個人空間中所花費的時間比例最多減少 19 個百分點，以應對最困難的情況。我們還描述如何將這些修改應用於其他 RL 政策，並證明我們的方法的一些關鍵高階行為可以轉移到物理機器人。", "author": "Sara Pohland et.al.", "authors": "Sara Pohland, Alvin Tan, Prabal Dutta, Claire Tomlin", "id": "2407.06056v1", "paper_url": "http://arxiv.org/abs/2407.06056v1", "repo": "https://github.com/sarapohland/stranger-danger"}}