{"2408.05748": {"publish_time": "2024-08-11", "title": "Low-Dimensional Federated Knowledge Graph Embedding via Knowledge Distillation", "paper_summary": "Federated Knowledge Graph Embedding (FKGE) aims to facilitate collaborative\nlearning of entity and relation embeddings from distributed Knowledge Graphs\n(KGs) across multiple clients, while preserving data privacy. Training FKGE\nmodels with higher dimensions is typically favored due to their potential for\nachieving superior performance. However, high-dimensional embeddings present\nsignificant challenges in terms of storage resource and inference speed. Unlike\ntraditional KG embedding methods, FKGE involves multiple client-server\ncommunication rounds, where communication efficiency is critical. Existing\nembedding compression methods for traditional KGs may not be directly\napplicable to FKGE as they often require multiple model trainings which\npotentially incur substantial communication costs. In this paper, we propose a\nlight-weight component based on Knowledge Distillation (KD) which is titled\nFedKD and tailored specifically for FKGE methods. During client-side local\ntraining, FedKD facilitates the low-dimensional student model to mimic the\nscore distribution of triples from the high-dimensional teacher model using KL\ndivergence loss. Unlike traditional KD way, FedKD adaptively learns a\ntemperature to scale the score of positive triples and separately adjusts the\nscores of corresponding negative triples using a predefined temperature,\nthereby mitigating teacher over-confidence issue. Furthermore, we dynamically\nadjust the weight of KD loss to optimize the training process. Extensive\nexperiments on three datasets support the effectiveness of FedKD.", "paper_summary_zh": "联邦知识图嵌入（FKGE）旨在促进来自多个客户端的分布式知识图（KG）中实体和关系嵌入的协作学习，同时保护数据隐私。通常青睐训练具有更高维度的 FKGE 模型，因为它们具有实现卓越性能的潜力。然而，高维嵌入在存储资源和推理速度方面提出了重大挑战。与传统的 KG 嵌入方法不同，FKGE 涉及多个客户端-服务器通信回合，其中通信效率至关重要。传统的 KG 的现有嵌入压缩方法可能不直接适用于 FKGE，因为它们通常需要多次模型训练，这可能会产生大量的通信成本。在本文中，我们提出了一种基于知识蒸馏（KD）的轻量级组件，称为 FedKD，并专门针对 FKGE 方法量身定制。在客户端本地训练期间，FedKD 促进低维学生模型使用 KL 散度损失来模仿高维教师模型中三元组的分数分布。与传统的 KD 方式不同，FedKD 自适应地学习温度以缩放正三元组的分数，并使用预定义的温度分别调整相应负三元组的分数，从而减轻教师过度自信的问题。此外，我们动态调整 KD 损失的权重以优化训练过程。在三个数据集上的大量实验支持了 FedKD 的有效性。", "author": "Xiaoxiong Zhang et.al.", "authors": "Xiaoxiong Zhang, Zhiwei Zeng, Xin Zhou, Zhiqi Shen", "id": "2408.05748v1", "paper_url": "http://arxiv.org/abs/2408.05748v1", "repo": "null"}}