{"2409.09741": {"publish_time": "2024-09-15", "title": "Benchmarking LLMs in Political Content Text-Annotation: Proof-of-Concept with Toxicity and Incivility Data", "paper_summary": "This article benchmarked the ability of OpenAI's GPTs and a number of\nopen-source LLMs to perform annotation tasks on political content. We used a\nnovel protest event dataset comprising more than three million digital\ninteractions and created a gold standard that includes ground-truth labels\nannotated by human coders about toxicity and incivility on social media. We\nincluded in our benchmark Google's Perspective algorithm, which, along with\nGPTs, was employed throughout their respective APIs while the open-source LLMs\nwere deployed locally. The findings show that Perspective API using a laxer\nthreshold, GPT-4o, and Nous Hermes 2 Mixtral outperform other LLM's zero-shot\nclassification annotations. In addition, Nous Hermes 2 and Mistral OpenOrca,\nwith a smaller number of parameters, are able to perform the task with high\nperformance, being attractive options that could offer good trade-offs between\nperformance, implementing costs and computing time. Ancillary findings using\nexperiments setting different temperature levels show that although GPTs tend\nto show not only excellent computing time but also overall good levels of\nreliability, only open-source LLMs ensure full reproducibility in the\nannotation.", "paper_summary_zh": "本文比較了 OpenAI 的 GPT 和許多開源 LLM 在政治內容上執行標註任務的能力。我們使用了一個新穎的抗議事件資料集，其中包含超過三百萬筆數位互動，並建立了一個黃金標準，其中包含由人類編碼器標註的關於社群媒體上毒性和不文明行為的真實標籤。我們在基準中包含了 Google 的 Perspective 演算法，該演算法與 GPT 一起在其各自的 API 中使用，而開源 LLM 則是在本地部署。研究結果顯示，使用較寬鬆閾值的 Perspective API、GPT-4o 和 Nous Hermes 2 Mixtral 的表現優於其他 LLM 的零次分類標註。此外，參數較少的 Nous Hermes 2 和 Mistral OpenOrca 能夠以高性能執行任務，是具有吸引力的選項，可以在性能、實作成本和運算時間之間取得良好的平衡。使用設定不同溫度層級的實驗的輔助發現顯示，儘管 GPT 不僅展現出色的運算時間，而且整體可靠性也很好，但只有開源 LLM 能確保在標註中完全重現。", "author": "Bastián González-Bustamante et.al.", "authors": "Bastián González-Bustamante", "id": "2409.09741v1", "paper_url": "http://arxiv.org/abs/2409.09741v1", "repo": "null"}}