{"2408.07845": {"publish_time": "2024-08-14", "title": "Enhancing Equitable Access to AI in Housing and Homelessness System of Care through Federated Learning", "paper_summary": "The top priority of a Housing and Homelessness System of Care (HHSC) is to\nconnect people experiencing homelessness to supportive housing. An HHSC\ntypically consists of many agencies serving the same population. Information\ntechnology platforms differ in type and quality between agencies, so their data\nare usually isolated from one agency to another. Larger agencies may have\nsufficient data to train and test artificial intelligence (AI) tools but\nsmaller agencies typically do not. To address this gap, we introduce a\nFederated Learning (FL) approach enabling all agencies to train a predictive\nmodel collaboratively without sharing their sensitive data. We demonstrate how\nFL can be used within an HHSC to provide all agencies equitable access to\nquality AI and further assist human decision-makers in the allocation of\nresources within HHSC. This is achieved while preserving the privacy of the\npeople within the data by not sharing identifying information between agencies\nwithout their consent. Our experimental results using real-world HHSC data from\nCalgary, Alberta, demonstrate that our FL approach offers comparable\nperformance with the idealized scenario of training the predictive model with\ndata fully shared and linked between agencies.", "paper_summary_zh": "住房和無家可歸者照護系統 (HHSC) 的首要任務是\n將無家可歸者與支持性住房連結起來。HHSC\n通常由許多服務於相同族群的機構組成。資訊\n技術平台在各個機構之間的類型和品質不同，因此他們的資料\n通常彼此孤立。較大型的機構可能擁有足夠的資料來訓練和測試人工智慧 (AI) 工具，但\n較小型機構通常沒有。為了解決這個差距，我們引入了一種\n聯合式學習 (FL) 方法，讓所有機構都能夠在不分享其敏感資料的情況下共同訓練一個預測\n模型。我們展示了 FL 如何在 HHSC 中使用，以提供所有機構公平取得\n優質 AI 的機會，並進一步協助人類決策者在 HHSC 內部分配\n資源。這是在不經機構同意的情況下，不分享識別資訊的情況下，保護資料中人們的隱私來實現的。我們使用來自\n加拿大艾伯塔省卡加利的真實世界 HHSC 資料進行實驗結果顯示，我們的 FL 方法提供與在機構之間完全分享和連結資料的理想預測模型訓練情境相當的\n效能。", "author": "Musa Taib et.al.", "authors": "Musa Taib, Jiajun Wu, Steve Drew, Geoffrey G. Messier", "id": "2408.07845v1", "paper_url": "http://arxiv.org/abs/2408.07845v1", "repo": "null"}}