{"2502.12120": {"publish_time": "2025-02-17", "title": "LLMs on the Line: Data Determines Loss-to-Loss Scaling Laws", "paper_summary": "Scaling laws guide the development of large language models (LLMs) by\noffering estimates for the optimal balance of model size, tokens, and compute.\nMore recently, loss-to-loss scaling laws that relate losses across pretraining\ndatasets and downstream tasks have emerged as a powerful tool for understanding\nand improving LLM performance. In this work, we investigate which factors most\nstrongly influence loss-to-loss scaling. Our experiments reveal that the\npretraining data and tokenizer determine the scaling trend. In contrast, model\nsize, optimization hyperparameters, and even significant architectural\ndifferences, such as between transformer-based models like Llama and\nstate-space models like Mamba, have limited impact. Consequently, practitioners\nshould carefully curate suitable pretraining datasets for optimal downstream\nperformance, while architectures and other settings can be freely optimized for\ntraining efficiency.", "paper_summary_zh": "規模化定律透過提供模型大小、符號和運算的最佳平衡估計，引導大型語言模型 (LLM) 的開發。最近，與預訓練資料集和下游任務相關的損失到損失縮放定律已成為了解和改善 LLM 效能的強大工具。在這項工作中，我們探討哪些因素最能影響損失到損失縮放。我們的實驗顯示，預訓練資料和分詞器會決定縮放趨勢。相反地，模型大小、最佳化超參數，甚至重大的架構差異（例如基於Transformer的模型，如 Llama，和狀態空間模型，如 Mamba 之間的差異）影響有限。因此，從業人員應仔細策劃適當的預訓練資料集以獲得最佳的下游效能，而架構和其他設定可以自由最佳化以提升訓練效率。", "author": "Prasanna Mayilvahanan et.al.", "authors": "Prasanna Mayilvahanan, Thaddäus Wiedemer, Sayak Mallick, Matthias Bethge, Wieland Brendel", "id": "2502.12120v1", "paper_url": "http://arxiv.org/abs/2502.12120v1", "repo": "null"}}