{"2407.16837": {"publish_time": "2024-07-23", "title": "CompBench: A Comparative Reasoning Benchmark for Multimodal LLMs", "paper_summary": "The ability to compare objects, scenes, or situations is crucial for\neffective decision-making and problem-solving in everyday life. For instance,\ncomparing the freshness of apples enables better choices during grocery\nshopping, while comparing sofa designs helps optimize the aesthetics of our\nliving space. Despite its significance, the comparative capability is largely\nunexplored in artificial general intelligence (AGI). In this paper, we\nintroduce CompBench, a benchmark designed to evaluate the comparative reasoning\ncapability of multimodal large language models (MLLMs). CompBench mines and\npairs images through visually oriented questions covering eight dimensions of\nrelative comparison: visual attribute, existence, state, emotion, temporality,\nspatiality, quantity, and quality. We curate a collection of around 40K image\npairs using metadata from diverse vision datasets and CLIP similarity scores.\nThese image pairs span a broad array of visual domains, including animals,\nfashion, sports, and both outdoor and indoor scenes. The questions are\ncarefully crafted to discern relative characteristics between two images and\nare labeled by human annotators for accuracy and relevance. We use CompBench to\nevaluate recent MLLMs, including GPT-4V(ision), Gemini-Pro, and LLaVA-1.6. Our\nresults reveal notable shortcomings in their comparative abilities. We believe\nCompBench not only sheds light on these limitations but also establishes a\nsolid foundation for future enhancements in the comparative capability of\nMLLMs.", "paper_summary_zh": "比較物件、場景或情境的能力對於日常生活中的有效決策制定和問題解決至關重要。例如，比較蘋果的新鮮度可以在購買雜貨時做出更好的選擇，而比較沙發設計有助於優化我們生活空間的美學。儘管其重要性，但比較能力在人工通用智慧 (AGI) 中仍未得到充分探索。在本文中，我們介紹了 CompBench，這是一個基於評估多模態大型語言模型 (MLLM) 的比較推理能力而設計的基準測試。CompBench 通過視覺導向問題挖掘和配對圖像，涵蓋相對比較的八個維度：視覺屬性、存在、狀態、情緒、時間性、空間性、數量和質量。我們使用來自不同視覺數據集的元數據和 CLIP 相似度分數策劃了大約 40K 圖像對的集合。這些圖像對跨越廣泛的視覺領域，包括動物、時尚、運動以及戶外和室內場景。這些問題經過精心設計，旨在辨別兩幅圖像之間的相對特徵，並由人類註釋者標記其準確性和相關性。我們使用 CompBench 來評估最近的 MLLM，包括 GPT-4V(ision)、Gemini-Pro 和 LLaVA-1.6。我們的結果揭示了它們在比較能力方面的顯著缺陷。我們相信 CompBench 不僅可以闡明這些限制，而且還為 MLLM 的比較能力的未來改進奠定了堅實的基礎。", "author": "Jihyung Kil et.al.", "authors": "Jihyung Kil, Zheda Mai, Justin Lee, Zihe Wang, Kerrie Cheng, Lemeng Wang, Ye Liu, Arpita Chowdhury, Wei-Lun Chao", "id": "2407.16837v1", "paper_url": "http://arxiv.org/abs/2407.16837v1", "repo": "https://github.com/raptormai/compbench"}}