{"2410.02736": {"publish_time": "2024-10-03", "title": "Justice or Prejudice? Quantifying Biases in LLM-as-a-Judge", "paper_summary": "LLM-as-a-Judge has been widely utilized as an evaluation method in various\nbenchmarks and served as supervised rewards in model training. However, despite\ntheir excellence in many domains, potential issues are under-explored,\nundermining their reliability and the scope of their utility. Therefore, we\nidentify 12 key potential biases and propose a new automated bias\nquantification framework-CALM-which systematically quantifies and analyzes each\ntype of bias in LLM-as-a-Judge by using automated and principle-guided\nmodification. Our experiments cover multiple popular language models, and the\nresults indicate that while advanced models have achieved commendable overall\nperformance, significant biases persist in certain specific tasks. Empirical\nresults suggest that there remains room for improvement in the reliability of\nLLM-as-a-Judge. Moreover, we also discuss the explicit and implicit influence\nof these biases and give some suggestions for the reliable application of\nLLM-as-a-Judge. Our work highlights the need for stakeholders to address these\nissues and remind users to exercise caution in LLM-as-a-Judge applications.", "paper_summary_zh": "LLM-as-a-Judge 已被广泛用作各種基準中的評估方法，並作為模型訓練中的監督獎勵。然而，儘管它們在許多領域表現出色，但潛在的問題卻未被充分探討，這損害了它們的可靠性和實用範圍。因此，我們識別出 12 個關鍵潛在偏差，並提出一個新的自動化偏差量化架構 CALM，它通過使用自動化和原則引導的修改來系統地量化和分析 LLM-as-a-Judge 中的每種類型偏差。我們的實驗涵蓋了多種流行的語言模型，結果表明，儘管先進的模型已經取得了令人稱道的整體表現，但在某些特定任務中仍然存在顯著的偏差。經驗結果表明，LLM-as-a-Judge 的可靠性仍有改進空間。此外，我們還討論了這些偏差的顯性和隱性影響，並對 LLM-as-a-Judge 的可靠應用提出了一些建議。我們的研究強調了利益相關者需要解決這些問題，並提醒用戶在 LLM-as-a-Judge 應用中保持謹慎。", "author": "Jiayi Ye et.al.", "authors": "Jiayi Ye, Yanbo Wang, Yue Huang, Dongping Chen, Qihui Zhang, Nuno Moniz, Tian Gao, Werner Geyer, Chao Huang, Pin-Yu Chen, Nitesh V Chawla, Xiangliang Zhang", "id": "2410.02736v2", "paper_url": "http://arxiv.org/abs/2410.02736v2", "repo": "null"}}