{"2410.06735": {"publish_time": "2024-10-09", "title": "Which Programming Language and What Features at Pre-training Stage Affect Downstream Logical Inference Performance?", "paper_summary": "Recent large language models (LLMs) have demonstrated remarkable\ngeneralization abilities in mathematics and logical reasoning tasks. Prior\nresearch indicates that LLMs pre-trained with programming language data exhibit\nhigh mathematical and reasoning abilities; however, this causal relationship\nhas not been rigorously tested. Our research aims to verify which programming\nlanguages and features during pre-training affect logical inference\nperformance. Specifically, we pre-trained decoder-based language models from\nscratch using datasets from ten programming languages (e.g., Python, C, Java)\nand three natural language datasets (Wikipedia, Fineweb, C4) under identical\nconditions. Thereafter, we evaluated the trained models in a few-shot\nin-context learning setting on logical reasoning tasks: FLD and bAbi, which do\nnot require commonsense or world knowledge. The results demonstrate that nearly\nall models trained with programming languages consistently outperform those\ntrained with natural languages, indicating that programming languages contain\nfactors that elicit logic inference performance. In addition, we found that\nmodels trained with programming languages exhibit a better ability to follow\ninstructions compared to those trained with natural languages. Further analysis\nreveals that the depth of Abstract Syntax Trees representing parsed results of\nprograms also affects logical reasoning performance. These findings will offer\ninsights into the essential elements of pre-training for acquiring the\nfoundational abilities of LLMs.", "paper_summary_zh": "近期的大型语言模型 (LLM) 在数学和逻辑推理任务中展示出卓越的泛化能力。先前的研究表明，使用编程语言数据预先训练的 LLM 表现出很高的数学和推理能力；然而，这种因果关系尚未经过严格的测试。我们的研究旨在验证预训练期间哪种编程语言和功能会影响逻辑推理性能。具体而言，我们从头开始使用来自十种编程语言（例如 Python、C、Java）和三种自然语言数据集（维基百科、Fineweb、C4）的数据集预先训练了基于解码器的语言模型，条件相同。此后，我们在逻辑推理任务（FLD 和 bAbi）的少量镜头情境学习设置中评估了训练后的模型，这些任务不需要常识或世界知识。结果表明，几乎所有使用编程语言训练的模型都比使用自然语言训练的模型表现得更好，这表明编程语言包含引发逻辑推理性能的因素。此外，我们发现使用编程语言训练的模型与使用自然语言训练的模型相比，表现出更好的遵循指令的能力。进一步的分析表明，表示程序解析结果的抽象语法树的深度也会影响逻辑推理性能。这些发现将为获取 LLM 的基础能力的预训练的基本要素提供见解。", "author": "Fumiya Uchiyama et.al.", "authors": "Fumiya Uchiyama, Takeshi Kojima, Andrew Gambardella, Qi Cao, Yusuke Iwasawa, Yutaka Matsuo", "id": "2410.06735v1", "paper_url": "http://arxiv.org/abs/2410.06735v1", "repo": "null"}}