{"2412.03242": {"publish_time": "2024-12-04", "title": "Benchmarking terminology building capabilities of ChatGPT on an English-Russian Fashion Corpus", "paper_summary": "This paper compares the accuracy of the terms extracted using SketchEngine,\nTBXTools and ChatGPT. In addition, it evaluates the quality of the definitions\nproduced by ChatGPT for these terms. The research is carried out on a\ncomparable corpus of fashion magazines written in English and Russian collected\nfrom the web. A gold standard for the fashion terminology was also developed by\nidentifying web pages that can be harvested automatically and contain\ndefinitions of terms from the fashion domain in English and Russian. This gold\nstandard was used to evaluate the quality of the extracted terms and of the\ndefinitions produced. Our evaluation shows that TBXTools and SketchEngine,\nwhile capable of high recall, suffer from reduced precision as the number of\nterms increases, which affects their overall performance. Conversely, ChatGPT\ndemonstrates superior performance, maintaining or improving precision as more\nterms are considered. Analysis of the definitions produced by ChatGPT for 60\ncommonly used terms in English and Russian shows that ChatGPT maintains a\nreasonable level of accuracy and fidelity across languages, but sometimes the\ndefinitions in both languages miss crucial specifics and include unnecessary\ndeviations. Our research reveals that no single tool excels universally; each\nhas strengths suited to particular aspects of terminology extraction and\napplication.", "paper_summary_zh": "本文比較了使用 SketchEngine、TBXTools 和 ChatGPT 提取術語的準確性。此外，它還評估了 ChatGPT 為這些術語產生的定義的品質。研究是在從網路收集的以英語和俄語寫成的時尚雜誌的同類語料庫上進行的。還通過識別可以自動擷取並包含英語和俄語時尚領域術語定義的網頁，制定了時尚術語的黃金標準。這個黃金標準用於評估提取的術語和產生的定義的品質。我們的評估顯示，TBXTools 和 SketchEngine 雖然具有很高的召回率，但隨著術語數量的增加，它們的準確度會降低，這會影響它們的整體效能。相反，ChatGPT 表現出優異的效能，在考慮更多術語時，它能維持或提高準確度。對 ChatGPT 為英語和俄語中 60 個常用術語產生的定義進行分析，結果顯示 ChatGPT 在不同語言之間維持合理的準確度和保真度，但有時兩種語言的定義都會遺漏關鍵的具體資訊，並包含不必要的偏差。我們的研究表明，沒有單一的工具能普遍勝出；每個工具都有適合術語提取和應用特定方面的優勢。", "author": "Anastasiia Bezobrazova et.al.", "authors": "Anastasiia Bezobrazova, Miriam Seghiri, Constantin Orasan", "id": "2412.03242v1", "paper_url": "http://arxiv.org/abs/2412.03242v1", "repo": "null"}}