{"2501.04820": {"publish_time": "2025-01-08", "title": "Unifying the Extremes: Developing a Unified Model for Detecting and Predicting Extremist Traits and Radicalization", "paper_summary": "The proliferation of ideological movements into extremist factions via social\nmedia has become a global concern. While radicalization has been studied\nextensively within the context of specific ideologies, our ability to\naccurately characterize extremism in more generalizable terms remains\nunderdeveloped. In this paper, we propose a novel method for extracting and\nanalyzing extremist discourse across a range of online community forums. By\nfocusing on verbal behavioral signatures of extremist traits, we develop a\nframework for quantifying extremism at both user and community levels. Our\nresearch identifies 11 distinct factors, which we term ``The Extremist\nEleven,'' as a generalized psychosocial model of extremism. Applying our method\nto various online communities, we demonstrate an ability to characterize\nideologically diverse communities across the 11 extremist traits. We\ndemonstrate the power of this method by analyzing user histories from members\nof the incel community. We find that our framework accurately predicts which\nusers join the incel community up to 10 months before their actual entry with\nan AUC of $>0.6$, steadily increasing to AUC ~0.9 three to four months before\nthe event. Further, we find that upon entry into an extremist forum, the users\ntend to maintain their level of extremism within the community, while still\nremaining distinguishable from the general online discourse. Our findings\ncontribute to the study of extremism by introducing a more holistic,\ncross-ideological approach that transcends traditional, trait-specific models.", "paper_summary_zh": "社群媒體上意識形態運動擴散到極端派系已成為全球關注的議題。雖然激進化已在特定意識形態的脈絡下廣泛研究，我們準確描述更普遍的極端主義的能力仍未發展。在本文中，我們提出了一種新穎的方法，用於擷取和分析各種線上社群論壇中的極端主義論述。透過聚焦於極端主義特質的口語行為特徵，我們開發了一個架構，用於量化使用者和社群層級的極端主義。我們的研究識別出 11 個不同的因素，我們稱之為「極端主義十一特質」，作為極端主義的廣泛心理社會模型。將我們的模型應用於各種線上社群，我們展示了描述 11 個極端主義特質中意識形態多元社群的能力。我們透過分析來自非自願獨身者社群成員的使用者歷史，展示了此方法的力量。我們發現，我們的架構準確預測了哪些使用者在實際加入前 10 個月就會加入非自願獨身者社群，AUC 超過 0.6，在事件發生前三到四個月穩定增加至 AUC ~0.9。此外，我們發現，使用者在進入極端主義論壇後，往往會在社群中維持其極端主義程度，同時仍然與一般的線上論述有所區別。我們的發現透過引入更全面、跨意識形態的方法，超越傳統的、特質特定的模型，對極端主義的研究有所貢獻。", "author": "Allison Lahnala et.al.", "authors": "Allison Lahnala, Vasudha Varadarajan, Lucie Flek, H. Andrew Schwartz, Ryan L. Boyd", "id": "2501.04820v1", "paper_url": "http://arxiv.org/abs/2501.04820v1", "repo": "null"}}