{"2411.14751": {"publish_time": "2024-11-22", "title": "TopoSD: Topology-Enhanced Lane Segment Perception with SDMap Prior", "paper_summary": "Recent advances in autonomous driving systems have shifted towards reducing\nreliance on high-definition maps (HDMaps) due to the huge costs of annotation\nand maintenance. Instead, researchers are focusing on online vectorized HDMap\nconstruction using on-board sensors. However, sensor-only approaches still face\nchallenges in long-range perception due to the restricted views imposed by the\nmounting angles of onboard cameras, just as human drivers also rely on\nbird's-eye-view navigation maps for a comprehensive understanding of road\nstructures. To address these issues, we propose to train the perception model\nto \"see\" standard definition maps (SDMaps). We encode SDMap elements into\nneural spatial map representations and instance tokens, and then incorporate\nsuch complementary features as prior information to improve the bird's eye view\n(BEV) feature for lane geometry and topology decoding. Based on the lane\nsegment representation framework, the model simultaneously predicts lanes,\ncentrelines and their topology. To further enhance the ability of geometry\nprediction and topology reasoning, we also use a topology-guided decoder to\nrefine the predictions by exploiting the mutual relationships between\ntopological and geometric features. We perform extensive experiments on\nOpenLane-V2 datasets to validate the proposed method. The results show that our\nmodel outperforms state-of-the-art methods by a large margin, with gains of\n+6.7 and +9.1 on the mAP and topology metrics. Our analysis also reveals that\nmodels trained with SDMap noise augmentation exhibit enhanced robustness.", "paper_summary_zh": "<paragraph>自動駕駛系統的最新進展已轉向減少對高解析度地圖 (HDMaps) 的依賴，因為註解和維護成本龐大。取而代之的是，研究人員專注於使用車載感測器進行線上向量化 HDMap 建構。然而，僅使用感測器的方法仍面臨長距離感知的挑戰，因為車載相機的安裝角度限制了視野，就像人類駕駛也依賴鳥瞰導航地圖全面了解道路結構一樣。為了解決這些問題，我們建議訓練感知模型「查看」標準定義地圖 (SDMaps)。我們將 SDMap 元素編碼成神經空間地圖表示和實例標記，然後將這些互補特徵作為先驗資訊納入，以改善車道幾何形狀和拓撲解碼的鳥瞰圖 (BEV) 特徵。基於車道區段表示架構，該模型同時預測車道、中心線及其拓撲。為了進一步增強幾何預測和拓撲推理的能力，我們還使用拓撲引導的解碼器，透過利用拓撲和幾何特徵之間的相互關係來改善預測。我們在 OpenLane-V2 資料集上進行廣泛的實驗，以驗證所提出的方法。結果顯示，我們的模型在 mAP 和拓撲指標上分別提升了 +6.7 和 +9.1，大幅優於最先進的方法。我們的分析還顯示，使用 SDMap 雜訊擴充訓練的模型表現出增強的穩健性。</paragraph>", "author": "Sen Yang et.al.", "authors": "Sen Yang, Minyue Jiang, Ziwei Fan, Xiaolu Xie, Xiao Tan, Yingying Li, Errui Ding, Liang Wang, Jingdong Wang", "id": "2411.14751v1", "paper_url": "http://arxiv.org/abs/2411.14751v1", "repo": "null"}}