{"2408.08295": {"publish_time": "2024-08-15", "title": "SLCA++: Unleash the Power of Sequential Fine-tuning for Continual Learning with Pre-training", "paper_summary": "In recent years, continual learning with pre-training (CLPT) has received\nwidespread interest, instead of its traditional focus of training from scratch.\nThe use of strong pre-trained models (PTMs) can greatly facilitate knowledge\ntransfer and alleviate catastrophic forgetting, but also suffers from\nprogressive overfitting of pre-trained knowledge into specific downstream\ntasks. A majority of current efforts often keep the PTMs frozen and incorporate\ntask-specific prompts to instruct representation learning, coupled with a\nprompt selection process for inference. However, due to the limited capacity of\nprompt parameters, this strategy demonstrates only sub-optimal performance in\ncontinual learning. In comparison, tuning all parameters of PTMs often provides\nthe greatest potential for representation learning, making sequential\nfine-tuning (Seq FT) a fundamental baseline that has been overlooked in CLPT.\nTo this end, we present an in-depth analysis of the progressive overfitting\nproblem from the lens of Seq FT. Considering that the overly fast\nrepresentation learning and the biased classification layer constitute this\nparticular problem, we introduce the advanced Slow Learner with Classifier\nAlignment (SLCA++) framework to unleash the power of Seq FT, serving as a\nstrong baseline approach for CLPT. Our approach involves a Slow Learner to\nselectively reduce the learning rate of backbone parameters, and a Classifier\nAlignment to align the disjoint classification layers in a post-hoc fashion. We\nfurther enhance the efficacy of SL with a symmetric cross-entropy loss, as well\nas employ a parameter-efficient strategy to implement Seq FT with SLCA++.\nAcross a variety of continual learning scenarios on image classification\nbenchmarks, our approach provides substantial improvements and outperforms\nstate-of-the-art methods by a large margin. Code:\nhttps://github.com/GengDavid/SLCA.", "paper_summary_zh": "近年來，持續學習與預訓練 (CLPT) 受到廣泛關注，取代傳統從頭開始訓練的重點。使用強大的預訓練模型 (PTM) 可以大幅促進知識轉移，並減輕災難性遺忘，但也飽受特定下游任務中預訓練知識的漸進過度擬合所苦。目前大多數方法通常保持 PTM 凍結，並結合特定於任務的提示，以指導表徵學習，再搭配提示選取程序進行推論。然而，由於提示參數的容量有限，此策略在持續學習中僅展現次佳效能。相比之下，調整 PTM 的所有參數通常能提供表徵學習最大的潛力，讓循序漸進微調 (Seq FT) 成為 CLPT 中被忽略的基本基準。為此，我們從 Seq FT 的角度深入分析漸進過度擬合問題。考量到過於快速表徵學習和帶有偏差的分類層構成此特定問題，我們推出進階的慢學習器與分類器校準 (SLCA++) 架構，以發揮 Seq FT 的強大功能，作為 CLPT 的強大基準方法。我們的做法包括慢學習器，以選擇性降低主幹參數的學習率，以及分類器校準，以事後方式校準不相交的分類層。我們進一步透過對稱交叉熵損失增強 SL 的效能，並採用參數有效率的策略，以 SLCA++ 實作 Seq FT。在影像分類基準上的各種持續學習情境中，我們的做法提供了大幅改善，並以極大差距超越現有技術。程式碼：https://github.com/GengDavid/SLCA。", "author": "Gengwei Zhang et.al.", "authors": "Gengwei Zhang, Liyuan Wang, Guoliang Kang, Ling Chen, Yunchao Wei", "id": "2408.08295v1", "paper_url": "http://arxiv.org/abs/2408.08295v1", "repo": "https://github.com/gengdavid/slca"}}