{"2410.03463": {"publish_time": "2024-10-04", "title": "Diffusion State-Guided Projected Gradient for Inverse Problems", "paper_summary": "Recent advancements in diffusion models have been effective in learning data\npriors for solving inverse problems. They leverage diffusion sampling steps for\ninducing a data prior while using a measurement guidance gradient at each step\nto impose data consistency. For general inverse problems, approximations are\nneeded when an unconditionally trained diffusion model is used since the\nmeasurement likelihood is intractable, leading to inaccurate posterior\nsampling. In other words, due to their approximations, these methods fail to\npreserve the generation process on the data manifold defined by the diffusion\nprior, leading to artifacts in applications such as image restoration. To\nenhance the performance and robustness of diffusion models in solving inverse\nproblems, we propose Diffusion State-Guided Projected Gradient (DiffStateGrad),\nwhich projects the measurement gradient onto a subspace that is a low-rank\napproximation of an intermediate state of the diffusion process. DiffStateGrad,\nas a module, can be added to a wide range of diffusion-based inverse solvers to\nimprove the preservation of the diffusion process on the prior manifold and\nfilter out artifact-inducing components. We highlight that DiffStateGrad\nimproves the robustness of diffusion models in terms of the choice of\nmeasurement guidance step size and noise while improving the worst-case\nperformance. Finally, we demonstrate that DiffStateGrad improves upon the\nstate-of-the-art on linear and nonlinear image restoration inverse problems.", "paper_summary_zh": "擴散模型的最新進展在學習資料先驗以解決反問題方面非常有效。它們利用擴散採樣步驟來誘導資料先驗，同時在每個步驟中使用量測引導梯度來強加資料一致性。對於一般的反問題，在使用無條件訓練的擴散模型時需要近似，因為量測似然函數難以處理，導致後驗採樣不準確。換句話說，由於這些方法的近似，它們無法在由擴散先驗定義的資料流形上保留生成過程，導致在影像復原等應用中產生人工製品。為了增強擴散模型在解決反問題時的效能和穩健性，我們提出了擴散狀態引導投影梯度（DiffStateGrad），它將量測梯度投影到一個子空間上，該子空間是擴散過程的中間狀態的低秩近似。DiffStateGrad 作為一個模組，可以新增到各種基於擴散的反問題求解器中，以改善在先驗流形上保留擴散過程並過濾掉產生人工製品的組成部分。我們強調，DiffStateGrad 在量測引導步長和雜訊的選擇方面改善了擴散模型的穩健性，同時改善了最差情況下的效能。最後，我們證明了 DiffStateGrad 在線性和非線性影像復原反問題上改進了最先進的技術。", "author": "Rayhan Zirvi et.al.", "authors": "Rayhan Zirvi, Bahareh Tolooshams, Anima Anandkumar", "id": "2410.03463v1", "paper_url": "http://arxiv.org/abs/2410.03463v1", "repo": "null"}}