{"2501.02785": {"publish_time": "2025-01-06", "title": "Hybrid deep convolution model for lung cancer detection with transfer learning", "paper_summary": "Advances in healthcare research have significantly enhanced our understanding\nof disease mechanisms, diagnostic precision, and therapeutic options. Yet, lung\ncancer remains one of the leading causes of cancer-related mortality worldwide\ndue to challenges in early and accurate diagnosis. While current lung cancer\ndetection models show promise, there is considerable potential for further\nimproving the accuracy for timely intervention. To address this challenge, we\nintroduce a hybrid deep convolution model leveraging transfer learning, named\nthe Maximum Sensitivity Neural Network (MSNN). MSNN is designed to improve the\nprecision of lung cancer detection by refining sensitivity and specificity.\nThis model has surpassed existing deep learning approaches through experimental\nvalidation, achieving an accuracy of 98% and a sensitivity of 97%. By\noverlaying sensitivity maps onto lung Computed Tomography (CT) scans, it\nenables the visualization of regions most indicative of malignant or benign\nclassifications. This innovative method demonstrates exceptional performance in\ndistinguishing lung cancer with minimal false positives, thereby enhancing the\naccuracy of medical diagnoses.", "paper_summary_zh": "醫療保健研究的進步顯著增進了我們對疾病機制、診斷精準度和治療選擇的了解。然而，由於早期和準確診斷的挑戰，肺癌仍然是全球癌症相關死亡的主要原因之一。雖然目前的肺癌檢測模型顯示出前景，但仍有相當大的潛力可以進一步提高準確性，以便及時介入。為了應對這一挑戰，我們引入了利用遷移學習的混合深度卷積模型，名為最大敏感度神經網路 (MSNN)。MSNN 旨在透過調整敏感度和特異性來提高肺癌檢測的準確性。此模型已透過實驗驗證超越現有的深度學習方法，達到 98% 的準確度和 97% 的敏感度。透過將敏感度圖疊加到肺部電腦斷層掃描 (CT) 上，它可以視覺化出最能代表惡性或良性分類的區域。這種創新方法在區分肺癌時表現出極佳的效能，且誤判為陽性的情況最少，從而提高了醫療診斷的準確性。", "author": "Sugandha Saxena et.al.", "authors": "Sugandha Saxena, S. N. Prasad, Ashwin M Polnaya, Shweta Agarwala", "id": "2501.02785v1", "paper_url": "http://arxiv.org/abs/2501.02785v1", "repo": "null"}}