{"2412.17295": {"publish_time": "2024-12-23", "title": "Friends-MMC: A Dataset for Multi-modal Multi-party Conversation Understanding", "paper_summary": "Multi-modal multi-party conversation (MMC) is a less studied yet important\ntopic of research due to that it well fits real-world scenarios and thus\npotentially has more widely-used applications. Compared with the traditional\nmulti-modal conversations, MMC requires stronger character-centered\nunderstanding abilities as there are many interlocutors appearing in both the\nvisual and textual context. To facilitate the study of this problem, we present\nFriends-MMC in this paper, an MMC dataset that contains 24,000+ unique\nutterances paired with video context. To explore the character-centered\nunderstanding of the dialogue, we also annotate the speaker of each utterance,\nthe names and bounding bboxes of faces that appear in the video. Based on this\nFriends-MMC dataset, we further study two fundamental MMC tasks: conversation\nspeaker identification and conversation response prediction, both of which have\nthe multi-party nature with the video or image as visual context. For\nconversation speaker identification, we demonstrate the inefficiencies of\nexisting methods such as pre-trained models, and propose a simple yet effective\nbaseline method that leverages an optimization solver to utilize the context of\ntwo modalities to achieve better performance. For conversation response\nprediction, we fine-tune generative dialogue models on Friend-MMC, and analyze\nthe benefits of speaker information. The code and dataset is publicly available\nat https://github.com/yellow-binary-tree/Friends-MMC and thus we call for more\nattention on modeling speaker information when understanding conversations.", "paper_summary_zh": "多模态多方對話 (MMC) 是一個研究較少但重要的研究主題，因為它很符合現實世界的場景，因此潛在有更廣泛的應用。與傳統的多模態對話相比，MMC 需要更強的人物為中心理解能力，因為在視覺和文本語境中出現許多對話者。為了促進對這個問題的研究，我們在本文中提出 Friends-MMC，一個包含 24,000 多個與影片語境配對的獨特話語的 MMC 資料集。為了探索對話的人物為中心理解，我們也註解每個話語的說話者、影片中出現的臉部名稱和邊界框。基於這個 Friends-MMC 資料集，我們進一步研究兩個基本的 MMC 任務：對話說話者識別和對話回應預測，這兩個任務都具有多方性質，影片或影像作為視覺語境。對於對話說話者識別，我們展示現有方法（例如預先訓練的模型）的低效率，並提出一個簡單但有效的基本方法，該方法利用最佳化求解器來利用兩個模態的語境以達成更好的效能。對於對話回應預測，我們在 Friend-MMC 上微調生成式對話模型，並分析說話者資訊的好處。程式碼和資料集在 https://github.com/yellow-binary-tree/Friends-MMC 公開提供，因此我們呼籲在理解對話時更注意對說話者資訊的建模。", "author": "Yueqian Wang et.al.", "authors": "Yueqian Wang, Xiaojun Meng, Yuxuan Wang, Jianxin Liang, Qun Liu, Dongyan Zhao", "id": "2412.17295v1", "paper_url": "http://arxiv.org/abs/2412.17295v1", "repo": "https://github.com/yellow-binary-tree/friends-mmc"}}