{"2411.13865": {"publish_time": "2024-11-21", "title": "HARec: Hyperbolic Graph-LLM Alignment for Exploration and Exploitation in Recommender Systems", "paper_summary": "Modern recommendation systems often create information cocoons, limiting\nusers' exposure to diverse content. To enhance user experience, a crucial\nchallenge is developing systems that can balance content exploration and\nexploitation, allowing users to adjust their recommendation preferences.\nIntuitively, this balance can be achieved through a tree-structured\nrepresentation, where depth search facilitates exploitation and breadth search\nenables exploration. However, current works face two challenges to achieve this\ntarget: (1) Euclidean methods fail to fully capture hierarchical structures and\nlack flexibility in balancing exploration-exploitation, while (2) hyperbolic\napproaches, despite better hierarchical modeling, suffer from insufficient\nsemantic alignment due to their reliance on Euclidean text encoders. To address\nthese challenges, we propose HARec, a hyperbolic representation learning\nframework that jointly aligns user-item collaborative information with textual\ndescriptions in hyperbolic space. Our framework introduces two key technique\nnovelty: (1) a hierarchical-aware graph-llm alignment mechanism that enables\nbetter hierarchical representation, and (2) a hyperbolic hierarchical tree\nstructure that facilitates user-adjustable exploration-exploitation trade-offs.\nExtensive experiments demonstrate that HARec consistently outperforms both\nEuclidean and hyperbolic baselines, achieving up to 5.49% improvement in\nutility metrics and 11.39% increase in diversity metrics.", "paper_summary_zh": "現代推薦系統經常會產生資訊繭房，限制使用者接觸到多元的內容。為了提升使用者體驗，一個重要的挑戰在於開發出能夠平衡內容探索與開發的系統，讓使用者調整他們的推薦偏好。直覺上來說，這個平衡可以透過樹狀結構的表達來達成，其中深度搜尋能促進開發，廣度搜尋則能促進探索。然而，現有的工作在達成這個目標時面臨兩個挑戰：(1) 歐幾里得方法無法完全捕捉階層結構，在平衡探索與開發時也缺乏彈性，而 (2) 雙曲線方法儘管有更好的階層建模，但由於依賴歐幾里得文本編碼器，導致語意對齊不足。為了應對這些挑戰，我們提出 HARec，一個雙曲線表達學習架構，它在雙曲線空間中聯合對齊使用者項目協作資訊和文本描述。我們的架構引入了兩個關鍵技術新穎性：(1) 一個階層感知圖形 llm 對齊機制，它能促進更好的階層表達，以及 (2) 一個雙曲線階層樹狀結構，它能促進使用者可調整的探索開發權衡。廣泛的實驗證明，HARec 持續優於歐幾里得和雙曲線基線，在效用指標上提升了 5.49%，在多樣性指標上提升了 11.39%。", "author": "Qiyao Ma et.al.", "authors": "Qiyao Ma, Menglin Yang, Mingxuan Ju, Tong Zhao, Neil Shah, Rex Ying", "id": "2411.13865v1", "paper_url": "http://arxiv.org/abs/2411.13865v1", "repo": "null"}}