{"2501.12570": {"publish_time": "2025-01-22", "title": "O1-Pruner: Length-Harmonizing Fine-Tuning for O1-Like Reasoning Pruning", "paper_summary": "Recently, long-thought reasoning LLMs, such as OpenAI's O1, adopt extended\nreasoning processes similar to how humans ponder over complex problems. This\nreasoning paradigm significantly enhances the model's problem-solving abilities\nand has achieved promising results. However, long-thought reasoning process\nleads to a substantial increase in inference time. A pressing challenge is\nreducing the inference overhead of long-thought LLMs while ensuring accuracy.\nIn this paper, we experimentally demonstrate that long-thought reasoning models\nstruggle to effectively allocate token budgets based on problem difficulty and\nreasoning redundancies. To address this, we propose Length-Harmonizing\nFine-Tuning (O1-Pruner), aiming at minimizing reasoning overhead while\nmaintaining accuracy. This effective fine-tuning method first estimates the\nLLM's baseline performance through pre-sampling and then uses RL-style\nfine-tuning to encourage the model to generate shorter reasoning processes\nunder accuracy constraints. This allows the model to achieve efficient\nreasoning with lower redundancy while maintaining accuracy. Experiments on\nvarious mathematical reasoning benchmarks show that O1-Pruner not only\nsignificantly reduces inference overhead but also achieves higher accuracy,\nproviding a novel and promising solution to this challenge. Our code is coming\nsoon at https://github.com/StarDewXXX/O1-Pruner", "paper_summary_zh": "最近，人们长期思考的推理 LLM，例如 OpenAI 的 O1，采用了类似于人类思考复杂问题的扩展推理过程。这种推理范式显著增强了模型的解决问题的能力，并取得了可喜的成果。然而，长期思考的推理过程导致推理时间大幅增加。一个紧迫的挑战是在确保准确性的同时减少长期思考的 LLM 的推理开销。在本文中，我们通过实验表明，长期思考的推理模型难以根据问题难度和推理冗余有效分配标记预算。为了解决这个问题，我们提出了长度协调微调 (O1-Pruner)，旨在最大程度减少推理开销，同时保持准确性。这种有效的微调方法首先通过预采样来估计 LLM 的基线性能，然后使用 RL 风格的微调来鼓励模型在准确性约束下生成更短的推理过程。这允许模型在保持准确性的同时实现高效推理，并降低冗余。在各种数学推理基准上的实验表明，O1-Pruner 不仅显着降低了推理开销，而且还实现了更高的准确性，为这一挑战提供了一种新颖且有前途的解决方案。我们的代码即将在 https://github.com/StarDewXXX/O1-Pruner 上发布", "author": "Haotian Luo et.al.", "authors": "Haotian Luo, Li Shen, Haiying He, Yibo Wang, Shiwei Liu, Wei Li, Naiqiang Tan, Xiaochun Cao, Dacheng Tao", "id": "2501.12570v1", "paper_url": "http://arxiv.org/abs/2501.12570v1", "repo": "https://github.com/stardewxxx/o1-pruner"}}