{"2410.04784": {"publish_time": "2024-10-07", "title": "Formality is Favored: Unraveling the Learning Preferences of Large Language Models on Data with Conflicting Knowledge", "paper_summary": "Having been trained on massive pretraining data, large language models have\nshown excellent performance on many knowledge-intensive tasks. However,\npretraining data tends to contain misleading and even conflicting information,\nand it is intriguing to understand how LLMs handle these noisy data during\ntraining. In this study, we systematically analyze LLMs' learning preferences\nfor data with conflicting knowledge. We find that pretrained LLMs establish\nlearning preferences similar to humans, i.e., preferences towards formal texts\nand texts with fewer spelling errors, resulting in faster learning and more\nfavorable treatment of knowledge in data with such features when facing\nconflicts. This finding is generalizable across models and languages and is\nmore evident in larger models. An in-depth analysis reveals that LLMs tend to\ntrust data with features that signify consistency with the majority of data,\nand it is possible to instill new preferences and erase old ones by\nmanipulating the degree of consistency with the majority data.", "paper_summary_zh": "在海量预训练数据上进行训练后，大型语言模型在许多知识密集型任务上表现出了优异的性能。然而，预训练数据往往包含误导甚至相互矛盾的信息，了解 LLM 在训练期间如何处理这些噪声数据是一件很有意思的事情。在这项研究中，我们系统地分析了 LLM 对具有冲突知识的数据的学习偏好。我们发现，预训练的 LLM 建立了类似于人类的学习偏好，即偏好正式文本和拼写错误较少的文本，从而在面对冲突时能够更快地学习和更倾向于处理具有此类特征的数据中的知识。这一发现可以推广到不同的模型和语言，并且在较大的模型中更加明显。深入分析表明，LLM 倾向于信任具有与大多数数据一致性的特征的数据，并且可以通过操纵与大多数数据的一致性程度来灌输新的偏好并消除旧的偏好。", "author": "Jiahuan Li et.al.", "authors": "Jiahuan Li, Yiqing Cao, Shujian Huang, Jiajun Chen", "id": "2410.04784v1", "paper_url": "http://arxiv.org/abs/2410.04784v1", "repo": "null"}}