{"2411.10914": {"publish_time": "2024-11-16", "title": "BPO: Towards Balanced Preference Optimization between Knowledge Breadth and Depth in Alignment", "paper_summary": "Reinforcement Learning with Human Feedback (RLHF) is the key to the success\nof large language models (LLMs) in recent years. In this work, we first\nintroduce the concepts of knowledge breadth and knowledge depth, which measure\nthe comprehensiveness and depth of an LLM or knowledge source respectively. We\nreveal that the imbalance in the number of prompts and responses can lead to a\npotential disparity in breadth and depth learning within alignment tuning\ndatasets by showing that even a simple uniform method for balancing the number\nof instructions and responses can lead to significant improvements. Building on\nthis, we further propose Balanced Preference Optimization (BPO), designed to\ndynamically augment the knowledge depth of each sample. BPO is motivated by the\nobservation that the usefulness of knowledge varies across samples,\nnecessitating tailored learning of knowledge depth. To achieve this, we\nintroduce gradient-based clustering, estimating the knowledge informativeness\nand usefulness of each augmented sample based on the model's optimization\ndirection. Our experimental results across various benchmarks demonstrate that\nBPO outperforms other baseline methods in alignment tuning while maintaining\ntraining efficiency. Furthermore, we conduct a detailed analysis of each\ncomponent of BPO, providing guidelines for future research in preference data\noptimization.", "paper_summary_zh": "近年來，人類回饋強化學習 (RLHF) 是大型語言模型 (LLM) 成功發展的關鍵。在這項研究中，我們首先介紹知識廣度和知識深度的概念，分別用於衡量 LLM 或知識來源的全面性和深度。我們揭露提示和回應數量的不平衡可能導致對齊調整資料集中廣度和深度學習的潛在差異，並說明即使是平衡指令和回應數量的一種簡單統一方法，也能帶來顯著的改善。在此基礎上，我們進一步提出平衡偏好最佳化 (BPO)，旨在動態增加每個範例的知識深度。BPO 的靈感來自於一個觀察：知識的效用會因範例而異，因此需要客製化學習知識深度。為了達成這個目標，我們引入基於梯度的分群，根據模型的最佳化方向來估計每個已增加範例的知識資訊量和效用。我們在各種基準上的實驗結果顯示，BPO 在對齊調整中優於其他基準方法，同時維持訓練效率。此外，我們對 BPO 的每個組成部分進行詳細分析，為偏好資料最佳化的未來研究提供指導方針。", "author": "Sizhe Wang et.al.", "authors": "Sizhe Wang, Yongqi Tong, Hengyuan Zhang, Dawei Li, Xin Zhang, Tianlong Chen", "id": "2411.10914v1", "paper_url": "http://arxiv.org/abs/2411.10914v1", "repo": "null"}}