{"2412.04454": {"publish_time": "2024-12-05", "title": "Aguvis: Unified Pure Vision Agents for Autonomous GUI Interaction", "paper_summary": "Graphical User Interfaces (GUIs) are critical to human-computer interaction,\nyet automating GUI tasks remains challenging due to the complexity and\nvariability of visual environments. Existing approaches often rely on textual\nrepresentations of GUIs, which introduce limitations in generalization,\nefficiency, and scalability. In this paper, we introduce Aguvis, a unified pure\nvision-based framework for autonomous GUI agents that operates across various\nplatforms. Our approach leverages image-based observations, and grounding\ninstructions in natural language to visual elements, and employs a consistent\naction space to ensure cross-platform generalization. To address the\nlimitations of previous work, we integrate explicit planning and reasoning\nwithin the model, enhancing its ability to autonomously navigate and interact\nwith complex digital environments. We construct a large-scale dataset of GUI\nagent trajectories, incorporating multimodal reasoning and grounding, and\nemploy a two-stage training pipeline that first focuses on general GUI\ngrounding, followed by planning and reasoning. Through comprehensive\nexperiments, we demonstrate that Aguvis surpasses previous state-of-the-art\nmethods in both offline and real-world online scenarios, achieving, to our\nknowledge, the first fully autonomous pure vision GUI agent capable of\nperforming tasks independently without collaboration with external\nclosed-source models. We open-sourced all datasets, models, and training\nrecipes to facilitate future research at https://aguvis-project.github.io/.", "paper_summary_zh": "圖形使用者介面 (GUI) 對人機互動至關重要，\n但由於視覺環境的複雜性和變異性，自動化 GUI 任務仍然具有挑戰性。現有方法通常依賴於 GUI 的文字表示，這會在概括、效率和可擴充性方面造成限制。在本文中，我們介紹 Aguvis，一個統一的純視覺化框架，適用於跨各種平台的自主 GUI 代理。我們的做法利用基於影像的觀察，並將自然語言的基礎指令轉換為視覺元素，並採用一致的動作空間來確保跨平台概括。為了解決先前工作的限制，我們在模型中整合了明確的規劃和推理，增強了其自主導航和與複雜數位環境互動的能力。我們建立了一個 GUI 代理軌跡的大規模資料集，結合了多模態推理和基礎，並採用一個兩階段的訓練管道，首先專注於一般的 GUI 基礎，然後進行規劃和推理。透過全面的實驗，我們證明 Aguvis 在離線和真實世界的線上情境中都超越了先前的最先進方法，據我們所知，這是第一個完全自主的純視覺 GUI 代理，能夠獨立執行任務，而無需與外部閉源模型合作。我們開放了所有資料集、模型和訓練範例，以促進未來在 https://aguvis-project.github.io/ 上的研究。", "author": "Yiheng Xu et.al.", "authors": "Yiheng Xu, Zekun Wang, Junli Wang, Dunjie Lu, Tianbao Xie, Amrita Saha, Doyen Sahoo, Tao Yu, Caiming Xiong", "id": "2412.04454v1", "paper_url": "http://arxiv.org/abs/2412.04454v1", "repo": "null"}}