{"2408.05793": {"publish_time": "2024-08-11", "title": "SAGA: A Participant-specific Examination of Story Alternatives and Goal Applicability for a Deeper Understanding of Complex Events", "paper_summary": "Interpreting and assessing goal driven actions is vital to understanding and\nreasoning over complex events. It is important to be able to acquire the\nknowledge needed for this understanding, though doing so is challenging. We\nargue that such knowledge can be elicited through a participant achievement\nlens. We analyze a complex event in a narrative according to the intended\nachievements of the participants in that narrative, the likely future actions\nof the participants, and the likelihood of goal success. We collect 6.3K high\nquality goal and action annotations reflecting our proposed participant\nachievement lens, with an average weighted Fleiss-Kappa IAA of 80%. Our\ncollection contains annotated alternate versions of each narrative. These\nalternate versions vary minimally from the \"original\" story, but can license\ndrastically different inferences. Our findings suggest that while modern large\nlanguage models can reflect some of the goal-based knowledge we study, they\nfind it challenging to fully capture the design and intent behind concerted\nactions, even when the model pretraining included the data from which we\nextracted the goal knowledge. We show that smaller models fine-tuned on our\ndataset can achieve performance surpassing larger models.", "paper_summary_zh": "解釋和評估目標驅動行為對於理解和推理複雜事件至關重要。能夠獲得此理解所需的知識很重要，儘管這樣做具有挑戰性。我們認為，此類知識可以透過參與者成就觀點引發出來。我們根據敘事中參與者的預期成就、參與者的未來可能行動和目標成功的可能性，分析敘事中的複雜事件。我們收集了 6.3K 個高品質目標和動作註解，反映了我們提出的參與者成就觀點，平均加權 Fleiss-Kappa IAA 為 80%。我們的集合包含每個敘事的註解備用版本。這些備用版本與「原始」故事的差異很小，但可以授權截然不同的推論。我們的研究結果表明，儘管現代大型語言模型可以反映我們研究的一些基於目標的知識，但它們發現難以完全捕捉協同動作背後的设计和意圖，即使模型預訓練包含我們从中提取目標知識的數據。我們表明，針對我們的數據集進行微調的較小模型可以實現超越較大模型的效能。", "author": "Sai Vallurupalli et.al.", "authors": "Sai Vallurupalli, Katrin Erk, Francis Ferraro", "id": "2408.05793v1", "paper_url": "http://arxiv.org/abs/2408.05793v1", "repo": "https://github.com/saiumbc/saga"}}