{"2407.19842": {"publish_time": "2024-07-29", "title": "Detecting and Understanding Vulnerabilities in Language Models via Mechanistic Interpretability", "paper_summary": "Large Language Models (LLMs), characterized by being trained on broad amounts\nof data in a self-supervised manner, have shown impressive performance across a\nwide range of tasks. Indeed, their generative abilities have aroused interest\non the application of LLMs across a wide range of contexts. However, neural\nnetworks in general, and LLMs in particular, are known to be vulnerable to\nadversarial attacks, where an imperceptible change to the input can mislead the\noutput of the model. This is a serious concern that impedes the use of LLMs on\nhigh-stakes applications, such as healthcare, where a wrong prediction can\nimply serious consequences. Even though there are many efforts on making LLMs\nmore robust to adversarial attacks, there are almost no works that study\n\\emph{how} and \\emph{where} these vulnerabilities that make LLMs prone to\nadversarial attacks happen. Motivated by these facts, we explore how to\nlocalize and understand vulnerabilities, and propose a method, based on\nMechanistic Interpretability (MI) techniques, to guide this process.\nSpecifically, this method enables us to detect vulnerabilities related to a\nconcrete task by (i) obtaining the subset of the model that is responsible for\nthat task, (ii) generating adversarial samples for that task, and (iii) using\nMI techniques together with the previous samples to discover and understand the\npossible vulnerabilities. We showcase our method on a pretrained GPT-2 Small\nmodel carrying out the task of predicting 3-letter acronyms to demonstrate its\neffectiveness on locating and understanding concrete vulnerabilities of the\nmodel.", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 的特點是透過大量資料進行自我監督訓練，在廣泛的任務中展現出令人印象深刻的表現。事實上，它們的生成能力已引起人們對 LLM 在廣泛情境中應用的興趣。然而，一般的神經網路，尤其是 LLM，已知容易受到對抗性攻擊，其中輸入的難以察覺的變化會誤導模型的輸出。這是阻礙 LLM 用於高風險應用（例如醫療保健）的嚴重問題，因為錯誤的預測可能會造成嚴重的後果。儘管有許多努力讓 LLM 對抗性攻擊更強大，但幾乎沒有研究探討 LLM 容易受到對抗性攻擊的這些漏洞是如何發生的，以及發生在何處。基於這些事實，我們探討如何定位和了解漏洞，並提出一個基於機制可解釋性 (MI) 技術的方法來指導此程序。具體來說，此方法使我們能夠透過 (i) 取得負責該任務的模型子集、(ii) 為該任務產生對抗性樣本，以及 (iii) 使用 MI 技術連同先前的樣本來發現和了解可能的漏洞，來偵測與具體任務相關的漏洞。我們在執行預測 3 個字母縮寫任務的預訓練 GPT-2 小型模型上展示我們的模型，以證明其在定位和了解模型具體漏洞方面的有效性。</paragraph>", "author": "Jorge García-Carrasco et.al.", "authors": "Jorge García-Carrasco, Alejandro Maté, Juan Trujillo", "id": "2407.19842v1", "paper_url": "http://arxiv.org/abs/2407.19842v1", "repo": "null"}}