{"2412.02085": {"publish_time": "2024-12-03", "title": "Evolution of Collective AI Beyond Individual Optimization", "paper_summary": "This study investigates collective behaviors that emerge from a group of\nhomogeneous individuals optimized for a specific capability. We created a group\nof simple, identical neural network based agents modeled after\nchemotaxis-driven vehicles that follow pheromone trails and examined\nmulti-agent simulations using clones of these evolved individuals. Our results\nshow that the evolution of individuals led to population differentiation.\nSurprisingly, we observed that collective fitness significantly changed during\nlater evolutionary stages, despite maintained high individual performance and\nsimplified neural architectures. This decline occurred when agents developed\nreduced sensor-motor coupling, suggesting that over-optimization of individual\nagents almost always lead to less effective group behavior. Our research\ninvestigates how individual differentiation can evolve through what\nevolutionary pathways.", "paper_summary_zh": "本研究探討從一群針對特定能力最佳化的同質個體中出現的集體行為。我們建立了一組簡單、相同的類神經網路，根據化學趨性驅動的載具建模，這些載具遵循費洛蒙軌跡，並使用這些演化個體的複製體檢查多主體模擬。我們的結果顯示，個體的演化導致了族群分化。令人驚訝的是，我們觀察到集體適應度在後期的演化階段發生顯著變化，儘管維持了高個體表現和簡化的神經結構。當主體發展出較弱的感測器-運動耦合時，發生了這種衰退，這表明個體主體的過度最佳化幾乎總是導致較無效的群體行為。我們的研究探討了個體分化如何透過哪些演化途徑演化。", "author": "Ryosuke Takata et.al.", "authors": "Ryosuke Takata, Yujin Tang, Yingtao Tian, Norihiro Maruyama, Hiroki Kojima, Takashi Ikegami", "id": "2412.02085v1", "paper_url": "http://arxiv.org/abs/2412.02085v1", "repo": "null"}}