{"2406.14336": {"publish_time": "2024-06-20", "title": "Exploring Spatial Representations in the Historical Lake District Texts with LLM-based Relation Extraction", "paper_summary": "Navigating historical narratives poses a challenge in unveiling the spatial\nintricacies of past landscapes. The proposed work addresses this challenge\nwithin the context of the English Lake District, employing the Corpus of the\nLake District Writing. The method utilizes a generative pre-trained transformer\nmodel to extract spatial relations from the textual descriptions in the corpus.\nThe study applies this large language model to understand the spatial\ndimensions inherent in historical narratives comprehensively. The outcomes are\npresented as semantic triples, capturing the nuanced connections between\nentities and locations, and visualized as a network, offering a graphical\nrepresentation of the spatial narrative. The study contributes to a deeper\ncomprehension of the English Lake District's spatial tapestry and provides an\napproach to uncovering spatial relations within diverse historical contexts.", "paper_summary_zh": "探索歷史敘述對揭示過去景觀的空間複雜性構成挑戰。所提出的作品在英格蘭湖區的語境中探討這個挑戰，採用湖區寫作語料庫。此方法利用生成式預訓練轉換器模型從語料庫中的文字描述中萃取出空間關係。研究將這個大型語言模型應用於全面了解歷史敘述中固有的空間向度。成果以語義三元組呈現，捕捉實體與位置之間的細微連結，並視覺化為網路，提供空間敘述的圖形化表示。研究有助於更深入理解英格蘭湖區的空間掛毯，並提供一種在不同歷史脈絡中揭示空間關係的方法。", "author": "Erum Haris et.al.", "authors": "Erum Haris, Anthony G. Cohn, John G. Stell", "id": "2406.14336v1", "paper_url": "http://arxiv.org/abs/2406.14336v1", "repo": "null"}}