{"2411.17176": {"publish_time": "2024-11-26", "title": "ChatGen: Automatic Text-to-Image Generation From FreeStyle Chatting", "paper_summary": "Despite the significant advancements in text-to-image (T2I) generative\nmodels, users often face a trial-and-error challenge in practical scenarios.\nThis challenge arises from the complexity and uncertainty of tedious steps such\nas crafting suitable prompts, selecting appropriate models, and configuring\nspecific arguments, making users resort to labor-intensive attempts for desired\nimages. This paper proposes Automatic T2I generation, which aims to automate\nthese tedious steps, allowing users to simply describe their needs in a\nfreestyle chatting way. To systematically study this problem, we first\nintroduce ChatGenBench, a novel benchmark designed for Automatic T2I. It\nfeatures high-quality paired data with diverse freestyle inputs, enabling\ncomprehensive evaluation of automatic T2I models across all steps.\nAdditionally, recognizing Automatic T2I as a complex multi-step reasoning task,\nwe propose ChatGen-Evo, a multi-stage evolution strategy that progressively\nequips models with essential automation skills. Through extensive evaluation\nacross step-wise accuracy and image quality, ChatGen-Evo significantly enhances\nperformance over various baselines. Our evaluation also uncovers valuable\ninsights for advancing automatic T2I. All our data, code, and models will be\navailable in \\url{https://chengyou-jia.github.io/ChatGen-Home}", "paper_summary_zh": "儘管文字轉影像 (T2I) 生成模型有顯著進展，但在實際情況中，使用者經常面臨試錯的挑戰。這個挑戰源於繁瑣步驟的複雜性和不確定性，例如製作合適的提示、選擇適當的模型，以及設定特定參數，使得使用者必須耗費大量心力才能得到想要的影像。本文提出自動 T2I 生成，目的是自動化這些繁瑣的步驟，讓使用者能用自由聊天的方式簡單描述他們的需求。為了系統性地探討這個問題，我們首先介紹 ChatGenBench，一個專為自動 T2I 設計的新基準測試。它具有高品質的配對資料，並有各種自由輸入，能全面評估所有步驟中的自動 T2I 模型。此外，我們將自動 T2I 視為一個複雜的多步驟推理任務，並提出 ChatGen-Evo，一種多階段的進化策略，逐漸讓模型具備必要的自動化技能。透過逐步精確度和影像品質的廣泛評估，ChatGen-Evo 在各種基線上顯著提升效能。我們的評估也揭示了推進自動 T2I 的寶貴見解。我們所有的資料、程式碼和模型都可以在 \\url{https://chengyou-jia.github.io/ChatGen-Home} 取得", "author": "Chengyou Jia et.al.", "authors": "Chengyou Jia, Changliang Xia, Zhuohang Dang, Weijia Wu, Hangwei Qian, Minnan Luo", "id": "2411.17176v1", "paper_url": "http://arxiv.org/abs/2411.17176v1", "repo": "null"}}