{"2412.09887": {"publish_time": "2024-12-13", "title": "CSL-L2M: Controllable Song-Level Lyric-to-Melody Generation Based on Conditional Transformer with Fine-Grained Lyric and Musical Controls", "paper_summary": "Lyric-to-melody generation is a highly challenging task in the field of AI\nmusic generation. Due to the difficulty of learning strict yet weak\ncorrelations between lyrics and melodies, previous methods have suffered from\nweak controllability, low-quality and poorly structured generation. To address\nthese challenges, we propose CSL-L2M, a controllable song-level lyric-to-melody\ngeneration method based on an in-attention Transformer decoder with\nfine-grained lyric and musical controls, which is able to generate full-song\nmelodies matched with the given lyrics and user-specified musical attributes.\nSpecifically, we first introduce REMI-Aligned, a novel music representation\nthat incorporates strict syllable- and sentence-level alignments between lyrics\nand melodies, facilitating precise alignment modeling. Subsequently,\nsentence-level semantic lyric embeddings independently extracted from a\nsentence-wise Transformer encoder are combined with word-level part-of-speech\nembeddings and syllable-level tone embeddings as fine-grained controls to\nenhance the controllability of lyrics over melody generation. Then we introduce\nhuman-labeled musical tags, sentence-level statistical musical attributes, and\nlearned musical features extracted from a pre-trained VQ-VAE as coarse-grained,\nfine-grained and high-fidelity controls, respectively, to the generation\nprocess, thereby enabling user control over melody generation. Finally, an\nin-attention Transformer decoder technique is leveraged to exert fine-grained\ncontrol over the full-song melody generation with the aforementioned lyric and\nmusical conditions. Experimental results demonstrate that our proposed CSL-L2M\noutperforms the state-of-the-art models, generating melodies with higher\nquality, better controllability and enhanced structure. Demos and source code\nare available at https://lichaiustc.github.io/CSL-L2M/.", "paper_summary_zh": "歌詞轉旋律生成是 AI 音樂生成領域中極具挑戰性的任務。由於難以學習歌詞和旋律之間嚴格但薄弱的相關性，以前的生成方法一直飽受可控性差、品質低落且結構不良的困擾。為了應對這些挑戰，我們提出了 CSL-L2M，這是一種可控的歌曲級歌詞轉旋律生成方法，它基於帶有細粒度歌詞和音樂控制的非注意力 Transformer 解碼器，能夠生成與給定歌詞和使用者指定的音樂屬性相匹配的全曲旋律。具體來說，我們首先介紹 REMI-Aligned，這是一種新穎的音樂表示，它結合了歌詞和旋律之間嚴格的音節和句子級別對齊，促進了精確對齊建模。隨後，從句子級 Transformer 編碼器中獨立提取的句子級語義歌詞嵌入與詞級詞性嵌入和音節級音調嵌入相結合，作為細粒度控制，以增強歌詞對旋律生成的控制力。然後，我們在生成過程中分別將人工標記的音樂標籤、句子級統計音樂屬性以及從預訓練的 VQ-VAE 中提取的學習音樂特徵引入為粗粒度、細粒度和高保真控制，從而使用戶能夠控制旋律生成。最後，利用非注意力 Transformer 解碼器技術，對全曲旋律生成施加細粒度控制，並具備上述歌詞和音樂條件。實驗結果表明，我們提出的 CSL-L2M 優於最先進的模型，生成的旋律具有更高的品質、更好的可控性以及增強的結構。展示和源代碼可在 https://lichaiustc.github.io/CSL-L2M/ 獲得。", "author": "Li Chai et.al.", "authors": "Li Chai, Donglin Wang", "id": "2412.09887v1", "paper_url": "http://arxiv.org/abs/2412.09887v1", "repo": "null"}}