{"2405.03986": {"publish_time": "2024-05-07", "title": "Factors Influencing User Willingness To Use SORA", "paper_summary": "Sora promises to redefine the way visual content is created. Despite its\nnumerous forecasted benefits, the drivers of user willingness to use the\ntext-to-video (T2V) model are unknown. This study extends the extended unified\ntheory of acceptance and use of technology (UTAUT2) with perceived realism and\nnovelty value. Using a purposive sampling method, we collected data from 940\nrespondents in the US and analyzed the sample using covariance-based structural\nequation modeling and fuzzy set qualitative comparative analysis (fsQCA). The\nfindings reveal that all hypothesized relationships are supported, with\nperceived realism emerging as the most influential driver, followed by novelty\nvalue. Moreover, fsQCA identifies five configurations leading to high and low\nwillingness to use, and the model demonstrates high predictive validity,\ncontributing to theory advancement. Our study provides valuable insights for\ndevelopers and marketers, offering guidance for strategic decisions to promote\nthe widespread adoption of T2V models.", "paper_summary_zh": "Sora 承諾重新定義視覺內容的創作方式。儘管其預測的優點眾多，但使用者願意使用文字轉影片 (T2V) 模型的驅動力仍不得而知。本研究擴充了技術接受與使用統一理論 (UTAUT2) 的範圍，納入了感知真實性與新穎價值。我們使用目的性抽樣法，從美國收集了 940 位受訪者的資料，並使用基於共變數的結構方程模型和模糊集合定性比較分析 (fsQCA) 分析樣本。研究結果顯示，所有假設的關係均獲得支持，其中感知真實性為影響力最大的驅動力，其次為新穎價值。此外，fsQCA 找出五種導致高低使用意願的配置，且該模型展現出很高的預測效度，有助於理論進展。本研究為開發人員和行銷人員提供寶貴的見解，提供策略決策指引，以促進 T2V 模型的廣泛採用。", "author": "Gustave Florentin Nkoulou Mvondo et.al.", "authors": "Gustave Florentin Nkoulou Mvondo, Ben Niu", "id": "2405.03986v1", "paper_url": "http://arxiv.org/abs/2405.03986v1", "repo": "null"}}