{"2405.16792": {"publish_time": "2024-05-27", "title": "Laurel: Generating Dafny Assertions Using Large Language Models", "paper_summary": "Dafny is a popular verification language, which automates proofs by\noutsourcing them to an SMT solver. This automation is not perfect, however, and\nthe solver often requires guidance in the form of helper assertions creating a\nburden for the proof engineer. In this paper, we propose Laurel, a tool that\nuses large language models (LLMs) to automatically generate helper assertions\nfor Dafny programs. To improve the success rate of LLMs in this task, we design\ntwo domain-specific prompting techniques. First, we help the LLM determine the\nlocation of the missing assertion by analyzing the verifier's error message and\ninserting an assertion placeholder at that location. Second, we provide the LLM\nwith example assertions from the same codebase, which we select based on a new\nlemma similarity metric. We evaluate our techniques on a dataset of helper\nassertions we extracted from three real-world Dafny codebases. Our evaluation\nshows that Laurel is able to generate over 50% of the required helper\nassertions given only a few attempts, making LLMs a usable and affordable tool\nto further automate practical program verification.", "paper_summary_zh": "Dafny 是一種流行的驗證語言，它透過將證明外包給 SMT 求解器來自動化證明。然而，這種自動化並非完美，求解器通常需要輔助斷言形式的指導，為證明工程師造成負擔。在本文中，我們提出 Laurel，一種使用大型語言模型 (LLM) 自動為 Dafny 程式產生輔助斷言的工具。為了提高 LLM 在此任務中的成功率，我們設計了兩種特定領域的提示技術。首先，我們透過分析驗證器的錯誤訊息並在該位置插入斷言佔位符，來幫助 LLM 確定遺失斷言的位置。其次，我們根據新的引理相似性度量，從同一個程式碼庫中提供 LLM 範例斷言。我們在從三個真實世界的 Dafny 程式碼庫中提取的輔助斷言資料集上評估我們的技術。我們的評估顯示，Laurel 能夠在僅嘗試幾次的情況下產生超過 50% 的所需輔助斷言，這使得 LLM 成為一種可用且經濟實惠的工具，可進一步自動化實際程式驗證。", "author": "Eric Mugnier et.al.", "authors": "Eric Mugnier, Emmanuel Anaya Gonzalez, Ranjit Jhala, Nadia Polikarpova, Yuanyuan Zhou", "id": "2405.16792v1", "paper_url": "http://arxiv.org/abs/2405.16792v1", "repo": "null"}}