{"2410.10735": {"publish_time": "2024-10-14", "title": "Embedding Self-Correction as an Inherent Ability in Large Language Models for Enhanced Mathematical Reasoning", "paper_summary": "Accurate mathematical reasoning with Large Language Models (LLMs) is crucial\nin revolutionizing domains that heavily rely on such reasoning. However, LLMs\noften encounter difficulties in certain aspects of mathematical reasoning,\nleading to flawed reasoning and erroneous results. To mitigate these issues, we\nintroduce a novel mechanism, the Chain of Self-Correction (CoSC), specifically\ndesigned to embed self-correction as an inherent ability in LLMs, enabling them\nto validate and rectify their own results. The CoSC mechanism operates through\na sequence of self-correction stages. In each stage, the LLMs generate a\nprogram to address a given problem, execute this program using program-based\ntools to obtain an output, subsequently verify this output. Based on the\nverification, the LLMs either proceed to the next correction stage or finalize\nthe answer. This iterative self-correction process allows the LLMs to refine\ntheir reasoning steps and improve the accuracy of their mathematical reasoning.\nTo enable the CoSC mechanism at a low cost, we employ a two-phase finetuning\napproach. In the first phase, the LLMs are trained with a relatively small\nvolume of seeding data generated from GPT-4, establishing an initial CoSC\ncapability. In the second phase, the CoSC capability is further enhanced by\ntraining with a larger volume of self-generated data using the trained model in\nthe first phase, without relying on the paid GPT-4. Our comprehensive\nexperiments demonstrate that CoSC significantly improves performance on\ntraditional mathematical datasets among existing open-source LLMs. Notably, our\nCoSC-Code-34B model achieved a 53.5% score on MATH, the most challenging\nmathematical reasoning dataset in the public domain, surpassing the performance\nof well-established models such as ChatGPT, GPT-4, and even multi-modal LLMs\nlike GPT-4V, Gemini-1.0 Pro, and Gemini-1.0 Ultra.", "paper_summary_zh": "大型語言模型 (LLM) 的準確數學推理對於徹底革新高度依賴此類推理的領域至關重要。然而，LLM 在數學推理的某些方面常常會遇到困難，導致推理有缺陷且結果錯誤。為了減輕這些問題，我們引入了一種新機制，即自我修正鏈 (CoSC)，專門設計為將自我修正作為 LLM 的固有能力，使它們能夠驗證和糾正自己的結果。CoSC 機制通過一系列自我修正階段運行。在每個階段，LLM 會生成一個程式來解決給定的問題，使用基於程式的工具執行此程式以獲得輸出，隨後驗證此輸出。根據驗證，LLM 要么繼續進行下一個修正階段，要么最終確定答案。這個反覆的自我修正過程使 LLM 能夠優化其推理步驟並提高其數學推理的準確性。為了以低成本啟用 CoSC 機制，我們採用了兩階段微調方法。在第一階段，LLM 使用從 GPT-4 生成的相對較小量的種子資料進行訓練，建立了初始的 CoSC 能力。在第二階段，CoSC 能力通過使用第一階段中訓練的模型訓練大量自生資料進一步增強，而無需依賴付費的 GPT-4。我們的綜合實驗表明，CoSC 在現有的開源 LLM 中顯著提高了傳統數學資料集的效能。值得注意的是，我們的 CoSC-Code-34B 模型在 MATH 上取得了 53.5% 的分數，這是公有領域中最具挑戰性的數學推理資料集，超越了 ChatGPT、GPT-4 甚至多模態 LLM 等成熟模型的效能，例如 GPT-4V、Gemini-1.0 Pro 和 Gemini-1.0 Ultra。", "author": "Kuofeng Gao et.al.", "authors": "Kuofeng Gao, Huanqia Cai, Qingyao Shuai, Dihong Gong, Zhifeng Li", "id": "2410.10735v1", "paper_url": "http://arxiv.org/abs/2410.10735v1", "repo": "null"}}