{"2407.14095": {"publish_time": "2024-07-19", "title": "People use fast, goal-directed simulation to reason about novel games", "paper_summary": "We can evaluate features of problems and their potential solutions well\nbefore we can effectively solve them. When considering a game we have never\nplayed, for instance, we might infer whether it is likely to be challenging,\nfair, or fun simply from hearing the game rules, prior to deciding whether to\ninvest time in learning the game or trying to play it well. Many studies of\ngame play have focused on optimality and expertise, characterizing how people\nand computational models play based on moderate to extensive search and after\nplaying a game dozens (if not thousands or millions) of times. Here, we study\nhow people reason about a range of simple but novel connect-n style board\ngames. We ask people to judge how fair and how fun the games are from very\nlittle experience: just thinking about the game for a minute or so, before they\nhave ever actually played with anyone else, and we propose a resource-limited\nmodel that captures their judgments using only a small number of partial game\nsimulations and almost no lookahead search.", "paper_summary_zh": "在我們能有效地解決問題之前，我們就能很好地評估問題的特徵及其潛在的解決方案。例如，在考慮我們從未玩過的遊戲時，我們可能會從聽遊戲規則中推斷出它可能具有挑戰性、公平性或趣味性，然後再決定是否花時間學習遊戲或嘗試玩好它。許多遊戲玩法研究都集中在最佳性和專業知識上，描述了人們和計算模型如何基於中等至廣泛的搜索以及在玩過幾十次（如果不是數千次或數百萬次）遊戲後進行遊戲。在這裡，我們研究了人們如何推理一系列簡單但新穎的連連看樣式的棋盤遊戲。我們要求人們判斷遊戲的公平性和趣味性，而他們幾乎沒有經驗：只需思考遊戲一分鐘左右，在他們實際與其他人一起玩之前，我們提出了一個資源受限的模型，它僅使用少量部分遊戲模擬和幾乎沒有預見搜索來捕捉他們的判斷。", "author": "Cedegao E. Zhang et.al.", "authors": "Cedegao E. Zhang, Katherine M. Collins, Lionel Wong, Adrian Weller, Joshua B. Tenenbaum", "id": "2407.14095v1", "paper_url": "http://arxiv.org/abs/2407.14095v1", "repo": "null"}}