{"2412.09417": {"publish_time": "2024-12-12", "title": "Reinforcement Learning Within the Classical Robotics Stack: A Case Study in Robot Soccer", "paper_summary": "Robot decision-making in partially observable, real-time, dynamic, and\nmulti-agent environments remains a difficult and unsolved challenge. Model-free\nreinforcement learning (RL) is a promising approach to learning decision-making\nin such domains, however, end-to-end RL in complex environments is often\nintractable. To address this challenge in the RoboCup Standard Platform League\n(SPL) domain, we developed a novel architecture integrating RL within a\nclassical robotics stack, while employing a multi-fidelity sim2real approach\nand decomposing behavior into learned sub-behaviors with heuristic selection.\nOur architecture led to victory in the 2024 RoboCup SPL Challenge Shield\nDivision. In this work, we fully describe our system's architecture and\nempirically analyze key design decisions that contributed to its success. Our\napproach demonstrates how RL-based behaviors can be integrated into complete\nrobot behavior architectures.", "paper_summary_zh": "機器人在部分可觀察、即時、動態和多主體環境中的決策制定仍然是一個困難且尚未解決的挑戰。無模型強化學習 (RL) 是一種在這種領域中學習決策制定很有前景的方法，然而，在複雜環境中的端到端 RL 通常難以處理。為了應對 RoboCup 標準平台聯盟 (SPL) 領域中的這一挑戰，我們開發了一種新穎的架構，將 RL 整合到經典機器人堆疊中，同時採用多保真度 sim2real 方法，並將行為分解為具有啟發式選擇的學習子行為。我們的架構在 2024 年 RoboCup SPL 挑戰盾牌部門中取得了勝利。在這項工作中，我們充分描述了我們系統的架構，並根據經驗分析了有助於其成功的關鍵設計決策。我們的做法展示了基於 RL 的行為如何整合到完整的機器人行為架構中。", "author": "Adam Labiosa et.al.", "authors": "Adam Labiosa, Zhihan Wang, Siddhant Agarwal, William Cong, Geethika Hemkumar, Abhinav Narayan Harish, Benjamin Hong, Josh Kelle, Chen Li, Yuhao Li, Zisen Shao, Peter Stone, Josiah P. Hanna", "id": "2412.09417v1", "paper_url": "http://arxiv.org/abs/2412.09417v1", "repo": "null"}}