{"2405.12084": {"publish_time": "2024-05-20", "title": "Distributional Semantics, Holism, and the Instability of Meaning", "paper_summary": "Current language models are built on the so-called distributional semantic\napproach to linguistic meaning that has the distributional hypothesis at its\ncore. The distributional hypothesis involves a holistic conception of word\nmeaning: the meaning of a word depends upon its relations to other words in the\nmodel. A standard objection to meaning holism is the charge of instability: any\nchange in the meaning properties of a linguistic system (a human speaker, for\nexample) would lead to many changes or possibly a complete change in the entire\nsystem. When the systems in question are trying to communicate with each other,\nit has been argued that instability of this kind makes communication impossible\n(Fodor and Lepore 1992, 1996, 1999). In this article, we examine whether the\ninstability objection poses a problem for distributional models of meaning.\nFirst, we distinguish between distinct forms of instability that these models\ncould exhibit, and we argue that only one such form is relevant for\nunderstanding the relation between instability and communication: what we call\ndifferential instability. Differential instability is variation in the relative\ndistances between points in a space, rather than variation in the absolute\nposition of those points. We distinguish differential and absolute instability\nby constructing two of our own models, a toy model constructed from the text of\ntwo novels, and a more sophisticated model constructed using the Word2vec\nalgorithm from a combination of Wikipedia and SEP articles. We demonstrate the\ntwo forms of instability by showing how these models change as the corpora they\nare constructed from increase in size.", "paper_summary_zh": "當前語言模型建立在所謂的分配語義方法上，以語言意義為核心，分配假設為其核心。分配假設涉及單詞意義的整體概念：單詞的意義取決於它與模型中其他單詞的關係。對意義整體論的標準反對意見是不穩定性的指控：語言系統（例如人類說話者）的意義屬性中的任何變化都會導致許多變化，或者可能導致整個系統的完全變化。當有問題的系統嘗試相互通信時，有人認為這種不穩定性使得通信變得不可能（Fodor and Lepore 1992, 1996, 1999）。在本文中，我們探討了不穩定性反對意見是否對意義的分配模型構成問題。首先，我們區分這些模型可能表現出的不同形式的不穩定性，我們認為只有一種形式與理解不穩定性和通信之間的關係相關：我們稱之為差異不穩定性。差異不穩定性是空間中各點之間相對距離的變化，而不是這些點絕對位置的變化。我們通過構建我們自己的兩個模型來區分差異和絕對不穩定性，一個玩具模型由兩部小說的文本構建，一個更精緻的模型由 Word2vec 演算法使用維基百科和 SEP 文章的組合構建。我們通過展示這些模型如何隨著構建它們的語料庫大小的增加而改變，來證明這兩種形式的不穩定性。", "author": "Jumbly Grindrod et.al.", "authors": "Jumbly Grindrod, J. D. Porter, Nat Hansen", "id": "2405.12084v1", "paper_url": "http://arxiv.org/abs/2405.12084v1", "repo": "null"}}