{"2412.17255": {"publish_time": "2024-12-23", "title": "Unlocking Cross-Lingual Sentiment Analysis through Emoji Interpretation: A Multimodal Generative AI Approach", "paper_summary": "Emojis have become ubiquitous in online communication, serving as a universal\nmedium to convey emotions and decorative elements. Their widespread use\ntranscends language and cultural barriers, enhancing understanding and\nfostering more inclusive interactions. While existing work gained valuable\ninsight into emojis understanding, exploring emojis' capability to serve as a\nuniversal sentiment indicator leveraging large language models (LLMs) has not\nbeen thoroughly examined. Our study aims to investigate the capacity of emojis\nto serve as reliable sentiment markers through LLMs across languages and\ncultures. We leveraged the multimodal capabilities of ChatGPT to explore the\nsentiments of various representations of emojis and evaluated how well\nemoji-conveyed sentiment aligned with text sentiment on a multi-lingual dataset\ncollected from 32 countries. Our analysis reveals that the accuracy of\nLLM-based emoji-conveyed sentiment is 81.43%, underscoring emojis' significant\npotential to serve as a universal sentiment marker. We also found a consistent\ntrend that the accuracy of sentiment conveyed by emojis increased as the number\nof emojis grew in text. The results reinforce the potential of emojis to serve\nas global sentiment indicators, offering insight into fields such as\ncross-lingual and cross-cultural sentiment analysis on social media platforms.\nCode: https://github.com/ResponsibleAILab/emoji-universal-sentiment.", "paper_summary_zh": "表情符號已在網路溝通中無處不在，作為傳達情緒和裝飾元素的通用媒介。它們廣泛的使用超越了語言和文化障礙，增強了理解並促進了更具包容性的互動。雖然現有工作對表情符號的理解獲得了寶貴的見解，但探索表情符號作為通用情緒指標的能力，利用大型語言模型 (LLM) 尚未得到徹底檢驗。我們的研究旨在調查表情符號通過跨語言和文化的 LLM 作為可靠情緒標記的能力。我們利用 ChatGPT 的多模態能力來探索表情符號的各種表示形式的情緒，並評估表情符號傳達的情緒在從 32 個國家/地區收集的多語言資料集上與文字情緒的吻合程度。我們的分析表明，基於 LLM 的表情符號傳達情緒的準確度為 81.43%，強調了表情符號作為通用情緒標記的巨大潛力。我們還發現了一個一致的趨勢，即隨著文本中表情符號數量增加，表情符號傳達的情緒準確度也會提高。結果強化了表情符號作為全球情緒指標的潛力，為跨語言和跨文化社交媒體平台上的情緒分析等領域提供了見解。程式碼：https://github.com/ResponsibleAILab/emoji-universal-sentiment。", "author": "Rafid Ishrak Jahan et.al.", "authors": "Rafid Ishrak Jahan, Heng Fan, Haihua Chen, Yunhe Feng", "id": "2412.17255v1", "paper_url": "http://arxiv.org/abs/2412.17255v1", "repo": "https://github.com/responsibleailab/emoji-universal-sentiment"}}