{"2501.13497": {"publish_time": "2025-01-23", "title": "DQ-Data2vec: Decoupling Quantization for Multilingual Speech Recognition", "paper_summary": "Data2vec is a self-supervised learning (SSL) approach that employs a\nteacher-student architecture for contextual representation learning via masked\nprediction, demonstrating remarkable performance in monolingual ASR. Previous\nstudies have revealed that data2vec's shallow layers capture speaker and\nlanguage information, middle layers encode phoneme and word features, while\ndeep layers are responsible for reconstruction. Language and phoneme features\nare crucial for multilingual ASR. However, data2vec's masked representation\ngeneration relies on multi-layer averaging, inevitably coupling these features.\nTo address this limitation, we propose a decoupling quantization based data2vec\n(DQ-Data2vec) for multilingual ASR, which includes a data2vec backbone and two\nimproved online K-means quantizers. Our core idea is using the K-means\nquantizer with specified cluster numbers to decouple language and phoneme\ninformation for masked prediction. Specifically, in the language quantization,\nconsidering that the number of languages is significantly different from other\nirrelevant features (e.g., speakers), we assign the cluster number to match the\nnumber of languages, explicitly decoupling shallow layers' language-related\ninformation from irrelevant features. This strategy is also applied to\ndecoupling middle layers' phoneme and word features. In a self-supervised\nscenario, experiments on the CommonVoice dataset demonstrate that DQ-Data2vec\nachieves a relative reduction of 9.51% in phoneme error rate (PER) and 11.58%\nin word error rate (WER) compared to data2vec and UniData2vec. Moreover, in a\nweakly-supervised scenario incorporating language labels and high-resource\nlanguage text labels, the relative reduction is 18.09% and 1.55%, respectively.", "paper_summary_zh": "Data2vec 是一種自監督學習 (SSL) 方法，它採用教師-學生架構進行情境表徵學習，透過遮罩預測來表現，在單語音 ASR 中表現卓越。先前研究已揭示，data2vec 的淺層會擷取說話者和語言資訊，中間層會編碼音素和單字特徵，而深層則負責重建。語言和音素特徵對於多語音 ASR 至關重要。然而，data2vec 的遮罩表徵產生依賴於多層平均，不可避免地會結合這些特徵。為了解決這個限制，我們針對多語音 ASR 提出了一個去耦量化基於 data2vec (DQ-Data2vec)，其中包含一個 data2vec 主幹和兩個改進的線上 K 平均量化器。我們的核心概念是使用具有指定叢集數量的 K 平均量化器，為遮罩預測去耦語言和音素資訊。特別是在語言量化中，考慮到語言數量與其他無關特徵（例如說話者）有顯著不同，我們將叢集數量指定為與語言數量相符，明確地將淺層與語言相關的資訊與無關特徵去耦。此策略也應用於去耦中間層的音素和單字特徵。在自監督場景中，CommonVoice 資料集的實驗證明，與 data2vec 和 UniData2vec 相比，DQ-Data2vec 在音素錯誤率 (PER) 中達到 9.51% 的相對減少，在單字錯誤率 (WER) 中達到 11.58% 的相對減少。此外，在結合語言標籤和高資源語言文字標籤的弱監督場景中，相對減少分別為 18.09% 和 1.55%。", "author": "Qijie Shao et.al.", "authors": "Qijie Shao, Linhao Dong, Kun Wei, Sining Sun, Lei Xie", "id": "2501.13497v1", "paper_url": "http://arxiv.org/abs/2501.13497v1", "repo": "null"}}