{"2409.08811": {"publish_time": "2024-09-13", "title": "Mutual Theory of Mind in Human-AI Collaboration: An Empirical Study with LLM-driven AI Agents in a Real-time Shared Workspace Task", "paper_summary": "Theory of Mind (ToM) significantly impacts human collaboration and\ncommunication as a crucial capability to understand others. When AI agents with\nToM capability collaborate with humans, Mutual Theory of Mind (MToM) arises in\nsuch human-AI teams (HATs). The MToM process, which involves interactive\ncommunication and ToM-based strategy adjustment, affects the team's performance\nand collaboration process. To explore the MToM process, we conducted a\nmixed-design experiment using a large language model-driven AI agent with ToM\nand communication modules in a real-time shared-workspace task. We find that\nthe agent's ToM capability does not significantly impact team performance but\nenhances human understanding of the agent and the feeling of being understood.\nMost participants in our study believe verbal communication increases human\nburden, and the results show that bidirectional communication leads to lower\nHAT performance. We discuss the results' implications for designing AI agents\nthat collaborate with humans in real-time shared workspace tasks.", "paper_summary_zh": "心智理論（ToM）顯著影響人類協作和溝通，作為理解他人的關鍵能力。當具備心智理論能力的人工智慧代理與人類協作時，在這樣的人類人工智慧團隊（HAT）中會出現相互心智理論（MToM）。MToM 程序涉及互動溝通和基於心智理論的策略調整，影響團隊的表現和協作程序。為了探索 MToM 程序，我們使用具備心智理論和溝通模組的大型語言模型驅動的人工智慧代理，在一個即時共享工作空間任務中進行了混合設計實驗。我們發現代理的心智理論能力並沒有顯著影響團隊表現，但增強了人類對代理的理解和被理解的感覺。我們研究中大多數參與者相信，口頭溝通增加了人類負擔，而結果顯示雙向溝通導致較低的 HAT 表現。我們討論了這些結果對設計在即時共享工作空間任務中與人類協作的人工智慧代理的影響。", "author": "Shao Zhang et.al.", "authors": "Shao Zhang, Xihuai Wang, Wenhao Zhang, Yongshan Chen, Landi Gao, Dakuo Wang, Weinan Zhang, Xinbing Wang, Ying Wen", "id": "2409.08811v1", "paper_url": "http://arxiv.org/abs/2409.08811v1", "repo": "null"}}