{"2405.07551": {"publish_time": "2024-05-13", "title": "MuMath-Code: Combining Tool-Use Large Language Models with Multi-perspective Data Augmentation for Mathematical Reasoning", "paper_summary": "The tool-use Large Language Models (LLMs) that integrate with external Python\ninterpreters have significantly enhanced mathematical reasoning capabilities\nfor open-source LLMs, while tool-free methods chose another track: augmenting\nmath reasoning data. However, a great method to integrate the above two\nresearch paths and combine their advantages remains to be explored. In this\nwork, we firstly include new math questions via multi-perspective data\naugmenting methods and then synthesize code-nested solutions to them. The open\nLLMs (i.e., Llama-2) are finetuned on the augmented dataset to get the\nresulting models, MuMath-Code ($\\mu$-Math-Code). During the inference phase,\nour MuMath-Code generates code and interacts with the external python\ninterpreter to get the execution results. Therefore, MuMath-Code leverages the\nadvantages of both the external tool and data augmentation. To fully leverage\nthe advantages of our augmented data, we propose a two-stage training strategy:\nIn Stage-1, we finetune Llama-2 on pure CoT data to get an intermediate model,\nwhich then is trained on the code-nested data in Stage-2 to get the resulting\nMuMath-Code. Our MuMath-Code-7B achieves 83.8 on GSM8K and 52.4 on MATH, while\nMuMath-Code-70B model achieves new state-of-the-art performance among open\nmethods -- achieving 90.7% on GSM8K and 55.1% on MATH. Extensive experiments\nvalidate the combination of tool use and data augmentation, as well as our\ntwo-stage training strategy. We release the proposed dataset along with the\nassociated code for public use.", "paper_summary_zh": "<paragraph>整合外部 Python 解譯器的工具使用大型語言模型 (LLM) 已大幅提升開放原始碼 LLM 的數學推理能力，而無工具方法則選擇另一條路徑：擴充數學推理資料。然而，整合上述兩條研究路徑並結合其優勢的絕佳方法仍有待探索。在這項工作中，我們首先透過多角度資料擴充方法納入新的數學問題，然後綜合產生其巢狀程式碼解決方案。開放 LLM（即 Llama-2）在擴充資料集上進行微調，以取得結果模型 MuMath-Code（μ-Math-Code）。在推論階段，我們的 MuMath-Code 會產生程式碼並與外部 Python 解譯器互動以取得執行結果。因此，MuMath-Code 充分利用外部工具和資料擴充的優勢。為了充分發揮擴充資料的優勢，我們提出兩階段訓練策略：在階段 1，我們在純粹 CoT 資料上微調 Llama-2 以取得中間模型，然後在階段 2 對巢狀程式碼資料進行訓練以取得結果 MuMath-Code。我們的 MuMath-Code-7B 在 GSM8K 上達到 83.8，在 MATH 上達到 52.4，而 MuMath-Code-70B 模型則在開放方法中取得新的最佳效能，在 GSM8K 上達到 90.7%，在 MATH 上達到 55.1%。廣泛的實驗驗證了工具使用和資料擴充的結合，以及我們的兩階段訓練策略。我們釋出建議的資料集以及相關程式碼，供公眾使用。</paragraph>", "author": "Shuo Yin et.al.", "authors": "Shuo Yin, Weihao You, Zhilong Ji, Guoqiang Zhong, Jinfeng Bai", "id": "2405.07551v1", "paper_url": "http://arxiv.org/abs/2405.07551v1", "repo": "null"}}