{"2407.16565": {"publish_time": "2024-07-23", "title": "Retrieve, Generate, Evaluate: A Case Study for Medical Paraphrases Generation with Small Language Models", "paper_summary": "Recent surge in the accessibility of large language models (LLMs) to the\ngeneral population can lead to untrackable use of such models for\nmedical-related recommendations. Language generation via LLMs models has two\nkey problems: firstly, they are prone to hallucination and therefore, for any\nmedical purpose they require scientific and factual grounding; secondly, LLMs\npose tremendous challenge to computational resources due to their gigantic\nmodel size. In this work, we introduce pRAGe, a pipeline for Retrieval\nAugmented Generation and evaluation of medical paraphrases generation using\nSmall Language Models (SLM). We study the effectiveness of SLMs and the impact\nof external knowledge base for medical paraphrase generation in French.", "paper_summary_zh": "大型語言模型（LLM）最近對一般民眾的可用性激增，可能會導致無法追蹤這些模型用於與醫療相關的建議。透過 LLM 模型產生的語言有兩個主要問題：首先，它們容易產生幻覺，因此，對於任何醫療目的，它們都需要科學和事實依據；其次，由於 LLM 龐大的模型規模，對運算資源造成極大的挑戰。在這項工作中，我們介紹了 pRAGe，一個用於檢索擴充產生和使用小型語言模型（SLM）評估醫療釋義產生的管道。我們研究了 SLM 的有效性以及外部知識庫對法語醫療釋義產生的影響。", "author": "Ioana Buhnila et.al.", "authors": "Ioana Buhnila, Aman Sinha, Mathieu Constant", "id": "2407.16565v1", "paper_url": "http://arxiv.org/abs/2407.16565v1", "repo": "null"}}