{"2410.05206": {"publish_time": "2024-10-07", "title": "Studying and Mitigating Biases in Sign Language Understanding Models", "paper_summary": "Ensuring that the benefits of sign language technologies are distributed\nequitably among all community members is crucial. Thus, it is important to\naddress potential biases and inequities that may arise from the design or use\nof these resources. Crowd-sourced sign language datasets, such as the ASL\nCitizen dataset, are great resources for improving accessibility and preserving\nlinguistic diversity, but they must be used thoughtfully to avoid reinforcing\nexisting biases.\n  In this work, we utilize the rich information about participant demographics\nand lexical features present in the ASL Citizen dataset to study and document\nthe biases that may result from models trained on crowd-sourced sign datasets.\nFurther, we apply several bias mitigation techniques during model training, and\nfind that these techniques reduce performance disparities without decreasing\naccuracy. With the publication of this work, we release the demographic\ninformation about the participants in the ASL Citizen dataset to encourage\nfuture bias mitigation work in this space.", "paper_summary_zh": "確保手語技術的優勢能公平地分配給所有社區成員至關重要。因此，了解在設計或使用這些資源時可能產生的潛在偏差和不公平性很重要。群眾外包手語資料集（例如 ASL Citizen 資料集）是改善無障礙性和維護語言多樣性的絕佳資源，但必須謹慎使用，以避免強化現有的偏差。\n在這項工作中，我們利用 ASL Citizen 資料集中參與者的豐富人口統計資料和詞彙特徵，來研究和記錄由群眾外包手語資料集訓練的模型可能產生的偏差。此外，我們在模型訓練期間套用多種偏差緩解技術，並發現這些技術減少了效能差異，卻沒有降低準確性。隨著這項工作的發表，我們公佈了 ASL Citizen 資料集中參與者的人口統計資料，以鼓勵未來在此領域進行偏差緩解工作。", "author": "Katherine Atwell et.al.", "authors": "Katherine Atwell, Danielle Bragg, Malihe Alikhani", "id": "2410.05206v1", "paper_url": "http://arxiv.org/abs/2410.05206v1", "repo": "null"}}