{"2406.18906": {"publish_time": "2024-06-27", "title": "Sonnet or Not, Bot? Poetry Evaluation for Large Models and Datasets", "paper_summary": "Large language models (LLMs) can now generate and recognize text in a wide\nrange of styles and genres, including highly specialized, creative genres like\npoetry. But what do LLMs really know about poetry? What can they know about\npoetry? We develop a task to evaluate how well LLMs recognize a specific aspect\nof poetry, poetic form, for more than 20 forms and formal elements in the\nEnglish language. Poetic form captures many different poetic features,\nincluding rhyme scheme, meter, and word or line repetition. We use this task to\nreflect on LLMs' current poetic capabilities, as well as the challenges and\npitfalls of creating NLP benchmarks for poetry and for other creative tasks. In\nparticular, we use this task to audit and reflect on the poems included in\npopular pretraining datasets. Our findings have implications for NLP\nresearchers interested in model evaluation, digital humanities and cultural\nanalytics scholars, and cultural heritage professionals.", "paper_summary_zh": "大型語言模型 (LLM) 現在可以生成和辨識各種風格和類型的文字，包括高度專業化、詩歌等創意類型。但 LLM 對於詩歌真正了解多少？它們能了解詩歌哪些方面？我們開發了一項任務，用於評估 LLM 辨識特定詩歌面向（詩歌形式）的能力，涵蓋英語中 20 多種形式和形式元素。詩歌形式捕捉了許多不同的詩歌特徵，包括押韻格律、韻律和字詞或行重複。我們使用這項任務來探討 LLM 目前的詩歌能力，以及為詩歌和其他創意任務建立 NLP 基準時所面臨的挑戰和陷阱。特別是，我們使用這項任務來審查和探討熱門預訓練資料集中的詩歌。我們的發現對有興趣進行模型評估的 NLP 研究人員、數位人文和文化分析學者以及文化遺產專業人士具有啟示意義。", "author": "Melanie Walsh et.al.", "authors": "Melanie Walsh, Anna Preus, Maria Antoniak", "id": "2406.18906v1", "paper_url": "http://arxiv.org/abs/2406.18906v1", "repo": "null"}}