{"2405.06410": {"publish_time": "2024-05-10", "title": "Potential and Limitations of LLMs in Capturing Structured Semantics: A Case Study on SRL", "paper_summary": "Large Language Models (LLMs) play a crucial role in capturing structured\nsemantics to enhance language understanding, improve interpretability, and\nreduce bias. Nevertheless, an ongoing controversy exists over the extent to\nwhich LLMs can grasp structured semantics. To assess this, we propose using\nSemantic Role Labeling (SRL) as a fundamental task to explore LLMs' ability to\nextract structured semantics. In our assessment, we employ the prompting\napproach, which leads to the creation of our few-shot SRL parser, called\nPromptSRL. PromptSRL enables LLMs to map natural languages to explicit semantic\nstructures, which provides an interpretable window into the properties of LLMs.\nWe find interesting potential: LLMs can indeed capture semantic structures, and\nscaling-up doesn't always mirror potential. Additionally, limitations of LLMs\nare observed in C-arguments, etc. Lastly, we are surprised to discover that\nsignificant overlap in the errors is made by both LLMs and untrained humans,\naccounting for almost 30% of all errors.", "paper_summary_zh": "大型語言模型 (LLM) 在捕捉結構化語義以增強語言理解、提升可解釋性及減少偏誤方面扮演著至關重要的角色。儘管如此，LLM 在何種程度上能夠掌握結構化語義仍存在著持續的爭議。為了評估這一點，我們建議使用語義角色標註 (SRL) 作為一項基本任務，以探索 LLM 提取結構化語義的能力。在我們的評估中，我們採用提示方法，這導致了我們少樣本 SRL 解析器的建立，稱為 PromptSRL。PromptSRL 能讓 LLM 將自然語言對應到明確的語義結構，這提供了可解釋的視窗，讓我們得以一窺 LLM 的特性。我們發現了有趣的潛力：LLM 確實可以捕捉語義結構，而且擴充並不總是反映潛力。此外，我們在 C 參數等方面觀察到了 LLM 的限制。最後，我們驚訝地發現，LLM 和未受過訓練的人類在錯誤方面有顯著的重疊，約占所有錯誤的 30%。", "author": "Ning Cheng et.al.", "authors": "Ning Cheng, Zhaohui Yan, Ziming Wang, Zhijie Li, Jiaming Yu, Zilong Zheng, Kewei Tu, Jinan Xu, Wenjuan Han", "id": "2405.06410v1", "paper_url": "http://arxiv.org/abs/2405.06410v1", "repo": "null"}}