{"2501.18265": {"publish_time": "2025-01-30", "title": "Collecting Cost-Effective, High-Quality Truthfulness Assessments with LLM Summarized Evidence", "paper_summary": "With the degradation of guardrails against mis- and disinformation online, it\nis more critical than ever to be able to effectively combat it. In this paper,\nwe explore the efficiency and effectiveness of using crowd-sourced truthfulness\nassessments based on condensed, large language model (LLM) generated summaries\nof online sources. We compare the use of generated summaries to the use of\noriginal web pages in an A/B testing setting, where we employ a large and\ndiverse pool of crowd-workers to perform the truthfulness assessment. We\nevaluate the quality of assessments, the efficiency with which assessments are\nperformed, and the behavior and engagement of participants. Our results\ndemonstrate that the Summary modality, which relies on summarized evidence,\noffers no significant change in assessment accuracy over the Standard modality,\nwhile significantly increasing the speed with which assessments are performed.\nWorkers using summarized evidence produce a significantly higher number of\nassessments in the same time frame, reducing the cost needed to acquire\ntruthfulness assessments. Additionally, the Summary modality maximizes both the\ninter-annotator agreements as well as the reliance on and perceived usefulness\nof evidence, demonstrating the utility of summarized evidence without\nsacrificing the quality of assessments.", "paper_summary_zh": "<paragraph>隨著網路防範錯誤和錯誤資訊的護欄逐漸失效，有效打擊錯誤和錯誤資訊比以往任何時候都更加重要。在本文中，我們探討了使用基於大型語言模型 (LLM) 生成的線上來源摘要的群眾外包真實性評估的效率和效能。我們在 A/B 測試設定中比較了使用生成摘要與使用原始網頁，我們採用大量且多元的群眾工作者來執行真實性評估。我們評估評估的品質、執行評估的效率，以及參與者的行為和參與度。我們的結果證明了依賴摘要證據的摘要模式，在評估準確度上與標準模式相比沒有顯著變化，同時顯著提高了執行評估的速度。使用摘要證據的工作者在相同時間內產生的評估數量顯著較高，降低了取得真實性評估所需的成本。此外，摘要模式最大化了標記人員間的一致性，以及對證據的依賴性和感知有用性，證明了摘要證據的效用，同時不犧牲評估品質。</paragraph>", "author": "Kevin Roitero et.al.", "authors": "Kevin Roitero, Dustin Wright, Michael Soprano, Isabelle Augenstein, Stefano Mizzaro", "id": "2501.18265v1", "paper_url": "http://arxiv.org/abs/2501.18265v1", "repo": "null"}}