{"2409.18705": {"publish_time": "2024-09-27", "title": "Speech Boosting: Low-Latency Live Speech Enhancement for TWS Earbuds", "paper_summary": "This paper introduces a speech enhancement solution tailored for true\nwireless stereo (TWS) earbuds on-device usage. The solution was specifically\ndesigned to support conversations in noisy environments, with active noise\ncancellation (ANC) activated. The primary challenges for speech enhancement\nmodels in this context arise from computational complexity that limits\non-device usage and latency that must be less than 3 ms to preserve a live\nconversation. To address these issues, we evaluated several crucial design\nelements, including the network architecture and domain, design of loss\nfunctions, pruning method, and hardware-specific optimization. Consequently, we\ndemonstrated substantial improvements in speech enhancement quality compared\nwith that in baseline models, while simultaneously reducing the computational\ncomplexity and algorithmic latency.", "paper_summary_zh": "本文介紹了一種針對真無線立體聲 (TWS) 耳機裝置使用量身打造的語音增強解決方案。此解決方案特別設計用於支援在有噪音的環境中進行對話，並啟動主動式抗噪 (ANC)。在此情境中，語音增強模型的主要挑戰來自於計算複雜度，這限制了裝置使用量，且延遲必須小於 3 毫秒才能維持即時對話。為了解決這些問題，我們評估了幾個關鍵的設計元素，包括網路架構和網域、損失函數設計、剪枝方法和特定硬體的最佳化。因此，我們展示了語音增強品質的顯著改善，與基準模型相比，同時降低了計算複雜度和演算法延遲。", "author": "Hanbin Bae et.al.", "authors": "Hanbin Bae, Pavel Andreev, Azat Saginbaev, Nicholas Babaev, Won-Jun Lee, Hosang Sung, Hoon-Young Cho", "id": "2409.18705v1", "paper_url": "http://arxiv.org/abs/2409.18705v1", "repo": "null"}}