{"2504.13717": {"publish_time": "2025-04-18", "title": "Human-aligned Deep Learning: Explainability, Causality, and Biological Inspiration", "paper_summary": "This work aligns deep learning (DL) with human reasoning capabilities and\nneeds to enable more efficient, interpretable, and robust image classification.\nWe approach this from three perspectives: explainability, causality, and\nbiological vision. Introduction and background open this work before diving\ninto operative chapters. First, we assess neural networks' visualization\ntechniques for medical images and validate an explainable-by-design method for\nbreast mass classification. A comprehensive review at the intersection of XAI\nand causality follows, where we introduce a general scaffold to organize past\nand future research, laying the groundwork for our second perspective. In the\ncausality direction, we propose novel modules that exploit feature\nco-occurrence in medical images, leading to more effective and explainable\npredictions. We further introduce CROCODILE, a general framework that\nintegrates causal concepts, contrastive learning, feature disentanglement, and\nprior knowledge to enhance generalization. Lastly, we explore biological\nvision, examining how humans recognize objects, and propose CoCoReco, a\nconnectivity-inspired network with context-aware attention mechanisms. Overall,\nour key findings include: (i) simple activation maximization lacks insight for\nmedical imaging DL models; (ii) prototypical-part learning is effective and\nradiologically aligned; (iii) XAI and causal ML are deeply connected; (iv) weak\ncausal signals can be leveraged without a priori information to improve\nperformance and interpretability; (v) our framework generalizes across medical\ndomains and out-of-distribution data; (vi) incorporating biological circuit\nmotifs improves human-aligned recognition. This work contributes toward\nhuman-aligned DL and highlights pathways to bridge the gap between research and\nclinical adoption, with implications for improved trust, diagnostic accuracy,\nand safe deployment.", "paper_summary_zh": "<paragraph>這項工作使深度學習 (DL) 與人類推理能力相符，旨在實現更高效、更易解釋且更穩健的圖像分類。我們從三個角度探討這個問題：可解釋性、因果關係和生物視覺。引言和背景介紹為這項工作開篇，然後深入探討操作性章節。首先，我們評估了用於醫學圖像的神經網絡可視化技術，並驗證了一種用於乳房腫塊分類的可解釋設計方法。接下來是對 XAI 和因果關係交叉領域的全面回顧，我們引入了一個通用框架來組織過去和未來的研究，為我們的第二個視角奠定了基礎。在因果關係方向上，我們提出了利用醫學圖像中特徵共現的新模塊，從而產生更有效且可解釋的預測。我們進一步介紹了 CROCODILE，這是一個整合了因果概念、對比學習、特徵解耦和先驗知識以增強泛化能力的通用框架。最後，我們探索了生物視覺，研究人類如何識別物體，並提出了 CoCoReco，這是一個受連通性啟發的網絡，具有上下文感知的注意力機制。總體而言，我們的關鍵發現包括：(i) 簡單的激活最大化缺乏對醫學影像深度學習模型的洞察力；(ii) 原型部件學習是有效且與放射學相符的；(iii) XAI 和因果機器學習密切相關；(iv) 即使沒有先驗資訊，也可以利用弱因果信號來提高性能和可解釋性；(v) 我們的框架可以泛化到不同的醫學領域和分佈外數據；(vi) 結合生物電路基序可以改善與人類相符的識別。這項工作有助於實現與人類相符的深度學習，並突出了彌合研究與臨床應用之間差距的途徑，這對提高信任度、診斷準確性和安全部署具有重要意義。</paragraph>\n", "author": "Gianluca Carloni et.al.", "authors": "Gianluca Carloni", "id": "2504.13717v1", "paper_url": "http://arxiv.org/abs/2504.13717v1", "repo": "null"}}