{"2408.06484": {"publish_time": "2024-08-12", "title": "Cross-Lingual Conversational Speech Summarization with Large Language Models", "paper_summary": "Cross-lingual conversational speech summarization is an important problem,\nbut suffers from a dearth of resources. While transcriptions exist for a number\nof languages, translated conversational speech is rare and datasets containing\nsummaries are non-existent. We build upon the existing Fisher and Callhome\nSpanish-English Speech Translation corpus by supplementing the translations\nwith summaries. The summaries are generated using GPT-4 from the reference\ntranslations and are treated as ground truth. The task is to generate similar\nsummaries in the presence of transcription and translation errors. We build a\nbaseline cascade-based system using open-source speech recognition and machine\ntranslation models. We test a range of LLMs for summarization and analyze the\nimpact of transcription and translation errors. Adapting the Mistral-7B model\nfor this task performs significantly better than off-the-shelf models and\nmatches the performance of GPT-4.", "paper_summary_zh": "跨語言對話式語音摘要是一個重要的問題，\n但缺乏資源。雖然許多語言都有轉錄，\n但翻譯過的對話式語音很少，而且包含摘要的資料集並不存在。我們建立在現有的 Fisher 和 Callhome 西班牙文-英文語音翻譯語料庫上，並補充摘要作為翻譯。摘要是使用 GPT-4 從參考翻譯中產生的，並被視為真實情況。任務是在轉錄和翻譯錯誤的情況下產生類似的摘要。我們使用開源語音辨識和機器翻譯模型建立基準層疊式系統。我們測試了一系列 LLM 以進行摘要，並分析轉錄和翻譯錯誤的影響。調整 Mistral-7B 模型以執行此任務的表現顯著優於現成的模型，\n並與 GPT-4 的表現相符。", "author": "Max Nelson et.al.", "authors": "Max Nelson, Shannon Wotherspoon, Francis Keith, William Hartmann, Matthew Snover", "id": "2408.06484v1", "paper_url": "http://arxiv.org/abs/2408.06484v1", "repo": "null"}}