{"2407.21417": {"publish_time": "2024-07-31", "title": "Dancing in Chains: Reconciling Instruction Following and Faithfulness in Language Models", "paper_summary": "Modern language models (LMs) need to follow human instructions while being\nfaithful; yet, they often fail to achieve both. Here, we provide concrete\nevidence of a trade-off between instruction following (i.e., follow open-ended\ninstructions) and faithfulness (i.e., ground responses in given context) when\ntraining LMs with these objectives. For instance, fine-tuning LLaMA-7B on\ninstruction following datasets renders it less faithful. Conversely,\ninstruction-tuned Vicuna-7B shows degraded performance at following\ninstructions when further optimized on tasks that require contextual grounding.\nOne common remedy is multi-task learning (MTL) with data mixing, yet it remains\nfar from achieving a synergic outcome. We propose a simple yet effective method\nthat relies on Rejection Sampling for Continued Self-instruction Tuning\n(ReSet), which significantly outperforms vanilla MTL. Surprisingly, we find\nthat less is more, as training ReSet with high-quality, yet substantially\nsmaller data (three-fold less) yields superior results. Our findings offer a\nbetter understanding of objective discrepancies in alignment training of LMs.", "paper_summary_zh": "現代語言模型 (LM) 在忠實的同時需要遵循人類的指示；然而，它們常常無法同時實現這兩點。在這裡，我們提供了具體證據，說明在使用這些目標訓練 LM 時，在遵循指示（即遵循開放式指示）和忠實度（即在給定的背景中建立回應）之間存在權衡。例如，在遵循指示的數據集上微調 LLaMA-7B 會降低其忠實度。相反，在進一步針對需要上下文依據的任務進行優化時，經過指示調整的 Vicuna-7B 在遵循指示方面的表現會下降。一種常見的補救措施是使用數據混合的多任務學習 (MTL)，但它仍然遠未達到協同效應。我們提出了一種簡單但有效的方法，它依賴於拒絕採樣，用於持續自指導調整 (ReSet)，它明顯優於香草 MTL。令人驚訝的是，我們發現少即是多，因為使用高品質但數量顯著較少（少三倍）的數據訓練 ReSet 會產生更好的結果。我們的發現有助於更好地理解 LM 對齊訓練中的目標差異。", "author": "Zhengxuan Wu et.al.", "authors": "Zhengxuan Wu, Yuhao Zhang, Peng Qi, Yumo Xu, Rujun Han, Yian Zhang, Jifan Chen, Bonan Min, Zhiheng Huang", "id": "2407.21417v1", "paper_url": "http://arxiv.org/abs/2407.21417v1", "repo": "null"}}