{"2411.16075": {"publish_time": "2024-11-25", "title": "The brain versus AI: World-model-based versatile circuit computation underlying diverse functions in the neocortex and cerebellum", "paper_summary": "AI's significant recent advances using general-purpose circuit computations\noffer a potential window into how the neocortex and cerebellum of the brain are\nable to achieve a diverse range of functions across sensory, cognitive, and\nmotor domains, despite their uniform circuit structures. However, comparing the\nbrain and AI is challenging unless clear similarities exist, and past reviews\nhave been limited to comparison of brain-inspired vision AI and the visual\nneocortex. Here, to enable comparisons across diverse functional domains, we\nsubdivide circuit computation into three elements -- circuit structure,\ninput/outputs, and the learning algorithm -- and evaluate the similarities for\neach element. With this novel approach, we identify wide-ranging similarities\nand convergent evolution in the brain and AI, providing new insights into key\nconcepts in neuroscience. Furthermore, inspired by processing mechanisms of AI,\nwe propose a new theory that integrates established neuroscience theories,\nparticularly the theories of internal models and the mirror neuron system. Both\nthe neocortex and cerebellum predict future world events from past information\nand learn from prediction errors, thereby acquiring models of the world. These\nmodels enable three core processes: (1) Prediction -- generating future\ninformation, (2) Understanding -- interpreting the external world via\ncompressed and abstracted sensory information, and (3) Generation --\nrepurposing the future-information generation mechanism to produce other types\nof outputs. The universal application of these processes underlies the ability\nof the neocortex and cerebellum to accomplish diverse functions with uniform\ncircuits. Our systematic approach, insights, and theory promise groundbreaking\nadvances in understanding the brain.", "paper_summary_zh": "<paragraph>AI 近期在通用電路運算上取得重大進展，\n提供了一個潛在窗口，讓我們得以了解大腦的新皮質和小腦如何\n在感官、認知和運動領域實現各種功能，儘管它們的電路結構是統一的。然而，除非存在明確的相似性，否則比較大腦和 AI 具有挑戰性，而且過去的評論僅限於比較受大腦啟發的視覺 AI 和視覺新皮質。在此，為了能夠在不同的功能領域進行比較，我們將電路運算細分為三個要素——電路結構、輸入/輸出和學習演算法——並評估每個要素的相似性。透過這種新穎的方法，我們發現了大腦和 AI 之間廣泛的相似性和趨同演化，為神經科學中的關鍵概念提供了新的見解。此外，受到 AI 處理機制的啟發，我們提出了一個新理論，整合了既定的神經科學理論，特別是內部模型理論和鏡像神經元系統理論。新皮質和小腦都根據過去的資訊預測未來的世界事件，並從預測誤差中學習，從而獲得世界的模型。這些模型啟用了三個核心流程：(1) 預測——產生未來資訊，(2) 理解——透過壓縮和抽象的感官資訊來詮釋外部世界，以及 (3) 生成——重新利用未來資訊生成機制來產生其他類型的輸出。這些流程的通用應用是新皮質和小腦能夠使用統一電路完成多種功能的基礎。我們系統性的方法、見解和理論有望在理解大腦方面取得突破性的進展。</paragraph>", "author": "Shogo Ohmae et.al.", "authors": "Shogo Ohmae, Keiko Ohmae", "id": "2411.16075v1", "paper_url": "http://arxiv.org/abs/2411.16075v1", "repo": "null"}}