{"2410.22307": {"publish_time": "2024-10-29", "title": "SVIP: Towards Verifiable Inference of Open-source Large Language Models", "paper_summary": "Open-source Large Language Models (LLMs) have recently demonstrated\nremarkable capabilities in natural language understanding and generation,\nleading to widespread adoption across various domains. However, their\nincreasing model sizes render local deployment impractical for individual\nusers, pushing many to rely on computing service providers for inference\nthrough a blackbox API. This reliance introduces a new risk: a computing\nprovider may stealthily substitute the requested LLM with a smaller, less\ncapable model without consent from users, thereby delivering inferior outputs\nwhile benefiting from cost savings. In this paper, we formalize the problem of\nverifiable inference for LLMs. Existing verifiable computing solutions based on\ncryptographic or game-theoretic techniques are either computationally\nuneconomical or rest on strong assumptions. We introduce SVIP, a secret-based\nverifiable LLM inference protocol that leverages intermediate outputs from LLM\nas unique model identifiers. By training a proxy task on these outputs and\nrequiring the computing provider to return both the generated text and the\nprocessed intermediate outputs, users can reliably verify whether the computing\nprovider is acting honestly. In addition, the integration of a secret mechanism\nfurther enhances the security of our protocol. We thoroughly analyze our\nprotocol under multiple strong and adaptive adversarial scenarios. Our\nextensive experiments demonstrate that SVIP is accurate, generalizable,\ncomputationally efficient, and resistant to various attacks. Notably, SVIP\nachieves false negative rates below 5% and false positive rates below 3%, while\nrequiring less than 0.01 seconds per query for verification.", "paper_summary_zh": "<paragraph>開放原始碼大型語言模型 (LLM) 最近在自然語言理解和生成方面展現出卓越的能力，導致在各個領域被廣泛採用。然而，其模型規模越來越大，使得個人使用者難以進行本地部署，迫使許多人依賴運算服務提供商透過黑盒 API 進行推論。這種依賴性引入了新的風險：運算提供商可能會在未經使用者同意的情況下，偷偷用較小、功能較弱的模型取代要求的 LLM，從而提供較差的輸出，同時從成本節省中獲利。在本文中，我們正式定義了 LLM 可驗證推論的問題。現有的基於密碼學或博弈論技術的可驗證運算解決方案，要不就是計算不經濟，要不就是依賴於強有力的假設。我們引入了 SVIP，這是一種基於秘密的可驗證 LLM 推論協定，它利用 LLM 的中間輸出作為唯一的模型識別碼。透過在這些輸出上訓練代理任務，並要求運算提供商同時傳回產生的文字和已處理的中間輸出，使用者可以可靠地驗證運算提供商是否誠實。此外，整合秘密機制進一步增強了我們協定的安全性。我們在多種強大且適應性對抗場景下徹底分析了我們的協定。我們廣泛的實驗證明，SVIP 準確、可概化、計算效率高，且能抵抗各種攻擊。值得注意的是，SVIP 的假陰性率低於 5%，假陽性率低於 3%，同時每個查詢的驗證時間少於 0.01 秒。</paragraph>", "author": "Yifan Sun et.al.", "authors": "Yifan Sun, Yuhang Li, Yue Zhang, Yuchen Jin, Huan Zhang", "id": "2410.22307v1", "paper_url": "http://arxiv.org/abs/2410.22307v1", "repo": "null"}}