{"2502.02431": {"publish_time": "2025-02-04", "title": "Connections between Schedule-Free Optimizers, AdEMAMix, and Accelerated SGD Variants", "paper_summary": "Recent advancements in deep learning optimization have introduced new\nalgorithms, such as Schedule-Free optimizers, AdEMAMix, MARS and Lion which\nmodify traditional momentum mechanisms. In a separate line of work, theoretical\nacceleration of stochastic gradient descent (SGD) in noise-dominated regime has\nbeen achieved by decoupling the momentum coefficient from the current\ngradient's weight. In this paper, we establish explicit connections between\nthese two lines of work. We substantiate our theoretical findings with\npreliminary experiments on a 150m language modeling task. We find that\nAdEMAMix, which most closely resembles accelerated versions of stochastic\ngradient descent, exhibits superior performance. Building on these insights, we\nintroduce a modification to AdEMAMix, termed Simplified-AdEMAMix, which\nmaintains the same performance as AdEMAMix across both large and small\nbatch-size settings while eliminating the need for two different momentum\nterms. The code for Simplified-AdEMAMix is available on the repository:\nhttps://github.com/DepenM/Simplified-AdEMAMix/.", "paper_summary_zh": "深度學習優化的最新進展引入了新的演算法，例如免排程最佳化器、AdEMAMix、MARS 和 Lion，這些演算法修改了傳統的動量機制。在另一條工作路線中，透過將動量係數與當前梯度的權重解耦，已在雜訊主導的機制中達成隨機梯度下降 (SGD) 的理論加速。在本文中，我們建立這兩條工作路線之間明確的關聯。我們使用 150m 語言建模任務的初步實驗，來證實我們的理論發現。我們發現最類似於隨機梯度下降加速版本的 AdEMAMix，表現出優異的效能。根據這些見解，我們對 AdEMAMix 進行修改，稱為 Simplified-AdEMAMix，它在大批量和小型批次設定中都維持與 AdEMAMix 相同的效能，同時消除了對兩個不同動量項目的需求。Simplified-AdEMAMix 的程式碼可在儲存庫中取得：https://github.com/DepenM/Simplified-AdEMAMix/。", "author": "Depen Morwani et.al.", "authors": "Depen Morwani, Nikhil Vyas, Hanlin Zhang, Sham Kakade", "id": "2502.02431v1", "paper_url": "http://arxiv.org/abs/2502.02431v1", "repo": "null"}}