{"2412.08378": {"publish_time": "2024-12-11", "title": "HyViLM: Enhancing Fine-Grained Recognition with a Hybrid Encoder for Vision-Language Models", "paper_summary": "Recently, there has been growing interest in the capability of multimodal\nlarge language models (MLLMs) to process high-resolution images. A common\napproach currently involves dynamically cropping the original high-resolution\nimage into smaller sub-images, which are then fed into a vision encoder that\nwas pre-trained on lower-resolution images. However, this cropping approach\noften truncates objects and connected areas in the original image, causing\nsemantic breaks. To address this limitation, we introduce HyViLM, designed to\nprocess images of any resolution while retaining the overall context during\nencoding. Specifically, we: (i) Design a new visual encoder called Hybrid\nEncoder that not only encodes individual sub-images but also interacts with\ndetailed global visual features, significantly improving the model's ability to\nencode high-resolution images. (ii) Propose an optimal feature fusion strategy\nfor the dynamic cropping approach, effectively leveraging information from\ndifferent layers of the vision encoder. Compared with the state-of-the-art\nMLLMs under the same setting, our HyViLM outperforms existing MLLMs in nine out\nof ten tasks. Specifically, HyViLM achieves a 9.6% improvement in performance\non the TextVQA task and a 6.9% enhancement on the DocVQA task.", "paper_summary_zh": "<paragraph>最近，人们对多模态大型语言模型 (MLLM) 处理高分辨率图像的能力越来越感兴趣。目前，一种常见的方法涉及将原始高分辨率图像动态裁剪成较小的子图像，然后将其输入到在低分辨率图像上预训练的视觉编码器中。然而，这种裁剪方法通常会截断原始图像中的对象和连接区域，从而导致语义中断。为了解决这一限制，我们引入了 HyViLM，它旨在处理任何分辨率的图像，同时在编码期间保留整体上下文。具体来说，我们：(i) 设计了一种新的视觉编码器，称为混合编码器，它不仅可以对各个子图像进行编码，还可以与详细的全局视觉特征进行交互，从而显著提高模型对高分辨率图像进行编码的能力。(ii) 为动态裁剪方法提出了一种最佳特征融合策略，有效地利用了视觉编码器不同层的信息。与在相同设置下的最先进的 MLLM 相比，我们的 HyViLM 在十分之九的任务中优于现有的 MLLM。具体来说，HyViLM 在 TextVQA 任务上的性能提高了 9.6%，在 DocVQA 任务上的性能提高了 6.9%。</paragraph>", "author": "Shiding Zhu et.al.", "authors": "Shiding Zhu, Wenhui Dong, Jun Song, Yanan Guo, Bo Zheng", "id": "2412.08378v1", "paper_url": "http://arxiv.org/abs/2412.08378v1", "repo": "null"}}