{"2411.14072": {"publish_time": "2024-11-21", "title": "The Master-Slave Encoder Model for Improving Patent Text Summarization: A New Approach to Combining Specifications and Claims", "paper_summary": "In order to solve the problem of insufficient generation quality caused by\ntraditional patent text abstract generation models only originating from patent\nspecifications, the problem of new terminology OOV caused by rapid patent\nupdates, and the problem of information redundancy caused by insufficient\nconsideration of the high professionalism, accuracy, and uniqueness of patent\ntexts, we proposes a patent text abstract generation model (MSEA) based on a\nmaster-slave encoder architecture; Firstly, the MSEA model designs a\nmaster-slave encoder, which combines the instructions in the patent text with\nthe claims as input, and fully explores the characteristics and details between\nthe two through the master-slave encoder; Then, the model enhances the\nconsideration of new technical terms in the input sequence based on the pointer\nnetwork, and further enhances the correlation with the input text by re\nweighing the \"remembered\" and \"for-gotten\" parts of the input sequence from the\nencoder; Finally, an enhanced repetition suppression mechanism for patent text\nwas introduced to ensure accurate and non redundant abstracts generated. On a\npublicly available patent text dataset, compared to the state-of-the-art model,\nImproved Multi-Head Attention Mechanism (IMHAM), the MSEA model achieves an\nimprovement of 0.006, 0.005, and 0.005 in Rouge-1, Rouge-2, and Rouge-L scores,\nrespectively. MSEA leverages the characteristics of patent texts to effectively\nenhance the quality of patent text generation, demonstrating its advancement\nand effectiveness in the experiments.", "paper_summary_zh": "<paragraph>為了解決傳統專利文本摘要生成模型僅源自專利說明書導致生成品質不足的問題、專利更新快速導致新術語 OOV 的問題，以及對專利文本專業性、準確性、獨特性考量不足導致資訊冗餘的問題，我們提出一個基於主從編碼器架構的專利文本摘要生成模型 (MSEA)；首先，MSEA 模型設計一個主從編碼器，將專利文本中的說明書與權利要求書結合作為輸入，並透過主從編碼器充分探索兩者之間的特性與細節；接著，模型基於 pointer network 增強輸入序列中新技術詞彙的考量，並透過重新加權編碼器中「記住」與「遺忘」的輸入序列部分，進一步提升與輸入文本的關聯性；最後，導入增強的專利文本重複抑制機制，以確保生成摘要的準確性與非冗餘性。在一個公開的專利文本資料集上，與目前最先進的模型 Improved Multi-Head Attention Mechanism (IMHAM) 相比，MSEA 模型在 Rouge-1、Rouge-2、Rouge-L 分數上分別提升了 0.006、0.005、0.005。MSEA 充分利用專利文本的特性，有效提升專利文本生成的品質，在實驗中展現其先進性與有效性。</paragraph>", "author": "Shu Zhou et.al.", "authors": "Shu Zhou, Xin Wang, Zhengda Zhou, Haohan Yi, Xuhui Zheng, Hao Wan", "id": "2411.14072v1", "paper_url": "http://arxiv.org/abs/2411.14072v1", "repo": "null"}}