{"2410.23218": {"publish_time": "2024-10-30", "title": "OS-ATLAS: A Foundation Action Model for Generalist GUI Agents", "paper_summary": "Existing efforts in building GUI agents heavily rely on the availability of\nrobust commercial Vision-Language Models (VLMs) such as GPT-4o and\nGeminiProVision. Practitioners are often reluctant to use open-source VLMs due\nto their significant performance lag compared to their closed-source\ncounterparts, particularly in GUI grounding and Out-Of-Distribution (OOD)\nscenarios. To facilitate future research in this area, we developed OS-Atlas -\na foundational GUI action model that excels at GUI grounding and OOD agentic\ntasks through innovations in both data and modeling. We have invested\nsignificant engineering effort in developing an open-source toolkit for\nsynthesizing GUI grounding data across multiple platforms, including Windows,\nLinux, MacOS, Android, and the web. Leveraging this toolkit, we are releasing\nthe largest open-source cross-platform GUI grounding corpus to date, which\ncontains over 13 million GUI elements. This dataset, combined with innovations\nin model training, provides a solid foundation for OS-Atlas to understand GUI\nscreenshots and generalize to unseen interfaces. Through extensive evaluation\nacross six benchmarks spanning three different platforms (mobile, desktop, and\nweb), OS-Atlas demonstrates significant performance improvements over previous\nstate-of-the-art models. Our evaluation also uncovers valuable insights into\ncontinuously improving and scaling the agentic capabilities of open-source\nVLMs.", "paper_summary_zh": "現有的 GUI 代理建構工作高度依賴於強大的商用視覺語言模型 (VLM)，例如 GPT-4o 和 GeminiProVision。實務工作者通常不願意使用開放原始碼 VLM，因為它們的效能表現遠不如閉源對應產品，特別是在 GUI 基礎和分布外 (OOD) 場景中。為了促進這方面的未來研究，我們開發了 OS-Atlas，這是一個基礎 GUI 動作模型，透過資料和建模的創新，在 GUI 基礎和 OOD 代理任務中表現出色。我們投入大量的工程心力來開發一個開放原始碼工具包，用於在多個平台（包括 Windows、Linux、MacOS、Android 和網路）中合成 GUI 基礎資料。利用這個工具包，我們發布了迄今為止最大的開放原始碼跨平台 GUI 基礎語料庫，其中包含超過 1300 萬個 GUI 元素。此資料集結合了模型訓練的創新，為 OS-Atlas 理解 GUI 螢幕截圖並概括到未見過的介面提供了穩固的基礎。透過橫跨三個不同平台（行動、桌上型和網路）的六個基準測試進行廣泛評估，OS-Atlas 展示出比先前的最先進模型有顯著的效能提升。我們的評估也揭示了寶貴的見解，可以持續改善和擴展開放原始碼 VLM 的代理功能。", "author": "Zhiyong Wu et.al.", "authors": "Zhiyong Wu, Zhenyu Wu, Fangzhi Xu, Yian Wang, Qiushi Sun, Chengyou Jia, Kanzhi Cheng, Zichen Ding, Liheng Chen, Paul Pu Liang, Yu Qiao", "id": "2410.23218v1", "paper_url": "http://arxiv.org/abs/2410.23218v1", "repo": "null"}}