{"2407.06972": {"publish_time": "2024-07-09", "title": "Microsoft Cloud-based Digitization Workflow with Rich Metadata Acquisition for Cultural Heritage Objects", "paper_summary": "In response to several cultural heritage initiatives at the Jagiellonian\nUniversity, we have developed a new digitization workflow in collaboration with\nthe Jagiellonian Library (JL). The solution is based on easy-to-access\ntechnological solutions -- Microsoft 365 cloud with MS Excel files as metadata\nacquisition interfaces, Office Script for validation, and MS Sharepoint for\nstorage -- that allows metadata acquisition by domain experts (philologists,\nhistorians, philosophers, librarians, archivists, curators, etc.) regardless of\ntheir experience with information systems. The ultimate goal is to create a\nknowledge graph that describes the analyzed holdings, linked to general\nknowledge bases, as well as to other cultural heritage collections, so careful\nattention is paid to the high accuracy of metadata and proper links to external\nsources. The workflow has already been evaluated in two pilots in the DiHeLib\nproject focused on digitizing the so-called \"Berlin Collection\" and in two\nworkshops with international guests, which allowed for its refinement and\nconfirmation of its correctness and usability for JL. As the proposed workflow\ndoes not interfere with existing systems or domain guidelines regarding\ndigitization and basic metadata collection in a given institution (e.g., file\ntype, image quality, use of Dublin Core/MARC-21), but extends them in order to\nenable rich metadata collection, not previously possible, we believe that it\ncould be of interest to all GLAMs (galleries, libraries, archives, and\nmuseums).", "paper_summary_zh": "<paragraph>為回應 Jagiello 大學的數個文化遺產倡議，我們與 Jagiello 圖書館 (JL) 合作開發一個新的數位化工作流程。此解決方案基於易於存取的技術解決方案，包括：作為元資料擷取介面的 Microsoft 365 雲端與 MS Excel 檔案、用於驗證的 Office Script，以及用於儲存的 MS Sharepoint，它允許領域專家（語言學家、歷史學家、哲學家、圖書館員、檔案管理員、策展人等）擷取元資料，而無須具備資訊系統方面的經驗。最終目標是建立一個知識圖譜，用以描述所分析的館藏，並連結至一般知識庫，以及其他文化遺產館藏，因此我們非常重視元資料的高準確性，以及與外部來源的適當連結。此工作流程已在 DiHeLib 專案中兩個試點計畫中進行評估，該專案專注於數位化所謂的「柏林館藏」，以及與國際訪客進行的兩個工作坊，這讓我們得以改善工作流程，並確認其正確性，以及對 JL 的可用性。由於所提出的工作流程不會干擾既有系統或關於數位化和基本元資料蒐集的領域指南（例如，檔案類型、影像品質、使用 Dublin Core/MARC-21），而是擴充這些系統，以支援以前無法進行的豐富元資料蒐集，因此我們相信它可能會引起所有 GLAM（畫廊、圖書館、檔案館和博物館）的興趣。</paragraph>", "author": "Krzysztof Kutt et.al.", "authors": "Krzysztof Kutt, Jakub Gomułka, Luiz do Valle Miranda, Grzegorz J. Nalepa", "id": "2407.06972v1", "paper_url": "http://arxiv.org/abs/2407.06972v1", "repo": "null"}}