{"2407.17075": {"publish_time": "2024-07-24", "title": "SAFETY-J: Evaluating Safety with Critique", "paper_summary": "The deployment of Large Language Models (LLMs) in content generation raises\nsignificant safety concerns, particularly regarding the transparency and\ninterpretability of content evaluations. Current methods, primarily focused on\nbinary safety classifications, lack mechanisms for detailed critique, limiting\ntheir utility for model improvement and user trust. To address these\nlimitations, we introduce SAFETY-J, a bilingual generative safety evaluator for\nEnglish and Chinese with critique-based judgment. SAFETY-J utilizes a robust\ntraining dataset that includes diverse dialogues and augmented query-response\npairs to assess safety across various scenarios comprehensively. We establish\nan automated meta-evaluation benchmark that objectively assesses the quality of\ncritiques with minimal human intervention, facilitating scalable and continuous\nimprovement. Additionally, SAFETY-J employs an iterative preference learning\ntechnique to dynamically refine safety assessments based on meta-evaluations\nand critiques. Our evaluations demonstrate that SAFETY-J provides more nuanced\nand accurate safety evaluations, thereby enhancing both critique quality and\npredictive reliability in complex content scenarios. To facilitate further\nresearch and application, we open-source SAFETY-J's training protocols,\ndatasets, and code at \\url{https://github.com/GAIR-NLP/Safety-J}.", "paper_summary_zh": "大型語言模型 (LLM) 在內容生成中的部署引發了重大的安全問題，特別是關於內容評估的透明度和可解釋性。目前的方法主要集中在二元安全分類上，缺乏詳細的批評機制，限制了它們在模型改進和使用者信任方面的效用。為了解決這些限制，我們引入了 SAFETY-J，這是一個基於批評判斷的英語和中文雙語生成安全評估器。SAFETY-J 使用了一個強大的訓練資料集，其中包括多樣化的對話和增強的查詢回應對，以全面評估各種場景中的安全性。我們建立了一個自動化的元評估基準，可以客觀地評估批評的品質，並將人為干預降至最低，促進可擴展和持續的改進。此外，SAFETY-J 採用了一種迭代偏好學習技術，根據元評估和批評動態優化安全評估。我們的評估表明，SAFETY-J 提供了更細緻且準確的安全評估，從而提高了複雜內容場景中的批評品質和預測可靠性。為了促進進一步的研究和應用，我們開放了 SAFETY-J 的訓練協議、資料集和程式碼，網址為 \\url{https://github.com/GAIR-NLP/Safety-J}。", "author": "Yixiu Liu et.al.", "authors": "Yixiu Liu, Yuxiang Zheng, Shijie Xia, Yuan Guo, Jiajun Li, Yi Tu, Chaoling Song, Pengfei Liu", "id": "2407.17075v2", "paper_url": "http://arxiv.org/abs/2407.17075v2", "repo": "null"}}