{"2407.03297": {"publish_time": "2024-07-03", "title": "Improved Noise Schedule for Diffusion Training", "paper_summary": "Diffusion models have emerged as the de facto choice for generating visual\nsignals. However, training a single model to predict noise across various\nlevels poses significant challenges, necessitating numerous iterations and\nincurring significant computational costs. Various approaches, such as loss\nweighting strategy design and architectural refinements, have been introduced\nto expedite convergence. In this study, we propose a novel approach to design\nthe noise schedule for enhancing the training of diffusion models. Our key\ninsight is that the importance sampling of the logarithm of the Signal-to-Noise\nratio (logSNR), theoretically equivalent to a modified noise schedule, is\nparticularly beneficial for training efficiency when increasing the sample\nfrequency around $\\log \\text{SNR}=0$. We empirically demonstrate the\nsuperiority of our noise schedule over the standard cosine schedule.\nFurthermore, we highlight the advantages of our noise schedule design on the\nImageNet benchmark, showing that the designed schedule consistently benefits\ndifferent prediction targets.", "paper_summary_zh": "擴散模型已成為生成視覺訊號的事實標準選擇。然而，訓練單一模型來預測各種層級的雜訊會帶來重大挑戰，需要進行多次反覆運算，並產生大量的運算成本。已推出各種方法，例如損失加權策略設計和架構改良，以加速收斂。在本研究中，我們提出一個新的方法來設計雜訊排程，以增強擴散模型的訓練。我們的關鍵見解是，信噪比（logSNR）的對數的重要性抽樣，理論上等於修改後的雜訊排程，在增加 $\\log \\text{SNR}=0$ 附近的抽樣頻率時，特別有利於訓練效率。我們以經驗證明我們的雜訊排程優於標準餘弦排程。此外，我們強調我們的雜訊排程設計在 ImageNet 基準上的優點，顯示設計的排程持續有利於不同的預測目標。", "author": "Tiankai Hang et.al.", "authors": "Tiankai Hang, Shuyang Gu", "id": "2407.03297v1", "paper_url": "http://arxiv.org/abs/2407.03297v1", "repo": "null"}}