{"2501.07911": {"publish_time": "2025-01-14", "title": "Deep Learning and Natural Language Processing in the Field of Construction", "paper_summary": "This article presents a complete process to extract hypernym relationships in\nthe field of construction using two main steps: terminology extraction and\ndetection of hypernyms from these terms. We first describe the corpus analysis\nmethod to extract terminology from a collection of technical specifications in\nthe field of construction. Using statistics and word n-grams analysis, we\nextract the domain's terminology and then perform pruning steps with linguistic\npatterns and internet queries to improve the quality of the final terminology.\nSecond, we present a machine-learning approach based on various words embedding\nmodels and combinations to deal with the detection of hypernyms from the\nextracted terminology. Extracted terminology is evaluated using a manual\nevaluation carried out by 6 experts in the domain, and the hypernym\nidentification method is evaluated with different datasets. The global approach\nprovides relevant and promising results.", "paper_summary_zh": "本文提出了一個完整的流程，使用兩個主要步驟在建築領域中提取上位詞關係：術語提取和從這些術語中偵測上位詞。我們首先描述語料庫分析方法，以從建築領域的技術規範集合中提取術語。使用統計和字元 n-grams 分析，我們提取領域的術語，然後使用語言模式和網路查詢執行修剪步驟，以提高最終術語的品質。其次，我們提出一個基於各種字詞嵌入模型和組合的機器學習方法，以處理從提取的術語中偵測上位詞。提取的術語使用由領域中的 6 位專家執行的，手動評估進行評估，並且上位詞識別方法使用不同的資料集進行評估。整體方法提供了相關且有希望的結果。", "author": "Rémy Kessler et.al.", "authors": "Rémy Kessler, Nicolas Béchet", "id": "2501.07911v1", "paper_url": "http://arxiv.org/abs/2501.07911v1", "repo": "null"}}