{"2405.18820": {"publish_time": "2024-05-29", "title": "Diffeomorphic interpolation for efficient persistence-based topological optimization", "paper_summary": "Topological Data Analysis (TDA) provides a pipeline to extract quantitative\ntopological descriptors from structured objects. This enables the definition of\ntopological loss functions, which assert to what extent a given object exhibits\nsome topological properties. These losses can then be used to perform\ntopological optimizationvia gradient descent routines. While theoretically\nsounded, topological optimization faces an important challenge: gradients tend\nto be extremely sparse, in the sense that the loss function typically depends\non only very few coordinates of the input object, yielding dramatically slow\noptimization schemes in practice.Focusing on the central case of topological\noptimization for point clouds, we propose in this work to overcome this\nlimitation using diffeomorphic interpolation, turning sparse gradients into\nsmooth vector fields defined on the whole space, with quantifiable Lipschitz\nconstants. In particular, we show that our approach combines efficiently with\nsubsampling techniques routinely used in TDA, as the diffeomorphism derived\nfrom the gradient computed on a subsample can be used to update the coordinates\nof the full input object, allowing us to perform topological optimization on\npoint clouds at an unprecedented scale. Finally, we also showcase the relevance\nof our approach for black-box autoencoder (AE) regularization, where we aim at\nenforcing topological priors on the latent spaces associated to fixed,\npre-trained, black-box AE models, and where we show thatlearning a\ndiffeomorphic flow can be done once and then re-applied to new data in linear\ntime (while vanilla topological optimization has to be re-run from scratch).\nMoreover, reverting the flow allows us to generate data by sampling the\ntopologically-optimized latent space directly, yielding better interpretability\nof the model.", "paper_summary_zh": "<paragraph>拓撲資料分析 (TDA) 提供一個管道，從結構化物件中萃取出定量的拓撲描述符。這使得拓撲損失函數的定義成為可能，而拓撲損失函數斷言給定物件展現出某種拓撲性質的程度。這些損失接著可用於透過梯度下降例程執行拓撲最佳化。雖然在理論上站得住腳，但拓撲最佳化面臨一個重要的挑戰：梯度往往極度稀疏，換句話說，損失函數通常僅取決於輸入物件的極少數座標，在實務上導致最佳化架構的進度極慢。專注於點雲拓撲最佳化的核心案例，我們在這項工作中提出使用同胚插值來克服這個限制，將稀疏梯度轉換為定義在整個空間上的平滑向量場，並具有可量化的 Lipschitz 常數。特別是，我們展示我們的做法與 TDA 中例行使用的子抽樣技術有效結合，因為從子樣本中計算出的梯度所衍生的同胚可用於更新完整輸入物件的座標，讓我們得以在空前規模上對點雲執行拓撲最佳化。最後，我們也展示我們的做法與黑箱自動編碼器 (AE) 正則化的關聯性，我們在其中旨在對與固定、預先訓練的黑箱 AE 模型相關聯的潛在空間施加拓撲先驗，並展示學習同胚流可以執行一次，然後以線性時間重新套用於新資料（而傳統的拓撲最佳化必須從頭開始重新執行）。此外，逆轉流讓我們能夠透過直接抽樣拓撲最佳化的潛在空間來產生資料，進而提升模型的可解釋性。</paragraph>", "author": "Mathieu Carriere et.al.", "authors": "Mathieu Carriere, Marc Theveneau, Théo Lacombe", "id": "2405.18820v1", "paper_url": "http://arxiv.org/abs/2405.18820v1", "repo": "null"}}