{"2410.10610": {"publish_time": "2024-10-14", "title": "Intelligent prospector v2.0: exploration drill planning under epistemic model uncertainty", "paper_summary": "Optimal Bayesian decision making on what geoscientific data to acquire\nrequires stating a prior model of uncertainty. Data acquisition is then\noptimized by reducing uncertainty on some property of interest maximally, and\non average. In the context of exploration, very few, sometimes no data at all,\nis available prior to data acquisition planning. The prior model therefore\nneeds to include human interpretations on the nature of spatial variability, or\non analogue data deemed relevant for the area being explored. In mineral\nexploration, for example, humans may rely on conceptual models on the genesis\nof the mineralization to define multiple hypotheses, each representing a\nspecific spatial variability of mineralization. More often than not, after the\ndata is acquired, all of the stated hypotheses may be proven incorrect, i.e.\nfalsified, hence prior hypotheses need to be revised, or additional hypotheses\ngenerated. Planning data acquisition under wrong geological priors is likely to\nbe inefficient since the estimated uncertainty on the target property is\nincorrect, hence uncertainty may not be reduced at all. In this paper, we\ndevelop an intelligent agent based on partially observable Markov decision\nprocesses that plans optimally in the case of multiple geological or\ngeoscientific hypotheses on the nature of spatial variability. Additionally,\nthe artificial intelligence is equipped with a method that allows detecting,\nearly on, whether the human stated hypotheses are incorrect, thereby saving\nconsiderable expense in data acquisition. Our approach is tested on a\nsediment-hosted copper deposit, and the algorithm presented has aided in the\ncharacterization of an ultra high-grade deposit in Zambia in 2023.", "paper_summary_zh": "在什麼地質科學資料的取得上進行最佳貝氏決策，需要陳述一個先驗的不確定性模型。資料取得的最佳化，是透過最大化並平均化對某個感興趣的屬性的不確定性來進行。在探勘的脈絡中，在資料取得規劃之前，很少有資料，有時甚至完全沒有資料。因此，先驗模型需要包含人類對於空間變異性的本質，或對於被認為與正在探勘區域相關的類比資料的人為詮釋。例如，在礦物探勘中，人類可能會依賴成礦概念模型來定義多重假設，每個假設都代表礦化的特定空間變異性。在資料取得後，通常所有陳述的假設都可能被證明是不正確的，也就是被證偽的，因此先驗假設需要被修正，或產生額外的假設。在錯誤的地質先驗下規劃資料取得可能會沒有效率，因為對目標屬性的估計不確定性是不正確的，因此不確定性可能完全沒有減少。在本文中，我們開發了一個基於部分可觀察馬可夫決策過程的智慧代理，在對空間變異性的本質有多重地質或地質科學假設的情況下，進行最佳規劃。此外，人工智慧配備了一個方法，可以及早偵測人類陳述的假設是否不正確，從而節省大量的資料取得費用。我們的做法在一個沉積銅礦床中進行測試，而所提出的演算法已經協助在 2023 年對尚比亞的一個超高品位礦床進行特徵描述。", "author": "John Mern et.al.", "authors": "John Mern, Anthony Corso, Damian Burch, Kurt House, Jef Caers", "id": "2410.10610v1", "paper_url": "http://arxiv.org/abs/2410.10610v1", "repo": "null"}}