{"2408.00921": {"publish_time": "2024-08-01", "title": "Automatic Pull Request Description Generation Using LLMs: A T5 Model Approach", "paper_summary": "Developers create pull request (PR) descriptions to provide an overview of\ntheir changes and explain the motivations behind them. These descriptions help\nreviewers and fellow developers quickly understand the updates. Despite their\nimportance, some developers omit these descriptions. To tackle this problem, we\npropose an automated method for generating PR descriptions based on commit\nmessages and source code comments. This method frames the task as a text\nsummarization problem, for which we utilized the T5 text-to-text transfer\nmodel. We fine-tuned a pre-trained T5 model using a dataset containing 33,466\nPRs. The model's effectiveness was assessed using ROUGE metrics, which are\nrecognized for their strong alignment with human evaluations. Our findings\nreveal that the T5 model significantly outperforms LexRank, which served as our\nbaseline for comparison.", "paper_summary_zh": "開發人員建立拉取請求 (PR) 說明，提供變更的概觀並說明背後的動機。這些說明有助於審查者和開發人員夥伴快速了解更新。儘管它們很重要，但有些開發人員會省略這些說明。為了解決這個問題，我們提出一個自動化方法，根據提交訊息和原始碼註解產生 PR 說明。此方法將任務設定為一個文字摘要問題，我們為此利用了 T5 文字到文字轉移模型。我們使用包含 33,466 個 PR 的資料集微調預訓練的 T5 模型。模型的有效性是使用 ROUGE 指標進行評估的，這些指標因與人類評估的高度一致性而受到認可。我們的研究結果顯示，T5 模型顯著優於 LexRank，而 LexRank 是我們用於比較的基準。", "author": "Md Nazmus Sakib et.al.", "authors": "Md Nazmus Sakib, Md Athikul Islam, Md Mashrur Arifin", "id": "2408.00921v1", "paper_url": "http://arxiv.org/abs/2408.00921v1", "repo": "null"}}