{"2502.05740": {"publish_time": "2025-02-09", "title": "RECOVER: Designing a Large Language Model-based Remote Patient Monitoring System for Postoperative Gastrointestinal Cancer Care", "paper_summary": "Cancer surgery is a key treatment for gastrointestinal (GI) cancers, a group\nof cancers that account for more than 35% of cancer-related deaths worldwide,\nbut postoperative complications are unpredictable and can be life-threatening.\nIn this paper, we investigate how recent advancements in large language models\n(LLMs) can benefit remote patient monitoring (RPM) systems through clinical\nintegration by designing RECOVER, an LLM-powered RPM system for postoperative\nGI cancer care. To closely engage stakeholders in the design process, we first\nconducted seven participatory design sessions with five clinical staff and\ninterviewed five cancer patients to derive six major design strategies for\nintegrating clinical guidelines and information needs into LLM-based RPM\nsystems. We then designed and implemented RECOVER, which features an\nLLM-powered conversational agent for cancer patients and an interactive\ndashboard for clinical staff to enable efficient postoperative RPM. Finally, we\nused RECOVER as a pilot system to assess the implementation of our design\nstrategies with four clinical staff and five patients, providing design\nimplications by identifying crucial design elements, offering insights on\nresponsible AI, and outlining opportunities for future LLM-powered RPM systems.", "paper_summary_zh": "癌症手術是胃腸道 (GI) 癌症的主要治療方式，這類癌症佔全球癌症相關死亡人數的 35% 以上，但術後併發症無法預測，且可能危及生命。在本文中，我們探討大型語言模型 (LLM) 的近期進展如何透過臨床整合造福遠端病患監控 (RPM) 系統，方法是設計 RECOVER，一個由 LLM 驅動的 RPM 系統，用於術後胃腸道癌症照護。為了讓利害關係人密切參與設計流程，我們首先與五位臨床人員進行七場參與式設計會議，並訪談五位癌症患者，以找出六項整合臨床指南和資訊需求至基於 LLM 的 RPM 系統的主要設計策略。接著，我們設計並實作 RECOVER，其特色在於一個由 LLM 驅動的對話式代理人，供癌症患者使用，以及一個互動式儀表板，供臨床人員使用，以進行有效的術後 RPM。最後，我們使用 RECOVER 作為試點系統，與四位臨床人員和五位患者評估我們設計策略的實作，並透過找出重要的設計元素、提供對負責任 AI 的見解，以及概述未來由 LLM 驅動的 RPM 系統的機會，提出設計意涵。", "author": "Ziqi Yang et.al.", "authors": "Ziqi Yang, Yuxuan Lu, Jennifer Bagdasarian, Vedant Das Swain, Ritu Agarwal, Collin Campbell, Waddah Al-Refaire, Jehan El-Bayoumi, Guodong Gao, Dakuo Wang, Bingsheng Yao, Nawar Shara", "id": "2502.05740v1", "paper_url": "http://arxiv.org/abs/2502.05740v1", "repo": "null"}}