{"2502.03629": {"publish_time": "2025-02-05", "title": "REALEDIT: Reddit Edits As a Large-scale Empirical Dataset for Image Transformations", "paper_summary": "Existing image editing models struggle to meet real-world demands. Despite\nexcelling in academic benchmarks, they have yet to be widely adopted for real\nuser needs. Datasets that power these models use artificial edits, lacking the\nscale and ecological validity necessary to address the true diversity of user\nrequests. We introduce REALEDIT, a large-scale image editing dataset with\nauthentic user requests and human-made edits sourced from Reddit. REALEDIT\nincludes a test set of 9300 examples to evaluate models on real user requests.\nOur results show that existing models fall short on these tasks, highlighting\nthe need for realistic training data. To address this, we introduce 48K\ntraining examples and train our REALEDIT model, achieving substantial gains -\noutperforming competitors by up to 165 Elo points in human judgment and 92\npercent relative improvement on the automated VIEScore metric. We deploy our\nmodel on Reddit, testing it on new requests, and receive positive feedback.\nBeyond image editing, we explore REALEDIT's potential in detecting edited\nimages by partnering with a deepfake detection non-profit. Finetuning their\nmodel on REALEDIT data improves its F1-score by 14 percentage points,\nunderscoring the dataset's value for broad applications.", "paper_summary_zh": "現有的影像編輯模型難以滿足現實世界的需求。儘管在學術基準上表現優異，但它們尚未廣泛用於滿足實際的使用者需求。驅動這些模型的資料集使用人工編輯，缺乏處理使用者要求真實多樣性的規模和生態效度。我們推出 REALEDIT，一個具有真實使用者要求和來自 Reddit 的人為編輯的大規模影像編輯資料集。REALEDIT 包含一個 9300 個範例的測試集，用於評估模型對真實使用者要求的表現。我們的結果顯示，現有的模型在這些任務上表現不佳，突顯了對真實訓練資料的需求。為了解決這個問題，我們引入了 48K 個訓練範例，並訓練我們的 REALEDIT 模型，取得了顯著的進展 - 在人類判斷中領先競爭對手多達 165 Elo 點，在自動化 VIEScore 指標上相對改善了 92%。我們在 Reddit 上部署我們的模型，對新的要求進行測試，並收到正面的回饋。除了影像編輯之外，我們還探索了 REALEDIT 在偵測編輯過影像的潛力，並與一家非營利的深度偽造偵測公司合作。在 REALEDIT 資料集上微調他們的模型，將其 F1 分數提高了 14 個百分點，突顯了該資料集對廣泛應用程式的價值。", "author": "Peter Sushko et.al.", "authors": "Peter Sushko, Ayana Bharadwaj, Zhi Yang Lim, Vasily Ilin, Ben Caffee, Dongping Chen, Mohammadreza Salehi, Cheng-Yu Hsieh, Ranjay Krishna", "id": "2502.03629v1", "paper_url": "http://arxiv.org/abs/2502.03629v1", "repo": "null"}}