{"2411.14957": {"publish_time": "2024-11-22", "title": "Information Extraction from Heterogenous Documents without Ground Truth Labels using Synthetic Label Generation and Knowledge Distillation", "paper_summary": "Invoices and receipts submitted by employees are visually rich documents\n(VRDs) with textual, visual and layout information. To protect against the risk\nof fraud and abuse, it is crucial for organizations to efficiently extract\ndesired information from submitted receipts. This helps in the assessment of\nkey factors such as appropriateness of the expense claim, adherence to spending\nand transaction policies, the validity of the receipt, as well as downstream\nanomaly detection at various levels. These documents are heterogenous, with\nmultiple formats and languages, uploaded with different image qualities, and\noften do not contain ground truth labels for the efficient training of models.\nIn this paper we propose Task Aware Instruction-based Labelling (TAIL), a\nmethod for synthetic label generation in VRD corpuses without labels, and\nfine-tune a multimodal Visually Rich Document Understanding Model (VRDU) on\nTAIL labels using response-based knowledge distillation without using the\nteacher model's weights or training dataset to conditionally generate\nannotations in the appropriate format. Using a benchmark external dataset where\nground truth labels are available, we demonstrate conditions under which our\napproach performs at par with Claude 3 Sonnet through empirical studies. We\nthen show that the resulting model performs at par or better on the internal\nexpense documents of a large multinational organization than state-of-the-art\nLMM (large multimodal model) Claude 3 Sonnet while being 85% less costly and\n~5X faster, and outperforms layout-aware baselines by more than 10% in Average\nNormalized Levenshtein Similarity (ANLS) scores due to its ability to reason\nand extract information from rare formats. Finally, we illustrate the usage of\nour approach in overpayment prevention.", "paper_summary_zh": "員工提交的發票和收據是視覺豐富文件 (VRD)，包含文字、視覺和版面資訊。為了防範詐欺和濫用風險，組織有效從已提交收據中萃取所需資訊至關重要。這有助於評估關鍵因素，例如費用申報是否適當、是否遵守支出和交易政策、收據的有效性，以及各種層級的下游異常偵測。這些文件是異質的，具有多種格式和語言，上傳時具有不同的影像品質，而且通常不包含有效標籤，無法有效訓練模型。在本文中，我們提出任務感知指令標籤 (TAIL)，這是一種在沒有標籤的 VRD 語料庫中進行合成標籤產生方法，並使用基於回應的知識蒸餾，微調多模態視覺豐富文件理解模型 (VRDU) 的 TAIL 標籤，而不用教師模型的權重或訓練資料集來有條件地產生適當格式的註解。使用基準外部資料集（其中有有效標籤），我們透過實證研究展示了在哪些條件下，我們的做法與 Claude 3 Sonnet 表現相當。接著我們展示，對於大型跨國組織的內部費用文件，最終產生的模型表現與最先進的大型多模態模型 (LMM) Claude 3 Sonnet 相當或更好，同時成本降低 85%，速度快約 5 倍，而且由於其推理和從罕見格式萃取資訊的能力，在平均標準化 Levenshtein 相似度 (ANLS) 分數上比考量版面的基準高出 10% 以上。最後，我們說明了在防止多付中使用我們做法的方式。", "author": "Aniket Bhattacharyya et.al.", "authors": "Aniket Bhattacharyya, Anurag Tripathi", "id": "2411.14957v1", "paper_url": "http://arxiv.org/abs/2411.14957v1", "repo": "null"}}