{"2406.00656": {"publish_time": "2024-06-02", "title": "Presence or Absence: Are Unknown Word Usages in Dictionaries?", "paper_summary": "In this work, we outline the components and results of our system submitted\nto the AXOLOTL-24 shared task for Finnish, Russian and German languages. Our\nsystem is fully unsupervised. It leverages a graph-based clustering approach to\npredict mappings between unknown word usages and dictionary entries for Subtask\n1, and generates dictionary-like definitions for those novel word usages\nthrough the state-of-the-art Large Language Models such as GPT-4 and LLaMA-3\nfor Subtask 2. In Subtask 1, our system outperforms the baseline system by a\nlarge margin, and it offers interpretability for the mapping results by\ndistinguishing between matched and unmatched (novel) word usages through our\ngraph-based clustering approach. Our system ranks first in Finnish and German,\nand ranks second in Russian on the Subtask 2 test-phase leaderboard. These\nresults show the potential of our system in managing dictionary entries,\nparticularly for updating dictionaries to include novel sense entries. Our code\nand data are made publicly\navailable\\footnote{\\url{https://github.com/xiaohemaikoo/axolotl24-ABDN-NLP}}.", "paper_summary_zh": "在這項工作中，我們概述了我們提交給芬蘭語、俄語和德語語言的 AXOLOTL-24 共享任務的系統組成和結果。我們的系統完全沒有監督。它利用基於圖形的群集方法來預測子任務 1 中未知單詞用法和字典條目之間的對應關係，並通過 GPT-4 和 LLaMA-3 等最先進的大語言模型為這些新單詞用法生成類似字典的定義，用於子任務 2。在子任務 1 中，我們的系統以大幅優於基準系統，並且通過我們的基於圖形的群集方法區分匹配和不匹配（新穎）單詞用法，為映射結果提供了解釋性。我們的系統在芬蘭語和德語中排名第一，在子任務 2 測試階段排行榜中排名第二。這些結果顯示了我們的系統在管理字典條目方面的潛力，特別是對於更新字典以包含新的意義條目。我們的代碼和數據已公開\\footnote{\\url{https://github.com/xiaohemaikoo/axolotl24-ABDN-NLP}}。", "author": "Xianghe Ma et.al.", "authors": "Xianghe Ma, Dominik Schlechtweg, Wei Zhao", "id": "2406.00656v1", "paper_url": "http://arxiv.org/abs/2406.00656v1", "repo": "https://github.com/xiaohemaikoo/axolotl24-abdn-nlp"}}