{"2411.07518": {"publish_time": "2024-11-12", "title": "LLM App Squatting and Cloning", "paper_summary": "Impersonation tactics, such as app squatting and app cloning, have posed\nlongstanding challenges in mobile app stores, where malicious actors exploit\nthe names and reputations of popular apps to deceive users. With the rapid\ngrowth of Large Language Model (LLM) stores like GPT Store and FlowGPT, these\nissues have similarly surfaced, threatening the integrity of the LLM app\necosystem. In this study, we present the first large-scale analysis of LLM app\nsquatting and cloning using our custom-built tool, LLMappCrazy. LLMappCrazy\ncovers 14 squatting generation techniques and integrates Levenshtein distance\nand BERT-based semantic analysis to detect cloning by analyzing app functional\nsimilarities. Using this tool, we generated variations of the top 1000 app\nnames and found over 5,000 squatting apps in the dataset. Additionally, we\nobserved 3,509 squatting apps and 9,575 cloning cases across six major\nplatforms. After sampling, we find that 18.7% of the squatting apps and 4.9% of\nthe cloning apps exhibited malicious behavior, including phishing, malware\ndistribution, fake content dissemination, and aggressive ad injection.", "paper_summary_zh": "冒充策略，例如應用程式搶註和應用程式複製，已對行動應用程式商店構成長期的挑戰，惡意行為者利用熱門應用程式的名稱和聲譽來欺騙使用者。隨著大型語言模型 (LLM) 商店，例如 GPT Store 和 FlowGPT 的快速成長，這些問題也隨之浮現，威脅到 LLM 應用程式生態系統的完整性。在這項研究中，我們使用自訂建置的工具 LLMappCrazy，針對 LLM 應用程式搶註和複製進行首次大規模分析。LLMappCrazy 涵蓋 14 種搶註產生技術，並整合 Levenshtein 距離和基於 BERT 的語意分析，透過分析應用程式功能相似性來偵測複製。使用此工具，我們產生前 1000 個應用程式名稱的變體，並在資料集中發現超過 5,000 個搶註應用程式。此外，我們在六個主要平台上觀察到 3,509 個搶註應用程式和 9,575 個複製案例。在抽樣後，我們發現 18.7% 的搶註應用程式和 4.9% 的複製應用程式表現出惡意行為，包括網路釣魚、惡意軟體散布、假內容散布和強制廣告植入。", "author": "Yinglin Xie et.al.", "authors": "Yinglin Xie, Xinyi Hou, Yanjie Zhao, Kai Chen, Haoyu Wang", "id": "2411.07518v1", "paper_url": "http://arxiv.org/abs/2411.07518v1", "repo": "null"}}