{"2411.02851": {"publish_time": "2024-11-05", "title": "Learning to Unify Audio, Visual and Text for Audio-Enhanced Multilingual Visual Answer Localization", "paper_summary": "The goal of Multilingual Visual Answer Localization (MVAL) is to locate a\nvideo segment that answers a given multilingual question. Existing methods\neither focus solely on visual modality or integrate visual and subtitle\nmodalities. However, these methods neglect the audio modality in videos,\nconsequently leading to incomplete input information and poor performance in\nthe MVAL task. In this paper, we propose a unified Audio-Visual-Textual Span\nLocalization (AVTSL) method that incorporates audio modality to augment both\nvisual and textual representations for the MVAL task. Specifically, we\nintegrate features from three modalities and develop three predictors, each\ntailored to the unique contributions of the fused modalities: an audio-visual\npredictor, a visual predictor, and a textual predictor. Each predictor\ngenerates predictions based on its respective modality. To maintain consistency\nacross the predicted results, we introduce an Audio-Visual-Textual Consistency\nmodule. This module utilizes a Dynamic Triangular Loss (DTL) function, allowing\neach modality's predictor to dynamically learn from the others. This\ncollaborative learning ensures that the model generates consistent and\ncomprehensive answers. Extensive experiments show that our proposed method\noutperforms several state-of-the-art (SOTA) methods, which demonstrates the\neffectiveness of the audio modality.", "paper_summary_zh": "多模態視覺答案定位 (MVAL) 的目標是找到一段影片區段，來回答一個給定的多語言問題。現有的方法，要不只關注於視覺模態，要不就是整合視覺和字幕模態。然而，這些方法忽略了影片中的音訊模態，因此導致不完整的輸入資訊，以及在 MVAL 任務中的表現不佳。在本文中，我們提出一個統一的音訊-視覺-文字區間定位 (AVTSL) 方法，它結合音訊模態來擴充視覺和文字表徵，以用於 MVAL 任務。具體來說，我們整合來自三個模態的特徵，並開發三個預測器，每個預測器都針對融合模態的獨特貢獻量身打造：一個音訊-視覺預測器、一個視覺預測器和一個文字預測器。每個預測器根據其各自的模態產生預測。為了在預測結果中保持一致性，我們引入了一個音訊-視覺-文字一致性模組。此模組利用動態三角損失 (DTL) 函數，讓每個模態的預測器都能動態地從其他模態學習。這種協作學習確保模型產生一致且全面的答案。廣泛的實驗顯示，我們提出的方法優於多種最先進 (SOTA) 方法，這證明了音訊模態的有效性。", "author": "Zhibin Wen et.al.", "authors": "Zhibin Wen, Bin Li", "id": "2411.02851v1", "paper_url": "http://arxiv.org/abs/2411.02851v1", "repo": "null"}}