{"2408.12079": {"publish_time": "2024-08-22", "title": "High-Quality Data Augmentation for Low-Resource NMT: Combining a Translation Memory, a GAN Generator, and Filtering", "paper_summary": "Back translation, as a technique for extending a dataset, is widely used by\nresearchers in low-resource language translation tasks. It typically translates\nfrom the target to the source language to ensure high-quality translation\nresults. This paper proposes a novel way of utilizing a monolingual corpus on\nthe source side to assist Neural Machine Translation (NMT) in low-resource\nsettings. We realize this concept by employing a Generative Adversarial Network\n(GAN), which augments the training data for the discriminator while mitigating\nthe interference of low-quality synthetic monolingual translations with the\ngenerator. Additionally, this paper integrates Translation Memory (TM) with\nNMT, increasing the amount of data available to the generator. Moreover, we\npropose a novel procedure to filter the synthetic sentence pairs during the\naugmentation process, ensuring the high quality of the data.", "paper_summary_zh": "回譯作為擴展資料集的一種技術，廣泛應用於低資源語言翻譯任務中。它通常從目標語言翻譯成原始語言，以確保高品質的翻譯結果。本文提出了一種新穎的方法，利用原始語言端的單語語料庫來協助低資源環境中的神經機器翻譯 (NMT)。我們透過使用生成對抗網路 (GAN) 來實現這個概念，它在減輕低品質合成單語翻譯對生成器的干擾的同時，增加了判別器的訓練資料。此外，本文將翻譯記憶體 (TM) 與 NMT 整合，增加了生成器可用的資料量。此外，我們提出了一種新的程序，在擴充過程中過濾合成句子對，確保資料的高品質。", "author": "Hengjie Liu et.al.", "authors": "Hengjie Liu, Ruibo Hou, Yves Lepage", "id": "2408.12079v1", "paper_url": "http://arxiv.org/abs/2408.12079v1", "repo": "null"}}