{"2411.14633": {"publish_time": "2024-11-21", "title": "Evaluating Representational Similarity Measures from the Lens of Functional Correspondence", "paper_summary": "Neuroscience and artificial intelligence (AI) both face the challenge of\ninterpreting high-dimensional neural data, where the comparative analysis of\nsuch data is crucial for revealing shared mechanisms and differences between\nthese complex systems. Despite the widespread use of representational\ncomparisons and the abundance classes of comparison methods, a critical\nquestion remains: which metrics are most suitable for these comparisons? While\nsome studies evaluate metrics based on their ability to differentiate models of\ndifferent origins or constructions (e.g., various architectures), another\napproach is to assess how well they distinguish models that exhibit distinct\nbehaviors. To investigate this, we examine the degree of alignment between\nvarious representational similarity measures and behavioral outcomes, employing\ngroup statistics and a comprehensive suite of behavioral metrics for\ncomparison. In our evaluation of eight commonly used representational\nsimilarity metrics in the visual domain -- spanning alignment-based, Canonical\nCorrelation Analysis (CCA)-based, inner product kernel-based, and\nnearest-neighbor methods -- we found that metrics like linear Centered Kernel\nAlignment (CKA) and Procrustes distance, which emphasize the overall geometric\nstructure or shape of representations, excelled in differentiating trained from\nuntrained models and aligning with behavioral measures, whereas metrics such as\nlinear predictivity, commonly used in neuroscience, demonstrated only moderate\nalignment with behavior. These insights are crucial for selecting metrics that\nemphasize behaviorally meaningful comparisons in NeuroAI research.", "paper_summary_zh": "<paragraph>神經科學和人工智慧 (AI) 都面臨著詮釋高維度神經數據的挑戰，其中此類數據的比較分析對於揭示這些複雜系統之間的共同機制和差異至關重要。儘管表示比較已廣泛使用，且比較方法的分類豐富，但仍有一個關鍵問題：哪些指標最適合這些比較？雖然有些研究根據指標區分不同來源或結構的模型（例如，各種架構）的能力來評估指標，但另一種方法是評估它們區分表現出不同行為的模型的程度。為了研究這一點，我們檢視了各種表示相似性測量與行為結果之間的一致性程度，採用群體統計和一套全面的行為指標進行比較。在我們對視覺領域中八種常用的表示相似性指標的評估中——涵蓋基於對齊的、正則相關分析 (CCA) 基於的、內積核基於的和最近鄰方法——我們發現像線性中心核對齊 (CKA) 和 Procrustes 距離這樣的指標強調表示的整體幾何結構或形狀，在區分訓練過的模型和未訓練過的模型以及與行為測量保持一致方面表現出色，而線性預測性等指標在神經科學中通常使用，僅表現出與行為的適度一致性。這些見解對於選擇強調神經 AI 研究中行為有意義比較的指標至關重要。</paragraph>", "author": "Yiqing Bo et.al.", "authors": "Yiqing Bo, Ansh Soni, Sudhanshu Srivastava, Meenakshi Khosla", "id": "2411.14633v1", "paper_url": "http://arxiv.org/abs/2411.14633v1", "repo": "null"}}