{"2501.12728": {"publish_time": "2025-01-22", "title": "A Call for Critically Rethinking and Reforming Data Analysis in Empirical Software Engineering", "paper_summary": "Context: Empirical Software Engineering (ESE) drives innovation in SE through\nqualitative and quantitative studies. However, concerns about the correct\napplication of empirical methodologies have existed since the 2006 Dagstuhl\nseminar on SE. Objective: To analyze three decades of SE research, identify\nmistakes in statistical methods, and evaluate experts' ability to detect and\naddress these issues. Methods: We conducted a literature survey of ~27,000\nempirical studies, using LLMs to classify statistical methodologies as adequate\nor inadequate. Additionally, we selected 30 primary studies and held a workshop\nwith 33 ESE experts to assess their ability to identify and resolve statistical\nissues. Results: Significant statistical issues were found in the primary\nstudies, and experts showed limited ability to detect and correct these\nmethodological problems, raising concerns about the broader ESE community's\nproficiency in this area. Conclusions. Despite our study's eventual\nlimitations, its results shed light on recurring issues from promoting\ninformation copy-and-paste from past authors' works and the continuous\npublication of inadequate approaches that promote dubious results and\njeopardize the spread of the correct statistical strategies among researchers.\nBesides, it justifies further investigation into empirical rigor in software\nengineering to expose these recurring issues and establish a framework for\nreassessing our field's foundation of statistical methodology application.\nTherefore, this work calls for critically rethinking and reforming data\nanalysis in empirical software engineering, paving the way for our work soon.", "paper_summary_zh": "<paragraph>脈絡：經驗軟體工程（ESE）透過質化和量化研究推動軟體工程（SE）的創新。然而，自 2006 年達格斯圖爾研討會關於 SE 以來，對於經驗方法正確應用的疑慮一直存在。目標：分析三十年的 SE 研究，找出統計方法中的錯誤，並評估專家發現和解決這些問題的能力。方法：我們對約 27,000 項經驗研究進行文獻調查，使用 LLM 將統計方法分類為適當或不適當。此外，我們挑選了 30 項主要研究，並舉辦了一場工作坊，邀請 33 位 ESE 專家評估他們找出和解決統計問題的能力。結果：在主要研究中發現有顯著的統計問題，而專家展現出有限的能力來發現和修正這些方法學問題，這引發了對於更廣泛的 ESE 社群在此領域的熟練度疑慮。結論：儘管我們的研究最終有其限制，但其結果揭露了反覆出現的問題，包括從過去作者的作品中推廣資訊複製貼上，以及持續發表不適當的方法，這些方法會推廣可疑的結果，並危害正確的統計策略在研究人員之間的傳播。此外，這證明了進一步調查軟體工程中的經驗嚴謹性是合理的，以揭露這些反覆出現的問題，並建立一個架構來重新評估我們領域的統計方法應用基礎。因此，這項工作呼籲批判性地重新思考和改革經驗軟體工程中的資料分析，為我們的工作在不久的將來鋪路。</paragraph>", "author": "Matteo Esposito et.al.", "authors": "Matteo Esposito, Mikel Robredo, Murali Sridharan, Guilherme Horta Travassos, Rafael Peñaloza, Valentina Lenarduzzi", "id": "2501.12728v1", "paper_url": "http://arxiv.org/abs/2501.12728v1", "repo": "null"}}