{"2410.21560": {"publish_time": "2024-10-28", "title": "Going Beyond H&E and Oncology: How Do Histopathology Foundation Models Perform for Multi-stain IHC and Immunology?", "paper_summary": "This study evaluates the generalisation capabilities of state-of-the-art\nhistopathology foundation models on out-of-distribution multi-stain autoimmune\nImmunohistochemistry datasets. We compare 13 feature extractor models,\nincluding ImageNet-pretrained networks, and histopathology foundation models\ntrained on both public and proprietary data, on Rheumatoid Arthritis subtyping\nand Sjogren's Disease detection tasks. Using a simple Attention-Based Multiple\nInstance Learning classifier, we assess the transferability of learned\nrepresentations from cancer H&E images to autoimmune IHC images. Contrary to\nexpectations, histopathology-pretrained models did not significantly outperform\nImageNet-pretrained models. Furthermore, there was evidence of both autoimmune\nfeature misinterpretation and biased feature importance. Our findings highlight\nthe challenges in transferring knowledge from cancer to autoimmune\nhistopathology and emphasise the need for careful evaluation of AI models\nacross diverse histopathological tasks. The code to run this benchmark is\navailable at https://github.com/AmayaGS/ImmunoHistoBench.", "paper_summary_zh": "本研究評估了最先進的組織病理學基礎模型在分布外多染色自身免疫免疫組織化學數據集上的泛化能力。我們比較了 13 個特徵提取器模型，包括 ImageNet 預訓練網路，以及在公共和專有數據上訓練的組織病理學基礎模型，在類風濕性關節炎亞型和乾燥症檢測任務上。使用一個簡單的基於注意力的多實例學習分類器，我們評估了從癌症 H&E 影像到自身免疫 IHC 影像的學習表徵的可傳遞性。與預期相反，組織病理學預訓練模型並沒有顯著優於 ImageNet 預訓練模型。此外，有證據表明存在自身免疫特徵誤解和偏差特徵重要性。我們的研究結果強調了將知識從癌症轉移到自身免疫組織病理學的挑戰，並強調了跨不同組織病理學任務仔細評估 AI 模型的必要性。運行此基準測試的程式碼可在 https://github.com/AmayaGS/ImmunoHistoBench 獲得。", "author": "Amaya Gallagher-Syed et.al.", "authors": "Amaya Gallagher-Syed, Elena Pontarini, Myles J. Lewis, Michael R. Barnes, Gregory Slabaugh", "id": "2410.21560v1", "paper_url": "http://arxiv.org/abs/2410.21560v1", "repo": "https://github.com/amayags/immunohistobench"}}