{"2409.07115": {"publish_time": "2024-09-11", "title": "Attention Down-Sampling Transformer, Relative Ranking and Self-Consistency for Blind Image Quality Assessment", "paper_summary": "The no-reference image quality assessment is a challenging domain that\naddresses estimating image quality without the original reference. We introduce\nan improved mechanism to extract local and non-local information from images\nvia different transformer encoders and CNNs. The utilization of Transformer\nencoders aims to mitigate locality bias and generate a non-local representation\nby sequentially processing CNN features, which inherently capture local visual\nstructures. Establishing a stronger connection between subjective and objective\nassessments is achieved through sorting within batches of images based on\nrelative distance information. A self-consistency approach to self-supervision\nis presented, explicitly addressing the degradation of no-reference image\nquality assessment (NR-IQA) models under equivariant transformations. Our\napproach ensures model robustness by maintaining consistency between an image\nand its horizontally flipped equivalent. Through empirical evaluation of five\npopular image quality assessment datasets, the proposed model outperforms\nalternative algorithms in the context of no-reference image quality assessment\ndatasets, especially on smaller datasets. Codes are available at\n\\href{https://github.com/mas94/ADTRS}{https://github.com/mas94/ADTRS}", "paper_summary_zh": "無參考圖像品質評估是一個具有挑戰性的領域，它處理在沒有原始參考的情況下評估圖像品質。我們引入一個改良的機制，透過不同的 Transformer 編碼器和 CNN 從圖像中提取局部和非局部資訊。Transformer 編碼器的使用旨在減輕局部偏差，並透過循序處理 CNN 特徵來產生一個非局部表示，而 CNN 特徵本質上會擷取局部視覺結構。透過根據相對距離資訊在影像批次中進行排序，建立主觀和客觀評估之間更強的連結。提出了一個自一致的方法來自我監督，明確地解決了無參考圖像品質評估 (NR-IQA) 模型在等變換轉換下的退化問題。我們的做法透過維持影像及其水平翻轉等效物之間的一致性，確保模型的穩健性。透過對五個流行的影像品質評估資料集進行實證評估，所提出的模型在無參考影像品質評估資料集的背景下優於其他演算法，特別是在較小的資料集上。程式碼可在 \\href{https://github.com/mas94/ADTRS}{https://github.com/mas94/ADTRS} 取得", "author": "Mohammed Alsaafin et.al.", "authors": "Mohammed Alsaafin, Musab Alsheikh, Saeed Anwar, Muhammad Usman", "id": "2409.07115v1", "paper_url": "http://arxiv.org/abs/2409.07115v1", "repo": "https://github.com/mas94/adtrs"}}