{"2408.14016": {"publish_time": "2024-08-26", "title": "Pixel-Aligned Multi-View Generation with Depth Guided Decoder", "paper_summary": "The task of image-to-multi-view generation refers to generating novel views\nof an instance from a single image. Recent methods achieve this by extending\ntext-to-image latent diffusion models to multi-view version, which contains an\nVAE image encoder and a U-Net diffusion model. Specifically, these generation\nmethods usually fix VAE and finetune the U-Net only. However, the significant\ndownscaling of the latent vectors computed from the input images and\nindependent decoding leads to notable pixel-level misalignment across multiple\nviews. To address this, we propose a novel method for pixel-level\nimage-to-multi-view generation. Unlike prior work, we incorporate attention\nlayers across multi-view images in the VAE decoder of a latent video diffusion\nmodel. Specifically, we introduce a depth-truncated epipolar attention,\nenabling the model to focus on spatially adjacent regions while remaining\nmemory efficient. Applying depth-truncated attn is challenging during inference\nas the ground-truth depth is usually difficult to obtain and pre-trained depth\nestimation models is hard to provide accurate depth. Thus, to enhance the\ngeneralization to inaccurate depth when ground truth depth is missing, we\nperturb depth inputs during training. During inference, we employ a rapid\nmulti-view to 3D reconstruction approach, NeuS, to obtain coarse depth for the\ndepth-truncated epipolar attention. Our model enables better pixel alignment\nacross multi-view images. Moreover, we demonstrate the efficacy of our approach\nin improving downstream multi-view to 3D reconstruction tasks.", "paper_summary_zh": "影像轉多視圖生成的任務，是指從單張影像生成一個實例的新視圖。最近的方法透過將文字轉影像的潛在擴散模型延伸至多視圖版本，其中包含一個 VAE 影像編碼器和一個 U-Net 擴散模型來達成此目的。具體來說，這些生成方法通常會固定 VAE 並僅微調 U-Net。然而，從輸入影像計算出的潛在向量的顯著縮放和獨立解碼會導致多個視圖之間產生明顯的像素級失準。為了解決這個問題，我們提出了一種用於像素級影像轉多視圖生成的新方法。與先前的研究不同，我們在潛在影片擴散模型的 VAE 解碼器中加入了跨多視圖影像的注意力層。具體來說，我們引入了深度截斷的極線注意力，使模型能夠專注於空間相鄰區域，同時保持記憶體效率。在推論過程中套用深度截斷的注意力具有挑戰性，因為通常難以取得真實深度，而預先訓練的深度估計模型也難以提供準確的深度。因此，為了在沒有真實深度的情況下增強對不準確深度的泛化，我們在訓練期間擾動深度輸入。在推論過程中，我們採用一種快速的從多視圖到 3D 重建方法 NeuS 來取得用於深度截斷的極線注意力的粗略深度。我們的模型能夠讓多視圖影像之間的像素對齊更佳。此外，我們展示了我們的方法在改善下游多視圖到 3D 重建任務方面的效力。", "author": "Zhenggang Tang et.al.", "authors": "Zhenggang Tang, Peiye Zhuang, Chaoyang Wang, Aliaksandr Siarohin, Yash Kant, Alexander Schwing, Sergey Tulyakov, Hsin-Ying Lee", "id": "2408.14016v1", "paper_url": "http://arxiv.org/abs/2408.14016v1", "repo": "null"}}