{"2407.09828": {"publish_time": "2024-07-13", "title": "Enhancing Semantic Segmentation with Adaptive Focal Loss: A Novel Approach", "paper_summary": "Deep learning has achieved outstanding accuracy in medical image\nsegmentation, particularly for objects like organs or tumors with smooth\nboundaries or large sizes. Whereas, it encounters significant difficulties with\nobjects that have zigzag boundaries or are small in size, leading to a notable\ndecrease in segmentation effectiveness. In this context, using a loss function\nthat incorporates smoothness and volume information into a model's predictions\noffers a promising solution to these shortcomings. In this work, we introduce\nan Adaptive Focal Loss (A-FL) function designed to mitigate class imbalance by\ndown-weighting the loss for easy examples that results in up-weighting the loss\nfor hard examples and giving greater emphasis to challenging examples, such as\nsmall and irregularly shaped objects. The proposed A-FL involves dynamically\nadjusting a focusing parameter based on an object's surface smoothness, size\ninformation, and adjusting the class balancing parameter based on the ratio of\ntargeted area to total area in an image. We evaluated the performance of the\nA-FL using ResNet50-encoded U-Net architecture on the Picai 2022 and BraTS 2018\ndatasets. On the Picai 2022 dataset, the A-FL achieved an Intersection over\nUnion (IoU) of 0.696 and a Dice Similarity Coefficient (DSC) of 0.769,\noutperforming the regular Focal Loss (FL) by 5.5% and 5.4% respectively. It\nalso surpassed the best baseline Dice-Focal by 2.0% and 1.2%. On the BraTS 2018\ndataset, A-FL achieved an IoU of 0.883 and a DSC of 0.931. The comparative\nstudies show that the proposed A-FL function surpasses conventional methods,\nincluding Dice Loss, Focal Loss, and their hybrid variants, in IoU, DSC,\nSensitivity, and Specificity metrics. This work highlights A-FL's potential to\nimprove deep learning models for segmenting clinically significant regions in\nmedical images, leading to more precise and reliable diagnostic tools.", "paper_summary_zh": "深度學習在醫學影像分割方面取得了傑出的準確性，特別是對於具有平滑邊界或大尺寸的器官或腫瘤等物體。然而，對於具有曲折邊界或尺寸小的物體，它會遇到很大的困難，導致分割效果顯著下降。在此背景下，使用將平滑度和體積資訊納入模型預測的損失函數為這些缺點提供了一個有希望的解決方案。在這項工作中，我們引入了一個自適應焦點損失 (A-FL) 函數，旨在通過降低易於範例的損失來減輕類別失衡，從而增加困難範例的損失，並更加強調具有挑戰性的範例，例如小且形狀不規則的物體。所提出的 A-FL 涉及根據物體的表面平滑度、尺寸資訊動態調整聚焦參數，並根據圖像中目標區域與總區域的比率調整類別平衡參數。我們使用 ResNet50 編碼的 U-Net 架構在 Picai 2022 和 BraTS 2018 資料集上評估了 A-FL 的效能。在 Picai 2022 資料集上，A-FL 的交集比聯集 (IoU) 為 0.696，骰子相似性係數 (DSC) 為 0.769，分別優於常規焦點損失 (FL) 5.5% 和 5.4%。它還超越了最佳基準 Dice-Focal 2.0% 和 1.2%。在 BraTS 2018 資料集上，A-FL 的 IoU 為 0.883，DSC 為 0.931。比較研究表明，所提出的 A-FL 函數在 IoU、DSC、敏感性和特異性指標上優於傳統方法，包括 Dice 損失、焦點損失及其混合變體。這項工作突出了 A-FL 在分割醫學影像中具有臨床意義的區域以改善深度學習模型的潛力，從而產生更精確、更可靠的診斷工具。", "author": "Md Rakibul Islam et.al.", "authors": "Md Rakibul Islam, Riad Hassan, Abdullah Nazib, Kien Nguyen, Clinton Fookes, Md Zahidul Islam", "id": "2407.09828v1", "paper_url": "http://arxiv.org/abs/2407.09828v1", "repo": "null"}}