{"2406.00050": {"publish_time": "2024-05-28", "title": "An Empirical Analysis on Large Language Models in Debate Evaluation", "paper_summary": "In this study, we investigate the capabilities and inherent biases of\nadvanced large language models (LLMs) such as GPT-3.5 and GPT-4 in the context\nof debate evaluation. We discover that LLM's performance exceeds humans and\nsurpasses the performance of state-of-the-art methods fine-tuned on extensive\ndatasets in debate evaluation. We additionally explore and analyze biases\npresent in LLMs, including positional bias, lexical bias, order bias, which may\naffect their evaluative judgments. Our findings reveal a consistent bias in\nboth GPT-3.5 and GPT-4 towards the second candidate response presented,\nattributed to prompt design. We also uncover lexical biases in both GPT-3.5 and\nGPT-4, especially when label sets carry connotations such as numerical or\nsequential, highlighting the critical need for careful label verbalizer\nselection in prompt design. Additionally, our analysis indicates a tendency of\nboth models to favor the debate's concluding side as the winner, suggesting an\nend-of-discussion bias.", "paper_summary_zh": "在這項研究中，我們探討了大型語言模型 (LLM) 例如 GPT-3.5 和 GPT-4 在辯論評估中的能力和內在偏差。我們發現 LLM 的表現超越人類，並且超越了在廣泛的辯論評估資料集上進行微調的最新方法的表現。我們進一步探討和分析 LLM 中存在的偏差，包括位置偏差、詞彙偏差、順序偏差，這些偏差可能會影響他們的評估判斷。我們的研究結果揭示了 GPT-3.5 和 GPT-4 對提出的第二個候選人回應都存在一致的偏差，這歸因於提示設計。我們還在 GPT-3.5 和 GPT-4 中發現了詞彙偏差，特別是在標籤集帶有數值或順序等含義時，這突顯了在提示設計中仔細選擇標籤文字器的關鍵需求。此外，我們的分析表明這兩個模型都有傾向於支持辯論的結論方為獲勝者，這表明存在討論結束偏差。", "author": "Xinyi Liu et.al.", "authors": "Xinyi Liu, Pinxin Liu, Hangfeng He", "id": "2406.00050v2", "paper_url": "http://arxiv.org/abs/2406.00050v2", "repo": "null"}}