{"2410.13604": {"publish_time": "2024-10-17", "title": "Large Language Models as Narrative-Driven Recommenders", "paper_summary": "Narrative-driven recommenders aim to provide personalized suggestions for\nuser requests expressed in free-form text such as \"I want to watch a thriller\nwith a mind-bending story, like Shutter Island.\" Although large language models\n(LLMs) have been shown to excel in processing general natural language queries,\ntheir effectiveness for handling such recommendation requests remains\nrelatively unexplored. To close this gap, we compare the performance of 38\nopen- and closed-source LLMs of various sizes, such as LLama 3.2 and GPT-4o, in\na movie recommendation setting. For this, we utilize a gold-standard,\ncrowdworker-annotated dataset of posts from reddit's movie suggestion community\nand employ various prompting strategies, including zero-shot, identity, and\nfew-shot prompting. Our findings demonstrate the ability of LLMs to generate\ncontextually relevant movie recommendations, significantly outperforming other\nstate-of-the-art approaches, such as doc2vec. While we find that closed-source\nand large-parameterized models generally perform best, medium-sized open-source\nmodels remain competitive, being only slightly outperformed by their more\ncomputationally expensive counterparts. Furthermore, we observe no significant\ndifferences across prompting strategies for most models, underscoring the\neffectiveness of simple approaches such as zero-shot prompting for\nnarrative-driven recommendations. Overall, this work offers valuable insights\nfor recommender system researchers as well as practitioners aiming to integrate\nLLMs into real-world recommendation tools.", "paper_summary_zh": "<paragraph>以敘事為主的推薦系統旨在為「我想看一部情節曲折離奇的驚悚片，像是《隔離島》」等以自由形式文字表達的使用者要求提供個人化建議。儘管大型語言模型 (LLM) 已被證明擅長處理一般自然語言查詢，但它們在處理此類推薦要求方面的效能仍相對未經探討。為了縮小這個差距，我們在電影推薦設定中比較了 38 個不同規模的開放和閉源 LLM 的效能，例如 LLama 3.2 和 GPT-4o。為此，我們利用 Reddit 電影建議社群的貼文彙編而成的黃金標準、群眾工作者註解的資料集，並採用各種提示策略，包括零次學習、身分和少次學習提示。我們的發現證明了 LLM 產生與情境相關的電影推薦的能力，顯著優於其他最先進的方法，例如 doc2vec。雖然我們發現閉源和大型參數化模型通常表現最佳，但中型開放源碼模型仍然具有競爭力，僅略遜於它們在運算上較昂貴的對應模型。此外，我們觀察到大多數模型在提示策略上沒有顯著差異，這強調了零次學習提示等簡單方法在以敘事為主的推薦中的效能。總體而言，這項工作為推薦系統研究人員和旨在將 LLM 整合到實際推薦工具中的實務工作者提供了寶貴的見解。</paragraph>", "author": "Lukas Eberhard et.al.", "authors": "Lukas Eberhard, Thorsten Ruprechter, Denis Helic", "id": "2410.13604v1", "paper_url": "http://arxiv.org/abs/2410.13604v1", "repo": "null"}}