{"2406.07008": {"publish_time": "2024-06-11", "title": "Eye-for-an-eye: Appearance Transfer with Semantic Correspondence in Diffusion Models", "paper_summary": "As pretrained text-to-image diffusion models have become a useful tool for\nimage synthesis, people want to specify the results in various ways. In this\npaper, we introduce a method to produce results with the same structure of a\ntarget image but painted with colors from a reference image, i.e., appearance\ntransfer, especially following the semantic correspondence between the result\nand the reference. E.g., the result wing takes color from the reference wing,\nnot the reference head. Existing methods rely on the query-key similarity\nwithin self-attention layer, usually producing defective results. To this end,\nwe propose to find semantic correspondences and explicitly rearrange the\nfeatures according to the semantic correspondences. Extensive experiments show\nthe superiority of our method in various aspects: preserving the structure of\nthe target and reflecting the color from the reference according to the\nsemantic correspondences, even when the two images are not aligned.", "paper_summary_zh": "隨著預訓練文字到影像擴散模型已成為影像合成有用的工具，人們希望以各種方式指定結果。在本文中，我們介紹一種方法，以產生具有目標影像相同結構，但以參考影像的顏色繪製的結果，即外觀轉移，特別是遵循結果與參考之間的語義對應。例如，結果的翅膀取自參考翅膀的顏色，而不是參考頭部。現有方法依賴於自注意力層內的查詢鍵相似性，通常會產生有缺陷的結果。為此，我們建議找出語義對應並根據語義對應明確重新排列特徵。廣泛的實驗表明，我們的模型在各方面都具有優越性：保留目標的結構，並根據語義對應反映參考的顏色，即使兩幅影像沒有對齊。", "author": "Sooyeon Go et.al.", "authors": "Sooyeon Go, Kyungmook Choi, Minjung Shin, Youngjung Uh", "id": "2406.07008v1", "paper_url": "http://arxiv.org/abs/2406.07008v1", "repo": "null"}}