{"2411.10231": {"publish_time": "2024-11-15", "title": "A Low-Resolution Image is Worth 1x1 Words: Enabling Fine Image Super-Resolution with Transformers and TaylorShift", "paper_summary": "Transformer-based Super-Resolution (SR) models have recently advanced image\nreconstruction quality, yet challenges remain due to computational complexity\nand an over-reliance on large patch sizes, which constrain fine-grained detail\nenhancement. In this work, we propose TaylorIR to address these limitations by\nutilizing a patch size of 1x1, enabling pixel-level processing in any\ntransformer-based SR model. To address the significant computational demands\nunder the traditional self-attention mechanism, we employ the TaylorShift\nattention mechanism, a memory-efficient alternative based on Taylor series\nexpansion, achieving full token-to-token interactions with linear complexity.\nExperimental results demonstrate that our approach achieves new\nstate-of-the-art SR performance while reducing memory consumption by up to 60%\ncompared to traditional self-attention-based transformers.", "paper_summary_zh": "基於 Transformer 的超解析度 (SR) 模型最近提升了影像重建品質，但仍因運算複雜度和過度依賴大型區塊大小而面臨挑戰，這會限制細緻細節的增強。在此研究中，我們提出 TaylorIR 來解決這些限制，方法是利用 1x1 的區塊大小，讓任何基於 Transformer 的 SR 模型都能進行像素層級處理。為了滿足傳統自我注意機制下的重大運算需求，我們採用 TaylorShift 注意力機制，這是一種基於 Taylor 級數展開的省記憶體替代方案，能以線性複雜度實現完整的 token-to-token 互動。實驗結果顯示，我們的做法可達成新的超解析度技術水準，同時與傳統基於自我注意力的 Transformer 相比，記憶體消耗量最多可減少 60%。", "author": "Sanath Budakegowdanadoddi Nagaraju et.al.", "authors": "Sanath Budakegowdanadoddi Nagaraju, Brian Bernhard Moser, Tobias Christian Nauen, Stanislav Frolov, Federico Raue, Andreas Dengel", "id": "2411.10231v1", "paper_url": "http://arxiv.org/abs/2411.10231v1", "repo": "null"}}