{"2411.14925": {"publish_time": "2024-11-22", "title": "Purrfessor: A Fine-tuned Multimodal LLaVA Diet Health Chatbot", "paper_summary": "This study introduces Purrfessor, an innovative AI chatbot designed to\nprovide personalized dietary guidance through interactive, multimodal\nengagement. Leveraging the Large Language-and-Vision Assistant (LLaVA) model\nfine-tuned with food and nutrition data and a human-in-the-loop approach,\nPurrfessor integrates visual meal analysis with contextual advice to enhance\nuser experience and engagement. We conducted two studies to evaluate the\nchatbot's performance and user experience: (a) simulation assessments and human\nvalidation were conducted to examine the performance of the fine-tuned model;\n(b) a 2 (Profile: Bot vs. Pet) by 3 (Model: GPT-4 vs. LLaVA vs. Fine-tuned\nLLaVA) experiment revealed that Purrfessor significantly enhanced users'\nperceptions of care ($\\beta = 1.59$, $p = 0.04$) and interest ($\\beta = 2.26$,\n$p = 0.01$) compared to the GPT-4 bot. Additionally, user interviews\nhighlighted the importance of interaction design details, emphasizing the need\nfor responsiveness, personalization, and guidance to improve user engagement.", "paper_summary_zh": "本研究介紹了 Purrfessor，這是一種創新的 AI 聊天機器人，旨在透過互動式多模式參與提供個人化的飲食指導。Purrfessor 採用經過食物和營養資料微調的大語言和視覺助理 (LLaVA) 模型，以及人工介入的方式，將視覺化餐點分析與情境建議整合，以增強使用者體驗和參與度。我們進行了兩項研究，以評估聊天機器人的效能和使用者體驗：(a) 進行模擬評估和人工驗證，以檢驗微調模型的效能；(b) 一項 2 (個人資料：機器人與寵物) x 3 (模型：GPT-4 與 LLaVA 與微調 LLaVA) 實驗顯示，與 GPT-4 機器人相比，Purrfessor 大幅提升了使用者對於關懷 ($\\beta = 1.59$，$p = 0.04$) 和興趣 ($\\beta = 2.26$，$p = 0.01$) 的觀感。此外，使用者訪談強調了互動設計細節的重要性，強調需要回應性、個人化和指導，以提升使用者參與度。", "author": "Linqi Lu et.al.", "authors": "Linqi Lu, Yifan Deng, Chuan Tian, Sijia Yang, Dhavan Shah", "id": "2411.14925v1", "paper_url": "http://arxiv.org/abs/2411.14925v1", "repo": "null"}}