{"2410.20327": {"publish_time": "2024-10-27", "title": "R-LLaVA: Improving Med-VQA Understanding through Visual Region of Interest", "paper_summary": "Artificial intelligence has made significant strides in medical visual\nquestion answering (Med-VQA), yet prevalent studies often interpret images\nholistically, overlooking the visual regions of interest that may contain\ncrucial information, potentially aligning with a doctor's prior knowledge that\ncan be incorporated with minimal annotations (e.g., bounding boxes). To address\nthis gap, this paper introduces R-LLaVA, designed to enhance biomedical VQA\nunderstanding by integrating simple medical annotations as prior knowledge\ndirectly into the image space through CLIP. These annotated visual regions of\ninterest are then fed into the LLaVA model during training, aiming to enrich\nthe model's understanding of biomedical queries. Experimental evaluation on\nfour standard Med-VQA datasets demonstrates R-LLaVA's superiority over existing\nstate-of-the-art (SoTA) methods. Additionally, to verify the model's capability\nin visual comprehension, a novel multiple-choice medical visual understanding\ndataset is introduced, confirming the positive impact of focusing on visual\nregions of interest in advancing biomedical VQA understanding.", "paper_summary_zh": "人工智慧在醫學視覺問答 (Med-VQA) 中取得顯著進展，但普遍的研究通常整體詮釋影像，忽略可能包含關鍵資訊的視覺感興趣區域，這可能會與醫生的先備知識一致，而先備知識可以透過最少的註解（例如邊界框）納入。為了解決這個差距，本文提出 R-LLaVA，旨在透過 CLIP 將簡單的醫學註解作為先備知識直接整合到影像空間中，以增強生物醫學 VQA 理解。這些帶有註解的視覺感興趣區域會在訓練期間輸入 LLaVA 模型，目標是豐富模型對生物醫學查詢的理解。在四個標準 Med-VQA 資料集上的實驗評估證明了 R-LLaVA 優於現有的最先進 (SoTA) 方法。此外，為了驗證模型在視覺理解中的能力，本文提出了一個新穎的多選題醫學視覺理解資料集，證實了專注於視覺感興趣區域對推動生物醫學 VQA 理解的正面影響。", "author": "Xupeng Chen et.al.", "authors": "Xupeng Chen, Zhixin Lai, Kangrui Ruan, Shichu Chen, Jiaxiang Liu, Zuozhu Liu", "id": "2410.20327v1", "paper_url": "http://arxiv.org/abs/2410.20327v1", "repo": "null"}}