{"2405.17713": {"publish_time": "2024-05-28", "title": "AI Alignment with Changing and Influenceable Reward Functions", "paper_summary": "Existing AI alignment approaches assume that preferences are static, which is\nunrealistic: our preferences change, and may even be influenced by our\ninteractions with AI systems themselves. To clarify the consequences of\nincorrectly assuming static preferences, we introduce Dynamic Reward Markov\nDecision Processes (DR-MDPs), which explicitly model preference changes and the\nAI's influence on them. We show that despite its convenience, the\nstatic-preference assumption may undermine the soundness of existing alignment\ntechniques, leading them to implicitly reward AI systems for influencing user\npreferences in ways users may not truly want. We then explore potential\nsolutions. First, we offer a unifying perspective on how an agent's\noptimization horizon may partially help reduce undesirable AI influence. Then,\nwe formalize different notions of AI alignment that account for preference\nchange from the outset. Comparing the strengths and limitations of 8 such\nnotions of alignment, we find that they all either err towards causing\nundesirable AI influence, or are overly risk-averse, suggesting that a\nstraightforward solution to the problems of changing preferences may not exist.\nAs there is no avoiding grappling with changing preferences in real-world\nsettings, this makes it all the more important to handle these issues with\ncare, balancing risks and capabilities. We hope our work can provide conceptual\nclarity and constitute a first step towards AI alignment practices which\nexplicitly account for (and contend with) the changing and influenceable nature\nof human preferences.", "paper_summary_zh": "現有的 AI 對齊方法假設偏好是靜態的，這是不切實際的：我們的偏好會改變，甚至可能受到我們與 AI 系統互動的影響。為了釐清錯誤假設靜態偏好的後果，我們引入了動態獎勵馬可夫決策過程 (DR-MDP)，它明確地模擬了偏好變化和 AI 對它們的影響。我們表明，儘管其便利性，但靜態偏好假設可能會破壞現有對齊技術的健全性，導致它們隱式地獎勵 AI 系統以影響用戶偏好的方式，而用戶可能並非真正想要。然後，我們探討潛在的解決方案。首先，我們提供了一個統一的觀點，說明代理的最佳化範圍如何在一定程度上幫助減少不良的 AI 影響。然後，我們形式化了不同的 AI 對齊概念，這些概念從一開始就考慮了偏好變化。比較這 8 個對齊概念的優缺點，我們發現它們要么會導致不良的 AI 影響，要么過於迴避風險，這表明可能不存在改變偏好的問題的直接解決方案。由於在現實環境中無法避免應對偏好的改變，這使得以謹慎的方式處理這些問題變得更加重要，權衡風險和能力。我們希望我們的研究可以提供概念上的清晰度，並構成朝著 AI 對齊實務邁出的第一步，這些實務明確考慮（並應對）人類偏好的多變性和可影響性。", "author": "Micah Carroll et.al.", "authors": "Micah Carroll, Davis Foote, Anand Siththaranjan, Stuart Russell, Anca Dragan", "id": "2405.17713v1", "paper_url": "http://arxiv.org/abs/2405.17713v1", "repo": "null"}}