{"2501.01705": {"publish_time": "2025-01-03", "title": "The Essence of Contextual Understanding in Theory of Mind: A Study on Question Answering with Story Characters", "paper_summary": "Theory-of-Mind (ToM) is a fundamental psychological capability that allows\nhumans to understand and interpret the mental states of others. Humans infer\nothers' thoughts by integrating causal cues and indirect clues from broad\ncontextual information, often derived from past interactions. In other words,\nhuman ToM heavily relies on the understanding about the backgrounds and life\nstories of others. Unfortunately, this aspect is largely overlooked in existing\nbenchmarks for evaluating machines' ToM capabilities, due to their usage of\nshort narratives without global backgrounds. In this paper, we verify the\nimportance of understanding long personal backgrounds in ToM and assess the\nperformance of LLMs in such realistic evaluation scenarios. To achieve this, we\nintroduce a novel benchmark, CharToM-QA, comprising 1,035 ToM questions based\non characters from classic novels. Our human study reveals a significant\ndisparity in performance: the same group of educated participants performs\ndramatically better when they have read the novels compared to when they have\nnot. In parallel, our experiments on state-of-the-art LLMs, including the very\nrecent o1 model, show that LLMs still perform notably worse than humans,\ndespite that they have seen these stories during pre-training. This highlights\nthe limitations of current LLMs in capturing the nuanced contextual information\nrequired for ToM reasoning.", "paper_summary_zh": "心智理論 (ToM) 是一種基本的心理能力，它使人類能夠理解和詮釋他人的心理狀態。人類透過整合來自廣泛背景資訊的因果線索和間接線索來推論他人的想法，這些資訊通常來自於過去的互動。換句話說，人類的心智理論在很大程度上依賴於對他人背景和人生故事的理解。不幸的是，由於現有的機器心智理論能力評估基準使用沒有全球背景的短篇敘事，因此在很大程度上忽視了這個面向。在本文中，我們驗證了在心智理論中理解長篇個人背景的重要性，並評估大型語言模型 (LLM) 在這種逼真的評估情境中的表現。為此，我們引入了一個新的基準 CharToM-QA，它包含 1,035 個基於經典小說角色的心智理論問題。我們的人類研究揭示了顯著的表現差異：同一群受過教育的參與者在讀過小說後表現顯著優於沒有讀過小說的情況。同時，我們對包括最近的 o1 模型在內的最新大型語言模型進行的實驗表明，儘管大型語言模型在預訓練期間看過這些故事，但它們的表現仍然明顯低於人類。這突顯了當前大型語言模型在捕捉心智理論推理所需細微背景資訊方面的局限性。", "author": "Chulun Zhou et.al.", "authors": "Chulun Zhou, Qiujing Wang, Mo Yu, Xiaoqian Yue, Rui Lu, Jiangnan Li, Yifan Zhou, Shunchi Zhang, Jie Zhou, Wai Lam", "id": "2501.01705v1", "paper_url": "http://arxiv.org/abs/2501.01705v1", "repo": "null"}}