{"2411.07447": {"publish_time": "2024-11-12", "title": "The Effect of Scheduling and Preemption on the Efficiency of LLM Inference Serving", "paper_summary": "The growing usage of Large Language Models (LLMs) highlights the demands and\nchallenges in scalable LLM inference systems, affecting deployment and\ndevelopment processes. On the deployment side, there is a lack of comprehensive\nanalysis on the conditions under which a particular scheduler performs better\nor worse, with performance varying substantially across different schedulers,\nhardware, models, and workloads. Manually testing each configuration on GPUs\ncan be prohibitively expensive. On the development side, unpredictable\nperformance and unknown upper limits can lead to inconclusive trial-and-error\nprocesses, consuming resources on ideas that end up ineffective. To address\nthese challenges, we introduce INFERMAX, an analytical framework that uses\ninference cost models to compare various schedulers, including an optimal\nscheduler formulated as a constraint satisfaction problem (CSP) to establish an\nupper bound on performance. Our framework offers in-depth analysis and raises\nessential questions, challenging assumptions and exploring opportunities for\nmore efficient scheduling. Notably, our findings indicate that preempting\nrequests can reduce GPU costs by 30% compared to avoiding preemptions at all.\nWe believe our methods and insights will facilitate the cost-effective\ndeployment and development of scalable, efficient inference systems and pave\nthe way for cost-based scheduling.", "paper_summary_zh": "大型語言模型 (LLM) 使用量不斷增加，突顯了可擴充 LLM 推論系統的需求和挑戰，影響部署和開發流程。在部署方面，對於特定排程器在何種條件下執行得更好或更差，缺乏全面的分析，效能因不同的排程器、硬體、模型和工作負載而有顯著差異。手動在 GPU 上測試每個組態可能會非常昂貴。在開發方面，不可預測的效能和未知的上限可能會導致無法得出結論的試錯流程，消耗無效想法的資源。為了應對這些挑戰，我們引入了 INFERMAX，一個分析架構，使用推論成本模型來比較各種排程器，包括一個最佳排程器，該排程器制定為約束滿足問題 (CSP)，以建立效能的上限。我們的架構提供了深入的分析，並提出了重要的問題，挑戰假設並探索更有效排程的機會。值得注意的是，我們的研究結果表明，與完全避免搶先相比，搶先請求可以將 GPU 成本降低 30%。我們相信我們的技術和見解將促進可擴充、有效推論系統的經濟有效部署和開發，並為基於成本的排程鋪路。", "author": "Kyoungmin Kim et.al.", "authors": "Kyoungmin Kim, Kijae Hong, Caglar Gulcehre, Anastasia Ailamaki", "id": "2411.07447v1", "paper_url": "http://arxiv.org/abs/2411.07447v1", "repo": "null"}}