{"2412.11959": {"publish_time": "2024-12-16", "title": "Gramian Multimodal Representation Learning and Alignment", "paper_summary": "Human perception integrates multiple modalities, such as vision, hearing, and\nlanguage, into a unified understanding of the surrounding reality. While recent\nmultimodal models have achieved significant progress by aligning pairs of\nmodalities via contrastive learning, their solutions are unsuitable when\nscaling to multiple modalities. These models typically align each modality to a\ndesignated anchor without ensuring the alignment of all modalities with each\nother, leading to suboptimal performance in tasks requiring a joint\nunderstanding of multiple modalities. In this paper, we structurally rethink\nthe pairwise conventional approach to multimodal learning and we present the\nnovel Gramian Representation Alignment Measure (GRAM), which overcomes the\nabove-mentioned limitations. GRAM learns and then aligns $n$ modalities\ndirectly in the higher-dimensional space in which modality embeddings lie by\nminimizing the Gramian volume of the $k$-dimensional parallelotope spanned by\nthe modality vectors, ensuring the geometric alignment of all modalities\nsimultaneously. GRAM can replace cosine similarity in any downstream method,\nholding for 2 to $n$ modality and providing more meaningful alignment with\nrespect to previous similarity measures. The novel GRAM-based contrastive loss\nfunction enhances the alignment of multimodal models in the higher-dimensional\nembedding space, leading to new state-of-the-art performance in downstream\ntasks such as video-audio-text retrieval and audio-video classification. The\nproject page, the code, and the pretrained models are available at\nhttps://ispamm.github.io/GRAM/.", "paper_summary_zh": "人類感知整合了多種方式，例如視覺、聽覺和語言，對周圍現實進行統一理解。儘管最近的多模態模型通過對比學習對成對的方式進行對齊，取得了重大進展，但當擴展到多種方式時，它們的解決方案並不適用。這些模型通常將每個方式對齊到指定的錨點，而不確保所有方式彼此對齊，導致在需要對多種方式進行聯合理解的任務中性能不佳。在本文中，我們在結構上重新思考了多模態學習的成對傳統方法，並提出了新的 Gramian 表示對齊度量 (GRAM)，它克服了上述限制。GRAM 直接在方式嵌入所在的更高維度空間中學習並對齊 $n$ 種方式，方法是通過最小化方式向量跨越的 $k$ 維平行六面體的 Gramian 體積，從而同時確保所有方式的幾何對齊。GRAM 可以取代任何下游方法中的餘弦相似性，適用於 2 到 $n$ 種方式，並相對於先前的相似性度量提供更有意義的對齊。基於 GRAM 的新對比損失函數增強了多模態模型在更高維度嵌入空間中的對齊，從而導致了下游任務（例如視頻-音頻-文本檢索和音頻-視頻分類）中新的最先進性能。項目頁面、代碼和預訓練模型可在 https://ispamm.github.io/GRAM/ 獲得。", "author": "Giordano Cicchetti et.al.", "authors": "Giordano Cicchetti, Eleonora Grassucci, Luigi Sigillo, Danilo Comminiello", "id": "2412.11959v1", "paper_url": "http://arxiv.org/abs/2412.11959v1", "repo": "null"}}