{"2410.02724": {"publish_time": "2024-10-03", "title": "Large Language Models as Markov Chains", "paper_summary": "Large language models (LLMs) have proven to be remarkably efficient, both\nacross a wide range of natural language processing tasks and well beyond them.\nHowever, a comprehensive theoretical analysis of the origins of their\nimpressive performance remains elusive. In this paper, we approach this\nchallenging task by drawing an equivalence between generic autoregressive\nlanguage models with vocabulary of size $T$ and context window of size $K$ and\nMarkov chains defined on a finite state space of size $\\mathcal{O}(T^K)$. We\nderive several surprising findings related to the existence of a stationary\ndistribution of Markov chains that capture the inference power of LLMs, their\nspeed of convergence to it, and the influence of the temperature on the latter.\nWe then prove pre-training and in-context generalization bounds and show how\nthe drawn equivalence allows us to enrich their interpretation. Finally, we\nillustrate our theoretical guarantees with experiments on several recent LLMs\nto highlight how they capture the behavior observed in practice.", "paper_summary_zh": "大型語言模型 (LLM) 已被證明非常有效率，無論是在廣泛的自然語言處理任務中，還是遠遠超出這些任務。然而，對其令人印象深刻的效能來源進行全面的理論分析仍然難以捉摸。在本文中，我們通過將具有大小為 $T$ 的詞彙和大小為 $K$ 的上下文窗口的通用自迴歸語言模型與定義在大小為 $\\mathcal{O}(T^K)$ 的有限狀態空間上的馬可夫鏈等同起來，來應對這項艱鉅的任務。我們得出了幾個令人驚訝的發現，這些發現與捕獲 LLM 推論能力的馬可夫鏈的平穩分佈的存在、它們收斂到它的速度以及溫度對後者的影響有關。然後，我們證明了預訓練和情境內概括界限，並展示了所畫的等價關係如何讓我們豐富它們的解釋。最後，我們用最近幾個 LLM 的實驗來說明我們的理論保證，以強調它們如何捕捉到在實務中觀察到的行為。", "author": "Oussama Zekri et.al.", "authors": "Oussama Zekri, Ambroise Odonnat, Abdelhakim Benechehab, Linus Bleistein, Nicolas Boullé, Ievgen Redko", "id": "2410.02724v1", "paper_url": "http://arxiv.org/abs/2410.02724v1", "repo": "null"}}