{"2409.06579": {"publish_time": "2024-09-10", "title": "Quantifying and Enabling the Interpretability of CLIP-like Models", "paper_summary": "CLIP is one of the most popular foundational models and is heavily used for\nmany vision-language tasks. However, little is known about the inner workings\nof CLIP. To bridge this gap we propose a study to quantify the interpretability\nin CLIP like models. We conduct this study on six different CLIP models from\nOpenAI and OpenCLIP which vary by size, type of pre-training data and patch\nsize. Our approach begins with using the TEXTSPAN algorithm and in-context\nlearning to break down individual attention heads into specific properties. We\nthen evaluate how easily these heads can be interpreted using new metrics which\nmeasure property consistency within heads and property disentanglement across\nheads. Our findings reveal that larger CLIP models are generally more\ninterpretable than their smaller counterparts. To further assist users in\nunderstanding the inner workings of CLIP models, we introduce CLIP-InterpreT, a\ntool designed for interpretability analysis. CLIP-InterpreT offers five types\nof analyses: property-based nearest neighbor search, per-head topic\nsegmentation, contrastive segmentation, per-head nearest neighbors of an image,\nand per-head nearest neighbors of text.", "paper_summary_zh": "CLIP 是最流行的基础模型之一，被广泛用于许多视觉语言任务。然而，关于 CLIP 的内部工作原理知之甚少。为了弥合这一差距，我们提出了一项研究来量化 CLIP 等模型的可解释性。我们对 OpenAI 和 OpenCLIP 的六个不同的 CLIP 模型进行了这项研究，这些模型的大小、预训练数据类型和补丁大小各不相同。我们的方法首先使用 TEXTSPAN 算法和上下文学习将各个注意力头分解为特定属性。然后我们评估使用新指标解释这些头的容易程度，这些指标测量头内属性一致性和头间属性解耦。我们的研究结果表明，较大的 CLIP 模型通常比较小的模型更具可解释性。为了进一步帮助用户了解 CLIP 模型的内部工作原理，我们引入了 CLIP-InterpreT，这是一个专为可解释性分析而设计的工具。CLIP-InterpreT 提供五种类型的分析：基于属性的最近邻搜索、每个头的主题分割、对比分割、图像的每个头的最近邻和文本的每个头的最近邻。", "author": "Avinash Madasu et.al.", "authors": "Avinash Madasu, Yossi Gandelsman, Vasudev Lal, Phillip Howard", "id": "2409.06579v1", "paper_url": "http://arxiv.org/abs/2409.06579v1", "repo": "null"}}