{"2411.10063": {"publish_time": "2024-11-15", "title": "Federated Domain Generalization via Prompt Learning and Aggregation", "paper_summary": "Federated domain generalization (FedDG) aims to improve the global model\ngeneralization in unseen domains by addressing data heterogeneity under\nprivacy-preserving constraints. A common strategy in existing FedDG studies\ninvolves sharing domain-specific knowledge among clients, such as spectrum\ninformation, class prototypes, and data styles. However, this knowledge is\nextracted directly from local client samples, and sharing such sensitive\ninformation poses a potential risk of data leakage, which might not fully meet\nthe requirements of FedDG. In this paper, we introduce prompt learning to adapt\npre-trained vision-language models (VLMs) in the FedDG scenario, and leverage\nlocally learned prompts as a more secure bridge to facilitate knowledge\ntransfer among clients. Specifically, we propose a novel FedDG framework\nthrough Prompt Learning and AggregatioN (PLAN), which comprises two training\nstages to collaboratively generate local prompts and global prompts at each\nfederated round. First, each client performs both text and visual prompt\nlearning using their own data, with local prompts indirectly synchronized by\nregarding the global prompts as a common reference. Second, all domain-specific\nlocal prompts are exchanged among clients and selectively aggregated into the\nglobal prompts using lightweight attention-based aggregators. The global\nprompts are finally applied to adapt VLMs to unseen target domains. As our PLAN\nframework requires training only a limited number of prompts and lightweight\naggregators, it offers notable advantages in computational and communication\nefficiency for FedDG. Extensive experiments demonstrate the superior\ngeneralization ability of PLAN across four benchmark datasets.", "paper_summary_zh": "聯邦領域泛化 (FedDG) 旨在透過在保密約束下解決資料異質性，來改善在未見領域中的整體模型泛化。現有 FedDG 研究中常見的策略，涉及在客戶端之間分享領域特定知識，例如頻譜資訊、類原型和資料樣式。然而，這項知識直接從當地客戶端範例中擷取，而分享此類敏感資訊會造成資料外洩的潛在風險，可能無法完全滿足 FedDG 的需求。在本文中，我們引入提示學習，以在 FedDG 情境中調整預先訓練的視覺語言模型 (VLM)，並利用當地學習的提示作為更安全的橋樑，以促進客戶端之間的知識轉移。具體來說，我們透過提示學習和聚合 (PLAN) 提出一個新穎的 FedDG 架構，它包含兩個訓練階段，以在每個聯邦回合中共同產生本地提示和全域提示。首先，每個客戶端使用自己的資料執行文字和視覺提示學習，並透過將全域提示視為共通參考，間接同步本地提示。其次，所有領域特定的本地提示會在客戶端之間交換，並使用輕量級基於注意力的聚合器有選擇地聚合到全域提示中。全域提示最後應用於調整 VLM 以適應未見的目標領域。由於我們的 PLAN 架構僅需要訓練有限數量的提示和輕量級聚合器，因此在 FedDG 的運算和通訊效率方面提供了顯著的優勢。廣泛的實驗證明了 PLAN 在四個基準資料集中的卓越泛化能力。", "author": "Shuai Gong et.al.", "authors": "Shuai Gong, Chaoran Cui, Chunyun Zhang, Wenna Wang, Xiushan Nie, Lei Zhu", "id": "2411.10063v1", "paper_url": "http://arxiv.org/abs/2411.10063v1", "repo": "https://github.com/GongShuai8210/PLAN"}}