{"2410.11267": {"publish_time": "2024-10-15", "title": "FedCCRL: Federated Domain Generalization with Cross-Client Representation Learning", "paper_summary": "Domain Generalization (DG) aims to train models that can effectively\ngeneralize to unseen domains. However, in the context of Federated Learning\n(FL), where clients collaboratively train a model without directly sharing\ntheir data, most existing DG algorithms are not directly applicable to the FL\nsetting due to privacy constraints, as well as the limited data quantity and\ndomain diversity at each client. To tackle these challenges, we propose\nFedCCRL, a novel federated domain generalization method that significantly\nimproves the model's ability to generalize to unseen domains without\ncompromising privacy or incurring excessive computational and communication\ncosts. Specifically, we adapt MixStyle to the federated setting to transfer\ndomain-specific features while AugMix is employed to perturb domain-invariant\nfeatures. Furthermore, we leverage supervised contrastive loss for\nrepresentation alignment and utilize Jensen-Shannon divergence to ensure\nconsistent predictions between original and augmented samples. Extensive\nexperimental results demonstrate that FedCCRL achieves the state-of-the-art\nperformances on the PACS, OfficeHome and miniDomainNet datasets across varying\nnumbers of clients. Code is available at\nhttps://github.com/SanphouWang/FedCCRL.", "paper_summary_zh": "領域泛化 (DG) 旨在訓練模型，使其能有效泛化到未見領域。然而，在聯合學習 (FL) 的背景下，客戶端協同訓練模型而不會直接分享其資料，大多數現有的 DG 演算法並不直接適用於 FL 設定，因為有隱私限制，以及每個客戶端資料數量有限且領域多樣性不足。為了解決這些挑戰，我們提出 FedCCRL，一種新穎的聯合領域泛化方法，它大幅提升模型泛化到未見領域的能力，同時不會損害隱私或產生過高的運算和通訊成本。具體來說，我們將 MixStyle 調整到聯合設定，以傳輸特定領域的特徵，而 AugMix 則用來擾動與領域無關的特徵。此外，我們利用受監督對比損失進行表徵比對，並使用 Jensen-Shannon 散度來確保原始樣本和擴充樣本之間的預測一致性。廣泛的實驗結果證明，FedCCRL 在 PACS、OfficeHome 和 miniDomainNet 資料集上達到最先進的效能，且在不同數量的客戶端上皆是如此。程式碼可於 https://github.com/SanphouWang/FedCCRL 取得。", "author": "Xinpeng Wang et.al.", "authors": "Xinpeng Wang, Xiaoying Tang", "id": "2410.11267v1", "paper_url": "http://arxiv.org/abs/2410.11267v1", "repo": "null"}}