{"2409.11308": {"publish_time": "2024-09-17", "title": "SpMis: An Investigation of Synthetic Spoken Misinformation Detection", "paper_summary": "In recent years, speech generation technology has advanced rapidly, fueled by\ngenerative models and large-scale training techniques. While these developments\nhave enabled the production of high-quality synthetic speech, they have also\nraised concerns about the misuse of this technology, particularly for\ngenerating synthetic misinformation. Current research primarily focuses on\ndistinguishing machine-generated speech from human-produced speech, but the\nmore urgent challenge is detecting misinformation within spoken content. This\ntask requires a thorough analysis of factors such as speaker identity, topic,\nand synthesis. To address this need, we conduct an initial investigation into\nsynthetic spoken misinformation detection by introducing an open-source\ndataset, SpMis. SpMis includes speech synthesized from over 1,000 speakers\nacross five common topics, utilizing state-of-the-art text-to-speech systems.\nAlthough our results show promising detection capabilities, they also reveal\nsubstantial challenges for practical implementation, underscoring the\nimportance of ongoing research in this critical area.", "paper_summary_zh": "近年來，語音生成技術進展神速，推動力來自生成模型與大規模訓練技術。雖然這些發展已能產生高品質的合成語音，但也引發對此技術遭濫用的疑慮，特別是拿來產生合成錯誤資訊。目前的研究主要關注在區分機器產生的語音和人類產生的語音，但更迫切的挑戰是偵測口說內容中的錯誤資訊。這項任務需要徹底分析各種因素，例如說話者身分、主題和合成。為了解決這個需求，我們對合成口說錯誤資訊偵測進行初步調查，並推出一個開放原始碼資料集 SpMis。SpMis 包含來自 1,000 多位說話者、橫跨五個常見主題的合成語音，並利用最先進的文字轉語音系統。雖然我們的結果顯示有前景的偵測能力，但也揭露實際執行的重大挑戰，強調持續研究這個關鍵領域的重要性。", "author": "Peizhuo Liu et.al.", "authors": "Peizhuo Liu, Li Wang, Renqiang He, Haorui He, Lei Wang, Huadi Zheng, Jie Shi, Tong Xiao, Zhizheng Wu", "id": "2409.11308v1", "paper_url": "http://arxiv.org/abs/2409.11308v1", "repo": "null"}}