{"2407.08289": {"publish_time": "2024-07-11", "title": "Predicting Heart Failure with Attention Learning Techniques Utilizing Cardiovascular Data", "paper_summary": "Cardiovascular diseases (CVDs) encompass a group of disorders affecting the\nheart and blood vessels, including conditions such as coronary artery disease,\nheart failure, stroke, and hypertension. In cardiovascular diseases, heart\nfailure is one of the main causes of death and also long-term suffering in\npatients worldwide. Prediction is one of the risk factors that is highly\nvaluable for treatment and intervention to minimize heart failure. In this\nwork, an attention learning-based heart failure prediction approach is proposed\non EHR(electronic health record) cardiovascular data such as ejection fraction\nand serum creatinine. Moreover, different optimizers with various learning rate\napproaches are applied to fine-tune the proposed approach. Serum creatinine and\nejection fraction are the two most important features to predict the patient's\nheart failure. The computational result shows that the RMSProp optimizer with\n0.001 learning rate has a better prediction based on serum creatinine. On the\nother hand, the combination of SGD optimizer with 0.01 learning rate exhibits\noptimum performance based on ejection fraction features. Overall, the proposed\nattention learning-based approach performs very efficiently in predicting heart\nfailure compared to the existing state-of-the-art such as LSTM approach.", "paper_summary_zh": "心血管疾病 (CVD) 包含一組影響心臟和血管的疾病，包括冠狀動脈疾病、心衰竭、中風和高血壓等疾病。在心血管疾病中，心衰竭是全球患者死亡的主要原因之一，也是長期痛苦的來源。預測是對治療和干預以最大程度減少心衰竭極有價值的風險因素之一。在這項工作中，提出了一種基於注意力學習的心衰竭預測方法，該方法基於 EHR（電子健康記錄）心血管數據，例如射血分數和血清肌酐。此外，應用具有各種學習率方法的不同優化器對所提出的方法進行微調。血清肌酐和射血分數是預測患者心衰竭的兩個最重要的特徵。計算結果表明，學習率為 0.001 的 RMSProp 優化器基於血清肌酐具有更好的預測。另一方面，學習率為 0.01 的 SGD 優化器與射血分數特徵相結合，表現出最佳性能。總體而言，與 LSTM 方法等現有技術相比，所提出的基於注意力學習的方法在預測心衰竭方面表現得非常有效。", "author": "Ershadul Haque et.al.", "authors": "Ershadul Haque, Manoranjan Paul, Faranak Tohidi", "id": "2407.08289v1", "paper_url": "http://arxiv.org/abs/2407.08289v1", "repo": "null"}}