{"2408.09933": {"publish_time": "2024-08-19", "title": "SZU-AFS Antispoofing System for the ASVspoof 5 Challenge", "paper_summary": "This paper presents the SZU-AFS anti-spoofing system, designed for Track 1 of\nthe ASVspoof 5 Challenge under open conditions. The system is built with four\nstages: selecting a baseline model, exploring effective data augmentation (DA)\nmethods for fine-tuning, applying a co-enhancement strategy based on gradient\nnorm aware minimization (GAM) for secondary fine-tuning, and fusing logits\nscores from the two best-performing fine-tuned models. The system utilizes the\nWav2Vec2 front-end feature extractor and the AASIST back-end classifier as the\nbaseline model. During model fine-tuning, three distinct DA policies have been\ninvestigated: single-DA, random-DA, and cascade-DA. Moreover, the employed\nGAM-based co-enhancement strategy, designed to fine-tune the augmented model at\nboth data and optimizer levels, helps the Adam optimizer find flatter minima,\nthereby boosting model generalization. Overall, the final fusion system\nachieves a minDCF of 0.115 and an EER of 4.04% on the evaluation set.", "paper_summary_zh": "本論文提出 SZU-AFS 防欺騙系統，專為 ASVspoof 5 挑戰的軌道 1 設計，在開放條件下。該系統分為四個階段：選擇基準模型、探索用於微調的有效資料擴充 (DA) 方法、應用基於梯度範數感知最小化 (GAM) 的共增強策略進行二次微調，以及融合來自兩個效能最佳微調模型的 logit 分數。該系統利用 Wav2Vec2 前端特徵萃取器和 AASIST 後端分類器作為基準模型。在模型微調期間，已探討了三種不同的 DA 策略：單一 DA、隨機 DA 和串聯 DA。此外，所採用的基於 GAM 的共增強策略，旨在同時在資料和最佳化器層級微調擴充模型，幫助 Adam 最佳化器找到較平坦的最小值，從而提升模型概化。整體而言，最終融合系統在評估集上達到 0.115 的 minDCF 和 4.04% 的 EER。", "author": "Yuxiong Xu et.al.", "authors": "Yuxiong Xu, Jiafeng Zhong, Sengui Zheng, Zefeng Liu, Bin Li", "id": "2408.09933v1", "paper_url": "http://arxiv.org/abs/2408.09933v1", "repo": "null"}}