{"2412.12632": {"publish_time": "2024-12-17", "title": "What External Knowledge is Preferred by LLMs? Characterizing and Exploring Chain of Evidence in Imperfect Context", "paper_summary": "Incorporating external knowledge into large language models (LLMs) has\nemerged as a promising approach to mitigate outdated knowledge and\nhallucination in LLMs. However, external knowledge is often imperfect. In\naddition to useful knowledge, external knowledge is rich in irrelevant or\nmisinformation in the context that can impair the reliability of LLM responses.\nThis paper focuses on LLMs' preferred external knowledge in imperfect contexts\nwhen handling multi-hop QA. Inspired by criminal procedural law's Chain of\nEvidence (CoE), we characterize that knowledge preferred by LLMs should\nmaintain both relevance to the question and mutual support among knowledge\npieces. Accordingly, we propose an automated CoE discrimination approach and\nexplore LLMs' preferences from their effectiveness, faithfulness and\nrobustness, as well as CoE's usability in a naive Retrieval-Augmented\nGeneration (RAG) case. The evaluation on five LLMs reveals that CoE enhances\nLLMs through more accurate generation, stronger answer faithfulness, better\nrobustness against knowledge conflict, and improved performance in a popular\nRAG case.", "paper_summary_zh": "將外部知識納入大型語言模型 (LLM) 已成為減輕 LLM 中過時知識和幻覺的一種有前途的方法。然而，外部知識通常並不完美。除了有用的知識外，外部知識在語境中還包含大量不相關或錯誤的資訊，這可能會損害 LLM 回應的可靠性。本文重點探討 LLM 在處理多跳問答時，在不完美的語境中偏好的外部知識。受刑事訴訟法的證據鏈 (CoE) 啟發，我們將 LLM 偏好的知識特徵化為應同時保持與問題相關性和知識片段之間的相互支援。因此，我們提出了一種自動化 CoE 辨別方法，並從其有效性、忠實度和穩健性以及 CoE 在一個樸素的檢索增強生成 (RAG) 案例中的可用性來探討 LLM 的偏好。對五個 LLM 的評估表明，CoE 通過更準確的生成、更強的答案忠實度、更好的抗知識衝突穩健性，以及在一個流行的 RAG 案例中改進的效能來增強 LLM。", "author": "Zhiyuan Chang et.al.", "authors": "Zhiyuan Chang, Mingyang Li, Xiaojun Jia, Junjie Wang, Yuekai Huang, Qing Wang, Yihao Huang, Yang Liu", "id": "2412.12632v1", "paper_url": "http://arxiv.org/abs/2412.12632v1", "repo": "null"}}