{"2405.14591": {"publish_time": "2024-05-23", "title": "Base of RoPE Bounds Context Length", "paper_summary": "Position embedding is a core component of current Large Language Models\n(LLMs). Rotary position embedding (RoPE), a technique that encodes the position\ninformation with a rotation matrix, has been the de facto choice for position\nembedding in many LLMs, such as the Llama series. RoPE has been further\nutilized to extend long context capability, which is roughly based on adjusting\nthe \\textit{base} parameter of RoPE to mitigate out-of-distribution (OOD)\nproblems in position embedding. However, in this paper, we find that LLMs may\nobtain a superficial long-context ability based on the OOD theory. We revisit\nthe role of RoPE in LLMs and propose a novel property of long-term decay, we\nderive that the \\textit{base of RoPE bounds context length}: there is an\nabsolute lower bound for the base value to obtain certain context length\ncapability. Our work reveals the relationship between context length and RoPE\nbase both theoretically and empirically, which may shed light on future long\ncontext training.", "paper_summary_zh": "位置嵌入是當前大型語言模型 (LLM) 的核心組成部分。旋轉位置嵌入 (RoPE) 是一種使用旋轉矩陣編碼位置資訊的技術，一直是許多 LLM 中位置嵌入的實際選擇，例如 Llama 系列。RoPE 已進一步用於擴展長語境功能，這大致基於調整 RoPE 的「base」參數以減輕位置嵌入中的分布外 (OOD) 問題。然而，在本文中，我們發現 LLM 可能基於 OOD 理論獲得表面的長語境能力。我們重新審視 RoPE 在 LLM 中的角色，並提出長期衰減的新特性，我們推論出「RoPE 的 base 限制語境長度」：存在一個絕對下限的 base 值才能獲得一定的語境長度能力。我們的研究在理論和經驗上揭示了語境長度和 RoPE base 之間的關係，這可能為未來的長語境訓練提供啟發。", "author": "Xin Men et.al.", "authors": "Xin Men, Mingyu Xu, Bingning Wang, Qingyu Zhang, Hongyu Lin, Xianpei Han, Weipeng Chen", "id": "2405.14591v1", "paper_url": "http://arxiv.org/abs/2405.14591v1", "repo": "null"}}