{"2411.00878": {"publish_time": "2024-10-31", "title": "Exploring the Knowledge Mismatch Hypothesis: Hallucination Propensity in Small Models Fine-tuned on Data from Larger Models", "paper_summary": "Recently, there has been an explosion of large language models created\nthrough fine-tuning with data from larger models. These small models able to\nproduce outputs that appear qualitatively similar to significantly larger\nmodels. However, one of the key limitations that have been observed with these\nmodels is their propensity to hallucinate significantly more often than larger\nmodels. In particular, they have been observed to generate coherent outputs\nthat involve factually incorrect information and spread misinformation,\ntoxicity, and stereotypes. There are many potential causes of hallucination, of\nwhich, one hypothesis is that fine-tuning a model on data produced by a larger\nmodel leads to a knowledge mismatch which contributes to hallucination. In\nparticular, it is hypothesized that there is a mismatch between the knowledge\nthat is fed to the model to fine-tune it and the knowledge that is already\npresent in the graph. Fine-tuning the model on data that has such mismatch\ncould contribute to an increased propensity to hallucinate. We show that on an\nunseen test set, a smaller model fine-tuned on data generated from a larger\nmodel produced more wrong answers when compared to models fine-tuned on data\ncreated by the small model, which confirms the hypothesis.", "paper_summary_zh": "最近，通过使用更大模型的数据进行微调，创建了大量语言模型爆炸。这些小模型能够产生与明显更大的模型在质量上类似的输出。然而，在这些模型中观察到的一个关键限制是，它们比更大的模型更容易出现幻觉。特别是，已经观察到它们会生成涉及事实不正确的信息并传播错误信息、毒性和刻板印象的连贯输出。幻觉有很多潜在原因，其中一个假设是，在更大模型生成的数据上微调模型会导致知识不匹配，从而导致幻觉。特别是，假设模型微调所馈送的知识与图中已有的知识之间存在不匹配。在具有这种不匹配的数据上微调模型可能会导致幻觉倾向增加。我们表明，在一个看不见的测试集中，一个在从一个更大的模型生成的数据上微调的小模型，与在小模型创建的数据上微调的模型相比，产生了更多错误的答案，这证实了这一假设。", "author": "Phil Wee et.al.", "authors": "Phil Wee, Riyadh Baghdadi", "id": "2411.00878v1", "paper_url": "http://arxiv.org/abs/2411.00878v1", "repo": "null"}}