{"2409.08980": {"publish_time": "2024-09-13", "title": "Predicting Trust In Autonomous Vehicles: Modeling Young Adult Psychosocial Traits, Risk-Benefit Attitudes, And Driving Factors With Machine Learning", "paper_summary": "Low trust remains a significant barrier to Autonomous Vehicle (AV) adoption.\nTo design trustworthy AVs, we need to better understand the individual traits,\nattitudes, and experiences that impact people's trust judgements. We use\nmachine learning to understand the most important factors that contribute to\nyoung adult trust based on a comprehensive set of personal factors gathered via\nsurvey (n = 1457). Factors ranged from psychosocial and cognitive attributes to\ndriving style, experiences, and perceived AV risks and benefits. Using the\nexplainable AI technique SHAP, we found that perceptions of AV risks and\nbenefits, attitudes toward feasibility and usability, institutional trust,\nprior experience, and a person's mental model are the most important\npredictors. Surprisingly, psychosocial and many technology- and\ndriving-specific factors were not strong predictors. Results highlight the\nimportance of individual differences for designing trustworthy AVs for diverse\ngroups and lead to key implications for future design and research.", "paper_summary_zh": "低信任度仍然是自動駕駛車輛 (AV) 普及的重要障礙。\n為了設計值得信賴的自動駕駛車輛，我們需要更深入地了解影響人們信任判斷的個人特質、\n態度和經驗。我們使用機器學習來了解對年輕人信任度影響最大的因素，這些因素是根據\n透過調查收集的個人因素全面設定（n = 1457）。這些因素範圍從心理社會和認知屬性到\n駕駛風格、經驗和認知的自動駕駛車輛風險和優點。使用可解釋的 AI 技術 SHAP，我們發現\n認知自動駕駛車輛風險和優點、對可行性和可用性的態度、機構信任、先前經驗和個人的心智模式\n是最重要的預測因子。令人驚訝的是，心理社會和許多技術和駕駛特定因素並非強有力的預測因子。\n結果突顯了個人差異對於為不同群體設計值得信賴的自動駕駛車輛的重要性，並對未來的設計和研究產生了\n關鍵影響。", "author": "Robert Kaufman et.al.", "authors": "Robert Kaufman, Emi Lee, Manas Satish Bedmutha, David Kirsh, Nadir Weibel", "id": "2409.08980v1", "paper_url": "http://arxiv.org/abs/2409.08980v1", "repo": "null"}}