{"2407.14321": {"publish_time": "2024-07-19", "title": "Multimodal Misinformation Detection using Large Vision-Language Models", "paper_summary": "The increasing proliferation of misinformation and its alarming impact have\nmotivated both industry and academia to develop approaches for misinformation\ndetection and fact checking. Recent advances on large language models (LLMs)\nhave shown remarkable performance in various tasks, but whether and how LLMs\ncould help with misinformation detection remains relatively underexplored. Most\nof existing state-of-the-art approaches either do not consider evidence and\nsolely focus on claim related features or assume the evidence to be provided.\nFew approaches consider evidence retrieval as part of the misinformation\ndetection but rely on fine-tuning models. In this paper, we investigate the\npotential of LLMs for misinformation detection in a zero-shot setting. We\nincorporate an evidence retrieval component into the process as it is crucial\nto gather pertinent information from various sources to detect the veracity of\nclaims. To this end, we propose a novel re-ranking approach for multimodal\nevidence retrieval using both LLMs and large vision-language models (LVLM). The\nretrieved evidence samples (images and texts) serve as the input for an\nLVLM-based approach for multimodal fact verification (LVLM4FV). To enable a\nfair evaluation, we address the issue of incomplete ground truth for evidence\nsamples in an existing evidence retrieval dataset by annotating a more complete\nset of evidence samples for both image and text retrieval. Our experimental\nresults on two datasets demonstrate the superiority of the proposed approach in\nboth evidence retrieval and fact verification tasks and also better\ngeneralization capability across dataset compared to the supervised baseline.", "paper_summary_zh": "<paragraph>错误訊息和警報影響的擴散增加，促使產業和學術界開發錯誤訊息偵測和事實查核的方法。大型語言模型 (LLM) 的最新進展在各種任務中展現出顯著的表現，但 LLM 是否能協助錯誤訊息偵測，以及如何協助，仍相對未被充分探討。現有的最先進方法大多不考慮證據，僅專注於與聲明相關的特徵，或假設已提供證據。少數方法將證據檢索視為錯誤訊息偵測的一部分，但依賴微調模型。在本文中，我們探討 LLM 在零次學習設定中進行錯誤訊息偵測的潛力。我們將證據檢索元件納入流程中，因為從各種來源收集相關資訊對於偵測聲明的真實性至關重要。為此，我們提出了一種使用 LLM 和大型視覺語言模型 (LVLM) 的多模態證據檢索的重新排序方法。檢索到的證據範例（影像和文字）作為 LVLM 基於多模態事實驗證 (LVLM4FV) 方法的輸入。為了進行公平的評估，我們透過為影像和文字檢索標註一組更完整的證據範例，來解決現有證據檢索資料集中證據範例不完整的問題。我們在兩個資料集上的實驗結果證明了所提出的方法在證據檢索和事實驗證任務中的優異性，並且與監督式基準相比，在資料集間也具有更好的泛化能力。</paragraph>", "author": "Sahar Tahmasebi et.al.", "authors": "Sahar Tahmasebi, Eric Müller-Budack, Ralph Ewerth", "id": "2407.14321v1", "paper_url": "http://arxiv.org/abs/2407.14321v1", "repo": "null"}}