{"2501.18187": {"publish_time": "2025-01-30", "title": "In-Context Learning of Polynomial Kernel Regression in Transformers with GLU Layers", "paper_summary": "Transformer-based models have demonstrated remarkable ability in in-context\nlearning (ICL), where they can adapt to unseen tasks from a prompt with a few\nexamples, without requiring parameter updates. Recent research has provided\ninsight into how linear Transformers can perform ICL by implementing gradient\ndescent estimators. In particular, it has been shown that the optimal linear\nself-attention (LSA) mechanism can implement one step of gradient descent with\nrespect to a linear least-squares objective when trained on random linear\nregression tasks.\n  However, the theoretical understanding of ICL for nonlinear function classes\nremains limited. In this work, we address this gap by first showing that LSA is\ninherently restricted to solving linear least-squares objectives and thus, the\nsolutions in prior works cannot readily extend to nonlinear ICL tasks. To\novercome this limitation, drawing inspiration from modern architectures, we\nstudy a mechanism that combines LSA with GLU-like feed-forward layers and show\nthat this allows the model to perform one step of gradient descent on a\npolynomial kernel regression. Further, we characterize the scaling behavior of\nthe resulting Transformer model, highlighting the necessary model size to\neffectively handle quadratic ICL tasks. Our findings highlight the distinct\nroles of attention and feed-forward layers in nonlinear ICL and identify key\nchallenges when extending ICL to nonlinear function classes.", "paper_summary_zh": "基於 Transformer 的模型已在情境中學習 (ICL) 中展現出非凡的能力，它們可以在提示中根據幾個範例適應未見過的工作，而無需參數更新。最近的研究提供了線性 Transformer 如何透過實作梯度下降估計器來執行 ICL 的見解。特別是，已顯示最佳線性自注意力 (LSA) 機制可以在隨機線性回歸工作上訓練時，針對線性最小平方目標實作一步梯度下降。\n然而，對於非線性函數類別的 ICL 的理論理解仍然有限。在這項工作中，我們首先透過顯示 LSA 本質上僅限於求解線性最小平方目標，因此先前的著作中的解決方案無法輕易延伸到非線性 ICL 工作，來解決這個差距。為了克服這個限制，我們從現代架構中汲取靈感，研究一種將 LSA 與 GLU 類似的前饋層結合的機制，並顯示這允許模型在多項式核回歸上執行一步梯度下降。此外，我們描述了結果 Transformer 模型的縮放行為，強調有效處理二次 ICL 工作所需的模型大小。我們的發現突出了注意力和前饋層在非線性 ICL 中的不同角色，並在將 ICL 延伸到非線性函數類別時，識別出關鍵挑戰。", "author": "Haoyuan Sun et.al.", "authors": "Haoyuan Sun, Ali Jadbabaie, Navid Azizan", "id": "2501.18187v1", "paper_url": "http://arxiv.org/abs/2501.18187v1", "repo": "null"}}