{"2409.18957": {"publish_time": "2024-09-27", "title": "LML: Language Model Learning a Dataset for Data-Augmented Prediction", "paper_summary": "This paper introduces a new approach to using Large Language Models (LLMs)\nfor classification tasks, which are typically handled using Machine Learning\n(ML) models. Unlike ML models that rely heavily on data cleaning and feature\nengineering, this method streamlines the process using LLMs. This paper\nproposes a new concept called \"Language Model Learning (LML)\" powered by a new\nmethod called \"Data-Augmented Prediction (DAP)\". The classification is\nperformed by LLMs using a method similar to humans manually exploring and\nunderstanding the data and deciding classifications using data as a reference.\nTraining data is summarized and evaluated to determine the features that lead\nto the classification of each label the most. In the process of DAP, the system\nuses the data summary to automatically create a query, which is used to\nretrieve relevant rows from the dataset. A classification is generated by the\nLLM using data summary and relevant rows, ensuring satisfactory accuracy even\nwith complex data. Usage of data summary and similar data in DAP ensures\ncontext-aware decision-making. The proposed method uses the words \"Act as an\nExplainable Machine Learning Model\" in the prompt to enhance the\ninterpretability of the predictions by allowing users to review the logic\nbehind each prediction. In some test cases, the system scored an accuracy above\n90%, proving the effectiveness of the system and its potential to outperform\nconventional ML models in various scenarios. The code is available at\nhttps://github.com/Pro-GenAI/LML-DAP", "paper_summary_zh": "本文介紹了一種使用大型語言模型 (LLM) 的新方法，用於分類任務，而分類任務通常使用機器學習 (ML) 模型來處理。與高度依賴資料清理和特徵工程的 ML 模型不同，此方法使用 LLM 簡化了流程。本文提出了一個稱為「語言模型學習 (LML)」的新概念，由一種稱為「資料擴充預測 (DAP)」的新方法提供支援。分類是由 LLM 執行，其方法類似於人類手動探索和理解資料，並使用資料作為參考來決定分類。摘要和評估訓練資料，以確定導致每個標籤分類最多的特徵。在 DAP 的過程中，系統使用資料摘要自動建立查詢，用於從資料集中擷取相關列。LLM 使用資料摘要和相關列產生分類，即使資料很複雜，也能確保令人滿意的準確度。在 DAP 中使用資料摘要和類似資料，可確保進行與脈絡相關的決策制定。所提出的方法在提示中使用「扮演一個可解釋機器學習模型」的字句，以透過允許使用者檢閱每個預測背後的邏輯，來增強預測的可解釋性。在某些測試案例中，系統的準確度超過 90%，證明了系統的有效性，以及它在各種情況下優於傳統 ML 模型的潛力。程式碼可在 https://github.com/Pro-GenAI/LML-DAP 取得", "author": "Praneeth Vadlapati et.al.", "authors": "Praneeth Vadlapati", "id": "2409.18957v1", "paper_url": "http://arxiv.org/abs/2409.18957v1", "repo": "https://github.com/pro-genai/lml-dap"}}