{"2412.17259": {"publish_time": "2024-12-23", "title": "LegalAgentBench: Evaluating LLM Agents in Legal Domain", "paper_summary": "With the increasing intelligence and autonomy of LLM agents, their potential\napplications in the legal domain are becoming increasingly apparent. However,\nexisting general-domain benchmarks cannot fully capture the complexity and\nsubtle nuances of real-world judicial cognition and decision-making. Therefore,\nwe propose LegalAgentBench, a comprehensive benchmark specifically designed to\nevaluate LLM Agents in the Chinese legal domain. LegalAgentBench includes 17\ncorpora from real-world legal scenarios and provides 37 tools for interacting\nwith external knowledge. We designed a scalable task construction framework and\ncarefully annotated 300 tasks. These tasks span various types, including\nmulti-hop reasoning and writing, and range across different difficulty levels,\neffectively reflecting the complexity of real-world legal scenarios. Moreover,\nbeyond evaluating final success, LegalAgentBench incorporates keyword analysis\nduring intermediate processes to calculate progress rates, enabling more\nfine-grained evaluation. We evaluated eight popular LLMs, highlighting the\nstrengths, limitations, and potential areas for improvement of existing models\nand methods. LegalAgentBench sets a new benchmark for the practical application\nof LLMs in the legal domain, with its code and data available at\n\\url{https://github.com/CSHaitao/LegalAgentBench}.", "paper_summary_zh": "隨著 LLM 代理的智慧與自主性日益提升，它們在法律領域的潛在應用也變得越來越明顯。然而，現有的通用領域基準無法完全捕捉到現實世界司法認知和決策的複雜性和微妙差別。因此，我們提出 LegalAgentBench，一個專門設計用於評估 LLM 代理在中國法律領域的綜合基準。LegalAgentBench 包含來自現實世界法律場景的 17 個語料庫，並提供 37 個與外部知識互動的工具。我們設計了一個可擴充的任務建構框架，並仔細標註了 300 個任務。這些任務涵蓋各種類型，包括多跳推理和寫作，並跨越不同的難度等級，有效地反映了現實世界法律場景的複雜性。此外，除了評估最終成功之外，LegalAgentBench 還結合了中間過程中的關鍵字分析來計算進度率，從而實現更精細的評估。我們評估了八個流行的 LLM，突出了現有模型和方法的優勢、限制和潛在改進領域。LegalAgentBench 為 LLM 在法律領域的實際應用設定了一個新的基準，其程式碼和資料可在 \\url{https://github.com/CSHaitao/LegalAgentBench} 取得。", "author": "Haitao Li et.al.", "authors": "Haitao Li, Junjie Chen, Jingli Yang, Qingyao Ai, Wei Jia, Youfeng Liu, Kai Lin, Yueyue Wu, Guozhi Yuan, Yiran Hu, Wuyue Wang, Yiqun Liu, Minlie Huang", "id": "2412.17259v1", "paper_url": "http://arxiv.org/abs/2412.17259v1", "repo": "https://github.com/cshaitao/legalagentbench"}}