{"2502.02871": {"publish_time": "2025-02-05", "title": "Position: Multimodal Large Language Models Can Significantly Advance Scientific Reasoning", "paper_summary": "Scientific reasoning, the process through which humans apply logic, evidence,\nand critical thinking to explore and interpret scientific phenomena, is\nessential in advancing knowledge reasoning across diverse fields. However,\ndespite significant progress, current scientific reasoning models still\nstruggle with generalization across domains and often fall short of multimodal\nperception. Multimodal Large Language Models (MLLMs), which integrate text,\nimages, and other modalities, present an exciting opportunity to overcome these\nlimitations and enhance scientific reasoning. Therefore, this position paper\nargues that MLLMs can significantly advance scientific reasoning across\ndisciplines such as mathematics, physics, chemistry, and biology. First, we\npropose a four-stage research roadmap of scientific reasoning capabilities, and\nhighlight the current state of MLLM applications in scientific reasoning,\nnoting their ability to integrate and reason over diverse data types. Second,\nwe summarize the key challenges that remain obstacles to achieving MLLM's full\npotential. To address these challenges, we propose actionable insights and\nsuggestions for the future. Overall, our work offers a novel perspective on\nMLLM integration with scientific reasoning, providing the LLM community with a\nvaluable vision for achieving Artificial General Intelligence (AGI).", "paper_summary_zh": "科學推理，即人類運用邏輯、證據和批判性思維探索和詮釋科學現象的過程，對於推進不同領域的知識推理至關重要。然而，儘管取得了顯著進展，當前的科學推理模型在跨領域概括方面仍面臨挑戰，並且常常無法達到多模態感知。整合文本、影像和其他模態的多模態大型語言模型 (MLLM) 為克服這些限制並增強科學推理提供了令人興奮的機會。因此，本立場文件認為，MLLM 可以顯著推進數學、物理、化學和生物學等學科的科學推理。首先，我們提出了科學推理能力的四階段研究路線圖，並重點介紹了 MLLM 在科學推理中的應用現狀，並指出了它們整合和推理不同數據類型的能力。其次，我們總結了阻礙 MLLM 充分發揮其潛力的關鍵挑戰。為了應對這些挑戰，我們提出了可行的見解和建議，以供未來參考。總的來說，我們的研究為 MLLM 與科學推理的整合提供了新的觀點，為 LLM 社群提供了實現人工通用智慧 (AGI) 的寶貴願景。", "author": "Yibo Yan et.al.", "authors": "Yibo Yan, Shen Wang, Jiahao Huo, Jingheng Ye, Zhendong Chu, Xuming Hu, Philip S. Yu, Carla Gomes, Bart Selman, Qingsong Wen", "id": "2502.02871v1", "paper_url": "http://arxiv.org/abs/2502.02871v1", "repo": "null"}}