{"2502.13142": {"publish_time": "2025-02-18", "title": "Pre-training Auto-regressive Robotic Models with 4D Representations", "paper_summary": "Foundation models pre-trained on massive unlabeled datasets have\nrevolutionized natural language and computer vision, exhibiting remarkable\ngeneralization capabilities, thus highlighting the importance of pre-training.\nYet, efforts in robotics have struggled to achieve similar success, limited by\neither the need for costly robotic annotations or the lack of representations\nthat effectively model the physical world. In this paper, we introduce ARM4R,\nan Auto-regressive Robotic Model that leverages low-level 4D Representations\nlearned from human video data to yield a better pre-trained robotic model.\nSpecifically, we focus on utilizing 3D point tracking representations from\nvideos derived by lifting 2D representations into 3D space via monocular depth\nestimation across time. These 4D representations maintain a shared geometric\nstructure between the points and robot state representations up to a linear\ntransformation, enabling efficient transfer learning from human video data to\nlow-level robotic control. Our experiments show that ARM4R can transfer\nefficiently from human video data to robotics and consistently improves\nperformance on tasks across various robot environments and configurations.", "paper_summary_zh": "預先在大量未標記資料集上訓練好的基礎模型已經徹底改變了自然語言和電腦視覺，展現出非凡的概化能力，因此突顯了預先訓練的重要性。然而，機器人領域的努力一直難以取得類似的成功，受到昂貴的機器人標註需求或缺乏有效建模物理世界的表徵的限制。在本文中，我們介紹了 ARM4R，一種自迴歸機器人模型，它利用從人類影片資料中學習到的低階 4D 表徵，以產生更好的預先訓練機器人模型。具體來說，我們專注於利用從影片中獲得的 3D 點追蹤表徵，這些表徵是透過單眼深度估計跨時間將 2D 表徵提升到 3D 空間而導出的。這些 4D 表徵在點和機器人狀態表徵之間保持一個共用的幾何結構，直到一個線性轉換，這使得從人類影片資料到低階機器人控制的有效遷移學習成為可能。我們的實驗表明，ARM4R 可以有效地從人類影片資料轉移到機器人技術，並持續改善各種機器人環境和組態中的任務效能。", "author": "Dantong Niu et.al.", "authors": "Dantong Niu, Yuvan Sharma, Haoru Xue, Giscard Biamby, Junyi Zhang, Ziteng Ji, Trevor Darrell, Roei Herzig", "id": "2502.13142v1", "paper_url": "http://arxiv.org/abs/2502.13142v1", "repo": "null"}}