{"2501.07531": {"publish_time": "2025-01-13", "title": "Evaluating Agent-based Program Repair at Google", "paper_summary": "Agent-based program repair offers to automatically resolve complex bugs\nend-to-end by combining the planning, tool use, and code generation abilities\nof modern LLMs. Recent work has explored the use of agent-based repair\napproaches on the popular open-source SWE-Bench, a collection of bugs from\nhighly-rated GitHub Python projects. In addition, various agentic approaches\nsuch as SWE-Agent have been proposed to solve bugs in this benchmark. This\npaper explores the viability of using an agentic approach to address bugs in an\nenterprise context. To investigate this, we curate an evaluation set of 178\nbugs drawn from Google's issue tracking system. This dataset spans both\nhuman-reported (78) and machine-reported bugs (100).\n  To establish a repair performance baseline on this benchmark, we implement\nPasserine, an agent similar in spirit to SWE-Agent that can work within\nGoogle's development environment. We show that with 20 trajectory samples and\nGemini 1.5 Pro, Passerine can produce a patch that passes bug tests (i.e.,\nplausible) for 73% of machine-reported and 25.6% of human-reported bugs in our\nevaluation set. After manual examination, we found that 43% of machine-reported\nbugs and 17.9% of human-reported bugs have at least one patch that is\nsemantically equivalent to the ground-truth patch.\n  These results establish a baseline on an industrially relevant benchmark,\nwhich as we show, contains bugs drawn from a different distribution -- in terms\nof language diversity, size, and spread of changes, etc. -- compared to those\nin the popular SWE-Bench dataset.", "paper_summary_zh": "<paragraph>基於代理程式程式修復提供自動解決複雜錯誤的方法，\n透過結合現代大型語言模型的規劃、工具使用和程式碼生成能力，\n從頭到尾解決問題。最近的研究探索在廣受歡迎的開源 SWE-Bench 上使用基於代理程式的修復方法，\n這是從 GitHub Python 專案中收集的錯誤集合。此外，\n已經提出各種代理方法，例如 SWE-Agent，來解決此基準中的錯誤。這篇論文探討使用代理方法來解決企業環境中的錯誤的可行性。為了調查這一點，\n我們整理了一個由 Google 問題追蹤系統中提取的 178 個錯誤的評估集。此資料集涵蓋人工回報的錯誤 (78) 和機器回報的錯誤 (100)。\n為了建立此基準的修復效能基準，我們實作 Passerine，一種與 SWE-Agent 精神相似的代理程式，可以在 Google 的開發環境中工作。我們展示，使用 20 個軌跡樣本和 Gemini 1.5 Pro，Passerine 可以產生一個通過錯誤測試的修補程式 (即，看似合理的) 適用於我們評估集中 73% 的機器回報錯誤和 25.6% 的人工回報錯誤。經過手動檢查，我們發現 43% 的機器回報錯誤和 17.9% 的人工回報錯誤至少有一個修補程式在語意上等同於真實修補程式。\n這些結果在與產業相關的基準上建立了一個基準，正如我們所展示的，包含從不同分佈中提取的錯誤--就語言多樣性、大小和變更範圍等方面來說--與廣受歡迎的 SWE-Bench 資料集中的錯誤相比。</paragraph>", "author": "Pat Rondon et.al.", "authors": "Pat Rondon, Renyao Wei, José Cambronero, Jürgen Cito, Aaron Sun, Siddhant Sanyam, Michele Tufano, Satish Chandra", "id": "2501.07531v1", "paper_url": "http://arxiv.org/abs/2501.07531v1", "repo": "null"}}