{"2410.10547": {"publish_time": "2024-10-14", "title": "Hybrid Transformer for Early Alzheimer's Detection: Integration of Handwriting-Based 2D Images and 1D Signal Features", "paper_summary": "Alzheimer's Disease (AD) is a prevalent neurodegenerative condition where\nearly detection is vital. Handwriting, often affected early in AD, offers a\nnon-invasive and cost-effective way to capture subtle motor changes.\nState-of-the-art research on handwriting, mostly online, based AD detection has\npredominantly relied on manually extracted features, fed as input to shallow\nmachine learning models. Some recent works have proposed deep learning\n(DL)-based models, either 1D-CNN or 2D-CNN architectures, with performance\ncomparing favorably to handcrafted schemes. These approaches, however, overlook\nthe intrinsic relationship between the 2D spatial patterns of handwriting\nstrokes and their 1D dynamic characteristics, thus limiting their capacity to\ncapture the multimodal nature of handwriting data. Moreover, the application of\nTransformer models remains basically unexplored. To address these limitations,\nwe propose a novel approach for AD detection, consisting of a learnable\nmultimodal hybrid attention model that integrates simultaneously 2D handwriting\nimages with 1D dynamic handwriting signals. Our model leverages a gated\nmechanism to combine similarity and difference attention, blending the two\nmodalities and learning robust features by incorporating information at\ndifferent scales. Our model achieved state-of-the-art performance on the DARWIN\ndataset, with an F1-score of 90.32\\% and accuracy of 90.91\\% in Task 8 ('L'\nwriting), surpassing the previous best by 4.61% and 6.06% respectively.", "paper_summary_zh": "阿茲海默症 (AD) 是一種普遍的神經退化性疾病，早期發現至關重要。手寫字通常在 AD 早期受到影響，提供一種非侵入且具成本效益的方式來捕捉細微的動作變化。最先進的手寫字研究，大多數在線上，基於 AD 偵測主要依賴手動提取的特徵，作為淺層機器學習模型的輸入。一些最近的研究提出了基於深度學習 (DL) 的模型，包括 1D-CNN 或 2D-CNN 架構，其效能與手工製作的方案相比相當有利。然而，這些方法忽略了手寫字筆觸的 2D 空間模式與其 1D 動態特徵之間的內在關係，因此限制了其捕捉手寫字資料多模態特性的能力。此外，變形金剛模型的應用基本上仍未探索。為了解決這些限制，我們提出了一種新的 AD 偵測方法，包括一個可學習的多模態混合注意力模型，同時整合 2D 手寫字影像與 1D 動態手寫字訊號。我們的模型利用閘控機制結合相似性和差異性注意力，混合這兩種模態並透過納入不同規模的資訊來學習穩健的特徵。我們的模型在 DARWIN 資料集上達到了最先進的效能，在任務 8（「L」書寫）中 F1 分數為 90.32%，準確率為 90.91%，分別比前一個最佳結果高出 4.61% 和 6.06%。", "author": "Changqing Gong et.al.", "authors": "Changqing Gong, Huafeng Qin, Mounîm A. El-Yacoubi", "id": "2410.10547v1", "paper_url": "http://arxiv.org/abs/2410.10547v1", "repo": "null"}}