{"2408.10718": {"publish_time": "2024-08-20", "title": "CodeJudge-Eval: Can Large Language Models be Good Judges in Code Understanding?", "paper_summary": "Recent advancements in large language models (LLMs) have showcased impressive\ncode generation capabilities, primarily evaluated through language-to-code\nbenchmarks. However, these benchmarks may not fully capture a model's code\nunderstanding abilities. We introduce CodeJudge-Eval (CJ-Eval), a novel\nbenchmark designed to assess LLMs' code understanding abilities from the\nperspective of code judging rather than code generation. CJ-Eval challenges\nmodels to determine the correctness of provided code solutions, encompassing\nvarious error types and compilation issues. By leveraging a diverse set of\nproblems and a fine-grained judging system, CJ-Eval addresses the limitations\nof traditional benchmarks, including the potential memorization of solutions.\nEvaluation of 12 well-known LLMs on CJ-Eval reveals that even state-of-the-art\nmodels struggle, highlighting the benchmark's ability to probe deeper into\nmodels' code understanding abilities. Our benchmark will be available at\n\\url{https://github.com/CodeLLM-Research/CodeJudge-Eval}.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展展示了令人印象深刻的程式碼生成能力，主要透過語言到程式碼基準進行評估。然而，這些基準可能無法完全掌握模型的程式碼理解能力。我們引入了 CodeJudge-Eval (CJ-Eval)，這是一個新穎的基準，旨在從程式碼判斷而非程式碼生成的角度評估 LLM 的程式碼理解能力。CJ-Eval 挑戰模型確定所提供程式碼解決方案的正確性，涵蓋各種錯誤類型和編譯問題。透過利用各種問題和細緻的判斷系統，CJ-Eval 解决了傳統基準的限制，包括潛在的解決方案記憶。對 CJ-Eval 上的 12 個知名 LLM 進行評估顯示，即使最先進的模型也難以應付，突顯了基準深入探討模型程式碼理解能力的能力。我們的基準將在 \\url{https://github.com/CodeLLM-Research/CodeJudge-Eval} 提供。", "author": "Yuwei Zhao et.al.", "authors": "Yuwei Zhao, Ziyang Luo, Yuchen Tian, Hongzhan Lin, Weixiang Yan, Annan Li, Jing Ma", "id": "2408.10718v1", "paper_url": "http://arxiv.org/abs/2408.10718v1", "repo": "https://github.com/codellm-research/codejudge-eval"}}