{"2502.12886": {"publish_time": "2025-02-18", "title": "Are Multilingual Language Models an Off-ramp for Under-resourced Languages? Will we arrive at Digital Language Equality in Europe in 2030?", "paper_summary": "Large language models (LLMs) demonstrate unprecedented capabilities and\ndefine the state of the art for almost all natural language processing (NLP)\ntasks and also for essentially all Language Technology (LT) applications. LLMs\ncan only be trained for languages for which a sufficient amount of pre-training\ndata is available, effectively excluding many languages that are typically\ncharacterised as under-resourced. However, there is both circumstantial and\nempirical evidence that multilingual LLMs, which have been trained using data\nsets that cover multiple languages (including under-resourced ones), do exhibit\nstrong capabilities for some of these under-resourced languages. Eventually,\nthis approach may have the potential to be a technological off-ramp for those\nunder-resourced languages for which \"native\" LLMs, and LLM-based technologies,\ncannot be developed due to a lack of training data. This paper, which\nconcentrates on European languages, examines this idea, analyses the current\nsituation in terms of technology support and summarises related work. The\narticle concludes by focusing on the key open questions that need to be\nanswered for the approach to be put into practice in a systematic way.", "paper_summary_zh": "大型語言模型 (LLM) 展現前所未有的能力，並定義了幾乎所有自然語言處理 (NLP) 任務以及所有語言技術 (LT) 應用的最新技術。LLM 只能針對有足夠預訓練資料可用的語言進行訓練，實際上排除了許多通常被歸類為資源不足的語言。然而，有環境和經驗證據顯示，多語言 LLM 已使用涵蓋多種語言（包括資源不足的語言）的資料集進行訓練，確實對其中一些資源不足的語言展現出強大的能力。最終，這種方法可能具有成為那些由於缺乏訓練資料而無法開發「原生」LLM 和基於 LLM 的技術的資源不足語言的技術跳板的潛力。本文專注於歐洲語言，探討這個想法，分析技術支援方面的現狀，並總結相關工作。本文最後專注於必須回答的主要開放性問題，以便系統性地實踐這種方法。", "author": "Georg Rehm et.al.", "authors": "Georg Rehm, Annika Grützner-Zahn, Fabio Barth", "id": "2502.12886v1", "paper_url": "http://arxiv.org/abs/2502.12886v1", "repo": "null"}}