{"2410.02628": {"publish_time": "2024-10-03", "title": "Inverse Entropic Optimal Transport Solves Semi-supervised Learning via Data Likelihood Maximization", "paper_summary": "Learning conditional distributions $\\pi^*(\\cdot|x)$ is a central problem in\nmachine learning, which is typically approached via supervised methods with\npaired data $(x,y) \\sim \\pi^*$. However, acquiring paired data samples is often\nchallenging, especially in problems such as domain translation. This\nnecessitates the development of $\\textit{semi-supervised}$ models that utilize\nboth limited paired data and additional unpaired i.i.d. samples $x \\sim\n\\pi^*_x$ and $y \\sim \\pi^*_y$ from the marginal distributions. The usage of\nsuch combined data is complex and often relies on heuristic approaches. To\ntackle this issue, we propose a new learning paradigm that integrates both\npaired and unpaired data $\\textbf{seamlessly}$ through the data likelihood\nmaximization techniques. We demonstrate that our approach also connects\nintriguingly with inverse entropic optimal transport (OT). This finding allows\nus to apply recent advances in computational OT to establish a $\\textbf{light}$\nlearning algorithm to get $\\pi^*(\\cdot|x)$. Furthermore, we demonstrate through\nempirical tests that our method effectively learns conditional distributions\nusing paired and unpaired data simultaneously.", "paper_summary_zh": "學習條件分配 $\\pi^*(\\cdot|x)$ 是機器學習中的一個核心問題，通常透過監督式方法搭配成對資料 $(x,y) \\sim \\pi^*$ 來處理。然而，取得成對資料樣本通常具有挑戰性，尤其是在網域轉換等問題中。這需要開發 $\\textit{半監督式}$ 模型，利用有限的成對資料和來自邊際分配的額外未成對 i.i.d. 樣本 $x \\sim \\pi^*_x$ 和 $y \\sim \\pi^*_y$。這種組合資料的使用很複雜，而且經常依賴於啟發式方法。為了解決這個問題，我們提出一個新的學習範例，透過資料似然最大化技術將成對和未成對資料 $\\textbf{無縫}$ 整合。我們證明了我們的做法也與反熵最優傳輸 (OT) 有著有趣的關聯。這個發現讓我們得以應用計算 OT 的最新進展，建立一個 $\\textbf{輕量級}$ 的學習演算法來取得 $\\pi^*(\\cdot|x)$。此外，我們透過實證測試證明了我們的模型能有效地同時使用成對和未成對資料來學習條件分配。", "author": "Mikhail Persiianov et.al.", "authors": "Mikhail Persiianov, Arip Asadulaev, Nikita Andreev, Nikita Starodubcev, Dmitry Baranchuk, Anastasis Kratsios, Evgeny Burnaev, Alexander Korotin", "id": "2410.02628v1", "paper_url": "http://arxiv.org/abs/2410.02628v1", "repo": "null"}}