{"2406.19884": {"publish_time": "2024-06-28", "title": "Investigating the Timescales of Language Processing with EEG and Language Models", "paper_summary": "This study explores the temporal dynamics of language processing by examining\nthe alignment between word representations from a pre-trained transformer-based\nlanguage model, and EEG data. Using a Temporal Response Function (TRF) model,\nwe investigate how neural activity corresponds to model representations across\ndifferent layers, revealing insights into the interaction between artificial\nlanguage models and brain responses during language comprehension. Our analysis\nreveals patterns in TRFs from distinct layers, highlighting varying\ncontributions to lexical and compositional processing. Additionally, we used\nlinear discriminant analysis (LDA) to isolate part-of-speech (POS)\nrepresentations, offering insights into their influence on neural responses and\nthe underlying mechanisms of syntactic processing. These findings underscore\nEEG's utility for probing language processing dynamics with high temporal\nresolution. By bridging artificial language models and neural activity, this\nstudy advances our understanding of their interaction at fine timescales.", "paper_summary_zh": "本研究透過探討字詞表徵與預先訓練的轉換器語言模型之間的對齊，以及 EEG 資料，來探討語言處理的時間動態。我們使用時間反應函數 (TRF) 模型，來探討神經活動如何與不同層級的模型表徵相符，揭露人工語言模型與大腦在語言理解過程中反應之間的互動。我們的分析揭露了不同層級 TRF 的模式，突顯了其對字彙和組合處理的不同貢獻。此外，我們使用線性判別分析 (LDA) 來分離詞性 (POS) 表徵，提供對其對神經反應和句法處理基礎機制的影響的見解。這些發現強調了 EEG 在以高時間解析度探測語言處理動態方面的效用。透過連結人工語言模型和神經活動，本研究增進了我們對其在精細時間尺度上互動的理解。", "author": "Davide Turco et.al.", "authors": "Davide Turco, Conor Houghton", "id": "2406.19884v1", "paper_url": "http://arxiv.org/abs/2406.19884v1", "repo": "null"}}