{"2412.09988": {"publish_time": "2024-12-13", "title": "AI and the Future of Digital Public Squares", "paper_summary": "Two substantial technological advances have reshaped the public square in\nrecent decades: first with the advent of the internet and second with the\nrecent introduction of large language models (LLMs). LLMs offer opportunities\nfor a paradigm shift towards more decentralized, participatory online spaces\nthat can be used to facilitate deliberative dialogues at scale, but also create\nrisks of exacerbating societal schisms. Here, we explore four applications of\nLLMs to improve digital public squares: collective dialogue systems, bridging\nsystems, community moderation, and proof-of-humanity systems. Building on the\ninput from over 70 civil society experts and technologists, we argue that LLMs\nboth afford promising opportunities to shift the paradigm for conversations at\nscale and pose distinct risks for digital public squares. We lay out an agenda\nfor future research and investments in AI that will strengthen digital public\nsquares and safeguard against potential misuses of AI.", "paper_summary_zh": "近十年來，兩項重大的技術進步重塑了公共領域：首先是網際網路的出現，其次是最近引入的大型語言模型 (LLM)。LLM 為轉向更分散、更具參與性的線上空間提供了機會，可被用於促進大規模的審議對話，但也產生了加劇社會分裂的風險。在此，我們探討了 LLM 在改善數位公共領域的四種應用：集體對話系統、橋接系統、社群審核和人類證明系統。根據 70 多位公民社會專家和技術人員的意見，我們認為 LLM 既提供了轉變大規模對話典範的有希望機會，也對數位公共領域構成明確的風險。我們制定了一項未來研究和 AI 投資議程，將強化數位公共領域並防止 AI 遭到潛在的誤用。", "author": "Beth Goldberg et.al.", "authors": "Beth Goldberg, Diana Acosta-Navas, Michiel Bakker, Ian Beacock, Matt Botvinick, Prateek Buch, Renée DiResta, Nandika Donthi, Nathanael Fast, Ravi Iyer, Zaria Jalan, Andrew Konya, Grace Kwak Danciu, Hélène Landemore, Alice Marwick, Carl Miller, Aviv Ovadya, Emily Saltz, Lisa Schirch, Dalit Shalom, Divya Siddarth, Felix Sieker, Christopher Small, Jonathan Stray, Audrey Tang, Michael Henry Tessler, Amy Zhang", "id": "2412.09988v1", "paper_url": "http://arxiv.org/abs/2412.09988v1", "repo": "null"}}