{"2409.18511": {"publish_time": "2024-09-27", "title": "Do We Need Domain-Specific Embedding Models? An Empirical Investigation", "paper_summary": "Embedding models play a crucial role in representing and retrieving\ninformation across various NLP applications. Recent advancements in Large\nLanguage Models (LLMs) have further enhanced the performance of embedding\nmodels, which are trained on massive amounts of text covering almost every\ndomain. These models are often benchmarked on general-purpose datasets like\nMassive Text Embedding Benchmark (MTEB), where they demonstrate superior\nperformance. However, a critical question arises: Is the development of\ndomain-specific embedding models necessary when general-purpose models are\ntrained on vast corpora that already include specialized domain texts? In this\npaper, we empirically investigate this question, choosing the finance domain as\nan example. We introduce the Finance Massive Text Embedding Benchmark\n(FinMTEB), a counterpart to MTEB that consists of financial domain-specific\ntext datasets. We evaluate the performance of seven state-of-the-art embedding\nmodels on FinMTEB and observe a significant performance drop compared to their\nperformance on MTEB. To account for the possibility that this drop is driven by\nFinMTEB's higher complexity, we propose four measures to quantify dataset\ncomplexity and control for this factor in our analysis. Our analysis provides\ncompelling evidence that state-of-the-art embedding models struggle to capture\ndomain-specific linguistic and semantic patterns, even when trained on large\ngeneral-purpose corpora. This study sheds light on the necessity of developing\ndomain-specific embedding models in the LLM era, offering valuable insights for\nresearchers and practitioners.", "paper_summary_zh": "<paragraph>嵌入式模型在表示和擷取各種 NLP 應用程式中的資訊方面扮演著至關重要的角色。大型語言模型 (LLM) 的最新進展進一步增強了嵌入式模型的效能，這些模型經由涵蓋幾乎所有領域的大量文字訓練而成。這些模型通常會在通用資料集上進行基準測試，例如大規模文字嵌入基準 (MTEB)，它們在這些資料集上展現出優異的效能。然而，一個關鍵問題出現了：當通用模型已在包含專業領域文字的龐大語料庫上訓練時，開發特定領域的嵌入式模型是否必要？在本文中，我們以財務領域為例，對此問題進行實證研究。我們引入了財務大規模文字嵌入基準 (FinMTEB)，這是 MTEB 的對應版本，包含特定於財務領域的文字資料集。我們評估了七種最先進的嵌入式模型在 FinMTEB 上的效能，並觀察到與它們在 MTEB 上的效能相比，出現顯著的效能下降。為了說明這種下降可能是由 FinMTEB 較高的複雜度所驅動，我們提出了四項指標來量化資料集複雜度，並在我們的分析中控制此因素。我們的分析提供了令人信服的證據，證明最先進的嵌入式模型難以擷取特定領域的語言和語意模式，即使是在大型通用語料庫上訓練也是如此。這項研究闡明了在 LLM 時代開發特定領域嵌入式模型的必要性，為研究人員和實務工作者提供了寶貴的見解。</paragraph>", "author": "Yixuan Tang et.al.", "authors": "Yixuan Tang, Yi Yang", "id": "2409.18511v1", "paper_url": "http://arxiv.org/abs/2409.18511v1", "repo": "https://github.com/yixuantt/finmteb"}}