{"2406.09279": {"publish_time": "2024-06-13", "title": "Unpacking DPO and PPO: Disentangling Best Practices for Learning from Preference Feedback", "paper_summary": "Learning from preference feedback has emerged as an essential step for\nimproving the generation quality and performance of modern language models\n(LMs). Despite its widespread use, the way preference-based learning is applied\nvaries wildly, with differing data, learning algorithms, and evaluations used,\nmaking disentangling the impact of each aspect difficult. In this work, we\nidentify four core aspects of preference-based learning: preference data,\nlearning algorithm, reward model, and policy training prompts, systematically\ninvestigate the impact of these components on downstream model performance, and\nsuggest a recipe for strong learning for preference feedback. Our findings\nindicate that all aspects are important for performance, with better preference\ndata leading to the largest improvements, followed by the choice of learning\nalgorithm, the use of improved reward models, and finally the use of additional\nunlabeled prompts for policy training. Notably, PPO outperforms DPO by up to\n2.5% in math and 1.2% in general domains. High-quality preference data leads to\nimprovements of up to 8% in instruction following and truthfulness. Despite\nsignificant gains of up to 5% in mathematical evaluation when scaling up reward\nmodels, we surprisingly observe marginal improvements in other categories.\n  We publicly release the code used for training\n(https://github.com/hamishivi/EasyLM) and evaluating\n(https://github.com/allenai/open-instruct) our models, along with the models\nand datasets themselves\n(https://huggingface.co/collections/allenai/tulu-v25-suite-66676520fd578080e126f618).", "paper_summary_zh": "<paragraph>從偏好回饋中學習已成為改善現代語言模型 (LM) 的生成品質和效能的必要步驟。儘管偏好式學習廣泛使用，但其應用方式卻大相逕庭，使用不同的資料、學習演算法和評量，使得難以釐清各個面向的影響。在這項工作中，我們找出偏好式學習的四個核心面向：偏好資料、學習演算法、獎勵模型和政策訓練提示，系統性地探討這些組成部分對下游模型效能的影響，並建議偏好回饋的強式學習配方。我們的發現指出，各個面向對於效能都至關重要，其中以更好的偏好資料帶來最大的改善，其次是學習演算法的選擇、改良獎勵模型的使用，最後是額外未標記提示在政策訓練中的使用。值得注意的是，PPO 在數學上優於 DPO 達 2.5%，在一般領域中優於 DPO 達 1.2%。高品質的偏好資料在遵循說明和真實性方面帶來高達 8% 的改善。儘管在擴充獎勵模型時，數學評量獲得高達 5% 的顯著提升，但我們驚訝地觀察到其他類別的改善幅度很小。我們公開發布用於訓練 (https://github.com/hamishivi/EasyLM) 和評量 (https://github.com/allenai/open-instruct) 我們的模型的程式碼，以及模型和資料集本身 (https://huggingface.co/collections/allenai/tulu-v25-suite-66676520fd578080e126f618)。</paragraph>", "author": "Hamish Ivison et.al.", "authors": "Hamish Ivison, Yizhong Wang, Jiacheng Liu, Zeqiu Wu, Valentina Pyatkin, Nathan Lambert, Noah A. Smith, Yejin Choi, Hannaneh Hajishirzi", "id": "2406.09279v1", "paper_url": "http://arxiv.org/abs/2406.09279v1", "repo": "https://github.com/hamishivi/easylm"}}