{"2503.04724": {"publish_time": "2025-03-06", "title": "LLMVoX: Autoregressive Streaming Text-to-Speech Model for Any LLM", "paper_summary": "Recent advancements in speech-to-speech dialogue systems leverage LLMs for\nmultimodal interactions, yet they remain hindered by fine-tuning requirements,\nhigh computational overhead, and text-speech misalignment. Existing\nspeech-enabled LLMs often degrade conversational quality by modifying the LLM,\nthereby compromising its linguistic capabilities. In contrast, we propose\nLLMVoX, a lightweight 30M-parameter, LLM-agnostic, autoregressive streaming TTS\nsystem that generates high-quality speech with low latency, while fully\npreserving the capabilities of the base LLM. Our approach achieves a\nsignificantly lower Word Error Rate compared to speech-enabled LLMs, while\noperating at comparable latency and UTMOS score. By decoupling speech synthesis\nfrom LLM processing via a multi-queue token streaming system, LLMVoX supports\nseamless, infinite-length dialogues. Its plug-and-play design also facilitates\nextension to various tasks with different backbones. Furthermore, LLMVoX\ngeneralizes to new languages with only dataset adaptation, attaining a low\nCharacter Error Rate on an Arabic speech task. Additionally, we have integrated\nLLMVoX with a Vision-Language Model to create an omni-model with speech, text,\nand vision capabilities, without requiring additional multimodal training. Our\ncode base and project page is available at https://mbzuai-oryx.github.io/LLMVoX .", "paper_summary_zh": "<paragraph>近年來，語音對話系統的進步利用大型語言模型 (LLM) 進行多模態互動，但它們仍然受到微調需求、高計算開銷和文本語音錯位的阻礙。現有的支援語音的 LLM 通常會透過修改 LLM 來降低對話品質，從而損害其語言能力。相比之下，我們提出了 LLMVoX，一個輕量級的 30M 參數、與 LLM 無關的、自回歸串流 TTS 系統，它可以低延遲地產生高品質的語音，同時完全保留基礎 LLM 的能力。與支援語音的 LLM 相比，我們的方法實現了顯著更低的詞錯誤率，同時在延遲和 UTMOS 分數方面具有可比性。透過多佇列標記串流系統將語音合成與 LLM 處理分離，LLMVoX 支援無縫的、無限長度的對話。其隨插即用的設計還有助於擴展到具有不同骨幹的各種任務。此外，LLMVoX 只需透過數據集調整即可泛化到新的語言，在阿拉伯語語音任務中獲得了較低的字元錯誤率。此外，我們還將 LLMVoX 與視覺語言模型整合，以創建具有語音、文本和視覺能力的全能模型，而無需額外的多模態訓練。我們的程式碼庫和專案頁面位於 https://mbzuai-oryx.github.io/LLMVoX 。</paragraph>\n", "author": "Sambal Shikhar et.al.", "authors": "Sambal Shikhar, Mohammed Irfan Kurpath, Sahal Shaji Mullappilly, Jean Lahoud, Fahad Khan, Rao Muhammad Anwer, Salman Khan, Hisham Cholakkal", "id": "2503.04724v1", "paper_url": "http://arxiv.org/abs/2503.04724v1", "repo": "null"}}