{"2501.04799": {"publish_time": "2025-01-08", "title": "Cued Speech Generation Leveraging a Pre-trained Audiovisual Text-to-Speech Model", "paper_summary": "This paper presents a novel approach for the automatic generation of Cued\nSpeech (ACSG), a visual communication system used by people with hearing\nimpairment to better elicit the spoken language. We explore transfer learning\nstrategies by leveraging a pre-trained audiovisual autoregressive\ntext-to-speech model (AVTacotron2). This model is reprogrammed to infer Cued\nSpeech (CS) hand and lip movements from text input. Experiments are conducted\non two publicly available datasets, including one recorded specifically for\nthis study. Performance is assessed using an automatic CS recognition system.\nWith a decoding accuracy at the phonetic level reaching approximately 77%, the\nresults demonstrate the effectiveness of our approach.", "paper_summary_zh": "本文提出了一種創新的方法，用於自動產生提示式語言 (ACSG)，這是一種視覺溝通系統，由聽力障礙人士使用，以更好地引出語言。我們透過利用預先訓練的視聽自迴歸文字轉語音模型 (AVTacotron2)，來探索轉移學習策略。此模型被重新編寫，以從文字輸入中推斷提示式語言 (CS) 的手部和唇部動作。實驗是在兩個公開可用的資料集上進行，其中一個是專門為這項研究而錄製。效能是使用自動 CS 辨識系統來評估。在音標層級的解碼準確度達到約 77%，結果證明了我們方法的有效性。", "author": "Sanjana Sankar et.al.", "authors": "Sanjana Sankar, Martin Lenglet, Gerard Bailly, Denis Beautemps, Thomas Hueber", "id": "2501.04799v1", "paper_url": "http://arxiv.org/abs/2501.04799v1", "repo": "null"}}