{"2502.13923": {"publish_time": "2025-02-19", "title": "Qwen2.5-VL Technical Report", "paper_summary": "We introduce Qwen2.5-VL, the latest flagship model of Qwen vision-language\nseries, which demonstrates significant advancements in both foundational\ncapabilities and innovative functionalities. Qwen2.5-VL achieves a major leap\nforward in understanding and interacting with the world through enhanced visual\nrecognition, precise object localization, robust document parsing, and\nlong-video comprehension. A standout feature of Qwen2.5-VL is its ability to\nlocalize objects using bounding boxes or points accurately. It provides robust\nstructured data extraction from invoices, forms, and tables, as well as\ndetailed analysis of charts, diagrams, and layouts. To handle complex inputs,\nQwen2.5-VL introduces dynamic resolution processing and absolute time encoding,\nenabling it to process images of varying sizes and videos of extended durations\n(up to hours) with second-level event localization. This allows the model to\nnatively perceive spatial scales and temporal dynamics without relying on\ntraditional normalization techniques. By training a native dynamic-resolution\nVision Transformer (ViT) from scratch and incorporating Window Attention, we\nreduce computational overhead while maintaining native resolution. As a result,\nQwen2.5-VL excels not only in static image and document understanding but also\nas an interactive visual agent capable of reasoning, tool usage, and task\nexecution in real-world scenarios such as operating computers and mobile\ndevices. Qwen2.5-VL is available in three sizes, addressing diverse use cases\nfrom edge AI to high-performance computing. The flagship Qwen2.5-VL-72B model\nmatches state-of-the-art models like GPT-4o and Claude 3.5 Sonnet, particularly\nexcelling in document and diagram understanding. Additionally, Qwen2.5-VL\nmaintains robust linguistic performance, preserving the core language\ncompetencies of the Qwen2.5 LLM.", "paper_summary_zh": "<paragraph>我們推出 Qwen2.5-VL，這是 Qwen 視覺語言系列的最新旗艦機型，它在基礎能力和創新功能方面都展現出顯著的進步。Qwen2.5-VL 在理解和與世界互動方面取得重大進展，透過增強的視覺辨識、精確的物件定位、穩健的文件解析和長影片理解來實現。Qwen2.5-VL 的一個顯著特點是它能夠使用邊界框或點準確定位物件。它提供從發票、表格和表格中提取穩健的結構化資料，以及對圖表、圖解和版面的詳細分析。為了處理複雜的輸入，Qwen2.5-VL 引入了動態解析處理和絕對時間編碼，使其能夠處理不同大小的影像和長時影片（長達數小時），並具有秒級事件定位。這允許模型在不依賴傳統正規化技術的情況下，原生感知空間尺度和時間動態。透過從頭訓練原生動態解析視覺轉換器 (ViT) 並整合視窗注意力，我們在維持原生解析度的同時減少了運算開銷。因此，Qwen2.5-VL 不僅在靜態影像和文件理解方面表現出色，還能夠作為一個互動式視覺代理，在操作電腦和行動裝置等真實世界場景中進行推理、工具使用和任務執行。Qwen2.5-VL 有三種尺寸，可滿足從邊緣 AI 到高性能運算的各種使用案例。旗艦 Qwen2.5-VL-72B 機型與 GPT-4o 和 Claude 3.5 Sonnet 等最先進的機型相匹配，特別是在文件和圖解理解方面表現出色。此外，Qwen2.5-VL 維持穩健的語言效能，保留了 Qwen2.5 LLM 的核心語言能力。</paragraph>", "author": "Shuai Bai et.al.", "authors": "Shuai Bai, Keqin Chen, Xuejing Liu, Jialin Wang, Wenbin Ge, Sibo Song, Kai Dang, Peng Wang, Shijie Wang, Jun Tang, Humen Zhong, Yuanzhi Zhu, Mingkun Yang, Zhaohai Li, Jianqiang Wan, Pengfei Wang, Wei Ding, Zheren Fu, Yiheng Xu, Jiabo Ye, Xi Zhang, Tianbao Xie, Zesen Cheng, Hang Zhang, Zhibo Yang, Haiyang Xu, Junyang Lin", "id": "2502.13923v1", "paper_url": "http://arxiv.org/abs/2502.13923v1", "repo": "null"}}