{"2406.14129": {"publish_time": "2024-06-20", "title": "Towards Event-oriented Long Video Understanding", "paper_summary": "With the rapid development of video Multimodal Large Language Models (MLLMs),\nnumerous benchmarks have been proposed to assess their video understanding\ncapability. However, due to the lack of rich events in the videos, these\ndatasets may suffer from the short-cut bias that the answers can be deduced\nfrom a few frames, without the need to watch the entire video. To address this\nissue, we introduce Event-Bench, an event-oriented long video understanding\nbenchmark built on existing datasets and human annotations. Event-Bench\nincludes six event-related tasks and 2,190 test instances to comprehensively\nevaluate video event understanding ability. Additionally, we propose Video\nInstruction Merging~(VIM), a cost-effective method that enhances video MLLMs\nusing merged, event-intensive video instructions, addressing the scarcity of\nhuman-annotated, event-intensive data. Extensive experiments show that the\nbest-performing model, GPT-4o, achieves an overall accuracy of 53.33,\nsignificantly outperforming the best open-source model by 41.42%. Leveraging an\neffective instruction synthesis method and an adaptive model architecture, VIM\nsurpasses both state-of-the-art open-source models and GPT-4V on the\nEvent-Bench. All code, data, and models are publicly available at\nhttps://github.com/RUCAIBox/Event-Bench.", "paper_summary_zh": "隨著視訊多模態大型語言模型 (MLLM) 的快速發展，\n已經提出許多基準來評估它們的視訊理解能力。\n然而，由於影片中豐富事件的缺乏，這些\n資料集可能因捷徑偏誤而受影響，即答案可以從幾幀中推論出來，而無需觀看整個影片。為了解決這個\n問題，我們引入了 Event-Bench，這是一個建立在現有資料集和人工註解上的事件導向長影片理解基準。Event-Bench\n包含六個與事件相關的任務和 2,190 個測試實例，以全面\n評估影片事件理解能力。此外，我們提出了影片\n指令合併~(VIM)，這是一種使用合併的、事件密集型影片指令來增強影片 MLLM 的經濟有效方法，解決了人工註解、事件密集型資料的稀缺性。廣泛的實驗表明，\n表現最佳的模型 GPT-4o，達到了 53.33 的整體準確度，\n顯著優於最佳開源模型 41.42%。利用有效的指令合成方法和自適應模型架構，VIM\n超越了 Event-Bench 上的最新開源模型和 GPT-4V。所有程式碼、資料和模型都可以在\nhttps://github.com/RUCAIBox/Event-Bench 公開取得。", "author": "Yifan Du et.al.", "authors": "Yifan Du, Kun Zhou, Yuqi Huo, Yifan Li, Wayne Xin Zhao, Haoyu Lu, Zijia Zhao, Bingning Wang, Weipeng Chen, Ji-Rong Wen", "id": "2406.14129v1", "paper_url": "http://arxiv.org/abs/2406.14129v1", "repo": "https://github.com/rucaibox/event-bench"}}