{"2404.18831": {"publish_time": "2024-04-29", "title": "ConPro: Learning Severity Representation for Medical Images using Contrastive Learning and Preference Optimization", "paper_summary": "Understanding the severity of conditions shown in images in medical diagnosis\nis crucial, serving as a key guide for clinical assessment, treatment, as well\nas evaluating longitudinal progression. This paper proposes Con- PrO: a novel\nrepresentation learning method for severity assessment in medical images using\nContrastive learningintegrated Preference Optimization. Different from\nconventional contrastive learning methods that maximize the distance between\nclasses, ConPrO injects into the latent vector the distance preference\nknowledge between various severity classes and the normal class. We\nsystematically examine the key components of our framework to illuminate how\ncontrastive prediction tasks acquire valuable representations. We show that our\nrepresentation learning framework offers valuable severity ordering in the\nfeature space while outperforming previous state-of-the-art methods on\nclassification tasks. We achieve a 6% and 20% relative improvement compared to\na supervised and a self-supervised baseline, respectively. In addition, we\nderived discussions on severity indicators and related applications of\npreference comparison in the medical domain.", "paper_summary_zh": "了解醫療診斷影像中所呈現病情的嚴重程度，對於臨床評估、治療以及評估縱向進程至關重要，是關鍵指標。本文提出 Con- PrO：一種用於醫療影像嚴重程度評估的新穎表徵學習方法，採用對比學習整合偏好最佳化。與最大化類別間距離的傳統對比學習方法不同，ConPrO 將不同嚴重程度類別與正常類別之間的距離偏好知識注入潛在向量。我們系統性地檢驗了我們架構的關鍵組成部分，以說明對比預測任務如何獲取有價值的表徵。我們表明，我們的表徵學習架構在特徵空間中提供了有價值的嚴重程度排序，同時在分類任務上優於先前的最先進方法。與有監督和自監督基線相比，我們分別取得了 6% 和 20% 的相對進步。此外，我們針對嚴重程度指標和偏好比較在醫療領域的相關應用進行了探討。", "author": "Hong Nguyen et.al.", "authors": "Hong Nguyen, Hoang Nguyen, Melinda Chang, Hieu Pham, Shrikanth Narayanan, Michael Pazzani", "id": "2404.18831v1", "paper_url": "http://arxiv.org/abs/2404.18831v1", "repo": "https://github.com/hong7cong/conpro"}}