{"2504.04645": {"publish_time": "2025-04-06", "title": "Here Comes the Explanation: A Shapley Perspective on Multi-contrast Medical Image Segmentation", "paper_summary": "Deep learning has been successfully applied to medical image segmentation,\nenabling accurate identification of regions of interest such as organs and\nlesions. This approach works effectively across diverse datasets, including\nthose with single-image contrast, multi-contrast, and multimodal imaging data.\nTo improve human understanding of these black-box models, there is a growing\nneed for Explainable AI (XAI) techniques for model transparency and\naccountability. Previous research has primarily focused on post hoc pixel-level\nexplanations, using methods gradient-based and perturbation-based apporaches.\nThese methods rely on gradients or perturbations to explain model predictions.\nHowever, these pixel-level explanations often struggle with the complexity\ninherent in multi-contrast magnetic resonance imaging (MRI) segmentation tasks,\nand the sparsely distributed explanations have limited clinical relevance. In\nthis study, we propose using contrast-level Shapley values to explain\nstate-of-the-art models trained on standard metrics used in brain tumor\nsegmentation. Our results demonstrate that Shapley analysis provides valuable\ninsights into different models' behavior used for tumor segmentation. We\ndemonstrated a bias for U-Net towards over-weighing T1-contrast and FLAIR,\nwhile Swin-UNETR provided a cross-contrast understanding with balanced Shapley\ndistribution.", "paper_summary_zh": "<paragraph>深度學習已成功應用於醫學影像分割，能夠準確識別感興趣區域，例如器官和病灶。這種方法在各種數據集中都有效，包括具有單影像對比、多對比和多模態成像數據的數據集。為了提高人們對這些黑盒模型的理解，人們越來越需要可解釋人工智能 (XAI) 技術來提高模型的透明度和可靠性。先前的研究主要集中在事後像素級的解釋，使用基於梯度和基於擾動的方法。這些方法依賴梯度或擾動來解釋模型預測。然而，這些像素級的解釋通常難以應付多對比磁共振成像 (MRI) 分割任務中固有的複雜性，而且稀疏分佈的解釋與臨床的相關性有限。在本研究中，我們建議使用對比度級 Shapley 值來解釋使用腦腫瘤分割標準指標訓練的最先進模型。我們的結果表明，Shapley 分析提供了對用於腫瘤分割的不同模型行為的寶貴見解。我們證明了 U-Net 偏向於過度重視 T1 對比和 FLAIR，而 Swin-UNETR 提供了具有平衡 Shapley 分佈的跨對比理解。</paragraph>\n", "author": "Tianyi Ren et.al.", "authors": "Tianyi Ren, Juampablo Heras Rivera, Hitender Oswal, Yutong Pan, Agamdeep Chopra, Jacob Ruzevick, Mehmet Kurt", "id": "2504.04645v1", "paper_url": "http://arxiv.org/abs/2504.04645v1", "repo": "null"}}