{"2501.08521": {"publish_time": "2025-01-15", "title": "Mitigating Domain Shift in Federated Learning via Intra- and Inter-Domain Prototypes", "paper_summary": "Federated Learning (FL) has emerged as a decentralized machine learning\ntechnique, allowing clients to train a global model collaboratively without\nsharing private data. However, most FL studies ignore the crucial challenge of\nheterogeneous domains where each client has a distinct feature distribution,\nwhich is common in real-world scenarios. Prototype learning, which leverages\nthe mean feature vectors within the same classes, has become a prominent\nsolution for federated learning under domain skew. However, existing federated\nprototype learning methods only consider inter-domain prototypes on the server\nand overlook intra-domain characteristics. In this work, we introduce a novel\nfederated prototype learning method, namely I$^2$PFL, which incorporates\n$\\textbf{I}$ntra-domain and $\\textbf{I}$nter-domain $\\textbf{P}$rototypes, to\nmitigate domain shifts and learn a generalized global model across multiple\ndomains in federated learning. To construct intra-domain prototypes, we propose\nfeature alignment with MixUp-based augmented prototypes to capture the\ndiversity of local domains and enhance the generalization of local features.\nAdditionally, we introduce a reweighting mechanism for inter-domain prototypes\nto generate generalized prototypes to provide inter-domain knowledge and reduce\ndomain skew across multiple clients. Extensive experiments on the Digits,\nOffice-10, and PACS datasets illustrate the superior performance of our method\ncompared to other baselines.", "paper_summary_zh": "聯邦學習 (FL) 已成為一種分散式機器學習技術，允許客戶在不共用私人資料的情況下，協同訓練全球模型。然而，大多數 FL 研究忽略了異質網域的關鍵挑戰，其中每個客戶端都有不同的特徵分布，這在現實世界場景中很常見。原型學習利用相同類別中的平均特徵向量，已成為在網域偏差下進行聯邦學習的傑出解決方案。然而，現有的聯邦原型學習方法僅考慮伺服器上的網域間原型，而忽略了網域內特徵。在這項工作中，我們引入了一種新的聯邦原型學習方法，即 I$^2$PFL，它結合了網域內和網域間原型，以減輕網域轉移，並在聯邦學習中跨多個網域學習廣義的全球模型。為了建構網域內原型，我們提出使用基於 MixUp 的擴充原型的特徵比對，以擷取本地網域的多樣性，並增強本地特徵的概括性。此外，我們為網域間原型引入了一個重新加權機制，以產生廣義原型，以提供網域間知識並減少多個客戶端之間的網域偏差。在 Digits、Office-10 和 PACS 資料集上的廣泛實驗說明了我們的方法與其他基線相比具有優異的效能。", "author": "Huy Q. Le et.al.", "authors": "Huy Q. Le, Ye Lin Tun, Yu Qiao, Minh N. H. Nguyen, Keon Oh Kim, Choong Seon Hong", "id": "2501.08521v1", "paper_url": "http://arxiv.org/abs/2501.08521v1", "repo": "null"}}