{"2412.11978": {"publish_time": "2024-12-16", "title": "Speech Foundation Models and Crowdsourcing for Efficient, High-Quality Data Collection", "paper_summary": "While crowdsourcing is an established solution for facilitating and scaling\nthe collection of speech data, the involvement of non-experts necessitates\nprotocols to ensure final data quality. To reduce the costs of these essential\ncontrols, this paper investigates the use of Speech Foundation Models (SFMs) to\nautomate the validation process, examining for the first time the cost/quality\ntrade-off in data acquisition. Experiments conducted on French, German, and\nKorean data demonstrate that SFM-based validation has the potential to reduce\nreliance on human validation, resulting in an estimated cost saving of over\n40.0% without degrading final data quality. These findings open new\nopportunities for more efficient, cost-effective, and scalable speech data\nacquisition.", "paper_summary_zh": "雖然群眾外包是促進和擴展語音資料收集的既定解決方案，但非專家的參與需要有確保最終資料品質的協定。為了降低這些必要的控制成本，本文探討使用語音基礎模型 (SFM) 來自動化驗證流程，首次探討資料取得中的成本/品質權衡。對法語、德語和韓語資料進行的實驗證明，基於 SFM 的驗證有潛力減少對人工驗證的依賴，估計可節省超過 40.0% 的成本，而不會降低最終資料品質。這些發現為更有效率、更具成本效益和可擴展的語音資料取得開啟了新的契機。", "author": "Beomseok Lee et.al.", "authors": "Beomseok Lee, Marco Gaido, Ioan Calapodescu, Laurent Besacier, Matteo Negri", "id": "2412.11978v1", "paper_url": "http://arxiv.org/abs/2412.11978v1", "repo": "null"}}