{"2407.19644": {"publish_time": "2024-07-29", "title": "Realizing Unaligned Block-wise Pruning for DNN Acceleration on Mobile Devices", "paper_summary": "With the recent proliferation of on-device AI, there is an increasing need to\nrun computationally intensive DNNs directly on mobile devices. However, the\nlimited computing and memory resources of these devices necessitate effective\npruning techniques. Block-wise pruning is promising due to its low accuracy\ndrop tradeoff for speedup gains, but it requires block positions to be aligned\nwith block size, hindering optimal position selection to minimize model\naccuracy drop. Unaligned block pruning (UBP) addresses this by allowing blocks\nto be selected at arbitrary positions, yet its practical use is limited by a\ntime-consuming optimal block selection algorithm and lack of efficient\ninference kernels. In this paper, we propose a pseudo-optimal yet fast block\nselection algorithm called Block Expansion and Division (BED), which can be\nintegrated into an iterative model training process. Additionally, we introduce\nan efficient inference kernel implementation for mobile devices, enabling a\nUBP-based model to achieve similar latency to a DNN model compressed by aligned\nblock pruning. We demonstrate the superiority of our techniques on a real\nmobile phone with MobileNet and ResNet models.", "paper_summary_zh": "隨著裝置上人工智慧的快速發展，對於直接在行動裝置上執行計算密集型 DNN 的需求也日益增加。然而，這些裝置有限的運算和記憶體資源需要有效的剪枝技術。區塊剪枝由於其低準確度下降的加速收益權衡而很有前途，但它需要區塊位置與區塊大小對齊，這阻礙了最佳位置選擇以最小化模型準確度下降。未對齊區塊剪枝 (UBP) 允許在任意位置選擇區塊來解決此問題，但其實際使用受到耗時的最佳區塊選擇演算法和缺乏有效推論核心的限制。在本文中，我們提出了一種稱為區塊擴充和分割 (BED) 的偽最佳但快速的區塊選擇演算法，它可以整合到反覆模型訓練過程中。此外，我們為行動裝置引入了高效的推論核心實作，使基於 UBP 的模型能夠實現與透過對齊區塊剪枝壓縮的 DNN 模型相似的延遲。我們在搭載 MobileNet 和 ResNet 模型的真實行動電話上展示了我們技術的優越性。", "author": "Hayun Lee et.al.", "authors": "Hayun Lee, Dongkun Shin", "id": "2407.19644v1", "paper_url": "http://arxiv.org/abs/2407.19644v1", "repo": "null"}}