{"2409.10907": {"publish_time": "2024-09-17", "title": "Attention-Seeker: Dynamic Self-Attention Scoring for Unsupervised Keyphrase Extraction", "paper_summary": "This paper proposes Attention-Seeker, an unsupervised keyphrase extraction\nmethod that leverages self-attention maps from a Large Language Model to\nestimate the importance of candidate phrases. Our approach identifies specific\ncomponents - such as layers, heads, and attention vectors - where the model\npays significant attention to the key topics of the text. The attention weights\nprovided by these components are then used to score the candidate phrases.\nUnlike previous models that require manual tuning of parameters (e.g.,\nselection of heads, prompts, hyperparameters), Attention-Seeker dynamically\nadapts to the input text without any manual adjustments, enhancing its\npractical applicability. We evaluate Attention-Seeker on four publicly\navailable datasets: Inspec, SemEval2010, SemEval2017, and Krapivin. Our results\ndemonstrate that, even without parameter tuning, Attention-Seeker outperforms\nmost baseline models, achieving state-of-the-art performance on three out of\nfour datasets, particularly excelling in extracting keyphrases from long\ndocuments.", "paper_summary_zh": "本文提出了 Attention-Seeker，這是一種無監督關鍵字萃取方法，它利用大型語言模型中的自注意力圖來估計候選詞組的重要性。我們的做法找出特定組成部分（例如層、頭和注意力向量），模型在這些組成部分中會對文字的主要主題給予顯著的注意力。然後使用這些組成部分提供的注意力權重來為候選詞組評分。與需要手動調整參數（例如選擇頭、提示、超參數）的先前模型不同，Attention-Seeker 會動態調整輸入文字，而無需任何手動調整，從而增強其實用性。我們在四個公開可用的資料集上評估 Attention-Seeker：Inspec、SemEval2010、SemEval2017 和 Krapivin。我們的結果證明，即使不調整參數，Attention-Seeker 也優於大多數基線模型，在四個資料集中有三個資料集達到最先進的效能，特別是在從長文件中萃取關鍵字時表現出色。", "author": "Erwin D. López Z. et.al.", "authors": "Erwin D. López Z., Cheng Tang, Atsushi Shimada", "id": "2409.10907v1", "paper_url": "http://arxiv.org/abs/2409.10907v1", "repo": "null"}}