{"2410.02611": {"publish_time": "2024-10-03", "title": "IndicSentEval: How Effectively do Multilingual Transformer Models encode Linguistic Properties for Indic Languages?", "paper_summary": "Transformer-based models have revolutionized the field of natural language\nprocessing. To understand why they perform so well and to assess their\nreliability, several studies have focused on questions such as: Which\nlinguistic properties are encoded by these models, and to what extent? How\nrobust are these models in encoding linguistic properties when faced with\nperturbations in the input text? However, these studies have mainly focused on\nBERT and the English language. In this paper, we investigate similar questions\nregarding encoding capability and robustness for 8 linguistic properties across\n13 different perturbations in 6 Indic languages, using 9 multilingual\nTransformer models (7 universal and 2 Indic-specific). To conduct this study,\nwe introduce a novel multilingual benchmark dataset, IndicSentEval, containing\napproximately $\\sim$47K sentences. Surprisingly, our probing analysis of\nsurface, syntactic, and semantic properties reveals that while almost all\nmultilingual models demonstrate consistent encoding performance for English,\nthey show mixed results for Indic languages. As expected, Indic-specific\nmultilingual models capture linguistic properties in Indic languages better\nthan universal models. Intriguingly, universal models broadly exhibit better\nrobustness compared to Indic-specific models, particularly under perturbations\nsuch as dropping both nouns and verbs, dropping only verbs, or keeping only\nnouns. Overall, this study provides valuable insights into probing and\nperturbation-specific strengths and weaknesses of popular multilingual\nTransformer-based models for different Indic languages. We make our code and\ndataset publicly available [https://tinyurl.com/IndicSentEval}].", "paper_summary_zh": "<paragraph>基於 Transformer 的模型已經徹底改變了自然語言處理領域。為了了解它們為何表現如此出色，並評估它們的可靠性，多項研究專注於以下問題：這些模型編碼了哪些語言特性，編碼程度如何？這些模型在面對輸入文字中的擾動時，編碼語言特性的穩健性如何？然而，這些研究主要集中於 BERT 和英文。在本文中，我們研究了 6 種印度語言中 13 種不同擾動的 8 種語言特性的編碼能力和穩健性，並使用了 9 種多語言 Transformer 模型（7 種通用模型和 2 種印度特定模型）。為了進行這項研究，我們引入了新的多語言基準數據集 IndicSentEval，其中包含大約 47K 個句子。令人驚訝的是，我們對表面、語法和語義特性的探測分析顯示，雖然幾乎所有多語言模型都展現出一致的英文編碼效能，但它們在印度語言方面卻呈現出好壞參半的結果。正如預期，印度特定多語言模型比通用模型更能捕捉印度語言中的語言特性。有趣的是，與印度特定模型相比，通用模型普遍表現出更好的穩健性，特別是在丟棄名詞和動詞、僅丟棄動詞或僅保留名詞等擾動下。總體而言，這項研究提供了有價值的見解，用於探測和擾動特定優勢和劣勢，以了解不同印度語言的多語言基於 Transformer 的熱門模型。我們公開了我們的程式碼和數據集 [https://tinyurl.com/IndicSentEval}].</paragraph>", "author": "Akhilesh Aravapalli et.al.", "authors": "Akhilesh Aravapalli, Mounika Marreddy, Subba Reddy Oota, Radhika Mamidi, Manish Gupta", "id": "2410.02611v1", "paper_url": "http://arxiv.org/abs/2410.02611v1", "repo": "null"}}