{"2408.12456": {"publish_time": "2024-08-22", "title": "Enhancing Multi-hop Reasoning through Knowledge Erasure in Large Language Model Editing", "paper_summary": "Large language models (LLMs) face challenges with internal knowledge\ninaccuracies and outdated information. Knowledge editing has emerged as a\npivotal approach to mitigate these issues. Although current knowledge editing\ntechniques exhibit promising performance in single-hop reasoning tasks, they\nshow limitations when applied to multi-hop reasoning. Drawing on cognitive\nneuroscience and the operational mechanisms of LLMs, we hypothesize that the\nresidual single-hop knowledge after editing causes edited models to revert to\ntheir original answers when processing multi-hop questions, thereby undermining\ntheir performance in multihop reasoning tasks. To validate this hypothesis, we\nconduct a series of experiments that empirically confirm our assumptions.\nBuilding on the validated hypothesis, we propose a novel knowledge editing\nmethod that incorporates a Knowledge Erasure mechanism for Large language model\nEditing (KELE). Specifically, we design an erasure function for residual\nknowledge and an injection function for new knowledge. Through joint\noptimization, we derive the optimal recall vector, which is subsequently\nutilized within a rank-one editing framework to update the parameters of\ntargeted model layers. Extensive experiments on GPT-J and GPT-2 XL demonstrate\nthat KELE substantially enhances the multi-hop reasoning capability of edited\nLLMs.", "paper_summary_zh": "大型語言模型 (LLM) 面臨著內部知識不準確和資訊過時的問題。知識編輯已成為緩解這些問題的關鍵方法。儘管目前的知識編輯技術在單跳推理任務中表現出良好的效能，但在應用於多跳推理時卻顯示出局限性。根據認知神經科學和 LLM 的運作機制，我們假設編輯後的殘餘單跳知識會導致編輯後的模型在處理多跳問題時恢復到它們的原始答案，從而損害它們在多跳推理任務中的效能。為了驗證這個假設，我們進行了一系列實驗，實證地確認了我們的假設。建立在經過驗證的假設之上，我們提出了一種新的知識編輯方法，其中包含了大型語言模型編輯的知識刪除機制 (KELE)。具體來說，我們設計了一個用於殘餘知識的刪除函數和一個用於新知識的注入函數。透過聯合最佳化，我們推導出最佳召回向量，隨後在秩一編輯架構中使用它來更新目標模型層的參數。在 GPT-J 和 GPT-2 XL 上進行的廣泛實驗表明，KELE 大大增強了已編輯 LLM 的多跳推理能力。", "author": "Mengqi Zhang et.al.", "authors": "Mengqi Zhang, Bowen Fang, Qiang Liu, Pengjie Ren, Shu Wu, Zhumin Chen, Liang Wang", "id": "2408.12456v1", "paper_url": "http://arxiv.org/abs/2408.12456v1", "repo": "null"}}