{"2410.23180": {"publish_time": "2024-10-30", "title": "ReasoningRec: Bridging Personalized Recommendations and Human-Interpretable Explanations through LLM Reasoning", "paper_summary": "This paper presents ReasoningRec, a reasoning-based recommendation framework\nthat leverages Large Language Models (LLMs) to bridge the gap between\nrecommendations and human-interpretable explanations. In contrast to\nconventional recommendation systems that rely on implicit user-item\ninteractions, ReasoningRec employs LLMs to model users and items, focusing on\npreferences, aversions, and explanatory reasoning. The framework utilizes a\nlarger LLM to generate synthetic explanations for user preferences,\nsubsequently used to fine-tune a smaller LLM for enhanced recommendation\naccuracy and human-interpretable explanation. Our experimental study\ninvestigates the impact of reasoning and contextual information on personalized\nrecommendations, revealing that the quality of contextual and personalized data\nsignificantly influences the LLM's capacity to generate plausible explanations.\nEmpirical evaluations demonstrate that ReasoningRec surpasses state-of-the-art\nmethods by up to 12.5\\% in recommendation prediction while concurrently\nproviding human-intelligible explanations. The code is available here:\nhttps://github.com/millenniumbismay/reasoningrec.", "paper_summary_zh": "本文提出了 ReasoningRec，這是一個基於推理的推薦架構，它利用大型語言模型 (LLM) 來彌合建議和人類可解釋的說明之間的差距。與依賴於隱式使用者項目互動的傳統推薦系統相反，ReasoningRec 使用 LLM 對使用者和項目進行建模，著重於偏好、厭惡和說明性推理。該架構利用一個較大的 LLM 為使用者的偏好生成綜合說明，然後用於微調一個較小的 LLM，以增強推薦準確性和人類可解釋的說明。我們的實驗研究探討了推理和背景資訊對個人化推薦的影響，揭示了背景和個人化資料的品質會顯著影響 LLM 生成合理說明的能力。經驗評估表明，ReasoningRec 在推薦預測方面超越了最先進的方法，高達 12.5%，同時提供了人類可以理解的說明。程式碼在此處提供：https://github.com/millenniumbismay/reasoningrec。", "author": "Millennium Bismay et.al.", "authors": "Millennium Bismay, Xiangjue Dong, James Caverlee", "id": "2410.23180v1", "paper_url": "http://arxiv.org/abs/2410.23180v1", "repo": "https://github.com/millenniumbismay/reasoningrec"}}