{"2406.16687": {"publish_time": "2024-06-24", "title": "Link Prediction with Untrained Message Passing Layers", "paper_summary": "Message passing neural networks (MPNNs) operate on graphs by exchanging\ninformation between neigbouring nodes. MPNNs have been successfully applied to\nvarious node-, edge-, and graph-level tasks in areas like molecular science,\ncomputer vision, natural language processing, and combinatorial optimization.\nHowever, most MPNNs require training on large amounts of labeled data, which\ncan be costly and time-consuming. In this work, we explore the use of various\nuntrained message passing layers in graph neural networks, i.e. variants of\npopular message passing architecture where we remove all trainable parameters\nthat are used to transform node features in the message passing step. Focusing\non link prediction, we find that untrained message passing layers can lead to\ncompetitive and even superior performance compared to fully trained MPNNs,\nespecially in the presence of high-dimensional features. We provide a\ntheoretical analysis of untrained message passing by relating the inner\nproducts of features implicitly produced by untrained message passing layers to\npath-based topological node similarity measures. As such, untrained message\npassing architectures can be viewed as a highly efficient and interpretable\napproach to link prediction.", "paper_summary_zh": "訊息傳遞神經網路 (MPNN) 透過交換鄰近節點之間的資訊來處理圖形。MPNN 已成功應用於各種節點、邊緣和圖形層級的任務，例如分子科學、電腦視覺、自然語言處理和組合最佳化。然而，大多數 MPNN 需要大量標籤資料才能進行訓練，這可能會很昂貴且耗時。在這項工作中，我們探討了在圖形神經網路中使用各種未訓練的訊息傳遞層，也就是說，我們移除了所有用於在訊息傳遞步驟中轉換節點特徵的可訓練參數，這是熱門訊息傳遞架構的變體。專注於連結預測，我們發現未訓練的訊息傳遞層可以產生具有競爭力，甚至優於完全訓練的 MPNN 的效能，尤其是在存在高維特徵的情況下。我們透過將未訓練的訊息傳遞層隱含產生的特徵的內積與基於路徑的拓撲節點相似度測量關聯，提供未訓練訊息傳遞的理論分析。因此，未訓練的訊息傳遞架構可以視為一種高度有效且可解釋的連結預測方法。", "author": "Lisi Qarkaxhija et.al.", "authors": "Lisi Qarkaxhija, Anatol E. Wegner, Ingo Scholtes", "id": "2406.16687v1", "paper_url": "http://arxiv.org/abs/2406.16687v1", "repo": "null"}}