{"2407.16166": {"publish_time": "2024-07-23", "title": "Robust Privacy Amidst Innovation with Large Language Models Through a Critical Assessment of the Risks", "paper_summary": "This study examines integrating EHRs and NLP with large language models\n(LLMs) to improve healthcare data management and patient care. It focuses on\nusing advanced models to create secure, HIPAA-compliant synthetic patient notes\nfor biomedical research. The study used de-identified and re-identified MIMIC\nIII datasets with GPT-3.5, GPT-4, and Mistral 7B to generate synthetic notes.\nText generation employed templates and keyword extraction for contextually\nrelevant notes, with one-shot generation for comparison. Privacy assessment\nchecked PHI occurrence, while text utility was tested using an ICD-9 coding\ntask. Text quality was evaluated with ROUGE and cosine similarity metrics to\nmeasure semantic similarity with source notes. Analysis of PHI occurrence and\ntext utility via the ICD-9 coding task showed that the keyword-based method had\nlow risk and good performance. One-shot generation showed the highest PHI\nexposure and PHI co-occurrence, especially in geographic location and date\ncategories. The Normalized One-shot method achieved the highest classification\naccuracy. Privacy analysis revealed a critical balance between data utility and\nprivacy protection, influencing future data use and sharing. Re-identified data\nconsistently outperformed de-identified data. This study demonstrates the\neffectiveness of keyword-based methods in generating privacy-protecting\nsynthetic clinical notes that retain data usability, potentially transforming\nclinical data-sharing practices. The superior performance of re-identified over\nde-identified data suggests a shift towards methods that enhance utility and\nprivacy by using dummy PHIs to perplex privacy attacks.", "paper_summary_zh": "本研究探討整合電子病歷 (EHR) 和自然語言處理 (NLP) 與大型語言模型 (LLM)，以改善醫療保健資料管理和患者照護。其重點在於使用進階模型來建立安全且符合 HIPAA 規範的合成病患紀錄，以供生物醫學研究使用。本研究使用去識別化且重新識別的 MIMIC III 資料集，並搭配 GPT-3.5、GPT-4 和 Mistral 7B 來產生合成紀錄。文字產生採用範本和關鍵字萃取，以產生與脈絡相關的紀錄，並使用一次性產生進行比較。隱私評估檢查 PHI 的出現，而文字效用則使用 ICD-9 編碼任務進行測試。文字品質使用 ROUGE 和餘弦相似度指標進行評估，以測量與原始紀錄的語義相似度。透過 ICD-9 編碼任務分析 PHI 的出現和文字效用，顯示基於關鍵字的方法風險低且效能良好。一次性產生顯示出最高的 PHI 曝光和 PHI 共現，特別是在地理位置和日期類別中。正規化一次性方法達到最高的分類準確度。隱私分析揭示了資料效用和隱私保護之間的關鍵平衡，影響未來的資料使用和分享。重新識別的資料始終優於去識別化的資料。本研究證明了基於關鍵字的方法在產生保護隱私的合成臨床紀錄方面是有效的，這些紀錄保留了資料可用性，並有可能轉變臨床資料分享實務。重新識別的資料優於去識別化資料的優異效能，這表示朝向使用虛擬 PHI 來混淆隱私攻擊，以增強效用和隱私的方法邁進。", "author": "Yao-Shun Chuang et.al.", "authors": "Yao-Shun Chuang, Atiquer Rahman Sarkar, Noman Mohammed, Xiaoqian Jiang", "id": "2407.16166v1", "paper_url": "http://arxiv.org/abs/2407.16166v1", "repo": "null"}}