{"2412.04315": {"publish_time": "2024-12-05", "title": "Densing Law of LLMs", "paper_summary": "Large Language Models (LLMs) have emerged as a milestone in artificial\nintelligence, and their performance can improve as the model size increases.\nHowever, this scaling brings great challenges to training and inference\nefficiency, particularly for deploying LLMs in resource-constrained\nenvironments, and the scaling trend is becoming increasingly unsustainable.\nThis paper introduces the concept of ``\\textit{capacity density}'' as a new\nmetric to evaluate the quality of the LLMs across different scales and\ndescribes the trend of LLMs in terms of both effectiveness and efficiency. To\ncalculate the capacity density of a given target LLM, we first introduce a set\nof reference models and develop a scaling law to predict the downstream\nperformance of these reference models based on their parameter sizes. We then\ndefine the \\textit{effective parameter size} of the target LLM as the parameter\nsize required by a reference model to achieve equivalent performance, and\nformalize the capacity density as the ratio of the effective parameter size to\nthe actual parameter size of the target LLM. Capacity density provides a\nunified framework for assessing both model effectiveness and efficiency. Our\nfurther analysis of recent open-source base LLMs reveals an empirical law (the\ndensing law)that the capacity density of LLMs grows exponentially over time.\nMore specifically, using some widely used benchmarks for evaluation, the\ncapacity density of LLMs doubles approximately every three months. The law\nprovides new perspectives to guide future LLM development, emphasizing the\nimportance of improving capacity density to achieve optimal results with\nminimal computational overhead.", "paper_summary_zh": "大型語言模型 (LLM) 已成為人工智慧的里程碑，且其效能會隨著模型大小的增加而提升。\n然而，這種擴充為訓練和推論效率帶來極大的挑戰，特別是在資源受限的環境中部署 LLM，且擴充趨勢正變得愈來愈不可持續。\n本文介紹了「容量密度」的概念，作為評估不同規模 LLM 品質的新指標，並根據效能和效率描述 LLM 的趨勢。\n若要計算特定目標 LLM 的容量密度，我們首先會引入一組參考模型，並根據其參數規模，制定一個擴充定律來預測這些參考模型的下游效能。\n接著，我們將目標 LLM 的「有效參數規模」定義為參考模型達成等效效能所需的參數規模，並將容量密度形式化為有效參數規模與目標 LLM 實際參數規模的比率。\n容量密度提供了一個統一的架構，用於評估模型的效能和效率。\n我們進一步分析近期開源的基本 LLM，揭露了一項經驗法則（密度定律），指出 LLM 的容量密度會隨著時間呈指數成長。\n更具體來說，使用一些廣泛用於評估的基準，LLM 的容量密度大約每三個月就會增加一倍。\n此定律為未來的 LLM 發展提供了新的觀點，強調提升容量密度以在最小的運算負擔下達成最佳結果的重要性。", "author": "Chaojun Xiao et.al.", "authors": "Chaojun Xiao, Jie Cai, Weilin Zhao, Guoyang Zeng, Xu Han, Zhiyuan Liu, Maosong Sun", "id": "2412.04315v1", "paper_url": "http://arxiv.org/abs/2412.04315v1", "repo": "null"}}