{"2408.04917": {"publish_time": "2024-08-09", "title": "Avoid Wasted Annotation Costs in Open-set Active Learning with Pre-trained Vision-Language Model", "paper_summary": "Active learning (AL) aims to enhance model performance by selectively\ncollecting highly informative data, thereby minimizing annotation costs.\nHowever, in practical scenarios, unlabeled data may contain out-of-distribution\n(OOD) samples, leading to wasted annotation costs if data is incorrectly\nselected. Recent research has explored methods to apply AL to open-set data,\nbut these methods often require or incur unavoidable cost losses to minimize\nthem. To address these challenges, we propose a novel selection strategy, CLIPN\nfor AL (CLIPNAL), which minimizes cost losses without requiring OOD samples.\nCLIPNAL sequentially evaluates the purity and informativeness of data. First,\nit utilizes a pre-trained vision-language model to detect and exclude OOD data\nby leveraging linguistic and visual information of in-distribution (ID) data\nwithout additional training. Second, it selects highly informative data from\nthe remaining ID data, and then the selected samples are annotated by human\nexperts. Experimental results on datasets with various open-set conditions\ndemonstrate that CLIPNAL achieves the lowest cost loss and highest performance\nacross all scenarios. Code is available at https://github.com/DSBA-Lab/OpenAL.", "paper_summary_zh": "主動學習 (AL) 旨在透過有選擇性地收集高度資訊性的資料來增強模型效能，從而將註解成本降至最低。然而，在實際情況中，未標籤資料可能包含分布外 (OOD) 樣本，如果資料選擇錯誤，將導致註解成本浪費。最近的研究已探討將 AL 應用於開放式資料集的方法，但這些方法通常需要或會產生無法避免的成本損失才能將其降至最低。為了應對這些挑戰，我們提出了一種新的選擇策略，即 AL 用的 CLIPN (CLIPNAL)，它可以在不需要 OOD 樣本的情況下將成本損失降至最低。CLIPNAL 會依序評估資料的純淨度和資訊性。首先，它利用預先訓練好的視覺語言模型來偵測和排除 OOD 資料，方法是利用分佈內 (ID) 資料的語言和視覺資訊，而不需要額外的訓練。其次，它從剩下的 ID 資料中選擇高度資訊性的資料，然後由人類專家對所選樣本進行註解。在具有各種開放式資料集條件的資料集上進行的實驗結果表明，CLIPNAL 在所有情況下都能實現最低的成本損失和最高的效能。程式碼可在 https://github.com/DSBA-Lab/OpenAL 取得。", "author": "Jaehyuk Heo et.al.", "authors": "Jaehyuk Heo, Pilsung Kang", "id": "2408.04917v1", "paper_url": "http://arxiv.org/abs/2408.04917v1", "repo": "null"}}