{"2410.19084": {"publish_time": "2024-10-24", "title": "GCoder: Improving Large Language Model for Generalized Graph Problem Solving", "paper_summary": "Large Language Models (LLMs) have demonstrated strong reasoning abilities,\nmaking them suitable for complex tasks such as graph computation. Traditional\nreasoning steps paradigm for graph problems is hindered by unverifiable steps,\nlimited long-term reasoning, and poor generalization to graph variations. To\novercome these limitations, we introduce GCoder, a code-based LLM designed to\nenhance problem-solving in generalized graph computation problems. Our method\ninvolves constructing an extensive training dataset, GraphWild, featuring\ndiverse graph formats and algorithms. We employ a multi-stage training process,\nincluding Supervised Fine-Tuning (SFT) and Reinforcement Learning from Compiler\nFeedback (RLCF), to refine model capabilities. For unseen tasks, a hybrid\nretrieval technique is used to augment performance. Experiments demonstrate\nthat GCoder outperforms GPT-4o, with an average accuracy improvement of 16.42%\nacross various graph computational problems. Furthermore, GCoder efficiently\nmanages large-scale graphs with millions of nodes and diverse input formats,\novercoming the limitations of previous models focused on the reasoning steps\nparadigm. This advancement paves the way for more intuitive and effective graph\nproblem-solving using LLMs. Code and data are available at here:\nhttps://github.com/Bklight999/WWW25-GCoder/tree/master.", "paper_summary_zh": "大型語言模型 (LLM) 已展現強大的推理能力，使其適用於複雜任務，例如圖形運算。傳統圖形問題的推理步驟範例受到不可驗證的步驟、有限的長期推理和對圖形變化的概括性不佳的阻礙。為了克服這些限制，我們引入了 GCoder，一種基於代碼的 LLM，旨在增強廣義圖形運算問題中的問題解決能力。我們的技術涉及構建一個廣泛的訓練資料集 GraphWild，其中包含多樣的圖形格式和演算法。我們採用多階段訓練流程，包括監督微調 (SFT) 和編譯器回饋強化學習 (RLCF)，以改善模型能力。對於未知任務，使用混合擷取技術來增強效能。實驗證明，GCoder 優於 GPT-4o，在各種圖形運算問題中平均準確度提升了 16.42%。此外，GCoder 有效地管理著擁有數百萬個節點和多樣輸入格式的大規模圖形，克服了先前專注於推理步驟範例的模型的限制。這項進展為使用 LLM 進行更直觀且有效的圖形問題解決鋪平了道路。程式碼和資料可於此處取得：https://github.com/Bklight999/WWW25-GCoder/tree/master。", "author": "Qifan Zhang et.al.", "authors": "Qifan Zhang, Xiaobin Hong, Jianheng Tang, Nuo Chen, Yuhan Li, Wenzhong Li, Jing Tang, Jia Li", "id": "2410.19084v1", "paper_url": "http://arxiv.org/abs/2410.19084v1", "repo": "https://github.com/bklight999/www25-gcoder"}}