{"2406.17253": {"publish_time": "2024-06-25", "title": "How Well Can Knowledge Edit Methods Edit Perplexing Knowledge?", "paper_summary": "As large language models (LLMs) are widely deployed, targeted editing of\ntheir knowledge has become a critical challenge. Recently, advancements in\nmodel editing techniques, such as Rank-One Model Editing (ROME), have paved the\nway for updating LLMs with new knowledge. However, the efficacy of these\nmethods varies across different types of knowledge. This study investigates the\ncapability of knowledge editing methods to incorporate new knowledge with\nvarying degrees of \"perplexingness\", a term we use to describe the initial\ndifficulty LLMs have in understanding new concepts. We begin by quantifying the\n\"perplexingness\" of target knowledge using pre-edit conditional probabilities,\nand assess the efficacy of edits through post-edit conditional probabilities.\nUtilizing the widely-used CounterFact dataset, we find significant negative\ncorrelations between the \"perplexingness\" of the new knowledge and the edit\nefficacy across all 12 scenarios. To dive deeper into this phenomenon, we\nintroduce a novel dataset, HierarchyData, consisting of 99 hyponym-hypernym\npairs across diverse categories. Our analysis reveal that more abstract\nconcepts (hypernyms) tend to be more perplexing than their specific\ncounterparts (hyponyms). Further exploration into the influence of knowledge\nhierarchy on editing outcomes indicates that knowledge positioned at higher\nhierarchical levels is more challenging to modify in some scenarios. Our\nresearch highlights a previously overlooked aspect of LLM editing: the variable\nefficacy of editing methods in handling perplexing knowledge. By revealing how\nhierarchical relationships can influence editing outcomes, our findings offer\nnew insights into the challenges of updating LLMs and pave the way for more\nnuanced approaches to model editing in the future.", "paper_summary_zh": "<paragraph>隨著大型語言模型 (LLM) 廣泛部署，有針對性地編輯其知識已成為一項關鍵挑戰。最近，模型編輯技術的進展，例如秩一模型編輯 (ROME)，為使用新知識更新 LLM 鋪平了道路。然而，這些方法的功效因不同類型的知識而異。本研究探討了知識編輯方法將具有不同程度「困惑性」的新知識納入其中的能力，我們使用這個術語來描述 LLM 在理解新概念時的初始困難。我們首先使用預編輯條件機率對目標知識的「困惑性」進行量化，並透過後編輯條件機率評估編輯的功效。利用廣泛使用的 CounterFact 資料集，我們發現新知識的「困惑性」與所有 12 種情況下的編輯功效之間存在顯著的負相關。為了更深入探討這個現象，我們引入了新的資料集 HierarchyData，其中包含 99 個跨類別的低階詞-高階詞對。我們的分析顯示，更抽象的概念（高階詞）往往比它們具體的對應概念（低階詞）更令人困惑。進一步探討知識層級對編輯結果的影響表明，在某些情況下，位於較高層級的知識更難以修改。我們的研究強調了 LLM 編輯中先前被忽略的一個面向：編輯方法在處理令人困惑的知識時功效的可變性。透過揭示層級關係如何影響編輯結果，我們的發現為更新 LLM 的挑戰提供了新的見解，並為未來更細緻的模型編輯方法鋪平了道路。</paragraph>", "author": "Huaizhi Ge et.al.", "authors": "Huaizhi Ge, Frank Rudzicz, Zining Zhu", "id": "2406.17253v1", "paper_url": "http://arxiv.org/abs/2406.17253v1", "repo": "null"}}