{"2408.08055": {"publish_time": "2024-08-15", "title": "COTODE: COntinuous Trajectory neural Ordinary Differential Equations for modelling event sequences", "paper_summary": "Observation of the underlying actors that generate event sequences reveals\nthat they often evolve continuously. Most modern methods, however, tend to\nmodel such processes through at most piecewise-continuous trajectories. To\naddress this, we adopt a way of viewing events not as standalone phenomena but\ninstead as observations of a Gaussian Process, which in turn governs the\nactor's dynamics. We propose integrating these obtained dynamics, resulting in\na continuous-trajectory modification of the widely successful Neural ODE model.\nThrough Gaussian Process theory, we were able to evaluate the uncertainty in an\nactor's representation, which arises from not observing them between events.\nThis estimate led us to develop a novel, theoretically backed negative feedback\nmechanism. Empirical studies indicate that our model with Gaussian process\ninterpolation and negative feedback achieves state-of-the-art performance, with\nimprovements up to 20% AUROC against similar architectures.", "paper_summary_zh": "觀察產生事件序列的底層行為者，可以發現它們經常持續地演化。然而，大多數現代方法傾向於透過至多分段連續的軌跡來建模這些過程。為了解決這個問題，我們採用一種將事件視為高斯過程的觀測，而不是獨立現象的方式，而高斯過程反過來控制行為者的動態。我們建議整合這些獲得的動態，從而對廣泛成功的 Neural ODE 模型進行連續軌跡修改。透過高斯過程理論，我們能夠評估行為者表徵中的不確定性，這源於在事件之間沒有觀察到它們。這個估計讓我們開發出一個新穎的、理論支持的負回饋機制。實證研究表明，我們採用高斯過程插值和負回饋的模型達到了最先進的效能，與類似架構相比，AUROC 提升了 20%。", "author": "Ilya Kuleshov et.al.", "authors": "Ilya Kuleshov, Galina Boeva, Vladislav Zhuzhel, Evgenia Romanenkova, Evgeni Vorsin, Alexey Zaytsev", "id": "2408.08055v1", "paper_url": "http://arxiv.org/abs/2408.08055v1", "repo": "null"}}