{"2408.08841": {"publish_time": "2024-08-16", "title": "FLEXTAF: Enhancing Table Reasoning with Flexible Tabular Formats", "paper_summary": "The table reasoning task aims to answer the question according to the given\ntable. Currently, using Large Language Models (LLMs) is the predominant method\nfor table reasoning. Most existing methods employ a fixed tabular format to\nrepresent the table, which could limit the performance. Given that each\ninstance requires different capabilities and models possess varying abilities,\nwe assert that different instances and models suit different tabular formats.\nWe prove the aforementioned claim through quantitative analysis of experimental\nresults, where different instances and models achieve different performances\nusing various tabular formats. Building on this discussion, we propose\nFLEXTAF-Single and FLEXTAF-Vote to enhance table reasoning performance by\nemploying flexible tabular formats. Specifically, (i) FLEXTAF-Single trains a\nclassifier to predict the most suitable tabular format based on the instance\nand the LLM. (ii) FLEXTAF-Vote integrates the results across different formats.\nOur experiments on WikiTableQuestions and TabFact reveal significant\nimprovements, with average gains of 2.3% and 4.8% compared to the best\nperformance achieved using a fixed tabular format with greedy decoding and\nself-consistency decoding, thereby validating the effectiveness of our methods.", "paper_summary_zh": "表格推理任務旨在根據給定的表格回答問題。目前，使用大型語言模型 (LLM) 是表格推理的主要方法。大多數現有方法採用固定的表格格式來表示表格，這可能會限制效能。由於每個實例都需要不同的能力，而模型具備不同的能力，我們斷言不同的實例和模型適合不同的表格格式。我們透過對實驗結果進行量化分析來證明上述說法，其中不同的實例和模型使用不同的表格格式來達成不同的效能。基於此討論，我們提出 FLEXTAF-Single 和 FLEXTAF-Vote 來透過採用彈性的表格格式來增強表格推理效能。具體來說，(i) FLEXTAF-Single 訓練一個分類器來根據實例和 LLM 預測最合適的表格格式。(ii) FLEXTAF-Vote 整合不同格式的結果。我們在 WikiTableQuestions 和 TabFact 上的實驗顯示出顯著的改進，與使用具有貪婪解碼和自一致解碼的固定表格格式所達成的最佳效能相比，平均增益分別為 2.3% 和 4.8%，從而驗證了我們方法的有效性。", "author": "Xuanliang Zhang et.al.", "authors": "Xuanliang Zhang, Dingzirui Wang, Longxu Dou, Baoxin Wang, Dayong Wu, Qingfu Zhu, Wanxiang Che", "id": "2408.08841v1", "paper_url": "http://arxiv.org/abs/2408.08841v1", "repo": "null"}}