{"2501.04359": {"publish_time": "2025-01-08", "title": "Decoding EEG Speech Perception with Transformers and VAE-based Data Augmentation", "paper_summary": "Decoding speech from non-invasive brain signals, such as\nelectroencephalography (EEG), has the potential to advance brain-computer\ninterfaces (BCIs), with applications in silent communication and assistive\ntechnologies for individuals with speech impairments. However, EEG-based speech\ndecoding faces major challenges, such as noisy data, limited datasets, and poor\nperformance on complex tasks like speech perception. This study attempts to\naddress these challenges by employing variational autoencoders (VAEs) for EEG\ndata augmentation to improve data quality and applying a state-of-the-art\n(SOTA) sequence-to-sequence deep learning architecture, originally successful\nin electromyography (EMG) tasks, to EEG-based speech decoding. Additionally, we\nadapt this architecture for word classification tasks. Using the Brennan\ndataset, which contains EEG recordings of subjects listening to narrated\nspeech, we preprocess the data and evaluate both classification and\nsequence-to-sequence models for EEG-to-words/sentences tasks. Our experiments\nshow that VAEs have the potential to reconstruct artificial EEG data for\naugmentation. Meanwhile, our sequence-to-sequence model achieves more promising\nperformance in generating sentences compared to our classification model,\nthough both remain challenging tasks. These findings lay the groundwork for\nfuture research on EEG speech perception decoding, with possible extensions to\nspeech production tasks such as silent or imagined speech.", "paper_summary_zh": "從非侵入式腦信號（例如腦電圖 (EEG)）解碼語言，具有推動腦機介面 (BCI) 的潛力，並可應用於無聲溝通和協助語言障礙人士的輔助技術。然而，基於 EEG 的語言解碼面臨重大挑戰，例如雜訊資料、受限的資料集和在語言知覺等複雜任務上的表現不佳。本研究嘗試透過採用變異自動編碼器 (VAE) 來擴充 EEG 資料以改善資料品質，並應用最先進 (SOTA) 的序列對序列深度學習架構（最初成功應用於肌電圖 (EMG) 任務）到基於 EEG 的語言解碼，來解決這些挑戰。此外，我們調整此架構以適用於詞彙分類任務。我們使用 Brennan 資料集（其中包含受試者聆聽敘述語言的 EEG 記錄），預處理資料並評估分類和序列對序列模型在 EEG 轉換為文字/句子任務中的表現。我們的實驗顯示，VAE 有潛力重建人工 EEG 資料以進行擴充。同時，與分類模型相比，我們的序列對序列模型在產生句子方面表現更具前景，儘管兩者仍是具有挑戰性的任務。這些發現為未來 EEG 語言知覺解碼研究奠定基礎，並可能延伸至語言產生任務，例如無聲或想像的語言。", "author": "Terrance Yu-Hao Chen et.al.", "authors": "Terrance Yu-Hao Chen, Yulin Chen, Pontus Soederhaell, Sadrishya Agrawal, Kateryna Shapovalenko", "id": "2501.04359v1", "paper_url": "http://arxiv.org/abs/2501.04359v1", "repo": "null"}}