{"2502.04958": {"publish_time": "2025-02-07", "title": "SSMLoRA: Enhancing Low-Rank Adaptation with State Space Model", "paper_summary": "Fine-tuning is a key approach for adapting language models to specific\ndownstream tasks, but updating all model parameters becomes impractical as\nmodel sizes increase. Parameter-Efficient Fine-Tuning (PEFT) methods, such as\nLow-Rank Adaptation (LoRA), address this challenge by introducing additional\nadaptation parameters into pre-trained weight matrices. However, LoRA's\nperformance varies across different insertion points within the model,\nhighlighting potential parameter inefficiency due to unnecessary insertions. To\nthis end, we propose SSMLoRA (State Space Model Low-Rank Adaptation), an\nextension of LoRA that incorporates a State Space Model (SSM) to interconnect\nlow-rank matrices. SSMLoRA ensures that performance is maintained even with\nsparser insertions. SSMLoRA allows the model to not only map inputs to a\nlow-rank space for better feature extraction but also leverage the computations\nfrom the previous low-rank space. Our method achieves comparable performance to\nLoRA on the General Language Understanding Evaluation (GLUE) benchmark while\nusing only half the parameters. Additionally, due to its structure, SSMLoRA\nshows promise in handling tasks with longer input sequences. .You can find our\ncode here:https://github.com/yuhkalhic/SSMLoRA.", "paper_summary_zh": "微調是一種將語言模型適應到特定下游任務的主要方法，但隨著模型規模的增加，更新所有模型參數變得不切實際。參數高效微調 (PEFT) 方法（例如低秩適應 (LoRA)）通過在預訓練權重矩陣中引入額外的適應參數來解決這一挑戰。然而，LoRA 的性能會因模型中的不同插入點而異，這突顯了由於不必要的插入而導致的潛在參數效率低下。為此，我們提出了 SSMLoRA（狀態空間模型低秩適應），這是一種 LoRA 的擴展，它結合了狀態空間模型 (SSM) 來互連低秩矩陣。SSMLoRA 確保即使在插入較稀疏的情況下也能保持性能。SSMLoRA 不僅允許模型將輸入映射到低秩空間以進行更好的特徵提取，而且還利用了來自先前低秩空間的計算。我們的模型在通用語言理解評估 (GLUE) 基準上實現了與 LoRA 相當的性能，同時僅使用了後者一半的參數。此外，由於其結構，SSMLoRA 在處理具有較長輸入序列的任務方面顯示出前景。您可以在這裡找到我們的代碼：https://github.com/yuhkalhic/SSMLoRA。", "author": "Jiayang Yu et.al.", "authors": "Jiayang Yu, Yihang Zhang, Bin Wang, Peiqin Lin, Yongkang Liu, Shi Feng", "id": "2502.04958v1", "paper_url": "http://arxiv.org/abs/2502.04958v1", "repo": "null"}}