{"2501.05247": {"publish_time": "2025-01-09", "title": "Online Prompt and Solver Selection for Program Synthesis", "paper_summary": "Large Language Models (LLMs) demonstrate impressive capabilities in the\ndomain of program synthesis. This level of performance is not, however,\nuniversal across all tasks, all LLMs and all prompting styles. There are many\nareas where one LLM dominates, one prompting style dominates, or where calling\na symbolic solver is a better choice than an LLM. A key challenge for the user\nthen, is to identify not only when an LLM is the right choice of solver, and\nthe appropriate LLM to call for a given synthesis task, but also the right way\nto call it. A non-expert user who makes the wrong choice, incurs a cost both in\nterms of results (number of tasks solved, and the time it takes to solve them)\nand financial cost, if using a closed-source language model via a commercial\nAPI. We frame this choice as an online learning problem. We use a multi-armed\nbandit algorithm to select which symbolic solver, or LLM and prompt combination\nto deploy in order to maximize a given reward function (which may prioritize\nsolving time, number of synthesis tasks solved, or financial cost of solving).\nWe implement an instance of this approach, called CYANEA, and evaluate it on\nsynthesis queries from the literature in ranking function synthesis, from the\nsyntax-guided synthesis competition, and fresh, unseen queries generated from\nSMT problems. CYANEA solves 37.2\\% more queries than the best single solver and\nachieves results within 4\\% of the virtual best solver.", "paper_summary_zh": "大型語言模型 (LLM) 在程式合成領域展現令人印象深刻的能力。然而，這種效能並非在所有任務、所有 LLM 和所有提示風格中都是普遍適用的。在許多領域中，一個 LLM 佔主導地位，一種提示風格佔主導地位，或者呼叫符號求解器比 LLM 是一個更好的選擇。因此，使用者的關鍵挑戰在於不僅要識別何時 LLM 是求解器的正確選擇，以及在給定的合成任務中呼叫適當的 LLM，還要識別呼叫它的正確方式。做出錯誤選擇的非專家使用者會在結果（已解決任務的數量和解決任務所需的時間）和財務成本方面承擔成本，如果透過商業 API 使用閉源語言模型的話。我們將此選擇設定為線上學習問題。我們使用多臂老虎機演算法來選擇要部署哪個符號求解器，或 LLM 和提示組合，以最大化給定的回報函數（可能會優先考慮解決時間、已解決的合成任務數量或解決的財務成本）。我們實作了這種方法的一個實例，稱為 CYANEA，並在來自排名函數合成、語法引導合成競賽的文獻中的合成查詢，以及從 SMT 問題中產生的最新、未見過的查詢上對其進行評估。CYANEA 解決的查詢比最佳單一求解器多 37.2%，並且在虛擬最佳求解器的 4% 範圍內取得結果。", "author": "Yixuan Li et.al.", "authors": "Yixuan Li, Lewis Frampton, Federico Mora, Elizabeth Polgreen", "id": "2501.05247v1", "paper_url": "http://arxiv.org/abs/2501.05247v1", "repo": "null"}}