{"2410.08822": {"publish_time": "2024-10-11", "title": "SOLD: Reinforcement Learning with Slot Object-Centric Latent Dynamics", "paper_summary": "Learning a latent dynamics model provides a task-agnostic representation of\nan agent's understanding of its environment. Leveraging this knowledge for\nmodel-based reinforcement learning holds the potential to improve sample\nefficiency over model-free methods by learning inside imagined rollouts.\nFurthermore, because the latent space serves as input to behavior models, the\ninformative representations learned by the world model facilitate efficient\nlearning of desired skills. Most existing methods rely on holistic\nrepresentations of the environment's state. In contrast, humans reason about\nobjects and their interactions, forecasting how actions will affect specific\nparts of their surroundings. Inspired by this, we propose Slot-Attention for\nObject-centric Latent Dynamics (SOLD), a novel algorithm that learns\nobject-centric dynamics models in an unsupervised manner from pixel inputs. We\ndemonstrate that the structured latent space not only improves model\ninterpretability but also provides a valuable input space for behavior models\nto reason over. Our results show that SOLD outperforms DreamerV3, a\nstate-of-the-art model-based RL algorithm, across a range of benchmark robotic\nenvironments that evaluate for both relational reasoning and low-level\nmanipulation capabilities. Videos are available at\nhttps://slot-latent-dynamics.github.io/.", "paper_summary_zh": "學習潛在動態模型可以提供任務不可知表示法，表示代理人對其環境的理解。利用此知識進行基於模型的強化學習，具有通過在想像的滾動中學習來提高模型自由方法的樣本效率的潛力。此外，由於潛在空間作為行為模型的輸入，世界模型學習到的信息表示有助於有效學習所需的技能。大多數現有方法依賴於環境狀態的整體表示。相比之下，人類推理物體及其相互作用，預測動作將如何影響周圍環境的特定部分。受此啟發，我們提出用於以物件為中心的潛在動態（SOLD）的槽注意力，這是一種新演算法，可以從像素輸入中以非監督的方式學習以物件為中心的動態模型。我們證明結構化的潛在空間不僅提高了模型的可解釋性，而且還為行為模型提供了有價值的輸入空間。我們的結果表明，SOLD 在一系列基準機器人環境中優於 DreamerV3（一種最先進的基於模型的 RL 演算法），這些環境用於評估關係推理和低層級操作能力。影片可在 https://slot-latent-dynamics.github.io/ 中取得。", "author": "Malte Mosbach et.al.", "authors": "Malte Mosbach, Jan Niklas Ewertz, Angel Villar-Corrales, Sven Behnke", "id": "2410.08822v1", "paper_url": "http://arxiv.org/abs/2410.08822v1", "repo": "null"}}