{"2501.18596": {"publish_time": "2025-01-30", "title": "DeltaLLM: Compress LLMs with Low-Rank Deltas between Shared Weights", "paper_summary": "We introduce DeltaLLM, a new post-training compression technique to reduce\nthe memory footprint of LLMs. We propose an alternative way of structuring LLMs\nwith weight sharing between layers in subsequent Transformer blocks, along with\nadditional low-rank difference matrices between them. For training, we adopt\nthe progressing module replacement method and show that the lightweight\ntraining of the low-rank modules with approximately 30M-40M tokens is\nsufficient to achieve performance on par with LLMs of comparable sizes trained\nfrom scratch. We release the resultant models, DeltaLLAMA and DeltaPHI, with a\n12% parameter reduction, retaining 90% of the performance of the base Llama and\nPhi models on common knowledge and reasoning benchmarks. Our method also\noutperforms compression techniques JointDrop, LaCo, ShortGPT and SliceGPT with\nthe same number of parameters removed. For example, DeltaPhi 2.9B with a 24%\nreduction achieves similar average zero-shot accuracies as recovery fine-tuned\nSlicedPhi 3.3B with a 12% reduction, despite being approximately 400M\nparameters smaller with no fine-tuning applied. This work provides new insights\ninto LLM architecture design and compression methods when storage space is\ncritical.", "paper_summary_zh": "我們引入了 DeltaLLM，這是一種新的訓練後壓縮技術，用於減少 LLM 的記憶體佔用空間。我們提出了一種結構化 LLM 的替代方法，在後續 Transformer 區塊中的層之間共享權重，並在它們之間添加低秩差分矩陣。在訓練方面，我們採用了逐漸替換模組的方法，並表明低秩模組的輕量化訓練，大約有 30M-40M 個符號，足以達到與從頭訓練的同等大小的 LLM 相當的效能。我們發布了結果模型 DeltaLLAMA 和 DeltaPHI，它們的參數減少了 12%，在常見知識和推理基準上保留了 Llama 和 Phi 基礎模型 90% 的效能。我們的技術也優於壓縮技術 JointDrop、LaCo、ShortGPT 和 SliceGPT，而移除的參數數量相同。例如，DeltaPhi 2.9B 減小了 24%，達到了與使用 12% 減小的 SlicedPhi 3.3B 進行恢復微調後類似的平均零次學習準確率，儘管它大約小了 400M 參數且未套用微調。當儲存空間至關重要時，這項工作為 LLM 架構設計和壓縮方法提供了新的見解。", "author": "Liana Mikaelyan et.al.", "authors": "Liana Mikaelyan, Ayyoob Imani, Mathew Salvaris, Parth Pathak, Mohsen Fayyaz", "id": "2501.18596v1", "paper_url": "http://arxiv.org/abs/2501.18596v1", "repo": "null"}}