{"2410.12845": {"publish_time": "2024-10-10", "title": "Toward Relieving Clinician Burden by Automatically Generating Progress Notes using Interim Hospital Data", "paper_summary": "Regular documentation of progress notes is one of the main contributors to\nclinician burden. The abundance of structured chart information in medical\nrecords further exacerbates the burden, however, it also presents an\nopportunity to automate the generation of progress notes. In this paper, we\npropose a task to automate progress note generation using structured or tabular\ninformation present in electronic health records. To this end, we present a\nnovel framework and a large dataset, ChartPNG, for the task which contains\n$7089$ annotation instances (each having a pair of progress notes and interim\nstructured chart data) across $1616$ patients. We establish baselines on the\ndataset using large language models from general and biomedical domains. We\nperform both automated (where the best performing Biomistral model achieved a\nBERTScore F1 of $80.53$ and MEDCON score of $19.61$) and manual (where we found\nthat the model was able to leverage relevant structured data with $76.9\\%$\naccuracy) analyses to identify the challenges with the proposed task and\nopportunities for future research.", "paper_summary_zh": "定期记录進度筆記是造成臨床醫師負擔的主要原因之一。病歷中豐富的結構化圖表資訊進一步加劇了負擔，但它也提供了自動化生成進度筆記的機會。在本文中，我們提出了使用電子健康記錄中存在的結構化或表格資訊自動化生成進度筆記的任務。為此，我們提出了 ChartPNG 的一個新框架和一個大型資料集，該任務包含 1616 位患者的 7089 個註解實例（每個實例都有一對進度筆記和臨時結構化圖表資料）。我們使用來自一般和生物醫學領域的大型語言模型在資料集上建立基線。我們執行自動化（表現最佳的 Biomistral 模型達到 BERTScore F1 為 80.53 和 MEDCON 分數為 19.61）和手動（我們發現該模型能夠以 76.9% 的準確度利用相關結構化資料）分析，以找出所提出任務的挑戰和未來研究的機會。", "author": "Sarvesh Soni et.al.", "authors": "Sarvesh Soni, Dina Demner-Fushman", "id": "2410.12845v1", "paper_url": "http://arxiv.org/abs/2410.12845v1", "repo": "null"}}