{"2408.15550": {"publish_time": "2024-08-28", "title": "Trustworthy and Responsible AI for Human-Centric Autonomous Decision-Making Systems", "paper_summary": "Artificial Intelligence (AI) has paved the way for revolutionary\ndecision-making processes, which if harnessed appropriately, can contribute to\nadvancements in various sectors, from healthcare to economics. However, its\nblack box nature presents significant ethical challenges related to bias and\ntransparency. AI applications are hugely impacted by biases, presenting\ninconsistent and unreliable findings, leading to significant costs and\nconsequences, highlighting and perpetuating inequalities and unequal access to\nresources. Hence, developing safe, reliable, ethical, and Trustworthy AI\nsystems is essential.\n  Our team of researchers working with Trustworthy and Responsible AI, part of\nthe Transdisciplinary Scholarship Initiative within the University of Calgary,\nconducts research on Trustworthy and Responsible AI, including fairness, bias\nmitigation, reproducibility, generalization, interpretability, and\nauthenticity. In this paper, we review and discuss the intricacies of AI\nbiases, definitions, methods of detection and mitigation, and metrics for\nevaluating bias. We also discuss open challenges with regard to the\ntrustworthiness and widespread application of AI across diverse domains of\nhuman-centric decision making, as well as guidelines to foster Responsible and\nTrustworthy AI models.", "paper_summary_zh": "人工智慧 (AI) 為革命性的決策過程鋪路，如果適當運用，可促進從醫療保健到經濟等各個領域的進步。然而，其黑箱性質對偏見和透明度提出了重大的道德挑戰。AI 應用受到偏見的嚴重影響，呈現出不一致且不可靠的發現，導致重大成本和後果，凸顯並延續不平等和資源取得不均的問題。因此，開發安全、可靠、合乎道德且值得信賴的 AI 系統至關重要。\n我們的研究團隊與卡加利大學跨學科獎學金計畫中的可信賴且負責任的 AI 合作，對可信賴且負責任的 AI 進行研究，包括公平性、偏見緩解、可複製性、概括性、可解釋性和真實性。在本文中，我們回顧並討論 AI 偏見、定義、偵測和緩解方法，以及評估偏見的指標的複雜性。我們還討論了在以人為中心的決策制定過程中，AI 的可信賴性和廣泛應用所面臨的公開挑戰，以及促進負責任且可信賴的 AI 模型的準則。", "author": "Farzaneh Dehghani et.al.", "authors": "Farzaneh Dehghani, Mahsa Dibaji, Fahim Anzum, Lily Dey, Alican Basdemir, Sayeh Bayat, Jean-Christophe Boucher, Steve Drew, Sarah Elaine Eaton, Richard Frayne, Gouri Ginde, Ashley Harris, Yani Ioannou, Catherine Lebel, John Lysack, Leslie Salgado Arzuaga, Emma Stanley, Roberto Souza, Ronnie Souza, Lana Wells, Tyler Williamson, Matthias Wilms, Zaman Wahid, Mark Ungrin, Marina Gavrilova, Mariana Bento", "id": "2408.15550v1", "paper_url": "http://arxiv.org/abs/2408.15550v1", "repo": "null"}}