{"2412.08615": {"publish_time": "2024-12-11", "title": "Exploiting the Index Gradients for Optimization-Based Jailbreaking on Large Language Models", "paper_summary": "Despite the advancements in training Large Language Models (LLMs) with\nalignment techniques to enhance the safety of generated content, these models\nremain susceptible to jailbreak, an adversarial attack method that exposes\nsecurity vulnerabilities in LLMs. Notably, the Greedy Coordinate Gradient (GCG)\nmethod has demonstrated the ability to automatically generate adversarial\nsuffixes that jailbreak state-of-the-art LLMs. However, the optimization\nprocess involved in GCG is highly time-consuming, rendering the jailbreaking\npipeline inefficient. In this paper, we investigate the process of GCG and\nidentify an issue of Indirect Effect, the key bottleneck of the GCG\noptimization. To this end, we propose the Model Attack Gradient Index GCG\n(MAGIC), that addresses the Indirect Effect by exploiting the gradient\ninformation of the suffix tokens, thereby accelerating the procedure by having\nless computation and fewer iterations. Our experiments on AdvBench show that\nMAGIC achieves up to a 1.5x speedup, while maintaining Attack Success Rates\n(ASR) on par or even higher than other baselines. Our MAGIC achieved an ASR of\n74% on the Llama-2 and an ASR of 54% when conducting transfer attacks on\nGPT-3.5. Code is available at https://github.com/jiah-li/magic.", "paper_summary_zh": "儘管在使用調整技術訓練大型語言模型 (LLM) 以增強所產生內容的安全性的過程中取得進展，但這些模型仍容易受到越獄攻擊，這是一種會暴露 LLM 中安全漏洞的對抗攻擊方法。值得注意的是，貪婪坐標梯度 (GCG) 方法已證明有能力自動產生對抗後綴，以越獄最先進的 LLM。然而，GCG 中涉及的最佳化過程非常耗時，導致越獄管道效率低下。在本文中，我們研究了 GCG 的過程，並找出間接效應的問題，這是 GCG 最佳化的關鍵瓶頸。為此，我們提出了模型攻擊梯度指標 GCG (MAGIC)，它透過利用後綴標記的梯度資訊來解決間接效應，從而透過減少運算和反覆運算來加速程序。我們在 AdvBench 上的實驗顯示，MAGIC 可將速度提升至 1.5 倍，同時維持攻擊成功率 (ASR) 與其他基線相當，甚至更高。我們的 MAGIC 在 Llama-2 上達到了 74% 的 ASR，在對 GPT-3.5 進行轉移攻擊時達到了 54% 的 ASR。程式碼可於 https://github.com/jiah-li/magic 取得。", "author": "Jiahui Li et.al.", "authors": "Jiahui Li, Yongchang Hao, Haoyu Xu, Xing Wang, Yu Hong", "id": "2412.08615v1", "paper_url": "http://arxiv.org/abs/2412.08615v1", "repo": "null"}}