{"2502.02100": {"publish_time": "2025-02-04", "title": "Topic Modeling in Marathi", "paper_summary": "While topic modeling in English has become a prevalent and well-explored\narea, venturing into topic modeling for Indic languages remains relatively\nrare. The limited availability of resources, diverse linguistic structures, and\nunique challenges posed by Indic languages contribute to the scarcity of\nresearch and applications in this domain. Despite the growing interest in\nnatural language processing and machine learning, there exists a noticeable gap\nin the comprehensive exploration of topic modeling methodologies tailored\nspecifically for languages such as Hindi, Marathi, Tamil, and others. In this\npaper, we examine several topic modeling approaches applied to the Marathi\nlanguage. Specifically, we compare various BERT and non-BERT approaches,\nincluding multilingual and monolingual BERT models, using topic coherence and\ntopic diversity as evaluation metrics. Our analysis provides insights into the\nperformance of these approaches for Marathi language topic modeling. The key\nfinding of the paper is that BERTopic, when combined with BERT models trained\non Indic languages, outperforms LDA in terms of topic modeling performance.", "paper_summary_zh": "儘管英文的主題模型已經成為一個普遍且廣泛探索的領域，但對於印度語言的主題模型探險仍然相對罕見。資源有限、語言結構多樣以及印度語言帶來的獨特挑戰，都導致了這個領域研究和應用上的稀缺。儘管對於自然語言處理和機器學習的興趣日益增加，但針對印地語、馬拉地語、泰米爾語等語言量身打造的主題模型方法的全面探索，仍然存在顯著的差距。在本文中，我們探討了幾種應用於馬拉地語的主題模型方法。具體來說，我們比較了各種 BERT 和非 BERT 方法，包括多語言和單語言 BERT 模型，並使用主題一致性和主題多樣性作為評估指標。我們的分析提供了對這些方法在馬拉地語主題模型中的效能的見解。本文的主要發現是，BERTopic 與針對印度語言訓練的 BERT 模型結合使用時，在主題模型效能方面優於 LDA。", "author": "Sanket Shinde et.al.", "authors": "Sanket Shinde, Raviraj Joshi", "id": "2502.02100v1", "paper_url": "http://arxiv.org/abs/2502.02100v1", "repo": "null"}}