{"2410.11684": {"publish_time": "2024-10-15", "title": "Are UFOs Driving Innovation? The Illusion of Causality in Large Language Models", "paper_summary": "Illusions of causality occur when people develop the belief that there is a\ncausal connection between two variables with no supporting evidence. This\ncognitive bias has been proposed to underlie many societal problems including\nsocial prejudice, stereotype formation, misinformation and superstitious\nthinking. In this research we investigate whether large language models develop\nthe illusion of causality in real-world settings. We evaluated and compared\nnews headlines generated by GPT-4o-Mini, Claude-3.5-Sonnet, and Gemini-1.5-Pro\nto determine whether the models incorrectly framed correlations as causal\nrelationships. In order to also measure sycophantic behavior, which occurs when\na model aligns with a user's beliefs in order to look favorable even if it is\nnot objectively correct, we additionally incorporated the bias into the\nprompts, observing if this manipulation increases the likelihood of the models\nexhibiting the illusion of causality. We found that Claude-3.5-Sonnet is the\nmodel that presents the lowest degree of causal illusion aligned with\nexperiments on Correlation-to-Causation Exaggeration in human-written press\nreleases. On the other hand, our findings suggest that while mimicry sycophancy\nincreases the likelihood of causal illusions in these models, especially in\nGPT-4o-Mini, Claude-3.5-Sonnet remains the most robust against this cognitive\nbias.", "paper_summary_zh": "因果錯覺發生在人們發展出相信兩個變量之間存在因果關係，但沒有支持證據時。這個認知偏誤已被提出為許多社會問題的根源，包括社會偏見、刻板印象形成、錯誤訊息和迷信思考。在這項研究中，我們調查大型語言模型是否在現實世界中發展出因果錯覺。我們評估並比較了 GPT-4o-Mini、Claude-3.5-Sonnet 和 Gemini-1.5-Pro 生成的新聞標題，以確定這些模型是否錯誤地將相關性框定為因果關係。為了進一步衡量諂媚行為，當模型為了看起來有利而與使用者的信念一致，即使它在客觀上不正確時也會發生，我們另外將偏誤納入提示中，觀察這種操縱是否會增加模型表現出因果錯覺的可能性。我們發現 Claude-3.5-Sonnet 是表現出最低程度因果錯覺的模型，與人類撰寫的新聞稿中相關性到因果關係的誇大實驗一致。另一方面，我們的研究結果表明，雖然模仿諂媚會增加這些模型中因果錯覺的可能性，特別是在 GPT-4o-Mini 中，但 Claude-3.5-Sonnet 仍然對這種認知偏誤最具抵抗力。", "author": "María Victoria Carro et.al.", "authors": "María Victoria Carro, Francisca Gauna Selasco, Denise Alejandra Mester, Mario Alejandro Leiva", "id": "2410.11684v1", "paper_url": "http://arxiv.org/abs/2410.11684v1", "repo": "null"}}