{"2408.08619": {"publish_time": "2024-08-16", "title": "PatUntrack: Automated Generating Patch Examples for Issue Reports without Tracked Insecure Code", "paper_summary": "Security patches are essential for enhancing the stability and robustness of\nprojects in the software community. While vulnerabilities are officially\nexpected to be patched before being disclosed, patching vulnerabilities is\ncomplicated and remains a struggle for many organizations. To patch\nvulnerabilities, security practitioners typically track vulnerable issue\nreports (IRs), and analyze their relevant insecure code to generate potential\npatches. However, the relevant insecure code may not be explicitly specified\nand practitioners cannot track the insecure code in the repositories, thus\nlimiting their ability to generate patches. In such cases, providing examples\nof insecure code and the corresponding patches would benefit the security\ndevelopers to better locate and fix the insecure code. In this paper, we\npropose PatUntrack to automatically generating patch examples from IRs without\ntracked insecure code. It auto-prompts Large Language Models (LLMs) to make\nthem applicable to analyze the vulnerabilities. It first generates the\ncompleted description of the Vulnerability-Triggering Path (VTP) from\nvulnerable IRs. Then, it corrects hallucinations in the VTP description with\nexternal golden knowledge. Finally, it generates Top-K pairs of Insecure Code\nand Patch Example based on the corrected VTP description. To evaluate the\nperformance, we conducted experiments on 5,465 vulnerable IRs. The experimental\nresults show that PatUntrack can obtain the highest performance and improve the\ntraditional LLM baselines by +14.6% (Fix@10) on average in patch example\ngeneration. Furthermore, PatUntrack was applied to generate patch examples for\n76 newly disclosed vulnerable IRs. 27 out of 37 replies from the authors of\nthese IRs confirmed the usefulness of the patch examples generated by\nPatUntrack, indicating that they can benefit from these examples for patching\nthe vulnerabilities.", "paper_summary_zh": "<paragraph>安全修補程式對於提升軟體社群中專案的穩定性與健全性至關重要。雖然漏洞在被揭露之前官方預期會被修補，但修補漏洞很複雜，且對許多組織來說仍是一項挑戰。為了修補漏洞，安全從業人員通常會追蹤容易受攻擊的問題報告 (IR)，並分析其相關的不安全程式碼以產生潛在的修補程式。然而，相關的不安全程式碼可能沒有明確指定，從業人員也無法在儲存庫中追蹤不安全程式碼，因此限制了他們產生修補程式的能力。在這種情況下，提供不安全程式碼範例和對應修補程式將有助於安全開發人員更準確地找出並修復不安全程式碼。在本論文中，我們提出 PatUntrack，用於從沒有追蹤不安全程式碼的 IR 自動產生修補程式範例。它會自動提示大型語言模型 (LLM)，讓它們適用於分析漏洞。它首先從容易受攻擊的 IR 產生漏洞觸發路徑 (VTP) 的完整描述。接著，它會使用外部黃金知識修正 VTP 描述中的幻覺。最後，它會根據修正後的 VTP 描述產生不安全程式碼和修補程式範例的 Top-K 配對。為了評估效能，我們對 5,465 個容易受攻擊的 IR 進行實驗。實驗結果顯示，PatUntrack 可以獲得最高的效能，並在修補程式範例產生方面平均將傳統 LLM 基準提高 +14.6%（Fix@10）。此外，PatUntrack 已應用於為 76 個新揭露的容易受攻擊 IR 產生修補程式範例。這些 IR 作者的 37 封回覆中有 27 封確認了 PatUntrack 所產生的修補程式範例的實用性，這表示他們可以利用這些範例來修補漏洞。</paragraph>", "author": "Ziyou Jiang et.al.", "authors": "Ziyou Jiang, Lin Shi, Guowei Yang, Qing Wang", "id": "2408.08619v1", "paper_url": "http://arxiv.org/abs/2408.08619v1", "repo": "null"}}