{"2407.16160": {"publish_time": "2024-07-23", "title": "UniMEL: A Unified Framework for Multimodal Entity Linking with Large Language Models", "paper_summary": "Multimodal Entity Linking (MEL) is a crucial task that aims at linking\nambiguous mentions within multimodal contexts to the referent entities in a\nmultimodal knowledge base, such as Wikipedia. Existing methods focus heavily on\nusing complex mechanisms and extensive model tuning methods to model the\nmultimodal interaction on specific datasets. However, these methods\novercomplicate the MEL task and overlook the visual semantic information, which\nmakes them costly and hard to scale. Moreover, these methods can not solve the\nissues like textual ambiguity, redundancy, and noisy images, which severely\ndegrade their performance. Fortunately, the advent of Large Language Models\n(LLMs) with robust capabilities in text understanding and reasoning,\nparticularly Multimodal Large Language Models (MLLMs) that can process\nmultimodal inputs, provides new insights into addressing this challenge.\nHowever, how to design a universally applicable LLMs-based MEL approach remains\na pressing challenge. To this end, we propose UniMEL, a unified framework which\nestablishes a new paradigm to process multimodal entity linking tasks using\nLLMs. In this framework, we employ LLMs to augment the representation of\nmentions and entities individually by integrating textual and visual\ninformation and refining textual information. Subsequently, we employ the\nembedding-based method for retrieving and re-ranking candidate entities. Then,\nwith only ~0.26% of the model parameters fine-tuned, LLMs can make the final\nselection from the candidate entities. Extensive experiments on three public\nbenchmark datasets demonstrate that our solution achieves state-of-the-art\nperformance, and ablation studies verify the effectiveness of all modules. Our\ncode is available at https://anonymous.4open.science/r/UniMEL/.", "paper_summary_zh": "多模態實體連結 (MEL) 是一項重要的任務，旨在將多模態語境中的模糊提及連結到多模態知識庫（例如維基百科）中的指涉實體。現有方法非常依賴使用複雜的機制和廣泛的模型調整方法，對特定資料集上的多模態互動進行建模。然而，這些方法過於複雜化 MEL 任務，並且忽略了視覺語義資訊，這使得它們成本高昂且難以擴展。此外，這些方法無法解決文本歧義、冗餘和雜訊影像等問題，這嚴重降低了它們的效能。幸運的是，具有強大文字理解和推理能力的大語言模型 (LLM) 的出現，特別是可以處理多模態輸入的多模態大語言模型 (MLLM)，為解決此挑戰提供了新的見解。然而，如何設計一個普遍適用的基於 LLM 的 MEL 方法仍然是一個迫切的挑戰。為此，我們提出了 UniMEL，一個統一的框架，它建立了一個新的範例，使用 LLM 處理多模態實體連結任務。在此框架中，我們使用 LLM 來擴充提及和實體的表示，分別透過整合文字和視覺資訊，以及精煉文字資訊。隨後，我們採用基於嵌入的方法來檢索和重新排列候選實體。然後，在僅微調了約 0.26% 的模型參數後，LLM 可以從候選實體中做出最終選擇。在三個公開基準資料集上的廣泛實驗證明，我們的解決方案達到了最先進的效能，而消融研究驗證了所有模組的有效性。我們的程式碼可在 https://anonymous.4open.science/r/UniMEL/ 取得。", "author": "Liu Qi et.al.", "authors": "Liu Qi, He Yongyi, Lian Defu, Zheng Zhi, Xu Tong, Liu Che, Chen Enhong", "id": "2407.16160v1", "paper_url": "http://arxiv.org/abs/2407.16160v1", "repo": "null"}}