{"2407.18626": {"publish_time": "2024-07-26", "title": "Every Part Matters: Integrity Verification of Scientific Figures Based on Multimodal Large Language Models", "paper_summary": "This paper tackles a key issue in the interpretation of scientific figures:\nthe fine-grained alignment of text and figures. It advances beyond prior\nresearch that primarily dealt with straightforward, data-driven visualizations\nsuch as bar and pie charts and only offered a basic understanding of diagrams\nthrough captioning and classification. We introduce a novel task, Figure\nIntegrity Verification, designed to evaluate the precision of technologies in\naligning textual knowledge with visual elements in scientific figures. To\nsupport this, we develop a semi-automated method for constructing a large-scale\ndataset, Figure-seg, specifically designed for this task. Additionally, we\npropose an innovative framework, Every Part Matters (EPM), which leverages\nMultimodal Large Language Models (MLLMs) to not only incrementally improve the\nalignment and verification of text-figure integrity but also enhance integrity\nthrough analogical reasoning. Our comprehensive experiments show that these\ninnovations substantially improve upon existing methods, allowing for more\nprecise and thorough analysis of complex scientific figures. This progress not\nonly enhances our understanding of multimodal technologies but also stimulates\nfurther research and practical applications across fields requiring the\naccurate interpretation of complex visual data.", "paper_summary_zh": "這篇論文探討科學圖表解讀中的關鍵問題：文字和圖表的細粒度對齊。它超越了先前的研究，這些研究主要處理直接的、資料驅動的可視化，例如長條圖和圓餅圖，並且僅通過標題和分類提供了對圖表的基礎理解。我們引入了一項新任務，稱為圖表完整性驗證，旨在評估技術在將文字知識與科學圖表中的視覺元素對齊時的準確度。為了支持這一點，我們開發了一種半自動化的方法來構建一個專門為此任務設計的大規模資料集 Figure-seg。此外，我們提出了一個創新的框架，Every Part Matters (EPM)，它利用多模態大型語言模型 (MLLM) 不僅逐步改進文字圖表完整性的對齊和驗證，而且還通過類比推理增強完整性。我們的全面實驗表明，這些創新在現有方法的基礎上有了顯著的改進，允許對複雜的科學圖表進行更精確和徹底的分析。這項進展不僅增強了我們對多模態技術的理解，而且還激勵了跨領域的進一步研究和實際應用，這些領域需要準確解讀複雜的視覺資料。", "author": "Xiang Shi et.al.", "authors": "Xiang Shi, Jiawei Liu, Yinpeng Liu, Qikai Cheng, Wei Lu", "id": "2407.18626v1", "paper_url": "http://arxiv.org/abs/2407.18626v1", "repo": "null"}}