{"2501.04700": {"publish_time": "2025-01-08", "title": "Planarian Neural Networks: Evolutionary Patterns from Basic Bilateria Shaping Modern Artificial Neural Network Architectures", "paper_summary": "This study examined the viability of enhancing the prediction accuracy of\nartificial neural networks (ANNs) in image classification tasks by developing\nANNs with evolution patterns similar to those of biological neural networks.\nResNet is a widely used family of neural networks with both deep and wide\nvariants; therefore, it was selected as the base model for our investigation.\nThe aim of this study is to improve the image classification performance of\nANNs via a novel approach inspired by the biological nervous system\narchitecture of planarians, which comprises a brain and two nerve cords. We\nbelieve that the unique neural architecture of planarians offers valuable\ninsights into the performance enhancement of ANNs. The proposed planarian\nneural architecture-based neural network was evaluated on the CIFAR-10 and\nCIFAR-100 datasets. Our results indicate that the proposed method exhibits\nhigher prediction accuracy than the baseline neural network models in image\nclassification tasks. These findings demonstrate the significant potential of\nbiologically inspired neural network architectures in improving the performance\nof ANNs in a wide range of applications.", "paper_summary_zh": "本研究探討了透過開發具有與生物神經網路相似的演化模式的人工神經網路 (ANN)，來提升人工神經網路在影像分類任務中預測精確度的可行性。ResNet 是一個廣泛使用的神經網路系列，具有深層和廣泛的變異；因此，它被選為我們研究的基本模型。本研究的目的是透過一種新穎的方法來提升人工神經網路的影像分類效能，此方法的靈感來自於扁蟲的生物神經系統架構，其中包含一個大腦和兩條神經索。我們相信扁蟲獨特的神經架構能為提升人工神經網路的效能提供有價值的見解。所提出的基於扁蟲神經架構的神經網路在 CIFAR-10 和 CIFAR-100 資料集上進行評估。我們的結果顯示，所提出的方法在影像分類任務中展現出比基準神經網路模型更高的預測精確度。這些發現證明了受生物啟發的神經網路架構在提升人工神經網路在廣泛應用中的效能方面具有顯著的潛力。", "author": "Ziyuan Huang et.al.", "authors": "Ziyuan Huang, Mark Newman, Maria Vaida, Srikar Bellur, Roozbeh Sadeghian, Andrew Siu, Hui Wang, Kevin Huggins", "id": "2501.04700v1", "paper_url": "http://arxiv.org/abs/2501.04700v1", "repo": "null"}}