{"2412.13146": {"publish_time": "2024-12-17", "title": "Syntactic Transfer to Kyrgyz Using the Treebank Translation Method", "paper_summary": "The Kyrgyz language, as a low-resource language, requires significant effort\nto create high-quality syntactic corpora. This study proposes an approach to\nsimplify the development process of a syntactic corpus for Kyrgyz. We present a\ntool for transferring syntactic annotations from Turkish to Kyrgyz based on a\ntreebank translation method. The effectiveness of the proposed tool was\nevaluated using the TueCL treebank. The results demonstrate that this approach\nachieves higher syntactic annotation accuracy compared to a monolingual model\ntrained on the Kyrgyz KTMU treebank. Additionally, the study introduces a\nmethod for assessing the complexity of manual annotation for the resulting\nsyntactic trees, contributing to further optimization of the annotation\nprocess.", "paper_summary_zh": "吉爾吉斯語作為一種低資源語言，需要大量的努力才能建立高質量的句法語料庫。本研究提出了一種簡化吉爾吉斯語句法語料庫開發過程的方法。我們提出了一個基於樹庫翻譯方法，將土耳其語的句法註解轉移到吉爾吉斯語的工具。使用 TueCL 樹庫評估了所提出工具的有效性。結果表明，與在吉爾吉斯語 KTMU 樹庫上訓練的單語模型相比，這種方法實現了更高的句法註解準確度。此外，本研究還介紹了一種評估所得句法樹手動註解複雜性的方法，有助於進一步優化註解過程。", "author": "Anton Alekseev et.al.", "authors": "Anton Alekseev, Alina Tillabaeva, Gulnara Dzh. Kabaeva, Sergey I. Nikolenko", "id": "2412.13146v1", "paper_url": "http://arxiv.org/abs/2412.13146v1", "repo": "https://github.com/alexeyev/tratreetra"}}