{"2502.15226": {"publish_time": "2025-02-21", "title": "Understand User Opinions of Large Language Models via LLM-Powered In-the-Moment User Experience Interviews", "paper_summary": "Which large language model (LLM) is better? Every evaluation tells a story,\nbut what do users really think about current LLMs? This paper presents CLUE, an\nLLM-powered interviewer that conducts in-the-moment user experience interviews,\nright after users interacted with LLMs, and automatically gathers insights\nabout user opinions from massive interview logs. We conduct a study with\nthousands of users to understand user opinions on mainstream LLMs, recruiting\nusers to first chat with a target LLM and then interviewed by CLUE. Our\nexperiments demonstrate that CLUE captures interesting user opinions, for\nexample, the bipolar views on the displayed reasoning process of DeepSeek-R1\nand demands for information freshness and multi-modality. Our collected\nchat-and-interview logs will be released.", "paper_summary_zh": "哪個大型語言模型（LLM）較好？每次評估都會說一個故事，\n但使用者對目前的 LLM 實際上怎麼想？這篇論文提出 CLUE，一個由 LLM 驅動的訪談者，在使用者與 LLM 互動後立即進行當下的使用者體驗訪談，並從大量的訪談記錄中自動收集使用者意見的見解。我們進行一項有數千名使用者的研究，以了解使用者對主流 LLM 的意見，招募使用者先與目標 LLM 聊天，然後接受 CLUE 訪談。我們的實驗證明 CLUE 捕捉到有趣的使用者意見，例如對 DeepSeek-R1 顯示的推理過程的兩極看法，以及對資訊新鮮度和多模態性的需求。我們收集的聊天和訪談記錄將會發布。", "author": "Mengqiao Liu et.al.", "authors": "Mengqiao Liu, Tevin Wang, Cassandra A. Cohen, Sarah Li, Chenyan Xiong", "id": "2502.15226v1", "paper_url": "http://arxiv.org/abs/2502.15226v1", "repo": "null"}}