{"2410.09047": {"publish_time": "2024-10-11", "title": "Unraveling and Mitigating Safety Alignment Degradation of Vision-Language Models", "paper_summary": "The safety alignment ability of Vision-Language Models (VLMs) is prone to be\ndegraded by the integration of the vision module compared to its LLM backbone.\nWe investigate this phenomenon, dubbed as ''safety alignment degradation'' in\nthis paper, and show that the challenge arises from the representation gap that\nemerges when introducing vision modality to VLMs. In particular, we show that\nthe representations of multi-modal inputs shift away from that of text-only\ninputs which represent the distribution that the LLM backbone is optimized for.\nAt the same time, the safety alignment capabilities, initially developed within\nthe textual embedding space, do not successfully transfer to this new\nmulti-modal representation space. To reduce safety alignment degradation, we\nintroduce Cross-Modality Representation Manipulation (CMRM), an inference time\nrepresentation intervention method for recovering the safety alignment ability\nthat is inherent in the LLM backbone of VLMs, while simultaneously preserving\nthe functional capabilities of VLMs. The empirical results show that our\nframework significantly recovers the alignment ability that is inherited from\nthe LLM backbone with minimal impact on the fluency and linguistic capabilities\nof pre-trained VLMs even without additional training. Specifically, the unsafe\nrate of LLaVA-7B on multi-modal input can be reduced from 61.53% to as low as\n3.15% with only inference-time intervention.\n  WARNING: This paper contains examples of toxic or harmful language.", "paper_summary_zh": "視覺語言模型 (VLM) 的安全對齊能力容易受到視覺模組的整合而降低，而與其 LLM 主幹相比。\n我們在本文中探討這個現象，稱為「安全對齊劣化」，並表明這個挑戰來自於在 VLM 中引入視覺模式時出現的表示差距。特別是，我們表明多模式輸入的表示會偏離僅文本輸入的表示，而後者表示 LLM 主幹最佳化的分布。\n同時，最初在文本嵌入空間中開發的安全對齊能力，並未成功轉移到這個新的多模式表示空間。為了減少安全對齊劣化，我們引入了跨模態表示操作 (CMRM)，這是一種推論時間表示介入方法，用於恢復 VLM 的 LLM 主幹中固有的安全對齊能力，同時保留 VLM 的功能能力。經驗結果表明，我們的框架顯著恢復了從 LLM 主幹繼承的對齊能力，對預訓練 VLM 的流暢性和語言能力影響很小，即使沒有額外的訓練。具體來說，LLaVA-7B 在多模式輸入上的不安全率可以從 61.53% 降低到僅 3.15%，而僅需推論時間介入。\n警告：本文包含有毒或有害語言的範例。", "author": "Qin Liu et.al.", "authors": "Qin Liu, Chao Shang, Ling Liu, Nikolaos Pappas, Jie Ma, Neha Anna John, Srikanth Doss, Lluis Marquez, Miguel Ballesteros, Yassine Benajiba", "id": "2410.09047v1", "paper_url": "http://arxiv.org/abs/2410.09047v1", "repo": "null"}}