{"2405.20703": {"publish_time": "2024-05-31", "title": "It is Simple Sometimes: A Study On Improving Aspect-Based Sentiment Analysis Performance", "paper_summary": "Aspect-Based Sentiment Analysis (ABSA) involves extracting opinions from\ntextual data about specific entities and their corresponding aspects through\nvarious complementary subtasks. Several prior research has focused on\ndeveloping ad hoc designs of varying complexities for these subtasks. In this\npaper, we present a generative framework extensible to any ABSA subtask. We\nbuild upon the instruction tuned model proposed by Scaria et al. (2023), who\npresent an instruction-based model with task descriptions followed by\nin-context examples on ABSA subtasks. We propose PFInstruct, an extension to\nthis instruction learning paradigm by appending an NLP-related task prefix to\nthe task description. This simple approach leads to improved performance across\nall tested SemEval subtasks, surpassing previous state-of-the-art (SOTA) on the\nATE subtask (Rest14) by +3.28 F1-score, and on the AOOE subtask by an average\nof +5.43 F1-score across SemEval datasets. Furthermore, we explore the impact\nof the prefix-enhanced prompt quality on the ABSA subtasks and find that even a\nnoisy prefix enhances model performance compared to the baseline. Our method\nalso achieves competitive results on a biomedical domain dataset (ERSA).", "paper_summary_zh": "面向方面的观点分析 (ABSA) 涉及透過各種互補的子任務從文本資料中擷取特定實體及其對應方面的意見。許多先前的研究專注於為這些子任務開發具有不同複雜度的特定設計。在這篇論文中，我們提出一個可延伸至任何 ABSA 子任務的生成式架構。我們建立在 Scaria 等人 (2023) 提出的指令調整模型之上，他們提出一個基於指令的模型，其後接 ABSA 子任務的脈絡範例和任務說明。我們提出 PFInstruct，一種透過將與 NLP 相關的任務前置詞附加到任務說明中來延伸這個指令學習範例。這種簡單的方法可提升所有已測試 SemEval 子任務的效能，在 ATE 子任務 (Rest14) 上超越先前的最新技術 (SOTA) +3.28 F1 分數，在 AOOE 子任務上平均超越 SemEval 資料集 +5.43 F1 分數。此外，我們探討前置詞增強提示品質對 ABSA 子任務的影響，發現即使是有雜訊的前置詞，與基準線相比，也能提升模型效能。我們的模型在生物醫學領域資料集 (ERSA) 上也獲得有競爭力的結果。", "author": "Laura Cabello et.al.", "authors": "Laura Cabello, Uchenna Akujuobi", "id": "2405.20703v1", "paper_url": "http://arxiv.org/abs/2405.20703v1", "repo": "null"}}