{"2411.01710": {"publish_time": "2024-11-03", "title": "SPES: Spectrogram Perturbation for Explainable Speech-to-Text Generation", "paper_summary": "Spurred by the demand for interpretable models, research on eXplainable AI\nfor language technologies has experienced significant growth, with feature\nattribution methods emerging as a cornerstone of this progress. While prior\nwork in NLP explored such methods for classification tasks and textual\napplications, explainability intersecting generation and speech is lagging,\nwith existing techniques failing to account for the autoregressive nature of\nstate-of-the-art models and to provide fine-grained, phonetically meaningful\nexplanations. We address this gap by introducing Spectrogram Perturbation for\nExplainable Speech-to-text Generation (SPES), a feature attribution technique\napplicable to sequence generation tasks with autoregressive models. SPES\nprovides explanations for each predicted token based on both the input\nspectrogram and the previously generated tokens. Extensive evaluation on speech\nrecognition and translation demonstrates that SPES generates explanations that\nare faithful and plausible to humans.", "paper_summary_zh": "在可解釋模型需求的驅使下，語言技術的 eXplainable AI 研究已大幅成長，其中特徵歸因方法成為這項進展的基石。雖然先前的 NLP 研究探索了此類方法，用於分類任務和文字應用，但可解釋性與生成和語音的交集仍有待加強，現有技術無法考量最先進模型的自動回歸性質，也無法提供細緻且在語音學上有意義的解釋。我們透過導入可解釋語音轉文字生成的光譜圖擾動 (SPES) 來解決這個差距，這是一種特徵歸因技術，適用於具有自動回歸模型的序列生成任務。SPES 提供每個預測詞彙的解釋，根據輸入光譜圖和先前生成的詞彙。在語音辨識和翻譯方面的廣泛評估證明，SPES 生成的解釋對人類來說是忠實且合理的。", "author": "Dennis Fucci et.al.", "authors": "Dennis Fucci, Marco Gaido, Beatrice Savoldi, Matteo Negri, Mauro Cettolo, Luisa Bentivogli", "id": "2411.01710v1", "paper_url": "http://arxiv.org/abs/2411.01710v1", "repo": "null"}}