{"2412.15831": {"publish_time": "2024-12-20", "title": "Enriching Social Science Research via Survey Item Linking", "paper_summary": "Questions within surveys, called survey items, are used in the social\nsciences to study latent concepts, such as the factors influencing life\nsatisfaction. Instead of using explicit citations, researchers paraphrase the\ncontent of the survey items they use in-text. However, this makes it\nchallenging to find survey items of interest when comparing related work.\nAutomatically parsing and linking these implicit mentions to survey items in a\nknowledge base can provide more fine-grained references. We model this task,\ncalled Survey Item Linking (SIL), in two stages: mention detection and entity\ndisambiguation. Due to an imprecise definition of the task, existing datasets\nused for evaluating the performance for SIL are too small and of low-quality.\nWe argue that latent concepts and survey item mentions should be\ndifferentiated. To this end, we create a high-quality and richly annotated\ndataset consisting of 20,454 English and German sentences. By benchmarking deep\nlearning systems for each of the two stages independently and sequentially, we\ndemonstrate that the task is feasible, but observe that errors propagate from\nthe first stage, leading to a lower overall task performance. Moreover,\nmentions that require the context of multiple sentences are more challenging to\nidentify for models in the first stage. Modeling the entire context of a\ndocument and combining the two stages into an end-to-end system could mitigate\nthese problems in future work, and errors could additionally be reduced by\ncollecting more diverse data and by improving the quality of the knowledge\nbase. The data and code are available at https://github.com/e-tornike/SIL .", "paper_summary_zh": "<paragraph>在社會科學中，調查中的問題（稱為調查項目）用於研究潛在概念，例如影響生活滿意度的因素。研究人員沒有使用明確的引文，而是對他們在文中使用的調查項目的內容進行改寫。然而，在比較相關工作時，這使得找到有興趣的調查項目變得具有挑戰性。自動解析並將這些隱含提及與知識庫中的調查項目連結起來可以提供更精細的參考。我們將此任務稱為調查項目連結（SIL），分為兩個階段：提及偵測和實體消除歧義。由於任務定義不精確，用於評估 SIL 效能的現有資料集太小且品質低落。我們認為潛在概念和調查項目提及應該區分開來。為此，我們建立了一個高品質且豐富註解的資料集，包含 20,454 個英文和德文句子。透過獨立且順序地對兩個階段的深度學習系統進行基準測試，我們證明了此任務的可行性，但觀察到錯誤從第一階段傳播，導致整體任務效能降低。此外，需要多個句子背景的提及對於第一階段的模型來說更具挑戰性。建模文件的整個背景並將兩個階段結合到端到端系統中可以緩解未來工作中的這些問題，此外，透過收集更多樣化的資料和提高知識庫的品質，可以進一步減少錯誤。資料和程式碼可在 https://github.com/e-tornike/SIL 取得。</paragraph>", "author": "Tornike Tsereteli et.al.", "authors": "Tornike Tsereteli, Daniel Ruffinelli, Simone Paolo Ponzetto", "id": "2412.15831v1", "paper_url": "http://arxiv.org/abs/2412.15831v1", "repo": "https://github.com/e-tornike/sil"}}