{"2408.11338": {"publish_time": "2024-08-21", "title": "Automatic Dataset Construction (ADC): Sample Collection, Data Curation, and Beyond", "paper_summary": "Large-scale data collection is essential for developing personalized training\ndata, mitigating the shortage of training data, and fine-tuning specialized\nmodels. However, creating high-quality datasets quickly and accurately remains\na challenge due to annotation errors, the substantial time and costs associated\nwith human labor. To address these issues, we propose Automatic Dataset\nConstruction (ADC), an innovative methodology that automates dataset creation\nwith negligible cost and high efficiency. Taking the image classification task\nas a starting point, ADC leverages LLMs for the detailed class design and code\ngeneration to collect relevant samples via search engines, significantly\nreducing the need for manual annotation and speeding up the data generation\nprocess. Despite these advantages, ADC also encounters real-world challenges\nsuch as label errors (label noise) and imbalanced data distributions (label\nbias). We provide open-source software that incorporates existing methods for\nlabel error detection, robust learning under noisy and biased data, ensuring a\nhigher-quality training data and more robust model training procedure.\nFurthermore, we design three benchmark datasets focused on label noise\ndetection, label noise learning, and class-imbalanced learning. These datasets\nare vital because there are few existing datasets specifically for label noise\ndetection, despite its importance. Finally, we evaluate the performance of\nexisting popular methods on these datasets, thereby facilitating further\nresearch in the field.", "paper_summary_zh": "大規模數據收集對於開發個人化訓練資料、緩解訓練資料短缺以及微調專業模型至關重要。然而，由於標註錯誤、與人工勞動相關的龐大時間和成本，快速且準確地建立高品質的資料集仍然是一個挑戰。為了解決這些問題，我們提出了自動資料集建構 (ADC)，這是一種創新的方法，可以自動化資料集建立，且成本低且效率高。以影像分類任務作為起點，ADC 利用大型語言模型 (LLM) 進行詳細的類別設計和程式碼生成，以透過搜尋引擎收集相關樣本，大幅降低人工標註的需求，並加速資料產生流程。儘管有這些優點，ADC 也會遇到現實世界的挑戰，例如標籤錯誤（標籤雜訊）和不平衡的資料分佈（標籤偏差）。我們提供開源軟體，其中包含現有標籤錯誤偵測方法、在有雜訊和偏差資料下的穩健學習，確保更高品質的訓練資料和更穩健的模型訓練程序。此外，我們設計了三個基準資料集，專注於標籤雜訊偵測、標籤雜訊學習和類別不平衡學習。這些資料集至關重要，因為儘管標籤雜訊偵測很重要，但現有專門針對標籤雜訊偵測的資料集很少。最後，我們評估了這些資料集上現有熱門方法的效能，從而促進該領域的進一步研究。", "author": "Minghao Liu et.al.", "authors": "Minghao Liu, Zonglin Di, Jiaheng Wei, Zhongruo Wang, Hengxiang Zhang, Ruixuan Xiao, Haoyu Wang, Jinlong Pang, Hao Chen, Ankit Shah, Hongxin Wei, Xinlei He, Zhaowei Zhao, Haobo Wang, Lei Feng, Jindong Wang, James Davis, Yang Liu", "id": "2408.11338v1", "paper_url": "http://arxiv.org/abs/2408.11338v1", "repo": "null"}}