{"2405.20962": {"publish_time": "2024-05-31", "title": "Large Language Models are Zero-Shot Next Location Predictors", "paper_summary": "Predicting the locations an individual will visit in the future is crucial\nfor solving many societal issues like disease diffusion and reduction of\npollution among many others. The models designed to tackle next-location\nprediction, however, require a significant amount of individual-level\ninformation to be trained effectively. Such data may be scarce or even\nunavailable in some geographic regions or peculiar scenarios (e.g., cold-start\nin recommendation systems). Moreover, the design of a next-location predictor\nable to generalize or geographically transfer knowledge is still an open\nresearch challenge. Recent advances in natural language processing have led to\na rapid diffusion of Large Language Models (LLMs) which have shown good\ngeneralization and reasoning capabilities. These insights, coupled with the\nrecent findings that LLMs are rich in geographical knowledge, allowed us to\nbelieve that these models can act as zero-shot next-location predictors. This\npaper evaluates the capabilities of many popular LLMs in this role,\nspecifically Llama, GPT-3.5 and Mistral 7B. After designing a proper prompt, we\ntested the models on three real-world mobility datasets. The results show that\nLLMs can obtain accuracies up to 32.4%, a significant relative improvement of\nover 600% when compared to sophisticated DL models specifically designed for\nhuman mobility. Moreover, we show that other LLMs are unable to perform the\ntask properly. To prevent positively biased results, we also propose a\nframework inspired by other studies to test data contamination. Finally, we\nexplored the possibility of using LLMs as text-based explainers for\nnext-location prediction showing that can effectively provide an explanation\nfor their decision. Notably, 7B models provide more generic, but still\nreliable, explanations compared to larger counterparts. Code:\ngithub.com/ssai-trento/LLM-zero-shot-NL", "paper_summary_zh": "預測個人未來會造訪的地點對於解決許多社會問題至關重要，例如疾病擴散和減少污染等。然而，用於解決下一個地點預測的模型需要大量的個人層級資訊才能有效地進行訓練。此類資料在某些地理區域或特殊情況（例如推薦系統中的冷啟動）中可能稀缺甚至不可用。此外，設計一個能夠推廣或在地理上傳遞知識的下一個地點預測器仍然是一個開放的研究挑戰。自然語言處理的最新進展導致大型語言模型 (LLM) 的快速擴散，這些模型已展現出良好的概括和推理能力。這些見解加上最近發現的 LLM 豐富的地理知識，讓我們相信這些模型可以用作零次下一個地點預測器。本文評估許多流行的 LLM 在此角色中的能力，特別是 Llama、GPT-3.5 和 Mistral 7B。在設計適當的提示後，我們在三個真實世界流動性資料集上測試了這些模型。結果表明，與專門為人類流動性設計的複雜深度學習模型相比，LLM 可以獲得高達 32.4% 的準確度，相對改善超過 600%。此外，我們表明其他 LLM 無法適當地執行任務。為了防止產生正向偏誤的結果，我們還提出了受其他研究啟發的架構來測試資料污染。最後，我們探討了將 LLM 用作基於文字的解釋器以進行下一個地點預測的可能性，表明可以有效地對其決策提供解釋。值得注意的是，與較大的對應模型相比，7B 模型提供了更通用的，但仍然可靠的解釋。程式碼：github.com/ssai-trento/LLM-zero-shot-NL", "author": "Ciro Beneduce et.al.", "authors": "Ciro Beneduce, Bruno Lepri, Massimiliano Luca", "id": "2405.20962v1", "paper_url": "http://arxiv.org/abs/2405.20962v1", "repo": "https://github.com/ssai-trento/llm-zero-shot-nl"}}