{"2407.18538": {"publish_time": "2024-07-26", "title": "Towards a Multidimensional Evaluation Framework for Empathetic Conversational Systems", "paper_summary": "Empathetic Conversational Systems (ECS) are built to respond empathetically\nto the user's emotions and sentiments, regardless of the application domain.\nCurrent ECS studies evaluation approaches are restricted to offline evaluation\nexperiments primarily for gold standard comparison & benchmarking, and user\nevaluation studies for collecting human ratings on specific constructs. These\nmethods are inadequate in measuring the actual quality of empathy in\nconversations. In this paper, we propose a multidimensional empathy evaluation\nframework with three new methods for measuring empathy at (i) structural level\nusing three empathy-related dimensions, (ii) behavioral level using empathy\nbehavioral types, and (iii) overall level using an empathy lexicon, thereby\nfortifying the evaluation process. Experiments were conducted with the\nstate-of-the-art ECS models and large language models (LLMs) to show the\nframework's usefulness.", "paper_summary_zh": "同理心對話系統（ECS）旨在對使用者的情緒和感受做出同理心的回應，不論應用領域為何。目前的 ECS 研究評估方法僅限於離線評估實驗，主要是用於黃金標準比較和基準測試，以及使用者評估研究，以收集特定建構的人類評分。這些方法無法充分衡量對話中的同理心實際品質。在本文中，我們提出一個多面向的同理心評估架構，包含三種新的方法，用於衡量同理心，包括（一）使用三個同理心相關面向的結構層級、（二）使用同理心行為類型的行為層級，以及（三）使用同理心詞彙的整體層級，從而強化評估流程。我們使用最先進的 ECS 模型和大型語言模型（LLM）進行實驗，以顯示此架構的實用性。", "author": "Aravind Sesagiri Raamkumar et.al.", "authors": "Aravind Sesagiri Raamkumar, Siyuan Brandon Loh", "id": "2407.18538v1", "paper_url": "http://arxiv.org/abs/2407.18538v1", "repo": "null"}}