{"2410.23843": {"publish_time": "2024-10-31", "title": "Reasons and Solutions for the Decline in Model Performance after Editing", "paper_summary": "Knowledge editing technology has received widespread attention for low-cost\nupdates of incorrect or outdated knowledge in large-scale language models.\nHowever, recent research has found that edited models often exhibit varying\ndegrees of performance degradation. The reasons behind this phenomenon and\npotential solutions have not yet been provided. In order to investigate the\nreasons for the performance decline of the edited model and optimize the\nediting method, this work explores the underlying reasons from both data and\nmodel perspectives. Specifically, 1) from a data perspective, to clarify the\nimpact of data on the performance of editing models, this paper first\nconstructs a Multi-Question Dataset (MQD) to evaluate the impact of different\ntypes of editing data on model performance. The performance of the editing\nmodel is mainly affected by the diversity of editing targets and sequence\nlength, as determined through experiments. 2) From a model perspective, this\narticle explores the factors that affect the performance of editing models. The\nresults indicate a strong correlation between the L1-norm of the editing model\nlayer and the editing accuracy, and clarify that this is an important factor\nleading to the bottleneck of editing performance. Finally, in order to improve\nthe performance of the editing model, this paper further proposes a Dump for\nSequence (D4S) method, which successfully overcomes the previous editing\nbottleneck by reducing the L1-norm of the editing layer, allowing users to\nperform multiple effective edits and minimizing model damage. Our code is\navailable at https://github.com/nlpkeg/D4S.", "paper_summary_zh": "知識編輯技術因其低成本更新大型語言模型中不正確或過時的知識而廣受關注。然而，最近的研究發現，經過編輯的模型經常表現出不同程度的效能下降。這種現象背後的原因和潛在解決方案尚未提供。為了探究編輯模型效能下降的原因並最佳化編輯方法，本文從資料和模型的角度探討其背後原因。具體來說，1) 從資料的角度來看，為了釐清資料對編輯模型效能的影響，本文首先建構一個多問題資料集 (MQD) 來評估不同類型的編輯資料對模型效能的影響。實驗結果確定，編輯模型的效能主要受編輯目標的多樣性和序列長度影響。2) 從模型的角度來看，本文探討影響編輯模型效能的因素。結果顯示編輯模型層的 L1-norm 與編輯準確度之間有很強的相關性，並釐清這是導致編輯效能瓶頸的重要因素。最後，為了提升編輯模型的效能，本文進一步提出一個序列轉儲 (D4S) 方法，透過降低編輯層的 L1-norm 成功克服先前的編輯瓶頸，讓使用者能夠執行多個有效的編輯並將模型損害降至最低。我們的程式碼可在 https://github.com/nlpkeg/D4S 取得。", "author": "Xiusheng Huang et.al.", "authors": "Xiusheng Huang, Jiaxiang Liu, Yequan Wang, Kang Liu", "id": "2410.23843v1", "paper_url": "http://arxiv.org/abs/2410.23843v1", "repo": "https://github.com/nlpkeg/D4S"}}