{"2501.00910": {"publish_time": "2025-01-01", "title": "Population Aware Diffusion for Time Series Generation", "paper_summary": "Diffusion models have shown promising ability in generating high-quality time\nseries (TS) data. Despite the initial success, existing works mostly focus on\nthe authenticity of data at the individual level, but pay less attention to\npreserving the population-level properties on the entire dataset. Such\npopulation-level properties include value distributions for each dimension and\ndistributions of certain functional dependencies (e.g., cross-correlation, CC)\nbetween different dimensions. For instance, when generating house energy\nconsumption TS data, the value distributions of the outside temperature and the\nkitchen temperature should be preserved, as well as the distribution of CC\nbetween them. Preserving such TS population-level properties is critical in\nmaintaining the statistical insights of the datasets, mitigating model bias,\nand augmenting downstream tasks like TS prediction. Yet, it is often overlooked\nby existing models. Hence, data generated by existing models often bear\ndistribution shifts from the original data. We propose Population-aware\nDiffusion for Time Series (PaD-TS), a new TS generation model that better\npreserves the population-level properties. The key novelties of PaD-TS include\n1) a new training method explicitly incorporating TS population-level property\npreservation, and 2) a new dual-channel encoder model architecture that better\ncaptures the TS data structure. Empirical results in major benchmark datasets\nshow that PaD-TS can improve the average CC distribution shift score between\nreal and synthetic data by 5.9x while maintaining a performance comparable to\nstate-of-the-art models on individual-level authenticity.", "paper_summary_zh": "擴散模型已展現出產生高品質時間序列 (TS) 資料的潛力。儘管有初步的成功，現有作品大多關注資料在個別層級的真實性，但較少注意保留整個資料集的族群層級屬性。此類族群層級屬性包括每個維度的值分佈，以及不同維度之間特定函數依賴性（例如，互相關係，CC）的分佈。例如，在產生房屋能源消耗 TS 資料時，應保留外部溫度和廚房溫度的值分佈，以及它們之間的 CC 分佈。保留此類 TS 族群層級屬性對於維護資料集的統計見解、減輕模型偏差，以及擴充時間序列預測等下游任務至關重要。然而，現有模型常常忽略這一點。因此，現有模型產生的資料通常會與原始資料產生分佈轉移。我們提出適用於時間序列的族群感知擴散 (PaD-TS)，這是一種新的 TS 產生模型，可以更好地保留族群層級屬性。PaD-TS 的主要創新包括 1) 一種新的訓練方法，明確納入 TS 族群層級屬性保留，以及 2) 一種新的雙通道編碼器模型架構，可以更好地擷取 TS 資料結構。主要基準資料集中的經驗結果顯示，PaD-TS 可以將真實資料與合成資料之間的平均 CC 分佈轉移分數提高 5.9 倍，同時在個別層級真實性上維持與最先進模型相當的效能。", "author": "Yang Li et.al.", "authors": "Yang Li, Han Meng, Zhenyu Bi, Ingolv T. Urnes, Haipeng Chen", "id": "2501.00910v1", "paper_url": "http://arxiv.org/abs/2501.00910v1", "repo": "https://github.com/wmd3i/PaD-TS"}}