{"2412.19422": {"publish_time": "2024-12-27", "title": "Gx2Mol: De Novo Generation of Hit-like Molecules from Gene Expression Profiles via Deep Learning", "paper_summary": "De novo generation of hit-like molecules is a challenging task in the drug\ndiscovery process. Most methods in previous studies learn the semantics and\nsyntax of molecular structures by analyzing molecular graphs or simplified\nmolecular input line entry system (SMILES) strings; however, they do not take\ninto account the drug responses of the biological systems consisting of genes\nand proteins. In this study we propose a deep generative model, Gx2Mol, which\nutilizes gene expression profiles to generate molecular structures with\ndesirable phenotypes for arbitrary target proteins. In the algorithm, a\nvariational autoencoder is employed as a feature extractor to learn the latent\nfeature distribution of the gene expression profiles. Then, a long short-term\nmemory is leveraged as the chemical generator to produce syntactically valid\nSMILES strings that satisfy the feature conditions of the gene expression\nprofile extracted by the feature extractor. Experimental results and case\nstudies demonstrate that the proposed Gx2Mol model can produce new molecules\nwith potential bioactivities and drug-like properties.", "paper_summary_zh": "從頭產生類命中分子是藥物發現過程中的一項艱鉅任務。以前的研究中，大多數方法透過分析分子圖或簡化的分子輸入線條輸入系統 (SMILES) 字串來學習分子結構的語意和語法；然而，它們沒有考慮由基因和蛋白質組成的生物系統的藥物反應。在本研究中，我們提出了一個深度生成模型 Gx2Mol，它利用基因表現特徵檔來產生具有任意目標蛋白質所需表型的分子結構。在演算法中，變分自動編碼器被用作特徵萃取器，以學習基因表現特徵檔的潛在特徵分佈。然後，利用長短期記憶作為化學生成器來產生符合特徵萃取器萃取的基因表現特徵檔特徵條件的語法上有效的 SMILES 字串。實驗結果和案例研究表明，所提出的 Gx2Mol 模型可以產生具有潛在生物活性和類藥物特性的新分子。", "author": "Chen Li et.al.", "authors": "Chen Li, Yuki Matsukiyo, Yoshihiro Yamanishi", "id": "2412.19422v1", "paper_url": "http://arxiv.org/abs/2412.19422v1", "repo": "https://github.com/naruto7283/gx2mol"}}