{"2502.09104": {"publish_time": "2025-02-13", "title": "One-shot Federated Learning Methods: A Practical Guide", "paper_summary": "One-shot Federated Learning (OFL) is a distributed machine learning paradigm\nthat constrains client-server communication to a single round, addressing\nprivacy and communication overhead issues associated with multiple rounds of\ndata exchange in traditional Federated Learning (FL). OFL demonstrates the\npractical potential for integration with future approaches that require\ncollaborative training models, such as large language models (LLMs). However,\ncurrent OFL methods face two major challenges: data heterogeneity and model\nheterogeneity, which result in subpar performance compared to conventional FL\nmethods. Worse still, despite numerous studies addressing these limitations, a\ncomprehensive summary is still lacking. To address these gaps, this paper\npresents a systematic analysis of the challenges faced by OFL and thoroughly\nreviews the current methods. We also offer an innovative categorization method\nand analyze the trade-offs of various techniques. Additionally, we discuss the\nmost promising future directions and the technologies that should be integrated\ninto the OFL field. This work aims to provide guidance and insights for future\nresearch.", "paper_summary_zh": "單次聯邦學習 (OFL) 是一種分散式機器學習範例，將客戶端與伺服器通訊限制在單一輪次中，解決傳統聯邦學習 (FL) 中多輪次資料交換相關的隱私和通訊負擔問題。OFL 展示了與需要協作訓練模型的未來方法整合的實際潛力，例如大型語言模型 (LLM)。然而，目前的 OFL 方法面臨兩大挑戰：資料異質性和模型異質性，這導致與傳統 FL 方法相比，效能較差。更糟的是，儘管有許多研究探討這些限制，但仍缺乏全面的摘要。為了解決這些差距，本文對 OFL 面臨的挑戰進行系統分析，並徹底檢視目前的方法。我們還提供創新的分類方法，並分析各種技術的權衡取捨。此外，我們討論最有希望的未來方向，以及應整合到 OFL 領域的技術。這項工作旨在為未來的研究提供指導和見解。", "author": "Xiang Liu et.al.", "authors": "Xiang Liu, Zhenheng Tang, Xia Li, Yijun Song, Sijie Ji, Zemin Liu, Bo Han, Linshan Jiang, Jialin Li", "id": "2502.09104v1", "paper_url": "http://arxiv.org/abs/2502.09104v1", "repo": "null"}}