{"2410.04853": {"publish_time": "2024-10-07", "title": "TimeCNN: Refining Cross-Variable Interaction on Time Point for Time Series Forecasting", "paper_summary": "Time series forecasting is extensively applied across diverse domains.\nTransformer-based models demonstrate significant potential in modeling\ncross-time and cross-variable interaction. However, we notice that the\ncross-variable correlation of multivariate time series demonstrates\nmultifaceted (positive and negative correlations) and dynamic progression over\ntime, which is not well captured by existing Transformer-based models. To\naddress this issue, we propose a TimeCNN model to refine cross-variable\ninteractions to enhance time series forecasting. Its key innovation is\ntimepoint-independent, where each time point has an independent convolution\nkernel, allowing each time point to have its independent model to capture\nrelationships among variables. This approach effectively handles both positive\nand negative correlations and adapts to the evolving nature of variable\nrelationships over time. Extensive experiments conducted on 12 real-world\ndatasets demonstrate that TimeCNN consistently outperforms state-of-the-art\nmodels. Notably, our model achieves significant reductions in computational\nrequirements (approximately 60.46%) and parameter count (about 57.50%), while\ndelivering inference speeds 3 to 4 times faster than the benchmark iTransformer\nmodel", "paper_summary_zh": "時序預測廣泛應用於各個領域。\n基於 Transformer 的模型在建模跨時間和跨變數交互方面展現出顯著的潛力。然而，我們注意到多變數時序的跨變數相關性呈現多方面的（正相關和負相關）和動態進展，這一點並未被現有的基於 Transformer 的模型很好地捕捉到。為了解決這個問題，我們提出了一個 TimeCNN 模型來優化跨變數交互以增強時序預測。其關鍵創新是時間點無關的，其中每個時間點都有獨立的卷積核，允許每個時間點擁有自己的獨立模型來捕捉變數之間的關係。這種方法有效地處理正相關和負相關，並適應變數關係隨時間推移而變化的本質。在 12 個真實世界資料集上進行的大量實驗表明，TimeCNN 持續優於最先進的模型。值得注意的是，我們的模型在計算需求（約 60.46%）和參數計數（約 57.50%）方面實現了顯著的降低，同時提供比基準 iTransformer 模型快 3 到 4 倍的推理速度", "author": "Ao Hu et.al.", "authors": "Ao Hu, Dongkai Wang, Yong Dai, Shiyi Qi, Liangjian Wen, Jun Wang, Zhi Chen, Xun Zhou, Zenglin Xu, Jiang Duan", "id": "2410.04853v1", "paper_url": "http://arxiv.org/abs/2410.04853v1", "repo": "null"}}