{"2406.01238": {"publish_time": "2024-06-03", "title": "EffiQA: Efficient Question-Answering with Strategic Multi-Model Collaboration on Knowledge Graphs", "paper_summary": "While large language models (LLMs) have shown remarkable capabilities in\nnatural language processing, they struggle with complex, multi-step reasoning\ntasks involving knowledge graphs (KGs). Existing approaches that integrate LLMs\nand KGs either underutilize the reasoning abilities of LLMs or suffer from\nprohibitive computational costs due to tight coupling. To address these\nlimitations, we propose a novel collaborative framework named EffiQA that can\nstrike a balance between performance and efficiency via an iterative paradigm.\nEffiQA consists of three stages: global planning, efficient KG exploration, and\nself-reflection. Specifically, EffiQA leverages the commonsense capability of\nLLMs to explore potential reasoning pathways through global planning. Then, it\noffloads semantic pruning to a small plug-in model for efficient KG\nexploration. Finally, the exploration results are fed to LLMs for\nself-reflection to further improve the global planning and efficient KG\nexploration. Empirical evidence on multiple KBQA benchmarks shows EffiQA's\neffectiveness, achieving an optimal balance between reasoning accuracy and\ncomputational costs. We hope the proposed new framework will pave the way for\nefficient, knowledge-intensive querying by redefining the integration of LLMs\nand KGs, fostering future research on knowledge-based question answering.", "paper_summary_zh": "儘管大型語言模型（LLM）在自然語言處理中展現出卓越的能力，但它們在涉及知識圖譜（KG）的複雜多步驟推理任務中仍有困難。現有的整合 LLM 和 KG 的方法，不是低估 LLM 的推理能力，就是因為緊密結合而導致高昂的運算成本。為了解決這些限制，我們提出一個名為 EffiQA 的創新協作架構，它可以透過一個反覆運算的模式，在效能和效率之間取得平衡。EffiQA 包含三個階段：全域規劃、高效 KG 探索和自我反省。具體來說，EffiQA 利用 LLM 的常識能力，透過全域規劃來探索潛在的推理路徑。然後，它將語義剪枝卸載給一個小型外掛程式模型，以進行高效的 KG 探索。最後，將探索結果回饋給 LLM 以進行自我反省，以進一步改善全域規劃和高效 KG 探索。在多個 KBQA 基準上的實證證據顯示了 EffiQA 的有效性，在推理準確性和運算成本之間取得了最佳平衡。我們希望所提出的新架構，透過重新定義 LLM 和 KG 的整合，為高效、知識密集的查詢鋪路，促進未來基於知識的問答研究。", "author": "Zixuan Dong et.al.", "authors": "Zixuan Dong, Baoyun Peng, Yufei Wang, Jia Fu, Xiaodong Wang, Yongxue Shan, Xin Zhou", "id": "2406.01238v1", "paper_url": "http://arxiv.org/abs/2406.01238v1", "repo": "null"}}