{"2406.07217": {"publish_time": "2024-06-11", "title": "A Synthetic Dataset for Personal Attribute Inference", "paper_summary": "Recently, powerful Large Language Models (LLMs) have become easily accessible\nto hundreds of millions of users worldwide. However, their strong capabilities\nand vast world knowledge do not come without associated privacy risks. In this\nwork, we focus on the emerging privacy threat LLMs pose - the ability to\naccurately infer personal information from online texts. Despite the growing\nimportance of LLM-based author profiling, research in this area has been\nhampered by a lack of suitable public datasets, largely due to ethical and\nprivacy concerns associated with real personal data. In this work, we take two\nsteps to address this problem: (i) we construct a simulation framework for the\npopular social media platform Reddit using LLM agents seeded with synthetic\npersonal profiles; (ii) using this framework, we generate SynthPAI, a diverse\nsynthetic dataset of over 7800 comments manually labeled for personal\nattributes. We validate our dataset with a human study showing that humans\nbarely outperform random guessing on the task of distinguishing our synthetic\ncomments from real ones. Further, we verify that our dataset enables meaningful\npersonal attribute inference research by showing across 18 state-of-the-art\nLLMs that our synthetic comments allow us to draw the same conclusions as\nreal-world data. Together, this indicates that our dataset and pipeline provide\na strong and privacy-preserving basis for future research toward understanding\nand mitigating the inference-based privacy threats LLMs pose.", "paper_summary_zh": "<paragraph>最近，功能强大的大型语言模型（LLM）已变得容易被全球数亿用户所使用。然而，它们强大的功能和广泛的世界知识并非没有相关的隐私风险。在这项工作中，我们关注 LLM 构成的日益严重的隐私威胁——从在线文本中准确推断个人信息的能力。尽管基于 LLM 的作者画像日益重要，但由于与真实个人数据相关的道德和隐私问题，该领域的研究一直受到缺乏合适的公共数据集的阻碍。在这项工作中，我们采取两步来解决这个问题：(i) 我们使用植入了合成个人资料的 LLM 代理构建了一个流行的社交媒体平台 Reddit 的模拟框架；(ii) 使用这个框架，我们生成了 SynthPAI，这是一个多样化的合成数据集，其中超过 7800 条评论被手动标记为个人属性。我们通过一项人类研究验证了我们的数据集，该研究表明，人类在区分我们的合成评论和真实评论的任务上几乎无法胜过随机猜测。此外，我们验证了我们的数据集能够进行有意义的个人属性推断研究，方法是在 18 个最先进的 LLM 中展示我们的合成评论使我们能够得出与现实世界数据相同的结论。总之，这表明我们的数据集和管道为未来的研究提供了强大且保护隐私的基础，以了解和减轻基于推理的 LLM 隐私威胁。</paragraph>", "author": "Hanna Yukhymenko et.al.", "authors": "Hanna Yukhymenko, Robin Staab, Mark Vero, Martin Vechev", "id": "2406.07217v1", "paper_url": "http://arxiv.org/abs/2406.07217v1", "repo": "null"}}