{"2410.10508": {"publish_time": "2024-10-14", "title": "Everyday Speech in the Indian Subcontinent", "paper_summary": "India has 1369 languages of which 22 are official. About 13 different scripts\nare used to represent these languages. A Common Label Set (CLS) was developed\nbased on phonetics to address the issue of large vocabulary of units required\nin the End to End (E2E) framework for multilingual synthesis. This reduced the\nfootprint of the synthesizer and also enabled fast adaptation to new languages\nwhich had similar phonotactics, provided language scripts belonged to the same\nfamily. In this paper, we provide new insights into speech synthesis, where the\nscript belongs to one family, while the phonotactics comes from another. Indian\nlanguage text is first converted to CLS, and then a synthesizer that matches\nthe phonotactics of the language is used. Quality akin to that of a native\nspeaker is obtained for Sanskrit and Konkani with zero adaptation data, using\nKannada and Marathi synthesizers respectively. Further, this approach also\nlends itself seamless code switching across 13 Indian languages and English in\na given native speaker's voice.", "paper_summary_zh": "印度有 1369 種語言，其中 22 種是官方語言。約有 13 種不同的文字用於表示這些語言。基於語音學開發了一個通用標籤集 (CLS)，以解決多語言合成端到端 (E2E) 框架中所需的龐大單元詞彙量問題。這減少了合成器的佔用空間，並且還能夠快速適應新語言，這些新語言具有相似的音韻，前提是語言文字屬於同一語系。在本文中，我們提供了對語音合成的新的見解，其中文字屬於一個語系，而音韻來自另一個語系。印度語言文本首先轉換為 CLS，然後使用與語言音韻相匹配的合成器。使用卡納達語和馬拉地語合成器，分別為梵語和孔卡尼語獲得了接近母語人士的品質，而無需適應數據。此外，這種方法還可以在給定的母語人士的聲音中在 13 種印度語言和英語之間進行無縫的代碼切換。", "author": "Utkarsh Pathak et.al.", "authors": "Utkarsh Pathak, Chandra Sai Krishna Gunda, Sujitha Sathiyamoorthy, Keshav Agarwal, Hema A. Murthy", "id": "2410.10508v1", "paper_url": "http://arxiv.org/abs/2410.10508v1", "repo": "null"}}