{"2405.08681": {"publish_time": "2024-05-14", "title": "Achieving Fairness Through Channel Pruning for Dermatological Disease Diagnosis", "paper_summary": "Numerous studies have revealed that deep learning-based medical image\nclassification models may exhibit bias towards specific demographic attributes,\nsuch as race, gender, and age. Existing bias mitigation methods often achieve\nhigh level of fairness at the cost of significant accuracy degradation. In\nresponse to this challenge, we propose an innovative and adaptable Soft Nearest\nNeighbor Loss-based channel pruning framework, which achieves fairness through\nchannel pruning. Traditionally, channel pruning is utilized to accelerate\nneural network inference. However, our work demonstrates that pruning can also\nbe a potent tool for achieving fairness. Our key insight is that different\nchannels in a layer contribute differently to the accuracy of different groups.\nBy selectively pruning critical channels that lead to the accuracy difference\nbetween the privileged and unprivileged groups, we can effectively improve\nfairness without sacrificing accuracy significantly. Experiments conducted on\ntwo skin lesion diagnosis datasets across multiple sensitive attributes\nvalidate the effectiveness of our method in achieving state-of-the-art\ntrade-off between accuracy and fairness. Our code is available at\nhttps://github.com/Kqp1227/Sensitive-Channel-Pruning.", "paper_summary_zh": "許多研究顯示，基於深度學習的醫療影像分類模型可能會對特定人口屬性（例如種族、性別和年齡）表現出偏見。現有的偏見緩解方法通常以大幅降低準確度為代價，來達成高度的公平性。為了應對此挑戰，我們提出一個創新的、可適應的基於 Soft Nearest Neighbor Loss 的通道剪枝框架，透過通道剪枝來實現公平性。傳統上，通道剪枝用於加速神經網路推論。然而，我們的研究證明，剪枝也可以成為實現公平性的有力工具。我們的關鍵見解是，一層中的不同通道對不同群組的準確度有不同的貢獻。透過選擇性地剪枝導致特權群組和非特權群組之間準確度差異的重要通道，我們可以有效地提高公平性，而不會顯著犧牲準確度。在兩個皮膚病變診斷資料集上進行的實驗，涵蓋多個敏感屬性，驗證了我們的方法在準確度和公平性之間取得最先進的權衡的有效性。我們的程式碼可在 https://github.com/Kqp1227/Sensitive-Channel-Pruning 取得。", "author": "Qingpeng Kong et.al.", "authors": "Qingpeng Kong, Ching-Hao Chiu, Dewen Zeng, Yu-Jen Chen, Tsung-Yi Ho, Jingtong hu, Yiyu Shi", "id": "2405.08681v1", "paper_url": "http://arxiv.org/abs/2405.08681v1", "repo": "https://github.com/kqp1227/sensitive-channel-pruning"}}