{"2412.20741": {"publish_time": "2024-12-30", "title": "Depression and Anxiety Prediction Using Deep Language Models and Transfer Learning", "paper_summary": "Digital screening and monitoring applications can aid providers in the\nmanagement of behavioral health conditions. We explore deep language models for\ndetecting depression, anxiety, and their co-occurrence from conversational\nspeech collected during 16k user interactions with an application. Labels come\nfrom PHQ-8 and GAD-7 results also collected by the application. We find that\nresults for binary classification range from 0.86 to 0.79 AUC, depending on\ncondition and co-occurrence. Best performance is achieved when a user has\neither both or neither condition, and we show that this result is not\nattributable to data skew. Finally, we find evidence suggesting that underlying\nword sequence cues may be more salient for depression than for anxiety.", "paper_summary_zh": "數位篩檢和監控應用程式能協助醫療保健提供者管理行為健康狀況。我們探索深度語言模型，以從 16k 使用者與應用程式的對話中偵測憂鬱症、焦慮症及其共病。標籤來自應用程式同時收集的 PHQ-8 和 GAD-7 結果。我們發現二元分類的結果範圍從 0.86 到 0.79 AUC，取決於狀況和共病。當使用者同時有或沒有這兩種狀況時，會達到最佳效能，而我們顯示這個結果並非歸因於資料偏差。最後，我們發現證據顯示，潛在的詞彙順序線索可能對憂鬱症比對焦慮症更顯著。", "author": "Tomasz Rutowski et.al.", "authors": "Tomasz Rutowski, Elizabeth Shriberg, Amir Harati, Yang Lu, Piotr Chlebek, Ricardo Oliveira", "id": "2412.20741v1", "paper_url": "http://arxiv.org/abs/2412.20741v1", "repo": "null"}}