{"2407.20360": {"publish_time": "2024-07-29", "title": "Evaluating Large Language Models for automatic analysis of teacher simulations", "paper_summary": "Digital Simulations (DS) provide safe environments where users interact with\nan agent through conversational prompts, providing engaging learning\nexperiences that can be used to train teacher candidates in realistic classroom\nscenarios. These simulations usually include open-ended questions, allowing\nteacher candidates to express their thoughts but complicating an automatic\nresponse analysis. To address this issue, we have evaluated Large Language\nModels (LLMs) to identify characteristics (user behaviors) in the responses of\nDS for teacher education. We evaluated the performance of DeBERTaV3 and Llama\n3, combined with zero-shot, few-shot, and fine-tuning. Our experiments\ndiscovered a significant variation in the LLMs' performance depending on the\ncharacteristic to identify. Additionally, we noted that DeBERTaV3 significantly\nreduced its performance when it had to identify new characteristics. In\ncontrast, Llama 3 performed better than DeBERTaV3 in detecting new\ncharacteristics and showing more stable performance. Therefore, in DS where\nteacher educators need to introduce new characteristics because they change\ndepending on the simulation or the educational objectives, it is more\nrecommended to use Llama 3. These results can guide other researchers in\nintroducing LLMs to provide the highly demanded automatic evaluations in DS.", "paper_summary_zh": "數位模擬 (DS) 提供安全的環境，使用者透過對話提示與代理互動，提供引人入勝的學習體驗，可用於在逼真的教室場景中訓練教師候選人。這些模擬通常包含開放式問題，允許教師候選人表達他們的想法，但會使自動回應分析變得複雜。為了解決這個問題，我們評估了大型語言模型 (LLM)，以識別 DS 回應中教師教育的特徵（使用者行為）。我們評估了 DeBERTaV3 和 Llama 3 的效能，並結合了零次學習、少次學習和微調。我們的實驗發現，LLM 的效能會根據要識別的特徵而有顯著差異。此外，我們注意到 DeBERTaV3 在必須識別新特徵時，其效能會顯著下降。相反地，Llama 3 在偵測新特徵和展現更穩定的效能方面，表現優於 DeBERTaV3。因此，在教師教育者需要引入新特徵的 DS 中，因為這些特徵會根據模擬或教育目標而改變，建議使用 Llama 3。這些結果可以引導其他研究人員將 LLM 引入 DS 中，以提供高度需求的自動評估。", "author": "David de-Fitero-Dominguez et.al.", "authors": "David de-Fitero-Dominguez, Mariano Albaladejo-González, Antonio Garcia-Cabot, Eva Garcia-Lopez, Antonio Moreno-Cediel, Erin Barno, Justin Reich", "id": "2407.20360v1", "paper_url": "http://arxiv.org/abs/2407.20360v1", "repo": "null"}}