{"2412.18298": {"publish_time": "2024-12-24", "title": "Quo Vadis, Anomaly Detection? LLMs and VLMs in the Spotlight", "paper_summary": "Video anomaly detection (VAD) has witnessed significant advancements through\nthe integration of large language models (LLMs) and vision-language models\n(VLMs), addressing critical challenges such as interpretability, temporal\nreasoning, and generalization in dynamic, open-world scenarios. This paper\npresents an in-depth review of cutting-edge LLM-/VLM-based methods in 2024,\nfocusing on four key aspects: (i) enhancing interpretability through semantic\ninsights and textual explanations, making visual anomalies more understandable;\n(ii) capturing intricate temporal relationships to detect and localize dynamic\nanomalies across video frames; (iii) enabling few-shot and zero-shot detection\nto minimize reliance on large, annotated datasets; and (iv) addressing\nopen-world and class-agnostic anomalies by using semantic understanding and\nmotion features for spatiotemporal coherence. We highlight their potential to\nredefine the landscape of VAD. Additionally, we explore the synergy between\nvisual and textual modalities offered by LLMs and VLMs, highlighting their\ncombined strengths and proposing future directions to fully exploit the\npotential in enhancing video anomaly detection.", "paper_summary_zh": "影片異常偵測 (VAD) 透過整合大型語言模型 (LLM) 和視覺語言模型 (VLM)，在可解釋性、時序推理和動態開放世界場景中的概括等關鍵挑戰上取得顯著進展。本文深入探討 2024 年尖端的 LLM-/VLM- 基礎方法，重點關注四個面向：(i) 透過語意見解和文字說明增強可解釋性，讓視覺異常更易於理解；(ii) 捕捉複雜的時間關係，以偵測和定位影片格中的動態異常；(iii) 啟用少樣本和零樣本偵測，以減少對大型標註資料集的依賴；(iv) 透過語意理解和動作特徵解決開放世界和與類別無關的異常，以實現時空一致性。我們強調它們重新定義 VAD 領域的潛力。此外，我們探討 LLM 和 VLM 提供的視覺和文字模態之間的綜效，重點說明它們結合的優勢，並提出未來方向，以充分發揮增強影片異常偵測的潛力。", "author": "Xi Ding et.al.", "authors": "Xi Ding, Lei Wang", "id": "2412.18298v1", "paper_url": "http://arxiv.org/abs/2412.18298v1", "repo": "null"}}