{"2410.03524": {"publish_time": "2024-10-04", "title": "Steering Large Language Models between Code Execution and Textual Reasoning", "paper_summary": "While a lot of recent research focuses on enhancing the textual reasoning\ncapabilities of Large Language Models (LLMs) by optimizing the multi-agent\nframework or reasoning chains, several benchmark tasks can be solved with 100%\nsuccess through direct coding, which is more scalable and avoids the\ncomputational overhead associated with textual iterating and searching. Textual\nreasoning has inherent limitations in solving tasks with challenges in math,\nlogics, optimization, and searching, which is unlikely to be solved by simply\nscaling up the model and data size. The recently released OpenAI GPT Code\nInterpreter and multi-agent frameworks such as AutoGen have demonstrated\nremarkable proficiency of integrating code generation and execution to solve\ncomplex tasks using LLMs. However, based on our experiments on 7 existing\npopular methods for steering code/text generation in both single- and\nmulti-turn settings with 14 tasks and 6 types of LLMs (including the new\nO1-preview), currently there is no optimal method to correctly steer LLMs to\nwrite code when needed. We discover some interesting patterns on when models\nuse code vs. textual reasoning with the evolution to task complexity and model\nsizes, which even result in an astonishingly inverse scaling law. We also\ndiscover that results from LLM written code are not always better than using\ntextual reasoning, even if the task could be solved through code. To mitigate\nthe above issues, we propose three methods to better steer LLM code/text\ngeneration and achieve a notable improvement. The costs of token lengths and\nruntime are thoroughly discussed for all the methods. We believe the problem of\nsteering LLM code/text generation is critical for future research and has much\nspace for further improvement. Project Page, Datasets, and Codes are available\nat https://yongchao98.github.io/CodeSteer/.", "paper_summary_zh": "<paragraph>儘管許多近期研究專注於透過最佳化多重代理架構或推理鏈來增強大型語言模型 (LLM) 的文字推理能力，但幾個基準任務可透過直接編碼解決，並獲得 100% 的成功率，這更具可擴充性，並避免與文字反覆運算及搜尋相關的運算開銷。文字推理在解決數學、邏輯、最佳化和搜尋等挑戰任務時有其固有限制，這不太可能透過單純擴充模型和資料大小來解決。最近發布的 OpenAI GPT 程式碼解譯器和 AutoGen 等多重代理架構已展示出整合程式碼產生和執行以使用 LLM 解決複雜任務的顯著能力。然而，根據我們對 7 種現有流行方法的實驗，這些方法用於在單回合和多回合設定中引導程式碼/文字產生，並使用 14 項任務和 6 種類型的 LLM（包括新的 O1-preview），目前沒有最佳方法可以正確引導 LLM 在需要時撰寫程式碼。我們發現了一些有趣的模式，說明模型何時使用程式碼相對於文字推理，以及任務複雜度和模型大小的演變，這甚至導致了一個驚人的反向擴充法則。我們還發現，即使任務可以透過程式碼解決，LLM 編寫程式碼的結果並不總是優於使用文字推理。為了減輕上述問題，我們提出了三種方法來更好地引導 LLM 程式碼/文字產生，並獲得顯著的改進。所有方法的權杖長度和執行時間成本都經過徹底討論。我們相信引導 LLM 程式碼/文字產生的問題對於未來的研究至關重要，並且有很大的改進空間。專案頁面、資料集和程式碼可在 https://yongchao98.github.io/CodeSteer/ 取得。</paragraph>", "author": "Yongchao Chen et.al.", "authors": "Yongchao Chen, Harsh Jhamtani, Srinagesh Sharma, Chuchu Fan, Chi Wang", "id": "2410.03524v1", "paper_url": "http://arxiv.org/abs/2410.03524v1", "repo": "null"}}