{"2502.13652": {"publish_time": "2025-02-19", "title": "C2T: A Classifier-Based Tree Construction Method in Speculative Decoding", "paper_summary": "The growing scale of Large Language Models (LLMs) has exacerbated inference\nlatency and computational costs. Speculative decoding methods, which aim to\nmitigate these issues, often face inefficiencies in the construction of token\ntrees and the verification of candidate tokens. Existing strategies, including\nchain mode, static tree, and dynamic tree approaches, have limitations in\naccurately preparing candidate token trees for verification. We propose a novel\nmethod named C2T that adopts a lightweight classifier to generate and prune\ntoken trees dynamically. Our classifier considers additional feature variables\nbeyond the commonly used joint probability to predict the confidence score for\neach draft token to determine whether it is the candidate token for\nverification. This method outperforms state-of-the-art (SOTA) methods such as\nEAGLE-2 on multiple benchmarks, by reducing the total number of candidate\ntokens by 25% while maintaining or even improving the acceptance length.", "paper_summary_zh": "大型語言模型 (LLM) 的規模日益擴大，加劇了推論延遲和運算成本。推測性解碼方法旨在緩解這些問題，但通常在令牌樹的建構和候選令牌的驗證過程中會遇到效率低下的問題。現有的策略，包括鏈模式、靜態樹和動態樹方法，在準確準備候選令牌樹以進行驗證方面存在限制。我們提出了一種名為 C2T 的新方法，它採用一個輕量級分類器來動態生成和修剪令牌樹。我們的分類器考慮了除了常用聯合機率之外的其他特徵變數，以預測每個草稿令牌的信心分數，以確定它是否是要驗證的候選令牌。此方法在多個基準測試中優於最先進 (SOTA) 方法，例如 EAGLE-2，它將候選令牌的總數減少了 25%，同時維持或甚至改善了接受長度。", "author": "Feiye Huo et.al.", "authors": "Feiye Huo, Jianchao Tan, Kefeng Zhang, Xunliang Cai, Shengli Sun", "id": "2502.13652v1", "paper_url": "http://arxiv.org/abs/2502.13652v1", "repo": "null"}}