{"2410.02656": {"publish_time": "2024-10-03", "title": "Scalable Simulation-free Entropic Unbalanced Optimal Transport", "paper_summary": "The Optimal Transport (OT) problem investigates a transport map that connects\ntwo distributions while minimizing a given cost function. Finding such a\ntransport map has diverse applications in machine learning, such as generative\nmodeling and image-to-image translation. In this paper, we introduce a scalable\nand simulation-free approach for solving the Entropic Unbalanced Optimal\nTransport (EUOT) problem. We derive the dynamical form of this EUOT problem,\nwhich is a generalization of the Schr\\\"odinger bridges (SB) problem. Based on\nthis, we derive dual formulation and optimality conditions of the EUOT problem\nfrom the stochastic optimal control interpretation. By leveraging these\nproperties, we propose a simulation-free algorithm to solve EUOT, called\nSimulation-free EUOT (SF-EUOT). While existing SB models require expensive\nsimulation costs during training and evaluation, our model achieves\nsimulation-free training and one-step generation by utilizing the reciprocal\nproperty. Our model demonstrates significantly improved scalability in\ngenerative modeling and image-to-image translation tasks compared to previous\nSB methods.", "paper_summary_zh": "最佳運輸 (OT) 問題研究了一種運輸映射，它連接了兩個分佈，同時最小化給定的成本函數。找到這樣的運輸映射在機器學習中具有廣泛的應用，例如生成模型和圖像到圖像的翻譯。在本文中，我們介紹了一種可擴充且無需模擬的方法來解決熵不平衡最佳運輸 (EUOT) 問題。我們推導了這個 EUOT 問題的動態形式，它是薛丁格橋 (SB) 問題的推廣。基於此，我們從隨機最優控制解釋中推導出 EUOT 問題的對偶公式和最優條件。通過利用這些屬性，我們提出了一個無需模擬的演算法來解決 EUOT，稱為無需模擬 EUOT (SF-EUOT)。雖然現有的 SB 模型在訓練和評估過程中需要昂貴的模擬成本，但我們的模型通過利用互惠屬性實現了無需模擬的訓練和一步生成。與先前的 SB 方法相比，我們的模型在生成模型和圖像到圖像翻譯任務中展示了顯著提高的可擴充性。", "author": "Jaemoo Choi et.al.", "authors": "Jaemoo Choi, Jaewoong Choi", "id": "2410.02656v1", "paper_url": "http://arxiv.org/abs/2410.02656v1", "repo": "null"}}