{"2503.04713": {"publish_time": "2025-03-06", "title": "Scaling Rich Style-Prompted Text-to-Speech Datasets", "paper_summary": "We introduce Paralinguistic Speech Captions (ParaSpeechCaps), a large-scale\ndataset that annotates speech utterances with rich style captions. While rich\nabstract tags (e.g. guttural, nasal, pained) have been explored in small-scale\nhuman-annotated datasets, existing large-scale datasets only cover basic tags\n(e.g. low-pitched, slow, loud). We combine off-the-shelf text and speech\nembedders, classifiers and an audio language model to automatically scale rich\ntag annotations for the first time. ParaSpeechCaps covers a total of 59 style\ntags, including both speaker-level intrinsic tags and utterance-level\nsituational tags. It consists of 342 hours of human-labelled data (PSC-Base)\nand 2427 hours of automatically annotated data (PSC-Scaled). We finetune\nParler-TTS, an open-source style-prompted TTS model, on ParaSpeechCaps, and\nachieve improved style consistency (+7.9% Consistency MOS) and speech quality\n(+15.5% Naturalness MOS) over the best performing baseline that combines\nexisting rich style tag datasets. We ablate several of our dataset design\nchoices to lay the foundation for future work in this space. Our dataset,\nmodels and code are released at https://github.com/ajd12342/paraspeechcaps .", "paper_summary_zh": "我們介紹了Paralinguistic Speech Captions (ParaSpeechCaps)，這是一個帶有豐富風格標記的語音語料的大型資料集。雖然在小型人工標記資料集中已經探索了豐富的抽象標籤（例如，喉音、鼻音、痛苦），但現有的大型資料集僅涵蓋基本標籤（例如，低沉、緩慢、響亮）。我們結合了現成的文本和語音嵌入器、分類器和音訊語言模型，首次自動擴展豐富的標籤註釋。ParaSpeechCaps 共涵蓋 59 種風格標籤，包括說話者層面的內在標籤和語句層面的情境標籤。它包含 342 小時的人工標記數據 (PSC-Base) 和 2427 小時的自動標記數據 (PSC-Scaled)。我們在 ParaSpeechCaps 上微調了 Parler-TTS，這是一個開源的風格提示 TTS 模型，與結合現有豐富風格標籤資料集的最佳性能基準相比，實現了更高的風格一致性（+7.9% 一致性 MOS）和語音質量（+15.5% 自然度 MOS）。我們刪除了我們資料集設計中的幾個選項，為該領域的未來工作奠定了基礎。我們的資料集、模型和程式碼已發佈在 https://github.com/ajd12342/paraspeechcaps。\n", "author": "Anuj Diwan et.al.", "authors": "Anuj Diwan, Zhisheng Zheng, David Harwath, Eunsol Choi", "id": "2503.04713v1", "paper_url": "http://arxiv.org/abs/2503.04713v1", "repo": "null"}}