{"2501.00152": {"publish_time": "2024-12-30", "title": "Temporal reasoning for timeline summarisation in social media", "paper_summary": "This paper explores whether enhancing temporal reasoning capabilities in\nLarge Language Models (LLMs) can improve the quality of timeline summarization,\nthe task of summarising long texts containing sequences of events, particularly\nsocial media threads . We introduce \\textit{NarrativeReason}, a novel dataset\nfocused on temporal relationships among sequential events within narratives,\ndistinguishing it from existing temporal reasoning datasets that primarily\naddress pair-wise event relationships. Our approach then combines temporal\nreasoning with timeline summarization through a knowledge distillation\nframework, where we first fine-tune a teacher model on temporal reasoning tasks\nand then distill this knowledge into a student model while simultaneously\ntraining it for the task of timeline summarization. Experimental results\ndemonstrate that our model achieves superior performance on mental\nhealth-related timeline summarization tasks, which involve long social media\nthreads with repetitions of events and a mix of emotions, highlighting the\nimportance of leveraging temporal reasoning to improve timeline summarisation.", "paper_summary_zh": "這篇論文探討增強大型語言模型 (LLM) 中的時間推理能力是否能提升時間軸摘要的品質，時間軸摘要是針對包含事件順序的長篇文字進行摘要的任務，尤其是社群媒體串。我們引進了\\textit{NarrativeReason}，這個新穎的資料集專注於敘述中順序事件之間的時間關係，並將其與現有的時間推理資料集區分開來，後者主要處理成對的事件關係。我們的做法接著透過知識萃取架構將時間推理與時間軸摘要結合，我們首先針對時間推理任務微調一個教師模型，然後將此知識萃取到一個學生模型中，同時訓練它進行時間軸摘要的任務。實驗結果顯示我們的模型在與心理健康相關的時間軸摘要任務中獲得了卓越的表現，這涉及到包含重複事件和各種情緒的長篇社群媒體串，強調了利用時間推理來提升時間軸摘要的重要性。", "author": "Jiayu Song et.al.", "authors": "Jiayu Song, Mahmud Akhter, Dana Atzil Slonim, Maria Liakata", "id": "2501.00152v1", "paper_url": "http://arxiv.org/abs/2501.00152v1", "repo": "null"}}