{"2407.20700": {"publish_time": "2024-07-30", "title": "Industrial-Grade Smart Troubleshooting through Causal Technical Language Processing: a Proof of Concept", "paper_summary": "This paper describes the development of a causal diagnosis approach for\ntroubleshooting an industrial environment on the basis of the technical\nlanguage expressed in Return on Experience records. The proposed method\nleverages the vectorized linguistic knowledge contained in the distributed\nrepresentation of a Large Language Model, and the causal associations entailed\nby the embedded failure modes and mechanisms of the industrial assets. The\npaper presents the elementary but essential concepts of the solution, which is\nconceived as a causality-aware retrieval augmented generation system, and\nillustrates them experimentally on a real-world Predictive Maintenance setting.\nFinally, it discusses avenues of improvement for the maturity of the utilized\ncausal technology to meet the robustness challenges of increasingly complex\nscenarios in the industry.", "paper_summary_zh": "本文描述了在經驗回饋記錄中表達的技術語言基礎上，開發了一種因果診斷方法，用於對工業環境進行故障排除。所提出的方法利用了大型語言模型的分布式表示中包含的向量化語言知識，以及工業資產的嵌入故障模式和機制所帶來的因果關聯。本文提出了解決方案的基本但必要的概念，該解決方案被認為是一種因果感知檢索增強生成系統，並在現實世界的預測性維護設置中對其進行了實驗性說明。最後，它討論了所利用因果技術的成熟度改進途徑，以應對工業中日益複雜的場景的魯棒性挑戰。", "author": "Alexandre Trilla et.al.", "authors": "Alexandre Trilla, Ossee Yiboe, Nenad Mijatovic, Jordi Vitrià", "id": "2407.20700v1", "paper_url": "http://arxiv.org/abs/2407.20700v1", "repo": "null"}}