{"2410.17875": {"publish_time": "2024-10-23", "title": "Understanding Layer Significance in LLM Alignment", "paper_summary": "Aligning large language models (LLMs) through fine-tuning is essential for\ntailoring them to specific applications. Therefore, understanding what LLMs\nlearn during the alignment process is crucial. Recent studies suggest that\nalignment primarily adjusts a model's presentation style rather than its\nfoundational knowledge, indicating that only certain components of the model\nare significantly impacted. To delve deeper into LLM alignment, we propose to\nidentify which layers within LLMs are most critical to the alignment process,\nthereby uncovering how alignment influences model behavior at a granular level.\nWe propose a novel approach to identify the important layers for LLM alignment\n(ILA). It involves learning a binary mask for each incremental weight matrix in\nthe LoRA algorithm, indicating the significance of each layer. ILA consistently\nidentifies important layers across various alignment datasets, with nearly 90%\noverlap even with substantial dataset differences, highlighting fundamental\npatterns in LLM alignment. Experimental results indicate that freezing\nnon-essential layers improves overall model performance, while selectively\ntuning the most critical layers significantly enhances fine-tuning efficiency\nwith minimal performance loss.", "paper_summary_zh": "透過微調來調整大型語言模型 (LLM) 對於將其量身打造為特定應用程式至關重要。因此，了解 LLM 在調整過程中學習到的內容至關重要。最近的研究表明，調整主要調整模型的呈現風格，而不是其基礎知識，這表示模型只有某些組成部分會受到顯著影響。為了更深入探討 LLM 調整，我們建議找出 LLM 中哪些層級對調整過程最為關鍵，從而揭示調整如何影響模型行為的細微層面。我們提出了一種新穎的方法來找出對 LLM 調整很重要的層級 (ILA)。它涉及在 LoRA 演算法中為每個遞增權重矩陣學習一個二進制遮罩，表示每個層級的重要性。ILA 在各種調整資料集上持續找出重要的層級，即使資料集差異很大，重疊率也接近 90%，突顯了 LLM 調整中的基本模式。實驗結果表明，凍結非必要的層級會改善整體模型效能，而有選擇性地調整最關鍵的層級會顯著提升微調效率，效能損失極小。", "author": "Guangyuan Shi et.al.", "authors": "Guangyuan Shi, Zexin Lu, Xiaoyu Dong, Wenlong Zhang, Xuanyu Zhang, Yujie Feng, Xiao-Ming Wu", "id": "2410.17875v1", "paper_url": "http://arxiv.org/abs/2410.17875v1", "repo": "null"}}