{"2412.07430": {"publish_time": "2024-12-10", "title": "Knowledge Graph Guided Evaluation of Abstention Techniques", "paper_summary": "To deploy language models safely, it is crucial that they abstain from\nresponding to inappropriate requests. Several prior studies test the safety\npromises of models based on their effectiveness in blocking malicious requests.\nIn this work, we focus on evaluating the underlying techniques that cause\nmodels to abstain. We create SELECT, a benchmark derived from a set of benign\nconcepts (e.g., \"rivers\") from a knowledge graph. The nature of SELECT enables\nus to isolate the effects of abstention techniques from other safety training\nprocedures, as well as evaluate their generalization and specificity. Using\nSELECT, we benchmark different abstention techniques over six open-weight and\nclosed-source models. We find that the examined techniques indeed cause models\nto abstain with over $80\\%$ abstention rates. However, these techniques are not\nas effective for descendants of the target concepts, with refusal rates\ndeclining by $19\\%$. We also characterize the generalization-vs-specificity\ntrade-offs for different techniques. Overall, no single technique is invariably\nbetter than the others. Our findings call for a careful evaluation of different\naspects of abstention, and hopefully inform practitioners of various trade-offs\ninvolved.", "paper_summary_zh": "為了安全地部署語言模型，至關重要的是，它們必須避免回應不適當的請求。先前有數項研究測試模型的安全性，依據它們封鎖惡意請求的有效性為基礎。在這項工作中，我們專注於評估導致模型避免回應的底層技術。我們建立了 SELECT，一個從知識圖譜中一組良性概念（例如「河流」）衍生的基準。SELECT 的性質使我們能夠將避免回應技術的影響與其他安全訓練程序隔離，並評估它們的概括性和特異性。使用 SELECT，我們對六個開放權重和封閉原始碼模型進行了不同避免回應技術的基準測試。我們發現，所檢查的技術確實導致模型避免回應，避免回應率超過 80%。然而，這些技術對於目標概念的後代並不那麼有效，拒絕率下降了 19%。我們還描述了不同技術的概括性與特異性權衡。總體而言，沒有任何單一技術始終優於其他技術。我們的發現要求仔細評估避免回應的不同面向，並希望讓從業人員了解所涉及的各種權衡。", "author": "Kinshuk Vasisht et.al.", "authors": "Kinshuk Vasisht, Navreet Kaur, Danish Pruthi", "id": "2412.07430v1", "paper_url": "http://arxiv.org/abs/2412.07430v1", "repo": "null"}}