{"2405.12617": {"publish_time": "2024-05-21", "title": "Quantifying Emergence in Large Language Models", "paper_summary": "Emergence, broadly conceptualized as the ``intelligent'' behaviors of LLMs,\nhas recently been studied and proved challenging to quantify due to the lack of\na measurable definition. Most commonly, it has been estimated statistically\nthrough model performances across extensive datasets and tasks, which consumes\nsignificant resources. In addition, such estimation is difficult to interpret\nand may not accurately reflect the models' intrinsic emergence. In this work,\nwe propose a quantifiable solution for estimating emergence. Inspired by\nemergentism in dynamics, we quantify the strength of emergence by comparing the\nentropy reduction of the macroscopic (semantic) level with that of the\nmicroscopic (token) level, both of which are derived from the representations\nwithin the transformer block. Using a low-cost estimator, our quantification\nmethod demonstrates consistent behaviors across a suite of LMs (GPT-2, GEMMA,\netc.) under both in-context learning (ICL) and natural sentences. Empirical\nresults show that (1) our method gives consistent measurements which align with\nexisting observations based on performance metrics, validating the\neffectiveness of our emergence quantification; (2) our proposed metric uncovers\nnovel emergence patterns such as the correlations between the variance of our\nmetric and the number of ``shots'' in ICL, which further suggests a new way of\ninterpreting hallucinations in LLMs; (3) we offer a potential solution towards\nestimating the emergence of larger and closed-resource LMs via smaller LMs like\nGPT-2. Our codes are available at:\nhttps://github.com/Zodiark-ch/Emergence-of-LLMs/.", "paper_summary_zh": "<paragraph>出現，廣泛概念化為 LLM 的「智慧」行為，\n最近已被研究並證實難以量化，因為缺乏可衡量的定義。最常見的是，它已透過模型在廣泛的資料集和任務中的表現統計估計，這消耗了大量的資源。此外，這種估計難以解釋，可能無法準確反映模型的內在出現。在這項工作中，我們提出了估計出現的可量化解決方案。受到動力學出現主義的啟發，我們透過比較巨觀（語義）層級和微觀（符號）層級的熵減少來量化出現的強度，兩者都來自於Transformer區塊中的表示。使用低成本估計器，我們的量化方法展示了在情境學習 (ICL) 和自然句子的情況下，在 LMs（GPT-2、GEMMA 等）中的一致行為。實證結果顯示，（1）我們的量化方法與基於效能指標的現有觀察結果一致，驗證了我們出現量化的有效性；（2）我們提出的指標揭示了新的出現模式，例如我們的指標的變異數與 ICL 中「次數」之間的相關性，進一步提出了解釋 LLM 中幻覺的新方法；（3）我們提供了一個潛在的解決方案，透過較小的 LLM（例如 GPT-2）來估計較大且封閉資源的 LLM 的出現。我們的程式碼可在以下位置取得：\nhttps://github.com/Zodiark-ch/Emergence-of-LLMs/.</paragraph>", "author": "Hang Chen et.al.", "authors": "Hang Chen, Xinyu Yang, Jiaying Zhu, Wenya Wang", "id": "2405.12617v1", "paper_url": "http://arxiv.org/abs/2405.12617v1", "repo": "https://github.com/zodiark-ch/emergence-of-llms"}}