{"2408.10943": {"publish_time": "2024-08-20", "title": "SysBench: Can Large Language Models Follow System Messages?", "paper_summary": "Large Language Models (LLMs) have become instrumental across various\napplications, with the customization of these models to specific scenarios\nbecoming increasingly critical. System message, a fundamental component of\nLLMs, is consist of carefully crafted instructions that guide the behavior of\nmodel to meet intended goals. Despite the recognized potential of system\nmessages to optimize AI-driven solutions, there is a notable absence of a\ncomprehensive benchmark for evaluating how well different LLMs follow these\nsystem messages. To fill this gap, we introduce SysBench, a benchmark that\nsystematically analyzes system message following ability in terms of three\nchallenging aspects: constraint complexity, instruction misalignment and\nmulti-turn stability. In order to enable effective evaluation, SysBench\nconstructs multi-turn user conversations covering various interaction\nrelationships, based on six common types of constraints from system messages in\nreal-world scenarios. Our dataset contains 500 system messages from various\ndomains, each paired with 5 turns of user conversations, which have been\nmanually formulated and checked to guarantee high quality. SysBench provides\nextensive evaluation across various LLMs, measuring their ability to follow\nspecified constraints given in system messages. The results highlight both the\nstrengths and weaknesses of existing models, offering key insights and\ndirections for future research. The open source library SysBench is available\nat https://github.com/PKU-Baichuan-MLSystemLab/SysBench.", "paper_summary_zh": "大型語言模型 (LLM) 已成為各種應用程式中的重要工具，而這些模型的客製化已變得越來越重要。系統訊息是 LLM 的基本組成部分，由精心設計的指令組成，用於引導模型的行為以達成預期的目標。儘管系統訊息在最佳化 AI 驅動解決方案方面具有公認的潛力，但仍缺乏一個全面的基準來評估不同 LLM 如何遵循這些系統訊息。為了填補這個空白，我們引入了 SysBench，這是一個基準，它從三個具有挑戰性的方面系統性地分析系統訊息的遵循能力：約束複雜性、指令未對齊和多輪穩定性。為了進行有效的評估，SysBench 建構了涵蓋各種互動關係的多輪使用者對話，這些對話基於系統訊息中來自真實世界場景的六種類型約束。我們的資料集包含來自不同領域的 500 則系統訊息，每則訊息都與 5 輪使用者對話配對，這些對話已手動制定並檢查，以確保高品質。SysBench 提供了對各種 LLM 的廣泛評估，衡量它們遵循系統訊息中指定約束的能力。結果突出了現有模型的優點和缺點，為未來的研究提供了關鍵見解和方向。開放原始碼程式庫 SysBench 可在 https://github.com/PKU-Baichuan-MLSystemLab/SysBench 取得。", "author": "Yanzhao Qin et.al.", "authors": "Yanzhao Qin, Tao Zhang, Tao Zhang, Yanjun Shen, Wenjing Luo, Haoze Sun, Yan Zhang, Yujing Qiao, Weipeng Chen, Zenan Zhou, Wentao Zhang, Bin Cui", "id": "2408.10943v1", "paper_url": "http://arxiv.org/abs/2408.10943v1", "repo": "https://github.com/pku-baichuan-mlsystemlab/sysbench"}}