{"2408.03746": {"publish_time": "2024-08-07", "title": "Flexible Bayesian Last Layer Models Using Implicit Priors and Diffusion Posterior Sampling", "paper_summary": "Bayesian Last Layer (BLL) models focus solely on uncertainty in the output\nlayer of neural networks, demonstrating comparable performance to more complex\nBayesian models. However, the use of Gaussian priors for last layer weights in\nBayesian Last Layer (BLL) models limits their expressive capacity when faced\nwith non-Gaussian, outlier-rich, or high-dimensional datasets. To address this\nshortfall, we introduce a novel approach that combines diffusion techniques and\nimplicit priors for variational learning of Bayesian last layer weights. This\nmethod leverages implicit distributions for modeling weight priors in BLL,\ncoupled with diffusion samplers for approximating true posterior predictions,\nthereby establishing a comprehensive Bayesian prior and posterior estimation\nstrategy. By delivering an explicit and computationally efficient variational\nlower bound, our method aims to augment the expressive abilities of BLL models,\nenhancing model accuracy, calibration, and out-of-distribution detection\nproficiency. Through detailed exploration and experimental validation, We\nshowcase the method's potential for improving predictive accuracy and\nuncertainty quantification while ensuring computational efficiency.", "paper_summary_zh": "貝氏最後一層 (BLL) 模型專注於神經網路輸出層的不確定性，展現出與更複雜的貝氏模型相近的效能。然而，在貝氏最後一層 (BLL) 模型中，使用高斯先驗來作為最後一層權重，會在面對非高斯、異常值豐富或高維度資料集時，限制其表達能力。為了解決這個缺點，我們提出一個新穎的方法，結合擴散技術和隱式先驗，用於貝氏最後一層權重的變異學習。此方法利用隱式分佈來對 BLL 中的權重先驗進行建模，並結合擴散採樣器來逼近真實後驗預測，從而建立一個全面的貝氏先驗和後驗估計策略。透過提供一個明確且計算效率高的變異下界，我們的方法旨在擴充 BLL 模型的表達能力，提升模型準確度、校準和異常偵測能力。透過詳細的探討和實驗驗證，我們展示了此方法在提升預測準確度和不確定性量化的潛力，同時確保計算效率。", "author": "Jian Xu et.al.", "authors": "Jian Xu, Zhiqi Lin, Shigui Li, Min Chen, Junmei Yang, Delu Zeng, John Paisley", "id": "2408.03746v1", "paper_url": "http://arxiv.org/abs/2408.03746v1", "repo": "null"}}