{"2407.09099": {"publish_time": "2024-07-12", "title": "Music Proofreading with RefinPaint: Where and How to Modify Compositions given Context", "paper_summary": "Autoregressive generative transformers are key in music generation, producing\ncoherent compositions but facing challenges in human-machine collaboration. We\npropose RefinPaint, an iterative technique that improves the sampling process.\nIt does this by identifying the weaker music elements using a feedback model,\nwhich then informs the choices for resampling by an inpainting model. This\ndual-focus methodology not only facilitates the machine's ability to improve\nits automatic inpainting generation through repeated cycles but also offers a\nvaluable tool for humans seeking to refine their compositions with automatic\nproofreading. Experimental results suggest RefinPaint's effectiveness in\ninpainting and proofreading tasks, demonstrating its value for refining music\ncreated by both machines and humans. This approach not only facilitates\ncreativity but also aids amateur composers in improving their work.", "paper_summary_zh": "自動迴歸生成式轉換器是音樂生成中的關鍵，產生連貫的組成，但在人機協作中面臨挑戰。我們提出 RefinPaint，這是一種改進抽樣過程的迭代技術。它通過使用反饋模型識別較弱的音樂元素來做到這一點，然後通知內插模型重新抽樣的選擇。這種雙重焦點方法不僅通過重複循環促進機器改進其自動內插生成的能力，而且還為尋求通過自動校對改進其組成的用戶提供了一個有價值的工具。實驗結果表明 RefinPaint 在內插和校對任務中的有效性，證明了其對機器和人類創作的音樂進行精煉的價值。這種方法不僅促進了創造力，而且還幫助業餘作曲家改進了他們的工作。", "author": "Pedro Ramoneda et.al.", "authors": "Pedro Ramoneda, Martin Rocamora, Taketo Akama", "id": "2407.09099v1", "paper_url": "http://arxiv.org/abs/2407.09099v1", "repo": "https://github.com/ta603/refinpaint"}}