{"2408.16232": {"publish_time": "2024-08-29", "title": "Enhancing Conditional Image Generation with Explainable Latent Space Manipulation", "paper_summary": "In the realm of image synthesis, achieving fidelity to a reference image\nwhile adhering to conditional prompts remains a significant challenge. This\npaper proposes a novel approach that integrates a diffusion model with latent\nspace manipulation and gradient-based selective attention mechanisms to address\nthis issue. Leveraging Grad-SAM (Gradient-based Selective Attention\nManipulation), we analyze the cross attention maps of the cross attention\nlayers and gradients for the denoised latent vector, deriving importance scores\nof elements of denoised latent vector related to the subject of interest. Using\nthis information, we create masks at specific timesteps during denoising to\npreserve subjects while seamlessly integrating the reference image features.\nThis approach ensures the faithful formation of subjects based on conditional\nprompts, while concurrently refining the background for a more coherent\ncomposition. Our experiments on places365 dataset demonstrate promising\nresults, with our proposed model achieving the lowest mean and median Frechet\nInception Distance (FID) scores compared to baseline models, indicating\nsuperior fidelity preservation. Furthermore, our model exhibits competitive\nperformance in aligning the generated images with provided textual\ndescriptions, as evidenced by high CLIP scores. These results highlight the\neffectiveness of our approach in both fidelity preservation and textual context\npreservation, offering a significant advancement in text-to-image synthesis\ntasks.", "paper_summary_zh": "在图像合成领域中，在遵守条件提示的同时实现对参考图像的保真度仍然是一项重大挑战。本文提出了一种新颖的方法，该方法将扩散模型与潜在空间操作和基于梯度的选择性注意机制相结合来解决此问题。利用 Grad-SAM（基于梯度的选择性注意操作），我们分析了去噪潜在向量的交叉注意力层和梯度的交叉注意力图，得出与感兴趣主题相关的去噪潜在向量元素的重要性分数。利用此信息，我们在去噪过程中在特定时间步长创建掩码，以在无缝集成参考图像特征的同时保留主题。这种方法确保了基于条件提示对主题进行忠实地形成，同时还细化了背景以获得更连贯的构图。我们在 places365 数据集上的实验展示了有希望的结果，与基线模型相比，我们提出的模型实现了最低的平均和中值 Fréchet 起始距离 (FID) 分数，表明了卓越的保真度保留。此外，我们的模型在使生成的图像与提供的文本描述保持一致方面表现出了竞争力，正如高 CLIP 分数所证明的那样。这些结果突出了我们方法在保真度保留和文本上下文保留方面的有效性，为文本到图像合成任务提供了一项重大进展。", "author": "Kshitij Pathania et.al.", "authors": "Kshitij Pathania", "id": "2408.16232v1", "paper_url": "http://arxiv.org/abs/2408.16232v1", "repo": "null"}}