{"2410.10636": {"publish_time": "2024-10-14", "title": "Adapt-$\\infty$: Scalable Lifelong Multimodal Instruction Tuning via Dynamic Data Selection", "paper_summary": "Visual instruction datasets from various distributors are released at\ndifferent times and often contain a significant number of semantically\nredundant text-image pairs, depending on their task compositions (i.e., skills)\nor reference sources. This redundancy greatly limits the efficient deployment\nof lifelong adaptable multimodal large language models, hindering their ability\nto refine existing skills and acquire new competencies over time. To address\nthis, we reframe the problem of Lifelong Instruction Tuning (LiIT) via data\nselection, where the model automatically selects beneficial samples to learn\nfrom earlier and new datasets based on the current state of acquired knowledge\nin the model. Based on empirical analyses that show that selecting the best\ndata subset using a static importance measure is often ineffective for\nmulti-task datasets with evolving distributions, we propose Adapt-$\\infty$, a\nnew multi-way and adaptive data selection approach that dynamically balances\nsample efficiency and effectiveness during LiIT. We construct pseudo-skill\nclusters by grouping gradient-based sample vectors. Next, we select the\nbest-performing data selector for each skill cluster from a pool of selector\nexperts, including our newly proposed scoring function, Image Grounding score.\nThis data selector samples a subset of the most important samples from each\nskill cluster for training. To prevent the continuous increase in the size of\nthe dataset pool during LiIT, which would result in excessive computation, we\nfurther introduce a cluster-wise permanent data pruning strategy to remove the\nmost semantically redundant samples from each cluster, keeping computational\nrequirements manageable. Training with samples selected by Adapt-$\\infty$\nalleviates catastrophic forgetting, especially for rare tasks, and promotes\nforward transfer across the continuum using only a fraction of the original\ndatasets.", "paper_summary_zh": "<paragraph>不同發行商提供的視覺指令資料集發布時間不同，而且通常包含大量語義上重複的文字影像對，具體取決於其任務組合（即技能）或參考來源。這種重複性極大地限制了終身適應多模態大型語言模型的有效部署，阻礙了它們隨著時間推移精進現有技能和習得新能力。為了解決這個問題，我們通過資料選擇重新定義終身指令調整 (LiIT) 的問題，其中模型根據模型中已獲取知識的當前狀態，自動選擇有益的樣本來從較早和新的資料集中學習。根據經驗分析表明，對於分佈不斷變化的多任務資料集，使用靜態重要性測量來選擇最佳資料子集通常無效，我們提出了 Adapt-$\\infty$，這是一種新的多路徑和自適應資料選擇方法，可在 LiIT 期間動態平衡樣本效率和有效性。我們通過對基於梯度的樣本向量進行分組來構建偽技能群集。接下來，我們從一個選擇器專家池中為每個技能群集選擇效能最佳的資料選擇器，包括我們新提出的評分函數、影像基礎評分。此資料選擇器從每個技能群集取樣最重要的樣本子集進行訓練。為了防止 LiIT 期間資料集池大小持續增加，這將導致過度運算，我們進一步引入了一個群集式永久資料修剪策略，從每個群集中移除語義上最重複的樣本，保持運算需求在可控範圍內。使用 Adapt-$\\infty$ 選擇的樣本進行訓練可以減輕災難性遺忘，特別是對於罕見的任務，並僅使用原始資料集的一小部分來促進在整個連續體中的正向轉移。</paragraph>", "author": "Adyasha Maharana et.al.", "authors": "Adyasha Maharana, Jaehong Yoon, Tianlong Chen, Mohit Bansal", "id": "2410.10636v1", "paper_url": "http://arxiv.org/abs/2410.10636v1", "repo": "null"}}