{"2503.16402": {"publish_time": "2025-03-20", "title": "The Emperor's New Clothes in Benchmarking? A Rigorous Examination of Mitigation Strategies for LLM Benchmark Data Contamination", "paper_summary": "Benchmark Data Contamination (BDC)-the inclusion of benchmark testing samples\nin the training set-has raised increasing concerns in Large Language Model\n(LLM) evaluation, leading to falsely inflated performance estimates and\nundermining evaluation reliability. To address this, researchers have proposed\nvarious mitigation strategies to update existing benchmarks, including\nmodifying original questions or generating new ones based on them. However, a\nrigorous examination of the effectiveness of these mitigation strategies\nremains lacking. In this paper, we design a systematic and controlled pipeline\nalong with two novel metrics-fidelity and contamination resistance-to provide a\nfine-grained and comprehensive assessment of existing BDC mitigation\nstrategies. Previous assessment methods, such as accuracy drop and accuracy\nmatching, focus solely on aggregate accuracy, often leading to incomplete or\nmisleading conclusions. Our metrics address this limitation by emphasizing\nquestion-level evaluation result matching. Extensive experiments with 10 LLMs,\n5 benchmarks, 20 BDC mitigation strategies, and 2 contamination scenarios\nreveal that no existing strategy significantly improves resistance over the\nvanilla case (i.e., no benchmark update) across all benchmarks, and none\neffectively balances fidelity and contamination resistance. These findings\nunderscore the urgent need for designing more effective BDC mitigation\nstrategies. Our code repository is available at\nhttps://github.com/ASTRAL-Group/BDC_mitigation_assessment.", "paper_summary_zh": "<paragraph>基準數據污染 (BDC) 指的是在訓練集中包含基準測試樣本，這在大型語言模型 (LLM) 評估中引發了越來越多的擔憂，導致性能估計被錯誤地誇大，並損害了評估的可靠性。為了應對此問題，研究人員提出了各種緩解策略來更新現有基準，包括修改原始問題或基於原始問題生成新問題。然而，目前仍缺乏對這些緩解策略有效性的嚴格檢驗。在本文中，我們設計了一個系統且受控的流程，以及兩個新的指標——保真度和污染抵抗力——來對現有的 BDC 緩解策略進行細緻而全面的評估。先前的評估方法，例如準確度下降和準確度匹配，僅關注總體準確度，通常會導致不完整或誤導性的結論。我們的指標透過強調問題級評估結果匹配來解決這個限制。我們使用 10 個 LLM、5 個基準、20 個 BDC 緩解策略和 2 個污染場景進行了廣泛的實驗，結果顯示，沒有任何現有策略能在所有基準測試中顯著提高相較於原始案例（即沒有基準更新）的抵抗力，也沒有任何策略能有效地平衡保真度和污染抵抗力。這些發現凸顯了設計更有效的 BDC 緩解策略的迫切需求。我們的程式碼儲存庫位於 https://github.com/ASTRAL-Group/BDC_mitigation_assessment。 </paragraph>\n", "author": "Yifan Sun et.al.", "authors": "Yifan Sun, Han Wang, Dongbai Li, Gang Wang, Huan Zhang", "id": "2503.16402v1", "paper_url": "http://arxiv.org/abs/2503.16402v1", "repo": "null"}}