{"2501.12640": {"publish_time": "2025-01-22", "title": "Dynamics of Toxicity in Political Podcasts", "paper_summary": "Toxicity in digital media poses significant challenges, yet little attention\nhas been given to its dynamics within the rapidly growing medium of podcasts.\nThis paper addresses this gap by analyzing political podcast data to study the\nemergence and propagation of toxicity, focusing on conversation\nchains-structured reply patterns within podcast transcripts. Leveraging\nstate-of-the-art transcription models and advanced conversational analysis\ntechniques, we systematically examine toxic discourse in over 30 popular\npolitical podcasts in the United States. Our key contributions include: (1)\ncreating a comprehensive dataset of transcribed and diarized political\npodcasts, identifying thousands of toxic instances using Google's Perspective\nAPI, (2) uncovering concerning trends where a majority of episodes contain at\nleast one toxic instance, (3) introducing toxic conversation chains and\nanalyzing their structural and linguistic properties, revealing characteristics\nsuch as longer durations, repetitive patterns, figurative language, and\nemotional cues tied to anger and annoyance, (4) identifying demand-related\nwords like 'want', 'like', and 'know' as precursors to toxicity, and (5)\ndeveloping predictive models to anticipate toxicity shifts based on annotated\nchange points. Our findings provide critical insights into podcast toxicity and\nestablish a foundation for future research on real-time monitoring and\nintervention mechanisms to foster healthier discourse in this influential\nmedium.", "paper_summary_zh": "數位媒體中的毒性帶來了重大的挑戰，但對於在快速成長的播客媒體中其動態性卻鮮少受到關注。本文透過分析政治播客資料來探討這個差距，研究毒性的出現與傳播，特別專注於播客記錄中的對話鏈——結構化的回覆模式。運用最先進的轉錄模型和進階的對話分析技術，我們系統性地檢視美國超過 30 個熱門政治播客中的有毒言論。我們的關鍵貢獻包括：(1) 建立一個包含轉錄和日記化政治播客的綜合資料集，使用 Google 的 Perspective API 找出數千個有毒個案，(2) 揭露令人擔憂的趨勢，其中大部分集數都至少包含一個有毒個案，(3) 提出有毒對話鏈並分析其結構和語言特性，揭露諸如較長持續時間、重複模式、比喻語言，以及與憤怒和煩惱相關的情緒線索等特徵，(4) 找出與需求相關的字詞，例如「想要」、「喜歡」和「知道」，作為毒性的前兆，以及 (5) 根據註解的變更點開發預測模型，以預測毒性的轉變。我們的研究結果提供了對播客毒性的重要見解，並為未來在這個有影響力的媒體中建立即時監控和介入機制的相關研究奠定基礎，以促進更健康的論述。", "author": "Naquee Rizwan et.al.", "authors": "Naquee Rizwan, Nayandeep Deb, Sarthak Roy, Vishwajeet Singh Solanki, Kiran Garimella, Animesh Mukherjee", "id": "2501.12640v1", "paper_url": "http://arxiv.org/abs/2501.12640v1", "repo": "null"}}