{"2410.10576": {"publish_time": "2024-10-14", "title": "Recipe for Zero-shot POS Tagging: Is It Useful in Realistic Scenarios?", "paper_summary": "POS tagging plays a fundamental role in numerous applications. While POS\ntaggers are highly accurate in well-resourced settings, they lag behind in\ncases of limited or missing training data. This paper focuses on POS tagging\nfor languages with limited data. We seek to identify the characteristics of\ndatasets that make them favourable for training POS tagging models without\nusing any labelled training data from the target language. This is a zero-shot\napproach. We compare the accuracies of a multilingual large language model\n(mBERT) fine-tuned on one or more languages related to the target language.\nAdditionally, we compare these results with models trained directly on the\ntarget language itself. We do this for three target low-resource languages. Our\nresearch highlights the importance of accurate dataset selection for effective\nzero-shot POS tagging. Particularly, a strong linguistic relationship and\nhigh-quality datasets ensure optimal results. For extremely low-resource\nlanguages, zero-shot models prove to be a viable option.", "paper_summary_zh": "詞性標註在許多應用程式中扮演著基本的角色。雖然詞性標註器在資源充足的環境中非常精確，但它們在訓練資料有限或遺失的情況下卻落後於其他方法。本文專注於資料有限的語言的詞性標註。我們試圖找出資料集的特性，使其有利於訓練詞性標註模型，而無需使用目標語言的任何標籤訓練資料。這是一種零次學習方法。我們比較了針對與目標語言相關的一種或多種語言進行微調的多語言大型語言模型 (mBERT) 的準確度。此外，我們將這些結果與直接針對目標語言本身訓練的模型進行比較。我們針對三種目標低資源語言執行此操作。我們的研究強調了準確的資料集選擇對於有效的零次學習詞性標註的重要性。特別是，強有力的語言關係和高品質的資料集可確保最佳結果。對於極度低資源的語言，零次學習模型被證明是一個可行的選項。", "author": "Zeno Vandenbulcke et.al.", "authors": "Zeno Vandenbulcke, Lukas Vermeire, Miryam de Lhoneux", "id": "2410.10576v1", "paper_url": "http://arxiv.org/abs/2410.10576v1", "repo": "null"}}