{"2407.12703": {"publish_time": "2024-07-17", "title": "Subgraph-Aware Training of Text-based Methods for Knowledge Graph Completion", "paper_summary": "Fine-tuning pre-trained language models (PLMs) has recently shown a potential\nto improve knowledge graph completion (KGC). However, most PLM-based methods\nencode only textual information, neglecting various topological structures of\nknowledge graphs (KGs). In this paper, we empirically validate the significant\nrelations between the structural properties of KGs and the performance of the\nPLM-based methods. To leverage the structural knowledge, we propose a\nSubgraph-Aware Training framework for KGC (SATKGC) that combines (i)\nsubgraph-aware mini-batching to encourage hard negative sampling, and (ii) a\nnew contrastive learning method to focus more on harder entities and harder\nnegative triples in terms of the structural properties. To the best of our\nknowledge, this is the first study to comprehensively incorporate the\nstructural inductive bias of the subgraphs into fine-tuning PLMs. Extensive\nexperiments on four KGC benchmarks demonstrate the superiority of SATKGC. Our\ncode is available.", "paper_summary_zh": "微調預訓練語言模型 (PLM) 近來顯示出改善知識圖譜完成功能 (KGC) 的潛力。然而，大多數基於 PLM 的方法僅編碼文字資訊，忽略了知識圖譜 (KG) 的各種拓撲結構。在本文中，我們透過經驗驗證了 KG 的結構屬性與基於 PLM 的方法效能之間的重要關係。為了利用結構知識，我們提出了一個用於 KGC 的子圖感知訓練架構 (SATKGC)，它結合了：(i) 子圖感知小批次處理以鼓勵困難負面抽樣，以及 (ii) 一種新的對比學習方法，在結構屬性方面更專注於更困難的實體和更困難的負三元組。據我們所知，這是第一個將子圖的結構歸納偏誤全面納入 PLM 微調的研究。在四個 KGC 基準上的廣泛實驗證明了 SATKGC 的優越性。我們的程式碼現已公開。", "author": "Youmin Ko et.al.", "authors": "Youmin Ko, Hyemin Yang, Taeuk Kim, Hyunjoon Kim", "id": "2407.12703v3", "paper_url": "http://arxiv.org/abs/2407.12703v3", "repo": "null"}}