{"2405.10738": {"publish_time": "2024-05-17", "title": "Feature-Adaptive and Data-Scalable In-Context Learning", "paper_summary": "In-context learning (ICL), which promotes inference with several\ndemonstrations, has become a widespread paradigm to stimulate LLM capabilities\nfor downstream tasks. Due to context length constraints, it cannot be further\nimproved in spite of more training data, and general features directly from\nLLMs in ICL are not adaptive to the specific downstream task. In this paper, we\npropose a feature-adaptive and data-scalable in-context learning framework\n(FADS-ICL), which can leverage task-adaptive features to promote inference on\nthe downstream task, with the supervision of beyond-context samples.\nSpecifically, it first extracts general features of beyond-context samples via\nthe LLM with ICL input form one by one, and introduces a task-specific\nmodulator to perform feature refinement and prediction after fitting a specific\ndownstream task. We conduct extensive experiments on FADS-ICL under varying\ndata settings (4$\\sim$128 shots) and LLM scale (0.8$\\sim$70B) settings.\nExperimental results show that FADS-ICL consistently outperforms previous\nstate-of-the-art methods by a significant margin under all settings, verifying\nthe effectiveness and superiority of FADS-ICL. For example, under the 1.5B and\n32 shots setting, FADS-ICL can achieve \\textbf{+14.3} average accuracy from\nfeature adaptation over vanilla ICL on 10 datasets, with \\textbf{+6.2} average\naccuracy over the previous state-of-the-art method, and the performance can\nfurther improve with increasing training data. Code and data are publicly\navailable at \\url{https://github.com/jiahaozhenbang/FADS-ICL}.", "paper_summary_zh": "<paragraph>情境學習 (ICL) 透過多個示範促進推論，已成為一個廣泛的範例，用於刺激 LLM 在下游任務中的能力。由於情境長度限制，儘管有更多訓練資料，但它無法進一步改善，而 ICL 中直接來自 LLM 的一般特徵並無法適應特定下游任務。在本文中，我們提出一個特徵適應且資料可擴充的情境學習架構 (FADS-ICL)，它可以利用任務適應特徵來促進對下游任務的推論，並監督情境外範例。具體來說，它首先透過 ICL 輸入表單逐一提取情境外範例的一般特徵，並引入一個任務特定調製器，在擬合特定下游任務後執行特徵優化和預測。我們對 FADS-ICL 在不同的資料設定 (4$\\sim$128 個鏡頭) 和 LLM 規模 (0.8$\\sim$70B) 設定下進行了廣泛的實驗。實驗結果表明，在所有設定下，FADS-ICL 持續優於先前的最先進方法，驗證了 FADS-ICL 的有效性和優越性。例如，在 1.5B 和 32 個鏡頭的設定下，FADS-ICL 可以透過從香草 ICL 到 10 個資料集的特徵適應來實現\\textbf{+14.3} 的平均準確度，比先前的最先進方法高出\\textbf{+6.2} 的平均準確度，而且隨著訓練資料的增加，效能可以進一步提升。程式碼和資料已公開於\\url{https://github.com/jiahaozhenbang/FADS-ICL}。</paragraph>", "author": "Jiahao Li et.al.", "authors": "Jiahao Li, Quan Wang, Licheng Zhang, Guoqing Jin, Zhendong Mao", "id": "2405.10738v1", "paper_url": "http://arxiv.org/abs/2405.10738v1", "repo": "https://github.com/jiahaozhenbang/fads-icl"}}