{"2405.15985": {"publish_time": "2024-05-24", "title": "The Impact and Opportunities of Generative AI in Fact-Checking", "paper_summary": "Generative AI appears poised to transform white collar professions, with more\nthan 90% of Fortune 500 companies using OpenAI's flagship GPT models, which\nhave been characterized as \"general purpose technologies\" capable of effecting\nepochal changes in the economy. But how will such technologies impact\norganizations whose job is to verify and report factual information, and to\nensure the health of the information ecosystem? To investigate this question,\nwe conducted 30 interviews with N=38 participants working at 29 fact-checking\norganizations across six continents, asking about how they use generative AI\nand the opportunities and challenges they see in the technology. We found that\nuses of generative AI envisioned by fact-checkers differ based on\norganizational infrastructure, with applications for quality assurance in\nEditing, for trend analysis in Investigation, and for information literacy in\nAdvocacy. We used the TOE framework to describe participant concerns ranging\nfrom the Technological (lack of transparency), to the Organizational (resource\nconstraints), to the Environmental (uncertain and evolving policy). Building on\nthe insights of our participants, we describe value tensions between\nfact-checking and generative AI, and propose a novel Verification dimension to\nthe design space of generative models for information verification work.\nFinally, we outline an agenda for fairness, accountability, and transparency\nresearch to support the responsible use of generative AI in fact-checking.\nThroughout, we highlight the importance of human infrastructure and labor in\nproducing verified information in collaboration with AI. We expect that this\nwork will inform not only the scientific literature on fact-checking, but also\ncontribute to understanding of organizational adaptation to a powerful but\nunreliable new technology.", "paper_summary_zh": "生成式 AI 似乎準備轉變白領職業，超過 90% 的財富 500 大企業使用 OpenAI 的旗艦 GPT 模型，這些模型被稱為「通用技術」，能夠對經濟產生劃時代的改變。但這些技術將如何影響負責驗證和報導事實資訊，並確保資訊生態系統健康的組織？為了探討這個問題，我們對橫跨六大洲的 29 個查核事實組織中任職的 N=38 名參與者進行了 30 次訪談，詢問他們如何使用生成式 AI，以及他們在技術中看到的機會和挑戰。我們發現查核人員設想的生成式 AI 用途因組織基礎架構而異，在編輯中應用於品質保證、在調查中應用於趨勢分析、在倡議中應用於資訊素養。我們使用 TOE 架構來描述參與者的疑慮，範圍從技術（缺乏透明度）、組織（資源限制）到環境（不確定且不斷演變的政策）。根據參與者的見解，我們描述了查核事實和生成式 AI 之間的價值緊張關係，並為資訊驗證工作中生成式模型的設計空間提出了新的驗證面向。最後，我們概述了公平性、問責制和透明度研究議程，以支持在查核事實中負責任地使用生成式 AI。在整個過程中，我們強調了人類基礎架構和勞動力在與 AI 合作產生已驗證資訊中的重要性。我們預期這項工作不僅會為查核事實的科學文獻提供資訊，還能有助於了解組織如何適應強大但不可靠的新技術。", "author": "Robert Wolfe et.al.", "authors": "Robert Wolfe, Tanushree Mitra", "id": "2405.15985v1", "paper_url": "http://arxiv.org/abs/2405.15985v1", "repo": "null"}}