{"2410.14593": {"publish_time": "2024-10-18", "title": "Temporal Fair Division of Indivisible Items", "paper_summary": "We study a fair division model where indivisible items arrive sequentially,\nand must be allocated immediately and irrevocably. Previous work on online fair\ndivision has shown impossibility results in achieving approximate envy-freeness\nunder these constraints. In contrast, we consider an informed setting where the\nalgorithm has complete knowledge of future items, and aim to ensure that the\ncumulative allocation at each round satisfies approximate envy-freeness --\nwhich we define as temporal envy-freeness up to one item (TEF1). We focus on\nsettings where items can be exclusively goods or exclusively chores. For goods,\nwhile TEF1 allocations may not always exist, we identify several special cases\nwhere they do -- two agents, two item types, generalized binary valuations,\nunimodal preferences -- and provide polynomial-time algorithms for these cases.\nWe also prove that determining the existence of a TEF1 allocation is NP-hard.\nFor chores, we establish analogous results for the special cases, but present a\nslightly weaker intractability result. We also establish the incompatibility\nbetween TEF1 and Pareto-optimality, with the implication that it is intractable\nto find a TEF1 allocation that maximizes any $p$-mean welfare, even for two\nagents.", "paper_summary_zh": "<paragraph>我們研究一個公平分配模型，其中不可分割的物品會依序抵達，並且必須立即且不可撤銷地分配。先前關於線上公平分配的研究顯示，在這些限制下，不可能實現近似無妒。相反地，我們考慮一個知情設定，其中演算法對未來的物品有完整的認識，並旨在確保每一輪的累積分配滿足近似無妒——我們將其定義為最多一項的暫時無妒 (TEF1)。我們專注於物品可以是純粹的物品或純粹的家務的設定。對於物品，儘管 TEF1 分配可能並不總是存在，但我們找出它們存在的幾個特殊情況——兩個代理人、兩種物品類型、廣義二元估值、單峰偏好——並為這些情況提供多項式時間演算法。我們也證明確定 TEF1 分配的存在是 NP-hard。對於家務，我們為特殊情況建立類似的結果，但提出一個稍微弱一點的難以處理的結果。我們也建立 TEF1 和帕累托最優之間的不相容性，暗示找出一個 TEF1 分配以最大化任何 p 均值福利，即使對於兩個代理人，也是難以處理的。</paragraph>", "author": "Edith Elkind et.al.", "authors": "Edith Elkind, Alexander Lam, Mohamad Latifian, Tzeh Yuan Neoh, Nicholas Teh", "id": "2410.14593v1", "paper_url": "http://arxiv.org/abs/2410.14593v1", "repo": "null"}}