{"2502.11863": {"publish_time": "2025-02-17", "title": "FedEAT: A Robustness Optimization Framework for Federated LLMs", "paper_summary": "Significant advancements have been made by Large Language Models (LLMs) in\nthe domains of natural language understanding and automated content creation.\nHowever, they still face persistent problems, including substantial\ncomputational costs and inadequate availability of training data. The\ncombination of Federated Learning (FL) and LLMs (federated LLMs) offers a\nsolution by leveraging distributed data while protecting privacy, which\npositions it as an ideal choice for sensitive domains. However, Federated LLMs\nstill suffer from robustness challenges, including data heterogeneity,\nmalicious clients, and adversarial attacks, which greatly hinder their\napplications. We first introduce the robustness problems in federated LLMs, to\naddress these challenges, we propose FedEAT (Federated Embedding space\nAdversarial Training), a novel framework that applies adversarial training in\nthe embedding space of client LLM and employs a robust aggregation approach,\nspecifically geometric median aggregation, to enhance the robustness of\nFederated LLMs. Our experiments demonstrate that FedEAT effectively improves\nthe robustness of Federated LLMs with minimal performance loss.", "paper_summary_zh": "大型語言模型 (LLM) 在自然語言理解和自動化內容創作領域取得了重大進展。\n然而，它們仍然面臨持續的問題，包括大量的運算成本和訓練數據的可用性不足。\n聯合學習 (FL) 和 LLM（聯合 LLM）的結合提供了一個解決方案，在保護隱私的同時利用分佈式數據，這使其成為敏感領域的理想選擇。\n然而，聯合 LLM 仍然面臨著穩健性的挑戰，包括數據異質性、惡意用戶和對抗性攻擊，這極大地阻礙了它們的應用。\n我們首先介紹了聯合 LLM 中的穩健性問題，為了應對這些挑戰，我們提出了 FedEAT（聯合嵌入空間對抗訓練），這是一個新穎的框架，它在用戶端 LLM 的嵌入空間中應用對抗訓練，並採用穩健的聚合方法，特別是幾何中值聚合，以增強聯合 LLM 的穩健性。\n我們的實驗表明，FedEAT 有效地提高了聯合 LLM 的穩健性，同時性能損失最小。", "author": "Yahao Pang et.al.", "authors": "Yahao Pang, Xingyuan Wu, Xiaojin Zhang, Wei Chen, Hai Jin", "id": "2502.11863v1", "paper_url": "http://arxiv.org/abs/2502.11863v1", "repo": "null"}}