{"2411.14625": {"publish_time": "2024-11-21", "title": "Predictive Analytics of Air Alerts in the Russian-Ukrainian War", "paper_summary": "The paper considers exploratory data analysis and approaches in predictive\nanalytics for air alerts during the Russian-Ukrainian war which broke out on\nFeb 24, 2022. The results illustrate that alerts in regions correlate with one\nanother and have geospatial patterns which make it feasible to build a\npredictive model which predicts alerts that are expected to take place in a\ncertain region within a specified time period. The obtained results show that\nthe alert status in a particular region is highly dependable on the features of\nits adjacent regions. Seasonality features like hours, days of a week and\nmonths are also crucial in predicting the target variable. Some regions highly\nrely on the time feature which equals to a number of days from the initial date\nof the dataset. From this, we can deduce that the air alert pattern changes\nthroughout the time.", "paper_summary_zh": "本文探討了在俄烏戰爭期間（2022 年 2 月 24 日爆發）進行空襲警報的探索性資料分析和預測分析方法。結果表明，各區域的警報相互關聯，並具有地理空間模式，這使得建立一個預測模型成為可能，該模型可以預測在特定時間段內預計在特定區域發生的警報。獲得的結果表明，特定區域的警報狀態高度依賴於其鄰近區域的特徵。季節性特徵（例如小時、星期和月份）在預測目標變量時也至關重要。有些區域高度依賴於時間特徵，該特徵等於從資料集初始日期開始的天數。由此，我們可以推斷出空襲警報模式會隨著時間而改變。", "author": "Demian Pavlyshenko et.al.", "authors": "Demian Pavlyshenko, Bohdan Pavlyshenko", "id": "2411.14625v1", "paper_url": "http://arxiv.org/abs/2411.14625v1", "repo": "null"}}