{"2409.03115": {"publish_time": "2024-09-04", "title": "Probing self-attention in self-supervised speech models for cross-linguistic differences", "paper_summary": "Speech models have gained traction thanks to increase in accuracy from novel\ntransformer architectures. While this impressive increase in performance across\nautomatic speech recognition (ASR) benchmarks is noteworthy, there is still\nmuch that is unknown about the use of attention mechanisms for speech-related\ntasks. For example, while it is assumed that these models are learning\nlanguage-independent (i.e., universal) speech representations, there has not\nyet been an in-depth exploration of what it would mean for the models to be\nlanguage-independent. In the current paper, we explore this question within the\nrealm of self-attention mechanisms of one small self-supervised speech\ntransformer model (TERA). We find that even with a small model, the attention\nheads learned are diverse ranging from almost entirely diagonal to almost\nentirely global regardless of the training language. We highlight some notable\ndifferences in attention patterns between Turkish and English and demonstrate\nthat the models do learn important phonological information during pretraining.\nWe also present a head ablation study which shows that models across languages\nprimarily rely on diagonal heads to classify phonemes.", "paper_summary_zh": "語音模型由於新穎的轉換器架構的準確性提升而獲得關注。雖然在自動語音辨識 (ASR) 基準中性能有顯著提升值得注意，但對於使用注意力機制進行與語音相關的任務，仍有許多未知之處。例如，雖然假設這些模型正在學習與語言無關（即通用）的語音表示，但對於模型與語言無關的意義尚未深入探討。在本文中，我們在一個小型自我監督語音轉換器模型 (TERA) 的自我注意力機制的領域中探討這個問題。我們發現即使使用小型模型，學習到的注意力頭也是多樣化的，從幾乎完全對角線到幾乎完全全局，與訓練語言無關。我們重點說明土耳其語和英語之間注意力模式的一些顯著差異，並證明模型在預訓練期間確實學習重要的音韻資訊。我們還提出一個頭部消融研究，顯示跨語言的模型主要依賴對角線頭部來分類音素。", "author": "Sai Gopinath et.al.", "authors": "Sai Gopinath, Joselyn Rodriguez", "id": "2409.03115v1", "paper_url": "http://arxiv.org/abs/2409.03115v1", "repo": "null"}}