{"2503.03258": {"publish_time": "2025-03-05", "title": "Exploring the Potential of Large Language Models as Predictors in Dynamic Text-Attributed Graphs", "paper_summary": "With the rise of large language models (LLMs), there has been growing\ninterest in Graph Foundation Models (GFMs) for graph-based tasks. By leveraging\nLLMs as predictors, GFMs have demonstrated impressive generalizability across\nvarious tasks and datasets. However, existing research on LLMs as predictors\nhas predominantly focused on static graphs, leaving their potential in dynamic\ngraph prediction unexplored. In this work, we pioneer using LLMs for predictive\ntasks on dynamic graphs. We identify two key challenges: the constraints\nimposed by context length when processing large-scale historical data and the\nsignificant variability in domain characteristics, both of which complicate the\ndevelopment of a unified predictor. To address these challenges, we propose the\nGraphAgent-Dynamic (GAD) Framework, a multi-agent system that leverages\ncollaborative LLMs. In contrast to using a single LLM as the predictor, GAD\nincorporates global and local summary agents to generate domain-specific\nknowledge, enhancing its transferability across domains. Additionally,\nknowledge reflection agents enable adaptive updates to GAD's knowledge,\nmaintaining a unified and self-consistent architecture. In experiments, GAD\ndemonstrates performance comparable to or even exceeds that of full-supervised\ngraph neural networks without dataset-specific training. Finally, to enhance\nthe task-specific performance of LLM-based predictors, we discuss potential\nimprovements, such as dataset-specific fine-tuning to LLMs. By developing\ntailored strategies for different tasks, we provide new insights for the future\ndesign of LLM-based predictors.", "paper_summary_zh": "隨著大型語言模型 (LLM) 的興起，人們對用於基於圖任務的圖基礎模型 (GFM) 的興趣日益濃厚。透過利用 LLM 作為預測器，GFM 在各種任務和數據集中展現了令人印象深刻的泛化能力。然而，現有關於 LLM 作為預測器的研究主要集中在靜態圖上，而其在動態圖預測中的潛力尚未被探索。在這項工作中，我們率先使用 LLM 進行動態圖上的預測任務。我們確定了兩個關鍵挑戰：處理大規模歷史數據時上下文長度施加的限制，以及領域特徵的顯著變化，這兩者都使統一預測器的開發變得複雜。為了應對這些挑戰，我們提出了 GraphAgent-Dynamic (GAD) 框架，這是一個利用協作 LLM 的多代理系統。與使用單個 LLM 作為預測器相比，GAD 整合了全局和局部摘要代理來生成特定領域的知識，從而增強其跨領域的可遷移性。此外，知識反思代理可以對 GAD 的知識進行自適應更新，從而保持統一且自洽的架構。在實驗中，GAD 展現的性能與完全監督的圖神經網絡相當，甚至超過了後者，而無需針對特定數據集進行訓練。最後，為了增強基於 LLM 的預測器的特定任務性能，我們討論了潛在的改進，例如針對 LLM 進行特定數據集的微調。透過針對不同任務制定量身定制的策略，我們為基於 LLM 的預測器的未來設計提供了新的見解。\n", "author": "Runlin Lei et.al.", "authors": "Runlin Lei, Jiarui Ji, Haipeng Ding, Lu Yi, Zhewei Wei, Yongchao Liu, Chuntao Hong", "id": "2503.03258v1", "paper_url": "http://arxiv.org/abs/2503.03258v1", "repo": "null"}}