{"2405.05386": {"publish_time": "2024-05-08", "title": "Interpretability Needs a New Paradigm", "paper_summary": "Interpretability is the study of explaining models in understandable terms to\nhumans. At present, interpretability is divided into two paradigms: the\nintrinsic paradigm, which believes that only models designed to be explained\ncan be explained, and the post-hoc paradigm, which believes that black-box\nmodels can be explained. At the core of this debate is how each paradigm\nensures its explanations are faithful, i.e., true to the model's behavior. This\nis important, as false but convincing explanations lead to unsupported\nconfidence in artificial intelligence (AI), which can be dangerous. This\npaper's position is that we should think about new paradigms while staying\nvigilant regarding faithfulness. First, by examining the history of paradigms\nin science, we see that paradigms are constantly evolving. Then, by examining\nthe current paradigms, we can understand their underlying beliefs, the value\nthey bring, and their limitations. Finally, this paper presents 3 emerging\nparadigms for interpretability. The first paradigm designs models such that\nfaithfulness can be easily measured. Another optimizes models such that\nexplanations become faithful. The last paradigm proposes to develop models that\nproduce both a prediction and an explanation.", "paper_summary_zh": "可解釋性是研究如何以人類可以理解的方式來解釋模型。目前，可解釋性分成兩種典範：內在典範，認為只有設計成可以解釋的模型才能被解釋，以及事後典範，認為黑盒模型也可以被解釋。在這個辯論的核心是每個典範如何確保其解釋是忠實的，也就是說，忠於模型的行為。這很重要，因為虛假但令人信服的解釋會導致對人工智慧 (AI) 的信心不足，這可能是危險的。本文的立場是，我們應該思考新的典範，同時對忠實度保持警惕。首先，通過檢視科學中的典範歷史，我們會看到典範不斷演進。然後，通過檢視當前的典範，我們可以了解其背後的信念、它們帶來的價值和它們的限制。最後，本文提出了 3 個可解釋性的新興典範。第一個典範設計模型，以便可以輕鬆衡量忠實度。另一個優化模型，以便解釋變得忠實。最後一個典範提出開發同時產生預測和解釋的模型。", "author": "Andreas Madsen et.al.", "authors": "Andreas Madsen, Himabindu Lakkaraju, Siva Reddy, Sarath Chandar", "id": "2405.05386v1", "paper_url": "http://arxiv.org/abs/2405.05386v1", "repo": "null"}}