{"2412.17451": {"publish_time": "2024-12-23", "title": "Diving into Self-Evolving Training for Multimodal Reasoning", "paper_summary": "Reasoning ability is essential for Large Multimodal Models (LMMs). In the\nabsence of multimodal chain-of-thought annotated data, self-evolving training,\nwhere the model learns from its own outputs, has emerged as an effective and\nscalable approach for enhancing reasoning abilities. Despite its growing usage,\na comprehensive understanding of self-evolving training, particularly in the\ncontext of multimodal reasoning, remains limited. In this paper, we delve into\nthe intricacies of self-evolving training for multimodal reasoning, pinpointing\nthree key factors: Training Method, Reward Model, and Prompt Variation. We\nsystematically examine each factor and explore how various configurations\naffect the training's effectiveness. Our analysis leads to a set of best\npractices for each factor, aimed at optimizing multimodal reasoning.\nFurthermore, we explore the Self-Evolution Dynamics during training and the\nimpact of automatic balancing mechanisms in boosting performance. After all the\ninvestigations, we present a final recipe for self-evolving training in\nmultimodal reasoning, encapsulating these design choices into a framework we\ncall MSTaR (Multimodal Self-evolving Training for Reasoning), which is\nuniversally effective for models with different sizes on various benchmarks,\ne.g., surpassing the pre-evolved model significantly on 5 multimodal reasoning\nbenchmarks without using additional human annotations, as demonstrated on\nMiniCPM-V-2.5 (8B), Phi-3.5-Vision (4B) and InternVL2 (2B). We believe this\nstudy fills a significant gap in the understanding of self-evolving training\nfor multimodal reasoning and offers a robust framework for future research. Our\npolicy and reward models, as well as the collected data, is released to\nfacilitate further investigation in multimodal reasoning.", "paper_summary_zh": "推理能力对于大型多模态模型 (LMM) 至关重要。在缺乏多模态思维链注释数据的情况下，自我进化训练（模型从其自身的输出中学习）已成为一种有效且可扩展的方法，用于增强推理能力。尽管使用越来越广泛，但对自我进化训练的全面理解，尤其是在多模态推理的背景下，仍然有限。在本文中，我们深入研究了多模态推理的自我进化训练的复杂性，指出了三个关键因素：训练方法、奖励模型和提示变化。我们系统地检查了每个因素，并探讨了各种配置如何影响训练的有效性。我们的分析针对每个因素得出了一组最佳实践，旨在优化多模态推理。此外，我们探讨了训练期间的自我进化动态以及自动平衡机制对提升性能的影响。在所有调查之后，我们提出了多模态推理中自我进化训练的最终秘诀，将这些设计选择封装到一个我们称之为 MSTaR（推理多模态自我进化训练）的框架中，该框架对不同规模的模型在各种基准上都具有普遍的有效性，例如，在 5 个多模态推理基准上明显超越了预先进化的模型，而无需使用额外的注释，如在 MiniCPM-V-2.5 (8B)、Phi-3.5-Vision (4B) 和 InternVL2 (2B) 上所展示的。我们相信，这项研究填补了对多模态推理的自我进化训练理解方面的重大空白，并为未来的研究提供了稳健的框架。我们的策略和奖励模型以及收集的数据已发布，以促进对多模态推理的进一步调查。", "author": "Wei Liu et.al.", "authors": "Wei Liu, Junlong Li, Xiwen Zhang, Fan Zhou, Yu Cheng, Junxian He", "id": "2412.17451v1", "paper_url": "http://arxiv.org/abs/2412.17451v1", "repo": "null"}}