{"2412.02205": {"publish_time": "2024-12-03", "title": "DataLab: A Unifed Platform for LLM-Powered Business Intelligence", "paper_summary": "Business intelligence (BI) transforms large volumes of data within modern\norganizations into actionable insights for informed decision-making. Recently,\nlarge language model (LLM)-based agents have streamlined the BI workflow by\nautomatically performing task planning, reasoning, and actions in executable\nenvironments based on natural language (NL) queries. However, existing\napproaches primarily focus on individual BI tasks such as NL2SQL and NL2VIS.\nThe fragmentation of tasks across different data roles and tools lead to\ninefficiencies and potential errors due to the iterative and collaborative\nnature of BI. In this paper, we introduce DataLab, a unified BI platform that\nintegrates a one-stop LLM-based agent framework with an augmented computational\nnotebook interface. DataLab supports a wide range of BI tasks for different\ndata roles by seamlessly combining LLM assistance with user customization\nwithin a single environment. To achieve this unification, we design a domain\nknowledge incorporation module tailored for enterprise-specific BI tasks, an\ninter-agent communication mechanism to facilitate information sharing across\nthe BI workflow, and a cell-based context management strategy to enhance\ncontext utilization efficiency in BI notebooks. Extensive experiments\ndemonstrate that DataLab achieves state-of-the-art performance on various BI\ntasks across popular research benchmarks. Moreover, DataLab maintains high\neffectiveness and efficiency on real-world datasets from Tencent, achieving up\nto a 58.58% increase in accuracy and a 61.65% reduction in token cost on\nenterprise-specific BI tasks.", "paper_summary_zh": "商業智慧（BI）將現代組織中大量的資料轉換為可操作的見解，以供明智決策。最近，基於大型語言模型（LLM）的代理簡化了 BI 工作流程，根據自然語言（NL）查詢在可執行環境中自動執行任務規劃、推理和動作。然而，現有方法主要關注個別 BI 任務，例如 NL2SQL 和 NL2VIS。由於 BI 的迭代和協作性質，任務在不同資料角色和工具之間的分散導致低效率和潛在錯誤。在本文中，我們介紹了 DataLab，一個統一的 BI 平台，它將一站式 LLM 代理框架與增強計算筆記本介面整合在一起。DataLab 支援各種 BI 任務，適用於不同的資料角色，透過在單一環境中無縫結合 LLM 協助與使用者自訂來達成。為了實現這種統一，我們設計了一個針對企業特定 BI 任務量身打造的領域知識整合模組、一個代理間通訊機制以利於在 BI 工作流程中分享資訊，以及一個基於單元的內容管理策略以增強 BI 筆記本中的內容使用效率。廣泛的實驗證明，DataLab 在各種 BI 任務上達到了最先進的效能，橫跨熱門研究基準。此外，DataLab 在騰訊的真實世界資料集上保持了高效率和高成效，在企業特定 BI 任務上達到了準確度提高 58.58% 和令牌成本減少 61.65%。", "author": "Luoxuan Weng et.al.", "authors": "Luoxuan Weng, Yinghao Tang, Yingchaojie Feng, Zhuo Chang, Peng Chen, Ruiqin Chen, Haozhe Feng, Chen Hou, Danqing Huang, Yang Li, Huaming Rao, Haonan Wang, Canshi Wei, Xiaofeng Yang, Yuhui Zhang, Yifeng Zheng, Xiuqi Huang, Minfeng Zhu, Yuxin Ma, Bin Cui, Wei Chen", "id": "2412.02205v1", "paper_url": "http://arxiv.org/abs/2412.02205v1", "repo": "null"}}