{"2410.16024": {"publish_time": "2024-10-21", "title": "A New Approach to Solving SMAC Task: Generating Decision Tree Code from Large Language Models", "paper_summary": "StarCraft Multi-Agent Challenge (SMAC) is one of the most commonly used\nexperimental environments in multi-agent reinforcement learning (MARL), where\nthe specific task is to control a set number of allied units to defeat enemy\nforces. Traditional MARL algorithms often require interacting with the\nenvironment for up to 1 million steps to train a model, and the resulting\npolicies are typically non-interpretable with weak transferability. In this\npaper, we propose a novel approach to solving SMAC tasks called LLM-SMAC. In\nour framework, agents leverage large language models (LLMs) to generate\ndecision tree code by providing task descriptions. The model is further\nself-reflection using feedback from the rewards provided by the environment. We\nconduct experiments in the SMAC and demonstrate that our method can produce\nhigh-quality, interpretable decision trees with minimal environmental\nexploration. Moreover, these models exhibit strong transferability,\nsuccessfully applying to similar SMAC environments without modification. We\nbelieve this approach offers a new direction for solving decision-making tasks\nin the future.", "paper_summary_zh": "星海爭霸多智能體挑戰 (SMAC) 是多智能體強化學習 (MARL) 中最常使用的實驗環境之一，其中具體任務是控制一定數量的盟軍單位來擊敗敵軍。傳統的 MARL 演算法通常需要與環境互動多達 100 萬步才能訓練模型，而產生的策略通常難以解釋，且可轉移性較弱。在本文中，我們提出了一種解決 SMAC 任務的新方法，稱為 LLM-SMAC。在我們的框架中，智能體利用大型語言模型 (LLM) 透過提供任務描述來產生決策樹程式碼。該模型進一步利用環境提供的回饋進行自我反省。我們在 SMAC 中進行實驗，並證明我們的模型可以產生高品質、可解釋的決策樹，且環境探索最少。此外，這些模型展現出強大的可轉移性，成功應用於類似的 SMAC 環境而無需修改。我們相信這種方法為未來解決決策制定任務提供了新的方向。", "author": "Yue Deng et.al.", "authors": "Yue Deng, Weiyu Ma, Yuxin Fan, Yin Zhang, Haifeng Zhang, Jian Zhao", "id": "2410.16024v1", "paper_url": "http://arxiv.org/abs/2410.16024v1", "repo": "https://github.com/devindeng94/llm-smac"}}