{"2504.00993": {"publish_time": "2025-04-01", "title": "MedReason: Eliciting Factual Medical Reasoning Steps in LLMs via Knowledge Graphs", "paper_summary": "Medical tasks such as diagnosis and treatment planning require precise and\ncomplex reasoning, particularly in life-critical domains. Unlike mathematical\nreasoning, medical reasoning demands meticulous, verifiable thought processes\nto ensure reliability and accuracy. However, there is a notable lack of\ndatasets that provide transparent, step-by-step reasoning to validate and\nenhance the medical reasoning ability of AI models. To bridge this gap, we\nintroduce MedReason, a large-scale high-quality medical reasoning dataset\ndesigned to enable faithful and explainable medical problem-solving in large\nlanguage models (LLMs). We utilize a structured medical knowledge graph (KG) to\nconvert clinical QA pairs into logical chains of reasoning, or ``thinking\npaths'', which trace connections from question elements to answers via relevant\nKG entities. Each path is validated for consistency with clinical logic and\nevidence-based medicine. Our pipeline generates detailed reasoning for various\nmedical questions from 7 medical datasets, resulting in a dataset of 32,682\nquestion-answer pairs, each with detailed, step-by-step explanations.\nExperiments demonstrate that fine-tuning with our dataset consistently boosts\nmedical problem-solving capabilities, achieving significant gains of up to 7.7%\nfor DeepSeek-Ditill-8B. Our top-performing model, MedReason-8B, outperforms the\nHuatuo-o1-8B, a state-of-the-art medical reasoning model, by up to 4.2% on the\nclinical benchmark MedBullets. We also engage medical professionals from\ndiverse specialties to assess our dataset's quality, ensuring MedReason offers\naccurate and coherent medical reasoning. Our data, models, and code is\navailable at https://github.com/UCSC-VLAA/MedReason.", "paper_summary_zh": "醫療任務，例如診斷和治療計劃，需要精確且複雜的推理，尤其是在攸關生命的領域。與數學推理不同，醫療推理需要一絲不苟、可驗證的思維過程以確保可靠性和準確性。然而，目前明顯缺乏提供透明、逐步推理的數據集來驗證和增強AI模型的醫療推理能力。為了彌合這一差距，我們推出了 MedReason，這是一個大規模、高質量的醫療推理數據集，旨在使大型語言模型 (LLM) 能夠進行忠實且可解釋的醫療問題解決。我們利用結構化的醫學知識圖譜 (KG) 將臨床問答對轉換為邏輯推理鏈，或稱為「思考路徑」，其追蹤從問題要素到答案之間通過相關 KG 實體的連接。每條路徑都經過驗證，以確保與臨床邏輯和循證醫學的一致性。我們的流程從 7 個醫學數據集中生成各種醫學問題的詳細推理，產生一個包含 32,682 個問答對的數據集，每個問答對都包含詳細的逐步解釋。實驗表明，使用我們的數據集進行微調可以持續提升醫療問題解決能力，使 DeepSeek-Ditill-8B 的性能提升高達 7.7%。我們性能最佳的模型 MedReason-8B 在臨床基準 MedBullets 上的表現比最先進的醫療推理模型 Huatuo-o1-8B 高出 4.2%。我們還邀請了來自不同專業的醫療專業人員來評估我們數據集的質量，以確保 MedReason 提供準確且一致的醫療推理。我們的數據、模型和代碼可在 https://github.com/UCSC-VLAA/MedReason 獲取。\n", "author": "Juncheng Wu et.al.", "authors": "Juncheng Wu, Wenlong Deng, Xingxuan Li, Sheng Liu, Taomian Mi, Yifan Peng, Ziyang Xu, Yi Liu, Hyunjin Cho, Chang-In Choi, Yihan Cao, Hui Ren, Xiang Li, Xiaoxiao Li, Yuyin Zhou", "id": "2504.00993v2", "paper_url": "http://arxiv.org/abs/2504.00993v2", "repo": "https://github.com/UCSC-VLAA/MedReason"}}