{"2408.00161": {"publish_time": "2024-07-31", "title": "Automatic Generation of Behavioral Test Cases For Natural Language Processing Using Clustering and Prompting", "paper_summary": "Recent work in behavioral testing for natural language processing (NLP)\nmodels, such as Checklist, is inspired by related paradigms in software\nengineering testing. They allow evaluation of general linguistic capabilities\nand domain understanding, hence can help evaluate conceptual soundness and\nidentify model weaknesses. However, a major challenge is the creation of test\ncases. The current packages rely on semi-automated approach using manual\ndevelopment which requires domain expertise and can be time consuming. This\npaper introduces an automated approach to develop test cases by exploiting the\npower of large language models and statistical techniques. It clusters the text\nrepresentations to carefully construct meaningful groups and then apply\nprompting techniques to automatically generate Minimal Functionality Tests\n(MFT). The well-known Amazon Reviews corpus is used to demonstrate our\napproach. We analyze the behavioral test profiles across four different\nclassification algorithms and discuss the limitations and strengths of those\nmodels.", "paper_summary_zh": "自然語言處理 (NLP) 行為測試的最新研究，例如 Checklist，是受軟體工程測試中相關範例所啟發。它們允許評估一般語言能力和領域理解，因此有助於評估概念健全性並找出模型的弱點。然而，一個主要的挑戰是如何建立測試案例。目前的套件依賴於使用手動開發的半自動化方法，這需要領域專業知識，而且可能很耗時。本文介紹了一種自動化方法，透過利用大型語言模型和統計技術來開發測試案例。它會將文本表示分群，以仔細建構有意義的群組，然後套用提示技術來自動產生最小功能測試 (MFT)。我們使用著名的 Amazon Reviews 語料庫來展示我們的做法。我們會分析四種不同分類演算法的行為測試輪廓，並討論這些模型的限制和優點。", "author": "Ying Li et.al.", "authors": "Ying Li, Rahul Singh, Tarun Joshi, Agus Sudjianto", "id": "2408.00161v1", "paper_url": "http://arxiv.org/abs/2408.00161v1", "repo": "null"}}