{"2412.07386": {"publish_time": "2024-12-10", "title": "Algorithmic Phase Transitions in Language Models: A Mechanistic Case Study of Arithmetic", "paper_summary": "Zero-shot capabilities of large language models make them powerful tools for\nsolving a range of tasks without explicit training. It remains unclear,\nhowever, how these models achieve such performance, or why they can zero-shot\nsome tasks but not others. In this paper, we shed some light on this phenomenon\nby defining and investigating algorithmic stability in language models --\nchanges in problem-solving strategy employed by the model as a result of\nchanges in task specification. We focus on a task where algorithmic stability\nis needed for generalization: two-operand arithmetic. Surprisingly, we find\nthat Gemma-2-2b employs substantially different computational models on closely\nrelated subtasks, i.e. four-digit versus eight-digit addition. Our findings\nsuggest that algorithmic instability may be a contributing factor to language\nmodels' poor zero-shot performance across certain logical reasoning tasks, as\nthey struggle to abstract different problem-solving strategies and smoothly\ntransition between them.", "paper_summary_zh": "大型語言模型的零次學習能力讓它們成為了解決各種任務的強大工具，而無需明確的訓練。然而，這些模型如何達成這樣的效能，或者為什麼它們可以對某些任務進行零次學習，而對其他任務卻不行，目前仍不清楚。在本文中，我們透過定義和研究語言模型中的演算法穩定性來闡明這種現象，也就是模型在任務規格改變後所採用的問題解決策略的改變。我們專注於需要演算法穩定性才能進行概括的任務：二元運算算術。令人驚訝的是，我們發現 Gemma-2-2b 在密切相關的子任務（例如四位數和八位數加法）上採用了截然不同的計算模型。我們的發現表明，演算法不穩定可能是語言模型在某些邏輯推理任務上表現不佳的一個因素，因為它們難以抽象出不同的問題解決策略並在它們之間順利過渡。", "author": "Alan Sun et.al.", "authors": "Alan Sun, Ethan Sun, Warren Shepard", "id": "2412.07386v1", "paper_url": "http://arxiv.org/abs/2412.07386v1", "repo": "null"}}