{"2405.09341": {"publish_time": "2024-05-15", "title": "Large Language Model Bias Mitigation from the Perspective of Knowledge Editing", "paper_summary": "Existing debiasing methods inevitably make unreasonable or undesired\npredictions as they are designated and evaluated to achieve parity across\ndifferent social groups but leave aside individual facts, resulting in modified\nexisting knowledge. In this paper, we first establish a new bias mitigation\nbenchmark BiasKE leveraging existing and additional constructed datasets, which\nsystematically assesses debiasing performance by complementary metrics on\nfairness, specificity, and generalization. Meanwhile, we propose a novel\ndebiasing method, Fairness Stamp (FAST), which enables editable fairness\nthrough fine-grained calibration on individual biased knowledge. Comprehensive\nexperiments demonstrate that FAST surpasses state-of-the-art baselines with\nremarkable debiasing performance while not hampering overall model capability\nfor knowledge preservation, highlighting the prospect of fine-grained debiasing\nstrategies for editable fairness in LLMs.", "paper_summary_zh": "現有的去偏見方法不可避免地會做出不合理或不受歡迎的預測，因為它們被指定和評估為在不同的社會群體中實現平等，但卻忽略了個別事實，導致修改現有知識。在本文中，我們首先建立一個新的偏見緩解基準 BiasKE，利用現有和額外構造的數據集，通過互補的公平性、特異性和泛化指標系統地評估去偏見性能。同時，我們提出了一種新的去偏見方法，公平標籤 (FAST)，它通過對個別偏見知識進行細粒度校準來實現可編輯的公平性。綜合實驗表明，FAST 超越了最先進的基準，具有顯著的去偏見性能，同時不損害知識保存的整體模型能力，突出了可編輯公平性中細粒度去偏見策略的前景。", "author": "Ruizhe Chen et.al.", "authors": "Ruizhe Chen, Yichen Li, Zikai Xiao, Zuozhu Liu", "id": "2405.09341v1", "paper_url": "http://arxiv.org/abs/2405.09341v1", "repo": "null"}}