{"2410.17855": {"publish_time": "2024-10-23", "title": "TAGE: Trustworthy Attribute Group Editing for Stable Few-shot Image Generation", "paper_summary": "Generative Adversarial Networks (GANs) have emerged as a prominent research\nfocus for image editing tasks, leveraging the powerful image generation\ncapabilities of the GAN framework to produce remarkable results.However,\nprevailing approaches are contingent upon extensive training datasets and\nexplicit supervision, presenting a significant challenge in manipulating the\ndiverse attributes of new image classes with limited sample availability. To\nsurmount this hurdle, we introduce TAGE, an innovative image generation network\ncomprising three integral modules: the Codebook Learning Module (CLM), the Code\nPrediction Module (CPM) and the Prompt-driven Semantic Module (PSM). The CPM\nmodule delves into the semantic dimensions of category-agnostic attributes,\nencapsulating them within a discrete codebook. This module is predicated on the\nconcept that images are assemblages of attributes, and thus, by editing these\ncategory-independent attributes, it is theoretically possible to generate\nimages from unseen categories. Subsequently, the CPM module facilitates\nnaturalistic image editing by predicting indices of category-independent\nattribute vectors within the codebook. Additionally, the PSM module generates\nsemantic cues that are seamlessly integrated into the Transformer architecture\nof the CPM, enhancing the model's comprehension of the targeted attributes for\nediting. With these semantic cues, the model can generate images that\naccentuate desired attributes more prominently while maintaining the integrity\nof the original category, even with a limited number of samples. We have\nconducted extensive experiments utilizing the Animal Faces, Flowers, and\nVGGFaces datasets. The results of these experiments demonstrate that our\nproposed method not only achieves superior performance but also exhibits a high\ndegree of stability when compared to other few-shot image generation\ntechniques.", "paper_summary_zh": "生成对抗網路 (GAN) 已成為影像編輯任務中備受矚目的研究重點，利用 GAN 架構強大的影像產生能力，產生出色的成果。然而，現行的做法有賴於大量的訓練資料集和明確的監督，在樣本取得有限的情況下，要操作新影像類別的多樣屬性，會是一項重大的挑戰。為了克服這個障礙，我們引進 TAGE，一個創新的影像產生網路，包含三個整合模組：編碼簿學習模組 (CLM)、編碼預測模組 (CPM) 和提示驅動語意模組 (PSM)。CPM 模組深入探討類別不可知屬性的語意維度，將它們封裝在一個離散的編碼簿中。這個模組建立在影像是由屬性組成的概念上，因此，透過編輯這些類別無關的屬性，理論上可以從未見過的類別中產生影像。隨後，CPM 模組透過預測編碼簿中類別無關屬性向量的索引，促進自然的影像編輯。此外，PSM 模組產生語意提示，這些提示被無縫整合到 CPM 的 Transformer 架構中，增強模型對目標屬性的理解，以進行編輯。有了這些語意提示，即使樣本數量有限，模型也能產生更突顯所需屬性的影像，同時維持原始類別的完整性。我們已使用動物臉孔、花朵和 VGGFaces 資料集進行廣泛的實驗。這些實驗的結果證明，我們提出的方法不僅能達成卓越的效能，與其他少樣本影像產生技術相比，也展現出高度的穩定性。", "author": "Ruicheng Zhang et.al.", "authors": "Ruicheng Zhang, Guoheng Huang, Yejing Huo, Xiaochen Yuan, Zhizhen Zhou, Xuhang Chen, Guo Zhong", "id": "2410.17855v1", "paper_url": "http://arxiv.org/abs/2410.17855v1", "repo": "null"}}