{"2411.08378": {"publish_time": "2024-11-13", "title": "Physics Informed Distillation for Diffusion Models", "paper_summary": "Diffusion models have recently emerged as a potent tool in generative\nmodeling. However, their inherent iterative nature often results in sluggish\nimage generation due to the requirement for multiple model evaluations. Recent\nprogress has unveiled the intrinsic link between diffusion models and\nProbability Flow Ordinary Differential Equations (ODEs), thus enabling us to\nconceptualize diffusion models as ODE systems. Simultaneously, Physics Informed\nNeural Networks (PINNs) have substantiated their effectiveness in solving\nintricate differential equations through implicit modeling of their solutions.\nBuilding upon these foundational insights, we introduce Physics Informed\nDistillation (PID), which employs a student model to represent the solution of\nthe ODE system corresponding to the teacher diffusion model, akin to the\nprinciples employed in PINNs. Through experiments on CIFAR 10 and ImageNet\n64x64, we observe that PID achieves performance comparable to recent\ndistillation methods. Notably, it demonstrates predictable trends concerning\nmethod-specific hyperparameters and eliminates the need for synthetic dataset\ngeneration during the distillation process. Both of which contribute to its\neasy-to-use nature as a distillation approach for Diffusion Models. Our code\nand pre-trained checkpoint are publicly available at:\nhttps://github.com/pantheon5100/pid_diffusion.git.", "paper_summary_zh": "擴散模型最近已成為生成模型中強而有力的工具。然而，它們固有的迭代特性通常會因為需要進行多重模型評估而導致緩慢的影像產生。最近的進展揭示了擴散模型與機率流常微分方程式 (ODE) 之間的內在關聯，因此使我們能將擴散模型概念化為 ODE 系統。同時，物理資訊神經網路 (PINN) 已證實其透過隱式建模其解來解決複雜微分方程式的有效性。奠基於這些基礎見解，我們引入了物理資訊蒸餾 (PID)，它採用一個學生模型來表示與教師擴散模型對應的 ODE 系統的解，類似於 PINN 中所採用的原理。透過在 CIFAR 10 和 ImageNet 64x64 上進行的實驗，我們觀察到 PID 達到了與最近的蒸餾方法相當的效能。值得注意的是，它展示了關於特定於方法的超參數的可預測趨勢，並消除了在蒸餾過程中對合成資料集產生的需求。這兩者都有助於它作為擴散模型的蒸餾方法易於使用的特性。我們的程式碼和預訓練檢查點可在以下網址公開取得：https://github.com/pantheon5100/pid_diffusion.git。", "author": "Joshua Tian Jin Tee et.al.", "authors": "Joshua Tian Jin Tee, Kang Zhang, Hee Suk Yoon, Dhananjaya Nagaraja Gowda, Chanwoo Kim, Chang D. Yoo", "id": "2411.08378v1", "paper_url": "http://arxiv.org/abs/2411.08378v1", "repo": "https://github.com/pantheon5100/pid_diffusion"}}