{"2412.14869": {"publish_time": "2024-12-19", "title": "AI-Powered Intracranial Hemorrhage Detection: A Co-Scale Convolutional Attention Model with Uncertainty-Based Fuzzy Integral Operator and Feature Screening", "paper_summary": "Intracranial hemorrhage (ICH) refers to the leakage or accumulation of blood\nwithin the skull, which occurs due to the rupture of blood vessels in or around\nthe brain. If this condition is not diagnosed in a timely manner and\nappropriately treated, it can lead to serious complications such as decreased\nconsciousness, permanent neurological disabilities, or even death.The primary\naim of this study is to detect the occurrence or non-occurrence of ICH,\nfollowed by determining the type of subdural hemorrhage (SDH). These tasks are\nframed as two separate binary classification problems. By adding two layers to\nthe co-scale convolutional attention (CCA) classifier architecture, we\nintroduce a novel approach for ICH detection. In the first layer, after\nextracting features from different slices of computed tomography (CT) scan\nimages, we combine these features and select the 50 components that capture the\nhighest variance in the data, considering them as informative features. We then\nassess the discriminative power of these features using the bootstrap forest\nalgorithm, discarding those that lack sufficient discriminative ability between\ndifferent classes. This algorithm explicitly determines the contribution of\neach feature to the final prediction, assisting us in developing an explainable\nAI model. The features feed into a boosting neural network as a latent feature\nspace. In the second layer, we introduce a novel uncertainty-based fuzzy\nintegral operator to fuse information from different CT scan slices. This\noperator, by accounting for the dependencies between consecutive slices,\nsignificantly improves detection accuracy.", "paper_summary_zh": "顱內出血 (ICH) 是指顱骨內血液滲漏或積聚，這是由於腦部或腦部周圍的血管破裂所致。如果這種情況未能及時診斷並適當治療，可能會導致嚴重的併發症，例如意識下降、永久性神經功能障礙，甚至死亡。本研究的主要目的是檢測 ICH 的發生或未發生，然後確定硬腦膜下出血 (SDH) 的類型。這些任務被設定為兩個獨立的二元分類問題。透過在同尺度卷積注意力 (CCA) 分類器架構中新增兩層，我們提出了一種用於 ICH 檢測的新方法。在第一層中，從電腦斷層攝影 (CT) 掃描影像的不同切片中萃取特徵後，我們會結合這些特徵並選取 50 個在資料中擷取最高變異數的組成部分，將它們視為有意義的特徵。然後，我們使用 bootstrap forest 演算法評估這些特徵的判別力，並捨棄在不同類別之間缺乏足夠判別能力的特徵。此演算法會明確地確定每個特徵對最終預測的貢獻，協助我們開發可解釋的 AI 模型。這些特徵會作為潛在特徵空間提供給提升神經網路。在第二層中，我們引入了一種新的基於不確定性的模糊積分算子，以融合來自不同 CT 掃描切片的資訊。此算子透過考量連續切片之間的依賴性，大幅提升了檢測準確度。", "author": "Mehdi Hosseini Chagahi et.al.", "authors": "Mehdi Hosseini Chagahi, Md. Jalil Piran, Niloufar Delfan, Behzad Moshiri, Jaber Hatam Parikhan", "id": "2412.14869v1", "paper_url": "http://arxiv.org/abs/2412.14869v1", "repo": "null"}}