{"2410.10556": {"publish_time": "2024-10-14", "title": "Is Structure Dependence Shaped for Efficient Communication?: A Case Study on Coordination", "paper_summary": "Natural language exhibits various universal properties. But why do these\nuniversals exist? One explanation is that they arise from functional pressures\nto achieve efficient communication, a view which attributes cross-linguistic\nproperties to domain-general cognitive abilities. This hypothesis has\nsuccessfully addressed some syntactic universal properties such as\ncompositionality and Greenbergian word order universals. However, more abstract\nsyntactic universals have not been explored from the perspective of efficient\ncommunication. Among such universals, the most notable one is structure\ndependence, that is, the existence of grammar-internal operations that\ncrucially depend on hierarchical representations. This property has\ntraditionally been taken to be central to natural language and to involve\ndomain-specific knowledge irreducible to communicative efficiency.\n  In this paper, we challenge the conventional view by investigating whether\nstructure dependence realizes efficient communication, focusing on coordinate\nstructures. We design three types of artificial languages: (i) one with a\nstructure-dependent reduction operation, which is similar to natural language,\n(ii) one without any reduction operations, and (iii) one with a linear (rather\nthan structure-dependent) reduction operation. We quantify the communicative\nefficiency of these languages. The results demonstrate that the language with\nthe structure-dependent reduction operation is significantly more\ncommunicatively efficient than the counterfactual languages. This suggests that\nthe existence of structure-dependent properties can be explained from the\nperspective of efficient communication.", "paper_summary_zh": "自然語言展現出各種普遍特性。但為何這些普遍性存在？一種解釋是它們來自於實現有效溝通的功能壓力，一種將跨語言特性歸因於領域通用的認知能力的觀點。這個假設已成功地處理了一些句法普遍特性，例如組合性和格林伯格式詞序普遍性。然而，更抽象的句法普遍性尚未從有效溝通的角度加以探討。在這些普遍性中，最顯著的一個是結構依賴性，也就是文法內部運算的存在，其關鍵在於階層式表徵。這個特性傳統上被認為是自然語言的中心，並涉及無法簡化為溝通效率的領域特定知識。\n  在本文中，我們透過探討結構依賴性是否實現有效溝通來挑戰傳統觀點，重點在於並列結構。我們設計了三種類型的語言：(i) 一種具結構依賴性簡化運算的語言，類似於自然語言，(ii) 一種沒有任何簡化運算的語言，以及 (iii) 一種具有線性（而非結構依賴性）簡化運算的語言。我們量化這些語言的溝通效率。結果表明，具有結構依賴性簡化運算的語言顯著優於反事實語言的溝通效率。這表明結構依賴性特性的存在可以從有效溝通的角度來解釋。", "author": "Kohei Kajikawa et.al.", "authors": "Kohei Kajikawa, Yusuke Kubota, Yohei Oseki", "id": "2410.10556v1", "paper_url": "http://arxiv.org/abs/2410.10556v1", "repo": "https://github.com/kohei-kaji/coordination"}}