{"2405.05336": {"publish_time": "2024-05-08", "title": "Joint semi-supervised and contrastive learning enables zero-shot domain-adaptation and multi-domain segmentation", "paper_summary": "Despite their effectiveness, current deep learning models face challenges\nwith images coming from different domains with varying appearance and content.\nWe introduce SegCLR, a versatile framework designed to segment volumetric\nimages across different domains, employing supervised and contrastive learning\nsimultaneously to effectively learn from both labeled and unlabeled data. We\ndemonstrate the superior performance of SegCLR through a comprehensive\nevaluation involving three diverse clinical datasets of retinal fluid\nsegmentation in 3D Optical Coherence Tomography (OCT), various network\nconfigurations, and verification across 10 different network initializations.\nIn an unsupervised domain adaptation context, SegCLR achieves results on par\nwith a supervised upper-bound model trained on the intended target domain.\nNotably, we discover that the segmentation performance of SegCLR framework is\nmarginally impacted by the abundance of unlabeled data from the target domain,\nthereby we also propose an effective zero-shot domain adaptation extension of\nSegCLR, eliminating the need for any target domain information. This shows that\nour proposed addition of contrastive loss in standard supervised training for\nsegmentation leads to superior models, inherently more generalizable to both\nin- and out-of-domain test data. We additionally propose a pragmatic solution\nfor SegCLR deployment in realistic scenarios with multiple domains containing\nlabeled data. Accordingly, our framework pushes the boundaries of deep-learning\nbased segmentation in multi-domain applications, regardless of data\navailability - labeled, unlabeled, or nonexistent.", "paper_summary_zh": "儘管深度學習模型有效，但目前的模型在處理來自不同領域、外觀和內容各異的影像時會遇到挑戰。\n我們引入了 SegCLR，這是一個多功能的架構，旨在分割不同領域的體積影像，同時採用監督式學習和對比式學習，有效地從標籤資料和未標籤資料中學習。我們透過一項全面的評估來展示 SegCLR 的卓越效能，其中包含三個不同的臨床資料集，包括 3D 光學相干斷層掃描 (OCT) 中的視網膜液體分割、各種網路組態以及跨 10 個不同網路初始化的驗證。\n在非監督領域適應的背景下，SegCLR 達到的結果與在預期的目標領域中訓練的監督式上限模型相當。\n值得注意的是，我們發現 SegCLR 框架的分割效能幾乎不受目標領域中大量未標籤資料的影響，因此我們也提出了 SegCLR 的一個有效的零次域適應延伸，消除了對任何目標領域資訊的需求。這顯示出我們在標準監督式訓練中加入對比損失的提議，可產生卓越的模型，本質上更能概括到領域內和領域外的測試資料。我們還提出了 SegCLR 在包含標籤資料的多個領域的實際場景中部署的務實解決方案。因此，我們的框架推動了基於深度學習的分割在多領域應用中的界限，無論資料可用性如何 - 標籤、未標籤或不存在。", "author": "Alvaro Gomariz et.al.", "authors": "Alvaro Gomariz, Yusuke Kikuchi, Yun Yvonna Li, Thomas Albrecht, Andreas Maunz, Daniela Ferrara, Huanxiang Lu, Orcun Goksel", "id": "2405.05336v1", "paper_url": "http://arxiv.org/abs/2405.05336v1", "repo": "null"}}