{"2502.14846": {"publish_time": "2025-02-20", "title": "Scaling Text-Rich Image Understanding via Code-Guided Synthetic Multimodal Data Generation", "paper_summary": "Reasoning about images with rich text, such as charts and documents, is a\ncritical application of vision-language models (VLMs). However, VLMs often\nstruggle in these domains due to the scarcity of diverse text-rich\nvision-language data. To address this challenge, we present CoSyn, a framework\nthat leverages the coding capabilities of text-only large language models\n(LLMs) to automatically create synthetic text-rich multimodal data. Given input\ntext describing a target domain (e.g., \"nutrition fact labels\"), CoSyn prompts\nan LLM to generate code (Python, HTML, LaTeX, etc.) for rendering synthetic\nimages. With the underlying code as textual representations of the synthetic\nimages, CoSyn can generate high-quality instruction-tuning data, again relying\non a text-only LLM. Using CoSyn, we constructed a dataset comprising 400K\nimages and 2.7M rows of vision-language instruction-tuning data. Comprehensive\nexperiments on seven benchmarks demonstrate that models trained on our\nsynthetic data achieve state-of-the-art performance among competitive\nopen-source models, including Llama 3.2, and surpass proprietary models such as\nGPT-4V and Gemini 1.5 Flash. Furthermore, CoSyn can produce synthetic pointing\ndata, enabling VLMs to ground information within input images, showcasing its\npotential for developing multimodal agents capable of acting in real-world\nenvironments.", "paper_summary_zh": "透過豐富文字（例如圖表和文件）對影像進行推理，是視覺語言模型 (VLM) 的重要應用。然而，由於多元化文字豐富的視覺語言資料稀少，VLM 在這些領域中經常會遇到困難。為了應對這個挑戰，我們提出了 CoSyn，一個利用純文字大型語言模型 (LLM) 的編碼能力來自動建立合成文字豐富多模態資料的架構。給定描述目標網域的輸入文字（例如「營養成分標籤」），CoSyn 會提示 LLM 產生用於合成影像渲染的程式碼（Python、HTML、LaTeX 等）。透過將底層程式碼作為合成影像的文字表示，CoSyn 可以產生高品質的指令調整資料，再次依賴純文字 LLM。使用 CoSyn，我們建構了一個包含 40 萬張影像和 270 萬列視覺語言指令調整資料的資料集。在七個基準上的全面實驗證明，在我們的合成資料上訓練的模型在競爭對手的開源模型（包括 Llama 3.2）中達到了最先進的效能，並超越了 GPT-4V 和 Gemini 1.5 Flash 等專有模型。此外，CoSyn 可以產生合成指向資料，讓 VLM 能在輸入影像中建立資訊基礎，展示其在開發能夠在真實世界環境中運作的多模態代理方面的潛力。", "author": "Yue Yang et.al.", "authors": "Yue Yang, Ajay Patel, Matt Deitke, Tanmay Gupta, Luca Weihs, Andrew Head, Mark Yatskar, Chris Callison-Burch, Ranjay Krishna, Aniruddha Kembhavi, Christopher Clark", "id": "2502.14846v1", "paper_url": "http://arxiv.org/abs/2502.14846v1", "repo": "null"}}