{"2407.12943": {"publish_time": "2024-07-17", "title": "Halu-J: Critique-Based Hallucination Judge", "paper_summary": "Large language models (LLMs) frequently generate non-factual content, known\nas hallucinations. Existing retrieval-augmented-based hallucination detection\napproaches typically address this by framing it as a classification task,\nevaluating hallucinations based on their consistency with retrieved evidence.\nHowever, this approach usually lacks detailed explanations for these\nevaluations and does not assess the reliability of these explanations.\nFurthermore, deficiencies in retrieval systems can lead to irrelevant or\npartially relevant evidence retrieval, impairing the detection process.\nMoreover, while real-world hallucination detection requires analyzing multiple\npieces of evidence, current systems usually treat all evidence uniformly\nwithout considering its relevance to the content. To address these challenges,\nwe introduce Halu-J, a critique-based hallucination judge with 7 billion\nparameters. Halu-J enhances hallucination detection by selecting pertinent\nevidence and providing detailed critiques. Our experiments indicate that Halu-J\noutperforms GPT-4o in multiple-evidence hallucination detection and matches its\ncapability in critique generation and evidence selection. We also introduce\nME-FEVER, a new dataset designed for multiple-evidence hallucination detection.\nOur code and dataset can be found in https://github.com/GAIR-NLP/factool .", "paper_summary_zh": "大型語言模型 (LLM) 經常產生非事實性的內容，稱為幻覺。現有的檢索增強型幻覺偵測方法通常將其設定為分類任務，根據幻覺與檢索證據的一致性來評估幻覺。然而，這種方法通常缺乏對這些評估的詳細說明，並且不會評估這些說明的可靠性。此外，檢索系統的缺陷可能會導致檢索到不相關或部分相關的證據，從而損害偵測過程。此外，雖然現實世界的幻覺檢測需要分析多個證據，但目前的系統通常會統一處理所有證據，而不考慮其與內容相關性。為了應對這些挑戰，我們引入了 Halu-J，一個基於批評的幻覺評審，有 70 億個參數。Halu-J 透過選擇相關證據並提供詳細的批評來增強幻覺檢測。我們的實驗表明，Halu-J 在多證據幻覺檢測中優於 GPT-4o，並在批評產生和證據選擇中與其能力相匹配。我們還引入了 ME-FEVER，一個專為多證據幻覺檢測而設計的新資料集。我們的程式碼和資料集可以在 https://github.com/GAIR-NLP/factool 中找到。", "author": "Binjie Wang et.al.", "authors": "Binjie Wang, Steffi Chern, Ethan Chern, Pengfei Liu", "id": "2407.12943v1", "paper_url": "http://arxiv.org/abs/2407.12943v1", "repo": "null"}}