{"2409.20498": {"publish_time": "2024-09-30", "title": "Enhancing Romanian Offensive Language Detection through Knowledge Distillation, Multi-Task Learning, and Data Augmentation", "paper_summary": "This paper highlights the significance of natural language processing (NLP)\nwithin artificial intelligence, underscoring its pivotal role in comprehending\nand modeling human language. Recent advancements in NLP, particularly in\nconversational bots, have garnered substantial attention and adoption among\ndevelopers. This paper explores advanced methodologies for attaining smaller\nand more efficient NLP models. Specifically, we employ three key approaches:\n(1) training a Transformer-based neural network to detect offensive language,\n(2) employing data augmentation and knowledge distillation techniques to\nincrease performance, and (3) incorporating multi-task learning with knowledge\ndistillation and teacher annealing using diverse datasets to enhance\nefficiency. The culmination of these methods has yielded demonstrably improved\noutcomes.", "paper_summary_zh": "本文重点阐述自然语言处理 (NLP) 在人工智能中的重要性，强调其在理解和建模人类语言中至关重要的作用。NLP 的最新进展，尤其是在会话机器人方面，已引起开发人员的极大关注和采用。本文探讨了实现更小、更高效的 NLP 模型的高级方法。具体来说，我们采用了三种关键方法：(1) 训练基于 Transformer 的神经网络来检测攻击性语言，(2) 采用数据增强和知识蒸馏技术来提高性能，以及 (3) 结合多任务学习与知识蒸馏和教师退火，使用不同的数据集来提高效率。这些方法的结合产生了明显改善的结果。", "author": "Vlad-Cristian Matei et.al.", "authors": "Vlad-Cristian Matei, Iulian-Marius Tăiatu, Răzvan-Alexandru Smădu, Dumitru-Clementin Cercel", "id": "2409.20498v1", "paper_url": "http://arxiv.org/abs/2409.20498v1", "repo": "null"}}