{"2409.18313": {"publish_time": "2024-09-26", "title": "Embodied-RAG: General non-parametric Embodied Memory for Retrieval and Generation", "paper_summary": "There is no limit to how much a robot might explore and learn, but all of\nthat knowledge needs to be searchable and actionable. Within language research,\nretrieval augmented generation (RAG) has become the workhouse of large-scale\nnon-parametric knowledge, however existing techniques do not directly transfer\nto the embodied domain, which is multimodal, data is highly correlated, and\nperception requires abstraction.\n  To address these challenges, we introduce Embodied-RAG, a framework that\nenhances the foundational model of an embodied agent with a non-parametric\nmemory system capable of autonomously constructing hierarchical knowledge for\nboth navigation and language generation. Embodied-RAG handles a full range of\nspatial and semantic resolutions across diverse environments and query types,\nwhether for a specific object or a holistic description of ambiance. At its\ncore, Embodied-RAG's memory is structured as a semantic forest, storing\nlanguage descriptions at varying levels of detail. This hierarchical\norganization allows the system to efficiently generate context-sensitive\noutputs across different robotic platforms. We demonstrate that Embodied-RAG\neffectively bridges RAG to the robotics domain, successfully handling over 200\nexplanation and navigation queries across 19 environments, highlighting its\npromise for general-purpose non-parametric system for embodied agents.", "paper_summary_zh": "機器人的探索和學習沒有限制，但所有這些知識都需要可搜尋且可操作。在語言研究中，檢索擴增生成 (RAG) 已成為大規模非參數知識的基礎，但現有技術並未直接轉移到具多模態、資料高度相關且感知需要抽象的具身領域。\n為了應對這些挑戰，我們引入了 Embodied-RAG，一個增強了具身代理基礎模型的框架，具備非參數記憶系統，能夠自主建構階層式知識，以進行導航和語言生成。Embodied-RAG 處理各種環境和查詢類型中的完整空間和語義解析，無論是針對特定物件或環境的整體描述。在核心部分，Embodied-RAG 的記憶被結構化為語義森林，儲存不同詳細程度的語言描述。這種階層組織讓系統能夠在不同的機器人平台上有效產生與情境相關的輸出。我們證明了 Embodied-RAG 有效地將 RAG 橋接到機器人領域，成功處理了 19 個環境中超過 200 個解釋和導航查詢，突顯了它對具身代理的一般用途非參數系統的承諾。", "author": "Quanting Xie et.al.", "authors": "Quanting Xie, So Yeon Min, Tianyi Zhang, Aarav Bajaj, Ruslan Salakhutdinov, Matthew Johnson-Roberson, Yonatan Bisk", "id": "2409.18313v1", "paper_url": "http://arxiv.org/abs/2409.18313v1", "repo": "null"}}