{"2409.04007": {"publish_time": "2024-09-06", "title": "Searching for Effective Preprocessing Method and CNN-based Architecture with Efficient Channel Attention on Speech Emotion Recognition", "paper_summary": "Speech emotion recognition (SER) classifies human emotions in speech with a\ncomputer model. Recently, performance in SER has steadily increased as deep\nlearning techniques have adapted. However, unlike many domains that use speech\ndata, data for training in the SER model is insufficient. This causes\noverfitting of training of the neural network, resulting in performance\ndegradation. In fact, successful emotion recognition requires an effective\npreprocessing method and a model structure that efficiently uses the number of\nweight parameters. In this study, we propose using eight dataset versions with\ndifferent frequency-time resolutions to search for an effective emotional\nspeech preprocessing method. We propose a 6-layer convolutional neural network\n(CNN) model with efficient channel attention (ECA) to pursue an efficient model\nstructure. In particular, the well-positioned ECA blocks can improve channel\nfeature representation with only a few parameters. With the interactive\nemotional dyadic motion capture (IEMOCAP) dataset, increasing the frequency\nresolution in preprocessing emotional speech can improve emotion recognition\nperformance. Also, ECA after the deep convolution layer can effectively\nincrease channel feature representation. Consequently, the best result (79.37UA\n79.68WA) can be obtained, exceeding the performance of previous SER models.\nFurthermore, to compensate for the lack of emotional speech data, we experiment\nwith multiple preprocessing data methods that augment trainable data\npreprocessed with all different settings from one sample. In the experiment, we\ncan achieve the highest result (80.28UA 80.46WA).", "paper_summary_zh": "語音情緒辨識 (SER) 利用電腦模型對人類在語音中的情緒進行分類。最近，隨著深度學習技術的應用，SER 的表現持續提升。然而，與許多使用語音資料的領域不同，訓練 SER 模型的資料不足。這會造成神經網路訓練過度擬合，導致效能下降。事實上，成功的語音辨識需要一個有效的前處理方法和一個有效利用權重參數數量之模型結構。在本研究中，我們提出使用八個具有不同頻率時間解析度的資料集版本來搜尋一個有效的情緒化語音前處理方法。我們提出一個具有高效通道注意力 (ECA) 的 6 層卷積神經網路 (CNN) 模型，以追求一個高效的模型結構。特別是，位置良好的 ECA 區塊僅使用少數參數就能改善通道特徵表示。透過互動式情緒化二元動作捕捉 (IEMOCAP) 資料集，提升前處理情緒化語音中的頻率解析度可以改善情緒辨識效能。此外，深度卷積層之後的 ECA 可以有效提升通道特徵表示。因此，可以獲得最佳結果 (79.37UA 79.68WA)，超越先前的 SER 模型效能。此外，為了解決情緒化語音資料不足的問題，我們嘗試使用多重前處理資料方法，這些方法會擴增來自一個範例的所有不同設定中經過前處理的可訓練資料。在實驗中，我們可以獲得最高結果 (80.28UA 80.46WA)。", "author": "Byunggun Kim et.al.", "authors": "Byunggun Kim, Younghun Kwon", "id": "2409.04007v1", "paper_url": "http://arxiv.org/abs/2409.04007v1", "repo": "null"}}