{"2405.19479": {"publish_time": "2024-05-29", "title": "Participation in the age of foundation models", "paper_summary": "Growing interest and investment in the capabilities of foundation models has\npositioned such systems to impact a wide array of public services. Alongside\nthese opportunities is the risk that these systems reify existing power\nimbalances and cause disproportionate harm to marginalized communities.\nParticipatory approaches hold promise to instead lend agency and\ndecision-making power to marginalized stakeholders. But existing approaches in\nparticipatory AI/ML are typically deeply grounded in context - how do we apply\nthese approaches to foundation models, which are, by design, disconnected from\ncontext? Our paper interrogates this question.\n  First, we examine existing attempts at incorporating participation into\nfoundation models. We highlight the tension between participation and scale,\ndemonstrating that it is intractable for impacted communities to meaningfully\nshape a foundation model that is intended to be universally applicable. In\nresponse, we develop a blueprint for participatory foundation models that\nidentifies more local, application-oriented opportunities for meaningful\nparticipation. In addition to the \"foundation\" layer, our framework proposes\nthe \"subfloor'' layer, in which stakeholders develop shared technical\ninfrastructure, norms and governance for a grounded domain, and the \"surface''\nlayer, in which affected communities shape the use of a foundation model for a\nspecific downstream task. The intermediate \"subfloor'' layer scopes the range\nof potential harms to consider, and affords communities more concrete avenues\nfor deliberation and intervention. At the same time, it avoids duplicative\neffort by scaling input across relevant use cases. Through three case studies\nin clinical care, financial services, and journalism, we illustrate how this\nmulti-layer model can create more meaningful opportunities for participation\nthan solely intervening at the foundation layer.", "paper_summary_zh": "<paragraph>對於基礎模型能力的興趣和投資日益增長，已使此類系統能夠影響廣泛的公共服務。除了這些機會之外，這些系統還存在強化既有權力失衡並對邊緣化社群造成不成比例傷害的風險。參與式方法有望賦予邊緣化利益相關者代理權和決策權。但現有的參與式 AI/ML 方法通常深植於脈絡中 - 我們如何將這些方法應用於基礎模型，而這些模型在設計上與脈絡無關？我們的論文審視了這個問題。\n首先，我們檢視將參與納入基礎模型的既有嘗試。我們強調參與與規模之間的緊張關係，證明受影響的社群難以有意義地塑造一個旨在普遍適用的基礎模型。為了解決這個問題，我們制定了一個參與式基礎模型藍圖，找出更在地化、更以應用為導向的有意義參與機會。除了「基礎」層，我們的架構還提出了「次層」層，在其中，利益相關者會為一個紮根的領域開發共享技術基礎設施、規範和治理，以及「表面」層，在其中，受影響的社群會塑造基礎模型在特定下游任務中的使用方式。中間的「次層」層界定了要考量的潛在危害範圍，並為社群提供了更具體的審議和介入管道。同時，它透過擴展輸入到相關用例中來避免重複的努力。透過臨床照護、金融服務和新聞業中的三個案例研究，我們說明了這個多層模型如何能創造出比僅在基礎層進行介入更有意義的參與機會。</paragraph>", "author": "Harini Suresh et.al.", "authors": "Harini Suresh, Emily Tseng, Meg Young, Mary L. Gray, Emma Pierson, Karen Levy", "id": "2405.19479v1", "paper_url": "http://arxiv.org/abs/2405.19479v1", "repo": "null"}}