{"2411.19557": {"publish_time": "2024-11-29", "title": "Initialization using Update Approximation is a Silver Bullet for Extremely Efficient Low-Rank Fine-Tuning", "paper_summary": "Low-rank adapters have become a standard approach for efficiently fine-tuning\nlarge language models (LLMs), but they often fall short of achieving the\nperformance of full fine-tuning. We propose a method, LoRA Silver Bullet or\nLoRA-SB, that approximates full fine-tuning within low-rank subspaces using a\ncarefully designed initialization strategy. We theoretically demonstrate that\nthe architecture of LoRA-XS, which inserts a trainable (r x r) matrix between B\nand A while keeping other matrices fixed, provides the precise conditions\nneeded for this approximation. We leverage its constrained update space to\nachieve optimal scaling for high-rank gradient updates while removing the need\nfor hyperparameter tuning. We prove that our initialization offers an optimal\nlow-rank approximation of the initial gradient and preserves update directions\nthroughout training. Extensive experiments across mathematical reasoning,\ncommonsense reasoning, and language understanding tasks demonstrate that our\napproach exceeds the performance of standard LoRA while using 27-90x fewer\nparameters, and comprehensively outperforms LoRA-XS. Our findings establish\nthat it is possible to simulate full fine-tuning in low-rank subspaces, and\nachieve significant efficiency gains without sacrificing performance. Our code\nis publicly available at https://github.com/RaghavSinghal10/lora-sb.", "paper_summary_zh": "低秩適配器已成為有效微調大型語言模型 (LLM) 的標準方法，但它們通常無法達到完全微調的效能。我們提出了一種方法，稱為 LoRA 銀彈或 LoRA-SB，它使用精心設計的初始化策略，在低秩子空間中近似完全微調。我們在理論上證明了 LoRA-XS 的架構，它在 B 和 A 之間插入一個可訓練的 (r x r) 矩陣，同時保持其他矩陣固定，提供了此近似所需的精確條件。我們利用其受限的更新空間，在移除超參數調整需求的同時，實現高秩梯度更新的最佳縮放。我們證明我們的初始化提供了初始梯度的最佳低秩近似，並在整個訓練過程中保留更新方向。跨越數學推理、常識推理和語言理解任務的廣泛實驗證明，我們的做法超過了標準 LoRA 的效能，同時使用少 27-90 倍的參數，並全面優於 LoRA-XS。我們的發現證實了在低秩子空間中模擬完全微調是可行的，而且可以在不犧牲效能的情況下實現顯著的效率提升。我們的程式碼可在 https://github.com/RaghavSinghal10/lora-sb 公開取得。", "author": "Kaustubh Ponkshe et.al.", "authors": "Kaustubh Ponkshe, Raghav Singhal, Eduard Gorbunov, Alexey Tumanov, Samuel Horvath, Praneeth Vepakomma", "id": "2411.19557v1", "paper_url": "http://arxiv.org/abs/2411.19557v1", "repo": "https://github.com/raghavsinghal10/lora-sb"}}