{"2409.08702": {"publish_time": "2024-09-13", "title": "DM: Dual-path Magnitude Network for General Speech Restoration", "paper_summary": "In this paper, we introduce a novel general speech restoration model: the\nDual-path Magnitude (DM) network, designed to address multiple distortions\nincluding noise, reverberation, and bandwidth degradation effectively. The DM\nnetwork employs dual parallel magnitude decoders that share parameters: one\nuses a masking-based algorithm for distortion removal and the other employs a\nmapping-based approach for speech restoration. A novel aspect of the DM network\nis the integration of the magnitude spectrogram output from the masking decoder\ninto the mapping decoder through a skip connection, enhancing the overall\nrestoration capability. This integrated approach overcomes the inherent\nlimitations observed in previous models, as detailed in a step-by-step\nanalysis. The experimental results demonstrate that the DM network outperforms\nother baseline models in the comprehensive aspect of general speech\nrestoration, achieving substantial restoration with fewer parameters.", "paper_summary_zh": "在本文中，我們提出了一個新穎的通用語音還原模型：雙路幅度 (DM) 網路，旨在有效解決包括噪聲、殘響和頻寬衰減在內的各種失真。DM 網路採用共享參數的雙並行幅度解碼器：一個使用基於遮罩的演算法來移除失真，另一個採用基於對應的語音還原方法。DM 網路的一個新穎面向是將遮罩解碼器的幅度頻譜圖輸出透過跳躍連線整合到對應解碼器中，增強整體還原能力。這種整合方法克服了先前模型中觀察到的固有限制，如逐步分析中所述。實驗結果表明，DM 網路在通用語音還原的綜合方面優於其他基準模型，以較少的參數實現顯著的還原。", "author": "Da-Hee Yang et.al.", "authors": "Da-Hee Yang, Dail Kim, Joon-Hyuk Chang, Jeonghwan Choi, Han-gil Moon", "id": "2409.08702v1", "paper_url": "http://arxiv.org/abs/2409.08702v1", "repo": "null"}}