{"2411.19946": {"publish_time": "2024-11-29", "title": "DELT: A Simple Diversity-driven EarlyLate Training for Dataset Distillation", "paper_summary": "Recent advances in dataset distillation have led to solutions in two main\ndirections. The conventional batch-to-batch matching mechanism is ideal for\nsmall-scale datasets and includes bi-level optimization methods on models and\nsyntheses, such as FRePo, RCIG, and RaT-BPTT, as well as other methods like\ndistribution matching, gradient matching, and weight trajectory matching.\nConversely, batch-to-global matching typifies decoupled methods, which are\nparticularly advantageous for large-scale datasets. This approach has garnered\nsubstantial interest within the community, as seen in SRe$^2$L, G-VBSM, WMDD,\nand CDA. A primary challenge with the second approach is the lack of diversity\namong syntheses within each class since samples are optimized independently and\nthe same global supervision signals are reused across different synthetic\nimages. In this study, we propose a new Diversity-driven EarlyLate Training\n(DELT) scheme to enhance the diversity of images in batch-to-global matching\nwith less computation. Our approach is conceptually simple yet effective, it\npartitions predefined IPC samples into smaller subtasks and employs local\noptimizations to distill each subset into distributions from distinct phases,\nreducing the uniformity induced by the unified optimization process. These\ndistilled images from the subtasks demonstrate effective generalization when\napplied to the entire task. We conduct extensive experiments on CIFAR,\nTiny-ImageNet, ImageNet-1K, and its sub-datasets. Our approach outperforms the\nprevious state-of-the-art by 2$\\sim$5% on average across different datasets and\nIPCs (images per class), increasing diversity per class by more than 5% while\nreducing synthesis time by up to 39.3% for enhancing the training efficiency.\nCode is available at: https://github.com/VILA-Lab/DELT.", "paper_summary_zh": "<paragraph>資料集萃取的最新進展已導致兩個主要方向的解決方案。傳統的批次對批次匹配機制非常適合小規模資料集，包括模型和合成上的雙層最佳化方法，例如 FRePo、RCIG 和 RaT-BPTT，以及分佈匹配、梯度匹配和權重軌跡匹配等其他方法。相反，批次對全局匹配是解耦方法的典型，這對於大規模資料集特別有利。這種方法在社群中引起了極大的興趣，如在 SRe$^2$L、G-VBSM、WMDD 和 CDA 中所見。第二種方法的主要挑戰是每個類別內的合成缺乏多樣性，因為範例是獨立最佳化的，並且相同的全局監督訊號在不同的合成影像中重複使用。在本研究中，我們提出了一種新的多樣性驅動的早期後期訓練 (DELT) 方案，以增強批次對全局匹配中影像的多樣性，並減少運算。我們的做法在概念上既簡單又有效，它將預定義的 IPC 範例分割成更小的子任務，並採用局部最佳化將每個子集萃取成不同階段的分布，減少統一最佳化流程所導致的一致性。這些來自子任務的萃取影像在應用於整個任務時展現了有效的概化。我們對 CIFAR、Tiny-ImageNet、ImageNet-1K 及其子資料集進行了廣泛的實驗。我們的做法在不同的資料集和 IPC（每個類別的影像）中平均比先前的最新技術高出 2$\\sim$5%，每個類別的多樣性增加了 5% 以上，同時將合成時間減少了 39.3%，以提高訓練效率。程式碼可在 https://github.com/VILA-Lab/DELT 取得。</paragraph>", "author": "Zhiqiang Shen et.al.", "authors": "Zhiqiang Shen, Ammar Sherif, Zeyuan Yin, Shitong Shao", "id": "2411.19946v1", "paper_url": "http://arxiv.org/abs/2411.19946v1", "repo": "https://github.com/vila-lab/delt"}}