{"2410.08113": {"publish_time": "2024-10-10", "title": "Robust AI-Generated Text Detection by Restricted Embeddings", "paper_summary": "Growing amount and quality of AI-generated texts makes detecting such content\nmore difficult. In most real-world scenarios, the domain (style and topic) of\ngenerated data and the generator model are not known in advance. In this work,\nwe focus on the robustness of classifier-based detectors of AI-generated text,\nnamely their ability to transfer to unseen generators or semantic domains. We\ninvestigate the geometry of the embedding space of Transformer-based text\nencoders and show that clearing out harmful linear subspaces helps to train a\nrobust classifier, ignoring domain-specific spurious features. We investigate\nseveral subspace decomposition and feature selection strategies and achieve\nsignificant improvements over state of the art methods in cross-domain and\ncross-generator transfer. Our best approaches for head-wise and\ncoordinate-based subspace removal increase the mean out-of-distribution (OOD)\nclassification score by up to 9% and 14% in particular setups for RoBERTa and\nBERT embeddings respectively. We release our code and data:\nhttps://github.com/SilverSolver/RobustATD", "paper_summary_zh": "人工智能生成文本的数量和质量不断提高，使得检测此类内容变得更加困难。在大多数实际场景中，生成数据的域（样式和主题）和生成器模型事先并不知道。在这项工作中，我们专注于基于分类器的 AI 生成的文本检测器的鲁棒性，即它们转移到未见的生成器或语义域的能力。我们研究了基于 Transformer 的文本编码器的嵌入空间的几何形状，并表明清除有害的线性子空间有助于训练鲁棒分类器，忽略特定于域的虚假特征。我们研究了几个子空间分解和特征选择策略，并在跨域和跨生成器转移中实现了对现有技术的重大改进。我们用于逐头和基于坐标的子空间移除的最佳方法将平均分布外 (OOD) 分类分数分别提高了 RoBERTa 和 BERT 嵌入的特定设置中的 9% 和 14%。我们发布我们的代码和数据：https://github.com/SilverSolver/RobustATD", "author": "Kristian Kuznetsov et.al.", "authors": "Kristian Kuznetsov, Eduard Tulchinskii, Laida Kushnareva, German Magai, Serguei Barannikov, Sergey Nikolenko, Irina Piontkovskaya", "id": "2410.08113v1", "paper_url": "http://arxiv.org/abs/2410.08113v1", "repo": "null"}}