{"2405.17372": {"publish_time": "2024-05-27", "title": "BehaviorGPT: Smart Agent Simulation for Autonomous Driving with Next-Patch Prediction", "paper_summary": "Simulating realistic interactions among traffic agents is crucial for\nefficiently validating the safety of autonomous driving systems. Existing\nleading simulators primarily use an encoder-decoder structure to encode the\nhistorical trajectories for future simulation. However, such a paradigm\ncomplicates the model architecture, and the manual separation of history and\nfuture trajectories leads to low data utilization. To address these challenges,\nwe propose Behavior Generative Pre-trained Transformers (BehaviorGPT), a\ndecoder-only, autoregressive architecture designed to simulate the sequential\nmotion of multiple agents. Crucially, our approach discards the traditional\nseparation between \"history\" and \"future,\" treating each time step as the\n\"current\" one, resulting in a simpler, more parameter- and data-efficient\ndesign that scales seamlessly with data and computation. Additionally, we\nintroduce the Next-Patch Prediction Paradigm (NP3), which enables models to\nreason at the patch level of trajectories and capture long-range\nspatial-temporal interactions. BehaviorGPT ranks first across several metrics\non the Waymo Sim Agents Benchmark, demonstrating its exceptional performance in\nmulti-agent and agent-map interactions. We outperformed state-of-the-art models\nwith a realism score of 0.741 and improved the minADE metric to 1.540, with an\napproximately 91.6% reduction in model parameters.", "paper_summary_zh": "模擬交通代理之間的真實互動對於有效驗證自動駕駛系統的安全性至關重要。現有的領先模擬器主要使用編碼器-解碼器結構來編碼歷史軌跡以進行未來模擬。然而，這樣的範例使模型架構複雜化，並且歷史和未來軌跡的手動分離導致資料利用率低。為了應對這些挑戰，我們提出了行為生成式預訓練Transformer (BehaviorGPT)，這是一種僅解碼器、自迴歸架構，旨在模擬多個代理的序列運動。至關重要的是，我們的做法捨棄了「歷史」和「未來」之間的傳統區分，將每個時間步驟視為「當前」步驟，從而產生一個更簡單、更具參數和資料效率的設計，可與資料和運算無縫擴展。此外，我們引入了下一個區塊預測範例 (NP3)，使模型能夠在軌跡的區塊層級進行推理，並捕捉長程時空互動。BehaviorGPT 在 Waymo Sim Agents Benchmark 的多項指標中排名第一，證明了其在多代理和代理地圖互動中的出色效能。我們以 0.741 的真實感得分優於最先進的模型，並將 minADE 指標提升至 1.540，模型參數減少了約 91.6%。", "author": "Zikang Zhou et.al.", "authors": "Zikang Zhou, Haibo Hu, Xinhong Chen, Jianping Wang, Nan Guan, Kui Wu, Yung-Hui Li, Yu-Kai Huang, Chun Jason Xue", "id": "2405.17372v1", "paper_url": "http://arxiv.org/abs/2405.17372v1", "repo": "null"}}