{"2502.03200": {"publish_time": "2025-02-05", "title": "CORTEX: A Cost-Sensitive Rule and Tree Extraction Method", "paper_summary": "Tree-based and rule-based machine learning models play pivotal roles in\nexplainable artificial intelligence (XAI) due to their unique ability to\nprovide explanations in the form of tree or rule sets that are easily\nunderstandable and interpretable, making them essential for applications in\nwhich trust in model decisions is necessary. These transparent models are\ntypically used in surrogate modeling, a post-hoc XAI approach for explaining\nthe logic of black-box models, enabling users to comprehend and trust complex\npredictive systems while maintaining competitive performance. This study\nproposes the Cost-Sensitive Rule and Tree Extraction (CORTEX) method, a novel\nrule-based XAI algorithm grounded in the multi-class cost-sensitive decision\ntree (CSDT) method. The original version of the CSDT is extended to\nclassification problems with more than two classes by inducing the concept of\nan n-dimensional class-dependent cost matrix. The performance of CORTEX as a\nrule-extractor XAI method is compared to other post-hoc tree and rule\nextraction methods across several datasets with different numbers of classes.\nSeveral quantitative evaluation metrics are employed to assess the\nexplainability of generated rule sets. Our findings demonstrate that CORTEX is\ncompetitive with other tree-based methods and can be superior to other\nrule-based methods across different datasets. The extracted rule sets suggest\nthe advantages of using the CORTEX method over other methods by producing\nsmaller rule sets with shorter rules on average across datasets with a diverse\nnumber of classes. Overall, the results underscore the potential of CORTEX as a\npowerful XAI tool for scenarios that require the generation of clear,\nhuman-understandable rules while maintaining good predictive performance.", "paper_summary_zh": "<paragraph>基於樹和基於規則的機器學習模型在可解釋人工智慧 (XAI) 中扮演著舉足輕重的角色，因為它們有獨特的能力，可以提供樹或規則集形式的解釋，這些解釋容易理解和詮釋，這使得它們對於在其中需要信任模型決策的應用程式中至關重要。這些透明模型通常用於代理模型，這是一種事後 XAI 方法，用於解釋黑盒模型的邏輯，使用戶能夠理解和信任複雜的預測系統，同時保持競爭力。本研究提出成本敏感規則和樹萃取 (CORTEX) 方法，這是一種新的基於規則的 XAI 演算法，植基於多類成本敏感決策樹 (CSDT) 方法。CSDT 的原始版本已擴充到具有兩個以上類別的分類問題，方法是引入 n 維類別依賴成本矩陣的概念。將 CORTEX 作為規則萃取 XAI 方法的效能與其他事後樹和規則萃取方法進行比較，這些方法跨越了具有不同類別數量的幾個資料集。採用多個量化評估指標來評估所產生的規則集的可解釋性。我們的研究結果表明，CORTEX 與其他基於樹的方法具有競爭力，並且在不同的資料集上可以優於其他基於規則的方法。萃取的規則集建議，在具有不同類別數量的資料集上，與其他方法相比，使用 CORTEX 方法的優點是產生較小的規則集，且平均而言具有較短的規則。總體而言，這些結果強調了 CORTEX 作為一種強大的 XAI 工具的潛力，適用於需要產生清晰、人類可理解的規則，同時保持良好的預測效能的場景。</paragraph>", "author": "Marija Kopanja et.al.", "authors": "Marija Kopanja, Miloš Savić, Luca Longo", "id": "2502.03200v1", "paper_url": "http://arxiv.org/abs/2502.03200v1", "repo": "null"}}