{"2410.03543": {"publish_time": "2024-10-04", "title": "Re-examining Sexism and Misogyny Classification with Annotator Attitudes", "paper_summary": "Gender-Based Violence (GBV) is an increasing problem online, but existing\ndatasets fail to capture the plurality of possible annotator perspectives or\nensure the representation of affected groups. We revisit two important stages\nin the moderation pipeline for GBV: (1) manual data labelling; and (2)\nautomated classification. For (1), we examine two datasets to investigate the\nrelationship between annotator identities and attitudes and the responses they\ngive to two GBV labelling tasks. To this end, we collect demographic and\nattitudinal information from crowd-sourced annotators using three validated\nsurveys from Social Psychology. We find that higher Right Wing Authoritarianism\nscores are associated with a higher propensity to label text as sexist, while\nfor Social Dominance Orientation and Neosexist Attitudes, higher scores are\nassociated with a negative tendency to do so. For (2), we conduct\nclassification experiments using Large Language Models and five prompting\nstrategies, including infusing prompts with annotator information. We find: (i)\nannotator attitudes affect the ability of classifiers to predict their labels;\n(ii) including attitudinal information can boost performance when we use\nwell-structured brief annotator descriptions; and (iii) models struggle to\nreflect the increased complexity and imbalanced classes of the new label sets.", "paper_summary_zh": "性別暴力 (GBV) 在網路上是一個日益嚴重的問題，但現有的資料集無法掌握註解者可能觀點的多樣性，也無法確保受影響群體的代表性。我們重新探討 GBV 審核流程中的兩個重要階段：(1) 手動資料標記；和 (2) 自動化分類。對於 (1)，我們探討兩個資料集，以調查註解者身分和態度與他們對兩個 GBV 標記任務的回應之間的關係。為此，我們使用社會心理學的三項驗證調查，從群眾外包的註解者收集人口統計和態度資訊。我們發現，較高的右翼威權主義得分與將文字標記為性別歧視的傾向較高有關，而對於社會支配傾向和新性別主義態度，較高的得分與這樣做的負面傾向有關。對於 (2)，我們使用大型語言模型和五種提示策略進行分類實驗，包括在提示中注入註解者資訊。我們發現：(i) 註解者態度影響分類器預測其標籤的能力；(ii) 在我們使用結構良好的簡要註解者描述時，包含態度資訊可以提升效能；以及 (iii) 模型難以反映新標籤集的複雜性和不平衡類別。", "author": "Aiqi Jiang et.al.", "authors": "Aiqi Jiang, Nikolas Vitsakis, Tanvi Dinkar, Gavin Abercrombie, Ioannis Konstas", "id": "2410.03543v1", "paper_url": "http://arxiv.org/abs/2410.03543v1", "repo": "null"}}