{"2410.23912": {"publish_time": "2024-10-31", "title": "RL-STaR: Theoretical Analysis of Reinforcement Learning Frameworks for Self-Taught Reasoner", "paper_summary": "The reasoning abilities of large language models (LLMs) have improved with\nchain-of-thought (CoT) prompting, allowing models to solve complex tasks in a\nstepwise manner. However, training CoT capabilities requires detailed reasoning\ndata, which is often scarce. The self-taught reasoner (STaR) framework\naddresses this by using reinforcement learning to automatically generate\nreasoning steps, reducing reliance on human-labeled data. Although STaR and its\nvariants have demonstrated empirical success, a theoretical foundation\nexplaining these improvements is lacking. This work provides a theoretical\nframework for understanding the effectiveness of reinforcement learning on CoT\nreasoning and STaR. Our contributions are: (1) an analysis of policy\nimprovement, showing why LLM reasoning improves iteratively with STaR; (2)\nconditions for convergence to an optimal reasoning policy; (3) an examination\nof STaR's robustness, explaining how it can improve reasoning even when\nincorporating occasional incorrect steps; and (4) criteria for the quality of\npre-trained models necessary to initiate effective reasoning improvement. This\nframework aims to bridge empirical findings with theoretical insights,\nadvancing reinforcement learning approaches for reasoning in LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 的推理能力已透過思維鏈 (CoT) 提示而獲得改善，使模型能夠以逐步方式解決複雜任務。然而，訓練 CoT 能力需要詳細的推理資料，而這些資料通常很稀少。自學推理器 (STaR) 框架透過使用強化學習自動產生推理步驟來解決這個問題，減少對人工標記資料的依賴。儘管 STaR 及其變體已展示出經驗上的成功，但仍缺乏解釋這些改進的理論基礎。本研究提供了一個理論框架，用於了解強化學習在 CoT 推理和 STaR 上的效能。我們的貢獻包括：(1) 政策改進的分析，說明為何 LLM 推理會隨著 STaR 迭代地改進；(2) 收斂到最佳推理政策的條件；(3) 對 STaR 穩健性的檢驗，說明即使在納入偶爾的錯誤步驟時，它如何能夠改善推理；以及 (4) 啟動有效推理改進所需的預訓練模型品質準則。此框架旨在將經驗發現與理論見解聯繫起來，以推動 LLM 中推理的強化學習方法。", "author": "Fu-Chieh Chang et.al.", "authors": "Fu-Chieh Chang, Yu-Ting Lee, Hui-Ying Shih, Pei-Yuan Wu", "id": "2410.23912v1", "paper_url": "http://arxiv.org/abs/2410.23912v1", "repo": "null"}}