{"2501.12391": {"publish_time": "2025-01-21", "title": "Physics of Skill Learning", "paper_summary": "We aim to understand physics of skill learning, i.e., how skills are learned\nin neural networks during training. We start by observing the Domino effect,\ni.e., skills are learned sequentially, and notably, some skills kick off\nlearning right after others complete learning, similar to the sequential fall\nof domino cards. To understand the Domino effect and relevant behaviors of\nskill learning, we take physicists' approach of abstraction and simplification.\nWe propose three models with varying complexities -- the Geometry model, the\nResource model, and the Domino model, trading between reality and simplicity.\nThe Domino effect can be reproduced in the Geometry model, whose resource\ninterpretation inspires the Resource model, which can be further simplified to\nthe Domino model. These models present different levels of abstraction and\nsimplification; each is useful to study some aspects of skill learning. The\nGeometry model provides interesting insights into neural scaling laws and\noptimizers; the Resource model sheds light on the learning dynamics of\ncompositional tasks; the Domino model reveals the benefits of modularity. These\nmodels are not only conceptually interesting -- e.g., we show how Chinchilla\nscaling laws can emerge from the Geometry model, but also are useful in\npractice by inspiring algorithmic development -- e.g., we show how simple\nalgorithmic changes, motivated by these toy models, can speed up the training\nof deep learning models.", "paper_summary_zh": "我們旨在了解技能學習的物理學，即在訓練過程中如何學習神經網路中的技能。我們從觀察多米諾骨牌效應開始，即技能是按順序學習的，值得注意的是，某些技能會在其他技能完成學習後立即開始學習，類似於多米諾骨牌按順序倒下的情況。為了了解多米諾骨牌效應和技能學習相關行為，我們採用物理學家的抽象化和簡化方法。我們提出了三種具有不同複雜性的模型——幾何模型、資源模型和多米諾模型，在現實和簡潔性之間進行權衡。多米諾骨牌效應可以在幾何模型中重現，其資源解釋激發了資源模型，而資源模型可以進一步簡化為多米諾模型。這些模型呈現出不同的抽象化和簡化層級；每一個都可用於研究技能學習的某些方面。幾何模型提供了對神經網路擴充法則和最佳化器的有趣見解；資源模型闡明了組合任務的學習動態；多米諾模型揭示了模組化的優點。這些模型不僅在概念上很有趣——例如，我們展示了欽奇拉擴充法則如何從幾何模型中出現，而且在實務上也很有用，因為它激發了演算法的開發——例如，我們展示了受這些玩具模型啟發的簡單演算法變更如何能加速深度學習模型的訓練。", "author": "Ziming Liu et.al.", "authors": "Ziming Liu, Yizhou Liu, Eric J. Michaud, Jeff Gore, Max Tegmark", "id": "2501.12391v1", "paper_url": "http://arxiv.org/abs/2501.12391v1", "repo": "https://github.com/kindxiaoming/physics_of_skill_learning"}}