{"2501.05510": {"publish_time": "2025-01-09", "title": "OVO-Bench: How Far is Your Video-LLMs from Real-World Online Video Understanding?", "paper_summary": "Temporal Awareness, the ability to reason dynamically based on the timestamp\nwhen a question is raised, is the key distinction between offline and online\nvideo LLMs. Unlike offline models, which rely on complete videos for static,\npost hoc analysis, online models process video streams incrementally and\ndynamically adapt their responses based on the timestamp at which the question\nis posed. Despite its significance, temporal awareness has not been adequately\nevaluated in existing benchmarks. To fill this gap, we present OVO-Bench\n(Online-VideO-Benchmark), a novel video benchmark that emphasizes the\nimportance of timestamps for advanced online video understanding capability\nbenchmarking. OVO-Bench evaluates the ability of video LLMs to reason and\nrespond to events occurring at specific timestamps under three distinct\nscenarios: (1) Backward tracing: trace back to past events to answer the\nquestion. (2) Real-time understanding: understand and respond to events as they\nunfold at the current timestamp. (3) Forward active responding: delay the\nresponse until sufficient future information becomes available to answer the\nquestion accurately. OVO-Bench comprises 12 tasks, featuring 644 unique videos\nand approximately human-curated 2,800 fine-grained meta-annotations with\nprecise timestamps. We combine automated generation pipelines with human\ncuration. With these high-quality samples, we further developed an evaluation\npipeline to systematically query video LLMs along the video timeline.\nEvaluations of nine Video-LLMs reveal that, despite advancements on traditional\nbenchmarks, current models struggle with online video understanding, showing a\nsignificant gap compared to human agents. We hope OVO-Bench will drive progress\nin video LLMs and inspire future research in online video reasoning. Our\nbenchmark and code can be accessed at https://github.com/JoeLeelyf/OVO-Bench.", "paper_summary_zh": "時間感知，即根據問題提出的時間戳進行動態推理的能力，是在線和離線影片 LLM 之間的主要區別。與依賴完整影片進行靜態事後分析的離線模型不同，在線模型會遞增地處理影片串流，並根據問題提出的時間戳動態調整其回應。儘管時間感知很重要，但在現有基準測試中尚未得到充分評估。為了填補這一空白，我們提出了 OVO-Bench（Online-VideO-Benchmark），這是一個新穎的影片基準測試，強調時間戳對於先進的在線影片理解能力基準測試的重要性。OVO-Bench 評估影片 LLM 在三種不同情況下對特定時間戳發生的事件進行推理和回應的能力：(1) 向後追溯：追溯過去的事件以回答問題。(2) 實時理解：理解並回應在當前時間戳展開的事件。(3) 前向主動回應：延遲回應，直到有足夠的未來資訊可用於準確回答問題。OVO-Bench 包含 12 項任務，具有 644 個獨特的影片和約 2,800 個經過人工策劃的精細化元註解，並附有精確的時間戳。我們將自動化生成管道與人工策劃相結合。有了這些高品質的範例，我們進一步開發了一個評估管道，以系統地查詢影片 LLM 沿著影片時間軸。對九個 Video-LLM 的評估表明，儘管在傳統基準測試方面取得了進展，但目前的模型在在線影片理解方面仍存在困難，與人類代理相比存在顯著差距。我們希望 OVO-Bench 能夠推動影片 LLM 的進展，並激勵未來在線影片推理的研究。我們的基準測試和程式碼可以在 https://github.com/JoeLeelyf/OVO-Bench 取得。", "author": "Yifei Li et.al.", "authors": "Yifei Li, Junbo Niu, Ziyang Miao, Chunjiang Ge, Yuanhang Zhou, Qihao He, Xiaoyi Dong, Haodong Duan, Shuangrui Ding, Rui Qian, Pan Zhang, Yuhang Zang, Yuhang Cao, Conghui He, Jiaqi Wang", "id": "2501.05510v1", "paper_url": "http://arxiv.org/abs/2501.05510v1", "repo": "https://github.com/joeleelyf/ovo-bench"}}