{"2411.03042": {"publish_time": "2024-11-05", "title": "Predictor-Corrector Enhanced Transformers with Exponential Moving Average Coefficient Learning", "paper_summary": "Residual networks, as discrete approximations of Ordinary Differential\nEquations (ODEs), have inspired significant advancements in neural network\ndesign, including multistep methods, high-order methods, and multi-particle\ndynamical systems. The precision of the solution to ODEs significantly affects\nparameter optimization, thereby impacting model performance. In this work, we\npresent a series of advanced explorations of Transformer architecture design to\nminimize the error compared to the true ``solution.'' First, we introduce a\npredictor-corrector learning framework to minimize truncation errors, which\nconsists of a high-order predictor and a multistep corrector. Second, we\npropose an exponential moving average-based coefficient learning method to\nstrengthen our higher-order predictor. Extensive experiments on large-scale\nmachine translation, abstractive summarization, language modeling, and natural\nlanguage understanding benchmarks demonstrate the superiority of our approach.\nOn the WMT'14 English-German and English-French tasks, our model achieved BLEU\nscores of 30.95 and 44.27, respectively. Furthermore, on the OPUS multilingual\nmachine translation task, our model surpasses a robust 3.8B DeepNet by an\naverage of 2.9 SacreBLEU, using only 1/3 parameters. Notably, it also beats\nLLama models by 5.7 accuracy points on the LM Harness Evaluation.", "paper_summary_zh": "殘差網路，作為常微分方程式 (ODE) 的離散近似，激發了神經網路設計的重大進展，包括多步法、高階方法和多粒子動力系統。ODE 解的精度會顯著影響參數最佳化，進而影響模型效能。在這項工作中，我們提出了一系列進階的 Transformer 架構設計探索，以最小化與真實「解」的誤差。首先，我們引入一個預測校正學習架構來最小化截斷誤差，其中包含一個高階預測器和一個多步校正器。其次，我們提出一個基於指數移動平均的係數學習方法，以強化我們的高階預測器。在大型機器翻譯、抽象摘要、語言建模和自然語言理解基準上的廣泛實驗證明了我們方法的優越性。在 WMT'14 英德和英法任務中，我們的模型分別達到了 30.95 和 44.27 的 BLEU 分數。此外，在 OPUS 多語言機器翻譯任務中，我們的模型僅使用 1/3 的參數，就超越了強大的 3.8B DeepNet，平均高出 2.9 SacreBLEU。值得注意的是，它還在 LM Harness Evaluation 上比 LLama 模型高出 5.7 個準確度點。", "author": "Bei Li et.al.", "authors": "Bei Li, Tong Zheng, Rui Wang, Jiahao Liu, Qingyan Guo, Junliang Guo, Xu Tan, Tong Xiao, Jingbo Zhu, Jingang Wang, Xunliang Cai", "id": "2411.03042v1", "paper_url": "http://arxiv.org/abs/2411.03042v1", "repo": "null"}}