{"2411.04368": {"publish_time": "2024-11-07", "title": "Measuring short-form factuality in large language models", "paper_summary": "We present SimpleQA, a benchmark that evaluates the ability of language\nmodels to answer short, fact-seeking questions. We prioritized two properties\nin designing this eval. First, SimpleQA is challenging, as it is adversarially\ncollected against GPT-4 responses. Second, responses are easy to grade, because\nquestions are created such that there exists only a single, indisputable\nanswer. Each answer in SimpleQA is graded as either correct, incorrect, or not\nattempted. A model with ideal behavior would get as many questions correct as\npossible while not attempting the questions for which it is not confident it\nknows the correct answer. SimpleQA is a simple, targeted evaluation for whether\nmodels \"know what they know,\" and our hope is that this benchmark will remain\nrelevant for the next few generations of frontier models. SimpleQA can be found\nat https://github.com/openai/simple-evals.", "paper_summary_zh": "我們提出 SimpleQA，一個評量語言模型回答簡短事實問題的能力的基準。我們在設計此評量時優先考慮兩個特性。首先，SimpleQA 具有挑戰性，因為它會針對 GPT-4 回應進行對抗收集。其次，回應很容易評分，因為問題的建立方式使得只存在一個無可爭議的答案。SimpleQA 中的每個答案都評分為正確、不正確或未嘗試。理想行為的模型會盡可能回答正確的問題，同時不嘗試它不確定自己知道正確答案的問題。SimpleQA 是針對模型「知道自己知道什麼」的簡單、有針對性的評量，我們希望此基準對於下一代前沿模型來說仍然相關。SimpleQA 可在 https://github.com/openai/simple-evals 找到。", "author": "Jason Wei et.al.", "authors": "Jason Wei, Nguyen Karina, Hyung Won Chung, Yunxin Joy Jiao, Spencer Papay, Amelia Glaese, John Schulman, William Fedus", "id": "2411.04368v1", "paper_url": "http://arxiv.org/abs/2411.04368v1", "repo": "https://github.com/openai/simple-evals"}}