{"2411.02083": {"publish_time": "2024-11-04", "title": "Regress, Don't Guess -- A Regression-like Loss on Number Tokens for Language Models", "paper_summary": "While language models have exceptional capabilities at text generation, they\nlack a natural inductive bias for emitting numbers and thus struggle in tasks\ninvolving reasoning over quantities, especially arithmetics. This has\nparticular relevance in scientific datasets where combinations of text and\nnumerical data are abundant. One fundamental limitation is the nature of the CE\nloss, which assumes a nominal (categorical) scale and thus cannot convey\nproximity between generated number tokens. As a remedy, we here present two\nversions of a number token loss. The first is based on an $L_p$ loss between\nthe ground truth token value and the weighted sum of the predicted class\nprobabilities. The second loss minimizes the Wasserstein-1 distance between the\ndistribution of the predicted output probabilities and the ground truth\ndistribution. These regression-like losses can easily be added to any language\nmodel and extend the CE objective during training. We compare the proposed\nschemes on a mathematics dataset against existing tokenization, encoding, and\ndecoding schemes for improving number representation in language models. Our\nresults reveal a significant improvement in numerical accuracy when equipping a\nstandard T5 model with the proposed loss schemes.", "paper_summary_zh": "雖然語言模型在文本生成方面有非凡的能力，但它們缺乏發出數字的自然歸納偏誤，因此在涉及數量推理的任務中會遇到困難，特別是算術。這在科學數據集中尤其相關，因為文本和數字數據的組合很豐富。一個基本限制是 CE 損失的本質，它假設一個名義（分類）尺度，因此無法傳達生成的數字令牌之間的接近程度。作為補救措施，我們在此提出了數字令牌損失的兩個版本。第一個基於 $L_p$ 損失，介於基本事實令牌值和預測類別概率的加權和之間。第二個損失最小化預測輸出概率分佈和基本事實分佈之間的 Wasserstein-1 距離。這些類似迴歸的損失可以輕鬆添加到任何語言模型中，並在訓練期間擴展 CE 目標。我們在數學數據集上比較所提出的方案與現有的標記化、編碼和解碼方案，以改善語言模型中的數字表示。我們的結果表明，當使用建議的損失方案為標準 T5 模型配備時，數字準確度顯著提高。", "author": "Jonas Zausinger et.al.", "authors": "Jonas Zausinger, Lars Pennig, Kacper Chlodny, Vincent Limbach, Anna Ketteler, Thorben Prein, Vishwa Mohan Singh, Michael Morris Danziger, Jannis Born", "id": "2411.02083v1", "paper_url": "http://arxiv.org/abs/2411.02083v1", "repo": "null"}}