{"2409.10103": {"publish_time": "2024-09-16", "title": "Self-Supervised Syllable Discovery Based on Speaker-Disentangled HuBERT", "paper_summary": "Self-supervised speech representation learning has become essential for\nextracting meaningful features from untranscribed audio. Recent advances\nhighlight the potential of deriving discrete symbols from the features\ncorrelated with linguistic units, which enables text-less training across\ndiverse tasks. In particular, sentence-level Self-Distillation of the\npretrained HuBERT (SD-HuBERT) induces syllabic structures within latent speech\nframe representations extracted from an intermediate Transformer layer. In\nSD-HuBERT, sentence-level representation is accumulated from speech frame\nfeatures through self-attention layers using a special CLS token. However, we\nobserve that the information aggregated in the CLS token correlates more with\nspeaker identity than with linguistic content. To address this, we propose a\nspeech-only self-supervised fine-tuning approach that separates syllabic units\nfrom speaker information. Our method introduces speaker perturbation as data\naugmentation and adopts a frame-level training objective to prevent the CLS\ntoken from aggregating paralinguistic information. Experimental results show\nthat our approach surpasses the current state-of-the-art method in most\nsyllable segmentation and syllabic unit quality metrics on Librispeech,\nunderscoring its effectiveness in promoting syllabic organization within\nspeech-only models.", "paper_summary_zh": "自我监督语音表征学习已成为从未转录音频中提取有意义特征的必要方法。最近的进展凸显了从与语言单位相关的特征中推导出离散符号的潜力，这使得跨不同任务进行无文本训练成为可能。特别是，预训练 HuBERT（SD-HuBERT）的句子级自蒸馏在从中间 Transformer 层提取的潜在语音帧表征中诱导出音节结构。在 SD-HuBERT 中，句子级表征通过使用特殊 CLS 标记通过自注意力层从语音帧特征中累积。然而，我们观察到 CLS 标记中聚合的信息与说话者身份的相关性高于语言内容。为了解决这个问题，我们提出了一种仅语音自我监督微调方法，该方法将音节单位与说话者信息分开。我们的方法将说话者扰动作为数据增强，并采用帧级训练目标来防止 CLS 标记聚合副语言信息。实验结果表明，我们的方法在 Librispeech 上超越了当前最先进的方法，在大多数音节分割和音节单位质量指标上都取得了超越，这突出了其在仅语音模型中促进音节组织的有效性。", "author": "Ryota Komatsu et.al.", "authors": "Ryota Komatsu, Takahiro Shinozaki", "id": "2409.10103v1", "paper_url": "http://arxiv.org/abs/2409.10103v1", "repo": "https://github.com/ryota-komatsu/speaker_disentangled_hubert"}}