{"2408.12419": {"publish_time": "2024-08-22", "title": "4D Diffusion for Dynamic Protein Structure Prediction with Reference Guided Motion Alignment", "paper_summary": "Protein structure prediction is pivotal for understanding the\nstructure-function relationship of proteins, advancing biological research, and\nfacilitating pharmaceutical development and experimental design. While deep\nlearning methods and the expanded availability of experimental 3D protein\nstructures have accelerated structure prediction, the dynamic nature of protein\nstructures has received limited attention. This study introduces an innovative\n4D diffusion model incorporating molecular dynamics (MD) simulation data to\nlearn dynamic protein structures. Our approach is distinguished by the\nfollowing components: (1) a unified diffusion model capable of generating\ndynamic protein structures, including both the backbone and side chains,\nutilizing atomic grouping and side-chain dihedral angle predictions; (2) a\nreference network that enhances structural consistency by integrating the\nlatent embeddings of the initial 3D protein structures; and (3) a motion\nalignment module aimed at improving temporal structural coherence across\nmultiple time steps. To our knowledge, this is the first diffusion-based model\naimed at predicting protein trajectories across multiple time steps\nsimultaneously. Validation on benchmark datasets demonstrates that our model\nexhibits high accuracy in predicting dynamic 3D structures of proteins\ncontaining up to 256 amino acids over 32 time steps, effectively capturing both\nlocal flexibility in stable states and significant conformational changes.", "paper_summary_zh": "蛋白质结构预测对于理解蛋白质的结构-功能关系、推进生物学研究、促进药物开发和实验设计至关重要。虽然深度学习方法和实验性 3D 蛋白质结构的广泛可用性加速了结构预测，但蛋白质结构的动态特性却受到的关注有限。本研究引入了一个创新的 4D 扩散模型，结合分子动力学 (MD) 模拟数据来学习动态蛋白质结构。我们的方法以以下组件为特色：(1) 一个统一的扩散模型，能够生成动态蛋白质结构，包括主链和侧链，利用原子分组和侧链二面角预测；(2) 一个参考网络，通过整合初始 3D 蛋白质结构的潜在嵌入来增强结构一致性；(3) 一个运动对齐模块，旨在改善跨多个时间步长的时态结构相干性。据我们所知，这是第一个基于扩散的模型，旨在同时预测多个时间步长的蛋白质轨迹。在基准数据集上的验证表明，我们的模型在预测包含长达 256 个氨基酸、跨越 32 个时间步长的蛋白质的动态 3D 结构方面表现出很高的准确性，有效地捕捉到了稳定状态下的局部柔性和显著的构象变化。", "author": "Kaihui Cheng et.al.", "authors": "Kaihui Cheng, Ce Liu, Qingkun Su, Jun Wang, Liwei Zhang, Yining Tang, Yao Yao, Siyu Zhu, Yuan Qi", "id": "2408.12419v1", "paper_url": "http://arxiv.org/abs/2408.12419v1", "repo": "null"}}