{"2408.11609": {"publish_time": "2024-08-21", "title": "Xinyu: An Efficient LLM-based System for Commentary Generation", "paper_summary": "Commentary provides readers with a deep understanding of events by presenting\ndiverse arguments and evidence. However, creating commentary is a\ntime-consuming task, even for skilled commentators. Large language models\n(LLMs) have simplified the process of natural language generation, but their\ndirect application in commentary creation still faces challenges due to unique\ntask requirements. These requirements can be categorized into two levels: 1)\nfundamental requirements, which include creating well-structured and logically\nconsistent narratives, and 2) advanced requirements, which involve generating\nquality arguments and providing convincing evidence. In this paper, we\nintroduce Xinyu, an efficient LLM-based system designed to assist commentators\nin generating Chinese commentaries. To meet the fundamental requirements, we\ndeconstruct the generation process into sequential steps, proposing targeted\nstrategies and supervised fine-tuning (SFT) for each step. To address the\nadvanced requirements, we present an argument ranking model for arguments and\nestablish a comprehensive evidence database that includes up-to-date events and\nclassic books, thereby strengthening the substantiation of the evidence with\nretrieval augmented generation (RAG) technology. To evaluate the generated\ncommentaries more fairly, corresponding to the two-level requirements, we\nintroduce a comprehensive evaluation metric that considers five distinct\nperspectives in commentary generation. Our experiments confirm the\neffectiveness of our proposed system. We also observe a significant increase in\nthe efficiency of commentators in real-world scenarios, with the average time\nspent on creating a commentary dropping from 4 hours to 20 minutes.\nImportantly, such an increase in efficiency does not compromise the quality of\nthe commentaries.", "paper_summary_zh": "<paragraph>評論透過提出不同的論點和證據，讓讀者深入了解事件。然而，即使對熟練的評論家而言，撰寫評論都是一項耗時的任務。大型語言模型 (LLM) 簡化了自然語言生成的流程，但由於獨特的任務需求，它們在評論撰寫中的直接應用仍面臨挑戰。這些需求可分為兩個層級：1) 基本需求，包括建立結構良好且合乎邏輯的敘述，以及 2) 進階需求，包括產生高品質的論點和提供令人信服的證據。在本文中，我們介紹 Xinyu，一個基於 LLM 的高效系統，旨在協助評論家產生中文評論。為了滿足基本需求，我們將生成流程解構為循序漸進的步驟，針對每個步驟提出目標策略和監督微調 (SFT)。為了滿足進階需求，我們提出一個論點排名模型，並建立一個包含最新事件和經典書籍的綜合證據資料庫，從而透過檢索擴充生成 (RAG) 技術強化證據的實質內容。為了更公平地評估所生成的評論，針對這兩個層級的需求，我們引入一個綜合評量指標，考量評論生成中的五個不同觀點。我們的實驗證實了我們所提出的系統的有效性。我們也觀察到在實際情況中，評論家的效率顯著提升，撰寫一篇評論所花的平均時間從 4 小時縮短至 20 分鐘。重要的是，效率的提升並未損害評論的品質。</paragraph>", "author": "Yiquan Wu et.al.", "authors": "Yiquan Wu, Bo Tang, Chenyang Xi, Yu Yu, Pengyu Wang, Yifei Liu, Kun Kuang, Haiying Deng, Zhiyu Li, Feiyu Xiong, Jie Hu, Peng Cheng, Zhonghao Wang, Yi Wang, Yi Luo, Mingchuan Yang", "id": "2408.11609v1", "paper_url": "http://arxiv.org/abs/2408.11609v1", "repo": "null"}}