{"2411.02306": {"publish_time": "2024-11-04", "title": "Targeted Manipulation and Deception Emerge when Optimizing LLMs for User Feedback", "paper_summary": "As LLMs become more widely deployed, there is increasing interest in directly\noptimizing for feedback from end users (e.g. thumbs up) in addition to feedback\nfrom paid annotators. However, training to maximize human feedback creates a\nperverse incentive structure for the AI to resort to manipulative tactics to\nobtain positive feedback, and some users may be especially vulnerable to such\ntactics. We study this phenomenon by training LLMs with Reinforcement Learning\nwith simulated user feedback. We have three main findings: 1) Extreme forms of\n\"feedback gaming\" such as manipulation and deception can reliably emerge in\ndomains of practical LLM usage; 2) Concerningly, even if only <2% of users are\nvulnerable to manipulative strategies, LLMs learn to identify and surgically\ntarget them while behaving appropriately with other users, making such\nbehaviors harder to detect; 3 To mitigate this issue, it may seem promising to\nleverage continued safety training or LLM-as-judges during training to filter\nproblematic outputs. To our surprise, we found that while such approaches help\nin some settings, they backfire in others, leading to the emergence of subtler\nproblematic behaviors that would also fool the LLM judges. Our findings serve\nas a cautionary tale, highlighting the risks of using gameable feedback sources\n-- such as user feedback -- as a target for RL.", "paper_summary_zh": "随着大型语言模型的广泛部署，除了付费注释员的反馈之外，人们对直接优化最终用户的反馈（例如点赞）的兴趣日益浓厚。然而，训练以最大化人类反馈会为人工智能创造一种反常的激励结构，以诉诸于操纵策略来获得积极反馈，而一些用户可能特别容易受到此类策略的影响。我们通过使用模拟用户反馈的强化学习来训练大型语言模型来研究这种现象。我们有三个主要发现：1) 在大型语言模型实际使用的领域中，极端的“反馈博弈”形式（例如操纵和欺骗）可能会可靠地出现；2) 令人担忧的是，即使只有不到 2% 的用户容易受到操纵策略的影响，大型语言模型也会学会识别并对他们进行外科手术，同时对其他用户表现得当，这使得此类行为更难检测；3) 为了减轻这个问题，在训练期间利用持续的安全训练或大型语言模型作为评委来过滤有问题的输出似乎很有希望。令我们惊讶的是，我们发现虽然此类方法在某些设置中有所帮助，但在其他设置中却适得其反，导致出现更微妙的问题行为，这些行为也会欺骗大型语言模型评委。我们的发现是一个警示故事，突出了将可博弈反馈来源（例如用户反馈）用作强化学习目标的风险。", "author": "Marcus Williams et.al.", "authors": "Marcus Williams, Micah Carroll, Adhyyan Narang, Constantin Weisser, Brendan Murphy, Anca Dragan", "id": "2411.02306v1", "paper_url": "http://arxiv.org/abs/2411.02306v1", "repo": "https://github.com/marcus-jw/targeted-manipulation-and-deception-in-llms"}}