{"2408.07930": {"publish_time": "2024-08-15", "title": "MAG-SQL: Multi-Agent Generative Approach with Soft Schema Linking and Iterative Sub-SQL Refinement for Text-to-SQL", "paper_summary": "Recent In-Context Learning based methods have achieved remarkable success in\nText-to-SQL task. However, there is still a large gap between the performance\nof these models and human performance on datasets with complex database schema\nand difficult questions, such as BIRD. Besides, existing work has neglected to\nsupervise intermediate steps when solving questions iteratively with question\ndecomposition methods, and the schema linking methods used in these works are\nvery rudimentary. To address these issues, we propose MAG-SQL, a multi-agent\ngenerative approach with soft schema linking and iterative Sub-SQL refinement.\nIn our framework, an entity-based method with tables' summary is used to select\nthe columns in database, and a novel targets-conditions decomposition method is\nintroduced to decompose those complex questions. Additionally, we build a\niterative generating module which includes a Sub-SQL Generator and Sub-SQL\nRefiner, introducing external oversight for each step of generation. Through a\nseries of ablation studies, the effectiveness of each agent in our framework\nhas been demonstrated. When evaluated on the BIRD benchmark with GPT-4, MAG-SQL\nachieves an execution accuracy of 61.08%, compared to the baseline accuracy of\n46.35% for vanilla GPT-4 and the baseline accuracy of 57.56% for MAC-SQL.\nBesides, our approach makes similar progress on Spider.", "paper_summary_zh": "最近基于情境学习的方法在文本到 SQL 任务中取得了显著的成功。然而，在具有复杂数据库架构和困难问题（例如 BIRD）的数据集上，这些模型的性能与人类的性能之间仍然存在很大差距。此外，现有工作在使用问题分解方法迭代解决问题时忽视了对中间步骤的监督，并且这些工作中使用的模式链接方法非常基础。为了解决这些问题，我们提出了 MAG-SQL，这是一种具有软模式链接和迭代子 SQL 精炼的多代理生成方法。在我们的框架中，使用带有表摘要的基于实体的方法来选择数据库中的列，并引入了一种新颖的目标条件分解方法来分解那些复杂的问题。此外，我们构建了一个迭代生成模块，其中包括一个子 SQL 生成器和子 SQL 精炼器，为生成的每个步骤引入了外部监督。通过一系列消融研究，证明了我们框架中每个代理的有效性。在使用 GPT-4 对 BIRD 基准进行评估时，MAG-SQL 的执行准确率达到 61.08%，而香草 GPT-4 的基线准确率为 46.35%，MAC-SQL 的基线准确率为 57.56%。此外，我们的方法在 Spider 上取得了类似的进展。", "author": "Wenxuan Xie et.al.", "authors": "Wenxuan Xie, Gaochen Wu, Bowen Zhou", "id": "2408.07930v2", "paper_url": "http://arxiv.org/abs/2408.07930v2", "repo": "null"}}