{"2408.07930": {"publish_time": "2024-08-15", "title": "MAG-SQL: Multi-Agent Generative Approach with Soft Schema Linking and Iterative Sub-SQL Refinement for Text-to-SQL", "paper_summary": "Recent In-Context Learning based methods have achieved remarkable success in\nText-to-SQL task. However, there is still a large gap between the performance\nof these models and human performance on datasets with complex database schema\nand difficult questions, such as BIRD. Besides, existing work has neglected to\nsupervise intermediate steps when solving questions iteratively with question\ndecomposition methods, and the schema linking methods used in these works are\nvery rudimentary. To address these issues, we propose MAG-SQL, a multi-agent\ngenerative approach with soft schema linking and iterative Sub-SQL refinement.\nIn our framework, an entity-based method with tables' summary is used to select\nthe columns in database, and a novel targets-conditions decomposition method is\nintroduced to decompose those complex questions. Additionally, we build a\niterative generating module which includes a Sub-SQL Generator and Sub-SQL\nRefiner, introducing external oversight for each step of generation. Through a\nseries of ablation studies, the effectiveness of each agent in our framework\nhas been demonstrated. When evaluated on the BIRD benchmark with GPT-4, MAG-SQL\nachieves an execution accuracy of 61.08\\%, compared to the baseline accuracy of\n46.35\\% for vanilla GPT-4 and the baseline accuracy of 57.56\\% for MAC-SQL.\nBesides, our approach makes similar progress on Spider.", "paper_summary_zh": "<paragraph>最近基於語境學習的方法已在文字轉 SQL 任務中取得顯著的成功。然而，這些模型的效能與人類在具有複雜資料庫架構和困難問題（例如 BIRD）的資料集上的效能之間仍有很大的差距。此外，現有工作在使用問題分解方法反覆解決問題時，忽略了對中間步驟的監督，並且這些工作中使用的架構連結方法非常基本。為了解決這些問題，我們提出了 MAG-SQL，這是一種具有軟架構連結和反覆子 SQL 精煉的多代理生成方法。在我們的框架中，使用具有表格摘要的基於實體的方法來選擇資料庫中的欄位，並引入一種新穎的目標條件分解方法來分解那些複雜的問題。此外，我們建立了一個反覆生成模組，其中包括一個子 SQL 產生器和子 SQL 精煉器，為生成的每一步引入外部監督。通過一系列消融研究，證明了我們框架中每個代理的有效性。在使用 GPT-4 對 BIRD 基準進行評估時，與純粹 GPT-4 的基準準確度 46.35% 和 MAC-SQL 的基準準確度 57.56% 相比，MAG-SQL 達到了 61.08% 的執行準確度。此外，我們的做法在 Spider 上取得了類似的進展。</paragraph>", "author": "Wenxuan Xie et.al.", "authors": "Wenxuan Xie, Gaochen Wu, Bowen Zhou", "id": "2408.07930v1", "paper_url": "http://arxiv.org/abs/2408.07930v1", "repo": "null"}}