{"2405.18723": {"publish_time": "2024-05-29", "title": "Conformal Depression Prediction", "paper_summary": "While existing depression recognition methods based on deep learning show\npromise, their practical application is hindered by the lack of\ntrustworthiness, as these deep models are often deployed as \\textit{black box}\nmodels, leaving us uncertain about the confidence of the model predictions. For\nhigh-risk clinical applications like depression recognition, uncertainty\nquantification is essential in decision-making. In this paper, we introduce\nconformal depression prediction (CDP), a depression recognition method with\nuncertainty quantification based on conformal prediction (CP), giving valid\nconfidence intervals with theoretical coverage guarantees for the model\npredictions. CDP is a plug-and-play module that requires neither model\nretraining nor an assumption about the depression data distribution. As CDP\nprovides only an average performance guarantee across all inputs rather than\nper-input performance guarantee, we propose CDP-ACC, an improved conformal\nprediction with approximate conditional coverage. CDP-ACC firstly estimates the\nprediction distribution through neighborhood relaxation, and then introduces a\nconformal score function by constructing nested sequences, so as to provide\ntighter prediction interval for each specific input. We empirically demonstrate\nthe application of uncertainty quantification in depression recognition, and\nthe effectiveness and superiority of CDP and CDP-ACC on the AVEC 2013 and AVEC\n2014 datasets", "paper_summary_zh": "儘管現有的基於深度學習的憂鬱症辨識方法顯示出前景，其實際應用卻受到可信度的不足所阻礙，因為這些深度模型經常被部署為「黑箱」模型，讓我們無法確定模型預測的置信度。對於憂鬱症辨識等高風險的臨床應用，不確定性量化在決策制定中至關重要。在本文中，我們介紹了共形憂鬱症預測 (CDP)，這是一種基於共形預測 (CP) 的憂鬱症辨識方法，具有不確定性量化，可提供模型預測的有效置信區間，並保證理論涵蓋率。CDP 是一個即插即用的模組，既不需要重新訓練模型，也不需要假設憂鬱症資料分佈。由於 CDP 僅提供所有輸入的平均效能保證，而不是每個輸入的效能保證，因此我們提出了 CDP-ACC，這是一種具有近似條件涵蓋率的改良共形預測。CDP-ACC 首先透過鄰域放鬆來估計預測分佈，然後透過建構巢狀序列來引入共形評分函數，以便為每個特定輸入提供更嚴格的預測區間。我們憑經驗證明了不確定性量化在憂鬱症辨識中的應用，以及 CDP 和 CDP-ACC 在 AVEC 2013 和 AVEC 2014 資料集上的有效性和優越性", "author": "Yonghong Li et.al.", "authors": "Yonghong Li, Shan Qu, Xiuzhuang Zhou", "id": "2405.18723v1", "paper_url": "http://arxiv.org/abs/2405.18723v1", "repo": "null"}}