{"2412.08283": {"publish_time": "2024-12-11", "title": "A Preliminary Analysis of Automatic Word and Syllable Prominence Detection in Non-Native Speech With Text-to-Speech Prosody Embeddings", "paper_summary": "Automatic detection of prominence at the word and syllable-levels is critical\nfor building computer-assisted language learning systems. It has been shown\nthat prosody embeddings learned by the current state-of-the-art (SOTA)\ntext-to-speech (TTS) systems could generate word- and syllable-level prominence\nin the synthesized speech as natural as in native speech. To understand the\neffectiveness of prosody embeddings from TTS for prominence detection under\nnonnative context, a comparative analysis is conducted on the embeddings\nextracted from native and non-native speech considering the prominence-related\nembeddings: duration, energy, and pitch from a SOTA TTS named FastSpeech2.\nThese embeddings are extracted under two conditions considering: 1) only text,\n2) both speech and text. For the first condition, the embeddings are extracted\ndirectly from the TTS inference mode, whereas for the second condition, we\npropose to extract from the TTS under training mode. Experiments are conducted\non native speech corpus: Tatoeba, and non-native speech corpus: ISLE. For\nexperimentation, word-level prominence locations are manually annotated for\nboth corpora. The highest relative improvement on word \\& syllable-level\nprominence detection accuracies with the TTS embeddings are found to be 13.7% &\n5.9% and 16.2% & 6.9% compared to those with the heuristic-based features and\nself-supervised Wav2Vec-2.0 representations, respectively.", "paper_summary_zh": "自動偵測單字和音節層級的重音對於建構電腦輔助語言學習系統至關重要。目前最先進 (SOTA) 的文字轉語音 (TTS) 系統所學習到的韻律嵌入，已被證實可以合成出與母語人士說話一樣自然的單字和音節層級重音。為了了解 TTS 韻律嵌入在非母語脈絡中用於重音偵測的有效性，我們對從母語和非母語演說中萃取出的嵌入進行比較分析，考量 SOTA TTS（稱為 FastSpeech2）中與重音相關的嵌入：時長、能量和音高。這些嵌入是在兩個條件下萃取的：1) 只有文字，2) 語音和文字皆有。對於第一個條件，嵌入是直接從 TTS 推論模式中萃取，而對於第二個條件，我們建議從訓練模式中的 TTS 中萃取。實驗是在母語語料庫：Tatoeba 和非母語語料庫：ISLE 上進行。為了實驗，兩個語料庫的單字層級重音位置都經過手動標註。發現使用 TTS 嵌入在單字和音節層級重音偵測準確率上最高的相對改善為 13.7% 和 5.9% 以及 16.2% 和 6.9%，分別與基於啟發式特徵和自監督 Wav2Vec-2.0 表徵相比。", "author": "Anindita Mondal et.al.", "authors": "Anindita Mondal, Rangavajjala Sankara Bharadwaj, Jhansi Mallela, Anil Kumar Vuppala, Chiranjeevi Yarra", "id": "2412.08283v1", "paper_url": "http://arxiv.org/abs/2412.08283v1", "repo": "null"}}