{"2408.03900": {"publish_time": "2024-08-07", "title": "Speech-MASSIVE: A Multilingual Speech Dataset for SLU and Beyond", "paper_summary": "We present Speech-MASSIVE, a multilingual Spoken Language Understanding (SLU)\ndataset comprising the speech counterpart for a portion of the MASSIVE textual\ncorpus. Speech-MASSIVE covers 12 languages from different families and inherits\nfrom MASSIVE the annotations for the intent prediction and slot-filling tasks.\nOur extension is prompted by the scarcity of massively multilingual SLU\ndatasets and the growing need for versatile speech datasets to assess\nfoundation models (LLMs, speech encoders) across languages and tasks. We\nprovide a multimodal, multitask, multilingual dataset and report SLU baselines\nusing both cascaded and end-to-end architectures in various training scenarios\n(zero-shot, few-shot, and full fine-tune). Furthermore, we demonstrate the\nsuitability of Speech-MASSIVE for benchmarking other tasks such as speech\ntranscription, language identification, and speech translation. The dataset,\nmodels, and code are publicly available at:\nhttps://github.com/hlt-mt/Speech-MASSIVE", "paper_summary_zh": "我們提出 Speech-MASSIVE，一個多語言的口語理解 (SLU)\n資料集，包含 MASSIVE 文本語料庫一部分的口語對應部分。Speech-MASSIVE 涵蓋了來自不同語系的 12 種語言，並繼承了 MASSIVE 中用於意圖預測和槽位填補任務的註解。\n我們的擴展是由大量的多語言 SLU 資料集的稀缺性以及評估跨語言和任務的基礎模型 (LLM、語音編碼器) 對通用語音資料集日益增長的需求所推動的。我們提供了一個多模態、多任務、多語言的資料集，並在各種訓練場景（零次學習、少次學習和完全微調）中報告了使用串聯和端到端架構的 SLU 基線。此外，我們展示了 Speech-MASSIVE 適用於對其他任務（例如語音轉錄、語言識別和語音翻譯）進行基準測試。資料集、模型和程式碼可在以下位置公開獲得：\nhttps://github.com/hlt-mt/Speech-MASSIVE", "author": "Beomseok Lee et.al.", "authors": "Beomseok Lee, Ioan Calapodescu, Marco Gaido, Matteo Negri, Laurent Besacier", "id": "2408.03900v1", "paper_url": "http://arxiv.org/abs/2408.03900v1", "repo": "https://github.com/hlt-mt/speech-massive"}}