{"2410.03263": {"publish_time": "2024-10-04", "title": "Test-time Adaptation for Regression by Subspace Alignment", "paper_summary": "This paper investigates test-time adaptation (TTA) for regression, where a\nregression model pre-trained in a source domain is adapted to an unknown target\ndistribution with unlabeled target data. Although regression is one of the\nfundamental tasks in machine learning, most of the existing TTA methods have\nclassification-specific designs, which assume that models output\nclass-categorical predictions, whereas regression models typically output only\nsingle scalar values. To enable TTA for regression, we adopt a feature\nalignment approach, which aligns the feature distributions between the source\nand target domains to mitigate the domain gap. However, we found that naive\nfeature alignment employed in existing TTA methods for classification is\nineffective or even worse for regression because the features are distributed\nin a small subspace and many of the raw feature dimensions have little\nsignificance to the output. For an effective feature alignment in TTA for\nregression, we propose Significant-subspace Alignment (SSA). SSA consists of\ntwo components: subspace detection and dimension weighting. Subspace detection\nfinds the feature subspace that is representative and significant to the\noutput. Then, the feature alignment is performed in the subspace during TTA.\nMeanwhile, dimension weighting raises the importance of the dimensions of the\nfeature subspace that have greater significance to the output. We\nexperimentally show that SSA outperforms various baselines on real-world\ndatasets.", "paper_summary_zh": "本文研究了回归的测试时自适应 (TTA)，其中在源域中预训练的回归模型被调整到具有未标记目标数据的未知目标分布。虽然回归是机器学习中的基本任务之一，但大多数现有的 TTA 方法都有特定于分类的设计，它们假设模型输出类别分类预测，而回归模型通常仅输出单个标量值。为了实现回归的 TTA，我们采用了一种特征对齐方法，该方法对齐了源域和目标域之间的特征分布以减轻域差距。然而，我们发现用于分类的现有 TTA 方法中采用的朴素特征对齐对于回归无效甚至更糟，因为特征分布在一个小子空间中，并且许多原始特征维度对输出意义不大。为了在回归的 TTA 中进行有效的特征对齐，我们提出了显著子空间对齐 (SSA)。SSA 由两个部分组成：子空间检测和维度加权。子空间检测找到对输出具有代表性和重要性的特征子空间。然后，在 TTA 期间在子空间中执行特征对齐。同时，维度加权提高了对输出具有更大重要性的特征子空间的维度的重要性。我们通过实验表明，SSA 在现实世界的数据集上优于各种基线。", "author": "Kazuki Adachi et.al.", "authors": "Kazuki Adachi, Shin'ya Yamaguchi, Atsutoshi Kumagai, Tomoki Hamagami", "id": "2410.03263v1", "paper_url": "http://arxiv.org/abs/2410.03263v1", "repo": "null"}}