{"2502.15435": {"publish_time": "2025-02-21", "title": "Single-pass Detection of Jailbreaking Input in Large Language Models", "paper_summary": "Defending aligned Large Language Models (LLMs) against jailbreaking attacks\nis a challenging problem, with existing approaches requiring multiple requests\nor even queries to auxiliary LLMs, making them computationally heavy. Instead,\nwe focus on detecting jailbreaking input in a single forward pass. Our method,\ncalled Single Pass Detection SPD, leverages the information carried by the\nlogits to predict whether the output sentence will be harmful. This allows us\nto defend in just one forward pass. SPD can not only detect attacks effectively\non open-source models, but also minimizes the misclassification of harmless\ninputs. Furthermore, we show that SPD remains effective even without complete\nlogit access in GPT-3.5 and GPT-4. We believe that our proposed method offers a\npromising approach to efficiently safeguard LLMs against adversarial attacks.", "paper_summary_zh": "防範大型語言模型（LLM）越獄攻擊是一項艱難的挑戰，現有方法需要多重請求，甚至向輔助 LLM 查詢，導致運算負擔沉重。因此，我們專注於在單次前向傳遞中偵測越獄輸入。我們的稱為單次傳遞偵測（SPD）的方法，利用邏輯值所攜帶的資訊來預測輸出句子是否具有危害性。這讓我們得以在單次前向傳遞中防禦。SPD 不僅能有效偵測開源模型的攻擊，還能將無害輸入的誤分類降到最低。此外，我們證明即使在 GPT-3.5 和 GPT-4 中無法完全存取邏輯值，SPD 仍能保持有效。我們相信所提出的方法提供了一種有效防範 LLM 遭受對抗性攻擊的方法。", "author": "Leyla Naz Candogan et.al.", "authors": "Leyla Naz Candogan, Yongtao Wu, Elias Abad Rocamora, Grigorios G. Chrysos, Volkan Cevher", "id": "2502.15435v1", "paper_url": "http://arxiv.org/abs/2502.15435v1", "repo": "null"}}