{"2409.10756": {"publish_time": "2024-09-16", "title": "VulnLLMEval: A Framework for Evaluating Large Language Models in Software Vulnerability Detection and Patching", "paper_summary": "Large Language Models (LLMs) have shown promise in tasks like code\ntranslation, prompting interest in their potential for automating software\nvulnerability detection (SVD) and patching (SVP). To further research in this\narea, establishing a benchmark is essential for evaluating the strengths and\nlimitations of LLMs in these tasks. Despite their capabilities, questions\nremain regarding whether LLMs can accurately analyze complex vulnerabilities\nand generate appropriate patches. This paper introduces VulnLLMEval, a\nframework designed to assess the performance of LLMs in identifying and\npatching vulnerabilities in C code. Our study includes 307 real-world\nvulnerabilities extracted from the Linux kernel, creating a well-curated\ndataset that includes both vulnerable and patched code. This dataset, based on\nreal-world code, provides a diverse and representative testbed for evaluating\nLLM performance in SVD and SVP tasks, offering a robust foundation for rigorous\nassessment. Our results reveal that LLMs often struggle with distinguishing\nbetween vulnerable and patched code. Furthermore, in SVP tasks, these models\ntend to oversimplify the code, producing solutions that may not be directly\nusable without further refinement.", "paper_summary_zh": "大型語言模型 (LLM) 已在程式碼翻譯等任務中展現出前景，引發人們對其自動化軟體漏洞偵測 (SVD) 和修補 (SVP) 潛力的興趣。為進一步研究此領域，建立基準對於評估 LLM 在這些任務中的優缺點至關重要。儘管它們有能力，但仍有疑問，例如 LLM 是否能準確分析複雜的漏洞並產生適當的修補程式。本文介紹 VulnLLMEval，一個旨在評估 LLM 在識別和修補 C 程式碼漏洞方面的效能的框架。我們的研究包括從 Linux 核心提取的 307 個真實漏洞，建立一個經過精心策劃的資料集，其中包括有漏洞的程式碼和已修補的程式碼。這個基於真實程式碼的資料集提供了一個多樣化且具代表性的測試平台，用於評估 LLM 在 SVD 和 SVP 任務中的效能，為嚴謹的評估提供穩固的基礎。我們的結果顯示，LLM 經常難以區分有漏洞的程式碼和已修補的程式碼。此外，在 SVP 任務中，這些模型傾向於過度簡化程式碼，產生可能無法直接使用的解決方案，而無需進一步修改。", "author": "Arastoo Zibaeirad et.al.", "authors": "Arastoo Zibaeirad, Marco Vieira", "id": "2409.10756v1", "paper_url": "http://arxiv.org/abs/2409.10756v1", "repo": "null"}}