{"2408.03562": {"publish_time": "2024-08-07", "title": "A Comparison of LLM Finetuning Methods & Evaluation Metrics with Travel Chatbot Use Case", "paper_summary": "This research compares large language model (LLM) fine-tuning methods,\nincluding Quantized Low Rank Adapter (QLoRA), Retrieval Augmented fine-tuning\n(RAFT), and Reinforcement Learning from Human Feedback (RLHF), and additionally\ncompared LLM evaluation methods including End to End (E2E) benchmark method of\n\"Golden Answers\", traditional natural language processing (NLP) metrics, RAG\nAssessment (Ragas), OpenAI GPT-4 evaluation metrics, and human evaluation,\nusing the travel chatbot use case. The travel dataset was sourced from the the\nReddit API by requesting posts from travel-related subreddits to get\ntravel-related conversation prompts and personalized travel experiences, and\naugmented for each fine-tuning method. We used two pretrained LLMs utilized for\nfine-tuning research: LLaMa 2 7B, and Mistral 7B. QLoRA and RAFT are applied to\nthe two pretrained models. The inferences from these models are extensively\nevaluated against the aforementioned metrics. The best model according to human\nevaluation and some GPT-4 metrics was Mistral RAFT, so this underwent a\nReinforcement Learning from Human Feedback (RLHF) training pipeline, and\nultimately was evaluated as the best model. Our main findings are that: 1)\nquantitative and Ragas metrics do not align with human evaluation, 2) Open AI\nGPT-4 evaluation most aligns with human evaluation, 3) it is essential to keep\nhumans in the loop for evaluation because, 4) traditional NLP metrics\ninsufficient, 5) Mistral generally outperformed LLaMa, 6) RAFT outperforms\nQLoRA, but still needs postprocessing, 7) RLHF improves model performance\nsignificantly. Next steps include improving data quality, increasing data\nquantity, exploring RAG methods, and focusing data collection on a specific\ncity, which would improve data quality by narrowing the focus, while creating a\nuseful product.", "paper_summary_zh": "本研究比較了大型語言模型 (LLM) 微調方法，包括量化低秩適配器 (QLoRA)、檢索擴增微調 (RAFT) 和人類回饋強化學習 (RLHF)，並額外比較了 LLM 評估方法，包括「黃金答案」的端對端 (E2E) 基準方法、傳統自然語言處理 (NLP) 指標、RAG 評估 (Ragas)、OpenAI GPT-4 評估指標和人類評估，並使用旅遊聊天機器人用例。旅遊資料集來自 Reddit API，透過要求旅遊相關子版塊的貼文來取得旅遊相關對話提示和個人化旅遊體驗，並針對每種微調方法進行擴充。我們使用了兩個預訓練 LLM，用於微調研究：LLaMa 2 7B 和 Mistral 7B。QLoRA 和 RAFT 應用於這兩個預訓練模型。廣泛評估這些模型的推論結果，並使用上述指標。根據人類評估和一些 GPT-4 指標，最好的模型是 Mistral RAFT，因此它接受了人類回饋強化學習 (RLHF) 訓練流程，並最終被評為最佳模型。我們的發現主要有：1) 定量和 Ragas 指標與人類評估不一致，2) Open AI GPT-4 評估最符合人類評估，3) 必須讓人類參與評估，因為 4) 傳統 NLP 指標不足，5) Mistral 通常優於 LLaMa，6) RAFT 優於 QLoRA，但仍需要後處理，7) RLHF 大幅提升了模型效能。後續步驟包括提升資料品質、增加資料數量、探索 RAG 方法，以及專注於特定城市的資料收集，這將透過縮小焦點來提升資料品質，同時創造有用的產品。", "author": "Sonia Meyer et.al.", "authors": "Sonia Meyer, Shreya Singh, Bertha Tam, Christopher Ton, Angel Ren", "id": "2408.03562v1", "paper_url": "http://arxiv.org/abs/2408.03562v1", "repo": "null"}}