{"2405.06485": {"publish_time": "2024-05-10", "title": "Solving Quantified Boolean Formulas with Few Existential Variables", "paper_summary": "The quantified Boolean formula (QBF) problem is an important decision problem\ngenerally viewed as the archetype for PSPACE-completeness. Many problems of\ncentral interest in AI are in general not included in NP, e.g., planning, model\nchecking, and non-monotonic reasoning, and for such problems QBF has\nsuccessfully been used as a modelling tool. However, solvers for QBF are not as\nadvanced as state of the art SAT solvers, which has prevented QBF from becoming\na universal modelling language for PSPACE-complete problems. A theoretical\nexplanation is that QBF (as well as many other PSPACE-complete problems) lacks\nnatural parameters} guaranteeing fixed-parameter tractability (FPT).\n  In this paper we tackle this problem and consider a simple but overlooked\nparameter: the number of existentially quantified variables. This natural\nparameter is virtually unexplored in the literature which one might find\nsurprising given the general scarcity of FPT algorithms for QBF. Via this\nparameterization we then develop a novel FPT algorithm applicable to QBF\ninstances in conjunctive normal form (CNF) of bounded clause length. We\ncomplement this by a W[1]-hardness result for QBF in CNF of unbounded clause\nlength as well as sharper lower bounds for the bounded arity case under the\n(strong) exponential-time hypothesis.", "paper_summary_zh": "量化布林公式 (QBF) 問題是一個重要的決策問題，通常被視為 PSPACE 完整性的原型。許多在 AI 中廣受關注的問題通常不包含在 NP 中，例如規劃、模型檢查和非單調推理，而對於此類問題，QBF 已成功地被用作建模工具。然而，QBF 的求解器不如最先進的 SAT 求解器先進，這使得 QBF 無法成為 PSPACE 完整問題的通用建模語言。一個理論解釋是 QBF（以及許多其他 PSPACE 完整問題）缺乏保證固定參數易處理性 (FPT) 的自然參數。在本文中，我們解決了這個問題，並考慮了一個簡單但被忽視的參數：存在量化變數的數量。這個自然參數在文獻中幾乎沒有被探討，這可能會讓人感到驚訝，因為 QBF 的 FPT 演算法普遍稀少。透過這個參數化，我們接著開發了一個新穎的 FPT 演算法，適用於聯集範式 (CNF) 中從句長度受限的 QBF 實例。我們透過一個 W[1]-hardness 結果對 CNF 中從句長度不受限的 QBF 進行補充，以及在（強）指數時間假設下對有界元數情況進行更嚴格的下界。", "author": "Leif Eriksson et.al.", "authors": "Leif Eriksson, Victor Lagerkvist, George Osipov, Sebastian Ordyniak, Fahad Panolan, Mateusz Rychlicki", "id": "2405.06485v1", "paper_url": "http://arxiv.org/abs/2405.06485v1", "repo": "null"}}