{"2406.00663": {"publish_time": "2024-06-02", "title": "SimSAM: Zero-shot Medical Image Segmentation via Simulated Interaction", "paper_summary": "The recently released Segment Anything Model (SAM) has shown powerful\nzero-shot segmentation capabilities through a semi-automatic annotation setup\nin which the user can provide a prompt in the form of clicks or bounding boxes.\nThere is growing interest around applying this to medical imaging, where the\ncost of obtaining expert annotations is high, privacy restrictions may limit\nsharing of patient data, and model generalisation is often poor. However, there\nare large amounts of inherent uncertainty in medical images, due to unclear\nobject boundaries, low-contrast media, and differences in expert labelling\nstyle. Currently, SAM is known to struggle in a zero-shot setting to adequately\nannotate the contours of the structure of interest in medical images, where the\nuncertainty is often greatest, thus requiring significant manual correction. To\nmitigate this, we introduce \\textbf{Sim}ulated Interaction for \\textbf{S}egment\n\\textbf{A}nything \\textbf{M}odel (\\textsc{\\textbf{SimSAM}}), an approach that\nleverages simulated user interaction to generate an arbitrary number of\ncandidate masks, and uses a novel aggregation approach to output the most\ncompatible mask. Crucially, our method can be used during inference directly on\ntop of SAM, without any additional training requirement. Quantitatively, we\nevaluate our method across three publicly available medical imaging datasets,\nand find that our approach leads to up to a 15.5\\% improvement in contour\nsegmentation accuracy compared to zero-shot SAM. Our code is available at\n\\url{https://github.com/BenjaminTowle/SimSAM}.", "paper_summary_zh": "最近发布的 Segment Anything Model (SAM) 已通过半自动注释设置展示了强大的零次分段能力，其中用户可以通过单击或边界框的形式提供提示。人们越来越有兴趣将此应用于医学影像，其中获得专家注释的成本很高，隐私限制可能会限制患者数据的共享，并且模型泛化通常很差。然而，由于对象的边界不清、介质对比度低以及专家标记风格的差异，医学影像中存在大量固有的不确定性。目前，已知 SAM 在零次设置中难以充分注释医学影像中感兴趣结构的轮廓，其中不确定性通常最大，因此需要大量的手动校正。为了缓解这种情况，我们引入了 \\textbf{S}imulated \\textbf{I}nteraction for \\textbf{S}egment \\textbf{A}nything \\textbf{M}odel (\\textsc{\\textbf{SimSAM}}），这是一种利用模拟用户交互来生成任意数量的候选掩码的方法，并使用新颖的聚合方法来输出最兼容的掩码。至关重要的是，我们的方法可以直接在 SAM 之上使用，而无需任何额外的训练要求。在数量方面，我们对三种公开的医学影像数据集评估了我们的方法，并发现与零次 SAM 相比，我们的方法在轮廓分段准确性方面提高了 15.5%。我们的代码可在 \\url{https://github.com/BenjaminTowle/SimSAM} 获得。", "author": "Benjamin Towle et.al.", "authors": "Benjamin Towle, Xin Chen, Ke Zhou", "id": "2406.00663v1", "paper_url": "http://arxiv.org/abs/2406.00663v1", "repo": "https://github.com/benjamintowle/simsam"}}