{"2304.01543": {"publish_time": "2023-04-04", "title": "A Brief Review of Explainable Artificial Intelligence in Healthcare", "paper_summary": "XAI refers to the techniques and methods for building AI applications which\nassist end users to interpret output and predictions of AI models. Black box AI\napplications in high-stakes decision-making situations, such as medical domain\nhave increased the demand for transparency and explainability since wrong\npredictions may have severe consequences. Model explainability and\ninterpretability are vital successful deployment of AI models in healthcare\npractices. AI applications' underlying reasoning needs to be transparent to\nclinicians in order to gain their trust. This paper presents a systematic\nreview of XAI aspects and challenges in the healthcare domain. The primary\ngoals of this study are to review various XAI methods, their challenges, and\nrelated machine learning models in healthcare. The methods are discussed under\nsix categories: Features-oriented methods, global methods, concept models,\nsurrogate models, local pixel-based methods, and human-centric methods. Most\nimportantly, the paper explores XAI role in healthcare problems to clarify its\nnecessity in safety-critical applications. The paper intends to establish a\ncomprehensive understanding of XAI-related applications in the healthcare field\nby reviewing the related experimental results. To facilitate future research\nfor filling research gaps, the importance of XAI models from different\nviewpoints and their limitations are investigated.", "paper_summary_zh": "XAI 指的是用於建構 AI 應用程式的技術和方法，這些應用程式可協助最終使用者詮釋 AI 模型的輸出和預測。在高風險決策情境中，例如醫療領域，黑箱 AI 應用程式增加了透明度和可解釋性的需求，因為錯誤的預測可能會造成嚴重的後果。模型可解釋性和可詮釋性對於在醫療實務中成功部署 AI 模型至關重要。AI 應用程式的基本推理需要對臨床醫生透明，才能獲得他們的信任。本文提供了醫療領域中 XAI 面向和挑戰的系統性回顧。本研究的主要目標是回顧各種 XAI 方法、其挑戰，以及相關的醫療保健機器學習模型。這些方法分為六類討論：面向特徵的方法、整體方法、概念模型、代理模型、局部基於像素的方法，以及以人為中心的方法。最重要的是，本文探討了 XAI 在醫療保健問題中的角色，以釐清其在安全關鍵應用中的必要性。本文旨在透過回顧相關的實驗結果，建立對醫療保健領域中 XAI 相關應用程式的全面了解。為了促進未來研究填補研究差距，本文探討了 XAI 模型從不同觀點來看的重要性及其限制。", "author": "Zahra Sadeghi et.al.", "authors": "Zahra Sadeghi, Roohallah Alizadehsani, Mehmet Akif Cifci, Samina Kausar, Rizwan Rehman, Priyakshi Mahanta, Pranjal Kumar Bora, Ammar Almasri, Rami S. Alkhawaldeh, Sadiq Hussain, Bilal Alatas, Afshin Shoeibi, Hossein Moosaei, Milan Hladik, Saeid Nahavandi, Panos M. Pardalos", "id": "2304.01543v1", "paper_url": "http://arxiv.org/abs/2304.01543v1", "repo": "null"}}