{"2407.19667": {"publish_time": "2024-07-29", "title": "Smart Language Agents in Real-World Planning", "paper_summary": "Comprehensive planning agents have been a long term goal in the field of\nartificial intelligence. Recent innovations in Natural Language Processing have\nyielded success through the advent of Large Language Models (LLMs). We seek to\nimprove the travel-planning capability of such LLMs by extending upon the work\nof the previous paper TravelPlanner. Our objective is to explore a new method\nof using LLMs to improve the travel planning experience. We focus specifically\non the \"sole-planning\" mode of travel planning; that is, the agent is given\nnecessary reference information, and its goal is to create a comprehensive plan\nfrom the reference information. While this does not simulate the real-world we\nfeel that an optimization of the sole-planning capability of a travel planning\nagent will still be able to enhance the overall user experience. We propose a\nsemi-automated prompt generation framework which combines the LLM-automated\nprompt and \"human-in-the-loop\" to iteratively refine the prompt to improve the\nLLM performance. Our result shows that LLM automated prompt has its limitations\nand \"human-in-the-loop\" greatly improves the performance by $139\\%$ with one\nsingle iteration.", "paper_summary_zh": "綜合規劃代理一直是人工智慧領域的長期目標。自然語言處理的最新創新已通過大型語言模型 (LLM) 的出現取得成功。我們尋求通過擴展先前論文 TravelPlanner 的工作來改善此類 LLM 的旅遊規劃能力。我們的目標是探索一種新的使用 LLM 來改善旅遊規劃體驗的方法。我們特別關注旅遊規劃的「單獨規劃」模式；也就是說，代理會獲得必要的參考資訊，其目標是根據參考資訊建立一個綜合計畫。雖然這無法模擬現實世界，但我們認為，旅遊規劃代理的單獨規劃能力的最佳化仍將能夠提升整體使用者體驗。我們提出一個半自動提示生成框架，它結合了 LLM 自動化提示和「人機協作」以反覆改善提示，以提升 LLM 效能。我們的結果顯示，LLM 自動化提示有其限制，而「人機協作」透過一次反覆運算大幅提升了 $139%$ 的效能。", "author": "Annabelle Miin et.al.", "authors": "Annabelle Miin, Timothy Wei", "id": "2407.19667v1", "paper_url": "http://arxiv.org/abs/2407.19667v1", "repo": "https://github.com/llv22/travelplanner_forward"}}