{"2502.03444": {"publish_time": "2025-02-05", "title": "Masked Autoencoders Are Effective Tokenizers for Diffusion Models", "paper_summary": "Recent advances in latent diffusion models have demonstrated their\neffectiveness for high-resolution image synthesis. However, the properties of\nthe latent space from tokenizer for better learning and generation of diffusion\nmodels remain under-explored. Theoretically and empirically, we find that\nimproved generation quality is closely tied to the latent distributions with\nbetter structure, such as the ones with fewer Gaussian Mixture modes and more\ndiscriminative features. Motivated by these insights, we propose MAETok, an\nautoencoder (AE) leveraging mask modeling to learn semantically rich latent\nspace while maintaining reconstruction fidelity. Extensive experiments validate\nour analysis, demonstrating that the variational form of autoencoders is not\nnecessary, and a discriminative latent space from AE alone enables\nstate-of-the-art performance on ImageNet generation using only 128 tokens.\nMAETok achieves significant practical improvements, enabling a gFID of 1.69\nwith 76x faster training and 31x higher inference throughput for 512x512\ngeneration. Our findings show that the structure of the latent space, rather\nthan variational constraints, is crucial for effective diffusion models. Code\nand trained models are released.", "paper_summary_zh": "最近在潜在扩散模型方面的進展已證明其在高解析度影像合成方面的有效性。然而，用於更好的學習和生成擴散模型的標記器所產生的潛在空間的特性仍未被充分探討。在理論和經驗上，我們發現改進的生成品質與具有更好結構的潛在分佈密切相關，例如具有較少高斯混合模式和更多判別特徵的潛在分佈。受這些見解的啟發，我們提出了 MAETok，一種利用遮罩建模學習語義豐富潛在空間並同時維持重建保真度的自動編碼器 (AE)。廣泛的實驗驗證了我們的分析，證明了自動編碼器的變分形式並非必要，而且僅來自 AE 的判別潛在空間就能使用僅 128 個標記在 ImageNet 生成方面實現最先進的效能。MAETok 實現了顯著的實際改進，讓 512x512 生成能夠以 76 倍更快的訓練速度和 31 倍更高的推論處理量實現 1.69 的 gFID。我們的發現表明，潛在空間的結構，而非變分約束，對於有效的擴散模型至關重要。程式碼和訓練好的模型已發布。", "author": "Hao Chen et.al.", "authors": "Hao Chen, Yujin Han, Fangyi Chen, Xiang Li, Yidong Wang, Jindong Wang, Ze Wang, Zicheng Liu, Difan Zou, Bhiksha Raj", "id": "2502.03444v1", "paper_url": "http://arxiv.org/abs/2502.03444v1", "repo": "null"}}