{"2408.06673": {"publish_time": "2024-08-13", "title": "Pragmatic inference of scalar implicature by LLMs", "paper_summary": "This study investigates how Large Language Models (LLMs), particularly BERT\n(Devlin et al., 2019) and GPT-2 (Radford et al., 2019), engage in pragmatic\ninference of scalar implicature, such as some. Two sets of experiments were\nconducted using cosine similarity and next sentence/token prediction as\nexperimental methods. The results in experiment 1 showed that, both models\ninterpret some as pragmatic implicature not all in the absence of context,\naligning with human language processing. In experiment 2, in which Question\nUnder Discussion (QUD) was presented as a contextual cue, BERT showed\nconsistent performance regardless of types of QUDs, while GPT-2 encountered\nprocessing difficulties since a certain type of QUD required pragmatic\ninference for implicature. The findings revealed that, in terms of theoretical\napproaches, BERT inherently incorporates pragmatic implicature not all within\nthe term some, adhering to Default model (Levinson, 2000). In contrast, GPT-2\nseems to encounter processing difficulties in inferring pragmatic implicature\nwithin context, consistent with Context-driven model (Sperber and Wilson,\n2002).", "paper_summary_zh": "本研究探討大型語言模型 (LLM)，特別是 BERT (Devlin 等人，2019) 和 GPT-2 (Radford 等人，2019) 如何進行標量暗示的語用推理，例如 some。使用餘弦相似性和下一個句子/符號預測作為實驗方法，進行了兩組實驗。實驗 1 的結果表明，這兩個模型在沒有語境的情況下，都將 some 解釋為語用暗示 not all，這與人類語言處理一致。在實驗 2 中，其中問題討論 (QUD) 被呈現為語境線索，BERT 顯示出無論 QUD 類型如何，都具有穩定的表現，而 GPT-2 遇到處理困難，因為某種類型的 QUD 需要語用推理才能暗示。研究結果表明，在理論方法方面，BERT 本質上將語用暗示 not all 納入術語 some 中，遵循默認模型 (Levinson，2000)。相比之下，GPT-2 似乎在推論語境中的語用暗示時遇到處理困難，這與語境驅動模型 (Sperber 和 Wilson，2002) 一致。", "author": "Ye-eun Cho et.al.", "authors": "Ye-eun Cho, Seong mook Kim", "id": "2408.06673v1", "paper_url": "http://arxiv.org/abs/2408.06673v1", "repo": "null"}}