{"2408.15630": {"publish_time": "2024-08-28", "title": "CodeSift: An LLM-Based Reference-Less Framework for Automatic Code Validation", "paper_summary": "The advent of large language models (LLMs) has greatly facilitated code\ngeneration, but ensuring the functional correctness of generated code remains a\nchallenge. Traditional validation methods are often time-consuming,\nerror-prone, and impractical for large volumes of code. We introduce CodeSift,\na novel framework that leverages LLMs as the first-line filter of code\nvalidation without the need for execution, reference code, or human feedback,\nthereby reducing the validation effort. We assess the effectiveness of our\nmethod across three diverse datasets encompassing two programming languages.\nOur results indicate that CodeSift outperforms state-of-the-art code evaluation\nmethods. Internal testing conducted with subject matter experts reveals that\nthe output generated by CodeSift is in line with human preference, reinforcing\nits effectiveness as a dependable automated code validation tool.", "paper_summary_zh": "大型語言模型 (LLM) 的出現極大地方便了程式碼生成，但是確保已生成程式碼的功能正確性仍然是一項挑戰。傳統驗證方法通常耗時、容易出錯，而且不適用於大量程式碼。我們介紹 CodeSift，一個新穎的架構，它利用 LLM 作為程式碼驗證的第一線過濾器，無需執行、參考程式碼或人為回饋，從而減少驗證工作。我們評估了我們的方法在涵蓋兩種程式語言的三個不同資料集中的有效性。我們的結果表明，CodeSift 優於最先進的程式碼評估方法。與主題專家進行的內部測試表明，CodeSift 生成的輸出符合人類偏好，加強了其作為可靠的自動化程式碼驗證工具的有效性。", "author": "Pooja Aggarwal et.al.", "authors": "Pooja Aggarwal, Oishik Chatterjee, Ting Dai, Prateeti Mohapatra, Brent Paulovicks, Brad Blancett, Arthur De Magalhaes", "id": "2408.15630v1", "paper_url": "http://arxiv.org/abs/2408.15630v1", "repo": "null"}}