{"2405.14753": {"publish_time": "2024-05-23", "title": "A Transformer-Based Approach for Smart Invocation of Automatic Code Completion", "paper_summary": "Transformer-based language models are highly effective for code completion,\nwith much research dedicated to enhancing the content of these completions.\nDespite their effectiveness, these models come with high operational costs and\ncan be intrusive, especially when they suggest too often and interrupt\ndevelopers who are concentrating on their work. Current research largely\noverlooks how these models interact with developers in practice and neglects to\naddress when a developer should receive completion suggestions. To tackle this\nissue, we developed a machine learning model that can accurately predict when\nto invoke a code completion tool given the code context and available telemetry\ndata.\n  To do so, we collect a dataset of 200k developer interactions with our\ncross-IDE code completion plugin and train several invocation filtering models.\nOur results indicate that our small-scale transformer model significantly\noutperforms the baseline while maintaining low enough latency. We further\nexplore the search space for integrating additional telemetry data into a\npre-trained transformer directly and obtain promising results. To further\ndemonstrate our approach's practical potential, we deployed the model in an\nonline environment with 34 developers and provided real-world insights based on\n74k actual invocations.", "paper_summary_zh": "基於 Transformer 的語言模型對於程式碼補完非常有效，許多研究致力於加強這些補完的內容。儘管這些模型很有效，但它們的運作成本很高，而且可能會造成干擾，特別是在它們過於頻繁地提出建議並中斷專注於工作的開發人員時。目前的許多研究都忽略了這些模型實際上如何與開發人員互動，而且忽略了何時應該向開發人員提供補完建議的問題。為了解決這個問題，我們開發了一個機器學習模型，它可以根據程式碼內容和可用的遙測資料準確預測何時呼叫程式碼補完工具。為此，我們收集了一個包含 20 萬個開發人員與我們的跨 IDE 程式碼補完外掛程式互動的資料集，並訓練了幾個呼叫過濾模型。我們的結果表明，我們的微型 Transformer 模型顯著優於基線，同時維持足夠低的延遲。我們進一步探索了將額外的遙測資料直接整合到預先訓練的 Transformer 的搜尋空間，並獲得了有希望的結果。為了進一步證明我們的方法的實際潛力，我們在一個線上環境中部署了這個模型，其中有 34 位開發人員，並根據 7 萬 4 千個實際呼叫提供了真實世界的見解。", "author": "Aral de Moor et.al.", "authors": "Aral de Moor, Arie van Deursen, Maliheh Izadi", "id": "2405.14753v1", "paper_url": "http://arxiv.org/abs/2405.14753v1", "repo": "null"}}