{"2406.15275": {"publish_time": "2024-06-21", "title": "Cognitive Map for Language Models: Optimal Planning via Verbally Representing the World Model", "paper_summary": "Language models have demonstrated impressive capabilities across various\nnatural language processing tasks, yet they struggle with planning tasks\nrequiring multi-step simulations. Inspired by human cognitive processes, this\npaper investigates the optimal planning power of language models that can\nconstruct a cognitive map of a given environment. Our experiments demonstrate\nthat cognitive map significantly enhances the performance of both optimal and\nreachable planning generation ability in the Gridworld path planning task. We\nobserve that our method showcases two key characteristics similar to human\ncognition: \\textbf{generalization of its planning ability to extrapolated\nenvironments and rapid adaptation with limited training data.} We hope our\nfindings in the Gridworld task provide insights into modeling human cognitive\nprocesses in language models, potentially leading to the development of more\nadvanced and robust systems that better resemble human cognition.", "paper_summary_zh": "語言模型已在各種自然語言處理任務中展現令人印象深刻的能力，但它們在需要多步驟模擬的規劃任務中仍有困難。本文受到人類認知過程的啟發，探討了能夠建構給定環境認知地圖的語言模型的最佳規劃能力。我們的實驗證明，認知地圖顯著提升了網格世界路徑規劃任務中最佳規劃和可達規劃生成能力的表現。我們觀察到，我們的方法展示了兩個與人類認知相似的關鍵特徵：\\textbf{將其規劃能力概化到外推環境和利用有限訓練資料快速適應。}我們希望我們在網格世界任務中的發現能為語言模型中的人類認知過程建模提供見解，進而可能導致開發出更進階且穩健的系統，這些系統更能類似人類認知。", "author": "Doyoung Kim et.al.", "authors": "Doyoung Kim, Jongwon Lee, Jinho Park, Minjoon Seo", "id": "2406.15275v1", "paper_url": "http://arxiv.org/abs/2406.15275v1", "repo": "null"}}