{"2411.18071": {"publish_time": "2024-11-27", "title": "Simulating Tabular Datasets through LLMs to Rapidly Explore Hypotheses about Real-World Entities", "paper_summary": "Do horror writers have worse childhoods than other writers? Though\nbiographical details are known about many writers, quantitatively exploring\nsuch a qualitative hypothesis requires significant human effort, e.g. to sift\nthrough many biographies and interviews of writers and to iteratively search\nfor quantitative features that reflect what is qualitatively of interest. This\npaper explores the potential to quickly prototype these kinds of hypotheses\nthrough (1) applying LLMs to estimate properties of concrete entities like\nspecific people, companies, books, kinds of animals, and countries; (2)\nperforming off-the-shelf analysis methods to reveal possible relationships\namong such properties (e.g. linear regression); and towards further automation,\n(3) applying LLMs to suggest the quantitative properties themselves that could\nhelp ground a particular qualitative hypothesis (e.g. number of adverse\nchildhood events, in the context of the running example). The hope is to allow\nsifting through hypotheses more quickly through collaboration between human and\nmachine. Our experiments highlight that indeed, LLMs can serve as useful\nestimators of tabular data about specific entities across a range of domains,\nand that such estimations improve with model scale. Further, initial\nexperiments demonstrate the potential of LLMs to map a qualitative hypothesis\nof interest to relevant concrete variables that the LLM can then estimate. The\nconclusion is that LLMs offer intriguing potential to help illuminate\nscientifically interesting patterns latent within the internet-scale data they\nare trained upon.", "paper_summary_zh": "恐怖小說作家比其他作家有更糟糕的童年嗎？儘管許多作家的傳記細節都是已知的，但要量化探討這種定性的假設需要大量的人力，例如篩選許多作家的傳記和訪談，並反覆搜尋反映定性興趣的量化特徵。本文探討了透過以下方式快速建立這些假設的原型：(1) 應用 LLM 來估計具體實體（如特定人物、公司、書籍、動物種類和國家）的屬性；(2) 執行現成的分析方法來揭示此類屬性之間可能的關係（例如線性回歸）；以及朝向進一步自動化，(3) 應用 LLM 來建議量化屬性本身，這有助於建立特定的定性假設（例如在執行範例的背景下，不利的童年事件的數量）。希望透過人機協作更快速地篩選假設。我們的實驗強調，事實上，LLM 可以作為跨領域特定實體的表格資料的有用估計器，而且此類估計會隨著模型規模而改善。此外，初步實驗證明了 LLM 將定性的假設興趣對應到 LLM 然後可以估計的相關具體變數的潛力。結論是，LLM 提供了有趣的潛力，有助於闡明訓練他們時潛藏在網際網路規模資料中的科學有趣模式。", "author": "Miguel Zabaleta et.al.", "authors": "Miguel Zabaleta, Joel Lehman", "id": "2411.18071v1", "paper_url": "http://arxiv.org/abs/2411.18071v1", "repo": "null"}}