{"2411.19763": {"publish_time": "2024-11-29", "title": "Forecasting Foreign Exchange Market Prices Using Technical Indicators with Deep Learning and Attention Mechanism", "paper_summary": "Accurate prediction of price behavior in the foreign exchange market is\ncrucial. This paper proposes a novel approach that leverages technical\nindicators and deep neural networks. The proposed architecture consists of a\nLong Short-Term Memory (LSTM) and Convolutional Neural Network (CNN), and\nattention mechanism. Initially, trend and oscillation technical indicators are\nemployed to extract statistical features from Forex currency pair data,\nproviding insights into price trends, market volatility, relative price\nstrength, and overbought and oversold conditions. Subsequently, the LSTM and\nCNN networks are utilized in parallel to predict future price movements,\nleveraging the strengths of both recurrent and convolutional architectures. The\nLSTM network captures long-term dependencies and temporal patterns in the data,\nwhile the CNN network extracts local patterns. The outputs of the parallel LSTM\nand CNN networks are then fed into an attention mechanism, which learns to\nweigh the importance of each feature and temporal dependency, generating a\ncontext-aware representation of the input data. The attention-weighted output\nis then used to predict future price movements, enabling the model to focus on\nthe most relevant features and temporal dependencies. Through a comprehensive\nevaluation of the proposed approach on multiple Forex currency pairs, we\ndemonstrate its effectiveness in predicting price behavior and outperforming\nbenchmark models.", "paper_summary_zh": "準確預測外匯市場的價格行為至關重要。本文提出了一種利用技術指標和深度神經網路的新方法。所提出的架構包含長短期記憶 (LSTM) 和卷積神經網路 (CNN)，以及注意力機制。最初，趨勢和振盪技術指標用於從外匯貨幣對數據中提取統計特徵，提供對價格趨勢、市場波動、相對價格強度以及超買和超賣狀況的見解。隨後，LSTM 和 CNN 網路並行使用來預測未來的價格變動，利用遞迴和卷積架構的優勢。LSTM 網路捕捉數據中的長期依賴性和時間模式，而 CNN 網路提取局部模式。並行 LSTM 和 CNN 網路的輸出隨後被饋入注意力機制，該機制學習權衡每個特徵和時間依賴性的重要性，生成輸入數據的上下文感知表示。然後使用注意力加權輸出預測未來的價格變動，使模型能夠專注於最相關的特徵和時間依賴性。通過對多個外匯貨幣對的所提出方法進行全面評估，我們證明了其在預測價格行為和優於基準模型方面的有效性。", "author": "Sahabeh Saadati et.al.", "authors": "Sahabeh Saadati, Mohammad Manthouri", "id": "2411.19763v1", "paper_url": "http://arxiv.org/abs/2411.19763v1", "repo": "null"}}