{"2407.00531": {"publish_time": "2024-06-29", "title": "Interpreting Pretrained Speech Models for Automatic Speech Assessment of Voice Disorders", "paper_summary": "Speech contains information that is clinically relevant to some diseases,\nwhich has the potential to be used for health assessment. Recent work shows an\ninterest in applying deep learning algorithms, especially pretrained large\nspeech models to the applications of Automatic Speech Assessment. One question\nthat has not been explored is how these models output the results based on\ntheir inputs. In this work, we train and compare two configurations of Audio\nSpectrogram Transformer in the context of Voice Disorder Detection and apply\nthe attention rollout method to produce model relevance maps, the computed\nrelevance of the spectrogram regions when the model makes predictions. We use\nthese maps to analyse how models make predictions in different conditions and\nto show that the spread of attention is reduced as a model is finetuned, and\nthe model attention is concentrated on specific phoneme regions.", "paper_summary_zh": "语音包含一些疾病的临床相关信息，\n这有潜力用于健康评估。最近的研究表明有兴趣应用深度学习算法，尤其是预训练的大型\n语音模型用于自动语音评估的应用。一个尚未探索的问题是这些模型如何根据\n其输入输出结果。在这项工作中，我们在语音障碍检测的背景下训练和比较了两个音频\n频谱图转换器的配置，并应用注意力展开方法来生成模型相关性图，即模型做出预测时频谱图区域的计算相关性。我们使用\n这些图来分析模型如何在不同条件下做出预测，并表明随着模型的微调，注意力的分布会减少，并且\n模型注意力集中在特定的音素区域。", "author": "Hok-Shing Lau et.al.", "authors": "Hok-Shing Lau, Mark Huntly, Nathon Morgan, Adesua Iyenoma, Biao Zeng, Tim Bashford", "id": "2407.00531v1", "paper_url": "http://arxiv.org/abs/2407.00531v1", "repo": "null"}}