{"2412.18443": {"publish_time": "2024-12-24", "title": "Is Large Language Model Good at Triple Set Prediction? An Empirical Study", "paper_summary": "The core of the Knowledge Graph Completion (KGC) task is to predict and\ncomplete the missing relations or nodes in a KG. Common KGC tasks are mostly\nabout inferring unknown elements with one or two elements being known in a\ntriple. In comparison, the Triple Set Prediction (TSP) task is a more realistic\nknowledge graph completion task. It aims to predict all elements of unknown\ntriples based on the information from known triples. In recent years, large\nlanguage models (LLMs) have exhibited significant advancements in language\ncomprehension, demonstrating considerable potential for KGC tasks. However, the\npotential of LLM on the TSP task has not yet to be investigated. Thus in this\npaper we proposed a new framework to explore the strengths and limitations of\nLLM in the TSP task. Specifically, the framework consists of LLM-based rule\nmining and LLM-based triple set prediction. The relation list of KG embedded\nwithin rich semantic information is first leveraged to prompt LLM in the\ngeneration of rules. This process is both efficient and independent of\nstatistical information, making it easier to mine effective and realistic\nrules. For each subgraph, the specified rule is applied in conjunction with the\nrelevant triples within that subgraph to guide the LLM in predicting the\nmissing triples. Subsequently, the predictions from all subgraphs are\nconsolidated to derive the complete set of predicted triples on KG. Finally,\nthe method is evaluated on the relatively complete CFamily dataset. The\nexperimental results indicate that when LLMs are required to adhere to a large\namount of factual knowledge to predict missing triples, significant\nhallucinations occurs, leading to a noticeable decline in performance. To\nfurther explore the causes of this phenomenon, this paper presents a\ncomprehensive analysis supported by a detailed case study.", "paper_summary_zh": "知識圖譜完成 (KGC) 任務的核心是預測和完成 KG 中遺失的關係或節點。常見的 KGC 任務大多是關於推論未知元素，其中一個或兩個元素在三元組中已知。相比之下，三元組集合預測 (TSP) 任務是一個更實際的知識圖譜完成任務。它旨在根據已知三元組中的資訊預測未知三元組的所有元素。近年來，大型語言模型 (LLM) 在語言理解方面表現出顯著的進步，顯示出 KGC 任務的巨大潛力。然而，LLM 在 TSP 任務上的潛力尚未得到探討。因此，在本文中，我們提出了一個新的框架來探索 LLM 在 TSP 任務中的優勢和局限性。具體來說，該框架包含基於 LLM 的規則挖掘和基於 LLM 的三元組集合預測。嵌入豐富語義資訊的 KG 關係清單首先被利用來提示 LLM 生成規則。這個過程既有效率又獨立於統計資訊，使得挖掘有效且實際的規則變得更容易。對於每個子圖，指定規則與該子圖中相關的三元組結合使用，以指導 LLM 預測遺失的三元組。隨後，合併所有子圖的預測，以推導 KG 上預測三元組的完整集合。最後，該方法在相對完整的 CFamily 資料集上進行評估。實驗結果表明，當要求 LLM 遵循大量事實知識來預測遺失的三元組時，會發生顯著的幻覺，導致效能顯著下降。為了進一步探討這種現象的原因，本文提出了由詳細案例研究支援的全面分析。", "author": "Yuan Yuan et.al.", "authors": "Yuan Yuan, Yajing Xu, Wen Zhang", "id": "2412.18443v1", "paper_url": "http://arxiv.org/abs/2412.18443v1", "repo": "null"}}