{"2411.16027": {"publish_time": "2024-11-25", "title": "From Dashcam Videos to Driving Simulations: Stress Testing Automated Vehicles against Rare Events", "paper_summary": "Testing Automated Driving Systems (ADS) in simulation with realistic driving\nscenarios is important for verifying their performance. However, converting\nreal-world driving videos into simulation scenarios is a significant challenge\ndue to the complexity of interpreting high-dimensional video data and the\ntime-consuming nature of precise manual scenario reconstruction. In this work,\nwe propose a novel framework that automates the conversion of real-world car\ncrash videos into detailed simulation scenarios for ADS testing. Our approach\nleverages prompt-engineered Video Language Models(VLM) to transform dashcam\nfootage into SCENIC scripts, which define the environment and driving behaviors\nin the CARLA simulator, enabling the generation of realistic simulation\nscenarios. Importantly, rather than solely aiming for one-to-one scenario\nreconstruction, our framework focuses on capturing the essential driving\nbehaviors from the original video while offering flexibility in parameters such\nas weather or road conditions to facilitate search-based testing. Additionally,\nwe introduce a similarity metric that helps iteratively refine the generated\nscenario through feedback by comparing key features of driving behaviors\nbetween the real and simulated videos. Our preliminary results demonstrate\nsubstantial time efficiency, finishing the real-to-sim conversion in minutes\nwith full automation and no human intervention, while maintaining high fidelity\nto the original driving events.", "paper_summary_zh": "在模擬中使用逼真的駕駛情境測試自動駕駛系統 (ADS) 對於驗證其效能非常重要。然而，由於難以詮釋高維度的影片資料，以及精確手動場景重建耗時，將真實世界的駕駛影片轉換成模擬場景是一項重大的挑戰。在此研究中，我們提出一個創新的架構，可自動將真實世界的汽車碰撞影片轉換成 ADS 測試的詳細模擬場景。我們的做法利用提示工程化影片語言模型 (VLM) 將行車記錄器畫面轉換成 SCENIC 腳本，定義 CARLA 模擬器中的環境和駕駛行為，進而產生逼真的模擬場景。重要的是，我們的架構並非僅以一對一的場景重建為目標，而是專注於擷取原始影片中的基本駕駛行為，同時在天氣或道路狀況等參數中提供彈性，以利於搜尋式測試。此外，我們引入了一個相似度量數，有助於透過比較真實和模擬影片中駕駛行為的關鍵特徵，反覆改善產生的場景。我們的初步結果證明了大幅的省時效率，在完全自動化且無需人工介入的情況下，於數分鐘內完成真實到模擬的轉換，同時維持對原始駕駛事件的高度保真度。", "author": "Yan Miao et.al.", "authors": "Yan Miao, Georgios Fainekos, Bardh Hoxha, Hideki Okamoto, Danil Prokhorov, Sayan Mitra", "id": "2411.16027v1", "paper_url": "http://arxiv.org/abs/2411.16027v1", "repo": "null"}}