{"2411.11409": {"publish_time": "2024-11-18", "title": "IKEA Manuals at Work: 4D Grounding of Assembly Instructions on Internet Videos", "paper_summary": "Shape assembly is a ubiquitous task in daily life, integral for constructing\ncomplex 3D structures like IKEA furniture. While significant progress has been\nmade in developing autonomous agents for shape assembly, existing datasets have\nnot yet tackled the 4D grounding of assembly instructions in videos, essential\nfor a holistic understanding of assembly in 3D space over time. We introduce\nIKEA Video Manuals, a dataset that features 3D models of furniture parts,\ninstructional manuals, assembly videos from the Internet, and most importantly,\nannotations of dense spatio-temporal alignments between these data modalities.\nTo demonstrate the utility of IKEA Video Manuals, we present five applications\nessential for shape assembly: assembly plan generation, part-conditioned\nsegmentation, part-conditioned pose estimation, video object segmentation, and\nfurniture assembly based on instructional video manuals. For each application,\nwe provide evaluation metrics and baseline methods. Through experiments on our\nannotated data, we highlight many challenges in grounding assembly instructions\nin videos to improve shape assembly, including handling occlusions, varying\nviewpoints, and extended assembly sequences.", "paper_summary_zh": "形狀組裝在日常生活中是一項普遍的任務，對於建構像 IKEA 家具一樣複雜的 3D 結構至關重要。儘管在開發形狀組裝的自主代理方面已取得顯著進展，但現有的資料集尚未解決影片中組裝說明的 4D 基礎，這對於整體了解 3D 空間中隨時間推移的組裝至關重要。我們介紹了 IKEA Video Manuals，這是一個資料集，其中包含家具零件的 3D 模型、教學手冊、來自網際網路的組裝影片，最重要的是，這些資料模式之間密集時空對齊的註解。為了展示 IKEA Video Manuals 的實用性，我們提出了形狀組裝的五項基本應用：組裝計畫產生、零件條件分割、零件條件姿勢估計、影片物件分割，以及基於教學影片手冊的家具組裝。對於每個應用程式，我們提供評估指標和基準方法。透過我們註解資料的實驗，我們強調了在影片中建立組裝說明以改善形狀組裝的許多挑戰，包括處理遮擋、不同的視角和延伸的組裝順序。", "author": "Yunong Liu et.al.", "authors": "Yunong Liu, Cristobal Eyzaguirre, Manling Li, Shubh Khanna, Juan Carlos Niebles, Vineeth Ravi, Saumitra Mishra, Weiyu Liu, Jiajun Wu", "id": "2411.11409v1", "paper_url": "http://arxiv.org/abs/2411.11409v1", "repo": "null"}}