{"2411.16872": {"publish_time": "2024-11-25", "title": "Enabling Adoption of Regenerative Agriculture through Soil Carbon Copilots", "paper_summary": "Mitigating climate change requires transforming agriculture to minimize\nenviron mental impact and build climate resilience. Regenerative agricultural\npractices enhance soil organic carbon (SOC) levels, thus improving soil health\nand sequestering carbon. A challenge to increasing regenerative agriculture\npractices is cheaply measuring SOC over time and understanding how SOC is\naffected by regenerative agricultural practices and other environmental factors\nand farm management practices. To address this challenge, we introduce an\nAI-driven Soil Organic Carbon Copilot that automates the ingestion of complex\nmulti-resolution, multi-modal data to provide large-scale insights into soil\nhealth and regenerative practices. Our data includes extreme weather event data\n(e.g., drought and wildfire incidents), farm management data (e.g., cropland\ninformation and tillage predictions), and SOC predictions. We find that\nintegrating public data and specialized models enables large-scale, localized\nanalysis for sustainable agriculture. In comparisons of agricultural practices\nacross California counties, we find evidence that diverse agricultural activity\nmay mitigate the negative effects of tillage; and that while extreme weather\nconditions heavily affect SOC, composting may mitigate SOC loss. Finally,\nimplementing role-specific personas empowers agronomists, farm consultants,\npolicymakers, and other stakeholders to implement evidence-based strategies\nthat promote sustainable agriculture and build climate resilience.", "paper_summary_zh": "減緩氣候變遷需要轉型農業，以最大程度地減少環境影響並建立氣候韌性。再生農業實務增強土壤有機碳 (SOC) 含量，進而改善土壤健康並封存碳。擴大再生農業實務的一項挑戰是隨著時間推移廉價地測量 SOC，並了解 SOC 如何受到再生農業實務和其他環境因素以及農場管理實務的影響。為了應對這項挑戰，我們引進了 AI 驅動的土壤有機碳副駕駛，它自動彙整複雜的多解析度、多模態資料，以提供大規模的土壤健康和再生實務見解。我們的資料包括極端天氣事件資料（例如乾旱和野火事件）、農場管理資料（例如農田資訊和整地預測）以及 SOC 預測。我們發現整合公共資料和專門模型能針對永續農業進行大規模、在地化的分析。在加州各郡的農業實務比較中，我們發現證據顯示多樣化的農業活動可以減輕耕作的負面影響；而且極端天氣條件雖然會嚴重影響 SOC，但堆肥可以減輕 SOC 流失。最後，實施特定角色的化身賦能農藝師、農場顧問、政策制定者和其他利害關係人，以實施基於證據的策略，以促進永續農業並建立氣候韌性。", "author": "Margaret Capetz et.al.", "authors": "Margaret Capetz, Swati Sharma, Rafael Padilha, Peder Olsen, Emre Kiciman, Ranveer Chandra", "id": "2411.16872v1", "paper_url": "http://arxiv.org/abs/2411.16872v1", "repo": "null"}}