{"2405.11978": {"publish_time": "2024-05-20", "title": "SM-DTW: Stability Modulated Dynamic Time Warping for signature verification", "paper_summary": "Building upon findings in computational model of handwriting learning and\nexecution, we introduce the concept of stability to explain the difference\nbetween the actual movements performed during multiple execution of the\nsubject's signature, and conjecture that the most stable parts of the signature\nshould play a paramount role in evaluating the similarity between a questioned\nsignature and the reference ones during signature verification. We then\nintroduce the Stability Modulated Dynamic Time Warping algorithm for\nincorporating the stability regions, i.e. the most similar parts between two\nsignatures, into the distance measure between a pair of signatures computed by\nthe Dynamic Time Warping for signature verification. Experiments were conducted\non two datasets largely adopted for performance evaluation. Experimental\nresults show that the proposed algorithm improves the performance of the\nbaseline system and compares favourably with other top performing signature\nverification systems.", "paper_summary_zh": "建立在手寫學習和執行運算模型的發現上，我們引入穩定性的概念來解釋在主體簽名多次執行期間實際執行的動作之間的差異，並推測簽名中最穩定的部分應在簽名驗證期間評估有疑問的簽名與參考簽名之間的相似性時發揮至關重要的作用。然後，我們引入穩定性調製動態時間規整演算法，以將穩定區域（即兩個簽名之間最相似的部分）納入由動態時間規整演算法計算出的簽名對之間的距離測量中，以進行簽名驗證。在兩個廣泛採用於效能評估的資料集上進行了實驗。實驗結果顯示，所提出的演算法改善了基準系統的效能，並且與其他頂尖的簽名驗證系統相比之下表現良好。", "author": "Antonio Parziale et.al.", "authors": "Antonio Parziale, Moises Diaz, Miguel A. Ferrer, Angelo Marcelli", "id": "2405.11978v1", "paper_url": "http://arxiv.org/abs/2405.11978v1", "repo": "null"}}