{"2405.17888": {"publish_time": "2024-05-28", "title": "Getting More Juice Out of the SFT Data: Reward Learning from Human Demonstration Improves SFT for LLM Alignment", "paper_summary": "Aligning human preference and value is an important requirement for\ncontemporary foundation models. State-of-the-art techniques such as\nReinforcement Learning from Human Feedback (RLHF) often consist of two stages:\n1) supervised fine-tuning (SFT), where the model is fine-tuned by learning from\nhuman demonstration data; 2) Preference learning, where preference data is used\nto learn a reward model, which is in turn used by a reinforcement learning (RL)\nstep to fine-tune the model. Such reward model serves as a proxy to human\npreference, and it is critical to guide the RL step towards improving the model\nquality. In this work, we argue that the SFT stage significantly benefits from\nlearning a reward model as well. Instead of using the human demonstration data\ndirectly via supervised learning, we propose to leverage an Inverse\nReinforcement Learning (IRL) technique to (explicitly or implicitly) build an\nreward model, while learning the policy model. This approach leads to new SFT\nalgorithms that are not only efficient to implement, but also promote the\nability to distinguish between the preferred and non-preferred continuations.\nMoreover, we identify a connection between the proposed IRL based approach, and\ncertain self-play approach proposed recently, and showed that self-play is a\nspecial case of modeling a reward-learning agent. Theoretically, we show that\nthe proposed algorithms converge to the stationary solutions of the IRL\nproblem. Empirically, we align 1B and 7B models using proposed methods and\nevaluate them on a reward benchmark model and the HuggingFace Open LLM\nLeaderboard. The proposed methods show significant performance improvement over\nexisting SFT approaches. Our results indicate that it is beneficial to\nexplicitly or implicitly leverage reward learning throughout the entire\nalignment process.", "paper_summary_zh": "對齊人類偏好和價值是當代基礎模型的一項重要要求。最先進的技術，例如人類回饋強化學習 (RLHF)，通常包含兩個階段：1) 監督微調 (SFT)，其中模型通過從人類示範數據中學習進行微調；2) 偏好學習，其中偏好數據用於學習獎勵模型，而獎勵模型反過來又由強化學習 (RL) 步驟用於微調模型。這種獎勵模型作為人類偏好的代理，對於指導 RL 步驟改善模型品質至關重要。在這項工作中，我們認為 SFT 階段也顯著受益於學習獎勵模型。我們沒有直接通過監督學習使用人類示範數據，而是提出利用逆向強化學習 (IRL) 技術（顯式或隱式地）建立獎勵模型，同時學習策略模型。這種方法導致新的 SFT 演算法，這些演算法不僅易於實作，還能促進區分首選和非首選延續的能力。此外，我們發現所提出的基於 IRL 的方法與最近提出的某些自玩方法之間存在聯繫，並表明自玩是建模獎勵學習代理的特殊情況。在理論上，我們表明所提出的演算法收斂到 IRL 問題的平穩解。在經驗上，我們使用所提出的方法對齊 1B 和 7B 模型，並在獎勵基準模型和 HuggingFace Open LLM 排行榜上對它們進行評估。所提出的方法顯示出比現有的 SFT 方法有顯著的效能提升。我們的結果表明，在整個對齊過程中顯式或隱式地利用獎勵學習是有益的。", "author": "Jiaxiang Li et.al.", "authors": "Jiaxiang Li, Siliang Zeng, Hoi-To Wai, Chenliang Li, Alfredo Garcia, Mingyi Hong", "id": "2405.17888v2", "paper_url": "http://arxiv.org/abs/2405.17888v2", "repo": "null"}}