{"2405.04163": {"publish_time": "2024-05-07", "title": "MEDVOC: Vocabulary Adaptation for Fine-tuning Pre-trained Language Models on Medical Text Summarization", "paper_summary": "This work presents a dynamic vocabulary adaptation strategy, MEDVOC, for\nfine-tuning pre-trained language models (PLMs) like BertSumAbs, BART, and\nPEGASUS for improved medical text summarization. In contrast to existing domain\nadaptation approaches in summarization, MEDVOC treats vocabulary as an\noptimizable parameter and optimizes the PLM vocabulary based on fragment score\nconditioned only on the downstream task's reference summaries. Unlike previous\nworks on vocabulary adaptation (limited only to classification tasks),\noptimizing vocabulary based on summarization tasks requires an extremely costly\nintermediate fine-tuning step on large summarization datasets. To that end, our\nnovel fragment score-based hyperparameter search very significantly reduces\nthis fine-tuning time -- from 450 days to less than 2 days on average.\nFurthermore, while previous works on vocabulary adaptation are often primarily\ntied to single PLMs, MEDVOC is designed to be deployable across multiple PLMs\n(with varying model vocabulary sizes, pre-training objectives, and model sizes)\n-- bridging the limited vocabulary overlap between the biomedical literature\ndomain and PLMs. MEDVOC outperforms baselines by 15.74% in terms of Rouge-L in\nzero-shot setting and shows gains of 17.29% in high Out-Of-Vocabulary (OOV)\nconcentrations. Our human evaluation shows MEDVOC generates more faithful\nmedical summaries (88% compared to 59% in baselines). We make the codebase\npublicly available at https://github.com/gb-kgp/MEDVOC.", "paper_summary_zh": "此研究提出了一種動態詞彙適應策略 MEDVOC，用於微調預先訓練的語言模型 (PLM)，例如 BertSumAbs、BART 和 Pegasus，以改善醫療文本摘要。與摘要中現有的領域適應方法不同，MEDVOC 將詞彙視為可最佳化的參數，並根據僅以下游任務的參考摘要為條件的片段分數最佳化 PLM 詞彙。與之前關於詞彙適應的研究（僅限於分類任務）不同，根據摘要任務最佳化詞彙需要對大型摘要資料集進行極其昂貴的中間微調步驟。為此，我們新穎的基於片段分數的超參數搜尋大幅減少了此微調時間——從平均 450 天減少到不到 2 天。此外，雖然之前關於詞彙適應的研究通常主要與單一 PLM 相關，但 MEDVOC 被設計為可部署於多個 PLM（具有不同的模型詞彙大小、預訓練目標和模型大小）——彌合了生物醫學文獻領域與 PLM 之間有限的詞彙重疊。MEDVOC 在零次學習設定中，以 Rouge-L 的方式優於基準 15.74%，並在高 Out-Of-Vocabulary (OOV) 濃度中顯示出 17.29% 的增益。我們的人類評估顯示，MEDVOC 生成了更忠實的醫療摘要（88%，而基準為 59%）。我們將程式碼庫公開於 https://github.com/gb-kgp/MEDVOC。", "author": "Gunjan Balde et.al.", "authors": "Gunjan Balde, Soumyadeep Roy, Mainack Mondal, Niloy Ganguly", "id": "2405.04163v1", "paper_url": "http://arxiv.org/abs/2405.04163v1", "repo": "https://github.com/gb-kgp/medvoc"}}