{"2411.03746": {"publish_time": "2024-11-06", "title": "Optimal Defenses Against Gradient Reconstruction Attacks", "paper_summary": "Federated Learning (FL) is designed to prevent data leakage through\ncollaborative model training without centralized data storage. However, it\nremains vulnerable to gradient reconstruction attacks that recover original\ntraining data from shared gradients. To optimize the trade-off between data\nleakage and utility loss, we first derive a theoretical lower bound of\nreconstruction error (among all attackers) for the two standard methods: adding\nnoise, and gradient pruning. We then customize these two defenses to be\nparameter- and model-specific and achieve the optimal trade-off between our\nobtained reconstruction lower bound and model utility. Experimental results\nvalidate that our methods outperform Gradient Noise and Gradient Pruning by\nprotecting the training data better while also achieving better utility.", "paper_summary_zh": "聯邦學習 (FL) 旨在透過協作模型訓練來防止資料外洩，而無需集中式資料儲存。但是，它仍然容易受到梯度重建攻擊，該攻擊會從共享梯度中恢復原始訓練資料。為了最佳化資料外洩和效用損失之間的折衷，我們首先針對這兩種標準方法推導出重建誤差的理論下限（在所有攻擊者中）：加入雜訊和梯度修剪。然後，我們自訂這兩種防禦措施，使其特定於參數和模型，並在我們獲得的重建下限和模型效用之間取得最佳折衷。實驗結果驗證我們的模型透過更佳地保護訓練資料，同時也能達到更好的效用，從而優於梯度雜訊和梯度修剪。", "author": "Yuxiao Chen et.al.", "authors": "Yuxiao Chen, Gamze Gürsoy, Qi Lei", "id": "2411.03746v1", "paper_url": "http://arxiv.org/abs/2411.03746v1", "repo": "https://github.com/cyx78/optimal_defenses_against_gradient_reconstruction_attacks"}}