{"2409.11148": {"publish_time": "2024-09-17", "title": "Improving the Efficiency of Visually Augmented Language Models", "paper_summary": "Despite the impressive performance of autoregressive Language Models (LM) it\nhas been shown that due to reporting bias, LMs lack visual knowledge, i.e. they\ndo not know much about the visual world and its properties. To augment LMs with\nvisual knowledge, existing solutions often rely on explicit images, requiring\ntime-consuming retrieval or image generation systems. This paper shows that\nexplicit images are not necessary to visually augment an LM. Instead, we use\nvisually-grounded text representations obtained from the well-known CLIP\nmultimodal system. For a fair comparison, we modify VALM, a visually-augmented\nLM which uses image retrieval and representation, to work directly with\nvisually-grounded text representations. We name this new model BLIND-VALM. We\nshow that BLIND-VALM performs on par with VALM for Visual Language\nUnderstanding (VLU), Natural Language Understanding (NLU) and Language Modeling\ntasks, despite being significantly more efficient and simpler. We also show\nthat scaling up our model within the compute budget of VALM, either increasing\nthe model or pre-training corpus size, we outperform VALM for all the\nevaluation tasks.", "paper_summary_zh": "儘管自迴歸語言模型 (LM) 具有令人印象深刻的效能，但已顯示出由於回報偏差，LM 缺乏視覺知識，亦即它們對視覺世界及其屬性所知甚少。為了擴充 LM 的視覺知識，現有的解決方案通常依賴明確的影像，需要耗時的擷取或影像產生系統。本文顯示明確的影像並非視覺擴充 LM 所必需。相反地，我們使用從著名的 CLIP 多模態系統取得的視覺基礎文字表徵。為了公平比較，我們修改了視覺擴充 LM VALM，它使用影像擷取和表徵，以直接使用視覺基礎文字表徵。我們將這個新模型命名為 BLIND-VALM。我們顯示 BLIND-VALM 在視覺語言理解 (VLU)、自然語言理解 (NLU) 和語言模型任務中，表現與 VALM 相當，儘管它的效率顯著更高且更簡單。我們也顯示在 VALM 的運算預算內擴充我們的模型，無論是增加模型或預訓練語料庫大小，我們在所有評估任務中都優於 VALM。", "author": "Paula Ontalvilla et.al.", "authors": "Paula Ontalvilla, Aitor Ormazabal, Gorka Azkune", "id": "2409.11148v1", "paper_url": "http://arxiv.org/abs/2409.11148v1", "repo": "null"}}