{"2406.14508": {"publish_time": "2024-06-20", "title": "Evidence of a log scaling law for political persuasion with large language models", "paper_summary": "Large language models can now generate political messages as persuasive as\nthose written by humans, raising concerns about how far this persuasiveness may\ncontinue to increase with model size. Here, we generate 720 persuasive messages\non 10 U.S. political issues from 24 language models spanning several orders of\nmagnitude in size. We then deploy these messages in a large-scale randomized\nsurvey experiment (N = 25,982) to estimate the persuasive capability of each\nmodel. Our findings are twofold. First, we find evidence of a log scaling law:\nmodel persuasiveness is characterized by sharply diminishing returns, such that\ncurrent frontier models are barely more persuasive than models smaller in size\nby an order of magnitude or more. Second, mere task completion (coherence,\nstaying on topic) appears to account for larger models' persuasive advantage.\nThese findings suggest that further scaling model size will not much increase\nthe persuasiveness of static LLM-generated messages.", "paper_summary_zh": "大型語言模型現在可以產生像人類寫的那樣具有說服力的政治訊息，這引發了人們對這種說服力隨著模型規模的增長可能會增加到何種程度的擔憂。在這裡，我們從 24 個語言模型中生成了 720 條關於 10 個美國政治問題的具有說服力的訊息，這些模型的大小跨越了幾個數量級。然後，我們在一個大規模的隨機調查實驗 (N = 25,982) 中部署這些訊息，以估計每個模型的說服能力。我們的發現有兩個方面。首先，我們發現了對數縮放定律的證據：模型說服力具有急劇遞減的回報，以至於當前的邊界模型比小一個數量級或更多的模型幾乎沒有說服力。其次，僅僅完成任務（連貫性，堅持主題）似乎可以解釋大型模型的說服力優勢。這些發現表明，進一步擴展模型規模不會顯著提高靜態 LLM 生成的訊息的說服力。", "author": "Kobi Hackenburg et.al.", "authors": "Kobi Hackenburg, Ben M. Tappin, Paul Röttger, Scott Hale, Jonathan Bright, Helen Margetts", "id": "2406.14508v1", "paper_url": "http://arxiv.org/abs/2406.14508v1", "repo": "https://github.com/kobihackenburg/scaling-llm-persuasion"}}