{"2412.06483": {"publish_time": "2024-12-09", "title": "SafeWorld: Geo-Diverse Safety Alignment", "paper_summary": "In the rapidly evolving field of Large Language Models (LLMs), ensuring\nsafety is a crucial and widely discussed topic. However, existing works often\noverlook the geo-diversity of cultural and legal standards across the world. To\ndemonstrate the challenges posed by geo-diverse safety standards, we introduce\nSafeWorld, a novel benchmark specifically designed to evaluate LLMs' ability to\ngenerate responses that are not only helpful but also culturally sensitive and\nlegally compliant across diverse global contexts. SafeWorld encompasses 2,342\ntest user queries, each grounded in high-quality, human-verified cultural norms\nand legal policies from 50 countries and 493 regions/races. On top of it, we\npropose a multi-dimensional automatic safety evaluation framework that assesses\nthe contextual appropriateness, accuracy, and comprehensiveness of responses.\nOur evaluations reveal that current LLMs struggle to meet these criteria. To\nenhance LLMs' alignment with geo-diverse safety standards, we synthesize\nhelpful preference pairs for Direct Preference Optimization (DPO) alignment\ntraining. The preference pair construction aims to encourage LLMs to behave\nappropriately and provide precise references to relevant cultural norms and\npolicies when necessary. Our trained SafeWorldLM outperforms all competing\nmodels, including GPT-4o on all three evaluation dimensions by a large margin.\nGlobal human evaluators also note a nearly 20% higher winning rate in\nhelpfulness and harmfulness evaluation. Our code and data can be found here:\nhttps://github.com/PlusLabNLP/SafeWorld.", "paper_summary_zh": "在快速演進的大語言模型 (LLM) 領域中，確保安全是一個至關重要且廣泛討論的主題。然而，現有研究經常忽略全球文化和法律標準的地理多樣性。為了展示地理多樣性安全標準帶來的挑戰，我們引入了 SafeWorld，一個專門設計來評估 LLM 產生回應的能力的新基準，這些回應不僅有幫助，而且在不同的全球背景下具有文化敏感性和法律合規性。SafeWorld 涵蓋了 2,342 個測試使用者查詢，每個查詢都基於來自 50 個國家和 493 個地區/種族的優質、人工驗證的文化規範和法律政策。最重要的是，我們提出了一個多維度的自動安全評估框架，用於評估回應的上下文適當性、準確性和全面性。我們的評估表明，目前的 LLM 難以滿足這些標準。為了增強 LLM 與地理多樣性安全標準的一致性，我們綜合了有用的偏好對，用於直接偏好最佳化 (DPO) 對齊訓練。偏好對的建構旨在鼓勵 LLM 適當地表現，並在必要時提供與相關文化規範和政策的精確參考。我們訓練的 SafeWorldLM 在所有三個評估維度上都大幅優於所有競爭模型，包括 GPT-4o。全球人類評估員還注意到在有幫助性和有害性評估中獲勝率提高了近 20%。我們的程式碼和資料可以在這裡找到：https://github.com/PlusLabNLP/SafeWorld。", "author": "Da Yin et.al.", "authors": "Da Yin, Haoyi Qiu, Kung-Hsiang Huang, Kai-Wei Chang, Nanyun Peng", "id": "2412.06483v1", "paper_url": "http://arxiv.org/abs/2412.06483v1", "repo": "null"}}