{"2411.14073": {"publish_time": "2024-11-21", "title": "Meaning at the Planck scale? Contextualized word embeddings for doing history, philosophy, and sociology of science", "paper_summary": "This paper explores the potential of contextualized word embeddings (CWEs) as\na new tool in the history, philosophy, and sociology of science (HPSS) for\nstudying contextual and evolving meanings of scientific concepts. Using the\nterm \"Planck\" as a test case, I evaluate five BERT-based models with varying\ndegrees of domain-specific pretraining, including my custom model\nAstro-HEP-BERT, trained on the Astro-HEP Corpus, a dataset containing 21.84\nmillion paragraphs from 600,000 articles in astrophysics and high-energy\nphysics. For this analysis, I compiled two labeled datasets: (1) the\nAstro-HEP-Planck Corpus, consisting of 2,900 labeled occurrences of \"Planck\"\nsampled from 1,500 paragraphs in the Astro-HEP Corpus, and (2) a\nphysics-related Wikipedia dataset comprising 1,186 labeled occurrences of\n\"Planck\" across 885 paragraphs. Results demonstrate that the domain-adapted\nmodels outperform the general-purpose ones in disambiguating the target term,\npredicting its known meanings, and generating high-quality sense clusters, as\nmeasured by a novel purity indicator I developed. Additionally, this approach\nreveals semantic shifts in the target term over three decades in the unlabeled\nAstro-HEP Corpus, highlighting the emergence of the Planck space mission as a\ndominant sense. The study underscores the importance of domain-specific\npretraining for analyzing scientific language and demonstrates the\ncost-effectiveness of adapting pretrained models for HPSS research. By offering\na scalable and transferable method for modeling the meanings of scientific\nconcepts, CWEs open up new avenues for investigating the socio-historical\ndynamics of scientific discourses.", "paper_summary_zh": "<paragraph>本文探討了語境化字詞嵌入 (CWE) 作為科學史、哲學和社會學 (HPSS) 中一項新工具的潛力，用於研究科學概念的語境和演化意義。使用「普朗克」一詞作為測試案例，我評估了五個基於 BERT 的模型，它們具有不同程度的特定領域預訓練，包括我在 Astro-HEP 語料庫上訓練的客製化模型 Astro-HEP-BERT，該資料集包含來自天體物理學和高能物理學中 600,000 篇文章的 21.84 百萬段落。對於此分析，我編譯了兩個標記資料集：(1) Astro-HEP-Planck 語料庫，包含從 Astro-HEP 語料庫中 1,500 段落中抽取的 2,900 個標記「普朗克」出現次數，以及 (2) 一個物理相關的維基百科資料集，包含跨越 885 段落的 1,186 個標記「普朗克」出現次數。結果證明，領域適應模型在消除目標術語歧義、預測其已知意義和產生高品質意義叢集方面優於通用模型，這是透過我開發的一項新穎純度指標測量的。此外，這種方法揭示了目標術語在未標記的 Astro-HEP 語料庫中超過三十年的語義轉變，突顯了普朗克太空任務作為主要意義的出現。這項研究強調了特定領域預訓練對於分析科學語言的重要性，並證明了適應預訓練模型對於 HPSS 研究的成本效益。透過提供一種可擴充且可轉移的方法來建模科學概念的意義，CWE 開啟了研究科學論述的社會歷史動態的新途徑。</paragraph>", "author": "Arno Simons et.al.", "authors": "Arno Simons", "id": "2411.14073v1", "paper_url": "http://arxiv.org/abs/2411.14073v1", "repo": "null"}}