{"2410.10756": {"publish_time": "2024-10-14", "title": "Use Random Selection for Now: Investigation of Few-Shot Selection Strategies in LLM-based Text Augmentation for Classification", "paper_summary": "The generative large language models (LLMs) are increasingly used for data\naugmentation tasks, where text samples are paraphrased (or generated anew) and\nthen used for classifier fine-tuning. Existing works on augmentation leverage\nthe few-shot scenarios, where samples are given to LLMs as part of prompts,\nleading to better augmentations. Yet, the samples are mostly selected randomly\nand a comprehensive overview of the effects of other (more ``informed'') sample\nselection strategies is lacking. In this work, we compare sample selection\nstrategies existing in few-shot learning literature and investigate their\neffects in LLM-based textual augmentation. We evaluate this on in-distribution\nand out-of-distribution classifier performance. Results indicate, that while\nsome ``informed'' selection strategies increase the performance of models,\nespecially for out-of-distribution data, it happens only seldom and with\nmarginal performance increases. Unless further advances are made, a default of\nrandom sample selection remains a good option for augmentation practitioners.", "paper_summary_zh": "生成式大型语言模型 (LLM) 越来越多地用于数据增强任务，其中文本样本被改写（或重新生成），然后用于分类器微调。现有的增强工作利用了小样本场景，其中样本作为提示的一部分提供给 LLM，从而产生更好的增强。然而，这些样本大多是随机选择的，并且缺乏对其他（更“知情”）样本选择策略的影响的全面概述。在这项工作中，我们比较了小样本学习文献中存在的样本选择策略，并研究了它们在基于 LLM 的文本增强中的影响。我们在分布内和分布外分类器性能上对此进行了评估。结果表明，虽然一些“知情”选择策略提高了模型的性能，特别是对于分布外数据，但这只在少数情况下发生，并且性能提升幅度很小。除非取得进一步进展，否则随机样本选择作为增强实践者的默认选择仍然是一个不错的选择。", "author": "Jan Cegin et.al.", "authors": "Jan Cegin, Branislav Pecher, Jakub Simko, Ivan Srba, Maria Bielikova, Peter Brusilovsky", "id": "2410.10756v1", "paper_url": "http://arxiv.org/abs/2410.10756v1", "repo": "null"}}