{"2502.03852": {"publish_time": "2025-02-06", "title": "Pursuing Better Decision Boundaries for Long-Tailed Object Detection via Category Information Amount", "paper_summary": "In object detection, the instance count is typically used to define whether a\ndataset exhibits a long-tail distribution, implicitly assuming that models will\nunderperform on categories with fewer instances. This assumption has led to\nextensive research on category bias in datasets with imbalanced instance\ncounts. However, models still exhibit category bias even in datasets where\ninstance counts are relatively balanced, clearly indicating that instance count\nalone cannot explain this phenomenon. In this work, we first introduce the\nconcept and measurement of category information amount. We observe a\nsignificant negative correlation between category information amount and\naccuracy, suggesting that category information amount more accurately reflects\nthe learning difficulty of a category. Based on this observation, we propose\nInformation Amount-Guided Angular Margin (IGAM) Loss. The core idea of IGAM is\nto dynamically adjust the decision space of each category based on its\ninformation amount, thereby reducing category bias in long-tail datasets. IGAM\nLoss not only performs well on long-tailed benchmark datasets such as LVIS v1.0\nand COCO-LT but also shows significant improvement for underrepresented\ncategories in the non-long-tailed dataset Pascal VOC. Comprehensive experiments\ndemonstrate the potential of category information amount as a tool and the\ngenerality of our proposed method.", "paper_summary_zh": "在目標偵測中，實例計數通常用於定義資料集是否展現長尾分佈，並隱含假設模型在實例較少的類別上表現不佳。這個假設導致大量針對不平衡實例計數資料集中類別偏誤的研究。然而，即使在實例計數相對平衡的資料集中，模型仍會展現類別偏誤，這清楚地表明實例計數本身無法解釋此現象。在此研究中，我們首先介紹類別資訊量的概念和度量。我們觀察到類別資訊量與準確度之間存在顯著的負相關，這表明類別資訊量更準確地反映了類別的學習難度。基於此觀察，我們提出資訊量引導角裕度（IGAM）損失。IGAM 的核心思想是根據每個類別的資訊量動態調整其決策空間，從而減少長尾資料集中的類別偏誤。IGAM 損失不僅在長尾基準資料集（例如 LVIS v1.0 和 COCO-LT）上表現良好，而且在非長尾資料集 Pascal VOC 中的代表性不足類別上也展現出顯著的改善。全面的實驗證明了類別資訊量作為工具的潛力，以及我們提出的方法的普遍性。", "author": "Yanbiao Ma et.al.", "authors": "Yanbiao Ma, Wei Dai, Jiayi Chen", "id": "2502.03852v1", "paper_url": "http://arxiv.org/abs/2502.03852v1", "repo": "null"}}