{"2410.11250": {"publish_time": "2024-10-15", "title": "Learning Agents With Prioritization and Parameter Noise in Continuous State and Action Space", "paper_summary": "Among the many variants of RL, an important class of problems is where the\nstate and action spaces are continuous -- autonomous robots, autonomous\nvehicles, optimal control are all examples of such problems that can lend\nthemselves naturally to reinforcement based algorithms, and have continuous\nstate and action spaces. In this paper, we introduce a prioritized form of a\ncombination of state-of-the-art approaches such as Deep Q-learning (DQN) and\nDeep Deterministic Policy Gradient (DDPG) to outperform the earlier results for\ncontinuous state and action space problems. Our experiments also involve the\nuse of parameter noise during training resulting in more robust deep RL models\noutperforming the earlier results significantly. We believe these results are a\nvaluable addition for continuous state and action space problems.", "paper_summary_zh": "在眾多的 RL 變種中，一個重要的問題類別是狀態和動作空間是連續的——自駕機器人、自駕車輛、最佳控制都是此類問題的範例，這些問題可以自然而然地借用強化學習演算法，並具有連續的狀態和動作空間。在本文中，我們引入了最先進方法的優先形式，例如 Deep Q 學習 (DQN) 和深度確定性策略梯度 (DDPG)，以優於連續狀態和動作空間問題的先前結果。我們的實驗還包括在訓練期間使用參數雜訊，從而產生更強大的深度 RL 模型，顯著優於先前的結果。我們相信這些結果對連續狀態和動作空間問題是有價值的補充。", "author": "Rajesh Mangannavar et.al.", "authors": "Rajesh Mangannavar, Gopalakrishnan Srinivasaraghavan", "id": "2410.11250v1", "paper_url": "http://arxiv.org/abs/2410.11250v1", "repo": "null"}}