{"2409.07341": {"publish_time": "2024-09-11", "title": "Online Decision MetaMorphFormer: A Casual Transformer-Based Reinforcement Learning Framework of Universal Embodied Intelligence", "paper_summary": "Interactive artificial intelligence in the motion control field is an\ninteresting topic, especially when universal knowledge is adaptive to multiple\ntasks and universal environments. Despite there being increasing efforts in the\nfield of Reinforcement Learning (RL) with the aid of transformers, most of them\nmight be limited by the offline training pipeline, which prohibits exploration\nand generalization abilities. To address this limitation, we propose the\nframework of Online Decision MetaMorphFormer (ODM) which aims to achieve\nself-awareness, environment recognition, and action planning through a unified\nmodel architecture. Motivated by cognitive and behavioral psychology, an ODM\nagent is able to learn from others, recognize the world, and practice itself\nbased on its own experience. ODM can also be applied to any arbitrary agent\nwith a multi-joint body, located in different environments, and trained with\ndifferent types of tasks using large-scale pre-trained datasets. Through the\nuse of pre-trained datasets, ODM can quickly warm up and learn the necessary\nknowledge to perform the desired task, while the target environment continues\nto reinforce the universal policy. Extensive online experiments as well as\nfew-shot and zero-shot environmental tests are used to verify ODM's performance\nand generalization ability. The results of our study contribute to the study of\ngeneral artificial intelligence in embodied and cognitive fields. Code,\nresults, and video examples can be found on the website\n\\url{https://rlodm.github.io/odm/}.", "paper_summary_zh": "運動控制領域的互動式人工智慧是一個有趣的議題，特別是在通用知識適用於多項任務和通用環境時。儘管在強化學習（RL）領域中，在Transformer的幫助下付出了越來越多的努力，但其中大部分可能受到離線訓練管線的限制，這會禁止探索和概括能力。為了解決這個限制，我們提出了線上決策 MetaMorphFormer（ODM）架構，其目標是透過統一的模型架構來實現自我意識、環境識別和動作規劃。在認知和行為心理學的激勵下，ODM 代理能夠從他人學習、認識世界並根據自己的經驗練習。ODM 也可以應用於任何具有多關節身體、位於不同環境中的任意代理，並使用大型預先訓練的資料集訓練不同類型的任務。透過使用預先訓練的資料集，ODM 可以快速熱身並學習執行所需任務的必要知識，而目標環境會持續強化通用政策。廣泛的線上實驗以及少次嘗試和零次嘗試的環境測試用於驗證 ODM 的效能和概括能力。我們研究的結果有助於具身和認知領域中通用人工智慧的研究。程式碼、結果和影片範例可以在網站上找到：\\url{https://rlodm.github.io/odm/}。", "author": "Luo Ji et.al.", "authors": "Luo Ji, Runji Lin", "id": "2409.07341v1", "paper_url": "http://arxiv.org/abs/2409.07341v1", "repo": "null"}}