{"2411.12865": {"publish_time": "2024-11-19", "title": "AzSLD: Azerbaijani Sign Language Dataset for Fingerspelling, Word, and Sentence Translation with Baseline Software", "paper_summary": "Sign language processing technology development relies on extensive and\nreliable datasets, instructions, and ethical guidelines. We present a\ncomprehensive Azerbaijani Sign Language Dataset (AzSLD) collected from diverse\nsign language users and linguistic parameters to facilitate advancements in\nsign recognition and translation systems and support the local sign language\ncommunity. The dataset was created within the framework of a vision-based AzSL\ntranslation project. This study introduces the dataset as a summary of the\nfingerspelling alphabet and sentence- and word-level sign language datasets.\nThe dataset was collected from signers of different ages, genders, and signing\nstyles, with videos recorded from two camera angles to capture each sign in\nfull detail. This approach ensures robust training and evaluation of gesture\nrecognition models. AzSLD contains 30,000 videos, each carefully annotated with\naccurate sign labels and corresponding linguistic translations. The dataset is\naccompanied by technical documentation and source code to facilitate its use in\ntraining and testing. This dataset offers a valuable resource of labeled data\nfor researchers and developers working on sign language recognition,\ntranslation, or synthesis. Ethical guidelines were strictly followed throughout\nthe project, with all participants providing informed consent for collecting,\npublishing, and using the data.", "paper_summary_zh": "手語處理技術開發依賴於廣泛且可靠的資料集、指令和道德準則。我們提出了一個全面的阿塞拜疆手語資料集 (AzSLD)，該資料集收集自不同的手語使用者和語言參數，以促進手勢識別和翻譯系統的進步，並支援當地的手語社群。該資料集是在基於視覺的 AzSL 翻譯專案架構中建立的。本研究將該資料集作為指法字母表和句子和單字級手語資料集的摘要進行介紹。該資料集收集自不同年齡、性別和手語風格的手語者，並從兩個攝影機角度錄製影片，以完整地捕捉每個手勢。這種方法確保了手勢識別模型的強健訓練和評估。AzSLD 包含 30,000 部影片，每部影片都仔細註解了準確的手勢標籤和對應的語言翻譯。該資料集附有技術文件和原始碼，以利於在訓練和測試中使用。該資料集為從事手語識別、翻譯或合成工作的研究人員和開發人員提供了有價值的標記資料資源。在整個專案中嚴格遵守道德準則，所有參與者都提供了收集、發布和使用資料的知情同意。", "author": "Nigar Alishzade et.al.", "authors": "Nigar Alishzade, Jamaladdin Hasanov", "id": "2411.12865v1", "paper_url": "http://arxiv.org/abs/2411.12865v1", "repo": "null"}}