{"2410.24049": {"publish_time": "2024-10-31", "title": "Desert Camels and Oil Sheikhs: Arab-Centric Red Teaming of Frontier LLMs", "paper_summary": "Large language models (LLMs) are widely used but raise ethical concerns due\nto embedded social biases. This study examines LLM biases against Arabs versus\nWesterners across eight domains, including women's rights, terrorism, and\nanti-Semitism and assesses model resistance to perpetuating these biases. To\nthis end, we create two datasets: one to evaluate LLM bias toward Arabs versus\nWesterners and another to test model safety against prompts that exaggerate\nnegative traits (\"jailbreaks\"). We evaluate six LLMs -- GPT-4, GPT-4o, LlaMA\n3.1 (8B & 405B), Mistral 7B, and Claude 3.5 Sonnet. We find 79% of cases\ndisplaying negative biases toward Arabs, with LlaMA 3.1-405B being the most\nbiased. Our jailbreak tests reveal GPT-4o as the most vulnerable, despite being\nan optimized version, followed by LlaMA 3.1-8B and Mistral 7B. All LLMs except\nClaude exhibit attack success rates above 87% in three categories. We also find\nClaude 3.5 Sonnet the safest, but it still displays biases in seven of eight\ncategories. Despite being an optimized version of GPT4, We find GPT-4o to be\nmore prone to biases and jailbreaks, suggesting optimization flaws. Our\nfindings underscore the pressing need for more robust bias mitigation\nstrategies and strengthened security measures in LLMs.", "paper_summary_zh": "大型語言模型（LLM）廣泛使用，但由於嵌入的社會偏見而引起道德問題。本研究檢視 LLM 對阿拉伯人與西方人之間的偏見，涵蓋八個領域，包括婦女權利、恐怖主義和反猶太主義，並評估模型對延續這些偏見的抵抗力。為此，我們建立兩個數據集：一個用於評估 LLM 對阿拉伯人與西方人的偏見，另一個用於測試模型對誇大負面特質（「越獄」）提示的安全性。我們評估了六個 LLM——GPT-4、GPT-4o、LlaMA 3.1（8B 和 405B）、Mistral 7B 和 Claude 3.5 Sonnet。我們發現 79% 的案例對阿拉伯人表現出負面偏見，其中 LlaMA 3.1-405B 最為偏頗。我們的越獄測試顯示，儘管 GPT-4o 是經過最佳化的版本，但它是最脆弱的，其次是 LlaMA 3.1-8B 和 Mistral 7B。除了 Claude 之外，所有 LLM 在三類中的攻擊成功率都高於 87%。我們還發現 Claude 3.5 Sonnet 最安全，但它在八類中的七類中仍表現出偏見。儘管 GPT-4o 是 GPT4 的最佳化版本，但我們發現它更容易出現偏見和越獄，這表明存在最佳化缺陷。我們的研究結果強調了對 LLM 中更強大的偏見緩解策略和更嚴格的安全措施的迫切需求。", "author": "Muhammed Saeed et.al.", "authors": "Muhammed Saeed, Elgizouli Mohamed, Mukhtar Mohamed, Shaina Raza, Shady Shehata, Muhammad Abdul-Mageed", "id": "2410.24049v1", "paper_url": "http://arxiv.org/abs/2410.24049v1", "repo": "null"}}