{"2502.14671": {"publish_time": "2025-02-20", "title": "Explanations of Deep Language Models Explain Language Representations in the Brain", "paper_summary": "Recent advances in artificial intelligence have given rise to large language\nmodels (LLMs) that not only achieve human-like performance but also share\ncomputational principles with the brain's language processing mechanisms. While\nprevious research has primarily focused on aligning LLMs' internal\nrepresentations with neural activity, we introduce a novel approach that\nleverages explainable AI (XAI) methods to forge deeper connections between the\ntwo domains. Using attribution methods, we quantified how preceding words\ncontribute to an LLM's next-word predictions and employed these explanations to\npredict fMRI recordings from participants listening to the same narratives. Our\nfindings demonstrate that attribution methods robustly predict brain activity\nacross the language network, surpassing traditional internal representations in\nearly language areas. This alignment is hierarchical: early-layer explanations\ncorrespond to the initial stages of language processing in the brain, while\nlater layers align with more advanced stages. Moreover, the layers more\ninfluential on LLM next-word prediction$\\unicode{x2014}$those with higher\nattribution scores$\\unicode{x2014}$exhibited stronger alignment with neural\nactivity. This work establishes a bidirectional bridge between AI and\nneuroscience. First, we demonstrate that attribution methods offer a powerful\nlens for investigating the neural mechanisms of language comprehension,\nrevealing how meaning emerges from preceding context. Second, we propose using\nbrain alignment as a metric to evaluate the validity of attribution methods,\nproviding a framework for assessing their biological plausibility.", "paper_summary_zh": "最近的人工智能的進展產生了大型語言模型 (LLM)，它不僅達到類似人類的表現，還與大腦的語言處理機制共享計算原理。雖然先前的研究主要集中於將 LLM 的內部表徵與神經活動對齊，但我們引入了一種新穎的方法，該方法利用可解釋 AI (XAI) 方法在兩個域之間建立更深層的聯繫。使用歸因方法，我們量化了前一個單詞如何促成 LLM 的下一個單詞預測，並利用這些解釋來預測參與者在聆聽相同敘述時的大腦功能性磁共振造影 (fMRI) 記錄。我們的發現表明，歸因方法可以穩健地預測整個語言網路中的大腦活動，超越了早期語言區域中的傳統內部表徵。這種對齊是分層的：早期層次解釋對應於大腦中語言處理的初始階段，而後續層次則與更進階的階段對齊。此外，對 LLM 下一個單詞預測影響力較大的層次（即歸因分數較高的層次）表現出與神經活動更強的對齊。這項工作在 AI 與神經科學之間建立了一個雙向橋樑。首先，我們證明歸因方法提供了一個強大的視角，用於研究語言理解的神經機制，揭示意義如何從先前的脈絡中產生。其次，我們建議使用大腦對齊作為評估歸因方法有效性的指標，提供了一個評估其生物學合理性的框架。", "author": "Maryam Rahimi et.al.", "authors": "Maryam Rahimi, Yadollah Yaghoobzadeh, Mohammad Reza Daliri", "id": "2502.14671v1", "paper_url": "http://arxiv.org/abs/2502.14671v1", "repo": "null"}}