{"2410.19314": {"publish_time": "2024-10-25", "title": "Revealing and Reducing Gender Biases in Vision and Language Assistants (VLAs)", "paper_summary": "Pre-trained large language models (LLMs) have been reliably integrated with\nvisual input for multimodal tasks. The widespread adoption of instruction-tuned\nimage-to-text vision-language assistants (VLAs) like LLaVA and InternVL\nnecessitates evaluating gender biases. We study gender bias in 22 popular\nopen-source VLAs with respect to personality traits, skills, and occupations.\nOur results show that VLAs replicate human biases likely present in the data,\nsuch as real-world occupational imbalances. Similarly, they tend to attribute\nmore skills and positive personality traits to women than to men, and we see a\nconsistent tendency to associate negative personality traits with men. To\neliminate the gender bias in these models, we find that finetuning-based\ndebiasing methods achieve the best tradeoff between debiasing and retaining\nperformance on downstream tasks. We argue for pre-deploying gender bias\nassessment in VLAs and motivate further development of debiasing strategies to\nensure equitable societal outcomes.", "paper_summary_zh": "預訓練大型語言模型 (LLM) 已可靠地與視覺輸入整合，以執行多模態任務。廣泛採用 LLaVA 和 InternVL 等指令調整型影像轉文字視覺語言助理 (VLA)，因此有必要評估性別偏見。我們針對 22 種流行的開源 VLA 研究性別偏見，包括人格特質、技能和職業。我們的結果顯示，VLA 會複製可能存在於資料中的人類偏見，例如現實世界的職業失衡。同樣地，他們傾向於將更多技能和正面人格特質歸因於女性，而我們看到一種將負面人格特質與男性關聯起來的一致傾向。為了消除這些模型中的性別偏見，我們發現基於微調的去偏見方法在去偏見和保留下游任務效能之間取得最佳折衷。我們主張在 VLA 中預先部署性別偏見評估，並促使進一步發展去偏見策略，以確保公平的社會成果。", "author": "Leander Girrbach et.al.", "authors": "Leander Girrbach, Yiran Huang, Stephan Alaniz, Trevor Darrell, Zeynep Akata", "id": "2410.19314v1", "paper_url": "http://arxiv.org/abs/2410.19314v1", "repo": "null"}}