{"2407.08035": {"publish_time": "2024-07-10", "title": "FsPONER: Few-shot Prompt Optimization for Named Entity Recognition in Domain-specific Scenarios", "paper_summary": "Large Language Models (LLMs) have provided a new pathway for Named Entity\nRecognition (NER) tasks. Compared with fine-tuning, LLM-powered prompting\nmethods avoid the need for training, conserve substantial computational\nresources, and rely on minimal annotated data. Previous studies have achieved\ncomparable performance to fully supervised BERT-based fine-tuning approaches on\ngeneral NER benchmarks. However, none of the previous approaches has\ninvestigated the efficiency of LLM-based few-shot learning in domain-specific\nscenarios. To address this gap, we introduce FsPONER, a novel approach for\noptimizing few-shot prompts, and evaluate its performance on domain-specific\nNER datasets, with a focus on industrial manufacturing and maintenance, while\nusing multiple LLMs -- GPT-4-32K, GPT-3.5-Turbo, LLaMA 2-chat, and Vicuna.\nFsPONER consists of three few-shot selection methods based on random sampling,\nTF-IDF vectors, and a combination of both. We compare these methods with a\ngeneral-purpose GPT-NER method as the number of few-shot examples increases and\nevaluate their optimal NER performance against fine-tuned BERT and LLaMA\n2-chat. In the considered real-world scenarios with data scarcity, FsPONER with\nTF-IDF surpasses fine-tuned models by approximately 10% in F1 score.", "paper_summary_zh": "大型語言模型 (LLM) 為命名實體識別 (NER) 任務提供了新的途徑。與微調相比，LLM 驅動提示方法避免了訓練的需要，節省了大量的計算資源，並依賴於最少的註解數據。先前的研究已在一般 NER 基準上實現了與完全監督的 BERT 微調方法相當的性能。然而，先前的研究方法都沒有探討 LLM 基於少量學習在特定領域場景中的效率。為了解決這個差距，我們引入了 FsPONER，這是一種優化少量提示的新方法，並評估了它在特定領域 NER 資料集上的性能，重點放在工業製造和維護上，同時使用多個 LLM -- GPT-4-32K、GPT-3.5-Turbo、LLaMA 2-chat 和 Vicuna。FsPONER 包含三種基於隨機抽樣、TF-IDF 向量和兩者的組合的少量選擇方法。我們將這些方法與通用 GPT-NER 方法進行比較，因為少量範例的數量增加，並評估它們相對於微調 BERT 和 LLaMA 2-chat 的最佳 NER 性能。在考慮的數據稀缺的真實世界場景中，帶有 TF-IDF 的 FsPONER 在 F1 分數上比微調模型高出約 10%。", "author": "Yongjian Tang et.al.", "authors": "Yongjian Tang, Rakebul Hasan, Thomas Runkler", "id": "2407.08035v1", "paper_url": "http://arxiv.org/abs/2407.08035v1", "repo": "null"}}