{"2502.11962": {"publish_time": "2025-02-17", "title": "Navigating the Helpfulness-Truthfulness Trade-Off with Uncertainty-Aware Instruction Fine-Tuning", "paper_summary": "Instruction Fine-tuning (IFT) can enhance the helpfulness of Large Language\nModels (LLMs), but it may lower their truthfulness. This trade-off arises\nbecause IFT steers LLMs to generate responses with long-tail knowledge that is\nnot well covered during pre-training, leading to more informative but less\ntruthful answers when generalizing to unseen tasks. In this paper, we\nempirically demonstrate this helpfulness-truthfulness trade-off in IFT and\npropose $\\textbf{UNIT}$, a novel IFT paradigm to address it. UNIT teaches LLMs\nto recognize their uncertainty and explicitly reflect it at the end of their\nresponses. Experimental results show that UNIT-tuned models maintain their\nhelpfulness while distinguishing between certain and uncertain claims, thereby\nreducing hallucinations.", "paper_summary_zh": "指令微調 (IFT) 可以提升大型語言模型 (LLM) 的實用性，但可能會降低其真實性。這種取捨會出現，是因為 IFT 引導 LLM 生成具有長尾知識的回應，而這些知識在預訓練期間並未充分涵蓋，導致在推廣到未見任務時，答案更具資訊性，但真實性較低。在本文中，我們透過實證展示 IFT 中的這種實用性與真實性取捨，並提出一個新穎的 IFT 典範 $\\textbf{UNIT}$ 來解決這個問題。UNIT 教導 LLM 辨識其不確定性，並明確反映在其回應的結尾。實驗結果顯示，經過 UNIT 微調的模型維持其實用性，同時區分確定和不確定的說法，從而減少幻覺。", "author": "Tianyi Wu et.al.", "authors": "Tianyi Wu, Jingwei Ni, Bryan Hooi, Jiaheng Zhang, Elliott Ash, See-Kiong Ng, Mrinmaya Sachan, Markus Leippold", "id": "2502.11962v1", "paper_url": "http://arxiv.org/abs/2502.11962v1", "repo": "null"}}