{"2409.01013": {"publish_time": "2024-09-02", "title": "SeCo-INR: Semantically Conditioned Implicit Neural Representations for Improved Medical Image Super-Resolution", "paper_summary": "Implicit Neural Representations (INRs) have recently advanced the field of\ndeep learning due to their ability to learn continuous representations of\nsignals without the need for large training datasets. Although INR methods have\nbeen studied for medical image super-resolution, their adaptability to\nlocalized priors in medical images has not been extensively explored. Medical\nimages contain rich anatomical divisions that could provide valuable local\nprior information to enhance the accuracy and robustness of INRs. In this work,\nwe propose a novel framework, referred to as the Semantically Conditioned INR\n(SeCo-INR), that conditions an INR using local priors from a medical image,\nenabling accurate model fitting and interpolation capabilities to achieve\nsuper-resolution. Our framework learns a continuous representation of the\nsemantic segmentation features of a medical image and utilizes it to derive the\noptimal INR for each semantic region of the image. We tested our framework\nusing several medical imaging modalities and achieved higher quantitative\nscores and more realistic super-resolution outputs compared to state-of-the-art\nmethods.", "paper_summary_zh": "隱式神經表徵 (INR) 近期由於其無需大量訓練資料集就能學習訊號的連續表徵的能力，而推動了深度學習領域的進展。儘管 INR 方法已被研究用於醫學影像超解析度，但其對於醫學影像中局部先驗的適應性尚未被廣泛探討。醫學影像包含豐富的解剖學區分，這些區分可以提供有價值的局部先驗資訊，以增強 INR 的準確性和穩健性。在這項工作中，我們提出了一個新穎的架構，稱為語義條件 INR (SeCo-INR)，它使用醫學影像中的局部先驗來調整 INR，實現準確的模型擬合和插值能力，以實現超解析度。我們的架構學習醫學影像的語意分割特徵的連續表徵，並利用它為影像的每個語意區域推導最佳 INR。我們使用多種醫學影像方式測試我們的架構，並與最先進的方法相比，達到了更高的量化評分和更逼真的超解析度輸出。", "author": "Mevan Ekanayake et.al.", "authors": "Mevan Ekanayake, Zhifeng Chen, Gary Egan, Mehrtash Harandi, Zhaolin Chen", "id": "2409.01013v1", "paper_url": "http://arxiv.org/abs/2409.01013v1", "repo": "null"}}