{"2405.20613": {"publish_time": "2024-05-31", "title": "FineRadScore: A Radiology Report Line-by-Line Evaluation Technique Generating Corrections with Severity Scores", "paper_summary": "The current gold standard for evaluating generated chest x-ray (CXR) reports\nis through radiologist annotations. However, this process can be extremely\ntime-consuming and costly, especially when evaluating large numbers of reports.\nIn this work, we present FineRadScore, a Large Language Model (LLM)-based\nautomated evaluation metric for generated CXR reports. Given a candidate report\nand a ground-truth report, FineRadScore gives the minimum number of\nline-by-line corrections required to go from the candidate to the ground-truth\nreport. Additionally, FineRadScore provides an error severity rating with each\ncorrection and generates comments explaining why the correction was needed. We\ndemonstrate that FineRadScore's corrections and error severity scores align\nwith radiologist opinions. We also show that, when used to judge the quality of\nthe report as a whole, FineRadScore aligns with radiologists as well as current\nstate-of-the-art automated CXR evaluation metrics. Finally, we analyze\nFineRadScore's shortcomings to provide suggestions for future improvements.", "paper_summary_zh": "目前評估生成的胸部 X 光 (CXR) 報告的黃金標準是透過放射科醫師註解。然而，這個過程可能非常耗時且昂貴，特別是在評估大量的報告時。在這項工作中，我們提出 FineRadScore，一種基於大型語言模型 (LLM) 的自動化評估指標，用於生成的 CXR 報告。給定候選報告和基本事實報告，FineRadScore 會提供從候選報告到基本事實報告所需的最少逐行更正次數。此外，FineRadScore 會提供每個更正的錯誤嚴重性評分，並產生說明為何需要更正的評論。我們證明 FineRadScore 的更正和錯誤嚴重性評分與放射科醫師的意見一致。我們也顯示，當用於判斷報告的整體品質時，FineRadScore 與放射科醫師以及目前最先進的自動化 CXR 評估指標一致。最後，我們分析 FineRadScore 的缺點，以提供未來改進的建議。", "author": "Alyssa Huang et.al.", "authors": "Alyssa Huang, Oishi Banerjee, Kay Wu, Eduardo Pontes Reis, Pranav Rajpurkar", "id": "2405.20613v1", "paper_url": "http://arxiv.org/abs/2405.20613v1", "repo": "null"}}