{"2410.02749": {"publish_time": "2024-10-03", "title": "Training Language Models on Synthetic Edit Sequences Improves Code Synthesis", "paper_summary": "Software engineers mainly write code by editing existing programs. In\ncontrast, large language models (LLMs) autoregressively synthesize programs in\na single pass. One explanation for this is the scarcity of open-sourced edit\ndata. While high-quality instruction data for code synthesis is already scarce,\nhigh-quality edit data is even scarcer. To fill this gap, we develop a\nsynthetic data generation algorithm called LintSeq. This algorithm refactors\nexisting code into a sequence of code edits by using a linter to procedurally\nsample across the error-free insertions that can be used to sequentially write\nprograms. It outputs edit sequences as text strings consisting of consecutive\nprogram diffs. To test LintSeq, we use it to refactor a dataset of instruction\n+ program pairs into instruction + program-diff-sequence tuples. Then, we\ninstruction finetune a series of smaller LLMs ranging from 2.6B to 14B\nparameters on both the re-factored and original versions of this dataset,\ncomparing zero-shot performance on code synthesis benchmarks. We show that\nduring repeated sampling, edit sequence finetuned models produce more diverse\nprograms than baselines. This results in better inference-time scaling for\nbenchmark coverage as a function of samples, i.e. the fraction of problems\n\"pass@k\" solved by any attempt given \"k\" tries. For example, on HumanEval\npass@50, small LLMs finetuned on synthetic edit sequences are competitive with\nGPT-4 and outperform models finetuned on the baseline dataset by +20% (+/-3%)\nin absolute score. Finally, we also pretrain our own tiny LMs for code\nunderstanding. We show that finetuning tiny models on synthetic code edits\nresults in state-of-the-art code synthesis for the on-device model class. Our\n150M parameter edit sequence LM matches or outperforms code models with twice\nas many parameters, both with and without repeated sampling, including Codex\nand AlphaCode.", "paper_summary_zh": "軟體工程師主要透過編輯現有程式來撰寫程式碼。相對而言，大型語言模型 (LLM) 會在單次傳遞中自動回歸地合成程式碼。其中一個解釋是開放原始碼編輯資料的稀少性。雖然用於程式碼合成的優質指令資料已經很稀少，但優質的編輯資料更為稀少。為了填補這個差距，我們開發了一種名為 LintSeq 的合成資料產生演算法。此演算法會透過使用 linter 循序漸進地對無錯誤插入進行抽樣，將現有程式碼重構為一系列程式碼編輯。它會以由連續程式碼差異組成的文字字串作為輸出編輯序列。為了測試 LintSeq，我們使用它將指令 + 程式碼配對資料集重構為指令 + 程式碼差異序列組。然後，我們對從 2.6B 到 14B 參數範圍內的一系列較小的 LLM 進行指令微調，同時針對此資料集的重構版本和原始版本進行微調，並比較程式碼合成基準上的零次學習效能。我們展示了在重複抽樣期間，編輯序列微調模型會產生比基準更為多樣化的程式碼。這會導致基準涵蓋範圍在樣本函數中的推論時間縮放效果更好，亦即在給定「k」次嘗試的任何嘗試中解決「pass@k」問題的比例。例如，在 HumanEval pass@50 中，針對合成編輯序列進行微調的小型 LLM 與 GPT-4 具有競爭力，且在絕對分數上比針對基準資料集進行微調的模型高出 +20% (+/-3%)。最後，我們也針對程式碼理解預訓練我們自己的小型 LM。我們展示了針對合成程式碼編輯進行微調的小型模型，會產生裝置上模型類別的最新程式碼合成。我們的 150M 參數編輯序列 LM 匹配或超越參數多一倍的程式碼模型，無論是否重複抽樣，其中包括 Codex 和 AlphaCode。", "author": "Ulyana Piterbarg et.al.", "authors": "Ulyana Piterbarg, Lerrel Pinto, Rob Fergus", "id": "2410.02749v1", "paper_url": "http://arxiv.org/abs/2410.02749v1", "repo": "null"}}