{"2502.02780": {"publish_time": "2025-02-04", "title": "Classroom Simulacra: Building Contextual Student Generative Agents in Online Education for Learning Behavioral Simulation", "paper_summary": "Student simulation supports educators to improve teaching by interacting with\nvirtual students. However, most existing approaches ignore the modulation\neffects of course materials because of two challenges: the lack of datasets\nwith granularly annotated course materials, and the limitation of existing\nsimulation models in processing extremely long textual data. To solve the\nchallenges, we first run a 6-week education workshop from N = 60 students to\ncollect fine-grained data using a custom built online education system, which\nlogs students' learning behaviors as they interact with lecture materials over\ntime. Second, we propose a transferable iterative reflection (TIR) module that\naugments both prompting-based and finetuning-based large language models (LLMs)\nfor simulating learning behaviors. Our comprehensive experiments show that TIR\nenables the LLMs to perform more accurate student simulation than classical\ndeep learning models, even with limited demonstration data. Our TIR approach\nbetter captures the granular dynamism of learning performance and inter-student\ncorrelations in classrooms, paving the way towards a ''digital twin'' for\nonline education.", "paper_summary_zh": "學生模擬支持教育工作者透過與虛擬學生互動來改善教學。然而，現有的方法大多忽略課程材料的調節效應，原因有兩個挑戰：缺乏詳細標註課程材料的資料集，以及現有模擬模型在處理極長文字資料時的限制。為了解決這些挑戰，我們首先從 N = 60 名學生中進行為期 6 週的教育工作坊，使用自訂建置的線上教育系統收集細粒度的資料，記錄學生在一段時間內與講義材料互動時的學習行為。其次，我們提出一個可轉移的迭代反思 (TIR) 模組，用於擴充基於提示和微調的大語言模型 (LLM)，以模擬學習行為。我們的綜合實驗顯示，即使示範資料有限，TIR 也能讓 LLM 執行比傳統深度學習模型更精準的學生模擬。我們的 TIR 方法能更佳捕捉學習表現的細粒度動態以及教室中的學生間關聯，為線上教育的「數位雙胞胎」鋪路。", "author": "Songlin Xu et.al.", "authors": "Songlin Xu, Hao-Ning Wen, Hongyi Pan, Dallas Dominguez, Dongyin Hu, Xinyu Zhang", "id": "2502.02780v1", "paper_url": "http://arxiv.org/abs/2502.02780v1", "repo": "null"}}