{"2501.12149": {"publish_time": "2025-01-21", "title": "On the practical applicability of modern DFT functionals for chemical computations. Case study of DM21 applicability for geometry optimization", "paper_summary": "Density functional theory (DFT) is probably the most promising approach for\nquantum chemistry calculations considering its good balance between\ncalculations precision and speed. In recent years, several neural network-based\nfunctionals have been developed for exchange-correlation energy approximation\nin DFT, DM21 developed by Google Deepmind being the most notable between them.\nThis study focuses on evaluating the efficiency of DM21 functional in\npredicting molecular geometries, with a focus on the influence of oscillatory\nbehavior in neural network exchange-correlation functionals. We implemented\ngeometry optimization in PySCF for the DM21 functional in geometry optimization\nproblem, compared its performance with traditional functionals, and tested it\non various benchmarks. Our findings reveal both the potential and the current\nchallenges of using neural network functionals for geometry optimization in\nDFT. We propose a solution extending the practical applicability of such\nfunctionals and allowing to model new substances with their help.", "paper_summary_zh": "密度泛函理論 (DFT) 可能是在量子化學計算中，在計算精度和速度之間取得良好平衡的最有前途的方法。近年來，已經為 DFT 中的交換相關能近似開發了幾種基於神經網路的泛函，由 Google Deepmind 開發的 DM21 是其中最著名的。本研究重點在於評估 DM21 泛函在預測分子幾何形狀方面的效率，重點在於神經網路交換相關泛函中振盪行為的影響。我們在幾何最佳化問題中為 DM21 泛函實作了 PySCF 中的幾何最佳化，將其效能與傳統泛函進行比較，並在各種基準上對其進行測試。我們的發現揭示了使用神經網路泛函進行 DFT 中幾何最佳化的潛力和當前挑戰。我們提出了一個解決方案，擴展了此類泛函的實用適用性，並允許藉助它們來建模新物質。", "author": "Kirill Kulaev et.al.", "authors": "Kirill Kulaev, Alexander Ryabov, Michael Medvedev, Evgeny Burnaev, Vladimir Vanovskiy", "id": "2501.12149v1", "paper_url": "http://arxiv.org/abs/2501.12149v1", "repo": "null"}}