{"2409.18073": {"publish_time": "2024-09-26", "title": "Infer Human's Intentions Before Following Natural Language Instructions", "paper_summary": "For AI agents to be helpful to humans, they should be able to follow natural\nlanguage instructions to complete everyday cooperative tasks in human\nenvironments. However, real human instructions inherently possess ambiguity,\nbecause the human speakers assume sufficient prior knowledge about their hidden\ngoals and intentions. Standard language grounding and planning methods fail to\naddress such ambiguities because they do not model human internal goals as\nadditional partially observable factors in the environment. We propose a new\nframework, Follow Instructions with Social and Embodied Reasoning (FISER),\naiming for better natural language instruction following in collaborative\nembodied tasks. Our framework makes explicit inferences about human goals and\nintentions as intermediate reasoning steps. We implement a set of\nTransformer-based models and evaluate them over a challenging benchmark,\nHandMeThat. We empirically demonstrate that using social reasoning to\nexplicitly infer human intentions before making action plans surpasses purely\nend-to-end approaches. We also compare our implementation with strong\nbaselines, including Chain of Thought prompting on the largest available\npre-trained language models, and find that FISER provides better performance on\nthe embodied social reasoning tasks under investigation, reaching the\nstate-of-the-art on HandMeThat.", "paper_summary_zh": "為了讓 AI 代理人對人類有幫助，他們應該能夠遵循自然語言指令，在人類環境中完成日常合作任務。然而，真實的人類指令本質上具有模糊性，因為人類說話者假設有足夠的先備知識，了解他們的隱藏目標和意圖。標準的語言基礎和規劃方法無法解決這些模糊性，因為它們不會將人類內部目標建模為環境中額外的部分可觀察因素。我們提出一個新的架構，遵循具有社會和具身推理的指令 (FISER)，目標在於在協作具身任務中更好地遵循自然語言指令。我們的架構對人類目標和意圖進行明確的推論，作為中間推理步驟。我們實作一組基於 Transformer 的模型，並在具有挑戰性的基準 HandMeThat 上對其進行評估。我們憑經驗證明，在制定行動計畫之前，使用社會推理明確推論人類意圖優於純粹的端到端方法。我們也將我們的實作與強大的基準進行比較，包括對最大的可用預訓練語言模型進行思考鏈提示，並發現 FISER 在所研究的具身社會推理任務上提供了更好的效能，在 HandMeThat 上達到最先進的水平。", "author": "Yanming Wan et.al.", "authors": "Yanming Wan, Yue Wu, Yiping Wang, Jiayuan Mao, Natasha Jaques", "id": "2409.18073v1", "paper_url": "http://arxiv.org/abs/2409.18073v1", "repo": "null"}}