{"2408.04811": {"publish_time": "2024-08-09", "title": "h4rm3l: A Dynamic Benchmark of Composable Jailbreak Attacks for LLM Safety Assessment", "paper_summary": "The safety of Large Language Models (LLMs) remains a critical concern due to\na lack of adequate benchmarks for systematically evaluating their ability to\nresist generating harmful content. Previous efforts towards automated red\nteaming involve static or templated sets of illicit requests and adversarial\nprompts which have limited utility given jailbreak attacks' evolving and\ncomposable nature. We propose a novel dynamic benchmark of composable jailbreak\nattacks to move beyond static datasets and taxonomies of attacks and harms. Our\napproach consists of three components collectively called h4rm3l: (1) a\ndomain-specific language that formally expresses jailbreak attacks as\ncompositions of parameterized prompt transformation primitives, (2)\nbandit-based few-shot program synthesis algorithms that generate novel attacks\noptimized to penetrate the safety filters of a target black box LLM, and (3)\nopen-source automated red-teaming software employing the previous two\ncomponents. We use h4rm3l to generate a dataset of 2656 successful novel\njailbreak attacks targeting 6 state-of-the-art (SOTA) open-source and\nproprietary LLMs. Several of our synthesized attacks are more effective than\npreviously reported ones, with Attack Success Rates exceeding 90% on SOTA\nclosed language models such as claude-3-haiku and GPT4-o. By generating\ndatasets of jailbreak attacks in a unified formal representation, h4rm3l\nenables reproducible benchmarking and automated red-teaming, contributes to\nunderstanding LLM safety limitations, and supports the development of robust\ndefenses in an increasingly LLM-integrated world.\n  Warning: This paper and related research artifacts contain offensive and\npotentially disturbing prompts and model-generated content.", "paper_summary_zh": "大型語言模型 (LLM) 的安全性仍然是一個關鍵問題，因為缺乏適當的基準來系統性評估它們抵抗產生有害內容的能力。先前針對自動化紅隊測試的努力涉及靜態或範本化的非法請求和對抗性提示，由於越獄攻擊不斷演進且可組合的特性，因此其效用有限。我們提出了一個可組合越獄攻擊的新型動態基準，以超越靜態資料集和攻擊與危害分類。我們的做法包含三個組成部分，統稱為 h4rm3l：(1) 一種特定領域語言，正式表達越獄攻擊為參數化提示轉換原語的組合，(2) 基於 bandit 的少量程式合成演算法，產生新穎的攻擊，經過最佳化以穿透目標黑盒 LLM 的安全過濾器，以及 (3) 採用前兩個組件的開源自動化紅隊測試軟體。我們使用 h4rm3l 產生一個資料集，其中包含 2656 次成功的越獄攻擊，針對 6 個最先進 (SOTA) 的開源和專有 LLM。我們的幾次合成攻擊比先前報告的攻擊更有效，在 SOTA 封閉語言模型（例如 claude-3-haiku 和 GPT4-o）上的攻擊成功率超過 90%。透過以統一的形式表示產生越獄攻擊的資料集，h4rm3l 能夠進行可重製的基準測試和自動化紅隊測試，有助於了解 LLM 安全限制，並在 LLM 整合度越來越高的世界中支援穩健防禦的開發。警告：這篇論文和相關研究成果包含攻擊性和潛在令人不安的提示和模型產生的內容。", "author": "Moussa Koulako Bala Doumbouya et.al.", "authors": "Moussa Koulako Bala Doumbouya, Ananjan Nandi, Gabriel Poesia, Davide Ghilardi, Anna Goldie, Federico Bianchi, Dan Jurafsky, Christopher D. Manning", "id": "2408.04811v1", "paper_url": "http://arxiv.org/abs/2408.04811v1", "repo": "null"}}