{"2412.09084": {"publish_time": "2024-12-12", "title": "Evaluating Pixel Language Models on Non-Standardized Languages", "paper_summary": "We explore the potential of pixel-based models for transfer learning from\nstandard languages to dialects. These models convert text into images that are\ndivided into patches, enabling a continuous vocabulary representation that\nproves especially useful for out-of-vocabulary words common in dialectal data.\nUsing German as a case study, we compare the performance of pixel-based models\nto token-based models across various syntactic and semantic tasks. Our results\nshow that pixel-based models outperform token-based models in part-of-speech\ntagging, dependency parsing and intent detection for zero-shot dialect\nevaluation by up to 26 percentage points in some scenarios, though not in\nStandard German. However, pixel-based models fall short in topic\nclassification. These findings emphasize the potential of pixel-based models\nfor handling dialectal data, though further research should be conducted to\nassess their effectiveness in various linguistic contexts.", "paper_summary_zh": "我們探討了基於像素的模型從標準語言轉移學習到方言的潛力。這些模型將文字轉換為圖像，並將其分割成區塊，實現連續的詞彙表徵，這對於方言資料中常見的生僻字特別有用。我們以德語為案例研究，比較了基於像素的模型與基於符號的模型在各種句法和語義任務中的表現。我們的結果表明，在某些情況下，基於像素的模型在詞性標註、依存句法分析和意圖偵測中優於基於符號的模型，在零次方言評估中最多可達 26 個百分點，但標準德語除外。然而，基於像素的模型在主題分類方面表現不佳。這些發現強調了基於像素的模型在處理方言資料方面的潛力，儘管應進行進一步的研究以評估其在各種語言環境中的有效性。", "author": "Alberto Muñoz-Ortiz et.al.", "authors": "Alberto Muñoz-Ortiz, Verena Blaschke, Barbara Plank", "id": "2412.09084v1", "paper_url": "http://arxiv.org/abs/2412.09084v1", "repo": "null"}}