{"2501.09997": {"publish_time": "2025-01-17", "title": "Attention-guided Self-reflection for Zero-shot Hallucination Detection in Large Language Models", "paper_summary": "Hallucination has emerged as a significant barrier to the effective\napplication of Large Language Models (LLMs). In this work, we introduce a novel\nAttention-Guided SElf-Reflection (AGSER) approach for zero-shot hallucination\ndetection in LLMs. The AGSER method utilizes attention contributions to\ncategorize the input query into attentive and non-attentive queries. Each query\nis then processed separately through the LLMs, allowing us to compute\nconsistency scores between the generated responses and the original answer. The\ndifference between the two consistency scores serves as a hallucination\nestimator. In addition to its efficacy in detecting hallucinations, AGSER\nnotably reduces computational complexity, requiring only three passes through\nthe LLM and utilizing two sets of tokens. We have conducted extensive\nexperiments with four widely-used LLMs across three different hallucination\nbenchmarks, demonstrating that our approach significantly outperforms existing\nmethods in zero-shot hallucination detection.", "paper_summary_zh": "幻覺已成為大型語言模型 (LLM) 有效應用的一項重大障礙。在這項工作中，我們介紹了一種新穎的注意力引導自我反省 (AGSER) 方法，用於 LLM 中的零次發射幻覺檢測。AGSER 方法利用注意力貢獻將輸入查詢分類為注意力查詢和非注意力查詢。然後通過 LLM 分別處理每個查詢，使我們能夠計算生成回應與原始答案之間的一致性分數。兩個一致性分數之間的差異作為幻覺估計器。除了在檢測幻覺方面有效之外，AGSER 還顯著降低了計算複雜度，只需通過 LLM 執行三次並使用兩組標記。我們對四個廣泛使用的 LLM 進行了廣泛的實驗，涵蓋了三個不同的幻覺基準，證明了我們的方法在零次發射幻覺檢測中顯著優於現有方法。", "author": "Qiang Liu et.al.", "authors": "Qiang Liu, Xinlong Chen, Yue Ding, Shizhen Xu, Shu Wu, Liang Wang", "id": "2501.09997v1", "paper_url": "http://arxiv.org/abs/2501.09997v1", "repo": "null"}}