{"2411.13343": {"publish_time": "2024-11-20", "title": "Fact-Level Confidence Calibration and Self-Correction", "paper_summary": "Confidence calibration in LLMs, i.e., aligning their self-assessed confidence\nwith the actual accuracy of their responses, enabling them to self-evaluate the\ncorrectness of their outputs. However, current calibration methods for LLMs\ntypically estimate two scalars to represent overall response confidence and\ncorrectness, which is inadequate for long-form generation where the response\nincludes multiple atomic facts and may be partially confident and correct.\nThese methods also overlook the relevance of each fact to the query. To address\nthese challenges, we propose a Fact-Level Calibration framework that operates\nat a finer granularity, calibrating confidence to relevance-weighted\ncorrectness at the fact level. Furthermore, comprehensive analysis under the\nframework inspired the development of Confidence-Guided Fact-level\nSelf-Correction ($\\textbf{ConFix}$), which uses high-confidence facts within a\nresponse as additional knowledge to improve low-confidence ones. Extensive\nexperiments across four datasets and six models demonstrate that ConFix\neffectively mitigates hallucinations without requiring external knowledge\nsources such as retrieval systems.", "paper_summary_zh": "大型语言模型的信心校准，即对其自评的信心与响应的实际准确性保持一致，使其能够自我评估输出的正确性。然而，当前针对大型语言模型的校准方法通常估计两个标量来表示整体响应信心和正确性，这对于长篇生成来说是不够的，因为响应包含多个原子事实，并且可能部分正确且有信心。这些方法还忽略了每个事实与查询的相关性。为了应对这些挑战，我们提出了一个事实级别校准框架，该框架以更精细的粒度运行，将信心校准为事实级别的相关性加权正确性。此外，在该框架下的全面分析启发了信心引导事实级别自我纠正（$\\textbf{ConFix}$）的开发，它使用响应中高信心的事实作为附加知识来改进低信心的事实。跨四个数据集和六个模型的广泛实验表明，ConFix 有效地减轻了幻觉，而不需要检索系统等外部知识源。", "author": "Yige Yuan et.al.", "authors": "Yige Yuan, Bingbing Xu, Hexiang Tan, Fei Sun, Teng Xiao, Wei Li, Huawei Shen, Xueqi Cheng", "id": "2411.13343v1", "paper_url": "http://arxiv.org/abs/2411.13343v1", "repo": "null"}}