{"2502.02863": {"publish_time": "2025-02-05", "title": "OceanChat: The Effect of Virtual Conversational AI Agents on Sustainable Attitude and Behavior Change", "paper_summary": "Marine ecosystems face unprecedented threats from climate change and plastic\npollution, yet traditional environmental education often struggles to translate\nawareness into sustained behavioral change. This paper presents OceanChat, an\ninteractive system leveraging large language models to create conversational AI\nagents represented as animated marine creatures -- specifically a beluga whale,\na jellyfish, and a seahorse -- designed to promote environmental behavior (PEB)\nand foster awareness through personalized dialogue. Through a between-subjects\nexperiment (N=900), we compared three conditions: (1) Static Scientific\nInformation, providing conventional environmental education through text and\nimages; (2) Static Character Narrative, featuring first-person storytelling\nfrom 3D-rendered marine creatures; and (3) Conversational Character Narrative,\nenabling real-time dialogue with AI-powered marine characters. Our analysis\nrevealed that the Conversational Character Narrative condition significantly\nincreased behavioral intentions and sustainable choice preferences compared to\nstatic approaches. The beluga whale character demonstrated consistently\nstronger emotional engagement across multiple measures, including perceived\nanthropomorphism and empathy. However, impacts on deeper measures like climate\npolicy support and psychological distance were limited, highlighting the\ncomplexity of shifting entrenched beliefs. Our work extends research on\nsustainability interfaces facilitating PEB and offers design principles for\ncreating emotionally resonant, context-aware AI characters. By balancing\nanthropomorphism with species authenticity, OceanChat demonstrates how\ninteractive narratives can bridge the gap between environmental knowledge and\nreal-world behavior change.", "paper_summary_zh": "海洋生態系統面臨氣候變遷和塑膠污染空前的威脅，然而傳統的環境教育往往難以將認知轉化為持續的行為改變。本文提出 OceanChat，一個互動系統，利用大型語言模型創造出對話式 AI 代理，以動畫海洋生物呈現——特別是白鯨、水母和海馬——旨在透過個人化對話促進環境行為 (PEB) 並培養認知。透過受試者間實驗 (N=900)，我們比較了三種情況：(1) 靜態科學資訊，透過文字和圖片提供傳統的環境教育；(2) 靜態角色敘事，以 3D渲染的海洋生物的第一人稱敘事為特色；(3) 對話式角色敘事，與由 AI 驅動的海洋角色進行即時對話。我們的分析顯示，與靜態方法相比，對話式角色敘事情況顯著增加了行為意圖和永續選擇偏好。白鯨角色在多項指標中持續展現更強烈的情緒參與，包括感知擬人化和同理心。然而，對氣候政策支持和心理距離等更深層面的影響有限，突顯了改變根深蒂固信念的複雜性。我們的研究擴展了促進 PEB 的永續性介面，並提供了創造具有情緒共鳴、具備脈絡感知能力的 AI 角色的設計原則。透過平衡擬人化和物種真實性，OceanChat 示範了互動式敘事如何縮小環境知識和現實世界行為改變之間的差距。", "author": "Pat Pataranutaporn et.al.", "authors": "Pat Pataranutaporn, Alexander Doudkin, Pattie Maes", "id": "2502.02863v1", "paper_url": "http://arxiv.org/abs/2502.02863v1", "repo": "null"}}