{"2409.02522": {"publish_time": "2024-09-04", "title": "Cog-GA: A Large Language Models-based Generative Agent for Vision-Language Navigation in Continuous Environments", "paper_summary": "Vision Language Navigation in Continuous Environments (VLN-CE) represents a\nfrontier in embodied AI, demanding agents to navigate freely in unbounded 3D\nspaces solely guided by natural language instructions. This task introduces\ndistinct challenges in multimodal comprehension, spatial reasoning, and\ndecision-making. To address these challenges, we introduce Cog-GA, a generative\nagent founded on large language models (LLMs) tailored for VLN-CE tasks. Cog-GA\nemploys a dual-pronged strategy to emulate human-like cognitive processes.\nFirstly, it constructs a cognitive map, integrating temporal, spatial, and\nsemantic elements, thereby facilitating the development of spatial memory\nwithin LLMs. Secondly, Cog-GA employs a predictive mechanism for waypoints,\nstrategically optimizing the exploration trajectory to maximize navigational\nefficiency. Each waypoint is accompanied by a dual-channel scene description,\ncategorizing environmental cues into 'what' and 'where' streams as the brain.\nThis segregation enhances the agent's attentional focus, enabling it to discern\npertinent spatial information for navigation. A reflective mechanism\ncomplements these strategies by capturing feedback from prior navigation\nexperiences, facilitating continual learning and adaptive replanning. Extensive\nevaluations conducted on VLN-CE benchmarks validate Cog-GA's state-of-the-art\nperformance and ability to simulate human-like navigation behaviors. This\nresearch significantly contributes to the development of strategic and\ninterpretable VLN-CE agents.", "paper_summary_zh": "<paragraph>在連續環境中進行視覺語言導航 (VLN-CE) 代表著具身 AI 的前沿，要求代理在僅由自然語言指令引導的無界 3D 空間中自由導航。此任務在多模態理解、空間推理和決策制定方面帶來了不同的挑戰。為了應對這些挑戰，我們引入了 Cog-GA，這是一個生成式代理，建立在專門針對 VLN-CE 任務的大型語言模型 (LLM) 之上。Cog-GA 採用雙管齊下的策略來模擬類人認知過程。首先，它構建了一個認知地圖，整合了時間、空間和語義元素，從而促進了 LLM 中空間記憶的發展。其次，Cog-GA 採用了一個用於路徑點的預測機制，策略性地優化探索軌跡以最大化導航效率。每個路徑點都附帶一個雙通道場景描述，將環境線索分類為「什麼」和「在哪裡」流，就像大腦一樣。這種分離增強了代理的注意力焦點，使其能夠辨別與導航相關的空間信息。一個反射機制通過捕捉先前導航經驗的回饋來補充這些策略，促進持續學習和適應性重新規劃。在 VLN-CE 基準上進行的廣泛評估驗證了 Cog-GA 的最新技術和模擬類人導航行為的能力。這項研究極大地促进了策略性和可解釋性 VLN-CE 代理的發展。</paragraph>", "author": "Zhiyuan Li et.al.", "authors": "Zhiyuan Li, Yanfeng Lu, Yao Mu, Hong Qiao", "id": "2409.02522v1", "paper_url": "http://arxiv.org/abs/2409.02522v1", "repo": "null"}}