{"2502.15600": {"publish_time": "2025-02-21", "title": "Robust Bias Detection in MLMs and its Application to Human Trait Ratings", "paper_summary": "There has been significant prior work using templates to study bias against\ndemographic attributes in MLMs. However, these have limitations: they overlook\nrandom variability of templates and target concepts analyzed, assume equality\namongst templates, and overlook bias quantification. Addressing these, we\npropose a systematic statistical approach to assess bias in MLMs, using mixed\nmodels to account for random effects, pseudo-perplexity weights for sentences\nderived from templates and quantify bias using statistical effect sizes.\nReplicating prior studies, we match on bias scores in magnitude and direction\nwith small to medium effect sizes. Next, we explore the novel problem of gender\nbias in the context of $\\textit{personality}$ and $\\textit{character}$ traits,\nacross seven MLMs (base and large). We find that MLMs vary; ALBERT is unbiased\nfor binary gender but the most biased for non-binary $\\textit{neo}$, while\nRoBERTa-large is the most biased for binary gender but shows small to no bias\nfor $\\textit{neo}$. There is some alignment of MLM bias and findings in\npsychology (human perspective) - in $\\textit{agreeableness}$ with RoBERTa-large\nand $\\textit{emotional stability}$ with BERT-large. There is general agreement\nfor the remaining 3 personality dimensions: both sides observe at most small\ndifferences across gender. For character traits, human studies on gender bias\nare limited thus comparisons are not feasible.", "paper_summary_zh": "先前已經有許多使用範本來研究多語言模型中針對人口屬性偏見的研究。然而，這些研究有其限制：它們忽略了範本和所分析目標概念的隨機變異性，假設範本之間的平等性，並且忽略了偏見量化。為了解決這些問題，我們提出了一種系統性的統計方法來評估多語言模型中的偏見，使用混合模型來考量隨機效應，範本衍生句子的偽困惑度權重，並使用統計效應量來量化偏見。複製先前的研究，我們在大小和方向上匹配偏見分數，效應量從小到中。接下來，我們探討在「個性」和「性格」特質的脈絡中性別偏見的新問題，跨越了七個多語言模型（基礎和大型）。我們發現多語言模型有所不同；ALBERT 對二元性別沒有偏見，但對非二元「neo」的偏見最大，而 RoBERTa-large 對二元性別的偏見最大，但對「neo」的偏見很小甚至沒有。在多語言模型偏見和心理學（人類觀點）中的發現有一些一致性 - RoBERTa-large 的「宜人性」和 BERT-large 的「情緒穩定性」。對於其餘 3 個個性向度，達成了一致的共識：雙方觀察到性別之間的差異很小。對於性格特質，關於性別偏見的人類研究有限，因此無法進行比較。", "author": "Ingroj Shrestha et.al.", "authors": "Ingroj Shrestha, Louis Tay, Padmini Srinivasan", "id": "2502.15600v1", "paper_url": "http://arxiv.org/abs/2502.15600v1", "repo": "null"}}