{"2502.02788": {"publish_time": "2025-02-05", "title": "Inducing Diversity in Differentiable Search Indexing", "paper_summary": "Differentiable Search Indexing (DSI) is a recent paradigm for information\nretrieval which uses a transformer-based neural network architecture as the\ndocument index to simplify the retrieval process. A differentiable index has\nmany advantages enabling modifications, updates or extensions to the index. In\nthis work, we explore balancing relevance and novel information content\n(diversity) for training DSI systems inspired by Maximal Marginal Relevance\n(MMR), and show the benefits of our approach over the naive DSI training. We\npresent quantitative and qualitative evaluations of relevance and diversity\nmeasures obtained using our method on NQ320K and MSMARCO datasets in comparison\nto naive DSI. With our approach, it is possible to achieve diversity without\nany significant impact to relevance. Since we induce diversity while training\nDSI, the trained model has learned to diversify while being relevant. This\nobviates the need for a post-processing step to induce diversity in the recall\nset as typically performed using MMR. Our approach will be useful for\nInformation Retrieval problems where both relevance and diversity are important\nsuch as in sub-topic retrieval. Our work can also be easily be extended to the\nincremental DSI settings which would enable fast updates to the index while\nretrieving a diverse recall set.", "paper_summary_zh": "可微搜索索引 (DSI) 是資訊檢索的最新範例，它使用基於轉換器的類神經網路架構作為文件索引，以簡化檢索程序。可微索引具有許多優點，可修改、更新或延伸索引。在這項工作中，我們探討平衡相關性和新資訊內容 (多樣性) 以訓練 DSI 系統，靈感來自最大邊際相關性 (MMR)，並展示我們的方法優於天真的 DSI 訓練。我們提出使用我們的方法在 NQ320K 和 MSMARCO 資料集上獲得相關性和多樣性評量的量化和質化評估，以與天真的 DSI 進行比較。透過我們的方法，可以在不對相關性造成任何顯著影響的情況下實現多樣性。由於我們在訓練 DSI 時引發多樣性，因此受過訓練的模型已經學會在相關的同時進行多樣化。這消除了對後處理步驟的需求，以引發召回設定中的多樣性，就像通常使用 MMR 執行的那樣。我們的做法對於相關性和多樣性都很重要的資訊檢索問題很有用，例如子主題檢索。我們的作品也可以很容易地擴展到增量 DSI 設定，這將允許在檢索多樣化召回設定的同時快速更新索引。", "author": "Abhijeet Phatak et.al.", "authors": "Abhijeet Phatak, Jayant Sachdev, Sean D Rosario, Swati Kirti, Chittaranjan Tripathy", "id": "2502.02788v1", "paper_url": "http://arxiv.org/abs/2502.02788v1", "repo": "null"}}