{"2411.07038": {"publish_time": "2024-11-11", "title": "Designing Reliable Experiments with Generative Agent-Based Modeling: A Comprehensive Guide Using Concordia by Google DeepMind", "paper_summary": "In social sciences, researchers often face challenges when conducting\nlarge-scale experiments, particularly due to the simulations' complexity and\nthe lack of technical expertise required to develop such frameworks.\nAgent-Based Modeling (ABM) is a computational approach that simulates agents'\nactions and interactions to evaluate how their behaviors influence the\noutcomes. However, the traditional implementation of ABM can be demanding and\ncomplex. Generative Agent-Based Modeling (GABM) offers a solution by enabling\nscholars to create simulations where AI-driven agents can generate complex\nbehaviors based on underlying rules and interactions. This paper introduces a\nframework for designing reliable experiments using GABM, making sophisticated\nsimulation techniques more accessible to researchers across various fields. We\nprovide a step-by-step guide for selecting appropriate tools, designing the\nmodel, establishing experimentation protocols, and validating results.", "paper_summary_zh": "<paragraph>在社會科學中，研究人員在進行\n大規模實驗時常常會面臨挑戰，特別是模擬的複雜性以及開發此類框架所需技術專業知識的缺乏。\n基於代理的建模 (ABM) 是一種計算方法，用於模擬代理的\n動作和互動，以評估他們的行為如何影響\n結果。然而，ABM 的傳統實施可能是要求嚴格且\n複雜的。生成式基於代理的建模 (GABM) 提供了解決方案，方法是讓\n學者能夠建立模擬，其中由 AI 驅動的代理可以根據\n底層規則和互動產生複雜的行為。本文介紹了一個\n使用 GABM 設計可靠實驗的框架，讓各個領域的研究人員更能使用複雜\n的模擬技術。我們提供了一個逐步指南，用於選擇適當的工具、設計\n模型、建立實驗規程和驗證結果。</paragraph>", "author": "Alejandro Leonardo García Navarro et.al.", "authors": "Alejandro Leonardo García Navarro, Nataliia Koneva, Alfonso Sánchez-Macián, José Alberto Hernández, Manuel Goyanes", "id": "2411.07038v1", "paper_url": "http://arxiv.org/abs/2411.07038v1", "repo": "null"}}