{"2412.10390": {"publish_time": "2024-11-30", "title": "Neural-Symbolic Reasoning over Knowledge Graphs: A Survey from a Query Perspective", "paper_summary": "Knowledge graph reasoning is pivotal in various domains such as data mining,\nartificial intelligence, the Web, and social sciences. These knowledge graphs\nfunction as comprehensive repositories of human knowledge, facilitating the\ninference of new information. Traditional symbolic reasoning, despite its\nstrengths, struggles with the challenges posed by incomplete and noisy data\nwithin these graphs. In contrast, the rise of Neural Symbolic AI marks a\nsignificant advancement, merging the robustness of deep learning with the\nprecision of symbolic reasoning. This integration aims to develop AI systems\nthat are not only highly interpretable and explainable but also versatile,\neffectively bridging the gap between symbolic and neural methodologies.\nAdditionally, the advent of large language models (LLMs) has opened new\nfrontiers in knowledge graph reasoning, enabling the extraction and synthesis\nof knowledge in unprecedented ways. This survey offers a thorough review of\nknowledge graph reasoning, focusing on various query types and the\nclassification of neural symbolic reasoning. Furthermore, it explores the\ninnovative integration of knowledge graph reasoning with large language models,\nhighlighting the potential for groundbreaking advancements. This comprehensive\noverview is designed to support researchers and practitioners across multiple\nfields, including data mining, AI, the Web, and social sciences, by providing a\ndetailed understanding of the current landscape and future directions in\nknowledge graph reasoning.", "paper_summary_zh": "知識圖譜推理在資料探勘、人工智慧、網路和社會科學等領域至關重要。這些知識圖譜作為人類知識的綜合儲存庫，促進新資訊的推論。傳統的符號推理儘管有其優點，但仍難以應對這些圖譜中不完整且有雜訊的資料所帶來的挑戰。相比之下，神經符號 AI 的興起標誌著一個重大進展，它將深度學習的穩健性與符號推理的精確性結合起來。這種整合旨在開發不僅高度可解釋且可說明，而且用途廣泛的 AI 系統，有效地縮小符號和神經方法之間的差距。此外，大型語言模型 (LLM) 的出現為知識圖譜推理開闢了新領域，以前所未有的方式實現知識的提取和綜合。本調查對知識圖譜推理進行了全面回顧，重點關注各種查詢類型和神經符號推理的分類。此外，它還探討了知識圖譜推理與大型語言模型的創新整合，強調了突破性進展的潛力。這份全面的概述旨在透過提供對知識圖譜推理中當前概況和未來方向的詳細了解，來支援資料探勘、AI、網路和社會科學等多個領域的研究人員和實務工作者。", "author": "Lihui Liu et.al.", "authors": "Lihui Liu, Zihao Wang, Hanghang Tong", "id": "2412.10390v1", "paper_url": "http://arxiv.org/abs/2412.10390v1", "repo": "null"}}