{"2410.14672": {"publish_time": "2024-10-18", "title": "BiGR: Harnessing Binary Latent Codes for Image Generation and Improved Visual Representation Capabilities", "paper_summary": "We introduce BiGR, a novel conditional image generation model using compact\nbinary latent codes for generative training, focusing on enhancing both\ngeneration and representation capabilities. BiGR is the first conditional\ngenerative model that unifies generation and discrimination within the same\nframework. BiGR features a binary tokenizer, a masked modeling mechanism, and a\nbinary transcoder for binary code prediction. Additionally, we introduce a\nnovel entropy-ordered sampling method to enable efficient image generation.\nExtensive experiments validate BiGR's superior performance in generation\nquality, as measured by FID-50k, and representation capabilities, as evidenced\nby linear-probe accuracy. Moreover, BiGR showcases zero-shot generalization\nacross various vision tasks, enabling applications such as image inpainting,\noutpainting, editing, interpolation, and enrichment, without the need for\nstructural modifications. Our findings suggest that BiGR unifies generative and\ndiscriminative tasks effectively, paving the way for further advancements in\nthe field.", "paper_summary_zh": "我們引進 BiGR，這是一種新穎的條件圖像生成模型，使用緊湊的二進制潛在碼進行生成訓練，專注於增強生成和表示能力。BiGR 是第一個在同一架構內統一生成和判別的條件生成模型。BiGR 具有二進制分詞器、遮罩建模機制和二進制轉碼器，用於二進制碼預測。此外，我們引入了一種新穎的熵排序採樣方法，以實現高效的圖像生成。廣泛的實驗驗證了 BiGR 在生成品質方面的優異性能，如 FID-50k 所測量，以及表示能力，如線性探測準確度所證明。此外，BiGR 展示了跨各種視覺任務的零次學習泛化，實現了圖像修復、外繪、編輯、插值和豐富化等應用，而無需進行結構修改。我們的研究結果表明，BiGR 有效地統一了生成和判別任務，為該領域的進一步發展鋪平了道路。", "author": "Shaozhe Hao et.al.", "authors": "Shaozhe Hao, Xuantong Liu, Xianbiao Qi, Shihao Zhao, Bojia Zi, Rong Xiao, Kai Han, Kwan-Yee K. Wong", "id": "2410.14672v1", "paper_url": "http://arxiv.org/abs/2410.14672v1", "repo": "https://github.com/haoosz/BiGR"}}