{"2502.14638": {"publish_time": "2025-02-20", "title": "NAVIG: Natural Language-guided Analysis with Vision Language Models for Image Geo-localization", "paper_summary": "Image geo-localization is the task of predicting the specific location of an\nimage and requires complex reasoning across visual, geographical, and cultural\ncontexts. While prior Vision Language Models (VLMs) have the best accuracy at\nthis task, there is a dearth of high-quality datasets and models for analytical\nreasoning. We first create NaviClues, a high-quality dataset derived from\nGeoGuessr, a popular geography game, to supply examples of expert reasoning\nfrom language. Using this dataset, we present Navig, a comprehensive image\ngeo-localization framework integrating global and fine-grained image\ninformation. By reasoning with language, Navig reduces the average distance\nerror by 14% compared to previous state-of-the-art models while requiring fewer\nthan 1000 training samples. Our dataset and code are available at\nhttps://github.com/SparrowZheyuan18/Navig/.", "paper_summary_zh": "影像地理定位是預測影像特定位置的任務，需要跨視覺、地理和文化脈絡進行複雜的推理。雖然先前的視覺語言模型 (VLM) 在此任務中擁有最佳準確度，但缺乏高品質的資料集和分析推理模型。我們首先建立 NaviClues，這是一個源自 GeoGuessr 的高品質資料集，GeoGuessr 是一款流行的地理遊戲，可提供來自語言的專家推理範例。使用此資料集，我們提出 Navig，這是一個綜合性的影像地理定位架構，整合了全球和細緻的影像資訊。透過語言推理，Navig 將平均距離誤差減少了 14%，與先前的最先進模型相比，同時只需要不到 1000 個訓練樣本。我們的資料集和程式碼可在 https://github.com/SparrowZheyuan18/Navig/ 取得。", "author": "Zheyuan Zhang et.al.", "authors": "Zheyuan Zhang, Runze Li, Tasnim Kabir, Jordan Boyd-Graber", "id": "2502.14638v1", "paper_url": "http://arxiv.org/abs/2502.14638v1", "repo": "null"}}