{"2410.02538": {"publish_time": "2024-10-03", "title": "Algorithms For Automatic Accentuation And Transcription Of Russian Texts In Speech Recognition Systems", "paper_summary": "This paper presents an overview of rule-based system for automatic\naccentuation and phonemic transcription of Russian texts for speech connected\ntasks, such as Automatic Speech Recognition (ASR). Two parts of the developed\nsystem, accentuation and transcription, use different approaches to achieve\ncorrect phonemic representations of input phrases. Accentuation is based on\n\"Grammatical dictionary of the Russian language\" of A.A. Zaliznyak and\nwiktionary corpus. To distinguish homographs, the accentuation system also\nutilises morphological information of the sentences based on Recurrent Neural\nNetworks (RNN). Transcription algorithms apply the rules presented in the\nmonograph of B.M. Lobanov and L.I. Tsirulnik \"Computer Synthesis and Voice\nCloning\". The rules described in the present paper are implemented in an\nopen-source module, which can be of use to any scientific study connected to\nASR or Speech To Text (STT) tasks. Automatically marked up text annotations of\nthe Russian Voxforge database were used as training data for an acoustic model\nin CMU Sphinx. The resulting acoustic model was evaluated on cross-validation,\nmean Word Accuracy being 71.2%. The developed toolkit is written in the Python\nlanguage and is accessible on GitHub for any researcher interested.", "paper_summary_zh": "這篇論文概述了基於規則的系統，用於俄語文本的自動重音和音位轉錄，以進行語音連接任務，例如自動語音辨識 (ASR)。已開發系統的兩個部分，重音和轉錄，使用不同的方法來達成輸入語句的正確音位表示。重音基於 A.A. Zaliznyak 的「俄語語法詞典」和維基詞典語料庫。為了區分同形異義詞，重音系統也利用基於遞迴神經網路 (RNN) 的句子的形態資訊。轉錄演算法套用 B.M. Lobanov 和 L.I. Tsirulnik 的專著「電腦合成和語音複製」中提出的規則。本文中描述的規則實作在一個開源模組中，可用於任何與 ASR 或語音轉文字 (STT) 任務相關的科學研究。俄語 Voxforge 資料庫中自動標記的文字註解被用作 CMU Sphinx 中一個聲學模型的訓練資料。結果的聲學模型在交叉驗證中進行評估，平均字詞準確度為 71.2%。已開發的工具包使用 Python 語言撰寫，任何有興趣的研究人員都可以在 GitHub 上取得。", "author": "Olga Iakovenko et.al.", "authors": "Olga Iakovenko, Ivan Bondarenko, Mariya Borovikova, Daniil Vodolazsky", "id": "2410.02538v1", "paper_url": "http://arxiv.org/abs/2410.02538v1", "repo": "null"}}