{"2406.19292": {"publish_time": "2024-06-27", "title": "From Artificial Needles to Real Haystacks: Improving Retrieval Capabilities in LLMs by Finetuning on Synthetic Data", "paper_summary": "Recent studies have shown that Large Language Models (LLMs) struggle to\naccurately retrieve information and maintain reasoning capabilities when\nprocessing long-context inputs. To address these limitations, we propose a\nfinetuning approach utilizing a carefully designed synthetic dataset comprising\nnumerical key-value retrieval tasks. Our experiments on models like GPT-3.5\nTurbo and Mistral 7B demonstrate that finetuning LLMs on this dataset\nsignificantly improves LLMs' information retrieval and reasoning capabilities\nin longer-context settings. We present an analysis of the finetuned models,\nillustrating the transfer of skills from synthetic to real task evaluations\n(e.g., $10.5\\%$ improvement on $20$ documents MDQA at position $10$ for GPT-3.5\nTurbo). We also find that finetuned LLMs' performance on general benchmarks\nremains almost constant while LLMs finetuned on other baseline long-context\naugmentation data can encourage hallucination (e.g., on TriviaQA, Mistral 7B\nfinetuned on our synthetic data cause no performance drop while other baseline\ndata can cause a drop that ranges from $2.33\\%$ to $6.19\\%$). Our study\nhighlights the potential of finetuning on synthetic data for improving the\nperformance of LLMs on longer-context tasks.", "paper_summary_zh": "<paragraph>最近的研究表明，大型语言模型 (LLM) 在处理长文本输入时难以准确地检索信息并维持推理能力。为了解决这些限制，我们提出了一种微调方法，利用精心设计的合成数据集，其中包含数字键值检索任务。我们对 GPT-3.5 Turbo 和 Mistral 7B 等模型进行的实验表明，在该数据集上对 LLM 进行微调可以显着提高 LLM 在较长文本环境中的信息检索和推理能力。我们对微调后的模型进行了分析，说明了从合成任务到真实任务评估的技能转移（例如，在 GPT-3.5 Turbo 的 20 个文档 MDQA 中，在位置 10 上提高了 10.5%）。我们还发现，微调后的 LLM 在一般基准上的性能几乎保持不变，而使用其他基线长文本增强数据对 LLM 进行微调可能会导致出现幻觉（例如，在 TriviaQA 上，在我们的合成数据上微调的 Mistral 7B 不会导致性能下降，而其他基线数据会导致下降 2.33% 至 6.19%）。我们的研究强调了在合成数据上进行微调以提高 LLM 在较长文本任务上的性能的潜力。</paragraph>", "author": "Zheyang Xiong et.al.", "authors": "Zheyang Xiong, Vasilis Papageorgiou, Kangwook Lee, Dimitris Papailiopoulos", "id": "2406.19292v1", "paper_url": "http://arxiv.org/abs/2406.19292v1", "repo": "null"}}