{"2411.19527": {"publish_time": "2024-11-29", "title": "DisCoRD: Discrete Tokens to Continuous Motion via Rectified Flow Decoding", "paper_summary": "Human motion, inherently continuous and dynamic, presents significant\nchallenges for generative models. Despite their dominance, discrete\nquantization methods, such as VQ-VAEs, suffer from inherent limitations,\nincluding restricted expressiveness and frame-wise noise artifacts. Continuous\napproaches, while producing smoother and more natural motions, often falter due\nto high-dimensional complexity and limited training data. To resolve this\n\"discord\" between discrete and continuous representations, we introduce\nDisCoRD: Discrete Tokens to Continuous Motion via Rectified Flow Decoding, a\nnovel method that decodes discrete motion tokens into continuous motion through\nrectified flow. By employing an iterative refinement process in the continuous\nspace, DisCoRD captures fine-grained dynamics and ensures smoother and more\nnatural motions. Compatible with any discrete-based framework, our method\nenhances naturalness without compromising faithfulness to the conditioning\nsignals. Extensive evaluations demonstrate that DisCoRD achieves\nstate-of-the-art performance, with FID of 0.032 on HumanML3D and 0.169 on\nKIT-ML. These results solidify DisCoRD as a robust solution for bridging the\ndivide between discrete efficiency and continuous realism. Our project page is\navailable at: https://whwjdqls.github.io/discord.github.io/.", "paper_summary_zh": "人類動作本質上是連續且動態的，對生成模型而言是一項重大的挑戰。儘管離散量化方法（例如 VQ-VAE）佔據主導地位，但它們卻有固有的限制，包括表達力受限和逐幀雜訊偽影。連續方法雖然產生了更平滑、更自然的動作，但由於高維複雜性和有限的訓練資料，常常會失敗。為了解決離散和連續表示之間的「不協調」，我們引入了 DisCoRD：透過整流流解碼將離散動作代碼解碼為連續動作，這是一種透過整流流將離散動作代碼解碼為連續動作的新方法。透過在連續空間中採用迭代優化程序，DisCoRD 捕捉了細微的動態，並確保了更平滑、更自然的動作。我們的這種方法與任何基於離散的方法相容，它增強了自然度，同時不影響對條件訊號的忠實度。廣泛的評估證明，DisCoRD 達到了最先進的效能，在 HumanML3D 上的 FID 為 0.032，在 KIT-ML 上為 0.169。這些結果穩固了 DisCoRD 作為在離散效率和連續真實感之間搭起橋樑的強大解決方案。我們的專案頁面可於下列網址取得：https://whwjdqls.github.io/discord.github.io/。", "author": "Jungbin Cho et.al.", "authors": "Jungbin Cho, Junwan Kim, Jisoo Kim, Minseo Kim, Mingu Kang, Sungeun Hong, Tae-Hyun Oh, Youngjae Yu", "id": "2411.19527v1", "paper_url": "http://arxiv.org/abs/2411.19527v1", "repo": "null"}}