{"2410.24114": {"publish_time": "2024-10-31", "title": "Nearest Neighbor Normalization Improves Multimodal Retrieval", "paper_summary": "Multimodal models leverage large-scale pre-training to achieve strong but\nstill imperfect performance on tasks such as image captioning, visual question\nanswering, and cross-modal retrieval. In this paper, we present a simple and\nefficient method for correcting errors in trained contrastive image-text\nretrieval models with no additional training, called Nearest Neighbor\nNormalization (NNN). We show an improvement on retrieval metrics in both text\nretrieval and image retrieval for all of the contrastive models that we tested\n(CLIP, BLIP, ALBEF, SigLIP, BEiT) and for both of the datasets that we used\n(MS-COCO and Flickr30k). NNN requires a reference database, but does not\nrequire any training on this database, and can even increase the retrieval\naccuracy of a model after finetuning.", "paper_summary_zh": "多模態模型利用大規模預訓練，在圖像標題、視覺問題解答和跨模態檢索等任務上取得了強勁但仍不完美的表現。在本文中，我們提出了一種簡單且有效的方法，用於更正訓練好的對比圖像文本檢索模型中的錯誤，無需額外訓練，稱為最近鄰正規化 (NNN)。我們展示了在所有我們測試的對比模型（CLIP、BLIP、ALBEF、SigLIP、BEiT）以及我們使用的兩個數據集（MS-COCO 和 Flickr30k）的文本檢索和圖像檢索中檢索指標的改進。NNN 需要一個參考數據庫，但不需要對這個數據庫進行任何訓練，甚至可以在微調後提高模型的檢索準確度。", "author": "Neil Chowdhury et.al.", "authors": "Neil Chowdhury, Franklin Wang, Sumedh Shenoy, Douwe Kiela, Sarah Schwettmann, Tristan Thrush", "id": "2410.24114v1", "paper_url": "http://arxiv.org/abs/2410.24114v1", "repo": "https://github.com/multimodal-interpretability/nnn"}}