{"2502.17416": {"publish_time": "2025-02-24", "title": "Reasoning with Latent Thoughts: On the Power of Looped Transformers", "paper_summary": "Large language models have shown remarkable reasoning abilities and scaling\nlaws suggest that large parameter count, especially along the depth axis, is\nthe primary driver. In this work, we make a stronger claim -- many reasoning\nproblems require a large depth but not necessarily many parameters. This\nunlocks a novel application of looped models for reasoning. Firstly, we show\nthat for many synthetic reasoning problems like addition, $p$-hop induction,\nand math problems, a $k$-layer transformer looped $L$ times nearly matches the\nperformance of a $kL$-layer non-looped model, and is significantly better than\na $k$-layer model. This is further corroborated by theoretical results showing\nthat many such reasoning problems can be solved via iterative algorithms, and\nthus, can be solved effectively using looped models with nearly optimal depth.\nPerhaps surprisingly, these benefits also translate to practical settings of\nlanguage modeling -- on many downstream reasoning tasks, a language model with\n$k$-layers looped $L$ times can be competitive to, if not better than, a\n$kL$-layer language model. In fact, our empirical analysis reveals an\nintriguing phenomenon: looped and non-looped models exhibit scaling behavior\nthat depends on their effective depth, akin to the inference-time scaling of\nchain-of-thought (CoT) reasoning. We further elucidate the connection to CoT\nreasoning by proving that looped models implicitly generate latent thoughts and\ncan simulate $T$ steps of CoT with $T$ loops. Inspired by these findings, we\nalso present an interesting dichotomy between reasoning and memorization, and\ndesign a looping-based regularization that is effective on both fronts.", "paper_summary_zh": "大型語言模型展現了非凡的推理能力，而規模定律表明，大量的參數數量，特別是在深度軸上，是主要驅動力。在這項工作中，我們提出了更強有力的主張——許多推理問題需要大量的深度，但並不一定需要大量的參數。這為循環模型在推理中的新應用開啟了大門。首先，我們展示了對於許多合成推理問題，例如加法、p 跳躍歸納和數學問題，一個循環 L 次的 k 層Transformer幾乎可以匹配 kL 層非循環模型的性能，並且顯著優於 k 層模型。這進一步得到了理論結果的證實，該結果表明許多這樣的推理問題都可以通過迭代算法來解決，因此可以使用深度接近最佳的循環模型有效地解決這些問題。令人驚訝的是，這些好處也轉化為語言建模的實際設置——在許多下游推理任務上，一個循環 L 次的 k 層語言模型可以與 kL 層語言模型競爭，甚至優於 kL 層語言模型。事實上，我們的實證分析揭示了一個有趣的現象：循環和非循環模型表現出取決於它們有效深度的規模行為，類似於思想鏈 (CoT) 推理的推理時間規模。我們進一步通過證明循環模型會隱式生成潛在思想，並且可以用 T 個循環模擬 T 步的 CoT，闡明了與 CoT 推理的聯繫。受這些發現的啟發，我們還提出了推理和記憶之間的有趣二分法，並設計了一個在兩個方面都有效的基於循環的正則化。", "author": "Nikunj Saunshi et.al.", "authors": "Nikunj Saunshi, Nishanth Dikkala, Zhiyuan Li, Sanjiv Kumar, Sashank J. Reddi", "id": "2502.17416v1", "paper_url": "http://arxiv.org/abs/2502.17416v1", "repo": "null"}}