{"2409.07132": {"publish_time": "2024-09-11", "title": "LLM-based feature generation from text for interpretable machine learning", "paper_summary": "Existing text representations such as embeddings and bag-of-words are not\nsuitable for rule learning due to their high dimensionality and absent or\nquestionable feature-level interpretability. This article explores whether\nlarge language models (LLMs) could address this by extracting a small number of\ninterpretable features from text. We demonstrate this process on two datasets\n(CORD-19 and M17+) containing several thousand scientific articles from\nmultiple disciplines and a target being a proxy for research impact. An\nevaluation based on testing for the statistically significant correlation with\nresearch impact has shown that LLama 2-generated features are semantically\nmeaningful. We consequently used these generated features in text\nclassification to predict the binary target variable representing the citation\nrate for the CORD-19 dataset and the ordinal 5-class target representing an\nexpert-awarded grade in the M17+ dataset. Machine-learning models trained on\nthe LLM-generated features provided similar predictive performance to the\nstate-of-the-art embedding model SciBERT for scientific text. The LLM used only\n62 features compared to 768 features in SciBERT embeddings, and these features\nwere directly interpretable, corresponding to notions such as article\nmethodological rigor, novelty, or grammatical correctness. As the final step,\nwe extract a small number of well-interpretable action rules. Consistently\ncompetitive results obtained with the same LLM feature set across both\nthematically diverse datasets show that this approach generalizes across\ndomains.", "paper_summary_zh": "現有的文本表示，例如嵌入和詞袋，由於其高維度和缺乏或有疑問的功能級別可解釋性，因此不適合規則學習。本文探討了大型語言模型 (LLM) 是否可以通過從文本中提取少數可解釋特徵來解決此問題。我們在兩個數據集（CORD-19 和 M17+）上展示了這個過程，這些數據集包含來自多個學科的數千篇科學文章，目標是作為研究影響力的代理。基於對與研究影響力具有統計顯著相關性的測試的評估表明，LLama 2 生成的特徵在語義上是有意義的。因此，我們在文本分類中使用了這些生成的特性來預測代表 CORD-19 數據集引文率的二元目標變量和代表 M17+ 數據集中專家評分的序數 5 類目標。在 LLM 生成的特徵上訓練的機器學習模型提供了與科學文本的最新嵌入模型 SciBERT 類似的預測性能。與 SciBERT 嵌入中的 768 個特徵相比，LLM 僅使用了 62 個特徵，並且這些特徵是直接可解釋的，對應於文章方法論嚴謹性、新穎性或語法正確性等概念。作為最後一步，我們提取了少數可很好解釋的動作規則。在兩個主題多樣化的數據集中使用相同的 LLM 特徵集獲得的持續競爭結果表明，這種方法可以推廣到各個領域。", "author": "Vojtěch Balek et.al.", "authors": "Vojtěch Balek, Lukáš Sýkora, Vilém Sklenák, Tomáš Kliegr", "id": "2409.07132v1", "paper_url": "http://arxiv.org/abs/2409.07132v1", "repo": "null"}}