{"2412.09799": {"publish_time": "2024-12-13", "title": "CP-DETR: Concept Prompt Guide DETR Toward Stronger Universal Object Detection", "paper_summary": "Recent research on universal object detection aims to introduce language in a\nSoTA closed-set detector and then generalize the open-set concepts by\nconstructing large-scale (text-region) datasets for training. However, these\nmethods face two main challenges: (i) how to efficiently use the prior\ninformation in the prompts to genericise objects and (ii) how to reduce\nalignment bias in the downstream tasks, both leading to sub-optimal performance\nin some scenarios beyond pre-training. To address these challenges, we propose\na strong universal detection foundation model called CP-DETR, which is\ncompetitive in almost all scenarios, with only one pre-training weight.\nSpecifically, we design an efficient prompt visual hybrid encoder that enhances\nthe information interaction between prompt and visual through scale-by-scale\nand multi-scale fusion modules. Then, the hybrid encoder is facilitated to\nfully utilize the prompted information by prompt multi-label loss and auxiliary\ndetection head. In addition to text prompts, we have designed two practical\nconcept prompt generation methods, visual prompt and optimized prompt, to\nextract abstract concepts through concrete visual examples and stably reduce\nalignment bias in downstream tasks. With these effective designs, CP-DETR\ndemonstrates superior universal detection performance in a broad spectrum of\nscenarios. For example, our Swin-T backbone model achieves 47.6 zero-shot AP on\nLVIS, and the Swin-L backbone model achieves 32.2 zero-shot AP on ODinW35.\nFurthermore, our visual prompt generation method achieves 68.4 AP on COCO val\nby interactive detection, and the optimized prompt achieves 73.1 fully-shot AP\non ODinW13.", "paper_summary_zh": "<paragraph>最近的通用物体检测研究旨在在 SoTA 闭集检测器中引入语言，然后通过构建用于训练的大规模（文本区域）数据集来概括开放集概念。然而，这些方法面临两个主要挑战：（i）如何有效地使用提示中的先验信息来泛化对象，以及（ii）如何减少下游任务中的对齐偏差，这两者都会导致在某些超出预训练的场景中出现次优性能。为了应对这些挑战，我们提出了一个名为 CP-DETR 的强大的通用检测基础模型，该模型在几乎所有场景中都具有竞争力，并且只有一个预训练权重。具体来说，我们设计了一个高效的提示视觉混合编码器，它通过按比例融合模块和多尺度融合模块增强了提示和视觉之间的信息交互。然后，通过提示多标签损失和辅助检测头，促进混合编码器充分利用提示信息。除了文本提示之外，我们还设计了两种实用的概念提示生成方法，即视觉提示和优化提示，以通过具体的视觉示例提取抽象概念并稳定地减少下游任务中的对齐偏差。通过这些有效的设计，CP-DETR 在广泛的场景中展示了卓越的通用检测性能。例如，我们的 Swin-T 主干模型在 LVIS 上实现了 47.6 的零次 AP，而 Swin-L 主干模型在 ODinW35 上实现了 32.2 的零次 AP。此外，我们的视觉提示生成方法通过交互式检测在 COCO val 上实现了 68.4 AP，而优化提示在 ODinW13 上实现了 73.1 的全次 AP。</paragraph>", "author": "Qibo Chen et.al.", "authors": "Qibo Chen, Weizhong Jin, Jianyue Ge, Mengdi Liu, Yuchao Yan, Jian Jiang, Li Yu, Xuanjiang Guo, Shuchang Li, Jianzhong Chen", "id": "2412.09799v1", "paper_url": "http://arxiv.org/abs/2412.09799v1", "repo": "null"}}