{"2408.15710": {"publish_time": "2024-08-28", "title": "Conan-embedding: General Text Embedding with More and Better Negative Samples", "paper_summary": "With the growing popularity of RAG, the capabilities of embedding models are\ngaining increasing attention. Embedding models are primarily trained through\ncontrastive loss learning, with negative examples being a key component.\nPrevious work has proposed various hard negative mining strategies, but these\nstrategies are typically employed as preprocessing steps. In this paper, we\npropose the conan-embedding model, which maximizes the utilization of more and\nhigher-quality negative examples. Specifically, since the model's ability to\nhandle preprocessed negative examples evolves during training, we propose\ndynamic hard negative mining method to expose the model to more challenging\nnegative examples throughout the training process. Secondly, contrastive\nlearning requires as many negative examples as possible but is limited by GPU\nmemory constraints. Therefore, we use a Cross-GPU balancing Loss to provide\nmore negative examples for embedding training and balance the batch size across\nmultiple tasks. Moreover, we also discovered that the prompt-response pairs\nfrom LLMs can be used for embedding training. Our approach effectively enhances\nthe capabilities of embedding models, currently ranking first on the Chinese\nleaderboard of Massive text embedding benchmark", "paper_summary_zh": "随着 RAG 的日益普及，嵌入模型的能力正受到越来越多的关注。嵌入模型主要通过对比损失学习进行训练，负面示例是一个关键组成部分。以前的工作提出了各种困难的负面挖掘策略，但这些策略通常被用作预处理步骤。在本文中，我们提出了 conan 嵌入模型，它最大限度地利用了更多和更高质量的负面示例。具体来说，由于模型处理预处理负面示例的能力在训练过程中不断发展，我们提出了动态困难负面挖掘方法，以在整个训练过程中将模型暴露于更具挑战性的负面示例。其次，对比学习需要尽可能多的负面示例，但受到 GPU 内存限制。因此，我们使用跨 GPU 平衡损失来为嵌入训练提供更多负面示例，并在多个任务中平衡批处理大小。此外，我们还发现 LLM 中的提示响应对可用于嵌入训练。我们的方法有效地增强了嵌入模型的能力，目前在中文大规模文本嵌入基准测试排行榜中排名第一", "author": "Shiyu Li et.al.", "authors": "Shiyu Li, Yang Tang, Shizhe Chen, Xi Chen", "id": "2408.15710v1", "paper_url": "http://arxiv.org/abs/2408.15710v1", "repo": "null"}}