{"2407.02884": {"publish_time": "2024-07-03", "title": "Complex Event Recognition with Symbolic Register Transducers: Extended Technical Report", "paper_summary": "We present a system for Complex Event Recognition (CER) based on automata.\nWhile multiple such systems have been described in the literature, they\ntypically suffer from a lack of clear and denotational semantics, a limitation\nwhich often leads to confusion with respect to their expressive power. In order\nto address this issue, our system is based on an automaton model which is a\ncombination of symbolic and register automata. We extend previous work on these\ntypes of automata, in order to construct a formalism with clear semantics and a\ncorresponding automaton model whose properties can be formally investigated. We\ncall such automata Symbolic Register Transducers (SRT). We show that SRT are\nclosed under various operators, but are not in general closed under complement\nand they are not determinizable. However, they are closed under these\noperations when a window operator, quintessential in Complex Event Recognition,\nis used. We show how SRT can be used in CER in order to detect patterns upon\nstreams of events, using our framework that provides declarative and\ncompositional semantics, and that allows for a systematic treatment of such\nautomata. For SRT to work in pattern detection, we allow them to mark events\nfrom the input stream as belonging to a complex event or not, hence the name\n\"transducers\". We also present an implementation of SRT which can perform CER.\nWe compare our SRT-based CER engine against other state-of-the-art CER systems\nand show that it is both more expressive and more efficient.", "paper_summary_zh": "<paragraph>我們提出一個基於自動機的複雜事件辨識 (CER) 系統。\n儘管文獻中已描述過多個此類系統，但它們通常缺乏明確且可表示的語意，此限制通常會導致對其表達能力產生混淆。為了解決此問題，我們的系統基於自動機模型，該模型結合了符號自動機和暫存器自動機。我們擴展了對這些類型自動機的先前研究，以便建構具有明確語意且對應的自動機模型，其屬性可以正式研究。我們稱此類自動機為符號暫存器轉換器 (SRT)。我們證明 SRT 在各種運算元下是封閉的，但通常在補數下並非封閉，而且不可確定。然而，當使用在複雜事件辨識中至關重要的視窗運算元時，它們在這些運算下是封閉的。我們展示如何使用 SRT 在 CER 中偵測事件串流上的模式，使用我們提供的宣告式和組合式語意架構，並允許系統化處理此類自動機。為了讓 SRT 在模式偵測中運作，我們允許它們將輸入串流中的事件標記為屬於複雜事件或不屬於複雜事件，因此稱為「轉換器」。我們也提出一個可以執行 CER 的 SRT 實作。我們將我們基於 SRT 的 CER 引擎與其他最先進的 CER 系統進行比較，並證明它既更具表達力又更有效率。</paragraph>", "author": "Elias Alevizos et.al.", "authors": "Elias Alevizos, Alexander Artikis, Georgios Paliouras", "id": "2407.02884v1", "paper_url": "http://arxiv.org/abs/2407.02884v1", "repo": "https://github.com/elalev/cer-srt"}}