{"2407.04652": {"publish_time": "2024-07-05", "title": "Pretraining End-to-End Keyword Search with Automatically Discovered Acoustic Units", "paper_summary": "End-to-end (E2E) keyword search (KWS) has emerged as an alternative and\ncomplimentary approach to conventional keyword search which depends on the\noutput of automatic speech recognition (ASR) systems. While E2E methods greatly\nsimplify the KWS pipeline, they generally have worse performance than their\nASR-based counterparts, which can benefit from pretraining with untranscribed\ndata. In this work, we propose a method for pretraining E2E KWS systems with\nuntranscribed data, which involves using acoustic unit discovery (AUD) to\nobtain discrete units for untranscribed data and then learning to locate\nsequences of such units in the speech. We conduct experiments across languages\nand AUD systems: we show that finetuning such a model significantly outperforms\na model trained from scratch, and the performance improvements are generally\ncorrelated with the quality of the AUD system used for pretraining.", "paper_summary_zh": "端對端 (E2E) 關鍵字搜尋 (KWS) 已成為一種替代且互補的方法，用於傳統關鍵字搜尋，後者取決於自動語音辨識 (ASR) 系統的輸出。雖然 E2E 方法極大地簡化了 KWS 管線，但它們通常比其基於 ASR 的對應方法效能較差，而基於 ASR 的對應方法可以受益於未轉錄資料的預訓練。在這項工作中，我們提出了一種使用未轉錄資料預訓練 E2E KWS 系統的方法，其中涉及使用音響單位發現 (AUD) 來取得未轉錄資料的離散單位，然後學習在語音中找到此類單位的序列。我們跨語言和 AUD 系統進行實驗：我們顯示微調此類模型的效能顯著優於從頭開始訓練的模型，而效能改善通常與用於預訓練的 AUD 系統的品質相關。", "author": "Bolaji Yusuf et.al.", "authors": "Bolaji Yusuf, Jan \"Honza\" Černocký, Murat Saraçlar", "id": "2407.04652v1", "paper_url": "http://arxiv.org/abs/2407.04652v1", "repo": "https://github.com/beer-asr/beer"}}