{"2406.15888": {"publish_time": "2024-06-22", "title": "Real-time Speech Summarization for Medical Conversations", "paper_summary": "In doctor-patient conversations, identifying medically relevant information\nis crucial, posing the need for conversation summarization. In this work, we\npropose the first deployable real-time speech summarization system for\nreal-world applications in industry, which generates a local summary after\nevery N speech utterances within a conversation and a global summary after the\nend of a conversation. Our system could enhance user experience from a business\nstandpoint, while also reducing computational costs from a technical\nperspective. Secondly, we present VietMed-Sum which, to our knowledge, is the\nfirst speech summarization dataset for medical conversations. Thirdly, we are\nthe first to utilize LLM and human annotators collaboratively to create gold\nstandard and synthetic summaries for medical conversation summarization.\nFinally, we present baseline results of state-of-the-art models on VietMed-Sum.\nAll code, data (English-translated and Vietnamese) and models are available\nonline: https://github.com/leduckhai/MultiMed", "paper_summary_zh": "在醫生和病人的對話中，識別與醫療相關的資訊至關重要，這提出了對話摘要的需求。在這項工作中，我們提出了第一個可部署的即時語音摘要系統，用於產業中的真實世界應用，它會在對話中的每 N 個語音發話後產生一個局部摘要，並在對話結束後產生一個全局摘要。我們的系統可以從商業角度提升使用者體驗，同時從技術角度降低運算成本。其次，我們提出了 VietMed-Sum，據我們所知，這是第一個針對醫療對話的語音摘要資料集。第三，我們是第一個利用 LLM 和人工標註者協作，為醫療對話摘要建立黃金標準和合成摘要。最後，我們提出了 VietMed-Sum 上最先進模型的基準結果。所有程式碼、資料（已翻譯成英文和越南語）和模型都可以在線上取得：https://github.com/leduckhai/MultiMed", "author": "Khai Le-Duc et.al.", "authors": "Khai Le-Duc, Khai-Nguyen Nguyen, Long Vo-Dang, Truong-Son Hy", "id": "2406.15888v1", "paper_url": "http://arxiv.org/abs/2406.15888v1", "repo": "https://github.com/leduckhai/multimed"}}