{"2408.06732": {"publish_time": "2024-08-13", "title": "Exploring the anatomy of articulation rate in spontaneous English speech: relationships between utterance length effects and social factors", "paper_summary": "Speech rate has been shown to vary across social categories such as gender,\nage, and dialect, while also being conditioned by properties of speech\nplanning. The effect of utterance length, where speech rate is faster and less\nvariable for longer utterances, has also been shown to reduce the role of\nsocial factors once it has been accounted for, leaving unclear the relationship\nbetween social factors and speech production in conditioning speech rate.\nThrough modelling of speech rate across 13 English speech corpora, it is found\nthat utterance length has the largest effect on speech rate, though this effect\nitself varies little across corpora and speakers. While age and gender also\nmodulate speech rate, their effects are much smaller in magnitude. These\nfindings suggest utterance length effects may be conditioned by articulatory\nand perceptual constraints, and that social influences on speech rate should be\ninterpreted in the broader context of how speech rate variation is structured.", "paper_summary_zh": "語速已證實會因性別、年齡和方言等社會類別而有所不同，同時也受說話計畫的屬性制約。已證實，語句長度（語速較快且變異較小）的效果會降低社會因素在考量後所扮演的角色，使社會因素與說話生產在制約語速之間的關係不明確。透過對 13 個英語語料庫的語速建模，發現語句長度對語速的影響最大，儘管此效果本身在語料庫和說話者之間的差異很小。雖然年齡和性別也會調節語速，但其影響在幅度上小得多。這些發現表明語句長度效應可能受發音和感知約束的制約，並且應在語速變化如何構成的更廣泛背景下解釋語速的社會影響。", "author": "James Tanner et.al.", "authors": "James Tanner, Morgan Sonderegger, Jane Stuart-Smith, Tyler Kendall, Jeff Mielke, Robin Dodsworth, Erik Thomas", "id": "2408.06732v1", "paper_url": "http://arxiv.org/abs/2408.06732v1", "repo": "null"}}