{"2410.14257": {"publish_time": "2024-10-18", "title": "Revisiting SLO and Goodput Metrics in LLM Serving", "paper_summary": "Large language models (LLMs) have achieved remarkable performance and are\nwidely deployed in various applications, while the serving of LLM inference has\nraised concerns about user experience and serving throughput. Accordingly,\nservice level objectives (SLOs) and goodput-the number of requests that meet\nSLOs per second-are introduced to evaluate the performance of LLM serving.\nHowever, existing metrics fail to capture the nature of user experience. We\nobserve two ridiculous phenomena in existing metrics: 1) delaying token\ndelivery can smooth the tail time between tokens (tail TBT) of a request and 2)\ndropping the request that fails to meet the SLOs midway can improve goodput.\n  In this paper, we revisit SLO and goodput metrics in LLM serving and propose\na unified metric framework smooth goodput including SLOs and goodput to reflect\nthe nature of user experience in LLM serving. The framework can adapt to\nspecific goals of different tasks by setting parameters. We re-evaluate the\nperformance of different LLM serving systems under multiple workloads based on\nthis unified framework and provide possible directions for future optimization\nof existing strategies. We hope that this framework can provide a unified\nstandard for evaluating LLM serving and foster researches in the field of LLM\nserving optimization to move in a cohesive direction.", "paper_summary_zh": "大型語言模型 (LLM) 已取得卓越的效能，並廣泛部署於各種應用程式中，而 LLM 推論的服務已引發對使用者體驗和服務傳輸量的疑慮。因此，服務等級目標 (SLO) 和傳輸量（每秒符合 SLO 的請求數量）被引入以評估 LLM 服務的效能。然而，現有的指標無法捕捉使用者體驗的本質。我們在現有的指標中觀察到兩個荒謬的現象：1) 延遲令牌傳遞可以平滑請求的令牌之間的尾端時間 (tail TBT)，2) 放棄無法滿足 SLO 的請求可以改善傳輸量。在本文中，我們重新檢視 LLM 服務中的 SLO 和傳輸量指標，並提出一個統一的指標架構平滑傳輸量，包括 SLO 和傳輸量，以反映 LLM 服務中使用者體驗的本質。該架構可以透過設定參數來適應不同任務的特定目標。我們根據這個統一的架構，在多個工作負載下重新評估不同 LLM 服務系統的效能，並為現有策略的未來最佳化提供可能的方針。我們希望這個架構可以為評估 LLM 服務提供一個統一的標準，並促進 LLM 服務最佳化領域的研究朝向一個一致的方向前進。", "author": "Zhibin Wang et.al.", "authors": "Zhibin Wang, Shipeng Li, Yuhang Zhou, Xue Li, Rong Gu, Nguyen Cam-Tu, Chen Tian, Sheng Zhong", "id": "2410.14257v1", "paper_url": "http://arxiv.org/abs/2410.14257v1", "repo": "null"}}