{"2501.04070": {"publish_time": "2025-01-07", "title": "More is not always better? Enhancing Many-Shot In-Context Learning with Differentiated and Reweighting Objectives", "paper_summary": "Large language models (LLMs) excel at few-shot in-context learning (ICL)\nwithout requiring parameter updates. However, as the number of ICL\ndemonstrations increases from a few to many, performance tends to plateau and\neventually decline. We identify two primary causes for this trend: the\nsuboptimal negative log-likelihood (NLL) optimization objective and the\nincremental data noise. To address these issues, we introduce DR-ICL, a novel\noptimization method that enhances model performance through Differentiated\nLearning and advantage-based Reweighting objectives. Globally, DR-ICL utilizes\ndifferentiated learning to optimize the NLL objective, ensuring that many-shot\nperformance surpasses zero-shot levels. Locally, it dynamically adjusts the\nweighting of many-shot demonstrations by leveraging cumulative advantages\ninspired by reinforcement learning, thereby improving generalization. This\napproach allows the model to handle varying numbers of shots effectively,\nmitigating the impact of noisy data. Recognizing the lack of multi-task\ndatasets with diverse many-shot distributions, we develop the Many-Shot ICL\nBenchmark (MICLB)-a large-scale benchmark covering shot numbers from 1 to 350\nwithin sequences of up to 8,000 tokens-for fine-tuning purposes. MICLB\nfacilitates the evaluation of many-shot ICL strategies across seven prominent\nNLP tasks and 50 distinct datasets. Experimental results demonstrate that LLMs\nenhanced with DR-ICL achieve significant improvements in many-shot setups\nacross various tasks, including both in-domain and out-of-domain scenarios. We\nrelease the code and benchmark dataset hoping to facilitate further research in\nmany-shot ICL.", "paper_summary_zh": "大型語言模型 (LLM) 在不需要參數更新的情況下，擅長於少次數的脈絡學習 (ICL)。然而，隨著 ICL 示範的數量從少數增加到多數，效能往往會達到停滯狀態，甚至最終下降。我們找出此趨勢的兩個主要原因：次佳負對數似然 (NLL) 最佳化目標以及漸增資料雜訊。為了解決這些問題，我們引入了 DR-ICL，這是一種創新的最佳化方法，可透過差異化學習和基於優勢的重新加權目標來增強模型效能。在整體上，DR-ICL 利用差異化學習來最佳化 NLL 目標，確保多樣本效能超越零樣本層級。在局部上，它透過運用強化學習所啟發的累積優勢，動態調整多樣本示範的加權，進而改善概化能力。此方法讓模型能夠有效處理不同數量的樣本，並減輕雜訊資料的影響。鑑於缺乏具有多樣化多樣本分佈的多任務資料集，我們開發了多樣本 ICL 基準 (MICLB)，這是一個大規模基準，涵蓋 1 到 350 個樣本的數目，序列長度達 8,000 個符號，用於微調目的。MICLB 便於評估七項重要的 NLP 任務和 50 個不同資料集的多樣本 ICL 策略。實驗結果顯示，透過 DR-ICL 增強的 LLM 在多樣本設定中獲得顯著的改善，涵蓋各種任務，包括域內和域外場景。我們釋出程式碼和基準資料集，希望能促進多樣本 ICL 的進一步研究。", "author": "Xiaoqing Zhang et.al.", "authors": "Xiaoqing Zhang, Ang Lv, Yuhan Liu, Flood Sung, Wei Liu, Shuo Shang, Xiuying Chen, Rui Yan", "id": "2501.04070v1", "paper_url": "http://arxiv.org/abs/2501.04070v1", "repo": "null"}}