{"2504.19918": {"publish_time": "2025-04-28", "title": "Enhancing Surgical Documentation through Multimodal Visual-Temporal Transformers and Generative AI", "paper_summary": "The automatic summarization of surgical videos is essential for enhancing\nprocedural documentation, supporting surgical training, and facilitating\npost-operative analysis. This paper presents a novel method at the intersection\nof artificial intelligence and medicine, aiming to develop machine learning\nmodels with direct real-world applications in surgical contexts. We propose a\nmulti-modal framework that leverages recent advancements in computer vision and\nlarge language models to generate comprehensive video summaries. % The approach\nis structured in three key stages. First, surgical videos are divided into\nclips, and visual features are extracted at the frame level using visual\ntransformers. This step focuses on detecting tools, tissues, organs, and\nsurgical actions. Second, the extracted features are transformed into\nframe-level captions via large language models. These are then combined with\ntemporal features, captured using a ViViT-based encoder, to produce clip-level\nsummaries that reflect the broader context of each video segment. Finally, the\nclip-level descriptions are aggregated into a full surgical report using a\ndedicated LLM tailored for the summarization task. % We evaluate our method on\nthe CholecT50 dataset, using instrument and action annotations from 50\nlaparoscopic videos. The results show strong performance, achieving 96\\%\nprecision in tool detection and a BERT score of 0.74 for temporal context\nsummarization. This work contributes to the advancement of AI-assisted tools\nfor surgical reporting, offering a step toward more intelligent and reliable\nclinical documentation.", "paper_summary_zh": "<paragraph>自動摘要手術影片對於增強手術記錄、支援手術訓練和促進術後分析至關重要。本文提出了一種人工智慧和醫學交叉領域的新方法，旨在開發在手術環境中具有直接現實應用價值的機器學習模型。我們提出了一個多模態框架，它利用電腦視覺和大型語言模型的最新進展來生成全面的影片摘要。 % 該方法分為三個關鍵階段。首先，將手術影片分割成片段，並使用視覺轉換器在幀級別提取視覺特徵。此步驟側重於檢測工具、組織、器官和手術動作。其次，透過大型語言模型將提取的特徵轉換為幀級別的描述字幕。然後將這些描述字幕與使用基於 ViViT 的編碼器擷取的時間特徵相結合，以生成反映每個影片片段更廣泛背景的片段級別摘要。最後，使用專為摘要任務量身定制的專用大型語言模型將片段級別的描述彙總成完整的手術報告。 % 我們使用來自 50 個腹腔鏡手術影片的器械和動作註釋，在 CholecT50 資料集上評估了我們的方法。結果顯示出強大的效能，在工具檢測方面達到了 96% 的精準度，在時間上下文摘要方面達到了 0.74 的 BERT 分數。這項工作有助於推動用於手術報告的 AI 輔助工具的發展，朝著更智慧、更可靠的臨床記錄邁進了一步。</paragraph>\n", "author": "Hugo Georgenthum et.al.", "authors": "Hugo Georgenthum, Cristian Cosentino, Fabrizio Marozzo, Pietro Liò", "id": "2504.19918v1", "paper_url": "http://arxiv.org/abs/2504.19918v1", "repo": "null"}}