{"2411.02762": {"publish_time": "2024-11-05", "title": "EcoCropsAID: Economic Crops Aerial Image Dataset for Land Use Classification", "paper_summary": "The EcoCropsAID dataset is a comprehensive collection of 5,400 aerial images\ncaptured between 2014 and 2018 using the Google Earth application. This dataset\nfocuses on five key economic crops in Thailand: rice, sugarcane, cassava,\nrubber, and longan. The images were collected at various crop growth stages:\nearly cultivation, growth, and harvest, resulting in significant variability\nwithin each category and similarities across different categories. These\nvariations, coupled with differences in resolution, color, and contrast\nintroduced by multiple remote imaging sensors, present substantial challenges\nfor land use classification. The dataset is an interdisciplinary resource that\nspans multiple research domains, including remote sensing, geoinformatics,\nartificial intelligence, and computer vision. The unique features of the\nEcoCropsAID dataset offer opportunities for researchers to explore novel\napproaches, such as extracting spatial and temporal features, developing deep\nlearning architectures, and implementing transformer-based models. The\nEcoCropsAID dataset provides a valuable platform for advancing research in land\nuse classification, with implications for optimizing agricultural practices and\nenhancing sustainable development. This study explicitly investigates the use\nof deep learning algorithms to classify economic crop areas in northeastern\nThailand, utilizing satellite imagery to address the challenges posed by\ndiverse patterns and similarities across categories.", "paper_summary_zh": "EcoCropsAID 資料集是一個全面的資料集，包含 5,400 張航拍影像，使用 Google Earth 應用程式於 2014 年至 2018 年間拍攝。這個資料集著重於泰國的五大經濟作物：稻米、甘蔗、木薯、橡膠和龍眼。影像在不同作物生長階段收集：早期耕作、生長和收成，導致每個類別內部有顯著的變異性，以及不同類別之間的相似性。這些變異，加上多個遙測感測器所帶來的解析度、顏色和對比差異，為土地利用分類帶來極大的挑戰。這個資料集是一個跨領域的資源，涵蓋多個研究領域，包括遙測、地理資訊學、人工智慧和電腦視覺。EcoCropsAID 資料集的獨特特點為研究人員提供了探索新方法的機會，例如萃取空間和時間特徵、開發深度學習架構，以及實作基於Transformer的模型。EcoCropsAID 資料集提供了一個有價值的平台，用於推進土地利用分類的研究，對最佳化農業實務和加強永續發展有影響。本研究明確地探討使用深度學習演算法來分類泰國東北部的經濟作物區，利用衛星影像來解決不同類別之間模式多樣和相似性所帶來的挑戰。", "author": "Sangdaow Noppitak et.al.", "authors": "Sangdaow Noppitak, Emmanuel Okafor, Olarik Surinta", "id": "2411.02762v1", "paper_url": "http://arxiv.org/abs/2411.02762v1", "repo": "null"}}