{"2405.04095": {"publish_time": "2024-05-07", "title": "Going Proactive and Explanatory Against Malware Concept Drift", "paper_summary": "Deep learning-based malware classifiers face significant challenges due to\nconcept drift. The rapid evolution of malware, especially with new families,\ncan depress classification accuracy to near-random levels. Previous research\nhas primarily focused on detecting drift samples, relying on expert-led\nanalysis and labeling for model retraining. However, these methods often lack a\ncomprehensive understanding of malware concepts and provide limited guidance\nfor effective drift adaptation, leading to unstable detection performance and\nhigh human labeling costs.\n  To address these limitations, we introduce DREAM, a novel system designed to\nsurpass the capabilities of existing drift detectors and to establish an\nexplanatory drift adaptation process. DREAM enhances drift detection through\nmodel sensitivity and data autonomy. The detector, trained in a semi-supervised\napproach, proactively captures malware behavior concepts through classifier\nfeedback. During testing, it utilizes samples generated by the detector itself,\neliminating reliance on extensive training data. For drift adaptation, DREAM\nenlarges human intervention, enabling revisions of malware labels and concept\nexplanations embedded within the detector's latent space. To ensure a\ncomprehensive response to concept drift, it facilitates a coordinated update\nprocess for both the classifier and the detector. Our evaluation shows that\nDREAM can effectively improve the drift detection accuracy and reduce the\nexpert analysis effort in adaptation across different malware datasets and\nclassifiers.", "paper_summary_zh": "深度學習惡意軟體分類器會因概念漂移而面臨重大挑戰。惡意軟體的快速演變，尤其是新系列的惡意軟體，可能會將分類準確度降低到接近隨機的程度。先前的研究主要專注於偵測漂移樣本，依賴於專家主導的分析和標記進行模型再訓練。然而，這些方法通常缺乏對惡意軟體概念的全面理解，且僅提供有限的指導方針來有效適應漂移，導致不穩定的偵測效能和高昂的人工標記成本。\n為了解決這些限制，我們引進 DREAM，這是一個新穎的系統，旨在超越現有漂移偵測器的功能，並建立一個解釋性的漂移適應流程。DREAM 透過模型敏感度和資料自主性來增強漂移偵測。偵測器以半監督式方法訓練，透過分類器回饋主動擷取惡意軟體行為概念。在測試期間，它利用偵測器本身產生的樣本，消除了對大量訓練資料的依賴。對於漂移適應，DREAM 擴大了人工介入，讓標記和概念解釋可以嵌入偵測器的潛在空間中。為了確保對概念漂移做出全面回應，它促進了分類器和偵測器的協調更新流程。我們的評估顯示，DREAM 可以有效地提高漂移偵測準確度，並減少不同惡意軟體資料集和分類器在適應中的專家分析工作。", "author": "Yiling He et.al.", "authors": "Yiling He, Junchi Lei, Zhan Qin, Kui Ren", "id": "2405.04095v1", "paper_url": "http://arxiv.org/abs/2405.04095v1", "repo": "null"}}