{"2501.12433": {"publish_time": "2025-01-21", "title": "Owls are wise and foxes are unfaithful: Uncovering animal stereotypes in vision-language models", "paper_summary": "Animal stereotypes are deeply embedded in human culture and language. They\noften shape our perceptions and expectations of various species. Our study\ninvestigates how animal stereotypes manifest in vision-language models during\nthe task of image generation. Through targeted prompts, we explore whether\nDALL-E perpetuates stereotypical representations of animals, such as \"owls as\nwise,\" \"foxes as unfaithful,\" etc. Our findings reveal significant stereotyped\ninstances where the model consistently generates images aligned with cultural\nbiases. The current work is the first of its kind to examine animal\nstereotyping in vision-language models systematically and to highlight a\ncritical yet underexplored dimension of bias in AI-generated visual content.", "paper_summary_zh": "動物刻板印象深深植根於人類文化和語言中。它們\n通常塑造我們對各種物種的看法和期望。我們的研究\n探討了在影像生成任務中，動物刻板印象如何在視覺語言模型中顯現。透過有針對性的提示，我們探討\nDALL-E 是否延續了動物的刻板印象，例如「貓頭鷹是明智的」、「狐狸是不忠誠的」等。我們的發現揭示了顯著的刻板印象，其中該模型始終生成與文化\n偏見一致的影像。目前的研究是同類型研究中第一個系統性地檢視視覺語言模型中的動物刻板印象，並強調 AI 生成的視覺內容中一個關鍵但未充分探討的偏見面向。", "author": "Tabinda Aman et.al.", "authors": "Tabinda Aman, Mohammad Nadeem, Shahab Saquib Sohail, Mohammad Anas, Erik Cambria", "id": "2501.12433v1", "paper_url": "http://arxiv.org/abs/2501.12433v1", "repo": "null"}}