{"2502.17132": {"publish_time": "2025-02-24", "title": "Applications of Large Models in Medicine", "paper_summary": "This paper explores the advancements and applications of large-scale models\nin the medical field, with a particular focus on Medical Large Models (MedLMs).\nThese models, encompassing Large Language Models (LLMs), Vision Models, 3D\nLarge Models, and Multimodal Models, are revolutionizing healthcare by\nenhancing disease prediction, diagnostic assistance, personalized treatment\nplanning, and drug discovery. The integration of graph neural networks in\nmedical knowledge graphs and drug discovery highlights the potential of Large\nGraph Models (LGMs) in understanding complex biomedical relationships. The\nstudy also emphasizes the transformative role of Vision-Language Models (VLMs)\nand 3D Large Models in medical image analysis, anatomical modeling, and\nprosthetic design. Despite the challenges, these technologies are setting new\nbenchmarks in medical innovation, improving diagnostic accuracy, and paving the\nway for personalized healthcare solutions. This paper aims to provide a\ncomprehensive overview of the current state and future directions of large\nmodels in medicine, underscoring their significance in advancing global health.", "paper_summary_zh": "本文探討大規模模型在醫療領域的進展和應用，特別關注醫療大模型 (MedLM)。這些模型包含大型語言模型 (LLM)、視覺模型、3D 大型模型和多模態模型，它們透過增強疾病預測、診斷輔助、個人化治療規劃和藥物發現，徹底改變了醫療保健。將圖神經網路整合到醫學知識圖譜和藥物發現中，突顯了大型圖模型 (LGM) 在理解複雜生物醫學關係方面的潛力。這項研究也強調了視覺語言模型 (VLM) 和 3D 大型模型在醫學影像分析、解剖建模和義肢設計中的轉型角色。儘管面臨挑戰，這些技術仍在醫療創新中樹立了新的基準，提高了診斷準確性，並為個人化醫療保健解決方案鋪路。本文旨在提供大模型在醫學中的現狀和未來方向的全面概述，強調它們在促進全球健康方面的意義。", "author": "YunHe Su et.al.", "authors": "YunHe Su, Zhengyang Lu, Junhui Liu, Ke Pang, Haoran Dai, Sa Liu Yuxin Jia, Lujia Ge, Jing-min Yang", "id": "2502.17132v1", "paper_url": "http://arxiv.org/abs/2502.17132v1", "repo": "null"}}