{"2412.17963": {"publish_time": "2024-12-23", "title": "Path-of-Thoughts: Extracting and Following Paths for Robust Relational Reasoning with Large Language Models", "paper_summary": "Large language models (LLMs) possess vast semantic knowledge but often\nstruggle with complex reasoning tasks, particularly in relational reasoning\nproblems such as kinship or spatial reasoning. In this paper, we present\nPath-of-Thoughts (PoT), a novel framework designed to tackle relation reasoning\nby decomposing the task into three key stages: graph extraction, path\nidentification, and reasoning. Unlike previous approaches, PoT efficiently\nextracts a task-agnostic graph that identifies crucial entities, relations, and\nattributes within the problem context. Subsequently, PoT identifies relevant\nreasoning chains within the graph corresponding to the posed question,\nfacilitating inference of potential answers. Experimental evaluations on four\nbenchmark datasets, demanding long reasoning chains, demonstrate that PoT\nsurpasses state-of-the-art baselines by a significant margin (maximum 21.3%)\nwithout necessitating fine-tuning or extensive LLM calls. Furthermore, as\nopposed to prior neuro-symbolic methods, PoT exhibits improved resilience\nagainst LLM errors by leveraging the compositional nature of graphs.", "paper_summary_zh": "大型語言模型 (LLM) 擁有廣泛的語義知識，但在複雜的推理任務中經常遇到困難，特別是在關係推理問題中，例如親屬關係或空間推理。在本文中，我們提出思考路徑 (PoT)，這是一個新穎的框架，旨在通過將任務分解為三個關鍵階段來解決關係推理：圖形提取、路徑識別和推理。與之前的做法不同，PoT 有效地提取了一個與任務無關的圖形，該圖形識別了問題背景中的關鍵實體、關係和屬性。隨後，PoT 在與所提出的問題相應的圖形中識別出相關的推理鏈，從而推斷出潛在答案。在需要長推理鏈的四個基準數據集上的實驗評估表明，PoT 以顯著的優勢（最大 21.3%）超越了最先進的基準，而無需微調或廣泛的 LLM 調用。此外，與先前的神經符號方法相反，PoT 通過利用圖形的組合特性表現出對 LLM 錯誤的增強的彈性。", "author": "Ge Zhang et.al.", "authors": "Ge Zhang, Mohammad Ali Alomrani, Hongjian Gu, Jiaming Zhou, Yaochen Hu, Bin Wang, Qun Liu, Mark Coates, Yingxue Zhang, Jianye Hao", "id": "2412.17963v1", "paper_url": "http://arxiv.org/abs/2412.17963v1", "repo": "null"}}