{"2409.07547": {"publish_time": "2024-09-11", "title": "Machine Learning and Constraint Programming for Efficient Healthcare Scheduling", "paper_summary": "Solving combinatorial optimization problems involve satisfying a set of hard\nconstraints while optimizing some objectives. In this context, exact or\napproximate methods can be used. While exact methods guarantee the optimal\nsolution, they often come with an exponential running time as opposed to\napproximate methods that trade the solutions quality for a better running time.\nIn this context, we tackle the Nurse Scheduling Problem (NSP). The NSP consist\nin assigning nurses to daily shifts within a planning horizon such that\nworkload constraints are satisfied while hospitals costs and nurses preferences\nare optimized. To solve the NSP, we propose implicit and explicit approaches.\nIn the implicit solving approach, we rely on Machine Learning methods using\nhistorical data to learn and generate new solutions through the constraints and\nobjectives that may be embedded in the learned patterns. To quantify the\nquality of using our implicit approach in capturing the embedded constraints\nand objectives, we rely on the Frobenius Norm, a quality measure used to\ncompute the average error between the generated solutions and historical data.\nTo compensate for the uncertainty related to the implicit approach given that\nthe constraints and objectives may not be concretely visible in the produced\nsolutions, we propose an alternative explicit approach where we first model the\nNSP using the Constraint Satisfaction Problem (CSP) framework. Then we develop\nStochastic Local Search methods and a new Branch and Bound algorithm enhanced\nwith constraint propagation techniques and variables/values ordering\nheuristics. Since our implicit approach may not guarantee the feasibility or\noptimality of the generated solution, we propose a data-driven approach to\npassively learn the NSP as a constraint network. The learned constraint\nnetwork, formulated as a CSP, will then be solved using the methods we listed\nearlier.", "paper_summary_zh": "<paragraph>解決組合最佳化問題涉及滿足一組硬約束，同時最佳化一些目標。在此背景下，可以使用精確或近似方法。盡管精確方法保證最佳解，但與近似方法相比，它們通常具有指數級運行時間，而近似方法則以解決方案質量換取更好的運行時間。在此背景下，我們解決了護士排班問題 (NSP)。NSP 包括在規劃範圍內將護士分配到每日輪班，以便滿足工作負載約束，同時優化醫院成本和護士偏好。為了解決 NSP，我們提出了隱式和顯式方法。在隱式求解方法中，我們依賴機器學習方法，使用歷史數據通過約束和可能嵌入在學習模式中的目標來學習和生成新的解決方案。為了量化使用我們的隱式方法捕獲嵌入約束和目標的質量，我們依賴於 Frobenius 範數，這是一種用於計算生成解決方案和歷史數據之間平均誤差的質量度量。為了彌補與隱式方法相關的不確定性，因為約束和目標可能在產生的解決方案中並不明確可見，我們提出了一種替代的顯式方法，其中我們首先使用約束滿足問題 (CSP) 框架對 NSP 進行建模。然後，我們開發了隨機局部搜索方法和一種新的分支定界算法，並增強了約束傳播技術和變量/值排序啟發式方法。由於我們的隱式方法可能無法保證生成解決方案的可行性或最優性，因此我們提出了一種數據驅動的方法來被動地將 NSP 作為約束網絡進行學習。然後，將學習到的約束網絡（以 CSP 的形式制定）使用我們前面列出的方法進行求解。</paragraph>", "author": "Aymen Ben Said et.al.", "authors": "Aymen Ben Said, Malek Mouhoub", "id": "2409.07547v1", "paper_url": "http://arxiv.org/abs/2409.07547v1", "repo": "null"}}