{"2411.02118": {"publish_time": "2024-11-04", "title": "Grounding Emotional Descriptions to Electrovibration Haptic Signals", "paper_summary": "Designing and displaying haptic signals with sensory and emotional attributes\ncan improve the user experience in various applications. Free-form user\nlanguage provides rich sensory and emotional information for haptic design\n(e.g., ``This signal feels smooth and exciting''), but little work exists on\nlinking user descriptions to haptic signals (i.e., language grounding). To\naddress this gap, we conducted a study where 12 users described the feel of 32\nsignals perceived on a surface haptics (i.e., electrovibration) display. We\ndeveloped a computational pipeline using natural language processing (NLP)\ntechniques, such as GPT-3.5 Turbo and word embedding methods, to extract\nsensory and emotional keywords and group them into semantic clusters (i.e.,\nconcepts). We linked the keyword clusters to haptic signal features (e.g.,\npulse count) using correlation analysis. The proposed pipeline demonstrates the\nviability of a computational approach to analyzing haptic experiences. We\ndiscuss our future plans for creating a predictive model of haptic experience.", "paper_summary_zh": "透過感官和情緒屬性設計和顯示觸覺訊號，可以提升各種應用程式的使用者體驗。自由形式的使用者語言提供豐富的感官和情緒資訊，可用於觸覺設計（例如「這個訊號感覺很平順且令人興奮」），但將使用者描述連結到觸覺訊號（也就是語言基礎）的研究卻很少。為了解決這個問題，我們進行了一項研究，讓 12 位使用者描述在表面觸覺（也就是電振動）顯示器上感知到的 32 個訊號的感覺。我們開發了一條運算管道，使用自然語言處理 (NLP) 技術，例如 GPT-3.5 Turbo 和字詞嵌入方法，來萃取感官和情緒關鍵字，並將它們分組成語義叢集（也就是概念）。我們使用相關分析將關鍵字叢集連結到觸覺訊號特徵（例如脈衝計數）。建議的運算管道展示了分析觸覺體驗的運算方法的可行性。我們討論了建立觸覺體驗預測模型的未來計畫。", "author": "Guimin Hu et.al.", "authors": "Guimin Hu, Zirui Zhao, Lukas Heilmann, Yasemin Vardar, Hasti Seifi", "id": "2411.02118v1", "paper_url": "http://arxiv.org/abs/2411.02118v1", "repo": "null"}}