{"2411.07464": {"publish_time": "2024-11-12", "title": "BudgetMLAgent: A Cost-Effective LLM Multi-Agent system for Automating Machine Learning Tasks", "paper_summary": "Large Language Models (LLMs) excel in diverse applications including\ngeneration of code snippets, but often struggle with generating code for\ncomplex Machine Learning (ML) tasks. Although existing LLM single-agent based\nsystems give varying performance depending on the task complexity, they purely\nrely on larger and expensive models such as GPT-4. Our investigation reveals\nthat no-cost and low-cost models such as Gemini-Pro, Mixtral and CodeLlama\nperform far worse than GPT-4 in a single-agent setting. With the motivation of\ndeveloping a cost-efficient LLM based solution for solving ML tasks, we propose\nan LLM Multi-Agent based system which leverages combination of experts using\nprofiling, efficient retrieval of past observations, LLM cascades, and\nask-the-expert calls. Through empirical analysis on ML engineering tasks in the\nMLAgentBench benchmark, we demonstrate the effectiveness of our system, using\nno-cost models, namely Gemini as the base LLM, paired with GPT-4 in cascade and\nexpert to serve occasional ask-the-expert calls for planning. With 94.2\\%\nreduction in the cost (from \\$0.931 per run cost averaged over all tasks for\nGPT-4 single agent system to \\$0.054), our system is able to yield better\naverage success rate of 32.95\\% as compared to GPT-4 single-agent system\nyielding 22.72\\% success rate averaged over all the tasks of MLAgentBench.", "paper_summary_zh": "大型語言模型（LLM）在各種應用中表現出色，包括產生程式碼片段，但常常在產生複雜機器學習（ML）任務的程式碼時遇到困難。儘管現有的 LLM 單一代理人系統會根據任務複雜度提供不同的效能，但它們完全依賴於較大且昂貴的模型，例如 GPT-4。我們的調查顯示，在單一代理人設定中，無成本和低成本模型（例如 Gemini-Pro、Mixtral 和 CodeLlama）的效能遠低於 GPT-4。在開發一種成本效益高的基於 LLM 的解決方案以解決 ML 任務的動機下，我們提出了一個基於 LLM 多代理人的系統，該系統利用專家組合，使用剖析、有效擷取過去的觀察結果、LLM 串接，以及尋求專家建議的呼叫。透過對 MLAgentBench 基準中的 ML 工程任務進行實證分析，我們展示了我們系統的有效性，使用無成本模型，即 Gemini 作為基礎 LLM，與 GPT-4 串接，並讓專家負責偶爾尋求專家建議的呼叫以進行規劃。我們的系統成本降低了 94.2%（從 GPT-4 單一代理人系統所有任務的平均執行成本 0.931 美元降低到 0.054 美元），能夠產生更好的平均成功率 32.95%，而 GPT-4 單一代理人系統在 MLAgentBench 的所有任務中平均產生 22.72% 的成功率。", "author": "Shubham Gandhi et.al.", "authors": "Shubham Gandhi, Manasi Patwardhan, Lovekesh Vig, Gautam Shroff", "id": "2411.07464v1", "paper_url": "http://arxiv.org/abs/2411.07464v1", "repo": "null"}}