{"2501.18973": {"publish_time": "2025-01-31", "title": "GPO-VAE: Modeling Explainable Gene Perturbation Responses utilizing GRN-Aligned Parameter Optimization", "paper_summary": "Motivation: Predicting cellular responses to genetic perturbations is\nessential for understanding biological systems and developing targeted\ntherapeutic strategies. While variational autoencoders (VAEs) have shown\npromise in modeling perturbation responses, their limited explainability poses\na significant challenge, as the learned features often lack clear biological\nmeaning. Nevertheless, model explainability is one of the most important\naspects in the realm of biological AI. One of the most effective ways to\nachieve explainability is incorporating the concept of gene regulatory networks\n(GRNs) in designing deep learning models such as VAEs. GRNs elicit the\nunderlying causal relationships between genes and are capable of explaining the\ntranscriptional responses caused by genetic perturbation treatments. Results:\nWe propose GPO-VAE, an explainable VAE enhanced by GRN-aligned Parameter\nOptimization that explicitly models gene regulatory networks in the latent\nspace. Our key approach is to optimize the learnable parameters related to\nlatent perturbation effects towards GRN-aligned explainability. Experimental\nresults on perturbation prediction show our model achieves state-of-the-art\nperformance in predicting transcriptional responses across multiple benchmark\ndatasets. Furthermore, additional results on evaluating the GRN inference task\nreveal our model's ability to generate meaningful GRNs compared to other\nmethods. According to qualitative analysis, GPO-VAE posseses the ability to\nconstruct biologically explainable GRNs that align with experimentally\nvalidated regulatory pathways. GPO-VAE is available at\nhttps://github.com/dmis-lab/GPO-VAE", "paper_summary_zh": "**動機：**預測細胞對遺傳擾動的反應對於理解生物系統和開發目標治療策略至關重要。儘管變分自動編碼器 (VAE) 在建模擾動反應方面已展現前景，但其解釋力有限，這是一個重大挑戰，因為學習到的特徵經常缺乏明確的生物學意義。儘管如此，模型的可解釋性是生物 AI 領域中最重要的方面之一。實現可解釋性的最有效方法之一是在設計深度學習模型（例如 VAE）時納入基因調控網路 (GRN) 的概念。GRN 引發基因之間的潛在因果關係，並能夠解釋由遺傳擾動治療引起的轉錄反應。**結果：**我們提出 GPO-VAE，一種可解釋的 VAE，通過 GRN 對齊參數優化增強，在潛在空間中明確建模基因調控網路。我們的關鍵方法是針對 GRN 對齊的可解釋性，優化與潛在擾動效應相關的可學習參數。擾動預測的實驗結果表明，我們的模型在預測多個基準資料集的轉錄反應方面達到了最先進的效能。此外，評估 GRN 推論任務的額外結果揭示了我們的模型與其他方法相比，具備產生有意義 GRN 的能力。根據定性分析，GPO-VAE 具有構建生物可解釋 GRN 的能力，這些 GRN 與經過實驗驗證的調控途徑一致。GPO-VAE 可在 https://github.com/dmis-lab/GPO-VAE 獲得", "author": "Seungheun Baek et.al.", "authors": "Seungheun Baek, Soyon Park, Yan Ting Chok, Mogan Gim, Jaewoo Kang", "id": "2501.18973v1", "paper_url": "http://arxiv.org/abs/2501.18973v1", "repo": "https://github.com/dmis-lab/gpo-vae"}}