{"2411.15821": {"publish_time": "2024-11-24", "title": "Is Training Data Quality or Quantity More Impactful to Small Language Model Performance?", "paper_summary": "This study investigates the relative impact of training data quality versus\nquantity on the performance of small language models (SLMs), utilizing the\nTinyStories dataset for empirical analysis. Analysis of dataset variations with\nrespect to size (25% and 50% of the original size) and duplication (controlled\nrates of 25%, 50%, 75%, and 100%) were performed. Model performance was\nevaluated based on the validation loss, accuracy, and perplexity metrics.\nResults indicate training data quality plays a more significant role in the\noverall performance of SLMs, especially given scale of this experiment. Minimal\nduplication positively impacted model accuracy (+0.87% increase in accuracy at\n25% duplication) without significantly increasing perplexity (+0.52% increase\ngoing from 0% to 25% duplication) but excessive duplication led to pronounced\nperformance degradation (-40% drop in accuracy at 100% duplication). The\nimplications of this exploration extend beyond just model performance; training\nlarge-scale models imposes significant financial and computational burdens,\nwhich can be prohibitive for organizations, individuals, and the public at\nlarge, especially in developing countries. Additionally, the energy consumption\nassociated with large-scale training raises environmental concerns.\nUnderstanding the relative importance of data quality versus quantity could\ndemocratize AI technology, making advanced models more accessible and\nsustainable for all.", "paper_summary_zh": "本研究調查訓練資料品質相對於數量對小型語言模型 (SLM) 效能的相對影響，並利用 TinyStories 資料集進行實證分析。分析資料集變異，包括大小（原始大小的 25% 和 50%）和重複（受控比率 25%、50%、75% 和 100%）。模型效能根據驗證損失、準確度和困惑度指標進行評估。結果顯示訓練資料品質在 SLM 的整體效能中扮演更重要的角色，特別是在此實驗的規模下。最小的重複對模型準確度產生正面影響（重複率 25% 時準確度增加 +0.87%），且不會顯著增加困惑度（從 0% 到 25% 重複時增加 +0.52%），但過度重複會導致效能顯著下降（重複率 100% 時準確度下降 -40%）。此探討的意義不只在於模型效能；訓練大型模型會造成顯著的財務和運算負擔，對組織、個人和廣大民眾而言可能難以負擔，尤其是在開發中國家。此外，與大型訓練相關的能源消耗也引發環境問題。了解資料品質相對於數量的相對重要性可以使 AI 技術民主化，讓先進模型更易於取得，且對所有人而言更具永續性。", "author": "Aryan Sajith et.al.", "authors": "Aryan Sajith, Krishna Chaitanya Rao Kathala", "id": "2411.15821v1", "paper_url": "http://arxiv.org/abs/2411.15821v1", "repo": "https://github.com/aryan-sajith/urv-data_quantity_vs_data_quality-research"}}