{"2410.15881": {"publish_time": "2024-10-21", "title": "MI-VisionShot: Few-shot adaptation of vision-language models for slide-level classification of histopathological images", "paper_summary": "Vision-language supervision has made remarkable strides in learning visual\nrepresentations from textual guidance. In digital pathology, vision-language\nmodels (VLM), pre-trained on curated datasets of histological image-captions,\nhave been adapted to downstream tasks, such as region of interest\nclassification. Zero-shot transfer for slide-level prediction has been\nformulated by MI-Zero, but it exhibits high variability depending on the\ntextual prompts. Inspired by prototypical learning, we propose MI-VisionShot, a\ntraining-free adaptation method on top of VLMs to predict slide-level labels in\nfew-shot learning scenarios. Our framework takes advantage of the excellent\nrepresentation learning of VLM to create prototype-based classifiers under a\nmultiple-instance setting by retrieving the most discriminative patches within\neach slide. Experimentation through different settings shows the ability of\nMI-VisionShot to surpass zero-shot transfer with lower variability, even in\nlow-shot scenarios. Code coming soon at\nthttps://github.com/cvblab/MIVisionShot.", "paper_summary_zh": "視覺語言監督在從文本指導中學習視覺表徵方面取得了顯著進展。在數位病理學中，經過組織學影像標題的精選資料集預先訓練的視覺語言模型 (VLM) 已調整為下游任務，例如感興趣區域分類。MI-Zero 已制定幻燈片級別預測的零次轉移，但它會根據文字提示而表現出高度變異性。受到原型學習的啟發，我們提出 MI-VisionShot，這是一種建立在 VLM 之上的無訓練適應方法，用於在少次學習場景中預測幻燈片級別標籤。我們的架構利用 VLM 優異的表徵學習，在多個實例設定下透過擷取每個幻燈片中最具區別性的修補程式來建立基於原型的分類器。透過不同設定的實驗顯示，MI-VisionShot 有能力超越變異性較低的零次轉移，即使在少次場景中也是如此。程式碼即將在 thttps://github.com/cvblab/MIVisionShot 上提供。", "author": "Pablo Meseguer et.al.", "authors": "Pablo Meseguer, Rocío del Amor, Valery Naranjo", "id": "2410.15881v1", "paper_url": "http://arxiv.org/abs/2410.15881v1", "repo": "null"}}