{"2410.17784": {"publish_time": "2024-10-23", "title": "Holon Programming Model -- A Software-Defined Approach for System of Systems", "paper_summary": "As Systems of Systems evolve into increasingly complex networks, harnessing\ntheir collective potential becomes paramount. Traditional SoS engineering\napproaches lack the necessary programmability to develop third party SoS level\nbehaviors. To address this challenge, we propose a software defined approach to\nenable flexible and adaptive programming of SoS. We introduce the Holon\nProgramming Model, a software-defined framework designed to meet these needs.\nThe Holon Programming Model empowers developers to design and orchestrate\ncomplex system behaviors effectively, as illustrated in our disaster management\nscenario. This research outlines the Holon Programming Model theoretical\nunderpinnings and practical applications, with the aim of driving further\nexploration and advancement in the field of software defined SoS", "paper_summary_zh": "隨著系統系統演變成日益複雜的網路，利用其集體潛能變得至關重要。傳統的系統系統工程方法缺乏開發第三方系統系統層級行為所需的程式設計能力。為了應對這項挑戰，我們提出一個軟體定義的方法，以實現系統系統的彈性且適應性的程式設計。我們導入 Holon 程式設計模型，一個軟體定義的架構，旨在滿足這些需求。Holon 程式設計模型賦予開發人員設計和編排複雜系統行為的能力，正如我們的災害管理情境中所說明的。這項研究概述了 Holon 程式設計模型的理論基礎和實際應用，目的是推動軟體定義系統系統領域的進一步探索和進步", "author": "Muhammad Ashfaq et.al.", "authors": "Muhammad Ashfaq, Ahmed R. Sadik, Tommi Mikkonen, Muhammad Waseem, Niko Makitalo", "id": "2410.17784v1", "paper_url": "http://arxiv.org/abs/2410.17784v1", "repo": "null"}}