{"2501.14546": {"publish_time": "2025-01-24", "title": "Leveraging ChatGPT's Multimodal Vision Capabilities to Rank Satellite Images by Poverty Level: Advancing Tools for Social Science Research", "paper_summary": "This paper investigates the novel application of Large Language Models (LLMs)\nwith vision capabilities to analyze satellite imagery for village-level poverty\nprediction. Although LLMs were originally designed for natural language\nunderstanding, their adaptability to multimodal tasks, including geospatial\nanalysis, has opened new frontiers in data-driven research. By leveraging\nadvancements in vision-enabled LLMs, we assess their ability to provide\ninterpretable, scalable, and reliable insights into human poverty from\nsatellite images. Using a pairwise comparison approach, we demonstrate that\nChatGPT can rank satellite images based on poverty levels with accuracy\ncomparable to domain experts. These findings highlight both the promise and the\nlimitations of LLMs in socioeconomic research, providing a foundation for their\nintegration into poverty assessment workflows. This study contributes to the\nongoing exploration of unconventional data sources for welfare analysis and\nopens pathways for cost-effective, large-scale poverty monitoring.", "paper_summary_zh": "本文探討大型語言模型（LLM）的新穎應用，結合視覺能力來分析衛星影像，用於村莊層級的貧窮預測。儘管 LLM 最初是為自然語言理解而設計，但其對多模態任務（包括地理空間分析）的適應性，開啟了資料驅動研究的新領域。透過利用具備視覺功能的 LLM 的進步，我們評估其從衛星影像中提供可解釋、可擴充且可靠的人類貧窮洞察的能力。使用成對比較方法，我們證明 ChatGPT 可以根據貧窮程度對衛星影像進行排名，其準確度與領域專家相當。這些發現突顯了 LLM 在社會經濟研究中的優點和限制，為其整合到貧窮評估工作流程中奠定了基礎。本研究有助於持續探索非傳統資料來源以進行福利分析，並為具成本效益的大規模貧窮監測開啟了途徑。", "author": "Hamid Sarmadi et.al.", "authors": "Hamid Sarmadi, Ola Hall, Thorsteinn Rögnvaldsson, Mattias Ohlsson", "id": "2501.14546v1", "paper_url": "http://arxiv.org/abs/2501.14546v1", "repo": "null"}}