{"2410.14389": {"publish_time": "2024-10-18", "title": "SurgeryV2: Bridging the Gap Between Model Merging and Multi-Task Learning with Deep Representation Surgery", "paper_summary": "Model merging-based multitask learning (MTL) offers a promising approach for\nperforming MTL by merging multiple expert models without requiring access to\nraw training data. However, in this paper, we examine the merged model's\nrepresentation distribution and uncover a critical issue of \"representation\nbias\". This bias arises from a significant distribution gap between the\nrepresentations of the merged and expert models, leading to the suboptimal\nperformance of the merged MTL model. To address this challenge, we first\npropose a representation surgery solution called Surgery. Surgery is a\nlightweight, task-specific module that aligns the final layer representations\nof the merged model with those of the expert models, effectively alleviating\nbias and improving the merged model's performance. Despite these improvements,\na performance gap remains compared to the traditional MTL method. Further\nanalysis reveals that representation bias phenomena exist at each layer of the\nmerged model, and aligning representations only in the last layer is\ninsufficient for fully reducing systemic bias because biases introduced at each\nlayer can accumulate and interact in complex ways. To tackle this, we then\npropose a more comprehensive solution, deep representation surgery (also called\nSurgeryV2), which mitigates representation bias across all layers, and thus\nbridges the performance gap between model merging-based MTL and traditional\nMTL. Finally, we design an unsupervised optimization objective to optimize both\nthe Surgery and SurgeryV2 modules. Our experimental results show that\nincorporating these modules into state-of-the-art (SOTA) model merging schemes\nleads to significant performance gains. Notably, our SurgeryV2 scheme reaches\nalmost the same level as individual expert models or the traditional MTL model.\nThe code is available at \\url{https://github.com/EnnengYang/SurgeryV2}.", "paper_summary_zh": "<paragraph>基於模型合併的多任務學習 (MTL) 提供了一種有前途的方法，可透過合併多個專家模型來執行 MTL，而無需存取原始訓練資料。然而，在本文中，我們檢視了合併模型的表示分佈，並發現了一個「表示偏差」的關鍵問題。此偏差源自於合併模型與專家模型的表示之間的顯著分佈差距，導致合併 MTL 模型的次佳效能。為了應對這個挑戰，我們首先提出了一個稱為 Surgery 的表示手術解決方案。Surgery 是一個輕量級、特定於任務的模組，它會將合併模型的最終層表示與專家模型的表示對齊，有效減輕偏差並改善合併模型的效能。儘管有這些改進，但與傳統 MTL 方法相比，效能差距仍然存在。進一步的分析顯示，表示偏差現象存在於合併模型的每一層，而僅在最後一層對齊表示不足以完全減少系統性偏差，因為在每一層引入的偏差可能會以複雜的方式累積和交互。為了解決這個問題，我們接著提出了一個更全面的解決方案，深度表示手術（也稱為 SurgeryV2），它可以減輕所有層的表示偏差，從而彌合基於模型合併的 MTL 和傳統 MTL 之間的效能差距。最後，我們設計了一個無監督的最佳化目標，以最佳化 Surgery 和 SurgeryV2 模組。我們的實驗結果顯示，將這些模組納入最先進 (SOTA) 的模型合併方案會帶來顯著的效能提升。值得注意的是，我們的 SurgeryV2 方案達到了與個別專家模型或傳統 MTL 模型幾乎相同的水準。程式碼可在 \\url{https://github.com/EnnengYang/SurgeryV2} 取得。</paragraph>", "author": "Enneng Yang et.al.", "authors": "Enneng Yang, Li Shen, Zhenyi Wang, Guibing Guo, Xingwei Wang, Xiaocun Cao, Jie Zhang, Dacheng Tao", "id": "2410.14389v1", "paper_url": "http://arxiv.org/abs/2410.14389v1", "repo": "https://github.com/ennengyang/surgeryv2"}}