{"2408.12959": {"publish_time": "2024-08-23", "title": "Multimodal Contrastive In-Context Learning", "paper_summary": "The rapid growth of Large Language Models (LLMs) usage has highlighted the\nimportance of gradient-free in-context learning (ICL). However, interpreting\ntheir inner workings remains challenging. This paper introduces a novel\nmultimodal contrastive in-context learning framework to enhance our\nunderstanding of ICL in LLMs. First, we present a contrastive learning-based\ninterpretation of ICL in real-world settings, marking the distance of the\nkey-value representation as the differentiator in ICL. Second, we develop an\nanalytical framework to address biases in multimodal input formatting for\nreal-world datasets. We demonstrate the effectiveness of ICL examples where\nbaseline performance is poor, even when they are represented in unseen formats.\nLastly, we propose an on-the-fly approach for ICL (Anchored-by-Text ICL) that\ndemonstrates effectiveness in detecting hateful memes, a task where typical ICL\nstruggles due to resource limitations. Extensive experiments on multimodal\ndatasets reveal that our approach significantly improves ICL performance across\nvarious scenarios, such as challenging tasks and resource-constrained\nenvironments. Moreover, it provides valuable insights into the mechanisms of\nin-context learning in LLMs. Our findings have important implications for\ndeveloping more interpretable, efficient, and robust multimodal AI systems,\nespecially in challenging tasks and resource-constrained environments.", "paper_summary_zh": "大型語言模型 (LLM) 使用率的快速增長突顯了無梯度脈絡學習 (ICL) 的重要性。然而，解釋其內部運作仍然具有挑戰性。本文介紹了一個新穎的多模態對比脈絡學習框架，以增強我們對 LLM 中 ICL 的理解。首先，我們提出了基於對比學習的 ICL 在現實世界中的解釋，將鍵值表示的距離標記為 ICL 中的區別因素。其次，我們開發了一個分析框架來解決現實世界資料集中多模態輸入格式中的偏差。我們展示了 ICL 範例的有效性，其中基準效能很差，即使它們以未見過的格式表示也是如此。最後，我們提出了一個即時 ICL 方法（Anchored-by-Text ICL），它證明了在檢測仇恨迷因方面的有效性，這是典型 ICL 由於資源限制而難以應付的一項任務。對多模態資料集的廣泛實驗表明，我們的做法顯著改善了 ICL 在各種場景中的效能，例如具有挑戰性的任務和資源受限的環境。此外，它提供了寶貴的見解，了解 LLM 中脈絡學習的機制。我們的發現對於開發更具可解釋性、效率和強健性的多模態 AI 系統具有重要意義，尤其是在具有挑戰性的任務和資源受限的環境中。", "author": "Yosuke Miyanishi et.al.", "authors": "Yosuke Miyanishi, Minh Le Nguyen", "id": "2408.12959v1", "paper_url": "http://arxiv.org/abs/2408.12959v1", "repo": "null"}}