{"2406.14955": {"publish_time": "2024-06-21", "title": "ICLEval: Evaluating In-Context Learning Ability of Large Language Models", "paper_summary": "In-Context Learning (ICL) is a critical capability of Large Language Models\n(LLMs) as it empowers them to comprehend and reason across interconnected\ninputs. Evaluating the ICL ability of LLMs can enhance their utilization and\ndeepen our understanding of how this ability is acquired at the training stage.\nHowever, existing evaluation frameworks primarily focus on language abilities\nand knowledge, often overlooking the assessment of ICL ability. In this work,\nwe introduce the ICLEval benchmark to evaluate the ICL abilities of LLMs, which\nencompasses two key sub-abilities: exact copying and rule learning. Through the\nICLEval benchmark, we demonstrate that ICL ability is universally present in\ndifferent LLMs, and model size is not the sole determinant of ICL efficacy.\nSurprisingly, we observe that ICL abilities, particularly copying, develop\nearly in the pretraining process and stabilize afterward. Our source codes and\nbenchmark are released at https://github.com/yiye3/ICLEval.", "paper_summary_zh": "語境學習 (ICL) 是大型語言模型 (LLM) 的一項關鍵能力，因為它能讓 LLM 理解和推理相互關聯的輸入。評估 LLM 的 ICL 能力可以提升其應用，並加深我們對此能力如何在訓練階段習得的理解。然而，現有的評估框架主要關注語言能力和知識，往往忽略了對 ICL 能力的評估。在這項工作中，我們引入了 ICLEval 基準來評估 LLM 的 ICL 能力，其中包含了兩個關鍵子能力：精確複製和規則學習。透過 ICLEval 基準，我們證明了 ICL 能力普遍存在於不同的 LLM 中，而模型大小並非 ICL 效能的唯一決定因素。令人驚訝的是，我們觀察到 ICL 能力，特別是複製，在預訓練過程中會及早發展，並在之後穩定下來。我們的原始碼和基準已在 https://github.com/yiye3/ICLEval 中發布。", "author": "Wentong Chen et.al.", "authors": "Wentong Chen, Yankai Lin, ZhenHao Zhou, HongYun Huang, Yantao Jia, Zhao Cao, Ji-Rong Wen", "id": "2406.14955v1", "paper_url": "http://arxiv.org/abs/2406.14955v1", "repo": "https://github.com/yiye3/icleval"}}