{"2410.18860": {"publish_time": "2024-10-24", "title": "DeCoRe: Decoding by Contrasting Retrieval Heads to Mitigate Hallucinations", "paper_summary": "Large Language Models (LLMs) often hallucinate, producing unfaithful or\nfactually incorrect outputs by misrepresenting the provided context or\nincorrectly recalling internal knowledge. Recent studies have identified\nspecific attention heads within the Transformer architecture, known as\nretrieval heads, responsible for extracting relevant contextual information. We\nhypothesise that masking these retrieval heads can induce hallucinations and\nthat contrasting the outputs of the base LLM and the masked LLM can reduce\nhallucinations. To this end, we propose Decoding by Contrasting Retrieval Heads\n(DeCoRe), a novel training-free decoding strategy that amplifies information\nfound in the context and model parameters. DeCoRe mitigates potentially\nhallucinated responses by dynamically contrasting the outputs of the base LLM\nand the masked LLM, using conditional entropy as a guide. Our extensive\nexperiments confirm that DeCoRe significantly improves performance on tasks\nrequiring high contextual faithfulness, such as summarisation (XSum by 18.6%),\ninstruction following (MemoTrap by 10.9%), and open-book question answering\n(NQ-Open by 2.4% and NQ-Swap by 5.5%).", "paper_summary_zh": "大型語言模型 (LLM) 經常產生幻覺，透過錯誤陳述提供的脈絡或錯誤地回憶內部知識來產生不忠實或事實上不正確的輸出。最近的研究已識別出 Transformer 架構中特定注意力頭，稱為檢索頭，負責擷取相關的脈絡資訊。我們假設遮蔽這些檢索頭會誘發幻覺，並且對比基礎 LLM 和遮蔽 LLM 的輸出可以減少幻覺。為此，我們提出透過對比檢索頭進行解碼 (DeCoRe)，一種新穎的無訓練解碼策略，它會放大脈絡和模型參數中找到的資訊。DeCoRe 透過動態對比基礎 LLM 和遮蔽 LLM 的輸出，使用條件熵作為指南，來減輕潛在的幻覺反應。我們廣泛的實驗證實，DeCoRe 在需要高度脈絡忠實度的任務上顯著改善效能，例如摘要 (XSum 提高 18.6%)、指令遵循 (MemoTrap 提高 10.9%)，以及開放式問答 (NQ-Open 提高 2.4% 和 NQ-Swap 提高 5.5%)。", "author": "Aryo Pradipta Gema et.al.", "authors": "Aryo Pradipta Gema, Chen Jin, Ahmed Abdulaal, Tom Diethe, Philip Teare, Beatrice Alex, Pasquale Minervini, Amrutha Saseendran", "id": "2410.18860v1", "paper_url": "http://arxiv.org/abs/2410.18860v1", "repo": "https://github.com/aryopg/decore"}}