{"2405.12541": {"publish_time": "2024-05-21", "title": "DrHouse: An LLM-empowered Diagnostic Reasoning System through Harnessing Outcomes from Sensor Data and Expert Knowledge", "paper_summary": "Large language models (LLMs) have the potential to transform digital\nhealthcare, as evidenced by recent advances in LLM-based virtual doctors.\nHowever, current approaches rely on patient's subjective descriptions of\nsymptoms, causing increased misdiagnosis. Recognizing the value of daily data\nfrom smart devices, we introduce a novel LLM-based multi-turn consultation\nvirtual doctor system, DrHouse, which incorporates three significant\ncontributions: 1) It utilizes sensor data from smart devices in the diagnosis\nprocess, enhancing accuracy and reliability. 2) DrHouse leverages continuously\nupdating medical databases such as Up-to-Date and PubMed to ensure our model\nremains at diagnostic standard's forefront. 3) DrHouse introduces a novel\ndiagnostic algorithm that concurrently evaluates potential diseases and their\nlikelihood, facilitating more nuanced and informed medical assessments. Through\nmulti-turn interactions, DrHouse determines the next steps, such as accessing\ndaily data from smart devices or requesting in-lab tests, and progressively\nrefines its diagnoses. Evaluations on three public datasets and our\nself-collected datasets show that DrHouse can achieve up to an 18.8% increase\nin diagnosis accuracy over the state-of-the-art baselines. The results of a\n32-participant user study show that 75% medical experts and 91.7% patients are\nwilling to use DrHouse.", "paper_summary_zh": "大型語言模型 (LLM) 有潛力轉變數位醫療保健，這點從 LLM 為基礎的虛擬醫師最近的進展中就能看出。然而，目前的做法依賴於患者主觀的症狀描述，導致誤診增加。我們認識到來自智慧裝置的每日資料價值，因此我們引進一個新穎的 LLM 為基礎的多輪諮詢虛擬醫師系統 DrHouse，它包含三個重要的貢獻：1) 它在診斷過程中利用來自智慧裝置的感測器資料，提升準確度和可靠度。2) DrHouse 充分利用持續更新的醫療資料庫，例如 Up-to-Date 和 PubMed，以確保我們的模型維持在診斷標準的最前線。3) DrHouse 引進一種新穎的診斷演算法，它同時評估潛在疾病及其可能性，促進更細緻且明智的醫療評估。透過多輪互動，DrHouse 決定下一步，例如取得來自智慧裝置的每日資料或要求實驗室檢驗，並逐步改善其診斷。針對三個公開資料集和我們自行收集的資料集進行評估顯示，DrHouse 在診斷準確度方面可以比現有最先進的基準線提高 18.8%。一個有 32 位參與者的使用者研究結果顯示，75% 的醫療專家和 91.7% 的患者願意使用 DrHouse。", "author": "Bufang Yang et.al.", "authors": "Bufang Yang, Siyang Jiang, Lilin Xu, Kaiwei Liu, Hai Li, Guoliang Xing, Hongkai Chen, Xiaofan Jiang, Zhenyu Yan", "id": "2405.12541v1", "paper_url": "http://arxiv.org/abs/2405.12541v1", "repo": "null"}}