{"2408.13366": {"publish_time": "2024-08-23", "title": "CodeRefine: A Pipeline for Enhancing LLM-Generated Code Implementations of Research Papers", "paper_summary": "This paper presents CodeRefine, a novel framework for automatically\ntransforming research paper methodologies into functional code using Large\nLanguage Models (LLMs). Our multi-step approach first extracts and summarizes\nkey text chunks from papers, analyzes their code relevance, and creates a\nknowledge graph using a predefined ontology. Code is then generated from this\nstructured representation and enhanced through a proposed retrospective\nretrieval-augmented generation approach. CodeRefine addresses the challenge of\nbridging theoretical research and practical implementation, offering a more\naccurate alternative to LLM zero-shot prompting. Evaluations on diverse\nscientific papers demonstrate CodeRefine's ability to improve code\nimplementation from the paper, potentially accelerating the adoption of\ncutting-edge algorithms in real-world applications.", "paper_summary_zh": "本篇論文提出 CodeRefine，一個利用大型語言模型 (LLM) 將研究論文方法自動轉換為功能程式碼的新穎架構。我們的多步驟方法首先從論文中萃取並摘要出關鍵文字區塊，分析其程式碼相關性，並使用預定義的本体建立知識圖譜。接著從這個結構化表示產生程式碼，並透過提出的回溯式檢索增強產生方法進行強化。CodeRefine 解決了理論研究與實際實作之間的鴻溝，提供比 LLM 零次提示更精確的替代方案。在各種科學論文上的評估證明了 CodeRefine 從論文改善程式碼實作的能力，這有潛力加速尖端演算法在實際應用中的採用。", "author": "Ekaterina Trofimova et.al.", "authors": "Ekaterina Trofimova, Emil Sataev, Abhijit Singh Jowhari", "id": "2408.13366v1", "paper_url": "http://arxiv.org/abs/2408.13366v1", "repo": "null"}}