{"2405.10890": {"publish_time": "2024-05-17", "title": "A Versatile Framework for Analyzing Galaxy Image Data by Implanting Human-in-the-loop on a Large Vision Model", "paper_summary": "The exponential growth of astronomical datasets provides an unprecedented\nopportunity for humans to gain insight into the Universe. However, effectively\nanalyzing this vast amount of data poses a significant challenge. Astronomers\nare turning to deep learning techniques to address this, but the methods are\nlimited by their specific training sets, leading to considerable duplicate\nworkloads too. Hence, as an example to present how to overcome the issue, we\nbuilt a framework for general analysis of galaxy images, based on a large\nvision model (LVM) plus downstream tasks (DST), including galaxy morphological\nclassification, image restoration, object detection, parameter extraction, and\nmore. Considering the low signal-to-noise ratio of galaxy images and the\nimbalanced distribution of galaxy categories, we have incorporated a\nHuman-in-the-loop (HITL) module into our large vision model, which leverages\nhuman knowledge to enhance the reliability and interpretability of processing\ngalaxy images interactively. The proposed framework exhibits notable few-shot\nlearning capabilities and versatile adaptability to all the abovementioned\ntasks on galaxy images in the DESI legacy imaging surveys. Expressly, for\nobject detection, trained by 1000 data points, our DST upon the LVM achieves an\naccuracy of 96.7%, while ResNet50 plus Mask R-CNN gives an accuracy of 93.1%;\nfor morphology classification, to obtain AUC ~0.9, LVM plus DST and HITL only\nrequests 1/50 training sets compared to ResNet18. Expectedly, multimodal data\ncan be integrated similarly, which opens up possibilities for conducting joint\nanalyses with datasets spanning diverse domains in the era of multi-message\nastronomy.", "paper_summary_zh": "天文資料的指數成長，為人類深入了解宇宙提供了前所未有的機會。然而，有效分析這些海量資料是一項重大挑戰。天文學家正轉向深度學習技術來解決這個問題，但這些方法受到其特定訓練集的限制，也導致大量重複的工作。因此，我們以銀河影像的一般分析框架為例，說明如何克服這個問題，這個框架基於大型視覺模型 (LVM) 加上下游任務 (DST)，包括銀河形態分類、影像修復、物體偵測、參數萃取等等。考量到銀河影像的訊噪比低，以及銀河類別分佈不平衡，我們將人類在迴圈 (HITL) 模組整合到我們的大型視覺模型中，利用人類知識來增強處理銀河影像的可靠度和可解釋性。所提出的框架展現出顯著的少樣本學習能力，以及對 DESI 傳統影像調查中所有上述銀河影像任務的多功能適應性。特別是對於物體偵測，我們的 DST 在 LVM 上訓練了 1000 個資料點，達到了 96.7% 的精確度，而 ResNet50 加上 Mask R-CNN 的精確度為 93.1%；對於形態分類，為了獲得 AUC ~0.9，LVM 加上 DST 和 HITL 只需要 1/50 的訓練集，與 ResNet18 相比。預期多模態資料可以類似地整合，這為在多訊息天文學時代跨越不同領域的資料集進行聯合分析開啟了可能性。", "author": "Mingxiang Fu et.al.", "authors": "Mingxiang Fu, Yu Song, Jiameng Lv, Liang Cao, Peng Jia, Nan Li, Xiangru Li, Jifeng Liu, A-Li Luo, Bo Qiu, Shiyin Shen, Liangping Tu, Lili Wang, Shoulin Wei, Haifeng Yang, Zhenping Yi, Zhiqiang Zou", "id": "2405.10890v1", "paper_url": "http://arxiv.org/abs/2405.10890v1", "repo": "null"}}