{"2407.06152": {"publish_time": "2024-07-08", "title": "Uni-ELF: A Multi-Level Representation Learning Framework for Electrolyte Formulation Design", "paper_summary": "Advancements in lithium battery technology heavily rely on the design and\nengineering of electrolytes. However, current schemes for molecular design and\nrecipe optimization of electrolytes lack an effective\ncomputational-experimental closed loop and often fall short in accurately\npredicting diverse electrolyte formulation properties. In this work, we\nintroduce Uni-ELF, a novel multi-level representation learning framework to\nadvance electrolyte design. Our approach involves two-stage pretraining:\nreconstructing three-dimensional molecular structures at the molecular level\nusing the Uni-Mol model, and predicting statistical structural properties\n(e.g., radial distribution functions) from molecular dynamics simulations at\nthe mixture level. Through this comprehensive pretraining, Uni-ELF is able to\ncapture intricate molecular and mixture-level information, which significantly\nenhances its predictive capability. As a result, Uni-ELF substantially\noutperforms state-of-the-art methods in predicting both molecular properties\n(e.g., melting point, boiling point, synthesizability) and formulation\nproperties (e.g., conductivity, Coulombic efficiency). Moreover, Uni-ELF can be\nseamlessly integrated into an automatic experimental design workflow. We\nbelieve this innovative framework will pave the way for automated AI-based\nelectrolyte design and engineering.", "paper_summary_zh": "鋰電池技術的進展極度依賴電解質的設計和工程。然而，當前電解質的分子設計和配方優化方案缺乏有效的計算實驗閉環，而且通常無法準確預測不同的電解質配方特性。在此工作中，我們引入了 Uni-ELF，一個新穎的多級表徵學習架構，以推進電解質設計。我們的做法包括兩階段預訓練：使用 Uni-Mol 模型在分子層級重建三維分子結構，以及從混合層級的分子動力學模擬中預測統計結構特性（例如，徑向分佈函數）。透過這個全面的預訓練，Uni-ELF 能夠擷取複雜的分子和混合層級資訊，這顯著地增強了它的預測能力。因此，Uni-ELF 在預測分子特性（例如，熔點、沸點、可合成性）和配方特性（例如，電導率、庫倫效率）方面都明顯優於最先進的方法。此外，Uni-ELF 可以無縫整合到自動實驗設計工作流程中。我們相信這個創新的架構將為自動化的人工智慧電解質設計和工程鋪路。", "author": "Boshen Zeng et.al.", "authors": "Boshen Zeng, Sian Chen, Xinxin Liu, Changhong Chen, Bin Deng, Xiaoxu Wang, Zhifeng Gao, Yuzhi Zhang, Weinan E, Linfeng Zhang", "id": "2407.06152v1", "paper_url": "http://arxiv.org/abs/2407.06152v1", "repo": "null"}}