{"2502.13138": {"publish_time": "2025-02-18", "title": "AIDE: AI-Driven Exploration in the Space of Code", "paper_summary": "Machine learning, the foundation of modern artificial intelligence, has\ndriven innovations that have fundamentally transformed the world. Yet, behind\nadvancements lies a complex and often tedious process requiring labor and\ncompute intensive iteration and experimentation. Engineers and scientists\ndeveloping machine learning models spend much of their time on trial-and-error\ntasks instead of conceptualizing innovative solutions or research hypotheses.\nTo address this challenge, we introduce AI-Driven Exploration (AIDE), a machine\nlearning engineering agent powered by large language models (LLMs). AIDE frames\nmachine learning engineering as a code optimization problem, and formulates\ntrial-and-error as a tree search in the space of potential solutions. By\nstrategically reusing and refining promising solutions, AIDE effectively trades\ncomputational resources for enhanced performance, achieving state-of-the-art\nresults on multiple machine learning engineering benchmarks, including our\nKaggle evaluations, OpenAI MLE-Bench and METRs RE-Bench.", "paper_summary_zh": "機器學習，現代人工智慧的基礎，已經推動了根本性地改變世界的創新。然而，進步的背後是一個複雜且經常繁瑣的過程，需要人工和計算密集的迭代和實驗。開發機器學習模型的工程師和科學家將大部分時間花在試錯任務上，而不是構思創新的解決方案或研究假設。為了應對這一挑戰，我們引入了 AI 驅動探索 (AIDE)，這是一種由大型語言模型 (LLM) 驅動的機器學習工程代理。AIDE 將機器學習工程構建為一個程式碼最佳化問題，並將試錯表述為在潛在解決方案空間中的樹狀搜尋。透過策略性地重複使用和改進有希望的解決方案，AIDE 有效地將計算資源轉換為增強的效能，在多個機器學習工程基準上取得了最先進的成果，包括我們的 Kaggle 評估、OpenAI MLE-Bench 和 METRs RE-Bench。", "author": "Zhengyao Jiang et.al.", "authors": "Zhengyao Jiang, Dominik Schmidt, Dhruv Srikanth, Dixing Xu, Ian Kaplan, Deniss Jacenko, Yuxiang Wu", "id": "2502.13138v1", "paper_url": "http://arxiv.org/abs/2502.13138v1", "repo": "null"}}