{"2412.07303": {"publish_time": "2024-12-10", "title": "Filipino Benchmarks for Measuring Sexist and Homophobic Bias in Multilingual Language Models from Southeast Asia", "paper_summary": "Bias studies on multilingual models confirm the presence of gender-related\nstereotypes in masked models processing languages with high NLP resources. We\nexpand on this line of research by introducing Filipino CrowS-Pairs and\nFilipino WinoQueer: benchmarks that assess both sexist and anti-queer biases in\npretrained language models (PLMs) handling texts in Filipino, a low-resource\nlanguage from the Philippines. The benchmarks consist of 7,074 new challenge\npairs resulting from our cultural adaptation of English bias evaluation\ndatasets, a process that we document in detail to guide similar forthcoming\nefforts. We apply the Filipino benchmarks on masked and causal multilingual\nmodels, including those pretrained on Southeast Asian data, and find that they\ncontain considerable amounts of bias. We also find that for multilingual\nmodels, the extent of bias learned for a particular language is influenced by\nhow much pretraining data in that language a model was exposed to. Our\nbenchmarks and insights can serve as a foundation for future work analyzing and\nmitigating bias in multilingual models.", "paper_summary_zh": "多語言模型的偏見研究證實，在處理具有大量 NLP 資源的語言時，遮罩模型中存在與性別相關的刻板印象。我們透過引入菲律賓 CrowS-Pairs 和菲律賓 WinoQueer 來擴展這條研究路線：這些基準評估了預訓練語言模型 (PLM) 在處理來自菲律賓的低資源語言菲律賓語的文字時，性別歧視和反酷兒的偏見。這些基準包含 7,074 個新的挑戰配對，這些配對來自我們對英文偏見評估資料集的文化適應，我們詳細記錄了這個程序，以指導類似的後續工作。我們將菲律賓基準應用於遮罩和因果多語言模型，包括那些在東南亞資料上預訓練的模型，並發現它們包含大量的偏見。我們還發現，對於多語言模型，特定語言所學得的偏見程度會受到模型接觸該語言的預訓練資料量的影響。我們的基準和見解可以作為未來分析和減輕多語言模型中偏見的工作的基礎。", "author": "Lance Calvin Lim Gamboa et.al.", "authors": "Lance Calvin Lim Gamboa, Mark Lee", "id": "2412.07303v1", "paper_url": "http://arxiv.org/abs/2412.07303v1", "repo": "null"}}