{"2406.14176": {"publish_time": "2024-06-20", "title": "A Multi-Stream Fusion Approach with One-Class Learning for Audio-Visual Deepfake Detection", "paper_summary": "This paper addresses the challenge of developing a robust audio-visual\ndeepfake detection model. In practical use cases, new generation algorithms are\ncontinually emerging, and these algorithms are not encountered during the\ndevelopment of detection methods. This calls for the generalization ability of\nthe method. Additionally, to ensure the credibility of detection methods, it is\nbeneficial for the model to interpret which cues from the video indicate it is\nfake. Motivated by these considerations, we then propose a multi-stream fusion\napproach with one-class learning as a representation-level regularization\ntechnique. We study the generalization problem of audio-visual deepfake\ndetection by creating a new benchmark by extending and re-splitting the\nexisting FakeAVCeleb dataset. The benchmark contains four categories of fake\nvideo(Real Audio-Fake Visual, Fake Audio-Fake Visual, Fake Audio-Real Visual,\nand unsynchronized video). The experimental results show that our approach\nimproves the model's detection of unseen attacks by an average of 7.31% across\nfour test sets, compared to the baseline model. Additionally, our proposed\nframework offers interpretability, indicating which modality the model\nidentifies as fake.", "paper_summary_zh": "本文探讨了开发稳健的音频视觉深度造假检测模型的挑战。在实际用例中，新一代算法不断涌现，并且在检测方法的开发过程中不会遇到这些算法。这需要该方法的泛化能力。此外，为了确保检测方法的可靠性，模型解释视频中的哪些线索表明它是假的是有益的。受这些考虑因素的启发，我们提出了一个多流融合方法，其中一类学习作为表示级正则化技术。我们通过扩展和重新分割现有的 FakeAVCeleb 数据集来创建新的基准，研究了音频视觉深度造假检测的泛化问题。该基准包含四类虚假视频（真实音频-虚假视觉、虚假音频-虚假视觉、虚假音频-真实视觉和不同步视频）。实验结果表明，与基线模型相比，我们的方法将模型对未见攻击的检测提高了平均 7.31%，分布在四个测试集中。此外，我们提出的框架提供了可解释性，指出模型将哪个模态识别为虚假。", "author": "Kyungbok Lee et.al.", "authors": "Kyungbok Lee, You Zhang, Zhiyao Duan", "id": "2406.14176v1", "paper_url": "http://arxiv.org/abs/2406.14176v1", "repo": "null"}}