{"2412.03851": {"publish_time": "2024-12-05", "title": "FedMetaMed: Federated Meta-Learning for Personalized Medication in Distributed Healthcare Systems", "paper_summary": "Personalized medication aims to tailor healthcare to individual patient\ncharacteristics. However, the heterogeneity of patient data across healthcare\nsystems presents significant challenges to achieving accurate and effective\npersonalized treatments. Ethical concerns further complicate the aggregation of\nlarge volumes of data from diverse institutions. Federated Learning (FL) offers\na promising decentralized solution by enabling collaborative model training\nthrough the exchange of client models rather than raw data, thus preserving\nprivacy. However, existing FL methods often suffer from retrogression during\nserver aggregation, leading to a decline in model performance in real-world\nmedical FL settings. To address data variability in distributed healthcare\nsystems, we introduce Federated Meta-Learning for Personalized Medication\n(FedMetaMed), which combines federated learning and meta-learning to create\nmodels that adapt to diverse patient data across healthcare systems. The\nFedMetaMed framework aims to produce superior personalized models for\nindividual clients by addressing these limitations. Specifically, we introduce\nCumulative Fourier Aggregation (CFA) at the server to improve stability and\neffectiveness in global knowledge aggregation. CFA achieves this by gradually\nintegrating client models from low to high frequencies. At the client level, we\nimplement a Collaborative Transfer Optimization (CTO) strategy with a\nthree-step process - Retrieve, Reciprocate, and Refine - to enhance the\npersonalized local model through seamless global knowledge transfer.\nExperiments on real-world medical imaging datasets demonstrate that FedMetaMed\noutperforms state-of-the-art FL methods, showing superior generalization even\non out-of-distribution cohorts.", "paper_summary_zh": "個人化醫療旨在針對個別患者特徵調整醫療保健。然而，醫療系統中患者資料的異質性對達成準確且有效的個人化治療帶來重大挑戰。倫理問題進一步使來自不同機構的大量資料的彙總複雜化。聯邦學習 (FL) 提供了一種有前景的分散式解決方案，透過交換客戶模型而非原始資料來實現協作模型訓練，從而保護隱私。然而，現有的 FL 方法在伺服器彙總期間經常遭受退化，導致實際醫療 FL 設定中的模型效能下降。為了解決分散式醫療系統中的資料變異性，我們引入了個人化藥物聯邦元學習 (FedMetaMed)，它結合了聯邦學習和元學習來建立模型，以適應醫療系統中不同的患者資料。FedMetaMed 框架旨在透過解決這些限制，為個別客戶產生優越的個人化模型。具體來說，我們在伺服器端引入了累積傅立葉彙總 (CFA)，以改善全球知識彙總的穩定性和有效性。CFA 透過逐步整合從低頻率到高頻率的客戶模型來實現這一點。在客戶端層級，我們實施了一種協作傳輸最佳化 (CTO) 策略，採用三步驟流程 - 擷取、回饋和精煉 - 透過無縫的全球知識傳輸來增強個人化本地模型。在實際醫療影像資料集上的實驗表明，FedMetaMed 優於最先進的 FL 方法，即使在非分佈群組中也展現出優越的泛化性。", "author": "Jiechao Gao et.al.", "authors": "Jiechao Gao, Yuangang Li", "id": "2412.03851v1", "paper_url": "http://arxiv.org/abs/2412.03851v1", "repo": "null"}}