{"2501.05675": {"publish_time": "2025-01-10", "title": "Facilitate Collaboration between Large Language Model and Task-specific Model for Time Series Anomaly Detection", "paper_summary": "In anomaly detection, methods based on large language models (LLMs) can\nincorporate expert knowledge, while task-specific smaller models excel at\nextracting normal patterns and detecting value fluctuations. Inspired by the\nhuman nervous system, where the brain stores expert knowledge and the\nperipheral nervous system and spinal cord handle specific tasks like withdrawal\nand knee-jerk reflexes, we propose CoLLaTe, a framework designed to facilitate\ncollaboration between LLMs and task-specific models, leveraging the strengths\nof both.\n  In this work, we first formulate the collaboration process and identify two\nkey challenges in the collaboration between LLMs and task-specific models: (1)\nthe misalignment between the expression domains of LLMs and smaller models, and\n(2) error accumulation arising from the predictions of both models.\n  To address these challenges, we introduce two key components in CoLLaTe: the\nalignment module and the collaborative loss function. Through theoretical\nanalysis and experimental validation, we demonstrate that these components\neffectively mitigate the identified challenges and achieve better performance\nthan LLM based methods and task-specific smaller model.", "paper_summary_zh": "在異常偵測中，基於大型語言模型 (LLM) 的方法可納入專家知識，而特定於任務的較小模型則擅長提取正常模式和偵測價值波動。受人類神經系統的啟發，其中大腦儲存專家知識，而周邊神經系統和脊髓處理特定任務，例如撤回和膝跳反射，我們提出 CoLLaTe，一個旨在促進 LLM 和特定於任務的模型之間協作的框架，利用兩者的優勢。\n在這項工作中，我們首先制定協作流程，並找出 LLM 和特定於任務的模型之間協作中的兩個主要挑戰：(1) LLM 和較小模型的表達領域之間的不一致，以及 (2) 來自兩個模型預測的誤差累積。\n為了應對這些挑戰，我們在 CoLLaTe 中引入了兩個關鍵組成部分：對齊模組和協作損失函數。透過理論分析和實驗驗證，我們證明這些組成部分有效地減輕了已識別的挑戰，並比基於 LLM 的方法和特定於任務的較小模型獲得更好的效能。", "author": "Feiyi Chen et.al.", "authors": "Feiyi Chen, Leilei Zhang, Guansong Pang, Roger Zimmermann, Shuiguang Deng", "id": "2501.05675v1", "paper_url": "http://arxiv.org/abs/2501.05675v1", "repo": "null"}}