{"2409.02486": {"publish_time": "2024-09-04", "title": "Boosting Generalizability towards Zero-Shot Cross-Dataset Single-Image Indoor Depth by Meta-Initialization", "paper_summary": "Indoor robots rely on depth to perform tasks like navigation or obstacle\ndetection, and single-image depth estimation is widely used to assist\nperception. Most indoor single-image depth prediction focuses less on model\ngeneralizability to unseen datasets, concerned with in-the-wild robustness for\nsystem deployment. This work leverages gradient-based meta-learning to gain\nhigher generalizability on zero-shot cross-dataset inference. Unlike the\nmost-studied meta-learning of image classification associated with explicit\nclass labels, no explicit task boundaries exist for continuous depth values\ntied to highly varying indoor environments regarding object arrangement and\nscene composition. We propose fine-grained task that treats each RGB-D\nmini-batch as a task in our meta-learning formulation. We first show that our\nmethod on limited data induces a much better prior (max 27.8% in RMSE). Then,\nfinetuning on meta-learned initialization consistently outperforms baselines\nwithout the meta approach. Aiming at generalization, we propose zero-shot\ncross-dataset protocols and validate higher generalizability induced by our\nmeta-initialization, as a simple and useful plugin to many existing depth\nestimation methods. The work at the intersection of depth and meta-learning\npotentially drives both research to step closer to practical robotic and\nmachine perception usage.", "paper_summary_zh": "室內機器人依賴深度來執行導航或障礙物偵測等任務，而單一影像深度估計廣泛用於協助感知。大多數室內單一影像深度預測較少關注模型對未見資料集的概化能力，而關注系統部署的實際穩健性。本研究利用基於梯度的元學習，在零次學習跨資料集推論中獲得更高的概化能力。與最常研究的影像分類元學習相關聯的明確類別標籤不同，對於與物件配置和場景組成相關的高度變異室內環境，沒有明確的任務界線存在於連續深度值中。我們提出細緻的任務，將每個 RGB-D 迷你批次視為我們元學習公式中的任務。我們首先展示我們的有限資料方法會產生更好的先驗（RMSE 中最多 27.8%）。然後，在元學習初始化上進行微調始終優於沒有元方法的基準。為了概化，我們提出零次學習跨資料集協定，並驗證由我們的元初始化產生的更高概化能力，作為許多現有深度估計方法的簡單且有用的外掛程式。深度和元學習的交叉研究，潛在地推動兩項研究更接近實用的機器人和機器感知應用。", "author": "Cho-Ying Wu et.al.", "authors": "Cho-Ying Wu, Yiqi Zhong, Junying Wang, Ulrich Neumann", "id": "2409.02486v1", "paper_url": "http://arxiv.org/abs/2409.02486v1", "repo": "null"}}