{"2408.02009": {"publish_time": "2024-08-04", "title": "Joint Learning of Emotions in Music and Generalized Sounds", "paper_summary": "In this study, we aim to determine if generalized sounds and music can share\na common emotional space, improving predictions of emotion in terms of arousal\nand valence. We propose the use of multiple datasets as a multi-domain learning\ntechnique. Our approach involves creating a common space encompassing features\nthat characterize both generalized sounds and music, as they can evoke emotions\nin a similar manner. To achieve this, we utilized two publicly available\ndatasets, namely IADS-E and PMEmo, following a standardized experimental\nprotocol. We employed a wide variety of features that capture diverse aspects\nof the audio structure including key parameters of spectrum, energy, and\nvoicing. Subsequently, we performed joint learning on the common feature space,\nleveraging heterogeneous model architectures. Interestingly, this synergistic\nscheme outperforms the state-of-the-art in both sound and music emotion\nprediction. The code enabling full replication of the presented experimental\npipeline is available at https://github.com/LIMUNIMI/MusicSoundEmotions.", "paper_summary_zh": "在這項研究中，我們旨在確定廣泛的聲音和音樂是否可以共享一個共同的情緒空間，進而改善情緒預測，特別是喚醒和效價。我們提出使用多個資料集作為多領域學習技術。我們的做法包括建立一個共同的空間，包含特徵，以描述廣泛的聲音和音樂，因為它們可以用類似的方式喚起情緒。為了實現這個目標，我們利用了兩個公開可用的資料集，即 IADS-E 和 PMEmo，並遵循標準化的實驗協議。我們採用了各種特徵，以捕捉音訊結構的不同面向，包括頻譜、能量和發聲的主要參數。隨後，我們在共同的特徵空間上執行聯合學習，利用異質模型架構。有趣的是，這種協同方案優於聲音和音樂情緒預測的現有技術。啟用完整複製所呈現實驗管線的程式碼可以在 https://github.com/LIMUNIMI/MusicSoundEmotions 取得。", "author": "Simonetta Federico et.al.", "authors": "Simonetta Federico, Certo Francesca, Ntalampiras Stavros", "id": "2408.02009v1", "paper_url": "http://arxiv.org/abs/2408.02009v1", "repo": "null"}}