{"2410.20957": {"publish_time": "2024-10-28", "title": "Neuro-symbolic Learning Yielding Logical Constraints", "paper_summary": "Neuro-symbolic systems combine the abilities of neural perception and logical\nreasoning. However, end-to-end learning of neuro-symbolic systems is still an\nunsolved challenge. This paper proposes a natural framework that fuses neural\nnetwork training, symbol grounding, and logical constraint synthesis into a\ncoherent and efficient end-to-end learning process. The capability of this\nframework comes from the improved interactions between the neural and the\nsymbolic parts of the system in both the training and inference stages.\nTechnically, to bridge the gap between the continuous neural network and the\ndiscrete logical constraint, we introduce a difference-of-convex programming\ntechnique to relax the logical constraints while maintaining their precision.\nWe also employ cardinality constraints as the language for logical constraint\nlearning and incorporate a trust region method to avoid the degeneracy of\nlogical constraint in learning. Both theoretical analyses and empirical\nevaluations substantiate the effectiveness of the proposed framework.", "paper_summary_zh": "神經符號系統結合了神經感知和邏輯推理的能力。然而，神經符號系統的端到端學習仍是一個未解決的挑戰。本文提出了一個自然框架，將神經網路訓練、符號基礎和邏輯約束合成融合到一個連貫且有效的端到端學習過程中。此框架的能力來自於訓練和推理階段中神經和符號部分之間互動的改善。在技術上，為了彌合連續神經網路和離散邏輯約束之間的差距，我們引入一個凸差規劃技術來放寬邏輯約束，同時保持其精度。我們還使用基數約束作為邏輯約束學習的語言，並結合一個信任區域方法來避免邏輯約束在學習中的簡併。理論分析和實證評估都證實了所提出的框架的有效性。", "author": "Zenan Li et.al.", "authors": "Zenan Li, Yunpeng Huang, Zhaoyu Li, Yuan Yao, Jingwei Xu, Taolue Chen, Xiaoxing Ma, Jian Lu", "id": "2410.20957v1", "paper_url": "http://arxiv.org/abs/2410.20957v1", "repo": "https://github.com/lizn-zn/nesy-programming"}}