{"2405.10385": {"publish_time": "2024-05-16", "title": "AmazUtah_NLP at SemEval-2024 Task 9: A MultiChoice Question Answering System for Commonsense Defying Reasoning", "paper_summary": "The SemEval 2024 BRAINTEASER task represents a pioneering venture in Natural\nLanguage Processing (NLP) by focusing on lateral thinking, a dimension of\ncognitive reasoning that is often overlooked in traditional linguistic\nanalyses. This challenge comprises of Sentence Puzzle and Word Puzzle subtasks\nand aims to test language models' capacity for divergent thinking.\n  In this paper, we present our approach to the BRAINTEASER task. We employ a\nholistic strategy by leveraging cutting-edge pre-trained models in multiple\nchoice architecture, and diversify the training data with Sentence and Word\nPuzzle datasets. To gain further improvement, we fine-tuned the model with\nsynthetic humor/jokes dataset and the RiddleSense dataset which helped\naugmenting the model's lateral thinking abilities. Empirical results show that\nour approach achieve 92.5\\% accuracy in Sentence Puzzle subtask and 80.2\\%\naccuracy in Word Puzzle subtask.", "paper_summary_zh": "SemEval 2024 BRAINTEASER 任務代表了自然語言處理 (NLP) 的開創性嘗試，重點在於橫向思考，這是一個在傳統語言分析中經常被忽略的認知推理層面。此挑戰包含句子謎題和單字謎題子任務，旨在測試語言模型發散性思考的能力。\n在本文中，我們提出我們對 BRAINTEASER 任務的方法。我們採用整體策略，利用多選架構中的尖端預訓練模型，並使用句子和單字謎題資料集來分散訓練資料。為了進一步改進，我們使用合成幽默/笑話資料集和 RiddleSense 資料集微調模型，這有助於擴充模型的橫向思考能力。經驗結果顯示，我們的方法在句子謎題子任務中達到 92.5% 的準確度，在單字謎題子任務中達到 80.2% 的準確度。", "author": "Mina Ghashami et.al.", "authors": "Mina Ghashami, Soumya Smruti Mishra", "id": "2405.10385v1", "paper_url": "http://arxiv.org/abs/2405.10385v1", "repo": "null"}}