{"2502.03341": {"publish_time": "2025-02-05", "title": "Adaptive Variational Inference in Probabilistic Graphical Models: Beyond Bethe, Tree-Reweighted, and Convex Free Energies", "paper_summary": "Variational inference in probabilistic graphical models aims to approximate\nfundamental quantities such as marginal distributions and the partition\nfunction. Popular approaches are the Bethe approximation, tree-reweighted, and\nother types of convex free energies. These approximations are efficient but can\nfail if the model is complex and highly interactive. In this work, we analyze\ntwo classes of approximations that include the above methods as special cases:\nfirst, if the model parameters are changed; and second, if the entropy\napproximation is changed. We discuss benefits and drawbacks of either approach,\nand deduce from this analysis how a free energy approximation should ideally be\nconstructed. Based on our observations, we propose approximations that\nautomatically adapt to a given model and demonstrate their effectiveness for a\nrange of difficult problems.", "paper_summary_zh": "變異推論中的機率圖形模型旨在近似基本量，例如邊際分布和分配函數。熱門的方法包括貝氏近似、樹重新加權以及其他類型的凸自由能。這些近似很有效率，但如果模型很複雜且互動性很高，則可能會失敗。在這項工作中，我們分析了兩類近似，其中包括上述方法作為特殊情況：首先，如果模型參數已變更；其次，如果熵近似已變更。我們討論了這兩種方法的優缺點，並從這個分析中推論出自由能近似應如何理想地建構。根據我們的觀察，我們提出了可以自動適應給定模型的近似，並展示了它們對一系列困難問題的有效性。", "author": "Harald Leisenberger et.al.", "authors": "Harald Leisenberger, Franz Pernkopf", "id": "2502.03341v1", "paper_url": "http://arxiv.org/abs/2502.03341v1", "repo": "null"}}