{"2406.04625": {"publish_time": "2024-06-07", "title": "Key-Element-Informed sLLM Tuning for Document Summarization", "paper_summary": "Remarkable advances in large language models (LLMs) have enabled high-quality\ntext summarization. However, this capability is currently accessible only\nthrough LLMs of substantial size or proprietary LLMs with usage fees. In\nresponse, smaller-scale LLMs (sLLMs) of easy accessibility and low costs have\nbeen extensively studied, yet they often suffer from missing key information\nand entities, i.e., low relevance, in particular, when input documents are\nlong. We hence propose a key-element-informed instruction tuning for\nsummarization, so-called KEITSum, which identifies key elements in documents\nand instructs sLLM to generate summaries capturing these key elements.\nExperimental results on dialogue and news datasets demonstrate that sLLM with\nKEITSum indeed provides high-quality summarization with higher relevance and\nless hallucinations, competitive to proprietary LLM.", "paper_summary_zh": "大型語言模型 (LLM) 的顯著進展實現了高品質的文字摘要。然而，此功能目前只能透過規模龐大的 LLM 或具有使用費用的專有 LLM 來存取。為了回應此問題，容易存取且成本低的小型 LLM (sLLM) 已廣泛研究，但它們經常會遺漏關鍵資訊和實體，即相關性低，特別是在輸入文件很長時。因此，我們提出一個關鍵元素知情說明調整，用於摘要，稱為 KEITSum，它會識別文件中關鍵元素並指示 sLLM 產生擷取這些關鍵元素的摘要。對話和新聞資料集的實驗結果證明，具備 KEITSum 的 sLLM 確實提供了高品質的摘要，具有更高的相關性和更少的幻覺，可與專有 LLM 相媲美。", "author": "Sangwon Ryu et.al.", "authors": "Sangwon Ryu, Heejin Do, Yunsu Kim, Gary Geunbae Lee, Jungseul Ok", "id": "2406.04625v1", "paper_url": "http://arxiv.org/abs/2406.04625v1", "repo": "null"}}