{"2412.07895": {"publish_time": "2024-12-10", "title": "How Should We Represent History in Interpretable Models of Clinical Policies?", "paper_summary": "Modeling policies for sequential clinical decision-making based on\nobservational data is useful for describing treatment practices, standardizing\nfrequent patterns in treatment, and evaluating alternative policies. For each\ntask, it is essential that the policy model is interpretable. Learning accurate\nmodels requires effectively capturing the state of a patient, either through\nsequence representation learning or carefully crafted summaries of their\nmedical history. While recent work has favored the former, it remains a\nquestion as to how histories should best be represented for interpretable\npolicy modeling. Focused on model fit, we systematically compare diverse\napproaches to summarizing patient history for interpretable modeling of\nclinical policies across four sequential decision-making tasks. We illustrate\ndifferences in the policies learned using various representations by breaking\ndown evaluations by patient subgroups, critical states, and stages of\ntreatment, highlighting challenges specific to common use cases. We find that\ninterpretable sequence models using learned representations perform on par with\nblack-box models across all tasks. Interpretable models using hand-crafted\nrepresentations perform substantially worse when ignoring history entirely, but\nare made competitive by incorporating only a few aggregated and recent elements\nof patient history. The added benefits of using a richer representation are\npronounced for subgroups and in specific use cases. This underscores the\nimportance of evaluating policy models in the context of their intended use.", "paper_summary_zh": "基於觀察資料對序貫臨床決策制定建模政策，有助於描述治療實務、標準化治療中的常見模式，以及評估替代政策。對於每項任務，政策模型的可解釋性至關重要。學習精確的模型需要有效擷取患者的狀態，無論是透過序列表徵學習或精心製作的病史摘要。雖然近期研究偏好前者，但如何以最佳方式表徵病史以進行可解釋的政策建模，仍是一個問題。我們專注於模型擬合度，系統性地比較各種摘要患者病史的方法，以針對四項序貫決策制定任務進行可解釋的臨床政策建模。我們透過按患者子群、危急狀態和治療階段細分評估，來說明使用各種表徵所學習到的政策之間的差異，並強調特定於常見使用案例的挑戰。我們發現，使用學習表徵的可解釋序列模型在所有任務中表現與黑箱模型不相上下。使用手工製作表徵的可解釋模型在完全忽略病史時表現明顯較差，但透過僅納入少數患者病史的彙整和近期元素，便能使其具有競爭力。使用更豐富表徵的額外好處在子群和特定使用案例中顯著。這強調了在預期用途的脈絡中評估政策模型的重要性。", "author": "Anton Matsson et.al.", "authors": "Anton Matsson, Lena Stempfle, Yaochen Rao, Zachary R. Margolin, Heather J. Litman, Fredrik D. Johansson", "id": "2412.07895v1", "paper_url": "http://arxiv.org/abs/2412.07895v1", "repo": "null"}}