{"2408.07237": {"publish_time": "2024-08-13", "title": "Neural embedding of beliefs reveals the role of relative dissonance in human decision-making", "paper_summary": "Beliefs serve as the foundation for human cognition and decision-making. They\nguide individuals in deriving meaning from their lives, shaping their\nbehaviors, and forming social connections. Therefore, a model that encapsulates\nbeliefs and their interrelationships is crucial for quantitatively studying the\ninfluence of beliefs on our actions. Despite its importance, research on the\ninterplay between human beliefs has often been limited to a small set of\nbeliefs pertaining to specific issues, with a heavy reliance on surveys or\nexperiments. Here, we propose a method for extracting nuanced relations between\nthousands of beliefs by leveraging large-scale user participation data from an\nonline debate platform and mapping these beliefs to an embedding space using a\nfine-tuned large language model (LLM). This belief embedding space effectively\nencapsulates the interconnectedness of diverse beliefs as well as polarization\nacross various social issues. We discover that the positions within this belief\nspace predict new beliefs of individuals. Furthermore, we find that the\nrelative distance between one's existing beliefs and new beliefs can serve as a\nquantitative estimate of cognitive dissonance, allowing us to predict new\nbeliefs. Our study highlights how modern LLMs, when combined with collective\nonline records of human beliefs, can offer insights into the fundamental\nprinciples that govern human belief formation and decision-making processes.", "paper_summary_zh": "<paragraph>信念是人类认知和决策的基础。它们\n引导个体从生活中获取意义、塑造他们的\n行为并形成社会联系。因此，一个包含\n信念及其相互关系的模型对于定量研究\n信念对我们行为的影响至关重要。尽管其重要性，对\n人类信念之间相互作用的研究通常仅限于\n与特定问题相关的一小部分信念，并且严重依赖\n调查或实验。在这里，我们提出了一种通过利用\n在线辩论平台的大规模用户参与数据来提取\n数千种信念之间的细微关系的方法，并将这些信念映射到\n嵌入空间，使用经过微调的大语言模型 (LLM)。这个信念嵌入空间有效地\n概括了不同信念之间的相互联系以及\n各种社会问题之间的两极分化。我们发现这个信念\n空间中的位置预测了个体的新的信念。此外，我们发现\n一个人现有信念和新信念之间的相对距离可以作为\n认知失调的定量估计，使我们能够预测新的\n信念。我们的研究重点介绍了现代 LLM 如何与人类信念的集体\n在线记录相结合，可以深入了解支配人类信念形成和决策过程的基本\n原则。</paragraph>", "author": "Byunghwee Lee et.al.", "authors": "Byunghwee Lee, Rachith Aiyappa, Yong-Yeol Ahn, Haewoon Kwak, Jisun An", "id": "2408.07237v1", "paper_url": "http://arxiv.org/abs/2408.07237v1", "repo": "null"}}