{"2405.03939": {"publish_time": "2024-05-07", "title": "Long Context Alignment with Short Instructions and Synthesized Positions", "paper_summary": "Effectively handling instructions with extremely long context remains a\nchallenge for Large Language Models (LLMs), typically necessitating\nhigh-quality long data and substantial computational resources. This paper\nintroduces Step-Skipping Alignment (SkipAlign), a new technique designed to\nenhance the long-context capabilities of LLMs in the phase of alignment without\nthe need for additional efforts beyond training with original data length.\nSkipAlign is developed on the premise that long-range dependencies are\nfundamental to enhancing an LLM's capacity of long context. Departing from\nmerely expanding the length of input samples, SkipAlign synthesizes long-range\ndependencies from the aspect of positions indices. This is achieved by the\nstrategic insertion of skipped positions within instruction-following samples,\nwhich utilizes the semantic structure of the data to effectively expand the\ncontext. Through extensive experiments on base models with a variety of context\nwindow sizes, SkipAlign demonstrates its effectiveness across a spectrum of\nlong-context tasks. Particularly noteworthy is that with a careful selection of\nthe base model and alignment datasets, SkipAlign with only 6B parameters\nachieves it's best performance and comparable with strong baselines like\nGPT-3.5-Turbo-16K on LongBench.", "paper_summary_zh": "有效地處理極長語境的指令仍然是大型語言模型 (LLM) 的一項挑戰，通常需要高品質的長數據和大量的計算資源。本文介紹了跳步對齊 (SkipAlign)，這是一種新技術，旨在增強 LLM 在對齊階段的長語境能力，而無需除了使用原始數據長度進行訓練之外的額外工作。\nSkipAlign 是基於長距離依賴關係對於增強 LLM 的長語境能力至關重要的前提而開發的。與僅僅擴展輸入樣本的長度不同，SkipAlign 從位置索引的角度綜合了長距離依賴關係。這是通過在遵循指令的樣本中策略性地插入跳過的索引位置來實現的，它利用數據的語義結構來有效地擴展語境。通過對具有各種語境窗口大小的基本模型進行廣泛的實驗，SkipAlign 展示了其在各種長語境任務中的有效性。特別值得注意的是，通過仔細選擇基本模型和對齊數據集，只有 6B 參數的 SkipAlign 就能達到其最佳性能，並且在 LongBench 上與 GPT-3.5-Turbo-16K 等強大的基準相當。", "author": "Wenhao Wu et.al.", "authors": "Wenhao Wu, Yizhong Wang, Yao Fu, Xiang Yue, Dawei Zhu, Sujian Li", "id": "2405.03939v1", "paper_url": "http://arxiv.org/abs/2405.03939v1", "repo": "null"}}