{"2405.20700": {"publish_time": "2024-05-31", "title": "Self-degraded contrastive domain adaptation for industrial fault diagnosis with bi-imbalanced data", "paper_summary": "Modern industrial fault diagnosis tasks often face the combined challenge of\ndistribution discrepancy and bi-imbalance. Existing domain adaptation\napproaches pay little attention to the prevailing bi-imbalance, leading to poor\ndomain adaptation performance or even negative transfer. In this work, we\npropose a self-degraded contrastive domain adaptation (Sd-CDA) diagnosis\nframework to handle the domain discrepancy under the bi-imbalanced data. It\nfirst pre-trains the feature extractor via imbalance-aware contrastive learning\nbased on model pruning to learn the feature representation efficiently in a\nself-supervised manner. Then it forces the samples away from the domain\nboundary based on supervised contrastive domain adversarial learning\n(SupCon-DA) and ensures the features generated by the feature extractor are\ndiscriminative enough. Furthermore, we propose the pruned contrastive domain\nadversarial learning (PSupCon-DA) to pay automatically re-weighted attention to\nthe minorities to enhance the performance towards bi-imbalanced data. We show\nthe superiority of the proposed method via two experiments.", "paper_summary_zh": "現代工業故障診斷任務經常面臨分佈差異和二元不平衡的綜合挑戰。現有的域適應方法很少關注普遍存在的二元不平衡，導致域適應性能不佳甚至出現負傳遞。在這項工作中，我們提出了一個自降級對比域適應 (Sd-CDA) 診斷框架，以處理二元不平衡數據下的域差異。它首先通過基於模型剪枝的不平衡感知對比學習對特徵提取器進行預訓練，以自監督的方式有效地學習特徵表示。然後，它基於監督對比域對抗學習 (SupCon-DA) 強制樣本遠離域邊界，並確保特徵提取器產生的特徵具有足夠的區別性。此外，我們提出剪枝對比域對抗學習 (PSupCon-DA) 來自動重新加權關注少數群體，以提高對二元不平衡數據的性能。我們通過兩個實驗展示了所提出方法的優越性。", "author": "Gecheng Chen et.al.", "authors": "Gecheng Chen, Zeyu Yang, Chengwen Luo, Jianqiang Li", "id": "2405.20700v1", "paper_url": "http://arxiv.org/abs/2405.20700v1", "repo": "null"}}