{"2408.07702": {"publish_time": "2024-08-14", "title": "The Death of Schema Linking? Text-to-SQL in the Age of Well-Reasoned Language Models", "paper_summary": "Schema linking is a crucial step in Text-to-SQL pipelines, which translate\nnatural language queries into SQL. The goal of schema linking is to retrieve\nrelevant tables and columns (signal) while disregarding irrelevant ones\n(noise). However, imperfect schema linking can often exclude essential columns\nneeded for accurate query generation. In this work, we revisit the need for\nschema linking when using the latest generation of large language models\n(LLMs). We find empirically that newer models are adept at identifying relevant\nschema elements during generation, without the need for explicit schema\nlinking. This allows Text-to-SQL pipelines to bypass schema linking entirely\nand instead pass the full database schema to the LLM, eliminating the risk of\nexcluding necessary information. Furthermore, as alternatives to schema\nlinking, we propose techniques that improve Text-to-SQL accuracy without\ncompromising on essential schema information. Our approach achieves 71.83\\%\nexecution accuracy on the BIRD benchmark, ranking first at the time of\nsubmission.", "paper_summary_zh": "模式連結是文字轉 SQL 管線中至關重要的一步，它將自然語言查詢轉換成 SQL。模式連結的目標是擷取相關的表格和欄位（訊號），同時忽略不相關的（雜訊）。然而，不完美的模式連結通常會排除產生精準查詢所需的必要欄位。在這項工作中，我們重新探討在使用最新一代大型語言模型（LLM）時模式連結的必要性。我們在經驗上發現，較新的模型在產生過程中很擅長識別相關的模式元素，而不需要明確的模式連結。這允許文字轉 SQL 管線完全繞過模式連結，而將完整的資料庫模式傳遞給 LLM，消除了排除必要資訊的風險。此外，作為模式連結的替代方案，我們提出了一些技術，可以在不損害必要模式資訊的情況下提高文字轉 SQL 的準確性。我們的做法在 BIRD 基準上達到了 71.83% 的執行準確度，在提交時排名第一。", "author": "Karime Maamari et.al.", "authors": "Karime Maamari, Fadhil Abubaker, Daniel Jaroslawicz, Amine Mhedhbi", "id": "2408.07702v1", "paper_url": "http://arxiv.org/abs/2408.07702v1", "repo": "null"}}