{"2502.03395": {"publish_time": "2025-02-05", "title": "Benchmarking Time Series Forecasting Models: From Statistical Techniques to Foundation Models in Real-World Applications", "paper_summary": "Time series forecasting is essential for operational intelligence in the\nhospitality industry, and particularly challenging in large-scale, distributed\nsystems. This study evaluates the performance of statistical, machine learning\n(ML), deep learning, and foundation models in forecasting hourly sales over a\n14-day horizon using real-world data from a network of thousands of restaurants\nacross Germany. The forecasting solution includes features such as weather\nconditions, calendar events, and time-of-day patterns. Results demonstrate the\nstrong performance of ML-based meta-models and highlight the emerging potential\nof foundation models like Chronos and TimesFM, which deliver competitive\nperformance with minimal feature engineering, leveraging only the pre-trained\nmodel (zero-shot inference). Additionally, a hybrid PySpark-Pandas approach\nproves to be a robust solution for achieving horizontal scalability in\nlarge-scale deployments.", "paper_summary_zh": "時序預測對於飯店業的營運情報至關重要，特別是在大型分布式系統中具有挑戰性。本研究評估了統計、機器學習 (ML)、深度學習和基礎模型在使用來自德國數千家餐廳網路的真實世界資料預測 14 天期限內每小時銷售額的效能。預測解決方案包括天氣狀況、日曆事件和時間模式等功能。結果證明了基於 ML 的元模型的強勁效能，並強調了 Chronos 和 TimesFM 等基礎模型的新興潛力，它們僅利用預先訓練的模型（零次學習推論）就能在最小的特徵工程下提供具有競爭力的效能。此外，混合 PySpark-Pandas 方法被證明是實現大規模部署中橫向擴充性的強大解決方案。", "author": "Issar Arab et.al.", "authors": "Issar Arab, Rodrigo Benitez", "id": "2502.03395v1", "paper_url": "http://arxiv.org/abs/2502.03395v1", "repo": "null"}}