{"2409.08680": {"publish_time": "2024-09-13", "title": "NEST-RQ: Next Token Prediction for Speech Self-Supervised Pre-Training", "paper_summary": "Speech self-supervised pre-training can effectively improve the performance\nof downstream tasks. However, previous self-supervised learning (SSL) methods\nfor speech, such as HuBERT and BEST-RQ, focus on utilizing non-causal encoders\nwith bidirectional context, and lack sufficient support for downstream\nstreaming models. To address this issue, we introduce the next token prediction\nbased speech pre-training method with random-projection quantizer (NEST-RQ).\nNEST-RQ employs causal encoders with only left context and uses next token\nprediction (NTP) as the training task. On the large-scale dataset, compared to\nBEST-RQ, the proposed NEST-RQ achieves comparable performance on non-streaming\nautomatic speech recognition (ASR) and better performance on streaming ASR. We\nalso conduct analytical experiments in terms of the future context size of\nstreaming ASR, the codebook quality of SSL and the model size of the encoder.\nIn summary, the paper demonstrates the feasibility of the NTP in speech SSL and\nprovides empirical evidence and insights for speech SSL research.", "paper_summary_zh": "語音自我監督預訓練能有效提升下游任務的表現。然而，先前的語音自我監督學習 (SSL) 方法，例如 HuBERT 和 BEST-RQ，專注於利用具有雙向脈絡的非因果編碼器，且缺乏對下游串流模型的足夠支援。為了解決這個問題，我們引入了基於下一個標記預測的語音預訓練方法，並搭配隨機投影量化器 (NEST-RQ)。NEST-RQ 採用僅有左脈絡的因果編碼器，並使用下一個標記預測 (NTP) 作為訓練任務。在大型資料集上，與 BEST-RQ 相比，所提出的 NEST-RQ 在非串流自動語音辨識 (ASR) 上達到了相當的表現，而在串流 ASR 上則有更好的表現。我們也針對串流 ASR 的未來脈絡大小、SSL 的碼本品質和編碼器的模型大小進行了分析實驗。總之，本文證明了 NTP 在語音 SSL 中的可行性，並為語音 SSL 研究提供了實證證據和見解。", "author": "Minglun Han et.al.", "authors": "Minglun Han, Ye Bai, Chen Shen, Youjia Huang, Mingkun Huang, Zehua Lin, Linhao Dong, Lu Lu, Yuxuan Wang", "id": "2409.08680v1", "paper_url": "http://arxiv.org/abs/2409.08680v1", "repo": "null"}}