{"2405.16908": {"publish_time": "2024-05-27", "title": "Can Large Language Models Faithfully Express Their Intrinsic Uncertainty in Words?", "paper_summary": "We posit that large language models (LLMs) should be capable of expressing\ntheir intrinsic uncertainty in natural language. For example, if the LLM is\nequally likely to output two contradicting answers to the same question, then\nits generated response should reflect this uncertainty by hedging its answer\n(e.g., \"I'm not sure, but I think...\"). We formalize faithful response\nuncertainty based on the gap between the model's intrinsic confidence in the\nassertions it makes and the decisiveness by which they are conveyed. This\nexample-level metric reliably indicates whether the model reflects its\nuncertainty, as it penalizes both excessive and insufficient hedging. We\nevaluate a variety of aligned LLMs at faithfully communicating uncertainty on\nseveral knowledge-intensive question answering tasks. Our results provide\nstrong evidence that modern LLMs are poor at faithfully conveying their\nuncertainty, and that better alignment is necessary to improve their\ntrustworthiness.", "paper_summary_zh": "我們假設大型語言模型 (LLM) 應該能夠以自然語言表達其內在的不確定性。例如，如果 LLM 很可能會對同一個問題輸出兩個相互矛盾的答案，那麼它生成的回應應該反映這種不確定性，並對其答案進行對沖（例如，「我不確定，但我認為...」）。我們根據模型對其所做斷言的內在信心與傳達這些斷言的果斷程度之間的差距，對忠實的回應不確定性進行形式化。這個範例層級的指標可靠地指出模型是否反映了其不確定性，因為它懲罰過度和不足的對沖。我們評估各種對齊的 LLM 在忠實地傳達不確定性方面的表現，針對多項知識密集型問題回答任務。我們的結果提供了強有力的證據，表明現代 LLM 在忠實傳達其不確定性方面表現不佳，並且需要更好的對齊才能提高其可信度。", "author": "Gal Yona et.al.", "authors": "Gal Yona, Roee Aharoni, Mor Geva", "id": "2405.16908v1", "paper_url": "http://arxiv.org/abs/2405.16908v1", "repo": "null"}}