{"2409.15955": {"publish_time": "2024-09-24", "title": "Historical Trajectory Assisted Zeroth-Order Federated Optimization", "paper_summary": "Federated learning is a distributed learning framework which enables clients\nto train models individually and to upload their model updates for aggregation.\nThe local training process heavily relies on distributed gradient descent\ntechniques. In the situation where gradient information is not available, the\ngradients need to be estimated from zeroth-order information, which typically\ninvolves computing finite-differences along isotropic random directions. This\nmethod suffers from high estimation errors, as the geometric features of the\nobjective landscape may be overlooked during the isotropic sampling. In this\nwork, we propose a non-isotropic sampling method to improve the gradient\nestimation procedure. Gradients in our method are estimated in a subspace\nspanned by historical trajectories of solutions, aiming to encourage the\nexploration of promising regions and hence improve the convergence. We\nimplement this method in zeroth-order federated settings, and show that the\nconvergence rate aligns with existing ones while introducing no significant\noverheads in communication or local computation. The effectiveness of our\nproposal is verified on several numerical experiments in comparison to several\ncommonly-used zeroth-order federated optimization algorithms.", "paper_summary_zh": "聯邦式學習是一種分散式學習架構，它讓客戶端能夠個別訓練模型，並上傳他們的模型更新以進行彙總。\n本地的訓練程序極度依賴分散式梯度下降技術。在無法取得梯度資訊的情況下，需要從零階資訊估計梯度，這通常需要沿著各向同性隨機方向計算有限差分。這種方法會有較高的估計誤差，因為在各向同性抽樣期間可能會忽略目標景觀的幾何特徵。在此項工作中，我們提出了一種非各向同性抽樣方法來改善梯度估計程序。我們的方法中的梯度是在由解的歷史軌跡所構成的子空間中估計的，旨在鼓勵探索有前景的區域，從而改善收斂性。我們在零階聯邦式設定中實作此方法，並表明收斂速度與現有方法一致，同時在通訊或本地運算中不會引入任何顯著的開銷。與幾個常用的零階聯邦式最佳化演算法相比，我們的建議在幾個數值實驗中驗證了其有效性。", "author": "Xiaoyu He et.al.", "authors": "Xiaoyu He, Chenlin Wu, Zike Li, Zibin Zheng", "id": "2409.15955v2", "paper_url": "http://arxiv.org/abs/2409.15955v2", "repo": "null"}}