{"2407.09417": {"publish_time": "2024-07-12", "title": "Mitigating Entity-Level Hallucination in Large Language Models", "paper_summary": "The emergence of Large Language Models (LLMs) has revolutionized how users\naccess information, shifting from traditional search engines to direct\nquestion-and-answer interactions with LLMs. However, the widespread adoption of\nLLMs has revealed a significant challenge known as hallucination, wherein LLMs\ngenerate coherent yet factually inaccurate responses. This hallucination\nphenomenon has led to users' distrust in information retrieval systems based on\nLLMs. To tackle this challenge, this paper proposes Dynamic Retrieval\nAugmentation based on hallucination Detection (DRAD) as a novel method to\ndetect and mitigate hallucinations in LLMs. DRAD improves upon traditional\nretrieval augmentation by dynamically adapting the retrieval process based on\nreal-time hallucination detection. It features two main components: Real-time\nHallucination Detection (RHD) for identifying potential hallucinations without\nexternal models, and Self-correction based on External Knowledge (SEK) for\ncorrecting these errors using external knowledge. Experiment results show that\nDRAD demonstrates superior performance in both detecting and mitigating\nhallucinations in LLMs. All of our code and data are open-sourced at\nhttps://github.com/oneal2000/EntityHallucination.", "paper_summary_zh": "大型語言模型 (LLM) 的出現徹底改變了使用者存取資訊的方式，從傳統的搜尋引擎轉變為與 LLM 直接進行問答互動。然而，LLM 的廣泛採用揭露了一個重大的挑戰，稱為幻覺，其中 LLM 會產生連貫但事實上不正確的回應。這種幻覺現象導致使用者不信任基於 LLM 的資訊檢索系統。為了應對這個挑戰，本文提出基於幻覺偵測的動態檢索擴充 (DRAD)，作為一種偵測和減輕 LLM 中幻覺的新方法。DRAD 透過根據即時幻覺偵測動態調整檢索程序，來改進傳統的檢索擴充。它具有兩個主要組成部分：無需外部模型即可識別潛在幻覺的即時幻覺偵測 (RHD)，以及使用外部知識進行自我修正 (SEK) 以利用外部知識來修正這些錯誤。實驗結果顯示，DRAD 在偵測和減輕 LLM 中的幻覺方面都展現出優異的效能。我們所有的程式碼和資料都開放原始碼，網址為 https://github.com/oneal2000/EntityHallucination。", "author": "Weihang Su et.al.", "authors": "Weihang Su, Yichen Tang, Qingyao Ai, Changyue Wang, Zhijing Wu, Yiqun Liu", "id": "2407.09417v1", "paper_url": "http://arxiv.org/abs/2407.09417v1", "repo": "https://github.com/oneal2000/entityhallucination"}}