{"2412.07111": {"publish_time": "2024-12-10", "title": "Predictable Emergent Abilities of LLMs: Proxy Tasks Are All You Need", "paper_summary": "While scaling laws optimize training configurations for large language models\n(LLMs) through experiments on smaller or early-stage models, they fail to\npredict emergent abilities due to the absence of such capabilities in these\nmodels. To address this, we propose a method that predicts emergent abilities\nby leveraging proxy tasks. We begin by establishing relevance metrics between\nthe target task and candidate tasks based on performance differences across\nmultiple models. These candidate tasks are then validated for robustness with\nsmall model ensembles, leading to the selection of the most appropriate proxy\ntasks. The predicted performance on the target task is then derived by\nintegrating the evaluation results of these proxies. In a case study on tool\nutilization capabilities, our method demonstrated a strong correlation between\npredicted and actual performance, confirming its effectiveness.", "paper_summary_zh": "儘管規模定律透過在較小或早期階段的模型上進行實驗，來最佳化大型語言模型 (LLM) 的訓練設定，但由於這些模型缺乏此類能力，因此無法預測新興能力。為了解決此問題，我們提出了一種透過利用代理任務來預測新興能力的方法。我們首先根據多個模型的效能差異，在目標任務和候選任務之間建立相關性指標。然後針對這些候選任務驗證其與小型模型集合的穩健性，從而選出最合適的代理任務。接著透過整合這些代理的評估結果，推導出目標任務的預測效能。在工具使用能力的案例研究中，我們的模型證明了預測效能與實際效能之間有很強的相關性，證實了其有效性。", "author": "Bo-Wen Zhang et.al.", "authors": "Bo-Wen Zhang, Yan Yan, Boxiang Yang, Yifei Xue, Guang Liu", "id": "2412.07111v1", "paper_url": "http://arxiv.org/abs/2412.07111v1", "repo": "null"}}