{"2411.15993": {"publish_time": "2024-11-24", "title": "Investigating Factuality in Long-Form Text Generation: The Roles of Self-Known and Self-Unknown", "paper_summary": "Large language models (LLMs) have demonstrated strong capabilities in text\nunderstanding and generation. However, they often lack factuality, producing a\nmixture of true and false information, especially in long-form generation. In\nthis work, we investigates the factuality of long-form text generation across\nvarious large language models (LLMs), including GPT-4, Gemini-1.5-Pro,\nClaude-3-Opus, Llama-3-70B, and Mistral. Our analysis reveals that factuality\nscores tend to decline in later sentences of the generated text, accompanied by\na rise in the number of unsupported claims. Furthermore, we explore the\neffectiveness of different evaluation settings to assess whether LLMs can\naccurately judge the correctness of their own outputs: Self-Known (the\npercentage of supported atomic claims, decomposed from LLM outputs, that the\ncorresponding LLMs judge as correct) and Self-Unknown (the percentage of\nunsupported atomic claims that the corresponding LLMs judge as incorrect). The\nresults indicate that even advanced models like GPT-4 and Gemini-1.5-Pro fail\nto achieve perfect Self-Known scores, while their Self-Unknown scores remain\nnotably above zero, reflecting ongoing uncertainty in their self-assessments.\nMoreover, we find a correlation between higher Self-Known scores and improved\nfactuality, while higher Self-Unknown scores are associated with lower\nfactuality. Interestingly, even without significant changes in the models'\nself-judgment (Self-Known and Self-Unknown), the number of unsupported claims\ncan increases, likely as an artifact of long-form generation. These findings\nshow the limitations of current LLMs in long-form generation, and provide\nvaluable insights for improving factuality in long-form text generation.", "paper_summary_zh": "大型語言模型 (LLM) 已展現出強大的文字理解和生成能力。然而，它們往往缺乏事實性，產生真假訊息混雜的內容，特別是在長篇生成中。在此研究中，我們探討了各種大型語言模型 (LLM) 的長篇文字生成的真實性，包括 GPT-4、Gemini-1.5-Pro、Claude-3-Opus、Llama-3-70B 和 Mistral。我們的分析顯示，生成文字的後續句子中真實性分數往往下降，同時缺乏依據的主張數量增加。此外，我們探討了不同評估設定的有效性，以評估 LLM 是否能準確判斷其自身輸出的正確性：自知（LLM 輸出中分解出的已支持原子主張的百分比，對應的 LLM 判斷為正確）和自不知（LLM 輸出中分解出的未支持原子主張的百分比，對應的 LLM 判斷為不正確）。結果表明，即使是 GPT-4 和 Gemini-1.5-Pro 等進階模型也無法達到完美的自知分數，而其自不知分數仍顯著高於零，反映出其自我評估中持續存在的不確定性。此外，我們發現自知分數較高與真實性提升之間存在關聯，而自不知分數較高則與真實性降低相關。有趣的是，即使模型的自判斷（自知和自不知）沒有顯著變化，未支持主張的數量仍可能增加，這可能是長篇生成的產物。這些發現顯示了當前 LLM 在長篇生成中的局限性，並為改善長篇文字生成的真實性提供了有價值的見解。", "author": "Lifu Tu et.al.", "authors": "Lifu Tu, Rui Meng, Shafiq Joty, Yingbo Zhou, Semih Yavuz", "id": "2411.15993v1", "paper_url": "http://arxiv.org/abs/2411.15993v1", "repo": "null"}}