{"2412.08521": {"publish_time": "2024-12-11", "title": "EMS: Adaptive Evict-then-Merge Strategy for Head-wise KV Cache Compression Based on Global-Local Importance", "paper_summary": "As large language models (LLMs) continue to advance, the demand for higher\nquality and faster processing of long contexts across various applications is\ngrowing. KV cache is widely adopted as it stores previously generated key and\nvalue tokens, effectively reducing redundant computations during inference.\nHowever, as memory overhead becomes a significant concern, efficient\ncompression of KV cache has gained increasing attention. Most existing methods\nperform compression from two perspectives: identifying important tokens and\ndesigning compression strategies. However, these approaches often produce\nbiased distributions of important tokens due to the influence of accumulated\nattention scores or positional encoding. Furthermore, they overlook the\nsparsity and redundancy across different heads, which leads to difficulties in\npreserving the most effective information at the head level. To this end, we\npropose EMS to overcome these limitations, while achieving better KV cache\ncompression under extreme compression ratios. Specifically, we introduce a\nGlobal-Local score that combines accumulated attention scores from both global\nand local KV tokens to better identify the token importance. For the\ncompression strategy, we design an adaptive and unified Evict-then-Merge\nframework that accounts for the sparsity and redundancy of KV tokens across\ndifferent heads. Additionally, we implement the head-wise parallel compression\nthrough a zero-class mechanism to enhance efficiency. Extensive experiments\ndemonstrate our SOTA performance even under extreme compression ratios. EMS\nconsistently achieves the lowest perplexity, improves scores by over 1.28\npoints across four LLMs on LongBench under a 256 cache budget, and preserves\n95% retrieval accuracy with a cache budget less than 2% of the context length\nin the Needle-in-a-Haystack task.", "paper_summary_zh": "隨著大型語言模型 (LLM) 持續進步，對於各種應用程式中更長內容的高品質和更快速處理的需求也與日俱增。KV 快取被廣泛採用，因為它儲存先前產生的金鑰和值權杖，有效地減少推理期間的冗餘運算。然而，隨著記憶體開銷成為一個重要的問題，KV 快取的有效壓縮也越來越受到重視。現有的方法大多從兩個角度進行壓縮：識別重要權杖和設計壓縮策略。然而，由於累積注意力分數或位置編碼的影響，這些方法通常會產生重要權杖的偏差分佈。此外，它們忽略了不同頭部之間的稀疏性和冗餘，這導致難以在頭部層級保留最有效的資訊。為此，我們提出 EMS 來克服這些限制，同時在極端的壓縮比下實現更好的 KV 快取壓縮。具體來說，我們引入了一個結合來自全局和局部 KV 權杖的累積注意力分數的全局局部分數，以更好地識別權杖的重要性。對於壓縮策略，我們設計了一個適應性和統一性的逐出再合併架構，它考量了不同頭部中 KV 權杖的稀疏性和冗餘。此外，我們透過零類別機制實現頭部明智的平行壓縮，以提高效率。廣泛的實驗證明了我們即使在極端的壓縮比下也能達到 SOTA 效能。在 LongBench 上的四個 LLM 中，EMS 在 256 快取預算下持續實現最低困惑度，將分數提高了 1.28 分以上，並在 Needle-in-a-Haystack 任務中以小於內容長度 2% 的快取預算保留了 95% 的檢索準確度。", "author": "Yingxin Li et.al.", "authors": "Yingxin Li, Ye Li, Yuan Meng, Xinzhu Ma, Zihan Geng, Shutao Xia, Zhi Wang", "id": "2412.08521v1", "paper_url": "http://arxiv.org/abs/2412.08521v1", "repo": "null"}}