{"2502.06693": {"publish_time": "2025-02-10", "title": "Recent Advances, Applications and Open Challenges in Machine Learning for Health: Reflections from Research Roundtables at ML4H 2024 Symposium", "paper_summary": "The fourth Machine Learning for Health (ML4H) symposium was held in person on\nDecember 15th and 16th, 2024, in the traditional, ancestral, and unceded\nterritories of the Musqueam, Squamish, and Tsleil-Waututh Nations in Vancouver,\nBritish Columbia, Canada. The symposium included research roundtable sessions\nto foster discussions between participants and senior researchers on timely and\nrelevant topics for the ML4H community. The organization of the research\nroundtables at the conference involved 13 senior and 27 junior chairs across 13\ntables. Each roundtable session included an invited senior chair (with\nsubstantial experience in the field), junior chairs (responsible for\nfacilitating the discussion), and attendees from diverse backgrounds with an\ninterest in the session's topic.", "paper_summary_zh": "第四屆醫療機器學習 (ML4H) 研討會於 2024 年 12 月 15 日和 16 日在加拿大不列顛哥倫比亞省溫哥華的 Musqueam、Squamish 和 Tsleil-Waututh 國家的傳統、祖先和未割讓領土上舉行。研討會包括研究圓桌會議，以促進參與者和高級研究人員之間關於 ML4H 社群的及時和相關主題的討論。在會議上組織研究圓桌會議涉及 13 張桌子上的 13 位高級主席和 27 位初級主席。每個圓桌會議都包括一位受邀的高級主席（在該領域擁有豐富的經驗）、初級主席（負責促進討論）以及對會議主題感興趣的來自不同背景的與會者。", "author": "Amin Adibi et.al.", "authors": "Amin Adibi, Xu Cao, Zongliang Ji, Jivat Neet Kaur, Winston Chen, Elizabeth Healey, Brighton Nuwagira, Wenqian Ye, Geoffrey Woollard, Maxwell A Xu, Hejie Cui, Johnny Xi, Trenton Chang, Vasiliki Bikia, Nicole Zhang, Ayush Noori, Yuan Xia, Md. Belal Hossain, Hanna A. Frank, Alina Peluso, Yuan Pu, Shannon Zejiang Shen, John Wu, Adibvafa Fallahpour, Sazan Mahbub, Ross Duncan, Yuwei Zhang, Yurui Cao, Zuheng Xu, Michael Craig, Rahul G. Krishnan, Rahmatollah Beheshti, James M. Rehg, Mohammad Ehsanul Karim, Megan Coffee, Leo Anthony Celi, Jason Alan Fries, Mohsen Sadatsafavi, Dennis Shung, Shannon McWeeney, Jessica Dafflon, Sarah Jabbour", "id": "2502.06693v1", "paper_url": "http://arxiv.org/abs/2502.06693v1", "repo": "null"}}