{"2412.19026": {"publish_time": "2024-12-26", "title": "Modality-Projection Universal Model for Comprehensive Full-Body Medical Imaging Segmentation", "paper_summary": "The integration of deep learning in medical imaging has shown great promise\nfor enhancing diagnostic, therapeutic, and research outcomes. However, applying\nuniversal models across multiple modalities remains challenging due to the\ninherent variability in data characteristics. This study aims to introduce and\nevaluate a Modality Projection Universal Model (MPUM). MPUM employs a novel\nmodality-projection strategy, which allows the model to dynamically adjust its\nparameters to optimize performance across different imaging modalities. The\nMPUM demonstrated superior accuracy in identifying anatomical structures,\nenabling precise quantification for improved clinical decision-making. It also\nidentifies metabolic associations within the brain-body axis, advancing\nresearch on brain-body physiological correlations. Furthermore, MPUM's unique\ncontroller-based convolution layer enables visualization of saliency maps\nacross all network layers, significantly enhancing the model's\ninterpretability.", "paper_summary_zh": "深度學習在醫學影像中的整合已展現出極大的前景，用於增強診斷、治療和研究成果。然而，由於資料特性的內在變異性，在多種方式中應用通用模型仍然具有挑戰性。本研究旨在介紹和評估方式投影通用模型 (MPUM)。MPUM 採用一種新穎的方式投影策略，使模型能夠動態調整其參數，以優化不同影像方式的效能。MPUM 在識別解剖結構方面表現出優異的準確性，能夠進行精確量化，以改善臨床決策制定。它還識別出腦體軸內的代謝關聯，推動了對腦體生理相關性的研究。此外，MPUM 獨特的基於控制器的卷積層能夠視覺化所有網路層的顯著性圖，顯著增強了模型的可解釋性。", "author": "Yixin Chen et.al.", "authors": "Yixin Chen, Lin Gao, Yajuan Gao, Rui Wang, Jingge Lian, Xiangxi Meng, Yanhua Duan, Leiying Chai, Hongbin Han, Zhaoping Cheng, Zhaoheng Xie", "id": "2412.19026v1", "paper_url": "http://arxiv.org/abs/2412.19026v1", "repo": "https://github.com/yixinchen-ai/mpum"}}