{"2412.03011": {"publish_time": "2024-12-04", "title": "Human Multi-View Synthesis from a Single-View Model:Transferred Body and Face Representations", "paper_summary": "Generating multi-view human images from a single view is a complex and\nsignificant challenge. Although recent advancements in multi-view object\ngeneration have shown impressive results with diffusion models, novel view\nsynthesis for humans remains constrained by the limited availability of 3D\nhuman datasets. Consequently, many existing models struggle to produce\nrealistic human body shapes or capture fine-grained facial details accurately.\nTo address these issues, we propose an innovative framework that leverages\ntransferred body and facial representations for multi-view human synthesis.\nSpecifically, we use a single-view model pretrained on a large-scale human\ndataset to develop a multi-view body representation, aiming to extend the 2D\nknowledge of the single-view model to a multi-view diffusion model.\nAdditionally, to enhance the model's detail restoration capability, we\nintegrate transferred multimodal facial features into our trained human\ndiffusion model. Experimental evaluations on benchmark datasets demonstrate\nthat our approach outperforms the current state-of-the-art methods, achieving\nsuperior performance in multi-view human synthesis.", "paper_summary_zh": "從單一視角生成多視角的人類影像是一項複雜且重大的挑戰。儘管最近在多視角物件生成方面的進展已在擴散模型中展現令人印象深刻的成果，但人類的新視角合成仍受到 3D 人類資料集有限的可用性所限制。因此，許多現有模型難以產生逼真的人體形狀或準確捕捉細緻的面部細節。為了解決這些問題，我們提出了一個創新的架構，該架構利用轉移的身體和面部表示來進行多視角人類合成。具體來說，我們使用在大型人類資料集上預先訓練的單視角模型來開發多視角身體表示，旨在將單視角模型的 2D 知識擴展到多視角擴散模型。此外，為了增強模型的細節還原能力，我們將轉移的多模態面部特徵整合到我們訓練的人類擴散模型中。在基準資料集上的實驗評估表明，我們的做法優於目前的最新方法，在多視角人類合成中取得了卓越的性能。", "author": "Yu Feng et.al.", "authors": "Yu Feng, Shunsi Zhang, Jian Shu, Hanfeng Zhao, Guoliang Pang, Chi Zhang, Hao Wang", "id": "2412.03011v1", "paper_url": "http://arxiv.org/abs/2412.03011v1", "repo": "null"}}