{"2502.09913": {"publish_time": "2025-02-14", "title": "AutoS$^2$earch: Unlocking the Reasoning Potential of Large Models for Web-based Source Search", "paper_summary": "Web-based management systems have been widely used in risk control and\nindustrial safety. However, effectively integrating source search capabilities\ninto these systems, to enable decision-makers to locate and address the hazard\n(e.g., gas leak detection) remains a challenge. While prior efforts have\nexplored using web crowdsourcing and AI algorithms for source search decision\nsupport, these approaches suffer from overheads in recruiting human\nparticipants and slow response times in time-sensitive situations. To address\nthis, we introduce AutoS$^2$earch, a novel framework leveraging large models\nfor zero-shot source search in web applications. AutoS$^2$earch operates on a\nsimplified visual environment projected through a web-based display, utilizing\na chain-of-thought prompt designed to emulate human reasoning. The multi-modal\nlarge language model (MLLMs) dynamically converts visual observations into\nlanguage descriptions, enabling the LLM to perform linguistic reasoning on four\ndirectional choices. Extensive experiments demonstrate that AutoS$^2$earch\nachieves performance nearly equivalent to human-AI collaborative source search\nwhile eliminating dependency on crowdsourced labor. Our work offers valuable\ninsights in using web engineering to design such autonomous systems in other\nindustrial applications.", "paper_summary_zh": "基於網路的管理系統已廣泛用於風險控管和工業安全。然而，有效地將來源搜尋功能整合到這些系統中，以使決策者能夠定位和處理危害（例如，氣體洩漏偵測）仍然是一項挑戰。雖然先前的努力已探討使用網路群眾外包和 AI 演算法來進行來源搜尋決策支援，但這些方法在招募人類參與者時會產生額外的負擔，且在時間敏感的情況下反應時間較慢。為了解決這個問題，我們引入了 AutoS$^2$earch，一個利用大型模型進行網路應用程式中零次學習來源搜尋的新架構。AutoS$^2$earch 運作在透過網路顯示器投影出的簡化視覺環境中，利用旨在模擬人類推理的思考鏈提示。多模態大型語言模型 (MLLM) 會動態地將視覺觀察轉換為語言描述，使 LLM 能對四個方向選擇執行語言推理。廣泛的實驗證明，AutoS$^2$earch 達到了幾乎等同於人類與 AI 協作來源搜尋的效能，同時消除了對群眾外包勞動的依賴。我們的研究提供了寶貴的見解，說明如何使用網路工程在其他工業應用中設計此類自主系統。", "author": "Zhengqiu Zhu et.al.", "authors": "Zhengqiu Zhu, Yatai Ji, Jiaheng Huang, Yong Zhao, Sihang Qiu, Rusheng Ju", "id": "2502.09913v1", "paper_url": "http://arxiv.org/abs/2502.09913v1", "repo": "null"}}