{"2410.18764": {"publish_time": "2024-10-24", "title": "Task Calibration: Calibrating Large Language Models on Inference Tasks", "paper_summary": "Large language models (LLMs) have exhibited impressive zero-shot performance\non inference tasks. However, LLMs may suffer from spurious correlations between\ninput texts and output labels, which limits LLMs' ability to reason based\npurely on general language understanding. In other words, LLMs may make\npredictions primarily based on premise or hypothesis, rather than both\ncomponents. To address this problem that may lead to unexpected performance\ndegradation, we propose task calibration (TC), a zero-shot and inference-only\ncalibration method inspired by mutual information which recovers LLM\nperformance through task reformulation. TC encourages LLMs to reason based on\nboth premise and hypothesis, while mitigating the models' over-reliance on\nindividual premise or hypothesis for inference. Experimental results show that\nTC achieves a substantial improvement on 13 inference tasks in the zero-shot\nsetup. We further validate the effectiveness of TC in few-shot setups and\nvarious natural language understanding tasks. Further analysis indicates that\nTC is also robust to prompt templates and has the potential to be integrated\nwith other calibration methods.", "paper_summary_zh": "大型語言模型 (LLM) 在推理任務中展現出令人印象深刻的零次學習表現。然而，LLM 可能會受到輸入文本和輸出標籤之間虛假的關聯影響，這限制了 LLM 純粹基於一般語言理解進行推理的能力。換句話說，LLM 可能主要基於前提或假設，而不是同時基於兩個組成部分來做出預測。為了解決這個可能導致意外效能下降的問題，我們提出了任務校準 (TC)，這是一種零次學習且僅限於推理的校準方法，其靈感來自於互惠資訊，它透過任務重新制定來恢復 LLM 的效能。TC 鼓勵 LLM 基於前提和假設進行推理，同時減輕模型過度依賴於個別前提或假設進行推理的情況。實驗結果顯示，TC 在零次學習設定中對 13 項推理任務實現了顯著的改善。我們進一步驗證了 TC 在少次學習設定和各種自然語言理解任務中的有效性。進一步的分析表明，TC 對提示範本也具有魯棒性，並且有潛力與其他校準方法整合。", "author": "Yingjie Li et.al.", "authors": "Yingjie Li, Yun Luo, Xiaotian Xie, Yue Zhang", "id": "2410.18764v1", "paper_url": "http://arxiv.org/abs/2410.18764v1", "repo": "null"}}