{"2410.15999": {"publish_time": "2024-10-21", "title": "Steering Knowledge Selection Behaviours in LLMs via SAE-Based Representation Engineering", "paper_summary": "Large language models (LLMs) can store a significant amount of factual\nknowledge in their parameters. However, their parametric knowledge may conflict\nwith the information provided in the context -- this phenomenon, known as\n\\emph{context-memory knowledge conflicts}, can lead to undesirable model\nbehaviour, such as reliance on outdated or incorrect information. Analysing the\ninternal activations of LLMs, we find that they can internally register the\nsignals of knowledge conflict at mid-layers. Such signals allow us to detect\nwhether a knowledge conflict occurs and use \\emph{inference-time} intervention\nstrategies to resolve it. In this work, we propose \\textsc{SpARE}, a\n\\emph{training-free} representation engineering method that uses pre-trained\nsparse auto-encoders (SAEs) to control the knowledge selection behaviour of\nLLMs. \\textsc{SpARE} identifies the functional features that control the\nknowledge selection behaviours and applies them to edit the internal\nactivations of LLMs at inference time. Our experimental results show that\n\\textsc{SpARE} can effectively control the usage of either knowledge source to\nresolve knowledge conflict in open-domain question-answering tasks, surpassing\nexisting representation engineering methods ($+10\\%$) as well as contrastive\ndecoding methods ($+15\\%$).", "paper_summary_zh": "大型語言模型 (LLM) 可以將大量的實際知識儲存在其參數中。然而，它們的參數化知識可能會與上下文中提供的資訊產生衝突——這種現象稱為「上下文記憶知識衝突」，可能會導致不良的模型行為，例如依賴過時或不正確的資訊。分析 LLM 的內部激活，我們發現它們可以在中間層內部註冊知識衝突的信號。此類信號使我們能夠偵測知識衝突是否發生，並使用「推論時間」介入策略來解決它。在這項工作中，我們提出 \\textsc{SpARE}，一種「無訓練」的表示工程方法，它使用預先訓練的稀疏自動編碼器 (SAE) 來控制 LLM 的知識選擇行為。\\textsc{SpARE} 識別控制知識選擇行為的功能特徵，並將它們應用於編輯 LLM 在推論時間的內部激活。我們的實驗結果表明，\\textsc{SpARE} 可以有效控制任一知識來源的使用，以解決開放領域問答任務中的知識衝突，超越現有的表示工程方法（+10%）以及對比解碼方法（+15%）。", "author": "Yu Zhao et.al.", "authors": "Yu Zhao, Alessio Devoto, Giwon Hong, Xiaotang Du, Aryo Pradipta Gema, Hongru Wang, Kam-Fai Wong, Pasquale Minervini", "id": "2410.15999v1", "paper_url": "http://arxiv.org/abs/2410.15999v1", "repo": "null"}}