{"2410.19479": {"publish_time": "2024-10-25", "title": "Peter Parker or Spiderman? Disambiguating Multiple Class Labels", "paper_summary": "In the supervised classification setting, during inference, deep networks\ntypically make multiple predictions. For a pair of such predictions (that are\nin the top-k predictions), two distinct possibilities might occur. On the one\nhand, each of the two predictions might be primarily driven by two distinct\nsets of entities in the input. On the other hand, it is possible that there is\na single entity or set of entities that is driving the prediction for both the\nclasses in question. This latter case, in effect, corresponds to the network\nmaking two separate guesses about the identity of a single entity type.\nClearly, both the guesses cannot be true, i.e. both the labels cannot be\npresent in the input. Current techniques in interpretability research do not\nreadily disambiguate these two cases, since they typically consider input\nattributions for one class label at a time. Here, we present a framework and\nmethod to do so, leveraging modern segmentation and input attribution\ntechniques. Notably, our framework also provides a simple counterfactual\n\"proof\" of each case, which can be verified for the input on the model (i.e.\nwithout running the method again). We demonstrate that the method performs well\nfor a number of samples from the ImageNet validation set and on multiple\nmodels.", "paper_summary_zh": "在監督式分類設定中，在推論期間，深度網路通常會做出多個預測。對於這樣一對預測（在 top-k 預測中），可能會出現兩種不同的可能性。一方面，這兩個預測中的每一個都可能主要由輸入中兩組不同的實體驅動。另一方面，也可能存在一個實體或實體集，驅動著對問題中兩個類別的預測。後一種情況實際上對應於網路對單一實體類型的身份做出兩個不同的猜測。顯然，這兩個猜測都不可能是真的，即兩個標籤都不可能存在於輸入中。可解釋性研究中的當前技術並不能輕易地區分這兩種情況，因為它們通常一次考慮一個類別標籤的輸入歸因。在這裡，我們提出了一個框架和方法來這樣做，利用現代分割和輸入歸因技術。值得注意的是，我們的框架還提供了每種情況的簡單反事實“證明”，可以在模型上的輸入中驗證（即無需再次運行方法）。我們證明了該方法對來自 ImageNet 驗證集和多個模型的許多樣本執行良好。", "author": "Nuthan Mummani et.al.", "authors": "Nuthan Mummani, Simran Ketha, Venkatakrishnan Ramaswamy", "id": "2410.19479v1", "paper_url": "http://arxiv.org/abs/2410.19479v1", "repo": "null"}}