{"2412.03905": {"publish_time": "2024-12-05", "title": "Integrating Various Software Artifacts for Better LLM-based Bug Localization and Program Repair", "paper_summary": "LLMs have garnered considerable attention for their potential to streamline\nAutomated Program Repair (APR). LLM-based approaches can either insert the\ncorrect code or directly generate patches when provided with buggy methods.\nHowever, most of LLM-based APR methods rely on a single type of software\ninformation, without fully leveraging different software artifacts. Despite\nthis, many LLM-based approaches do not explore which specific types of\ninformation best assist in APR. Addressing this gap is crucial for advancing\nLLM-based APR techniques. We propose DEVLoRe to use issue content (description\nand message) and stack error traces to localize buggy methods, then rely on\ndebug information in buggy methods and issue content and stack error to\nlocalize buggy lines and generate plausible patches which can pass all unit\ntests. The results show that while issue content is particularly effective in\nassisting LLMs with fault localization and program repair, different types of\nsoftware artifacts complement each other. By incorporating different artifacts,\nDEVLoRe successfully locates 49.3% and 47.6% of single and non-single buggy\nmethods and generates 56.0% and 14.5% plausible patches for the Defects4J v2.0\ndataset, respectively. This outperforms current state-of-the-art APR methods.\nThe source code and experimental results of this work for replication are\navailable at https://github.com/XYZboom/DEVLoRe.", "paper_summary_zh": "大型語言模型 (LLM) 因其簡化自動程式修復 (APR) 的潛力而備受關注。基於 LLM 的方法可以在提供有缺陷的方法時插入正確的程式碼或直接產生修補程式。然而，大多數基於 LLM 的 APR 方法依賴於單一類型的軟體資訊，而沒有充分利用不同的軟體人工製品。儘管如此，許多基於 LLM 的方法並未探討哪些特定類型的資訊最有助於 APR。解決這個差距對於推進基於 LLM 的 APR 技術至關重要。我們提出 DEVLoRe 使用問題內容（說明和訊息）和堆疊錯誤追蹤來定位有缺陷的方法，然後依賴於有缺陷方法中的偵錯資訊以及問題內容和堆疊錯誤來定位有缺陷的行並產生合理的修補程式，這些修補程式可以通過所有單元測試。結果表明，雖然問題內容在協助 LLM 進行故障定位和程式修復方面特別有效，但不同類型的軟體人工製品可以互補。透過整合不同的人工製品，DEVLoRe 成功定位了 49.3% 和 47.6% 的單一和非單一有缺陷方法，並分別為 Defects4J v2.0 資料集產生了 56.0% 和 14.5% 的合理修補程式。這優於目前最先進的 APR 方法。這項工作的原始碼和實驗結果可於 https://github.com/XYZboom/DEVLoRe 取得，以供複製。", "author": "Qiong Feng et.al.", "authors": "Qiong Feng, Xiaotian Ma, Jiayi Sheng, Ziyuan Feng, Wei Song, Peng Liang", "id": "2412.03905v1", "paper_url": "http://arxiv.org/abs/2412.03905v1", "repo": "null"}}