{"2406.07378": {"publish_time": "2024-06-11", "title": "Large Language Models for Constrained-Based Causal Discovery", "paper_summary": "Causality is essential for understanding complex systems, such as the\neconomy, the brain, and the climate. Constructing causal graphs often relies on\neither data-driven or expert-driven approaches, both fraught with challenges.\nThe former methods, like the celebrated PC algorithm, face issues with data\nrequirements and assumptions of causal sufficiency, while the latter demand\nsubstantial time and domain knowledge. This work explores the capabilities of\nLarge Language Models (LLMs) as an alternative to domain experts for causal\ngraph generation. We frame conditional independence queries as prompts to LLMs\nand employ the PC algorithm with the answers. The performance of the LLM-based\nconditional independence oracle on systems with known causal graphs shows a\nhigh degree of variability. We improve the performance through a proposed\nstatistical-inspired voting schema that allows some control over false-positive\nand false-negative rates. Inspecting the chain-of-thought argumentation, we\nfind causal reasoning to justify its answer to a probabilistic query. We show\nevidence that knowledge-based CIT could eventually become a complementary tool\nfor data-driven causal discovery.", "paper_summary_zh": "因果關係對於理解複雜的系統至關重要，例如經濟、大腦和氣候。建構因果圖表通常依賴於資料驅動或專家驅動的方法，這兩種方法都充滿了挑戰。前者方法，例如著名的 PC 演算法，面臨資料需求和因果充足性的假設問題，而後者則需要大量的時間和領域知識。這項工作探討了大型語言模型 (LLM) 作為因果圖生成領域專家的替代方案的能力。我們將條件獨立查詢設定為 LLM 的提示，並使用 PC 演算法搭配答案。基於 LLM 的條件獨立神諭在具有已知因果圖表的系統上的效能顯示出高度的變異性。我們透過提議的統計啟發式投票架構來改善效能，該架構允許對假陽性和假陰性率進行一些控制。檢查思考鏈論證，我們發現因果推理可以證明其對機率查詢的回答。我們顯示基於知識的 CIT 最終可能成為資料驅動因果發現的補充工具的證據。", "author": "Kai-Hendrik Cohrs et.al.", "authors": "Kai-Hendrik Cohrs, Gherardo Varando, Emiliano Diaz, Vasileios Sitokonstantinou, Gustau Camps-Valls", "id": "2406.07378v1", "paper_url": "http://arxiv.org/abs/2406.07378v1", "repo": "null"}}