{"2407.21571": {"publish_time": "2024-07-31", "title": "PMoE: Progressive Mixture of Experts with Asymmetric Transformer for Continual Learning", "paper_summary": "Large Language Models (LLMs) encounter significant challenges in continual\nlearning due to catastrophic forgetting, where new information overwrites\npreviously acquired knowledge. This limitation leads to substantial\nenvironmental and economic waste. In this study, we introduce the PMoE,\nProgressive Mixture of Experts with Asymmetric Transformer, which aims to\nminimize forgetting by utilizing an asymmetric design with shallow layers\ndedicated to general knowledge and deep layers for new knowledge. PMoE\nincorporates progressively added experts in deep layers and a router that\nallocates new knowledge to the appropriate experts efficiently. The router,\npositioned adjacent to the deep layers, utilizes deep features aggregating\nconsolidated information. This enables the router to perform efficiently,\nallocating new knowledge to the appropriate experts, which progressively\nincrease in the deep layers. Extensive experiments on TRACE datasets and\ngeneral language understanding datasets demonstrate that the proposed PMoE\noutperforms previous state-of-the-art approaches.", "paper_summary_zh": "大型語言模型 (LLM) 在持續學習中會遭遇重大挑戰，因為災難性遺忘會導致新資訊覆蓋先前獲得的知識。此限制會造成大量的環境和經濟浪費。本研究中，我們引入了 PMoE，一種非對稱Transformer的專家漸進混合，其目標是透過使用非對稱設計來最小化遺忘，其中淺層專門用於一般知識，而深層則用於新知識。PMoE 在深層中加入漸進新增的專家，以及一個路由器，可有效地將新知識分配給適當的專家。路由器與深層相鄰，使用整合後的資訊彙總深度特徵。這讓路由器得以有效執行，將新知識分配給適當的專家，而這些專家會在深層中逐漸增加。在 TRACE 資料集和一般語言理解資料集上的廣泛實驗證明，所提出的 PMoE 優於先前的最先進方法。", "author": "Min Jae Jung et.al.", "authors": "Min Jae Jung, JooHee Kim", "id": "2407.21571v1", "paper_url": "http://arxiv.org/abs/2407.21571v1", "repo": "null"}}