{"2410.22029": {"publish_time": "2024-10-29", "title": "Are VLMs Really Blind", "paper_summary": "Vision Language Models excel in handling a wide range of complex tasks,\nincluding Optical Character Recognition (OCR), Visual Question Answering (VQA),\nand advanced geometric reasoning. However, these models fail to perform well on\nlow-level basic visual tasks which are especially easy for humans. Our goal in\nthis work was to determine if these models are truly \"blind\" to geometric\nreasoning or if there are ways to enhance their capabilities in this area. Our\nwork presents a novel automatic pipeline designed to extract key information\nfrom images in response to specific questions. Instead of just relying on\ndirect VQA, we use question-derived keywords to create a caption that\nhighlights important details in the image related to the question. This caption\nis then used by a language model to provide a precise answer to the question\nwithout requiring external fine-tuning.", "paper_summary_zh": "視覺語言模型擅長處理各種複雜任務，\n包括光學字元辨識 (OCR)、視覺問答 (VQA)\n以及進階幾何推理。然而，這些模型在\n低階的基本視覺任務上表現不佳，而這些任務對人類來說特別容易。我們在\n這項工作中的目標是確定這些模型是否真的對幾何\n推理「視而不見」，或者是否有方法來增強它們在這個領域的能力。我們的\n工作提出了一種新穎的自動化管道，旨在從影像中萃取出關鍵資訊\n以回應特定問題。我們不只依賴直接的 VQA，還使用問題衍生的關鍵字來建立一個標題，\n以強調影像中與問題相關的重要細節。然後語言模型會使用這個標題\n提供一個精確的答案，而不需要外部微調。", "author": "Ayush Singh et.al.", "authors": "Ayush Singh, Mansi Gupta, Shivank Garg", "id": "2410.22029v1", "paper_url": "http://arxiv.org/abs/2410.22029v1", "repo": "https://github.com/vlgiitr/Are-VLMs-Really-Blind"}}