{"2501.13683": {"publish_time": "2025-01-23", "title": "Unlearning Clients, Features and Samples in Vertical Federated Learning", "paper_summary": "Federated Learning (FL) has emerged as a prominent distributed learning\nparadigm. Within the scope of privacy preservation, information privacy\nregulations such as GDPR entitle users to request the removal (or unlearning)\nof their contribution from a service that is hosting the model. For this\npurpose, a server hosting an ML model must be able to unlearn certain\ninformation in cases such as copyright infringement or security issues that can\nmake the model vulnerable or impact the performance of a service based on that\nmodel. While most unlearning approaches in FL focus on Horizontal FL (HFL),\nwhere clients share the feature space and the global model, Vertical FL (VFL)\nhas received less attention from the research community. VFL involves clients\n(passive parties) sharing the sample space among them while not having access\nto the labels. In this paper, we explore unlearning in VFL from three\nperspectives: unlearning clients, unlearning features, and unlearning samples.\nTo unlearn clients and features we introduce VFU-KD which is based on knowledge\ndistillation (KD) while to unlearn samples, VFU-GA is introduced which is based\non gradient ascent. To provide evidence of approximate unlearning, we utilize\nMembership Inference Attack (MIA) to audit the effectiveness of our unlearning\napproach. Our experiments across six tabular datasets and two image datasets\ndemonstrate that VFU-KD and VFU-GA achieve performance comparable to or better\nthan both retraining from scratch and the benchmark R2S method in many cases,\nwith improvements of $(0-2\\%)$. In the remaining cases, utility scores remain\ncomparable, with a modest utility loss ranging from $1-5\\%$. Unlike existing\nmethods, VFU-KD and VFU-GA require no communication between active and passive\nparties during unlearning. However, they do require the active party to store\nthe previously communicated embeddings.", "paper_summary_zh": "<paragraph>联邦学习 (FL) 已成为一种突出的分布式学习范例。在隐私保护范围内，信息隐私法规（如 GDPR）赋予用户要求从托管模型的服务中移除（或取消学习）其贡献的权利。为此，托管 ML 模型的服务器必须能够在某些情况下取消学习特定信息，例如版权侵权或安全问题，这些问题可能使模型容易受到攻击或影响基于该模型的服务的性能。虽然 FL 中的大多数取消学习方法都集中在水平 FL (HFL) 上，其中客户端共享特征空间和全局模型，但垂直 FL (VFL) 却较少受到研究界的关注。VFL 涉及客户端（被动方）在他们之间共享样本空间，同时无法访问标签。在本文中，我们从三个角度探索 VFL 中的取消学习：取消学习客户端、取消学习特征和取消学习样本。为了取消学习客户端和特征，我们引入了基于知识蒸馏 (KD) 的 VFU-KD，而为了取消学习样本，我们引入了基于梯度上升的 VFU-GA。为了提供近似取消学习的证据，我们利用成员资格推理攻击 (MIA) 来审计我们取消学习方法的有效性。我们在六个表格数据集和两个图像数据集上的实验表明，在许多情况下，VFU-KD 和 VFU-GA 实现的性能与从头开始重新训练和基准 R2S 方法相当或更好，改进了 $(0-2\\%)。在其余情况下，效用得分仍然相当，效用损失适中，范围从 $1-5\\%$。与现有方法不同，VFU-KD 和 VFU-GA 在取消学习期间不需要主动方和被动方之间的通信。但是，它们确实要求主动方存储以前传达的嵌入。</paragraph>", "author": "Ayush K. Varshney et.al.", "authors": "Ayush K. Varshney, Konstantinos Vandikas, Vicenç Torra", "id": "2501.13683v1", "paper_url": "http://arxiv.org/abs/2501.13683v1", "repo": "null"}}