{"2211.14736": {"publish_time": "2022-11-27", "title": "Attribution-based XAI Methods in Computer Vision: A Review", "paper_summary": "The advancements in deep learning-based methods for visual perception tasks\nhave seen astounding growth in the last decade, with widespread adoption in a\nplethora of application areas from autonomous driving to clinical decision\nsupport systems. Despite their impressive performance, these deep\nlearning-based models remain fairly opaque in their decision-making process,\nmaking their deployment in human-critical tasks a risky endeavor. This in turn\nmakes understanding the decisions made by these models crucial for their\nreliable deployment. Explainable AI (XAI) methods attempt to address this by\noffering explanations for such black-box deep learning methods. In this paper,\nwe provide a comprehensive survey of attribution-based XAI methods in computer\nvision and review the existing literature for gradient-based,\nperturbation-based, and contrastive methods for XAI, and provide insights on\nthe key challenges in developing and evaluating robust XAI methods.", "paper_summary_zh": "在過去十年中，基於深度學習方法的視覺感知任務取得了驚人的進展，並廣泛應用於從自動駕駛到臨床決策支援系統的眾多應用領域。儘管這些基於深度學習的模型效能令人印象深刻，但它們在決策過程中仍然相當不透明，這使得它們在人類關鍵任務中的部署成為一項冒險的事業。這反過來又使得理解這些模型做出的決策對於它們的可靠部署至關重要。可解釋 AI (XAI) 方法試圖通過為這種黑盒深度學習方法提供解釋來解決這個問題。在本文中，我們對電腦視覺中的基於歸因的 XAI 方法進行了全面的調查，並回顧了現有關於基於梯度、基於擾動和基於對比的 XAI 方法的文獻，並對開發和評估穩健的 XAI 方法的關鍵挑戰提供了見解。", "author": "Kumar Abhishek et.al.", "authors": "Kumar Abhishek, Deeksha Kamath", "id": "2211.14736v1", "paper_url": "http://arxiv.org/abs/2211.14736v1", "repo": "null"}}