{"2409.10955": {"publish_time": "2024-09-17", "title": "Investigating Context-Faithfulness in Large Language Models: The Roles of Memory Strength and Evidence Style", "paper_summary": "Retrieval-augmented generation (RAG) improves Large Language Models (LLMs) by\nincorporating external information into the response generation process.\nHowever, how context-faithful LLMs are and what factors influence LLMs'\ncontext-faithfulness remain largely unexplored. In this study, we investigate\nthe impact of memory strength and evidence presentation on LLMs' receptiveness\nto external evidence. We introduce a method to quantify the memory strength of\nLLMs by measuring the divergence in LLMs' responses to different paraphrases of\nthe same question, which is not considered by previous works. We also generate\nevidence in various styles to evaluate the effects of evidence in different\nstyles. Two datasets are used for evaluation: Natural Questions (NQ) with\npopular questions and popQA featuring long-tail questions. Our results show\nthat for questions with high memory strength, LLMs are more likely to rely on\ninternal memory, particularly for larger LLMs such as GPT-4. On the other hand,\npresenting paraphrased evidence significantly increases LLMs' receptiveness\ncompared to simple repetition or adding details.", "paper_summary_zh": "檢索增強生成 (RAG) 透過將外部資訊納入回應生成程序中，改善大型語言模型 (LLM)。\n然而，LLM 的上下文忠實度如何以及哪些因素會影響 LLM 的上下文忠實度，在很大程度上仍未被探索。在這個研究中，我們探討記憶強度和證據呈現對 LLM 對外部證據的接受程度的影響。我們引入一種方法，透過測量 LLM 對同一個問題的不同同義詞改寫的回應的分歧，來量化 LLM 的記憶強度，這是先前研究未考慮的。我們也生成不同風格的證據，以評估不同風格證據的效果。我們使用兩個資料集進行評估：包含熱門問題的自然問題 (NQ) 和包含長尾問題的 popQA。我們的結果顯示，對於記憶強度高的問題，LLM 更可能依賴內部記憶，特別是對於較大的 LLM，例如 GPT-4。另一方面，與單純的重複或增加細節相比，呈現同義詞改寫的證據會顯著增加 LLM 的接受度。", "author": "Yuepei Li et.al.", "authors": "Yuepei Li, Kang Zhou, Qiao Qiao, Bach Nguyen, Qing Wang, Qi Li", "id": "2409.10955v1", "paper_url": "http://arxiv.org/abs/2409.10955v1", "repo": "null"}}