{"2502.12788": {"publish_time": "2025-02-18", "title": "Commonsense Reasoning in Arab Culture", "paper_summary": "Despite progress in Arabic large language models, such as Jais and AceGPT,\ntheir evaluation on commonsense reasoning has largely relied on\nmachine-translated datasets, which lack cultural depth and may introduce\nAnglocentric biases. Commonsense reasoning is shaped by geographical and\ncultural contexts, and existing English datasets fail to capture the diversity\nof the Arab world. To address this, we introduce \\datasetname, a commonsense\nreasoning dataset in Modern Standard Arabic (MSA), covering cultures of 13\ncountries across the Gulf, Levant, North Africa, and the Nile Valley. The\ndataset was built from scratch by engaging native speakers to write and\nvalidate culturally relevant questions for their respective countries.\n\\datasetname spans 12 daily life domains with 54 fine-grained subtopics,\nreflecting various aspects of social norms, traditions, and everyday\nexperiences. Zero-shot evaluations show that open-weight language models with\nup to 32B parameters struggle to comprehend diverse Arab cultures, with\nperformance varying across regions. These findings highlight the need for more\nculturally aware models and datasets tailored to the Arabic-speaking world.", "paper_summary_zh": "儘管阿拉伯語大型語言模型（例如 Jais 和 AceGPT）已有進展，\n但它們在常識推理上的評估在很大程度上依賴於\n機器翻譯的資料集，這些資料集缺乏文化深度，可能會引入\n以英語為中心的偏見。常識推理受地理和\n文化背景影響，現有的英文資料集無法捕捉阿拉伯世界的多樣性。為了解決這個問題，我們引入了 \\datasetname，一個現代標準阿拉伯語 (MSA) 的常識推理資料集，涵蓋海灣地區、黎凡特地區、北非和尼羅河谷 13 個國家的文化。此資料集是從頭開始建立的，由母語人士參與編寫和驗證他們各自國家的文化相關問題。\\datasetname 涵蓋 12 個日常生活領域，包含 54 個細緻的主題，反映社會規範、傳統和日常經驗的各個方面。零次學習評估顯示，具有高達 32B 參數的開放式權重語言模型難以理解不同的阿拉伯文化，且各區域的表現不一。這些發現突顯了對更具文化意識的模型和專為阿拉伯語系世界量身打造的資料集的需求。", "author": "Abdelrahman Sadallah et.al.", "authors": "Abdelrahman Sadallah, Junior Cedric Tonga, Khalid Almubarak, Saeed Almheiri, Farah Atif, Chatrine Qwaider, Karima Kadaoui, Sara Shatnawi, Yaser Alesh, Fajri Koto", "id": "2502.12788v1", "paper_url": "http://arxiv.org/abs/2502.12788v1", "repo": "null"}}