{"2504.17277": {"publish_time": "2025-04-24", "title": "ExOSITO: Explainable Off-Policy Learning with Side Information for Intensive Care Unit Blood Test Orders", "paper_summary": "Ordering a minimal subset of lab tests for patients in the intensive care\nunit (ICU) can be challenging. Care teams must balance between ensuring the\navailability of the right information and reducing the clinical burden and\ncosts associated with each lab test order. Most in-patient settings experience\nfrequent over-ordering of lab tests, but are now aiming to reduce this burden\non both hospital resources and the environment. This paper develops a novel\nmethod that combines off-policy learning with privileged information to\nidentify the optimal set of ICU lab tests to order. Our approach, EXplainable\nOff-policy learning with Side Information for ICU blood Test Orders (ExOSITO)\ncreates an interpretable assistive tool for clinicians to order lab tests by\nconsidering both the observed and predicted future status of each patient. We\npose this problem as a causal bandit trained using offline data and a reward\nfunction derived from clinically-approved rules; we introduce a novel learning\nframework that integrates clinical knowledge with observational data to bridge\nthe gap between the optimal and logging policies. The learned policy function\nprovides interpretable clinical information and reduces costs without omitting\nany vital lab orders, outperforming both a physician's policy and prior\napproaches to this practical problem.", "paper_summary_zh": "<paragraph>為加護病房 (ICU) 的病人安排最少的實驗室檢驗項目可能是一項挑戰。醫療團隊必須在確保獲得正確資訊與減少與每項檢驗醫囑相關的臨床負擔和成本之間取得平衡。大多數住院環境都存在檢驗醫囑過多的情況，但現在都致力於減少醫院資源和環境的負擔。本文開發了一種新穎的方法，將異策略學習與額外資訊相結合，以確定 ICU 檢驗醫囑的最佳組合。我們的方法，即可解釋的異策略學習結合額外資訊應用於 ICU 血液檢驗醫囑 (ExOSITO)，透過同時考量每位患者的觀察到的和預測的未來狀態，為臨床醫生創建了一個可解釋的輔助工具，以安排檢驗醫囑。我們將此問題視為使用離線數據和從臨床批准的規則衍生的獎勵函數訓練的因果賭博機；我們引入了一個新的學習框架，將臨床知識與觀察數據相結合，以彌合最佳策略和記錄策略之間的差距。學習到的策略函數提供了可解釋的臨床資訊，並在不遺漏任何重要檢驗醫囑的情況下降低了成本，其表現優於醫生策略和先前解決此實際問題的方法。</paragraph>\n", "author": "Zongliang Ji et.al.", "authors": "Zongliang Ji, Andre Carlos Kajdacsy-Balla Amaral, Anna Goldenberg, Rahul G. Krishnan", "id": "2504.17277v1", "paper_url": "http://arxiv.org/abs/2504.17277v1", "repo": "null"}}