{"2412.05187": {"publish_time": "2024-12-06", "title": "SurgBox: Agent-Driven Operating Room Sandbox with Surgery Copilot", "paper_summary": "Surgical interventions, particularly in neurology, represent complex and\nhigh-stakes scenarios that impose substantial cognitive burdens on surgical\nteams. Although deliberate education and practice can enhance cognitive\ncapabilities, surgical training opportunities remain limited due to patient\nsafety concerns. To address these cognitive challenges in surgical training and\noperation, we propose SurgBox, an agent-driven sandbox framework to\nsystematically enhance the cognitive capabilities of surgeons in immersive\nsurgical simulations. Specifically, our SurgBox leverages large language models\n(LLMs) with tailored Retrieval-Augmented Generation (RAG) to authentically\nreplicate various surgical roles, enabling realistic training environments for\ndeliberate practice. In particular, we devise Surgery Copilot, an AI-driven\nassistant to actively coordinate the surgical information stream and support\nclinical decision-making, thereby diminishing the cognitive workload of\nsurgical teams during surgery. By incorporating a novel Long-Short Memory\nmechanism, our Surgery Copilot can effectively balance immediate procedural\nassistance with comprehensive surgical knowledge. Extensive experiments using\nreal neurosurgical procedure records validate our SurgBox framework in both\nenhancing surgical cognitive capabilities and supporting clinical\ndecision-making. By providing an integrated solution for training and\noperational support to address cognitive challenges, our SurgBox framework\nadvances surgical education and practice, potentially transforming surgical\noutcomes and healthcare quality. The code is available at\nhttps://github.com/franciszchen/SurgBox.", "paper_summary_zh": "外科手術，特別是在神經外科，代表了複雜且高風險的場景，對外科團隊施加了巨大的認知負擔。儘管經過深思熟慮的教育和實踐可以增強認知能力，但由於患者安全問題，外科培訓機會仍然有限。為了應對外科培訓和手術中的這些認知挑戰，我們提出了 SurgBox，一個由代理驅動的沙盒框架，用於系統地增強外科醫生在沉浸式外科模擬中的認知能力。具體來說，我們的 SurgBox 利用大型語言模型 (LLM) 和量身定制的檢索增強生成 (RAG) 來真實地複製各種外科角色，為深思熟慮的實踐提供逼真的培訓環境。特別是，我們設計了手術副駕駛，一個由 AI 驅動的助手，用於主動協調外科信息流並支持臨床決策制定，從而減少外科團隊在手術期間的認知負擔。通過結合一種新穎的長短期記憶機制，我們的 Surgery Copilot 可以有效地平衡即時程序協助和全面的外科知識。使用真實的神經外科手術記錄進行的廣泛實驗驗證了我們的 SurgBox 框架，既能增強外科認知能力，又能支持臨床決策制定。通過提供一個綜合的培訓和運營支持解決方案來應對認知挑戰，我們的 SurgBox 框架推動了外科教育和實踐，有可能改變外科結果和醫療保健質量。代碼可在 https://github.com/franciszchen/SurgBox 獲得。", "author": "Jinlin Wu et.al.", "authors": "Jinlin Wu, Xusheng Liang, Xuexue Bai, Zhen Chen", "id": "2412.05187v1", "paper_url": "http://arxiv.org/abs/2412.05187v1", "repo": "https://github.com/franciszchen/surgbox"}}