{"2410.22103": {"publish_time": "2024-10-29", "title": "Joint Extraction and Classification of Danish Competences for Job Matching", "paper_summary": "The matching of competences, such as skills, occupations or knowledges, is a\nkey desiderata for candidates to be fit for jobs. Automatic extraction of\ncompetences from CVs and Jobs can greatly promote recruiters' productivity in\nlocating relevant candidates for job vacancies. This work presents the first\nmodel that jointly extracts and classifies competence from Danish job postings.\nDifferent from existing works on skill extraction and skill classification, our\nmodel is trained on a large volume of annotated Danish corpora and is capable\nof extracting a wide range of Danish competences, including skills, occupations\nand knowledges of different categories. More importantly, as a single BERT-like\narchitecture for joint extraction and classification, our model is lightweight\nand efficient at inference. On a real-scenario job matching dataset, our model\nbeats the state-of-the-art models in the overall performance of Danish\ncompetence extraction and classification, and saves over 50% time at inference.", "paper_summary_zh": "技能、職業或知識等能力的匹配是求職者適任工作的關鍵要素。從履歷和工作中自動提取能力可大幅提升招募人員在尋找職缺相關求職者時的生產力。本研究提出第一個模型，可同時從丹麥工作職缺中提取和分類能力。與現有的技能提取和技能分類工作不同，我們的模型是在大量的丹麥語語料庫標註上訓練，並能夠提取廣泛的丹麥語能力，包括不同類別的技能、職業和知識。更重要的是，作為一個用於聯合提取和分類的單一 BERT 類架構，我們的模型輕量且在推理時有效率。在實際場景的工作匹配資料集上，我們的模型在丹麥語能力提取和分類的整體表現上優於最先進的模型，並在推理時節省超過 50% 的時間。", "author": "Qiuchi Li et.al.", "authors": "Qiuchi Li, Christina Lioma", "id": "2410.22103v1", "paper_url": "http://arxiv.org/abs/2410.22103v1", "repo": "null"}}