{"2502.03884": {"publish_time": "2025-02-06", "title": "Rank Also Matters: Hierarchical Configuration for Mixture of Adapter Experts in LLM Fine-Tuning", "paper_summary": "Large language models (LLMs) have demonstrated remarkable success across\nvarious tasks, accompanied by a continuous increase in their parameter size.\nParameter-efficient fine-tuning (PEFT) methods, such as Low-Rank Adaptation\n(LoRA), address the challenges of fine-tuning LLMs by significantly reducing\nthe number of trainable parameters. Recent studies have integrated LoRA with\nMixture of Experts (MoE) architectures, leveraging multiple adapter experts and\ngating mechanisms to further improve fine-tuning performance. However, existing\napproaches primarily focus on adjusting the allocations of adapter experts per\nlayer to optimize the introduced trainable parameter size, while neglecting a\ncritical factor of adapters' rank. To this end, we propose a hierarchical\nscheme for expert allocation and rank configuration, HILO, which dynamically\nadjusts the number and rank of adapter experts across layers, matching the\nvarying representational complexity of model layers in adapter-granularity.\nExtensive experiments on multiple benchmark tasks demonstrate that HILO\noutperforms existing methods in accuracy while introducing fewer trainable\nparameters, providing an efficient and practical solution for fine-tuning LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 已在各種任務中展現出顯著的成功，同時其參數規模也不斷增加。參數高效微調 (PEFT) 方法，例如低階適應 (LoRA)，透過大幅減少可訓練參數數量來解決微調 LLM 的挑戰。最近的研究已將 LoRA 與專家混合 (MoE) 架構整合，利用多個適配器專家和閘控機制進一步提升微調效能。然而，現有方法主要著重於調整每層適配器專家的配置以最佳化引入的可訓練參數規模，同時忽略適配器等級的關鍵因素。為此，我們提出一個分層專家配置和等級設定方案，HILO，它會動態調整各層適配器專家的數量和等級，在適配器粒度中符合模型層變化的表示複雜度。透過多個基準任務的廣泛實驗證明，HILO 在準確度方面優於現有方法，同時引入較少的可訓練參數，為微調 LLM 提供高效且實用的解決方案。", "author": "Peizhuang Cong et.al.", "authors": "Peizhuang Cong, Wenpu Liu, Wenhan Yu, Haochen Zhao, Tong Yang", "id": "2502.03884v1", "paper_url": "http://arxiv.org/abs/2502.03884v1", "repo": "null"}}