{"2501.05414": {"publish_time": "2025-01-09", "title": "LongProc: Benchmarking Long-Context Language Models on Long Procedural Generation", "paper_summary": "Existing benchmarks for evaluating long-context language models (LCLMs)\nprimarily focus on long-context recall, requiring models to produce short\nresponses based on a few critical snippets while processing thousands of\nirrelevant tokens. We introduce LongProc (Long Procedural Generation), a new\nbenchmark that requires both the integration of highly dispersed information\nand long-form generation. LongProc consists of six diverse procedural\ngeneration tasks, such as extracting structured information from HTML pages\ninto a TSV format and executing complex search procedures to create travel\nplans. These tasks challenge LCLMs by testing their ability to follow detailed\nprocedural instructions, synthesize and reason over dispersed information, and\ngenerate structured, long-form outputs (up to 8K tokens). Furthermore, as these\ntasks adhere to deterministic procedures and yield structured outputs, they\nenable reliable rule-based evaluation. We evaluate 17 LCLMs on LongProc across\nthree difficulty levels, with maximum numbers of output tokens set at 500, 2K,\nand 8K. Notably, while all tested models claim a context window size above 32K\ntokens, open-weight models typically falter on 2K-token tasks, and\nclosed-source models like GPT-4o show significant degradation on 8K-token\ntasks. Further analysis reveals that LCLMs struggle to maintain long-range\ncoherence in long-form generations. These findings highlight critical\nlimitations in current LCLMs and suggest substantial room for improvement. Data\nand code available at: https://princeton-pli.github.io/LongProc", "paper_summary_zh": "現有的用於評估長語境語言模型 (LCLM) 的基準主要集中在長語境召回上，要求模型根據幾個關鍵片段產生簡短的回應，同時處理數千個不相關的符號。我們引入了 LongProc（長程序生成），這是一個新的基準，它需要高度分散的資訊整合和長格式生成。LongProc 包含六項不同的程序生成任務，例如將結構化資訊從 HTML 頁面提取到 TSV 格式，以及執行複雜的搜尋程序來建立旅遊計畫。這些任務透過測試 LCLM 遵循詳細程序說明、綜合和推理分散資訊以及生成結構化、長格式輸出（最多 8K 個符號）的能力，對其提出挑戰。此外，由於這些任務遵循確定性的程序並產生結構化的輸出，因此它們能進行可靠的基於規則的評估。我們在三個難度等級上對 17 個 LCLM 進行 LongProc 評估，將輸出符號的最大數量設定為 500、2K 和 8K。值得注意的是，雖然所有測試的模型都宣稱其語境窗口大小超過 32K 個符號，但開放權重模型通常在 2K 符號任務中失敗，而像 GPT-4o 這樣的閉源模型在 8K 符號任務中表現出顯著下降。進一步的分析表明，LCLM 難以在長格式生成中維持長程相干性。這些發現突顯了當前 LCLM 的關鍵限制，並表明有很大的改進空間。資料和程式碼可於以下網址取得：https://princeton-pli.github.io/LongProc", "author": "Xi Ye et.al.", "authors": "Xi Ye, Fangcong Yin, Yinghui He, Joie Zhang, Howard Yen, Tianyu Gao, Greg Durrett, Danqi Chen", "id": "2501.05414v1", "paper_url": "http://arxiv.org/abs/2501.05414v1", "repo": "null"}}