{"2412.11538": {"publish_time": "2024-12-16", "title": "Towards a Speech Foundation Model for Singapore and Beyond", "paper_summary": "This technical report describes the MERaLiON Speech Encoder, a foundation\nmodel designed to support a wide range of downstream speech applications.\nDeveloped as part of Singapore's National Multimodal Large Language Model\nProgramme, the MERaLiON Speech Encoder is tailored to address the speech\nprocessing needs in Singapore and the surrounding Southeast Asian region. The\nmodel currently supports mainly English, including the variety spoken in\nSingapore. We are actively expanding our datasets to gradually cover other\nlanguages in subsequent releases. The MERaLiON Speech Encoder was pre-trained\nfrom scratch on 200K hours of unlabelled speech data using a self-supervised\nlearning approach based on masked language modelling. We describe our training\nprocedure and hyperparameter tuning experiments in detail below. Our evaluation\ndemonstrates improvements to spontaneous and Singapore speech benchmarks for\nspeech recognition, while remaining competitive to other state-of-the-art\nspeech encoders across ten other speech tasks. We commit to releasing our\nmodel, supporting broader research endeavours, both in Singapore and beyond.", "paper_summary_zh": "本技術報告描述了 MERaLiON 語音編碼器，這是一個基礎模型，旨在支援廣泛的下游語音應用程式。MERaLiON 語音編碼器作為新加坡國家多模態大型語言模型計畫的一部分而開發，專門用於滿足新加坡和周邊東南亞地區的語音處理需求。此模型目前主要支援英語，包括新加坡口音。我們正積極擴展我們的資料集，以便在後續版本中逐步涵蓋其他語言。MERaLiON 語音編碼器從 20 萬小時的未標記語音資料中從頭開始預先訓練，使用基於遮罩語言建模的自我監督式學習方法。我們在下方詳細說明我們的訓練程序和超參數調整實驗。我們的評估證明，在語音辨識方面，自發性和新加坡語音基準都有所改進，同時在其他十項語音任務中，仍與其他最先進的語音編碼器保持競爭力。我們承諾發布我們的模型，以支援新加坡及其他地區更廣泛的研究工作。", "author": "Muhammad Huzaifah et.al.", "authors": "Muhammad Huzaifah, Tianchi Liu, Hardik B. Sailor, Kye Min Tan, Tarun K. Vangani, Qiongqiong Wang, Jeremy H. M. Wong, Nancy F. Chen, Ai Ti Aw", "id": "2412.11538v1", "paper_url": "http://arxiv.org/abs/2412.11538v1", "repo": "null"}}