{"2410.14651": {"publish_time": "2024-10-18", "title": "Real-time Fake News from Adversarial Feedback", "paper_summary": "We show that existing evaluations for fake news detection based on\nconventional sources, such as claims on fact-checking websites, result in an\nincreasing accuracy over time for LLM-based detectors -- even after their\nknowledge cutoffs. This suggests that recent popular political claims, which\nform the majority of fake news on such sources, are easily classified using\nsurface-level shallow patterns. Instead, we argue that a proper fake news\ndetection dataset should test a model's ability to reason factually about the\ncurrent world by retrieving and reading related evidence. To this end, we\ndevelop a novel pipeline that leverages natural language feedback from a\nRAG-based detector to iteratively modify real-time news into deceptive fake\nnews that challenges LLMs. Our iterative rewrite decreases the binary\nclassification AUC by an absolute 17.5 percent for a strong RAG GPT-4o\ndetector. Our experiments reveal the important role of RAG in both detecting\nand generating fake news, as retrieval-free LLM detectors are vulnerable to\nunseen events and adversarial attacks, while feedback from RAG detection helps\ndiscover more deceitful patterns in fake news.", "paper_summary_zh": "我們證明，基於傳統來源（例如事實查核網站上的聲明）的現有假新聞偵測評估，會隨著時間推移而提高 LLM 為基礎的偵測器的準確度，即使在它們的知識截止之後。這表明此類來源上的近期熱門政治聲明，構成此類來源上大多數假新聞，很容易使用表面層次的淺層模式進行分類。相反，我們認為適當的假新聞偵測資料集應測試模型根據相關證據檢索和閱讀，對當前世界進行事實推理的能力。為此，我們開發了一個創新的管道，利用基於 RAG 的偵測器的自然語言回饋，以反覆修改即時新聞，使其成為挑戰 LLM 的欺騙性假新聞。我們的反覆改寫將強大的 RAG GPT-4o 偵測器的二元分類 AUC 絕對降低了 17.5 個百分點。我們的實驗揭示了 RAG 在偵測和產生假新聞中扮演的重要角色，因為無檢索的 LLM 偵測器容易受到未見事件和對抗性攻擊，而 RAG 偵測的回饋有助於發現假新聞中更多具有欺騙性的模式。", "author": "Sanxing Chen et.al.", "authors": "Sanxing Chen, Yukun Huang, Bhuwan Dhingra", "id": "2410.14651v1", "paper_url": "http://arxiv.org/abs/2410.14651v1", "repo": "null"}}