{"2407.05603": {"publish_time": "2024-07-08", "title": "WSI-VQA: Interpreting Whole Slide Images by Generative Visual Question Answering", "paper_summary": "Whole slide imaging is routinely adopted for carcinoma diagnosis and\nprognosis. Abundant experience is required for pathologists to achieve accurate\nand reliable diagnostic results of whole slide images (WSI). The huge size and\nheterogeneous features of WSIs make the workflow of pathological reading\nextremely time-consuming. In this paper, we propose a novel framework (WSI-VQA)\nto interpret WSIs by generative visual question answering. WSI-VQA shows\nuniversality by reframing various kinds of slide-level tasks in a\nquestion-answering pattern, in which pathologists can achieve\nimmunohistochemical grading, survival prediction, and tumor subtyping following\nhuman-machine interaction. Furthermore, we establish a WSI-VQA dataset which\ncontains 8672 slide-level question-answering pairs with 977 WSIs. Besides the\nability to deal with different slide-level tasks, our generative model which is\nnamed Wsi2Text Transformer (W2T) outperforms existing discriminative models in\nmedical correctness, which reveals the potential of our model to be applied in\nthe clinical scenario. Additionally, we also visualize the co-attention mapping\nbetween word embeddings and WSIs as an intuitive explanation for diagnostic\nresults. The dataset and related code are available at\nhttps://github.com/cpystan/WSI-VQA.", "paper_summary_zh": "全切片影像通常用於癌症的診斷和預後。病理學家需要有豐富的經驗才能對全切片影像 (WSI) 做出準確且可靠的診斷結果。WSI 的尺寸龐大且特徵異質，使得病理學判讀的工作流程極為耗時。在本文中，我們提出了一個新的框架 (WSI-VQA)，透過生成式視覺問答來詮釋 WSI。WSI-VQA 透過在問答模式中重新定義各種切片層級任務，展現其通用性，病理學家可以在人機互動後，完成免疫組織化學分級、存活預測和腫瘤亞型分類。此外，我們建立了一個 WSI-VQA 資料集，其中包含 8672 個切片層級問答對，以及 977 個 WSI。除了能夠處理不同的切片層級任務外，我們名為 Wsi2Text Transformer (W2T) 的生成模型在醫學正確性方面優於現有的判別模型，這揭示了我們的模型在臨床場景中應用的潛力。此外，我們還將詞嵌入和 WSI 之間的共同注意映射視覺化，作為診斷結果的直觀解釋。資料集和相關程式碼可在 https://github.com/cpystan/WSI-VQA 取得。", "author": "Pingyi Chen et.al.", "authors": "Pingyi Chen, Chenglu Zhu, Sunyi Zheng, Honglin Li, Lin Yang", "id": "2407.05603v1", "paper_url": "http://arxiv.org/abs/2407.05603v1", "repo": "https://github.com/cpystan/wsi-vqa"}}