{"2410.03380": {"publish_time": "2024-10-04", "title": "Predicting perturbation targets with causal differential networks", "paper_summary": "Rationally identifying variables responsible for changes to a biological\nsystem can enable myriad applications in disease understanding and cell\nengineering. From a causality perspective, we are given two datasets generated\nby the same causal model, one observational (control) and one interventional\n(perturbed). The goal is to isolate the subset of measured variables (e.g.\ngenes) that were the targets of the intervention, i.e. those whose conditional\nindependencies have changed. Knowing the causal graph would limit the search\nspace, allowing us to efficiently pinpoint these variables. However, current\nalgorithms that infer causal graphs in the presence of unknown intervention\ntargets scale poorly to the hundreds or thousands of variables in biological\ndata, as they must jointly search the combinatorial spaces of graphs and\nconsistent intervention targets. In this work, we propose a causality-inspired\napproach for predicting perturbation targets that decouples the two search\nsteps. First, we use an amortized causal discovery model to separately infer\ncausal graphs from the observational and interventional datasets. Then, we\nlearn to map these paired graphs to the sets of variables that were intervened\nupon, in a supervised learning framework. This approach consistently\noutperforms baselines for perturbation modeling on seven single-cell\ntranscriptomics datasets, each with thousands of measured variables. We also\ndemonstrate significant improvements over six causal discovery algorithms in\npredicting intervention targets across a variety of tractable, synthetic\ndatasets.", "paper_summary_zh": "透過理性地找出負責生物系統變化的變數，我們可以找出許多應用在疾病理解和細胞工程上。從因果關係的角度來看，我們會得到兩個由同一個因果模型產生的資料集，一個是觀察性的（控制），另一個是介入性的（擾動）。目標是找出測量變數的子集（例如基因），這些變數是介入的目標，也就是那些條件獨立性已經改變的變數。知道因果圖表會限制搜尋空間，讓我們可以有效地找出這些變數。然而，目前在未知介入目標的情況下推論因果圖表的演算法，對於生物資料中數百或數千個變數來說擴充性很差，因為它們必須共同搜尋圖表和一致介入目標的組合空間。在這項工作中，我們提出一個因果靈感的介入目標預測方法，它將兩個搜尋步驟分開。首先，我們使用攤銷因果發現模型，分別從觀察性和介入性資料集推論因果圖表。然後，我們在一個監督學習架構中學習將這些配對圖表對應到被介入的變數集合。這種方法在七個單細胞轉錄組學資料集的擾動建模中，始終優於基線，每個資料集都有數千個測量變數。我們也展示出在各種易於處理的合成資料集中，相較於六個因果發現演算法，在預測介入目標方面有顯著的改進。", "author": "Menghua Wu et.al.", "authors": "Menghua Wu, Umesh Padia, Sean H. Murphy, Regina Barzilay, Tommi Jaakkola", "id": "2410.03380v1", "paper_url": "http://arxiv.org/abs/2410.03380v1", "repo": "null"}}