{"2411.02666": {"publish_time": "2024-11-04", "title": "From Twitter to Reasoner: Understand Mobility Travel Modes and Sentiment Using Large Language Models", "paper_summary": "Social media has become an important platform for people to express their\nopinions towards transportation services and infrastructure, which holds the\npotential for researchers to gain a deeper understanding of individuals' travel\nchoices, for transportation operators to improve service quality, and for\npolicymakers to regulate mobility services. A significant challenge, however,\nlies in the unstructured nature of social media data. In other words, textual\ndata like social media is not labeled, and large-scale manual annotations are\ncost-prohibitive. In this study, we introduce a novel methodological framework\nutilizing Large Language Models (LLMs) to infer the mentioned travel modes from\nsocial media posts, and reason people's attitudes toward the associated travel\nmode, without the need for manual annotation. We compare different LLMs along\nwith various prompting engineering methods in light of human assessment and LLM\nverification. We find that most social media posts manifest negative rather\nthan positive sentiments. We thus identify the contributing factors to these\nnegative posts and, accordingly, propose recommendations to traffic operators\nand policymakers.", "paper_summary_zh": "社群媒體已成為人們表達其對運輸服務和基礎建設意見的重要平台，這讓研究人員得以更深入地了解個人的旅遊選擇，讓運輸業者提升服務品質，並讓政策制定者規範行動服務。然而，社群媒體資料的非結構化性質是一項重大挑戰。換句話說，社群媒體等文字資料並未標記，而大規模的手動註解成本過高。在本研究中，我們介紹一個利用大型語言模型 (LLM) 從社群媒體貼文中推論所提及的旅遊模式，並推論人們對相關旅遊模式的態度，而無需手動註解的新方法論架構。我們根據人類評估和 LLM 驗證，比較了不同的 LLM 以及各種提示工程方法。我們發現，大多數社群媒體貼文表達的負面情緒多於正面情緒。因此，我們找出導致這些負面貼文的原因，並據此提出建議給交通業者和政策制定者。", "author": "Kangrui Ruan et.al.", "authors": "Kangrui Ruan, Xinyang Wang, Xuan Di", "id": "2411.02666v1", "paper_url": "http://arxiv.org/abs/2411.02666v1", "repo": "null"}}