{"2411.18456": {"publish_time": "2024-11-27", "title": "Synthetic ECG Generation for Data Augmentation and Transfer Learning in Arrhythmia Classification", "paper_summary": "Deep learning models need a sufficient amount of data in order to be able to\nfind the hidden patterns in it. It is the purpose of generative modeling to\nlearn the data distribution, thus allowing us to sample more data and augment\nthe original dataset. In the context of physiological data, and more\nspecifically electrocardiogram (ECG) data, given its sensitive nature and\nexpensive data collection, we can exploit the benefits of generative models in\norder to enlarge existing datasets and improve downstream tasks, in our case,\nclassification of heart rhythm.\n  In this work, we explore the usefulness of synthetic data generated with\ndifferent generative models from Deep Learning namely Diffweave, Time-Diffusion\nand Time-VQVAE in order to obtain better classification results for two open\nsource multivariate ECG datasets. Moreover, we also investigate the effects of\ntransfer learning, by fine-tuning a synthetically pre-trained model and then\nprogressively adding increasing proportions of real data. We conclude that\nalthough the synthetic samples resemble the real ones, the classification\nimprovement when simply augmenting the real dataset is barely noticeable on\nindividual datasets, but when both datasets are merged the results show an\nincrease across all metrics for the classifiers when using synthetic samples as\naugmented data. From the fine-tuning results the Time-VQVAE generative model\nhas shown to be superior to the others but not powerful enough to achieve\nresults close to a classifier trained with real data only. In addition, methods\nand metrics for measuring closeness between synthetic data and the real one\nhave been explored as a side effect of the main research questions of this\nstudy.", "paper_summary_zh": "深度學習模型需要足夠的資料量才能找出其中的隱藏模式。生成模型的目的是學習資料分佈，因此讓我們能夠抽取更多資料並擴充原始資料集。在生理資料的脈絡中，特別是心電圖 (ECG) 資料，由於其敏感的性質和昂貴的資料收集，我們可以利用生成模型的優點來擴充現有的資料集並改善下游任務，在我們的案例中，是心律分類。\n在這項工作中，我們探討了使用深度學習的各種生成模型（即 Diffweave、時間擴散和時間 VQVAE）所生成的合成資料的效用，目的是為兩個開放原始碼多變量 ECG 資料集取得更好的分類結果。此外，我們還研究了遷移學習的效果，方法是微調合成預訓練模型，然後逐步增加真實資料的比例。我們的結論是，儘管合成樣本類似於真實樣本，但僅僅擴充真實資料集時的分類改進在個別資料集上幾乎不顯著，但當兩個資料集合併時，使用合成樣本作為擴充資料時，分類器的所有指標都會顯示出增加。從微調結果來看，時間 VQVAE 生成模型已顯示出優於其他模型，但功能還不足以達到僅使用真實資料訓練的分類器的結果。此外，測量合成資料與真實資料之間接近程度的方法和指標已作為本研究主要研究問題的附帶效應進行探討。", "author": "José Fernando Núñez et.al.", "authors": "José Fernando Núñez, Jamie Arjona, Javier Béjar", "id": "2411.18456v1", "paper_url": "http://arxiv.org/abs/2411.18456v1", "repo": "null"}}