{"2406.08002": {"publish_time": "2024-06-12", "title": "Efficient Adaptation in Mixed-Motive Environments via Hierarchical Opponent Modeling and Planning", "paper_summary": "Despite the recent successes of multi-agent reinforcement learning (MARL)\nalgorithms, efficiently adapting to co-players in mixed-motive environments\nremains a significant challenge. One feasible approach is to hierarchically\nmodel co-players' behavior based on inferring their characteristics. However,\nthese methods often encounter difficulties in efficient reasoning and\nutilization of inferred information. To address these issues, we propose\nHierarchical Opponent modeling and Planning (HOP), a novel multi-agent\ndecision-making algorithm that enables few-shot adaptation to unseen policies\nin mixed-motive environments. HOP is hierarchically composed of two modules: an\nopponent modeling module that infers others' goals and learns corresponding\ngoal-conditioned policies, and a planning module that employs Monte Carlo Tree\nSearch (MCTS) to identify the best response. Our approach improves efficiency\nby updating beliefs about others' goals both across and within episodes and by\nusing information from the opponent modeling module to guide planning.\nExperimental results demonstrate that in mixed-motive environments, HOP\nexhibits superior few-shot adaptation capabilities when interacting with\nvarious unseen agents, and excels in self-play scenarios. Furthermore, the\nemergence of social intelligence during our experiments underscores the\npotential of our approach in complex multi-agent environments.", "paper_summary_zh": "儘管多重代理強化學習 (MARL) 演算法最近獲得成功，在混合動機環境中有效適應共同玩家仍然是一個重大的挑戰。一種可行的做法是根據推斷共同玩家的特徵，以階層方式對共同玩家的行為進行建模。然而，這些方法通常會在有效推理和利用推論資訊方面遇到困難。為了解決這些問題，我們提出階層對手建模和規劃 (HOP)，這是一種新穎的多重代理決策演算法，可以在混合動機環境中對未見過的政策進行少次適應。HOP 由兩個模組階層組成：對手建模模組，用於推論他人的目標並學習相應的目標條件政策，以及規劃模組，用於採用蒙地卡羅樹搜尋 (MCTS) 來識別最佳回應。我們的做法透過在各個情境中和情境內更新對他人目標的信念，以及使用來自對手建模模組的資訊來引導規劃，進而提高效率。實驗結果表明，在混合動機環境中，HOP 在與各種未見過的代理互動時展現出優異的少次適應能力，並在自玩情境中表現出色。此外，在我們的實驗中出現的社交智慧突顯了我們的方法在複雜的多重代理環境中的潛力。", "author": "Yizhe Huang et.al.", "authors": "Yizhe Huang, Anji Liu, Fanqi Kong, Yaodong Yang, Song-Chun Zhu, Xue Feng", "id": "2406.08002v1", "paper_url": "http://arxiv.org/abs/2406.08002v1", "repo": "null"}}