{"2406.19949": {"publish_time": "2024-06-28", "title": "Calibrating LLMs with Preference Optimization on Thought Trees for Generating Rationale in Science Question Scoring", "paper_summary": "Generating rationales that justify scoring decisions has been a promising way\nto facilitate explainability in automated scoring systems. However, existing\nmethods do not match the accuracy of classifier-based methods. Plus, the\ngenerated rationales often contain hallucinated information. To address these\nissues, we propose a novel framework capable of generating more faithful\nrationales and, more importantly, matching performance with classifier-based\nblack-box scoring systems. We first mimic the human assessment process by\nquerying Large Language Models (LLMs) to generate a thought tree. We then\nsummarise intermediate assessment decisions from each thought tree path for\ncreating synthetic rationale data and rationale preference data. Finally, we\nutilise the generated synthetic data to calibrate LLMs through a two-step\ntraining process: supervised fine-tuning and preference optimization. Extensive\nexperimental results demonstrate that our framework achieves a 38% assessment\nperformance improvement in the QWK score compared to prior work while producing\nhigher-quality rationales, as recognised by human evaluators and LLMs. Our work\nsheds light on the effectiveness of performing preference optimization using\nsynthetic preference data obtained from thought tree paths.", "paper_summary_zh": "生成合理化以證明評分決策一直是促進自動化評分系統中可解釋性的一種有前途的方法。然而，現有方法與基於分類器的方法的準確性不符。此外，生成的依據通常包含虛構的資訊。為了解決這些問題，我們提出了一個新穎的架構，能夠生成更忠實的依據，更重要的是，與基於分類器的黑盒評分系統相匹配的效能。我們首先模擬人類評估過程，透過查詢大型語言模型 (LLM) 來產生思維樹。然後，我們總結每個思維樹路徑的中間評估決策，以建立合成依據資料和依據偏好資料。最後，我們利用生成的合成資料透過兩階段訓練過程校準 LLM：監督微調和偏好最佳化。廣泛的實驗結果表明，與先前的研究相比，我們的架構在 QWK 分數中實現了 38% 的評估效能提升，同時產生了更高品質的依據，正如人類評估者和 LLM 所認可的。我們的研究闡明了使用從思維樹路徑中獲得的合成偏好資料執行偏好最佳化的有效性。", "author": "Jiazheng Li et.al.", "authors": "Jiazheng Li, Hainiu Xu, Zhaoyue Sun, Yuxiang Zhou, David West, Cesare Aloisi, Yulan He", "id": "2406.19949v1", "paper_url": "http://arxiv.org/abs/2406.19949v1", "repo": "null"}}