{"2409.11174": {"publish_time": "2024-09-17", "title": "Identifying Influential nodes in Brain Networks via Self-Supervised Graph-Transformer", "paper_summary": "Studying influential nodes (I-nodes) in brain networks is of great\nsignificance in the field of brain imaging. Most existing studies consider\nbrain connectivity hubs as I-nodes. However, this approach relies heavily on\nprior knowledge from graph theory, which may overlook the intrinsic\ncharacteristics of the brain network, especially when its architecture is not\nfully understood. In contrast, self-supervised deep learning can learn\nmeaningful representations directly from the data. This approach enables the\nexploration of I-nodes for brain networks, which is also lacking in current\nstudies. This paper proposes a Self-Supervised Graph Reconstruction framework\nbased on Graph-Transformer (SSGR-GT) to identify I-nodes, which has three main\ncharacteristics. First, as a self-supervised model, SSGR-GT extracts the\nimportance of brain nodes to the reconstruction. Second, SSGR-GT uses\nGraph-Transformer, which is well-suited for extracting features from brain\ngraphs, combining both local and global characteristics. Third, multimodal\nanalysis of I-nodes uses graph-based fusion technology, combining functional\nand structural brain information. The I-nodes we obtained are distributed in\ncritical areas such as the superior frontal lobe, lateral parietal lobe, and\nlateral occipital lobe, with a total of 56 identified across different\nexperiments. These I-nodes are involved in more brain networks than other\nregions, have longer fiber connections, and occupy more central positions in\nstructural connectivity. They also exhibit strong connectivity and high node\nefficiency in both functional and structural networks. Furthermore, there is a\nsignificant overlap between the I-nodes and both the structural and functional\nrich-club. These findings enhance our understanding of the I-nodes within the\nbrain network, and provide new insights for future research in further\nunderstanding the brain working mechanisms.", "paper_summary_zh": "<paragraph>在腦部影像領域中，研究腦網路中的影響力節點（I 節點）具有重要意義。現有研究大多將腦部連接樞紐視為 I 節點。然而，這種方法嚴重依賴於圖論的先驗知識，可能會忽略腦網路的內在特徵，特別是在其架構尚未完全了解的情況下。相比之下，自監督深度學習可以直接從數據中學習有意義的表示。這種方法能夠探索腦網路的 I 節點，這也是當前研究中所欠缺的。本文提出一個基於圖形轉換器的自監督圖形重建框架（SSGR-GT）來識別 I 節點，其具有三大特點。首先，作為一個自監督模型，SSGR-GT 提取腦節點對重建的重要性。其次，SSGR-GT 使用圖形轉換器，它非常適合從腦圖形中提取特徵，結合局部和全局特徵。第三，I 節點的多模態分析使用基於圖形的融合技術，結合功能和結構腦部資訊。我們獲得的 I 節點分佈在關鍵區域，例如額上葉、頂葉外側和枕葉外側，在不同的實驗中總共識別出 56 個。這些 I 節點參與的腦網路比其他區域更多，具有更長的纖維連接，並且在結構連接中佔據更中心的位置。它們在功能和結構網路中也表現出強連接性和高節點效率。此外，I 節點與結構和功能富俱樂部之間存在顯著重疊。這些發現增強了我們對腦網路中 I 節點的理解，並為進一步了解腦工作機制提供了新的見解。</paragraph>", "author": "Yanqing Kang et.al.", "authors": "Yanqing Kang, Di Zhu, Haiyang Zhang, Enze Shi, Sigang Yu, Jinru Wu, Xuhui Wang, Xuan Liu, Geng Chen, Xi Jiang, Tuo Zhang, Shu Zhang", "id": "2409.11174v1", "paper_url": "http://arxiv.org/abs/2409.11174v1", "repo": "null"}}