{"2411.04443": {"publish_time": "2024-11-07", "title": "ACCIO: Table Understanding Enhanced via Contrastive Learning with Aggregations", "paper_summary": "The attention to table understanding using recent natural language models has\nbeen growing. However, most related works tend to focus on learning the\nstructure of the table directly. Just as humans improve their understanding of\nsentences by comparing them, they can also enhance their understanding by\ncomparing tables. With this idea, in this paper, we introduce ACCIO, tAble\nunderstanding enhanCed via Contrastive learnIng with aggregatiOns, a novel\napproach to enhancing table understanding by contrasting original tables with\ntheir pivot summaries through contrastive learning. ACCIO trains an encoder to\nbring these table pairs closer together. Through validation via column type\nannotation, ACCIO achieves competitive performance with a macro F1 score of\n91.1 compared to state-of-the-art methods. This work represents the first\nattempt to utilize pairs of tables for table embedding, promising significant\nadvancements in table comprehension. Our code is available at\nhttps://github.com/whnhch/ACCIO/.", "paper_summary_zh": "近來使用自然語言模型來理解表格的關注度正在增加。然而，大多數相關工作傾向於直接學習表格的結構。就像人類透過比較句子來提升對句子的理解，他們也能透過比較表格來增強對表格的理解。有了這個想法，在本文中，我們引入了 ACCIO，一種透過對比學習，利用聚合來增強表格理解的表格理解增強方法，這是一種透過對比學習將原始表格與其樞紐摘要進行對比的新穎方法。ACCIO 訓練一個編碼器，讓這些表格對更接近。透過欄位類型註解的驗證，ACCIO 達到了競爭力的效能，巨觀 F1 分數為 91.1，與最先進的方法相比。這項工作代表了首次嘗試利用表格對來進行表格嵌入，有望在表格理解方面取得重大進展。我們的程式碼可在 https://github.com/whnhch/ACCIO/ 取得。", "author": "Whanhee Cho et.al.", "authors": "Whanhee Cho", "id": "2411.04443v1", "paper_url": "http://arxiv.org/abs/2411.04443v1", "repo": "https://github.com/whnhch/accio"}}