{"2406.11811": {"publish_time": "2024-06-17", "title": "RepLiQA: A Question-Answering Dataset for Benchmarking LLMs on Unseen Reference Content", "paper_summary": "Large Language Models (LLMs) are trained on vast amounts of data, most of\nwhich is automatically scraped from the internet. This data includes\nencyclopedic documents that harbor a vast amount of general knowledge (e.g.,\nWikipedia) but also potentially overlap with benchmark datasets used for\nevaluating LLMs. Consequently, evaluating models on test splits that might have\nleaked into the training set is prone to misleading conclusions. To foster\nsound evaluation of language models, we introduce a new test dataset named\nRepLiQA, suited for question-answering and topic retrieval tasks. RepLiQA is a\ncollection of five splits of test sets, four of which have not been released to\nthe internet or exposed to LLM APIs prior to this publication. Each sample in\nRepLiQA comprises (1) a reference document crafted by a human annotator and\ndepicting an imaginary scenario (e.g., a news article) absent from the\ninternet; (2) a question about the document's topic; (3) a ground-truth answer\nderived directly from the information in the document; and (4) the paragraph\nextracted from the reference document containing the answer. As such, accurate\nanswers can only be generated if a model can find relevant content within the\nprovided document. We run a large-scale benchmark comprising several\nstate-of-the-art LLMs to uncover differences in performance across models of\nvarious types and sizes in a context-conditional language modeling setting.\nReleased splits of RepLiQA can be found here:\nhttps://huggingface.co/datasets/ServiceNow/repliqa.", "paper_summary_zh": "大型語言模型 (LLM) 是在大量的資料上訓練的，其中大部分是從網路上自動抓取的。這些資料包括包含大量一般知識的百科全書文件（例如維基百科），但也可能與用於評估 LLM 的基準資料集重疊。因此，在可能已洩漏到訓練集中的測試分割上評估模型容易導致誤導性的結論。為了促進語言模型的健全評估，我們引入了名為 RepLiQA 的新測試資料集，適用於問答和主題檢索任務。RepLiQA 是由五個測試集分割組成的集合，其中四個在本次發布之前尚未發布到網路上或公開給 LLM API。RepLiQA 中的每個範例包含 (1) 由人類註解者編寫的參考文件，描述一個不存在於網路上、虛構的情境（例如新聞文章）；(2) 關於文件主題的問題；(3) 直接從文件中的資訊衍生的基本事實答案；以及 (4) 從包含答案的參考文件中摘錄的段落。因此，只有當模型可以在提供的文件中找到相關內容時，才能產生準確的答案。我們執行了一項大規模基準測試，其中包含多個最先進的 LLM，以在情境條件語言建模設定中揭示各種類型和規模的模型之間的效能差異。RepLiQA 的已發布分割可以在此處找到：https://huggingface.co/datasets/ServiceNow/repliqa。", "author": "Joao Monteiro et.al.", "authors": "Joao Monteiro, Pierre-Andre Noel, Etienne Marcotte, Sai Rajeswar, Valentina Zantedeschi, David Vazquez, Nicolas Chapados, Christopher Pal, Perouz Taslakian", "id": "2406.11811v1", "paper_url": "http://arxiv.org/abs/2406.11811v1", "repo": "null"}}