{"2501.13833": {"publish_time": "2025-01-23", "title": "On the Reasoning Capacity of AI Models and How to Quantify It", "paper_summary": "Recent advances in Large Language Models (LLMs) have intensified the debate\nsurrounding the fundamental nature of their reasoning capabilities. While\nachieving high performance on benchmarks such as GPQA and MMLU, these models\nexhibit limitations in more complex reasoning tasks, highlighting the need for\nmore rigorous evaluation methodologies. We propose a novel phenomenological\napproach that goes beyond traditional accuracy metrics to probe the underlying\nmechanisms of model behavior, establishing a framework that could broadly\nimpact how we analyze and understand AI systems. Using positional bias in\nmultiple-choice reasoning tasks as a case study, we demonstrate how systematic\nperturbations can reveal fundamental aspects of model decision-making. To\nanalyze these behaviors, we develop two complementary phenomenological models:\na Probabilistic Mixture Model (PMM) that decomposes model responses into\nreasoning, memorization, and guessing components and an Information-Theoretic\nConsistency (ITC) analysis that quantifies the relationship between model\nconfidence and strategy selection. Through controlled experiments on reasoning\nbenchmarks, we show that true reasoning remains challenging for current models,\nwith apparent success often relying on sophisticated combinations of\nmemorization and pattern matching rather than genuine logical deduction. More\nfundamentally, we demonstrate that accuracy alone often overstates a model's\nreasoning abilities, as model behavior can be characterized through underlying\nmechanisms in the phase space of cognitive strategies, revealing how models\ndynamically balance different approaches when responding to queries. This\nframework enables quantitative criteria for real-world deployments, allowing\napplications to specify reliability thresholds based on strategy distributions\nrather than aggregate performance metrics.", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 的最新進展加劇了圍繞其推理能力的根本性質的爭論。儘管在 GPQA 和 MMLU 等基準測試中取得了很高的性能，但這些模型在更複雜的推理任務中表現出侷限性，凸顯了對更嚴謹評估方法的需求。我們提出了一種新穎的現象學方法，它超越了傳統的準確度指標，以探討模型行為的底層機制，建立一個框架，可以廣泛地影響我們分析和理解 AI 系統的方式。使用多選推理任務中的位置偏誤作為案例研究，我們展示了系統性擾動如何揭示模型決策制定的基本方面。為了分析這些行為，我們開發了兩個互補的現象學模型：一個概率混合模型 (PMM)，它將模型反應分解為推理、記憶和猜測組成部分，以及一個信息論一致性 (ITC) 分析，它量化了模型信心和策略選擇之間的關係。通過在推理基準測試上進行受控實驗，我們表明真正的推理對於當前模型仍然具有挑戰性，明顯的成功通常依賴於記憶和模式匹配的複雜組合，而不是真正的邏輯推論。更根本的是，我們證明了準確性本身通常會誇大模型的推理能力，因為模型行為可以通過認知策略相空間中的底層機制來表徵，揭示了模型在響應查詢時如何動態平衡不同的方法。此框架為實際部署提供了定量標準，允許應用程序根據策略分佈而不是總體性能指標指定可靠性閾值。</paragraph>", "author": "Santosh Kumar Radha et.al.", "authors": "Santosh Kumar Radha, Oktay Goktas", "id": "2501.13833v1", "paper_url": "http://arxiv.org/abs/2501.13833v1", "repo": "null"}}