{"2409.11228": {"publish_time": "2024-09-17", "title": "Learning Source Disentanglement in Neural Audio Codec", "paper_summary": "Neural audio codecs have significantly advanced audio compression by\nefficiently converting continuous audio signals into discrete tokens. These\ncodecs preserve high-quality sound and enable sophisticated sound generation\nthrough generative models trained on these tokens. However, existing neural\ncodec models are typically trained on large, undifferentiated audio datasets,\nneglecting the essential discrepancies between sound domains like speech,\nmusic, and environmental sound effects. This oversight complicates data\nmodeling and poses additional challenges to the controllability of sound\ngeneration. To tackle these issues, we introduce the Source-Disentangled Neural\nAudio Codec (SD-Codec), a novel approach that combines audio coding and source\nseparation. By jointly learning audio resynthesis and separation, SD-Codec\nexplicitly assigns audio signals from different domains to distinct codebooks,\nsets of discrete representations. Experimental results indicate that SD-Codec\nnot only maintains competitive resynthesis quality but also, supported by the\nseparation results, demonstrates successful disentanglement of different\nsources in the latent space, thereby enhancing interpretability in audio codec\nand providing potential finer control over the audio generation process.", "paper_summary_zh": "神經音訊編解碼器透過有效率地將連續音訊訊號轉換為離散代幣，顯著提升音訊壓縮能力。這些編解碼器保留高品質音訊，並能透過訓練這些代幣的生成模型來進行精密的音訊產生。然而，現有的神經編解碼器模型通常訓練於大型、未區分的音訊資料集上，忽略了語音、音樂和環境音效等音訊領域間的本質差異。這種疏忽使得資料建模變得複雜，並對音訊產生的可控性造成額外的挑戰。為了解決這些問題，我們引入了來源分離神經音訊編解碼器 (SD-Codec)，這是一種結合音訊編碼和來源分離的新穎方法。透過共同學習音訊重新合成和分離，SD-Codec 明確地將不同領域的音訊訊號分配給不同的代碼簿，即離散表示集。實驗結果表明，SD-Codec 不僅維持了具競爭力的重新合成品質，而且在分離結果的支援下，證明成功地將潛在空間中不同的來源分離出來，從而增強了音訊編解碼器的可解釋性，並提供了對音訊產生過程更精細的控制。", "author": "Xiaoyu Bie et.al.", "authors": "Xiaoyu Bie, Xubo Liu, Gaël Richard", "id": "2409.11228v1", "paper_url": "http://arxiv.org/abs/2409.11228v1", "repo": "null"}}