{"2408.11494": {"publish_time": "2024-08-21", "title": "Mutagenesis screen to map the functionals of parameters of Large Language Models", "paper_summary": "Large Language Models (LLMs) have significantly advanced artificial\nintelligence, excelling in numerous tasks. Although the functionality of a\nmodel is inherently tied to its parameters, a systematic method for exploring\nthe connections between the parameters and the functionality are lacking.\nModels sharing similar structure and parameter counts exhibit significant\nperformance disparities across various tasks, prompting investigations into the\nvarying patterns that govern their performance. We adopted a mutagenesis screen\napproach inspired by the methods used in biological studies, to investigate\nLlama2-7b and Zephyr. This technique involved mutating elements within the\nmodels' matrices to their maximum or minimum values to examine the relationship\nbetween model parameters and their functionalities. Our research uncovered\nmultiple levels of fine structures within both models. Many matrices showed a\nmixture of maximum and minimum mutations following mutagenesis, but others were\npredominantly sensitive to one type. Notably, mutations that produced\nphenotypes, especially those with severe outcomes, tended to cluster along\naxes. Additionally, the location of maximum and minimum mutations often\ndisplayed a complementary pattern on matrix in both models, with the Gate\nmatrix showing a unique two-dimensional asymmetry after rearrangement. In\nZephyr, certain mutations consistently resulted in poetic or conversational\nrather than descriptive outputs. These \"writer\" mutations grouped according to\nthe high-frequency initial word of the output, with a marked tendency to share\nthe row coordinate even when they are in different matrices. Our findings\naffirm that the mutagenesis screen is an effective tool for deciphering the\ncomplexities of large language models and identifying unexpected ways to expand\ntheir potential, providing deeper insights into the foundational aspects of AI\nsystems.", "paper_summary_zh": "大型語言模型 (LLM) 已大幅推進人工智慧，在眾多任務中表現優異。儘管模型的功能本質上與其參數相關，但缺乏一種系統化的方式來探索參數與功能之間的關聯。具有相似結構和參數計數的模型在各種任務中表現出顯著的差異，促使人們探究影響其效能的不同模式。我們採用了受生物學研究方法啟發的誘變篩選方法，來探究 Llama2-7b 和 Zephyr。此技術涉及將模型矩陣中的元素突變為其最大值或最小值，以檢驗模型參數與其功能之間的關係。我們的研究揭示了這兩個模型中多層次的精細結構。許多矩陣在誘變後顯示出最大和最小突變的混合，但其他矩陣則主要對一種類型敏感。值得注意的是，產生表型的突變，特別是那些具有嚴重後果的突變，往往會沿著軸線聚集。此外，最大和最小突變的位置通常在兩個模型的矩陣上顯示出互補模式，其中 Gate 矩陣在重新排列後顯示出獨特的二維不對稱性。在 Zephyr 中，某些突變始終導致詩意或對話式的輸出，而不是描述性的輸出。這些「寫作」突變根據輸出的高頻率初始字詞進行分組，即使它們位於不同的矩陣中，也表現出明顯的共享列座標的傾向。我們的研究結果證實，誘變篩選是一種解碼大型語言模型複雜性的有效工具，可識別擴展其潛力的意外方法，並提供對 AI 系統基礎層面的更深入見解。", "author": "Yue Hu et.al.", "authors": "Yue Hu, Kai Hu, Patrick X. Zhao, Javed Khan, Chengming Xu", "id": "2408.11494v1", "paper_url": "http://arxiv.org/abs/2408.11494v1", "repo": "null"}}