{"2409.11149": {"publish_time": "2024-09-17", "title": "SAGED: A Holistic Bias-Benchmarking Pipeline for Language Models with Customisable Fairness Calibration", "paper_summary": "The development of unbiased large language models is widely recognized as\ncrucial, yet existing benchmarks fall short in detecting biases due to limited\nscope, contamination, and lack of a fairness baseline. SAGED(-Bias) is the\nfirst holistic benchmarking pipeline to address these problems. The pipeline\nencompasses five core stages: scraping materials, assembling benchmarks,\ngenerating responses, extracting numeric features, and diagnosing with\ndisparity metrics. SAGED includes metrics for max disparity, such as impact\nratio, and bias concentration, such as Max Z-scores. Noticing that assessment\ntool bias and contextual bias in prompts can distort evaluation, SAGED\nimplements counterfactual branching and baseline calibration for mitigation.\nFor demonstration, we use SAGED on G20 Countries with popular 8b-level models\nincluding Gemma2, Llama3.1, Mistral, and Qwen2. With sentiment analysis, we\nfind that while Mistral and Qwen2 show lower max disparity and higher bias\nconcentration than Gemma2 and Llama3.1, all models are notably biased against\ncountries like Russia and (except for Qwen2) China. With further experiments to\nhave models role-playing U.S. (vice-/former-) presidents, we see bias amplifies\nand shifts in heterogeneous directions. Moreover, we see Qwen2 and Mistral not\nengage in role-playing, while Llama3.1 and Gemma2 role-play Trump notably more\nintensively than Biden and Harris, indicating role-playing performance bias in\nthese models.", "paper_summary_zh": "<paragraph>無偏見大型語言模型的發展被廣泛認為至關重要，但現有的基準在檢測偏見方面存在不足，原因在於範圍有限、汙染以及缺乏公平基準。SAGED(-Bias) 是第一個解決這些問題的整體基準管道。該管道包含五個核心階段：擷取素材、組裝基準、產生回應、萃取數值特徵，以及使用差異指標診斷。SAGED 包含最大差異指標，例如影響比率，以及偏見集中度指標，例如最大 Z 分數。SAGED 觀察到評量工具偏見和提示中的脈絡偏見會扭曲評量，因此實作反事實分支和基準校正以進行緩解。為了示範，我們在 G20 國家使用 SAGED，其中包括熱門的 8b 級別模型，例如 Gemma2、Llama3.1、Mistral 和 Qwen2。透過情緒分析，我們發現，儘管 Mistral 和 Qwen2 顯示出比 Gemma2 和 Llama3.1 更低的最大差異和更高的偏見集中度，但所有模型都明顯偏向於俄羅斯等國家，而 Qwen2 除外，則偏向於中國。透過進一步的實驗讓模型扮演美國（現任/前任）總統，我們看到偏見會在異質方向上擴大和轉移。此外，我們看到 Qwen2 和 Mistral 沒有參與角色扮演，而 Llama3.1 和 Gemma2 扮演川普的角色明顯比拜登和賀錦麗更為深入，這表示這些模型存在角色扮演表現偏見。</paragraph>", "author": "Xin Guan et.al.", "authors": "Xin Guan, Nathaniel Demchak, Saloni Gupta, Ze Wang, Ediz Ertekin Jr., Adriano Koshiyama, Emre Kazim, Zekun Wu", "id": "2409.11149v1", "paper_url": "http://arxiv.org/abs/2409.11149v1", "repo": "null"}}