{"2408.04336": {"publish_time": "2024-08-08", "title": "KnowPC: Knowledge-Driven Programmatic Reinforcement Learning for Zero-shot Coordination", "paper_summary": "Zero-shot coordination (ZSC) remains a major challenge in the cooperative AI\nfield, which aims to learn an agent to cooperate with an unseen partner in\ntraining environments or even novel environments. In recent years, a popular\nZSC solution paradigm has been deep reinforcement learning (DRL) combined with\nadvanced self-play or population-based methods to enhance the neural policy's\nability to handle unseen partners. Despite some success, these approaches\nusually rely on black-box neural networks as the policy function. However,\nneural networks typically lack interpretability and logic, making the learned\npolicies difficult for partners (e.g., humans) to understand and limiting their\ngeneralization ability. These shortcomings hinder the application of\nreinforcement learning methods in diverse cooperative scenarios.We suggest to\nrepresent the agent's policy with an interpretable program. Unlike neural\nnetworks, programs contain stable logic, but they are non-differentiable and\ndifficult to optimize.To automatically learn such programs, we introduce\nKnowledge-driven Programmatic reinforcement learning for zero-shot Coordination\n(KnowPC). We first define a foundational Domain-Specific Language (DSL),\nincluding program structures, conditional primitives, and action primitives. A\nsignificant challenge is the vast program search space, making it difficult to\nfind high-performing programs efficiently. To address this, KnowPC integrates\nan extractor and an reasoner. The extractor discovers environmental transition\nknowledge from multi-agent interaction trajectories, while the reasoner deduces\nthe preconditions of each action primitive based on the transition knowledge.", "paper_summary_zh": "零次學習協調 (ZSC) 仍然是合作 AI 領域的一項重大挑戰，其目標是讓代理學習與訓練環境甚至新穎環境中未見的合作夥伴合作。近年來，一種流行的 ZSC 解決方案範例是深度強化學習 (DRL)，結合先進的自我對弈或基於族群的方法，以增強神經策略處理未見合作夥伴的能力。儘管取得一些成功，這些方法通常依賴黑盒神經網路作為策略函數。然而，神經網路通常缺乏可解釋性和邏輯，這使得合作夥伴（例如人類）難以理解所學習的策略，並限制其泛化能力。這些缺點阻礙了強化學習方法在各種合作場景中的應用。我們建議使用可解釋程式表示代理的策略。與神經網路不同，程式包含穩定的邏輯，但它們不可微分且難以最佳化。為了自動學習此類程式，我們引入了針對零次學習協調的知識驅動程式化強化學習 (KnowPC)。我們首先定義了一個基礎的特定領域語言 (DSL)，包括程式結構、條件基本元素和動作基本元素。一個重大的挑戰是龐大的程式搜尋空間，這使得難以有效找到高執行效能的程式。為了解決這個問題，KnowPC 整合了一個萃取器和一個推理器。萃取器從多重代理互動軌跡中發現環境轉換知識，而推理器則根據轉換知識推論每個動作基本元素的前提條件。", "author": "Yin Gu et.al.", "authors": "Yin Gu, Qi Liu, Zhi Li, Kai Zhang", "id": "2408.04336v1", "paper_url": "http://arxiv.org/abs/2408.04336v1", "repo": "null"}}