{"2411.02791": {"publish_time": "2024-11-05", "title": "Language Models and Cycle Consistency for Self-Reflective Machine Translation", "paper_summary": "This paper introduces a novel framework that leverages large language models\n(LLMs) for machine translation (MT). We start with one conjecture: an ideal\ntranslation should contain complete and accurate information for a strong\nenough LLM to recover the original sentence. We generate multiple translation\ncandidates from a source language A to a target language B, and subsequently\ntranslate these candidates back to the original language A. By evaluating the\ncycle consistency between the original and back-translated sentences using\nmetrics such as token-level precision and accuracy, we implicitly estimate the\ntranslation quality in language B, without knowing its ground-truth. This also\nhelps to evaluate the LLM translation capability, only with monolingual\ncorpora. For each source sentence, we identify the translation candidate with\noptimal cycle consistency with the original sentence as the final answer. Our\nexperiments demonstrate that larger LLMs, or the same LLM with more forward\npasses during inference, exhibit increased cycle consistency, aligning with the\nLLM model size scaling law and test-time computation scaling law. This work\nprovide methods for, 1) to implicitly evaluate translation quality of a\nsentence in the target language, 2), to evaluate capability of LLM for\nany-to-any-language translation, and 3), how to generate a better translation\nfor a specific LLM.", "paper_summary_zh": "本文介紹了一個新穎的架構，它利用大型語言模型 (LLM) 進行機器翻譯 (MT)。我們從一個猜想開始：理想的翻譯應包含完整且準確的資訊，讓足夠強大的 LLM 能夠還原原始句子。我們從原始語言 A 產生多個翻譯候選，再將這些候選翻譯回原始語言 A。透過使用指標（例如：標記層級的精確度和準確性）評估原始句子和回譯句子的循環一致性，我們隱含地估計語言 B 的翻譯品質，而不知道其真實情況。這也有助於只使用單語料庫評估 LLM 翻譯能力。對於每個原始句子，我們找出與原始句子循環一致性最佳的翻譯候選，作為最終答案。我們的實驗證明，較大的 LLM，或推理期間具有更多前向傳遞的相同 LLM，會表現出更高的循環一致性，與 LLM 模型大小縮放定律和測試時間運算縮放定律一致。這項工作提供的方法包括：1) 隱含地評估目標語言中句子的翻譯品質，2) 評估 LLM 在任意語言間翻譯的能力，以及 3) 如何為特定的 LLM 產生更好的翻譯。", "author": "Jianqiao Wangni et.al.", "authors": "Jianqiao Wangni", "id": "2411.02791v1", "paper_url": "http://arxiv.org/abs/2411.02791v1", "repo": "null"}}