{"2409.10986": {"publish_time": "2024-09-17", "title": "Control-flow Reconstruction Attacks on Business Process Models", "paper_summary": "Process models may be automatically generated from event logs that contain\nas-is data of a business process. While such models generalize over the\ncontrol-flow of specific, recorded process executions, they are often also\nannotated with behavioural statistics, such as execution frequencies.Based\nthereon, once a model is published, certain insights about the original process\nexecutions may be reconstructed, so that an external party may extract\nconfidential information about the business process. This work is the first to\nempirically investigate such reconstruction attempts based on process models.\nTo this end, we propose different play-out strategies that reconstruct the\ncontrol-flow from process trees, potentially exploiting frequency annotations.\nTo assess the potential success of such reconstruction attacks on process\nmodels, and hence the risks imposed by publishing them, we compare the\nreconstructed process executions with those of the original log for several\nreal-world datasets.", "paper_summary_zh": "流程模型可以從包含業務流程原樣資料的事件日誌中自動產生。雖然此類模型概括了特定已記錄流程執行的控制流程，但它們通常也會附加行為統計資料，例如執行頻率。基於此，一旦模型發布，就可以重建關於原始流程執行的特定見解，以便外部方可以提取有關業務流程的機密資訊。這項工作是第一個根據流程模型實證調查此類重建嘗試的工作。為此，我們提出不同的播放策略，這些策略從流程樹中重建控制流程，並可能利用頻率註解。為了評估此類重建攻擊對流程模型的潛在成功率，以及因此發布它們所帶來的風險，我們將重建的流程執行與多個真實世界資料集的原始日誌中的執行進行比較。", "author": "Henrik Kirchmann et.al.", "authors": "Henrik Kirchmann, Stephan A. Fahrenkrog-Petersen, Felix Mannhardt, Matthias Weidlich", "id": "2409.10986v1", "paper_url": "http://arxiv.org/abs/2409.10986v1", "repo": "https://github.com/henrikkirchmann/control-flow-reconstruction"}}