{"2406.09330": {"publish_time": "2024-06-13", "title": "Learning from Natural Language Explanations for Generalizable Entity Matching", "paper_summary": "Entity matching is the task of linking records from different sources that\nrefer to the same real-world entity. Past work has primarily treated entity\nlinking as a standard supervised learning problem. However, supervised entity\nmatching models often do not generalize well to new data, and collecting\nexhaustive labeled training data is often cost prohibitive. Further, recent\nefforts have adopted LLMs for this task in few/zero-shot settings, exploiting\ntheir general knowledge. But LLMs are prohibitively expensive for performing\ninference at scale for real-world entity matching tasks.\n  As an efficient alternative, we re-cast entity matching as a conditional\ngeneration task as opposed to binary classification. This enables us to\n\"distill\" LLM reasoning into smaller entity matching models via natural\nlanguage explanations. This approach achieves strong performance, especially on\nout-of-domain generalization tests (10.85% F-1) where standalone generative\nmethods struggle. We perform ablations that highlight the importance of\nexplanations, both for performance and model robustness.", "paper_summary_zh": "實體配對是連結來自不同來源且指涉相同真實世界實體的記錄的任務。過去的工作主要將實體連結視為標準的監督式學習問題。然而，監督式實體配對模型通常無法很好地推廣到新的資料，而收集詳盡標記的訓練資料通常成本過高。此外，最近的工作已在少樣本/零樣本設定中採用 LLM 來執行這項任務，利用它們的一般知識。但 LLM 在執行大規模推論以進行真實世界實體配對任務時成本過高。\n作為一種有效率的替代方案，我們將實體配對重新定義為條件生成任務，而不是二元分類。這使我們能夠透過自然語言說明將 LLM 推理「蒸餾」成較小的實體配對模型。此方法可達成強大的效能，特別是在獨立生成式方法難以應付的領域外推廣測試（10.85% F-1）上。我們執行消融研究，強調說明對於效能和模型穩健性都很重要。", "author": "Somin Wadhwa et.al.", "authors": "Somin Wadhwa, Adit Krishnan, Runhui Wang, Byron C. Wallace, Chris Kong", "id": "2406.09330v1", "paper_url": "http://arxiv.org/abs/2406.09330v1", "repo": "null"}}