{"2502.14509": {"publish_time": "2025-02-20", "title": "MultiSlav: Using Cross-Lingual Knowledge Transfer to Combat the Curse of Multilinguality", "paper_summary": "Does multilingual Neural Machine Translation (NMT) lead to The Curse of the\nMultlinguality or provides the Cross-lingual Knowledge Transfer within a\nlanguage family? In this study, we explore multiple approaches for extending\nthe available data-regime in NMT and we prove cross-lingual benefits even in\n0-shot translation regime for low-resource languages. With this paper, we\nprovide state-of-the-art open-source NMT models for translating between\nselected Slavic languages. We released our models on the HuggingFace Hub\n(https://hf.co/collections/allegro/multislav-6793d6b6419e5963e759a683) under\nthe CC BY 4.0 license. Slavic language family comprises morphologically rich\nCentral and Eastern European languages. Although counting hundreds of millions\nof native speakers, Slavic Neural Machine Translation is under-studied in our\nopinion. Recently, most NMT research focuses either on: high-resource languages\nlike English, Spanish, and German - in WMT23 General Translation Task 7 out of\n8 task directions are from or to English; massively multilingual models\ncovering multiple language groups; or evaluation techniques.", "paper_summary_zh": "多語言神經機器翻譯 (NMT) 是否會導致多語言的詛咒，或在語言家族中提供跨語言知識轉移？在這項研究中，我們探討了多種擴展 NMT 中可用資料範圍的方法，並證明了即使在低資源語言的零次學習翻譯中也有跨語言的優點。透過這篇論文，我們提供了最先進的開源 NMT 模型，用於翻譯選定的斯拉夫語。我們在 HuggingFace Hub (https://hf.co/collections/allegro/multislav-6793d6b6419e5963e759a683) 下根據 CC BY 4.0 授權發布我們的模型。斯拉夫語系包含形態豐富的中歐和東歐語言。儘管擁有數億母語人士，但我們認為斯拉夫神經機器翻譯的研究不足。最近，大多數 NMT 研究都專注於：高資源語言，例如英語、西班牙語和德語 - 在 WMT23 一般翻譯任務中，8 個任務方向中有 7 個來自英語或翻譯成英語；涵蓋多個語言群組的大規模多語言模型；或評估技術。", "author": "Artur Kot et.al.", "authors": "Artur Kot, Mikołaj Koszowski, Wojciech Chojnowski, Mieszko Rutkowski, Artur Nowakowski, Kamil Guttmann, Mikołaj Pokrywka", "id": "2502.14509v1", "paper_url": "http://arxiv.org/abs/2502.14509v1", "repo": "null"}}