{"2405.06640": {"publish_time": "2024-05-10", "title": "Linearizing Large Language Models", "paper_summary": "Linear transformers have emerged as a subquadratic-time alternative to\nsoftmax attention and have garnered significant interest due to their\nfixed-size recurrent state that lowers inference cost. However, their original\nformulation suffers from poor scaling and underperforms compute-matched\ntransformers. Recent linear models such as RWKV and Mamba have attempted to\naddress these shortcomings by proposing novel time-mixing and gating\narchitectures, but pre-training large language models requires significant data\nand compute investments. Thus, the search for subquadratic architectures is\nlimited by the availability of compute and quality pre-training datasets. As a\ncost-effective alternative to pre-training linear transformers, we propose\nScalable UPtraining for Recurrent Attention (SUPRA). We present a method to\nuptrain existing large pre-trained transformers into Recurrent Neural Networks\n(RNNs) with a modest compute budget. This allows us to leverage the strong\npre-training data and performance of existing transformer LLMs, while requiring\n5% of the training cost. We find that our linearization technique leads to\ncompetitive performance on standard benchmarks, but we identify persistent\nin-context learning and long-context modeling shortfalls for even the largest\nlinear models. Our code and models can be found at\nhttps://github.com/TRI-ML/linear_open_lm.", "paper_summary_zh": "線性轉換器已成為 softmax 注意力的次二次時間替代方案，並因其降低了推論成本的固定大小遞迴狀態而備受關注。然而，它們的原始公式存在擴展性差且表現不如計算匹配轉換器的問題。最近的線性模型，例如 RWKV 和 Mamba，已嘗試通過提出新穎的時間混合和閘控架構來解決這些缺點，但預訓練大型語言模型需要大量的數據和計算投資。因此，對次二次架構的搜索受到計算和質量預訓練數據集可用性的限制。作為預訓練線性轉換器的經濟高效的替代方案，我們提出了遞迴注意力的可擴展上訓練 (SUPRA)。我們提出了一種將現有的預先訓練好的大型轉換器上訓練為具有適度計算預算的遞迴神經網路 (RNN) 的方法。這使我們能夠利用現有轉換器 LLM 的強大預訓練數據和性能，同時只需 5% 的訓練成本。我們發現我們的線性化技術可以在標準基準上帶來具有競爭力的性能，但我們發現即使是最大的線性模型也存在持續的語境學習和長語境建模的不足。我們的程式碼和模型可以在 https://github.com/TRI-ML/linear_open_lm 找到。", "author": "Jean Mercat et.al.", "authors": "Jean Mercat, Igor Vasiljevic, Sedrick Keh, Kushal Arora, Achal Dave, Adrien Gaidon, Thomas Kollar", "id": "2405.06640v1", "paper_url": "http://arxiv.org/abs/2405.06640v1", "repo": "https://github.com/tri-ml/linear_open_lm"}}