{"2412.13601": {"publish_time": "2024-12-18", "title": "Hybrid CNN-LSTM based Indoor Pedestrian Localization with CSI Fingerprint Maps", "paper_summary": "The paper presents a novel Wi-Fi fingerprinting system that uses Channel\nState Information (CSI) data for fine-grained pedestrian localization. The\nproposed system exploits the frequency diversity and spatial diversity of the\nfeatures extracted from CSI data to generate a 2D+channel image termed as a CSI\nFingerprint Map. We then use this CSI Fingerprint Map representation of CSI\ndata to generate a pedestrian trajectory hypothesis using a hybrid architecture\nthat combines a Convolutional Neural Network and a Long Short-Term Memory\nRecurrent Neural Network model. The proposed architecture exploits the temporal\nand spatial relationship information among the CSI data observations gathered\nat neighboring locations. A particle filter is then employed to separate out\nthe most likely hypothesis matching a human walk model. The experimental\nperformance of our method is compared to existing deep learning localization\nmethods such ConFi, DeepFi and to a self-developed temporal-feature based LSTM\nbased location classifier. The experimental results show marked improvement\nwith an average RMSE of 0.36 m in a moderately dynamic and 0.17 m in a static\nenvironment. Our method is essentially a proof of concept that with (1) sparse\navailability of observations, (2) limited infrastructure requirements, (3)\nmoderate level of short-term and long-term noise in the training and testing\nenvironment, reliable fine-grained Wi-Fi based pedestrian localization is a\npotential option.", "paper_summary_zh": "本文提出了一個創新的 Wi-Fi 指紋辨識系統，它使用頻道狀態資訊 (CSI) 資料進行精確的行人定位。所提出的系統利用從 CSI 資料中提取特徵的頻率多樣性和空間多樣性，以產生稱為 CSI 指紋圖的 2D+ 頻道影像。我們接著使用這個 CSI 指紋圖的 CSI 資料表示，以產生一個行人軌跡假設，使用結合卷積神經網路和長期短期記憶遞迴神經網路模型的混合架構。所提出的架構利用在鄰近位置收集的 CSI 資料觀測之間的時間和空間關係資訊。接著使用粒子濾波器來分離出最有可能與人類行走模型相符的假設。我們的方法的實驗效能與現有的深度學習定位方法（例如 ConFi、DeepFi）和自開發的基於時間特徵的 LSTM 定位分類器進行比較。實驗結果顯示顯著的改善，在中等動態環境中平均 RMSE 為 0.36 公尺，在靜態環境中為 0.17 公尺。我們的這個方法基本上是一個概念驗證，它證明了 (1) 觀測的稀疏可用性、(2) 有限的基礎設施需求、(3) 訓練和測試環境中短期和長期雜訊的適度程度，可靠的精確 Wi-Fi 行人定位是一個潛在的選項。", "author": "Muhammad Emad-ud-din et.al.", "authors": "Muhammad Emad-ud-din", "id": "2412.13601v1", "paper_url": "http://arxiv.org/abs/2412.13601v1", "repo": "https://github.com/em22ad/CSI-Fingerprint-Indoor-Localization"}}