{"2412.11768": {"publish_time": "2024-12-16", "title": "No More Adam: Learning Rate Scaling at Initialization is All You Need", "paper_summary": "In this work, we question the necessity of adaptive gradient methods for\ntraining deep neural networks. SGD-SaI is a simple yet effective enhancement to\nstochastic gradient descent with momentum (SGDM). SGD-SaI performs learning\nrate Scaling at Initialization (SaI) to distinct parameter groups, guided by\ntheir respective gradient signal-to-noise ratios (g-SNR). By adjusting learning\nrates without relying on adaptive second-order momentum, SGD-SaI helps prevent\ntraining imbalances from the very first iteration and cuts the optimizer's\nmemory usage by half compared to AdamW. Despite its simplicity and efficiency,\nSGD-SaI consistently matches or outperforms AdamW in training a variety of\nTransformer-based tasks, effectively overcoming a long-standing challenge of\nusing SGD for training Transformers. SGD-SaI excels in ImageNet-1K\nclassification with Vision Transformers(ViT) and GPT-2 pretraining for large\nlanguage models (LLMs, transformer decoder-only), demonstrating robustness to\nhyperparameter variations and practicality for diverse applications. We further\ntested its robustness on tasks like LoRA fine-tuning for LLMs and diffusion\nmodels, where it consistently outperforms state-of-the-art optimizers. From a\nmemory efficiency perspective, SGD-SaI achieves substantial memory savings for\noptimizer states, reducing memory usage by 5.93 GB for GPT-2 (1.5B parameters)\nand 25.15 GB for Llama2-7B compared to AdamW in full-precision training\nsettings.", "paper_summary_zh": "<paragraph>在這項工作中，我們質疑自適應梯度方法訓練深度神經網路的必要性。SGD-SaI 是一種簡單但有效的增強，可以搭配帶動能的隨機梯度下降法 (SGDM) 使用。SGD-SaI 執行初始化時學習率縮放 (SaI) 至不同的參數群組，並由它們各自的梯度信噪比 (g-SNR) 引導。透過調整學習率，而不依賴自適應二階動能，SGD-SaI 有助於從第一個反覆運算開始防止訓練不平衡，並將最佳化器的記憶體使用量減半，與 AdamW 相比。儘管 SGD-SaI 既簡單又有效率，但在訓練各種基於 Transformer 的任務時，它始終能與 AdamW 相匹配，甚至表現得更好，有效克服了使用 SGD 訓練 Transformer 的長期挑戰。SGD-SaI 在使用視覺 Transformer (ViT) 進行 ImageNet-1K 分類以及大型語言模型 (LLM，僅解碼器 Transformer) 的 GPT-2 預訓練方面表現出色，證明了它對超參數變化的穩健性以及對各種應用程式的實用性。我們進一步測試了它在 LLM 和擴散模型的 LoRA 微調等任務上的穩健性，它始終優於最先進的最佳化器。從記憶體效率的角度來看，SGD-SaI 為最佳化器狀態節省了大量的記憶體，與 AdamW 在全精度訓練設定中相比，GPT-2 (1.5B 參數) 的記憶體使用量減少了 5.93 GB，而 Llama2-7B 則減少了 25.15 GB。</paragraph>", "author": "Minghao Xu et.al.", "authors": "Minghao Xu, Lichuan Xiang, Xu Cai, Hongkai Wen", "id": "2412.11768v1", "paper_url": "http://arxiv.org/abs/2412.11768v1", "repo": "https://github.com/anonymousalethiometer/sgd_sai"}}