{"2410.03185": {"publish_time": "2024-10-04", "title": "EXAQ: Exponent Aware Quantization For LLMs Acceleration", "paper_summary": "Quantization has established itself as the primary approach for decreasing\nthe computational and storage expenses associated with Large Language Models\n(LLMs) inference. The majority of current research emphasizes quantizing\nweights and activations to enable low-bit general-matrix-multiply (GEMM)\noperations, with the remaining non-linear operations executed at higher\nprecision. In our study, we discovered that following the application of these\ntechniques, the primary bottleneck in LLMs inference lies in the softmax layer.\nThe softmax operation comprises three phases: exponent calculation,\naccumulation, and normalization, Our work focuses on optimizing the first two\nphases. We propose an analytical approach to determine the optimal clipping\nvalue for the input to the softmax function, enabling sub-4-bit quantization\nfor LLMs inference. This method accelerates the calculations of both $e^x$ and\n$\\sum(e^x)$ with minimal to no accuracy degradation. For example, in\nLLaMA1-30B, we achieve baseline performance with 2-bit quantization on the\nwell-known \"Physical Interaction: Question Answering\" (PIQA) dataset\nevaluation. This ultra-low bit quantization allows, for the first time, an\nacceleration of approximately 4x in the accumulation phase. The combination of\naccelerating both $e^x$ and $\\sum(e^x)$ results in a 36.9% acceleration in the\nsoftmax operation.", "paper_summary_zh": "量化已成為減少與大語言模型 (LLM) 推論相關的運算和儲存開銷的主要方法。目前大多數的研究都強調量化權重和啟用，以實現低位元通用矩陣乘法 (GEMM) 運算，而其餘非線性運算則以較高精度執行。在我們的研究中，我們發現，在應用這些技術後，LLM 推論中的主要瓶頸在於 softmax 層。softmax 運算包含三個階段：指數計算、累積和正規化，我們的研究重點在於最佳化前兩個階段。我們提出了一種分析方法來確定 softmax 函數輸入的最佳裁剪值，從而實現 LLM 推論的 4 位元以下量化。此方法可加速計算 $e^x$ 和 $\\sum(e^x)$，同時將精確度降低到最小甚至不降低。例如，在 LLaMA1-30B 中，我們在著名的「物理互動：問答」(PIQA) 資料集評估中，以 2 位元量化達到了基準效能。這種超低位元量化首次允許在累積階段加速約 4 倍。加速 $e^x$ 和 $\\sum(e^x)$ 的結合，使 softmax 運算加速了 36.9%。", "author": "Moran Shkolnik et.al.", "authors": "Moran Shkolnik, Maxim Fishman, Brian Chmiel, Hilla Ben-Yaacov, Ron Banner, Kfir Yehuda Levy", "id": "2410.03185v1", "paper_url": "http://arxiv.org/abs/2410.03185v1", "repo": "https://github.com/anonymous1252022/exaq"}}