{"2410.16165": {"publish_time": "2024-10-21", "title": "From Tokens to Materials: Leveraging Language Models for Scientific Discovery", "paper_summary": "Exploring the predictive capabilities of language models in material science\nis an ongoing interest. This study investigates the application of language\nmodel embeddings to enhance material property prediction in materials science.\nBy evaluating various contextual embedding methods and pre-trained models,\nincluding Bidirectional Encoder Representations from Transformers (BERT) and\nGenerative Pre-trained Transformers (GPT), we demonstrate that domain-specific\nmodels, particularly MatBERT significantly outperform general-purpose models in\nextracting implicit knowledge from compound names and material properties. Our\nfindings reveal that information-dense embeddings from the third layer of\nMatBERT, combined with a context-averaging approach, offer the most effective\nmethod for capturing material-property relationships from the scientific\nliterature. We also identify a crucial \"tokenizer effect,\" highlighting the\nimportance of specialized text processing techniques that preserve complete\ncompound names while maintaining consistent token counts. These insights\nunderscore the value of domain-specific training and tokenization in materials\nscience applications and offer a promising pathway for accelerating the\ndiscovery and development of new materials through AI-driven approaches.", "paper_summary_zh": "探索語言模型在材料科學中的預測能力是一項持續的興趣。本研究探討了語言模型嵌入應用於增強材料科學中材料屬性預測。通過評估各種上下文嵌入方法和預訓練模型，包括來自 Transformer 的雙向編碼器表示（BERT）和生成式預訓練 Transformer（GPT），我們證明了特定領域的模型，特別是 MatBERT 在從化合物名稱和材料屬性中提取隱含知識方面明顯優於通用模型。我們的研究結果表明，來自 MatBERT 第三層的信息密集嵌入與上下文平均方法相結合，提供了一種最有效的方法，可以從科學文獻中獲取材料屬性關係。我們還發現了一個至關重要的「分詞器效應」，強調了專業文本處理技術的重要性，這些技術在保持一致的令牌計數的同時保留了完整的化合物名稱。這些見解強調了特定領域的訓練和分詞在材料科學應用中的價值，並為通過人工智能驅動的方法加速發現和開發新材料提供了一條有前景的途徑。", "author": "Yuwei Wan et.al.", "authors": "Yuwei Wan, Tong Xie, Nan Wu, Wenjie Zhang, Chunyu Kit, Bram Hoex", "id": "2410.16165v1", "paper_url": "http://arxiv.org/abs/2410.16165v1", "repo": "null"}}