{"2405.05349": {"publish_time": "2024-05-08", "title": "Offline Model-Based Optimization via Policy-Guided Gradient Search", "paper_summary": "Offline optimization is an emerging problem in many experimental engineering\ndomains including protein, drug or aircraft design, where online\nexperimentation to collect evaluation data is too expensive or dangerous. To\navoid that, one has to optimize an unknown function given only its offline\nevaluation at a fixed set of inputs. A naive solution to this problem is to\nlearn a surrogate model of the unknown function and optimize this surrogate\ninstead. However, such a naive optimizer is prone to erroneous overestimation\nof the surrogate (possibly due to over-fitting on a biased sample of function\nevaluation) on inputs outside the offline dataset. Prior approaches addressing\nthis challenge have primarily focused on learning robust surrogate models.\nHowever, their search strategies are derived from the surrogate model rather\nthan the actual offline data. To fill this important gap, we introduce a new\nlearning-to-search perspective for offline optimization by reformulating it as\nan offline reinforcement learning problem. Our proposed policy-guided gradient\nsearch approach explicitly learns the best policy for a given surrogate model\ncreated from the offline data. Our empirical results on multiple benchmarks\ndemonstrate that the learned optimization policy can be combined with existing\noffline surrogates to significantly improve the optimization performance.", "paper_summary_zh": "離線最佳化在許多實驗工程領域中是一個新興的問題，包括蛋白質、藥物或飛機設計，其中在線上實驗收集評估資料的成本過於昂貴或危險。為了避免這種情況，必須最佳化一個未知函數，且僅在固定輸入集上提供其離線評估。解決此問題的一個天真方法是學習未知函數的替代模型，並最佳化此替代模型。然而，這種天真的最佳化器容易對離線資料集之外的輸入過度估計替代模型（可能是由於過度擬合函數評估的偏差樣本）。先前解決此挑戰的方法主要集中在學習穩健的替代模型。然而，他們的搜尋策略是從替代模型衍生的，而不是實際的離線資料。為了填補這個重要的差距，我們引入了一個新的學習搜尋觀點，以離線最佳化為離線強化學習問題重新制定。我們提出的策略引導梯度搜尋方法明確學習從離線資料建立的特定替代模型的最佳策略。我們在多個基準上的經驗結果證明，學習的最佳化策略可以與現有的離線替代模型結合，以顯著提升最佳化效能。", "author": "Yassine Chemingui et.al.", "authors": "Yassine Chemingui, Aryan Deshwal, Trong Nghia Hoang, Janardhan Rao Doppa", "id": "2405.05349v1", "paper_url": "http://arxiv.org/abs/2405.05349v1", "repo": "https://github.com/yassinech/pgs"}}