{"2504.07624": {"publish_time": "2025-04-10", "title": "ConceptFormer: Towards Efficient Use of Knowledge-Graph Embeddings in Large Language Models", "paper_summary": "Retrieval Augmented Generation (RAG) has enjoyed increased attention in the\nrecent past and recent advancements in Large Language Models (LLMs) have\nhighlighted the importance of integrating world knowledge into these systems.\nCurrent RAG methodologies often modify the internal architecture of pre-trained\nlanguage models (PLMs) or rely on textifying knowledge graphs (KGs), which is\ninefficient in terms of token usage. This paper introduces ConceptFormer, a new\napproach to augment LLMs with structured knowledge from KGs, such as Wikidata,\nwithout altering their internal structure or relying on textual input of KGs.\nConceptFormer operates in the LLM embedding vector space, creating and\ninjecting \\emph{concept vectors} that encapsulate the information of the KG\nnodes directly. Trained in conjunction with a frozen LLM, ConceptFormer\ngenerates a comprehensive lookup table that maps KG nodes to their respective\nconcept vectors. The approach aims to enhance the factual recall capabilities\nof LLMs by enabling them to process these concept vectors natively, thus\nenriching them with structured world knowledge in an efficient and scalable\nmanner. Our experiments demonstrate that the addition of concept vectors to\nGPT-2 0.1B substantially increases its factual recall ability (Hit@10) by up to\n272\\% when tested on sentences from Wikipedia and up to 348\\% on synthetically\ngenerated sentences. Even injecting only a single concept vector into the\nprompt increases factual recall ability (Hit@10) by up to 213\\% on Wikipedia\nsentences, significantly outperforming RAG with graph textification while\nconsuming 130x fewer input tokens.", "paper_summary_zh": "<paragraph>檢索增強生成 (RAG) 近期受到越來越多的關注，大型語言模型 (LLM) 的最新進展也凸顯了將世界知識整合到這些系統中的重要性。目前的 RAG 方法通常會修改預訓練語言模型 (PLM) 的內部架構，或依賴知識圖譜 (KG) 的文本化，這在 token 使用方面效率低下。本文介紹了 ConceptFormer，這是一種使用來自 KG（例如 Wikidata）的結構化知識來增強 LLM 的新方法，無需更改其內部結構或依賴 KG 的文本輸入。ConceptFormer 在 LLM 嵌入向量空間中運作，創建並注入\\emph{概念向量}，直接封裝 KG 節點的信息。ConceptFormer 與凍結的 LLM 一起訓練，生成一個全面的查找表，將 KG 節點映射到它們各自的概念向量。該方法旨在通過使 LLM 能够原生處理這些概念向量，從而提高 LLM 的事實召回能力，以高效且可擴展的方式用結構化的世界知識豐富它們。我們的實驗表明，在 Wikipedia 句子上進行測試時，向 GPT-2 0.1B 添加概念向量可將其事實召回能力 (Hit@10) 顯著提高多達 272%，在綜合生成的句子上則提高多達 348%。即使僅在提示中注入單個概念向量，Wikipedia 句子上的事實召回能力 (Hit@10) 也能提高多達 213%，顯著優於使用圖譜文本化的 RAG，同時使用的輸入 token 減少了 130 倍。</paragraph>\n", "author": "Joel Barmettler et.al.", "authors": "Joel Barmettler, Abraham Bernstein, Luca Rossetto", "id": "2504.07624v1", "paper_url": "http://arxiv.org/abs/2504.07624v1", "repo": "null"}}