{"2406.16690": {"publish_time": "2024-06-24", "title": "Scaling Laws for Linear Complexity Language Models", "paper_summary": "The interest in linear complexity models for large language models is on the\nrise, although their scaling capacity remains uncertain. In this study, we\npresent the scaling laws for linear complexity language models to establish a\nfoundation for their scalability. Specifically, we examine the scaling\nbehaviors of three efficient linear architectures. These include TNL, a linear\nattention model with data-independent decay; HGRN2, a linear RNN with\ndata-dependent decay; and cosFormer2, a linear attention model without decay.\nWe also include LLaMA as a baseline architecture for softmax attention for\ncomparison. These models were trained with six variants, ranging from 70M to 7B\nparameters on a 300B-token corpus, and evaluated with a total of 1,376\nintermediate checkpoints on various downstream tasks. These tasks include\nvalidation loss, commonsense reasoning, and information retrieval and\ngeneration. The study reveals that existing linear complexity language models\nexhibit similar scaling capabilities as conventional transformer-based models\nwhile also demonstrating superior linguistic proficiency and knowledge\nretention.", "paper_summary_zh": "對於大型語言模型的線性複雜度模型的興趣正在增加，儘管它們的擴充能力仍然不確定。在本研究中，我們提出了線性複雜度語言模型的擴充定律，為它們的可擴充性奠定基礎。具體來說，我們檢驗了三種高效線性架構的擴充行為。這些架構包括 TNL，一種具有與資料無關衰減的線性注意力模型；HGRN2，一種具有與資料相關衰減的線性 RNN；以及 cosFormer2，一種沒有衰減的線性注意力模型。我們還將 LLaMA 作為 softmax 注意力的基準架構進行比較。這些模型使用六種變體進行訓練，範圍從 70M 到 7B 參數，在 300B 令牌語料庫上進行訓練，並使用總共 1,376 個中間檢查點在各種下游任務上進行評估。這些任務包括驗證損失、常識推理、資訊檢索和生成。研究表明，現有的線性複雜度語言模型展現出與傳統基於轉換器的模型類似的擴充能力，同時也展現出優異的語言能力和知識保留能力。", "author": "Xuyang Shen et.al.", "authors": "Xuyang Shen, Dong Li, Ruitao Leng, Zhen Qin, Weigao Sun, Yiran Zhong", "id": "2406.16690v1", "paper_url": "http://arxiv.org/abs/2406.16690v1", "repo": "null"}}