{"2407.09137": {"publish_time": "2024-07-12", "title": "A Look Into News Avoidance Through AWRS: An Avoidance-Aware Recommender System", "paper_summary": "In recent years, journalists have expressed concerns about the increasing\ntrend of news article avoidance, especially within specific domains. This issue\nhas been exacerbated by the rise of recommender systems. Our research indicates\nthat recommender systems should consider avoidance as a fundamental factor. We\nargue that news articles can be characterized by three principal elements:\nexposure, relevance, and avoidance, all of which are closely interconnected. To\naddress these challenges, we introduce AWRS, an Avoidance-Aware Recommender\nSystem. This framework incorporates avoidance awareness when recommending news,\nbased on the premise that news article avoidance conveys significant\ninformation about user preferences. Evaluation results on three news datasets\nin different languages (English, Norwegian, and Japanese) demonstrate that our\nmethod outperforms existing approaches.", "paper_summary_zh": "近年來，記者們對於新聞文章迴避的趨勢日益增加表達了擔憂，特別是在特定領域。推薦系統的興起加劇了這個問題。我們的研究表明，推薦系統應將迴避視為一個基本因素。我們認為，新聞文章可以由三個主要元素來表徵：曝光、相關性和迴避，所有這些元素都密切相關。為了應對這些挑戰，我們引入了 AWRS，一個迴避感知推薦系統。這個框架在推薦新聞時納入了迴避感知，基於新聞文章迴避傳達了關於使用者偏好的重要資訊的前提。在三種不同語言（英語、挪威語和日語）的新聞資料集上的評估結果表明，我們的的方法優於現有的方法。", "author": "Igor L. R. Azevedo et.al.", "authors": "Igor L. R. Azevedo, Toyotaro Suzumura, Yuichiro Yasui", "id": "2407.09137v1", "paper_url": "http://arxiv.org/abs/2407.09137v1", "repo": "null"}}