{"2411.09356": {"publish_time": "2024-11-14", "title": "Multi-scale Generative Modeling for Fast Sampling", "paper_summary": "While working within the spatial domain can pose problems associated with\nill-conditioned scores caused by power-law decay, recent advances in\ndiffusion-based generative models have shown that transitioning to the wavelet\ndomain offers a promising alternative. However, within the wavelet domain, we\nencounter unique challenges, especially the sparse representation of\nhigh-frequency coefficients, which deviates significantly from the Gaussian\nassumptions in the diffusion process. To this end, we propose a multi-scale\ngenerative modeling in the wavelet domain that employs distinct strategies for\nhandling low and high-frequency bands. In the wavelet domain, we apply\nscore-based generative modeling with well-conditioned scores for low-frequency\nbands, while utilizing a multi-scale generative adversarial learning for\nhigh-frequency bands. As supported by the theoretical analysis and experimental\nresults, our model significantly improve performance and reduce the number of\ntrainable parameters, sampling steps, and time.", "paper_summary_zh": "在空间域内工作时，可能会遇到由幂律衰减引起的病态评分相关的问题，但基于扩散的生成模型的最新进展表明，过渡到小波域提供了一个有希望的替代方案。然而，在小波域内，我们遇到了独特的挑战，特别是高频系数的稀疏表示，它与扩散过程中的高斯假设有很大偏差。为此，我们提出了一种多尺度小波域生成模型，该模型采用不同的策略来处理低频和高频带。在小波域中，我们对低频带应用基于评分的生成模型，该模型具有良好的条件评分，同时对高频带利用多尺度生成对抗学习。正如理论分析和实验结果所支持的，我们的模型显著提高了性能，并减少了可训练参数、采样步骤和时间。", "author": "Xiongye Xiao et.al.", "authors": "Xiongye Xiao, Shixuan Li, Luzhe Huang, Gengshuo Liu, Trung-Kien Nguyen, Yi Huang, Di Chang, Mykel J. Kochenderfer, Paul Bogdan", "id": "2411.09356v1", "paper_url": "http://arxiv.org/abs/2411.09356v1", "repo": "null"}}