{"2405.04883": {"publish_time": "2024-05-08", "title": "Molecule-Space: Free Lunch in Unified Multimodal Space via Knowledge Fusion", "paper_summary": "Unified multi-model representation spaces are the foundation of multimodal\nunderstanding and generation. However, the billions of model parameters and\ncatastrophic forgetting problems make it challenging to further enhance\npre-trained unified spaces. In this work, we propose Molecule-Space, an idea\nthat treats multimodal representation spaces as \"molecules\", and augments\npre-trained unified space by integrating knowledge from extra expert spaces via\n\"molecules space reactions\". Specifically, we introduce two kinds of basic\nspace reactions: 1) Space Displacement Reaction and 2) Space Combination\nReaction. Based on these defined basic reactions, we design Complex Sequential\n& Parallel Reactions to effectively integrate multiple spaces simultaneously.\nBenefiting from the modularization concept, we further propose a coarse-to-fine\ncustomized inference strategy to flexibly adjust the enhanced unified space for\ndifferent purposes. Experimentally, we fuse the audio-image-text space of\nImageBind with the image-text and audio-text expert spaces. The resulting space\noutperforms ImageBind on 5 downstream tasks across 9 datasets. Moreover, via\ncustomized inference, it even surpasses the used image-text and audio-text\nexpert spaces.", "paper_summary_zh": "統一的多模式表示空間是多模式理解和生成的基礎。然而，數十億個模型參數和災難性遺忘問題使得進一步增強預訓練統一空間變得具有挑戰性。在這項工作中，我們提出了 Molecule-Space，這是一個將多模式表示空間視為「分子」的思想，並通過「分子空間反應」整合來自額外專家空間的知識來擴充預訓練統一空間。具體來說，我們引入了兩種基本的空間反應：1）空間置換反應和 2）空間組合反應。根據這些定義的基本反應，我們設計了複雜的順序和並行反應，以有效地同時整合多個空間。受益於模塊化概念，我們進一步提出了粗到細的客製化推論策略，以靈活調整增強的統一空間以適應不同的目的。在實驗中，我們將 ImageBind 的音訊-影像-文字空間與影像-文字和音訊-文字專家空間融合。生成的空間在 9 個資料集上的 5 個下游任務中優於 ImageBind。此外，通過客製化推論，它甚至超越了所使用的影像-文字和音訊-文字專家空間。", "author": "Zehan Wang et.al.", "authors": "Zehan Wang, Ziang Zhang, Xize Cheng, Rongjie Huang, Luping Liu, Zhenhui Ye, Haifeng Huang, Yang Zhao, Tao Jin, Peng Gao, Zhou Zhao", "id": "2405.04883v1", "paper_url": "http://arxiv.org/abs/2405.04883v1", "repo": "https://github.com/moleculespace/moleculespace"}}