{"2405.18732": {"publish_time": "2024-05-29", "title": "Gemini & Physical World: Large Language Models Can Estimate the Intensity of Earthquake Shaking from Multi-Modal Social Media Posts", "paper_summary": "This paper presents a novel approach for estimating the ground shaking\nintensity using social media data and CCTV footage. Employing the Gemini Pro\n(Reid et al. 2024) model, a multi-modal language model, we demonstrate the\nability to extract relevant information from unstructured data utilizing\ngenerative AI and natural language processing. The model output, in the form of\nModified Mercalli Intensity (MMI) values, align well with independent\nobservational data. Furthermore, our results suggest that beyond its advanced\nvisual and auditory understanding abilities, Gemini appears to utilize\nadditional sources of knowledge, including a simplified understanding of the\ngeneral relationship between earthquake magnitude, distance, and MMI intensity,\nwhich it presumably acquired during its training, in its reasoning and\ndecision-making processes. These findings raise intriguing questions about the\nextent of Gemini's general understanding of the physical world and its\nphenomena. The ability of Gemini to generate results consistent with\nestablished scientific knowledge highlights the potential of LLMs like Gemini\nin augmenting our understanding of complex physical phenomena such as\nearthquakes. More specifically, the results of this study highlight the\npotential of LLMs like Gemini to revolutionize citizen seismology by enabling\nrapid, effective, and flexible analysis of crowdsourced data from eyewitness\naccounts for assessing earthquake impact and providing crisis situational\nawareness. This approach holds great promise for improving early warning\nsystems, disaster response, and overall resilience in earthquake-prone regions.\nThis study provides a significant step toward harnessing the power of social\nmedia and AI for earthquake disaster mitigation.", "paper_summary_zh": "<paragraph>這篇論文提出一個新穎的方法，使用社群媒體資料和監視器畫面來評估地面震動強度。採用多模態語言模型 Gemini Pro（Reid et al. 2024），我們展示了從非結構化資料中萃取相關資訊的能力，利用生成式 AI 和自然語言處理。模型的輸出，以修正麥卡利強度（MMI）值的形式，與獨立的觀測資料吻合良好。此外，我們的結果顯示，除了進階的視覺和聽覺理解能力之外，Gemini 似乎利用了其他知識來源，包括在訓練過程中獲得的，對地震震級、距離和 MMI 強度之間一般關係的簡化理解，在其推理和決策過程中。這些發現提出了關於 Gemini 對物理世界及其現象的廣泛理解程度的有趣問題。Gemini 產生與已建立的科學知識一致的結果的能力，突顯了像 Gemini 這樣的 LLM 在擴展我們對複雜物理現象（例如地震）的理解方面的潛力。更具體地說，這項研究的結果突顯了像 Gemini 這樣的 LLM 透過讓群眾外包資料的目擊者報告得以快速、有效且彈性地分析，進而革新公民地震學的潛力，用於評估地震影響並提供危機狀況意識。這種方法對於改善地震多發地區的預警系統、災害應變和整體復原力具有很大的前景。這項研究為利用社群媒體和 AI 的力量來減輕地震災害邁出了一大步。</paragraph>", "author": "S. Mostafa Mousavi et.al.", "authors": "S. Mostafa Mousavi, Marc Stogaitis, Tajinder Gadh, Richard M Allen, Alexei Barski, Robert Bosch, Patrick Robertson, Nivetha Thiruverahan, Youngmin Cho", "id": "2405.18732v1", "paper_url": "http://arxiv.org/abs/2405.18732v1", "repo": "null"}}