{"2410.15012": {"publish_time": "2024-10-19", "title": "Pathologist-like explainable AI for interpretable Gleason grading in prostate cancer", "paper_summary": "The aggressiveness of prostate cancer, the most common cancer in men\nworldwide, is primarily assessed based on histopathological data using the\nGleason scoring system. While artificial intelligence (AI) has shown promise in\naccurately predicting Gleason scores, these predictions often lack inherent\nexplainability, potentially leading to distrust in human-machine interactions.\nTo address this issue, we introduce a novel dataset of 1,015 tissue microarray\ncore images, annotated by an international group of 54 pathologists. The\nannotations provide detailed localized pattern descriptions for Gleason grading\nin line with international guidelines. Utilizing this dataset, we develop an\ninherently explainable AI system based on a U-Net architecture that provides\npredictions leveraging pathologists' terminology. This approach circumvents\npost-hoc explainability methods while maintaining or exceeding the performance\nof methods trained directly for Gleason pattern segmentation (Dice score: 0.713\n$\\pm$ 0.003 trained on explanations vs. 0.691 $\\pm$ 0.010 trained on Gleason\npatterns). By employing soft labels during training, we capture the intrinsic\nuncertainty in the data, yielding strong results in Gleason pattern\nsegmentation even in the context of high interobserver variability. With the\nrelease of this dataset, we aim to encourage further research into segmentation\nin medical tasks with high levels of subjectivity and to advance the\nunderstanding of pathologists' reasoning processes.", "paper_summary_zh": "前列腺癌是全球男性最常見的癌症，其惡性程度主要根據 Gleason 評分系統使用組織病理學數據進行評估。雖然人工智慧 (AI) 在準確預測 Gleason 評分方面已展現潛力，但這些預測通常缺乏內在的可解釋性，可能會導致對人機互動的不信任。為了解決這個問題，我們引進了一個由 54 位病理學家組成的國際團隊註解的 1,015 個組織微陣列核心影像的新穎資料集。這些註解提供了詳細的局部模式描述，用於符合國際準則的 Gleason 分級。利用這個資料集，我們開發了一個基於 U-Net 架構的內在可解釋 AI 系統，該系統提供了利用病理學家術語進行預測。這種方法規避了事後可解釋性方法，同時維持或超越了直接訓練用於 Gleason 模式分割的方法的效能（Dice 分數：0.713 ± 0.003，訓練於解釋，相對於 0.691 ± 0.010，訓練於 Gleason 模式）。透過在訓練期間採用軟標籤，我們捕捉了資料中的內在不確定性，即使在觀察者間變異性高的情況下，也能在 Gleason 模式分割中產生強大的結果。透過釋出這個資料集，我們旨在鼓勵進一步研究主觀性高的醫療任務中的分割，並增進對病理學家推理過程的理解。", "author": "Gesa Mittmann et.al.", "authors": "Gesa Mittmann, Sara Laiouar-Pedari, Hendrik A. Mehrtens, Sarah Haggenmüller, Tabea-Clara Bucher, Tirtha Chanda, Nadine T. Gaisa, Mathias Wagner, Gilbert Georg Klamminger, Tilman T. Rau, Christina Neppl, Eva Maria Compérat, Andreas Gocht, Monika Hämmerle, Niels J. Rupp, Jula Westhoff, Irene Krücken, Maximillian Seidl, Christian M. Schürch, Marcus Bauer, Wiebke Solass, Yu Chun Tam, Florian Weber, Rainer Grobholz, Jaroslaw Augustyniak, Thomas Kalinski, Christian Hörner, Kirsten D. Mertz, Constanze Döring, Andreas Erbersdobler, Gabriele Deubler, Felix Bremmer, Ulrich Sommer, Michael Brodhun, Jon Griffin, Maria Sarah L. Lenon, Kiril Trpkov, Liang Cheng, Fei Chen, Angelique Levi, Guoping Cai, Tri Q. Nguyen, Ali Amin, Alessia Cimadamore, Ahmed Shabaik, Varsha Manucha, Nazeel Ahmad, Nidia Messias, Francesca Sanguedolce, Diana Taheri, Ezra Baraban, Liwei Jia, Rajal B. Shah, Farshid Siadat, Nicole Swarbrick, Kyung Park, Oudai Hassan, Siamak Sakhaie, Michelle R. Downes, Hiroshi Miyamoto, Sean R. Williamson, Tim Holland-Letz, Carolin V. Schneider, Jakob Nikolas Kather, Yuri Tolkach, Titus J. Brinker", "id": "2410.15012v1", "paper_url": "http://arxiv.org/abs/2410.15012v1", "repo": "null"}}