{"2412.18150": {"publish_time": "2024-12-24", "title": "EvalMuse-40K: A Reliable and Fine-Grained Benchmark with Comprehensive Human Annotations for Text-to-Image Generation Model Evaluation", "paper_summary": "Recently, Text-to-Image (T2I) generation models have achieved significant\nadvancements. Correspondingly, many automated metrics have emerged to evaluate\nthe image-text alignment capabilities of generative models. However, the\nperformance comparison among these automated metrics is limited by existing\nsmall datasets. Additionally, these datasets lack the capacity to assess the\nperformance of automated metrics at a fine-grained level. In this study, we\ncontribute an EvalMuse-40K benchmark, gathering 40K image-text pairs with\nfine-grained human annotations for image-text alignment-related tasks. In the\nconstruction process, we employ various strategies such as balanced prompt\nsampling and data re-annotation to ensure the diversity and reliability of our\nbenchmark. This allows us to comprehensively evaluate the effectiveness of\nimage-text alignment metrics for T2I models. Meanwhile, we introduce two new\nmethods to evaluate the image-text alignment capabilities of T2I models:\nFGA-BLIP2 which involves end-to-end fine-tuning of a vision-language model to\nproduce fine-grained image-text alignment scores and PN-VQA which adopts a\nnovel positive-negative VQA manner in VQA models for zero-shot fine-grained\nevaluation. Both methods achieve impressive performance in image-text alignment\nevaluations. We also use our methods to rank current AIGC models, in which the\nresults can serve as a reference source for future study and promote the\ndevelopment of T2I generation. The data and code will be made publicly\navailable.", "paper_summary_zh": "<paragraph>近期，文本到图像 (T2I) 生成模型取得了显著进展。相应地，许多自动化指标也随之出现，用于评估生成模型的图像文本对齐能力。然而，在现有的小型数据集的限制下，这些自动化指标之间的性能比较受到限制。此外，这些数据集缺乏在细粒度级别评估自动化指标性能的能力。在本研究中，我们贡献了一个 EvalMuse-40K 基准，收集了 40K 个图像文本对，并针对图像文本对齐相关任务进行细粒度的标注。在构建过程中，我们采用了平衡提示采样和数据重新标注等多种策略，以确保基准的多样性和可靠性。这使我们能够全面评估图像文本对齐指标对 T2I 模型的有效性。同时，我们引入了两种新的方法来评估 T2I 模型的图像文本对齐能力：FGA-BLIP2，它涉及端到端微调视觉语言模型以生成细粒度的图像文本对齐分数；以及 PN-VQA，它在 VQA 模型中采用了一种新颖的正负 VQA 方式进行零样本细粒度评估。两种方法在图像文本对齐评估中都取得了令人瞩目的性能。我们还使用我们的方法对当前的 AIGC 模型进行排名，其结果可以作为未来研究的参考来源，并促进 T2I 生成的发展。数据和代码将公开提供。</paragraph>", "author": "Shuhao Han et.al.", "authors": "Shuhao Han, Haotian Fan, Jiachen Fu, Liang Li, Tao Li, Junhui Cui, Yunqiu Wang, Yang Tai, Jingwei Sun, Chunle Guo, Chongyi Li", "id": "2412.18150v1", "paper_url": "http://arxiv.org/abs/2412.18150v1", "repo": "null"}}