{"2405.04333": {"publish_time": "2024-05-07", "title": "A Fourth Wave of Open Data? Exploring the Spectrum of Scenarios for Open Data and Generative AI", "paper_summary": "Since late 2022, generative AI has taken the world by storm, with widespread\nuse of tools including ChatGPT, Gemini, and Claude. Generative AI and large\nlanguage model (LLM) applications are transforming how individuals find and\naccess data and knowledge. However, the intricate relationship between open\ndata and generative AI, and the vast potential it holds for driving innovation\nin this field remain underexplored areas. This white paper seeks to unpack the\nrelationship between open data and generative AI and explore possible\ncomponents of a new Fourth Wave of Open Data: Is open data becoming AI ready?\nIs open data moving towards a data commons approach? Is generative AI making\nopen data more conversational? Will generative AI improve open data quality and\nprovenance? Towards this end, we provide a new Spectrum of Scenarios framework.\nThis framework outlines a range of scenarios in which open data and generative\nAI could intersect and what is required from a data quality and provenance\nperspective to make open data ready for those specific scenarios. These\nscenarios include: pertaining, adaptation, inference and insight generation,\ndata augmentation, and open-ended exploration. Through this process, we found\nthat in order for data holders to embrace generative AI to improve open data\naccess and develop greater insights from open data, they first must make\nprogress around five key areas: enhance transparency and documentation, uphold\nquality and integrity, promote interoperability and standards, improve\naccessibility and useability, and address ethical considerations.", "paper_summary_zh": "自 2022 年底以來，生成式 AI 已席捲全球，ChatGPT、Gemini 和 Claude 等工具廣泛使用。生成式 AI 和大型語言模型 (LLM) 應用程式正在改變個人尋找和存取資料與知識的方式。然而，開放資料和生成式 AI 之間的複雜關係，以及它在推動此領域創新的巨大潛力，仍然是尚未充分探索的領域。本白皮書旨在解開開放資料和生成式 AI 之間的關係，並探討開放資料第四波的可能組成部分：開放資料是否準備好迎接 AI？開放資料是否朝向資料共用方法邁進？生成式 AI 是否讓開放資料更具對話性？生成式 AI 是否會改善開放資料的品質和來源？為此，我們提供了一個新的情境光譜架構。此架構概述了一系列開放資料和生成式 AI 可能相交的情境，以及從資料品質和來源的角度來看，讓開放資料為這些特定情境做好準備所需的條件。這些情境包括：關聯、改編、推論和見解產生、資料擴充和開放式探索。透過此流程，我們發現資料持有者若要採用生成式 AI 來改善開放資料存取並從開放資料中發展出更深入的見解，他們必須先在五個關鍵領域取得進展：加強透明度和文件化、維護品質和完整性、促進互操作性和標準化、改善可存取性和可用性，以及解決倫理考量。", "author": "Hannah Chafetz et.al.", "authors": "Hannah Chafetz, Sampriti Saxena, Stefaan G. Verhulst", "id": "2405.04333v1", "paper_url": "http://arxiv.org/abs/2405.04333v1", "repo": "null"}}