{"2410.21673": {"publish_time": "2024-10-29", "title": "Knowledge-Guided Prompt Learning for Request Quality Assurance in Public Code Review", "paper_summary": "Public Code Review (PCR) is an assistant to the internal code review of the\ndevelopment team, in the form of a public Software Question Answering (SQA)\ncommunity, to help developers access high-quality and efficient review\nservices. Current methods on PCR mainly focus on the reviewer's perspective,\nincluding finding a capable reviewer, predicting comment quality, and\nrecommending/generating review comments. However, it is not well studied that\nhow to satisfy the review necessity requests posted by developers which can\nincrease their visibility, which in turn acts as a prerequisite for better\nreview responses. To this end, we propose a Knowledge-guided Prompt learning\nfor Public Code Review (KP-PCR) to achieve developer-based code review request\nquality assurance (i.e., predicting request necessity and recommending tags\nsubtask). Specifically, we reformulate the two subtasks via 1) text prompt\ntuning which converts both of them into a Masked Language Model (MLM) by\nconstructing prompt templates using hard prompt; 2) knowledge and code prefix\ntuning which introduces external knowledge by soft prompt, and uses data flow\ndiagrams to characterize code snippets. Finally, both of the request necessity\nprediction and tag recommendation subtasks output predicted results through an\nanswer engineering module. In addition, we further analysis the time complexity\nof our KP-PCR that has lightweight prefix based the operation of introducing\nknowledge. Experimental results on the PCR dataset for the period 2011-2023\ndemonstrate that our KP-PCR outperforms baselines by 8.3%-28.8% in the request\nnecessity prediction and by 0.1%-29.5% in the tag recommendation. The code\nimplementation is released at https://github.com/WUT-IDEA/KP-PCR.", "paper_summary_zh": "公共程式碼審查 (PCR) 是一種公開軟體問答 (SQA) 社群形式的內部程式碼審查助理，協助開發人員存取高品質且有效的審查服務。PCR 目前的主要關注點在於審查者的觀點，包括尋找有能力的審查者、預測評論品質，以及建議/產生審查評論。不過，對於如何滿足開發人員發布的審查必要性要求，進而增加其可見度，進而成為獲得更佳審查回應的先決條件，目前尚未有深入的研究。為此，我們提出知識引導提示學習，用於公共程式碼審查 (KP-PCR)，以達成基於開發人員的程式碼審查要求品質保證（即預測要求必要性並建議標籤子任務）。具體來說，我們透過 1) 文字提示調整，將兩個子任務轉換為遮蔽語言模型 (MLM)，方法是使用硬提示建構提示範本；2) 知識和程式碼前綴調整，透過軟提示引入外部知識，並使用資料流程圖來描述程式碼片段。最後，要求必要性預測和標籤建議子任務透過答案工程模組輸出預測結果。此外，我們進一步分析了 KP-PCR 的時間複雜度，其具有輕量級的前綴，基於引入知識的運作。2011-2023 年期間針對 PCR 資料集的實驗結果顯示，我們的 KP-PCR 在要求必要性預測方面優於基準 8.3%-28.8%，在標籤建議方面優於基準 0.1%-29.5%。程式碼實作已於 https://github.com/WUT-IDEA/KP-PCR 發布。", "author": "Lin Li et.al.", "authors": "Lin Li, Xinchun Yu, Xinyu Chen, Peng Liang", "id": "2410.21673v1", "paper_url": "http://arxiv.org/abs/2410.21673v1", "repo": "https://github.com/wut-idea/kp-pcr"}}