{"2412.11704": {"publish_time": "2024-12-16", "title": "Vocabulary Expansion of Chat Models with Unlabeled Target Language Data", "paper_summary": "Chat models (i.e. language models trained to follow instructions through\nconversation with humans) outperform base models (i.e. trained solely on\nunlabeled data) in both conversation and general task-solving abilities. These\nmodels are generally English-centric and require further adaptation for\nlanguages that are underrepresented in or absent from their training data. A\ncommon technique for adapting base models is to extend the model's vocabulary\nwith target language tokens, i.e. vocabulary expansion (VE), and then\ncontinually pre-train it on language-specific data. Using chat data is ideal\nfor chat model adaptation, but often, either this does not exist or is costly\nto construct. Alternatively, adapting chat models with unlabeled data is a\npossible solution, but it could result in catastrophic forgetting. In this\npaper, we investigate the impact of using unlabeled target language data for VE\non chat models for the first time. We first show that off-the-shelf VE\ngenerally performs well across target language tasks and models in 71% of\ncases, though it underperforms in scenarios where source chat models are\nalready strong. To further improve adapted models, we propose post-hoc\ntechniques that inject information from the source model without requiring any\nfurther training. Experiments reveal the effectiveness of our methods, helping\nthe adapted models to achieve performance improvements in 87% of cases.", "paper_summary_zh": "聊天模型（即通过与人类对话来遵循指令而训练的语言模型）在对话和一般任务解决能力方面都优于基础模型（即仅在未标记数据上训练的模型）。这些模型通常以英语为中心，并且需要针对在其训练数据中代表性不足或缺失的语言进行进一步的调整。调整基础模型的常用技术是使用目标语言令牌扩展模型词汇表，即词汇扩展 (VE)，然后在特定语言数据上持续预训练它。使用聊天数据是聊天模型调整的理想选择，但通常情况下，要么不存在此类数据，要么构建此类数据代价高昂。或者，使用未标记数据调整聊天模型是一种可能的解决方案，但它可能导致灾难性遗忘。在本文中，我们首次研究了使用未标记目标语言数据进行 VE 对聊天模型的影响。我们首先表明，现成的 VE 在 71% 的情况下通常在目标语言任务和模型中表现良好，尽管在源聊天模型已经很强大的情况下，它的表现不佳。为了进一步改进已调整的模型，我们提出了后验技术，这些技术从源模型中注入信息，而无需任何进一步的训练。实验揭示了我们方法的有效性，帮助调整后的模型在 87% 的情况下实现了性能改进。", "author": "Atsuki Yamaguchi et.al.", "authors": "Atsuki Yamaguchi, Terufumi Morishita, Aline Villavicencio, Nikolaos Aletras", "id": "2412.11704v1", "paper_url": "http://arxiv.org/abs/2412.11704v1", "repo": "https://github.com/gucci-j/chat-cve"}}