{"2405.17357": {"publish_time": "2024-05-27", "title": "DoRA: Enhancing Parameter-Efficient Fine-Tuning with Dynamic Rank Distribution", "paper_summary": "Fine-tuning large-scale pre-trained models is inherently a resource-intensive\ntask. While it can enhance the capabilities of the model, it also incurs\nsubstantial computational costs, posing challenges to the practical application\nof downstream tasks. Existing parameter-efficient fine-tuning (PEFT) methods\nsuch as Low-Rank Adaptation (LoRA) rely on a bypass framework that ignores the\ndifferential parameter budget requirements across weight matrices, which may\nlead to suboptimal fine-tuning outcomes. To address this issue, we introduce\nthe Dynamic Low-Rank Adaptation (DoRA) method. DoRA decomposes high-rank LoRA\nlayers into structured single-rank components, allowing for dynamic pruning of\nparameter budget based on their importance to specific tasks during training,\nwhich makes the most of the limited parameter budget. Experimental results\ndemonstrate that DoRA can achieve competitive performance compared with LoRA\nand full model fine-tuning, and outperform various strong baselines with the\nsame storage parameter budget. Our code is available at\nhttps://github.com/Yulongmao1/DoRA/", "paper_summary_zh": "微調大型預訓練模型本質上是一項資源密集型任務。雖然它可以增強模型的能力，但它也會產生大量的計算成本，對下游任務的實際應用構成挑戰。現有的參數高效微調 (PEFT) 方法（例如低秩適應 (LoRA)）依賴於一個旁路框架，該框架忽略了不同權重矩陣之間的差分參數預算需求，這可能會導致次優的微調結果。為了解決這個問題，我們引入了動態低秩適應 (DoRA) 方法。DoRA 將高秩 LoRA 層分解為結構化的單秩組件，允許根據參數預算對特定任務訓練期間的重要性進行動態剪枝，從而最大限度地利用有限的參數預算。實驗結果表明，與 LoRA 和完全模型微調相比，DoRA 可以實現具有競爭力的性能，並且在相同的存儲參數預算下優於各種強大的基線。我們的代碼可在 https://github.com/Yulongmao1/DoRA/ 獲得", "author": "Yulong Mao et.al.", "authors": "Yulong Mao, Kaiyu Huang, Changhao Guan, Ganglin Bao, Fengran Mo, Jinan Xu", "id": "2405.17357v1", "paper_url": "http://arxiv.org/abs/2405.17357v1", "repo": "https://github.com/yulongmao1/dora"}}