{"2412.13649": {"publish_time": "2024-12-18", "title": "SCOPE: Optimizing Key-Value Cache Compression in Long-context Generation", "paper_summary": "Key-Value (KV) cache has become a bottleneck of LLMs for long-context\ngeneration. Despite the numerous efforts in this area, the optimization for the\ndecoding phase is generally ignored. However, we believe such optimization is\ncrucial, especially for long-output generation tasks based on the following two\nobservations: (i) Excessive compression during the prefill phase, which\nrequires specific full context impairs the comprehension of the reasoning task;\n(ii) Deviation of heavy hitters occurs in the reasoning tasks with long\noutputs. Therefore, SCOPE, a simple yet efficient framework that separately\nperforms KV cache optimization during the prefill and decoding phases, is\nintroduced. Specifically, the KV cache during the prefill phase is preserved to\nmaintain the essential information, while a novel strategy based on sliding is\nproposed to select essential heavy hitters for the decoding phase. Memory usage\nand memory transfer are further optimized using adaptive and discontinuous\nstrategies. Extensive experiments on LongGenBench show the effectiveness and\ngeneralization of SCOPE and its compatibility as a plug-in to other\nprefill-only KV compression methods.", "paper_summary_zh": "鍵值 (KV) 快取已成為長語境生成 LLM 的瓶頸。儘管在該領域付出了許多努力，但通常會忽略對解碼階段的最佳化。然而，我們相信這種最佳化至關重要，特別是基於以下兩個觀察結果的長輸出生成任務：(i) 預填充階段的過度壓縮，需要特定的完整語境會損害對推理任務的理解；(ii) 在具有長輸出的推理任務中會發生重擊手的偏差。因此，引入了 SCOPE，一個簡單而高效的框架，在預填充和解碼階段分別執行 KV 快取最佳化。具體而言，預填充階段的 KV 快取被保留以維護必要資訊，同時提出了一種基於滑動的新策略來選擇解碼階段的必要重擊手。使用自適應和不連續策略進一步最佳化記憶體使用和記憶體傳輸。在 LongGenBench 上進行的廣泛實驗顯示了 SCOPE 的有效性和泛化性，以及它作為其他僅預填充 KV 壓縮方法的插入模組的相容性。", "author": "Jialong Wu et.al.", "authors": "Jialong Wu, Zhenglin Wang, Linhai Zhang, Yilong Lai, Yulan He, Deyu Zhou", "id": "2412.13649v1", "paper_url": "http://arxiv.org/abs/2412.13649v1", "repo": "null"}}