{"2409.03256": {"publish_time": "2024-09-05", "title": "E2CL: Exploration-based Error Correction Learning for Embodied Agents", "paper_summary": "Language models are exhibiting increasing capability in knowledge utilization\nand reasoning. However, when applied as agents in embodied environments, they\noften suffer from misalignment between their intrinsic knowledge and\nenvironmental knowledge, leading to infeasible actions. Traditional environment\nalignment methods, such as supervised learning on expert trajectories and\nreinforcement learning, face limitations in covering environmental knowledge\nand achieving efficient convergence, respectively. Inspired by human learning,\nwe propose Exploration-based Error Correction Learning (E2CL), a novel\nframework that leverages exploration-induced errors and environmental feedback\nto enhance environment alignment for LM-based agents. E2CL incorporates\nteacher-guided and teacher-free exploration to gather environmental feedback\nand correct erroneous actions. The agent learns to provide feedback and\nself-correct, thereby enhancing its adaptability to target environments.\nEvaluations in the Virtualhome environment demonstrate that E2CL-trained agents\noutperform those trained by baseline methods and exhibit superior\nself-correction capabilities.", "paper_summary_zh": "語言模型在知識利用和推理方面表現出越來越強的能力。然而，當它們作為具體環境中的代理時，它們通常會因為內在知識和環境知識之間的不一致而導致無法執行的動作。傳統的環境對齊方法，例如專家軌跡上的監督學習和強化學習，在涵蓋環境知識和實現有效收斂方面分別面臨限制。受人類學習的啟發，我們提出基於探索的錯誤修正學習 (E2CL)，這是一個新穎的框架，利用探索引起的錯誤和環境回饋來增強基於 LM 的代理的環境對齊。E2CL 結合了教師指導和無教師探索來收集環境回饋並修正錯誤動作。代理學習提供回饋並自我修正，從而增強其對目標環境的適應性。在 Virtualhome 環境中的評估表明，E2CL 訓練的代理優於基線方法訓練的代理，並表現出優越的自我修正能力。", "author": "Hanlin Wang et.al.", "authors": "Hanlin Wang, Chak Tou Leong, Jian Wang, Wenjie Li", "id": "2409.03256v1", "paper_url": "http://arxiv.org/abs/2409.03256v1", "repo": "null"}}