{"2410.08224": {"publish_time": "2024-09-26", "title": "A Survey of Spatio-Temporal EEG data Analysis: from Models to Applications", "paper_summary": "In recent years, the field of electroencephalography (EEG) analysis has\nwitnessed remarkable advancements, driven by the integration of machine\nlearning and artificial intelligence. This survey aims to encapsulate the\nlatest developments, focusing on emerging methods and technologies that are\npoised to transform our comprehension and interpretation of brain activity. We\ndelve into self-supervised learning methods that enable the robust\nrepresentation of brain signals, which are fundamental for a variety of\ndownstream applications. We also explore emerging discriminative methods,\nincluding graph neural networks (GNN), foundation models, and large language\nmodels (LLMs)-based approaches. Furthermore, we examine generative technologies\nthat harness EEG data to produce images or text, offering novel perspectives on\nbrain activity visualization and interpretation. The survey provides an\nextensive overview of these cutting-edge techniques, their current\napplications, and the profound implications they hold for future research and\nclinical practice. The relevant literature and open-source materials have been\ncompiled and are consistently being refreshed at\n\\url{https://github.com/wpf535236337/LLMs4TS}", "paper_summary_zh": "近年來，腦電圖 (EEG) 分析領域見證了顯著的進展，這要歸功於機器學習和人工智能的整合。本調查旨在概括最新發展，重點關注新興方法和技術，這些方法和技術有望轉變我們對大腦活動的理解和詮釋。我們深入探討自監督學習方法，這些方法能讓大腦信號的表示變得穩健，這對各種下游應用至關重要。我們還探討新興的判別方法，包括圖神經網路 (GNN)、基礎模型和大語言模型 (LLM) 為基礎的方法。此外，我們檢視利用 EEG 資料產生影像或文字的生成式技術，為大腦活動視覺化和詮釋提供了新的觀點。本調查對這些尖端技術、它們目前的應用以及它們對未來研究和臨床實務的深遠影響提供了廣泛的概述。相關文獻和開放原始碼資料已編譯，並持續更新於\n\\url{https://github.com/wpf535236337/LLMs4TS}", "author": "Pengfei Wang et.al.", "authors": "Pengfei Wang, Huanran Zheng, Silong Dai, Yiqiao Wang, Xiaotian Gu, Yuanbin Wu, Xiaoling Wang", "id": "2410.08224v1", "paper_url": "http://arxiv.org/abs/2410.08224v1", "repo": "null"}}