{"2408.06618": {"publish_time": "2024-08-13", "title": "Generalized knowledge-enhanced framework for biomedical entity and relation extraction", "paper_summary": "In recent years, there has been an increasing number of frameworks developed\nfor biomedical entity and relation extraction. This research effort aims to\naddress the accelerating growth in biomedical publications and the intricate\nnature of biomedical texts, which are written for mainly domain experts. To\nhandle these challenges, we develop a novel framework that utilizes external\nknowledge to construct a task-independent and reusable background knowledge\ngraph for biomedical entity and relation extraction. The design of our model is\ninspired by how humans learn domain-specific topics. In particular, humans\noften first acquire the most basic and common knowledge regarding a field to\nbuild the foundational knowledge and then use that as a basis for extending to\nvarious specialized topics. Our framework employs such common-knowledge-sharing\nmechanism to build a general neural-network knowledge graph that is learning\ntransferable to different domain-specific biomedical texts effectively.\nExperimental evaluations demonstrate that our model, equipped with this\ngeneralized and cross-transferable knowledge base, achieves competitive\nperformance benchmarks, including BioRelEx for binding interaction detection\nand ADE for Adverse Drug Effect identification.", "paper_summary_zh": "近年來，為生物醫學實體和關係萃取開發的框架數量不斷增加。這項研究工作旨在解決生物醫學出版物快速增長和生物醫學文本複雜的本質，這些文本主要是為領域專家撰寫的。為了應對這些挑戰，我們開發了一個新穎的框架，利用外部知識來構建一個與任務無關且可重複使用的背景知識圖，用於生物醫學實體和關係萃取。我們模型的設計靈感來自人類學習特定領域主題的方式。具體來說，人類通常會先獲取一個領域最基本和最常見的知識，以建立基礎知識，然後再以此為基礎擴展到各種專業主題。我們的框架採用這種常識共享機制來構建一個通用的神經網路知識圖，該知識圖可以有效地將學習成果轉移到不同的特定領域生物醫學文本。實驗評估表明，我們的模型配備了這個廣泛且可跨領域轉移的知識庫，在包括 BioRelEx（用於結合交互檢測）和 ADE（用於不良藥物反應識別）在內的競爭性效能基準中取得了成就。", "author": "Minh Nguyen et.al.", "authors": "Minh Nguyen, Phuong Le", "id": "2408.06618v1", "paper_url": "http://arxiv.org/abs/2408.06618v1", "repo": "null"}}