{"2410.07271": {"publish_time": "2024-10-09", "title": "Multi-Task Program Error Repair and Explanatory Diagnosis", "paper_summary": "Program errors can occur in any type of programming, and can manifest in a\nvariety of ways, such as unexpected output, crashes, or performance issues. And\nprogram error diagnosis can often be too abstract or technical for developers\nto understand, especially for beginners. The goal of this paper is to present a\nnovel machine-learning approach for Multi-task Program Error Repair and\nExplanatory Diagnosis (mPRED). A pre-trained language model is used to encode\nthe source code, and a downstream model is specifically designed to identify\nand repair errors. Programs and test cases will be augmented and optimized from\nseveral perspectives. Additionally, our approach incorporates a \"chain of\nthoughts\" method, which enables the models to produce intermediate reasoning\nexplanations before providing the final correction. To aid in visualizing and\nanalyzing the program structure, we use a graph neural network for program\nstructure visualization. Overall, our approach offers a promising approach for\nrepairing program errors across different programming languages and providing\nhelpful explanations to programmers.", "paper_summary_zh": "程式錯誤可能發生在任何類型的程式設計中，並可能以各種方式呈現，例如意外輸出、當機或效能問題。程式錯誤診斷通常對開發人員來說過於抽象或技術性，特別是對於初學者而言。本文的目的是提出一個新穎的多任務程式錯誤修復與解釋性診斷 (mPRED) 機器學習方法。預先訓練的語言模型用於編碼原始碼，而下游模型則專門設計用於識別和修復錯誤。程式和測試案例將從多個角度進行擴充和最佳化。此外，我們的做法包含「思考鏈」方法，使模型能夠在提供最終修正之前產生中間推理說明。為了幫助視覺化和分析程式結構，我們使用圖形神經網路進行程式結構視覺化。總的來說，我們的做法提供了一個有前景的方法，可以用於修復不同程式語言中的程式錯誤，並向程式設計師提供有用的說明。", "author": "Zhenyu Xu et.al.", "authors": "Zhenyu Xu, Victor S. Sheng", "id": "2410.07271v1", "paper_url": "http://arxiv.org/abs/2410.07271v1", "repo": "null"}}