{"2412.00056": {"publish_time": "2024-11-24", "title": "Improving Medical Diagnostics with Vision-Language Models: Convex Hull-Based Uncertainty Analysis", "paper_summary": "In recent years, vision-language models (VLMs) have been applied to various\nfields, including healthcare, education, finance, and manufacturing, with\nremarkable performance. However, concerns remain regarding VLMs' consistency\nand uncertainty, particularly in critical applications such as healthcare,\nwhich demand a high level of trust and reliability. This paper proposes a novel\napproach to evaluate uncertainty in VLMs' responses using a convex hull\napproach on a healthcare application for Visual Question Answering (VQA).\nLLM-CXR model is selected as the medical VLM utilized to generate responses for\na given prompt at different temperature settings, i.e., 0.001, 0.25, 0.50,\n0.75, and 1.00. According to the results, the LLM-CXR VLM shows a high\nuncertainty at higher temperature settings. Experimental outcomes emphasize the\nimportance of uncertainty in VLMs' responses, especially in healthcare\napplications.", "paper_summary_zh": "近年來，視覺語言模型 (VLM) 已應用於各種領域，包括醫療保健、教育、金融和製造業，並展現出卓越的效能。然而，對於 VLM 的一致性和不確定性仍有疑慮，特別是在醫療保健等關鍵應用中，這些應用需要高度的信任和可靠性。本文提出了一種新方法，使用凸包方法在視覺問答 (VQA) 的醫療保健應用中評估 VLM 回應的不確定性。LLM-CXR 模型被選為用於產生不同溫度設定下特定提示回應的醫療 VLM，即 0.001、0.25、0.50、0.75 和 1.00。根據結果，LLM-CXR VLM 在較高的溫度設定下顯示出高度的不確定性。實驗結果強調了 VLM 回應中不確定性的重要性，特別是在醫療保健應用中。", "author": "Ferhat Ozgur Catak et.al.", "authors": "Ferhat Ozgur Catak, Murat Kuzlu, Taylor Patrick", "id": "2412.00056v1", "paper_url": "http://arxiv.org/abs/2412.00056v1", "repo": "null"}}