{"2410.19302": {"publish_time": "2024-10-25", "title": "TEARS: Textual Representations for Scrutable Recommendations", "paper_summary": "Traditional recommender systems rely on high-dimensional (latent) embeddings\nfor modeling user-item interactions, often resulting in opaque representations\nthat lack interpretability. Moreover, these systems offer limited control to\nusers over their recommendations. Inspired by recent work, we introduce TExtuAl\nRepresentations for Scrutable recommendations (TEARS) to address these\nchallenges. Instead of representing a user's interests through a latent\nembedding, TEARS encodes them in natural text, providing transparency and\nallowing users to edit them. To do so, TEARS uses a modern LLM to generate user\nsummaries based on user preferences. We find the summaries capture user\npreferences uniquely. Using these summaries, we take a hybrid approach where we\nuse an optimal transport procedure to align the summaries' representation with\nthe learned representation of a standard VAE for collaborative filtering. We\nfind this approach can surpass the performance of three popular VAE models\nwhile providing user-controllable recommendations. We also analyze the\ncontrollability of TEARS through three simulated user tasks to evaluate the\neffectiveness of a user editing its summary.", "paper_summary_zh": "傳統推薦系統依賴於高維度（潛在）嵌入，用於建模使用者與項目的互動，這通常會導致不透明的表示，缺乏可解釋性。此外，這些系統對使用者的推薦提供有限的控制。受到近期研究的啟發，我們引入了可理解推薦的文字表示（TEARS），以解決這些挑戰。TEARS 並非透過潛在嵌入表示使用者的興趣，而是將它們編碼成自然語言，提供透明度並允許使用者編輯它們。為此，TEARS 使用現代 LLM 根據使用者偏好產生使用者摘要。我們發現摘要獨特地擷取了使用者偏好。使用這些摘要，我們採取混合方法，使用最佳傳輸程序將摘要的表示與標準 VAE 的協同過濾學習表示對齊。我們發現這種方法可以超越三種流行 VAE 模型的效能，同時提供使用者可控的推薦。我們還透過三個模擬使用者任務分析 TEARS 的可控性，以評估使用者編輯其摘要的有效性。", "author": "Emiliano Penaloza et.al.", "authors": "Emiliano Penaloza, Olivier Gouvert, Haolun Wu, Laurent Charlin", "id": "2410.19302v1", "paper_url": "http://arxiv.org/abs/2410.19302v1", "repo": "null"}}