{"2412.17339": {"publish_time": "2024-12-23", "title": "MineAgent: Towards Remote-Sensing Mineral Exploration with Multimodal Large Language Models", "paper_summary": "Remote-sensing mineral exploration is critical for identifying economically\nviable mineral deposits, yet it poses significant challenges for multimodal\nlarge language models (MLLMs). These include limitations in domain-specific\ngeological knowledge and difficulties in reasoning across multiple\nremote-sensing images, further exacerbating long-context issues. To address\nthese, we present MineAgent, a modular framework leveraging hierarchical\njudging and decision-making modules to improve multi-image reasoning and\nspatial-spectral integration. Complementing this, we propose MineBench, a\nbenchmark specific for evaluating MLLMs in domain-specific mineral exploration\ntasks using geological and hyperspectral data. Extensive experiments\ndemonstrate the effectiveness of MineAgent, highlighting its potential to\nadvance MLLMs in remote-sensing mineral exploration.", "paper_summary_zh": "遙測礦物勘探對於辨識經濟上可行的礦藏至關重要，但它對多模態大型語言模型 (MLLM) 而言卻構成重大挑戰。這些挑戰包括特定領域地質知識的限制，以及在多個遙測影像中進行推理的困難，進一步加劇了長語境問題。為了解決這些問題，我們提出了 MineAgent，一個利用階層判斷和決策模組來改善多影像推理和空間光譜整合的模組化框架。作為補充，我們提出了 MineBench，一個專門用於評估 MLLM 在特定領域礦物勘探任務中使用地質和高光譜資料的基準。廣泛的實驗證明了 MineAgent 的有效性，突顯了它在遙測礦物勘探中推進 MLLM 的潛力。", "author": "Beibei Yu et.al.", "authors": "Beibei Yu, Tao Shen, Hongbin Na, Ling Chen, Denqi Li", "id": "2412.17339v1", "paper_url": "http://arxiv.org/abs/2412.17339v1", "repo": "null"}}