{"2407.06177": {"publish_time": "2024-07-08", "title": "Vision-Language Models under Cultural and Inclusive Considerations", "paper_summary": "Large vision-language models (VLMs) can assist visually impaired people by\ndescribing images from their daily lives. Current evaluation datasets may not\nreflect diverse cultural user backgrounds or the situational context of this\nuse case. To address this problem, we create a survey to determine caption\npreferences and propose a culture-centric evaluation benchmark by filtering\nVizWiz, an existing dataset with images taken by people who are blind. We then\nevaluate several VLMs, investigating their reliability as visual assistants in\na culturally diverse setting. While our results for state-of-the-art models are\npromising, we identify challenges such as hallucination and misalignment of\nautomatic evaluation metrics with human judgment. We make our survey, data,\ncode, and model outputs publicly available.", "paper_summary_zh": "大型視覺語言模型 (VLM) 可以協助視障人士描述日常生活中的影像。目前的評估資料集可能無法反映不同的文化使用者背景或此使用案例的情境脈絡。為了解決此問題，我們製作一份問卷調查以決定字幕偏好，並透過篩選 VizWiz（一個由盲人拍攝影像的現有資料集）來提出以文化為中心的評估基準。接著我們評估數個 VLM，探討其在文化多元環境中作為視覺助理的可靠性。儘管我們針對最先進模型的結果令人振奮，但我們找出一些挑戰，例如幻覺和自動評估指標與人類判斷不一致。我們公開我們的調查、資料、程式碼和模型輸出。", "author": "Antonia Karamolegkou et.al.", "authors": "Antonia Karamolegkou, Phillip Rust, Yong Cao, Ruixiang Cui, Anders Søgaard, Daniel Hershcovich", "id": "2407.06177v1", "paper_url": "http://arxiv.org/abs/2407.06177v1", "repo": "null"}}