{"2405.15124": {"publish_time": "2024-05-24", "title": "Scaling Law for Time Series Forecasting", "paper_summary": "Scaling law that rewards large datasets, complex models and enhanced data\ngranularity has been observed in various fields of deep learning. Yet, studies\non time series forecasting have cast doubt on scaling behaviors of deep\nlearning methods for time series forecasting: while more training data improves\nperformance, more capable models do not always outperform less capable models,\nand longer input horizons may hurt performance for some models. We propose a\ntheory for scaling law for time series forecasting that can explain these\nseemingly abnormal behaviors. We take into account the impact of dataset size\nand model complexity, as well as time series data granularity, particularly\nfocusing on the look-back horizon, an aspect that has been unexplored in\nprevious theories. Furthermore, we empirically evaluate various models using a\ndiverse set of time series forecasting datasets, which (1) verifies the\nvalidity of scaling law on dataset size and model complexity within the realm\nof time series forecasting, and (2) validates our theoretical framework,\nparticularly regarding the influence of look back horizon. We hope our findings\nmay inspire new models targeting time series forecasting datasets of limited\nsize, as well as large foundational datasets and models for time series\nforecasting in future works.\\footnote{Codes for our experiments will be made\npublic at:\n\\url{https://github.com/JingzheShi/ScalingLawForTimeSeriesForecasting}.", "paper_summary_zh": "<paragraph>在深度學習的各種領域中，已經觀察到擴充法則獎勵大型資料集、複雜模型和增強資料粒度。然而，時間序列預測的研究對時間序列預測的深度學習方法的擴充行為提出質疑：雖然更多訓練資料可以改善效能，但更強大的模型並非總是優於較弱的模型，而且較長的輸入時間範圍可能會損害某些模型的效能。我們提出一個時間序列預測的擴充法則理論，可以解釋這些看似異常的行為。我們考慮資料集大小和模型複雜度的影響，以及時間序列資料粒度，特別關注回顧時間範圍，這是以前理論中未探討的一個面向。此外，我們使用多樣化的時間序列預測資料集對各種模型進行經驗評估，這（1）驗證了時間序列預測領域中資料集大小和模型複雜度的擴充法則的有效性，以及（2）驗證了我們的理論架構，特別是關於回顧時間範圍的影響。我們希望我們的發現可以激勵新的模型，針對有限大小的時間序列預測資料集，以及未來時間序列預測的大型基礎資料集和模型。\\footnote{我們實驗的程式碼將公佈於：\\url{https://github.com/JingzheShi/ScalingLawForTimeSeriesForecasting}。}</paragraph>", "author": "Jingzhe Shi et.al.", "authors": "Jingzhe Shi, Qinwei Ma, Huan Ma, Lei Li", "id": "2405.15124v1", "paper_url": "http://arxiv.org/abs/2405.15124v1", "repo": "https://github.com/jingzheshi/scalinglawfortimeseriesforecasting"}}