{"2408.09695": {"publish_time": "2024-08-19", "title": "LightWeather: Harnessing Absolute Positional Encoding to Efficient and Scalable Global Weather Forecasting", "paper_summary": "Recently, Transformers have gained traction in weather forecasting for their\ncapability to capture long-term spatial-temporal correlations. However, their\ncomplex architectures result in large parameter counts and extended training\ntimes, limiting their practical application and scalability to global-scale\nforecasting. This paper aims to explore the key factor for accurate weather\nforecasting and design more efficient solutions. Interestingly, our empirical\nfindings reveal that absolute positional encoding is what really works in\nTransformer-based weather forecasting models, which can explicitly model the\nspatial-temporal correlations even without attention mechanisms. We\ntheoretically prove that its effectiveness stems from the integration of\ngeographical coordinates and real-world time features, which are intrinsically\nrelated to the dynamics of weather. Based on this, we propose LightWeather, a\nlightweight and effective model for station-based global weather forecasting.\nWe employ absolute positional encoding and a simple MLP in place of other\ncomponents of Transformer. With under 30k parameters and less than one hour of\ntraining time, LightWeather achieves state-of-the-art performance on global\nweather datasets compared to other advanced DL methods. The results underscore\nthe superiority of integrating spatial-temporal knowledge over complex\narchitectures, providing novel insights for DL in weather forecasting.", "paper_summary_zh": "<paragraph>最近，Transformer 在天气预报中获得了关注，因为它能够捕捉长期时空相关性。然而，它们复杂的架构导致参数计数庞大且训练时间延长，限制了它们在全球规模预报中的实际应用和可扩展性。本文旨在探索准确天气预报的关键因素并设计更有效的解决方案。有趣的是，我们的经验结果表明，绝对位置编码是基于 Transformer 的天气预报模型中真正起作用的因素，即使没有注意力机制，它也可以明确建模时空相关性。我们从理论上证明了其有效性源于地理坐标和现实世界时间特征的整合，这些特征与天气的动态本质上相关。基于此，我们提出了 LightWeather，这是一种用于基于站点的全球天气预报的轻量级且有效的模型。我们采用绝对位置编码和简单的 MLP 代替 Transformer 的其他组件。LightWeather 的参数不到 30k，训练时间不到一小时，与其他先进的 DL 方法相比，在全球天气数据集上实现了最先进的性能。结果强调了将时空知识集成到复杂架构中的优势，为天气预报中的 DL 提供了新的见解。</paragraph>", "author": "Yisong Fu et.al.", "authors": "Yisong Fu, Fei Wang, Zezhi Shao, Chengqing Yu, Yujie Li, Zhao Chen, Zhulin An, Yongjun Xu", "id": "2408.09695v1", "paper_url": "http://arxiv.org/abs/2408.09695v1", "repo": "null"}}