{"2411.06928": {"publish_time": "2024-11-11", "title": "Electroencephalogram-based Multi-class Decoding of Attended Speakers' Direction with Audio Spatial Spectrum", "paper_summary": "Decoding the directional focus of an attended speaker from listeners'\nelectroencephalogram (EEG) signals is essential for developing brain-computer\ninterfaces to improve the quality of life for individuals with hearing\nimpairment. Previous works have concentrated on binary directional focus\ndecoding, i.e., determining whether the attended speaker is on the left or\nright side of the listener. However, a more precise decoding of the exact\ndirection of the attended speaker is necessary for effective speech processing.\nAdditionally, audio spatial information has not been effectively leveraged,\nresulting in suboptimal decoding results. In this paper, we observe that, on\nour recently presented dataset with 15-class directional focus, models relying\nexclusively on EEG inputs exhibits significantly lower accuracy when decoding\nthe directional focus in both leave-one-subject-out and leave-one-trial-out\nscenarios. By integrating audio spatial spectra with EEG features, the decoding\naccuracy can be effectively improved. We employ the CNN, LSM-CNN, and\nEEG-Deformer models to decode the directional focus from listeners' EEG signals\nwith the auxiliary audio spatial spectra. The proposed Sp-Aux-Deformer model\nachieves notable 15-class decoding accuracies of 57.48% and 61.83% in\nleave-one-subject-out and leave-one-trial-out scenarios, respectively.", "paper_summary_zh": "解碼聽眾腦電圖 (EEG) 訊號中受關注說話者的方向焦點對於開發腦電腦介面至關重要，以提高聽力受損者的生活品質。先前的研究集中於二進位方向焦點解碼，即判斷受關注的說話者在聽眾的左側還是右側。然而，精確解碼受關注說話者的確切方向對於有效的語音處理是必要的。此外，音訊空間資訊尚未被有效利用，導致次佳解碼結果。在本文中，我們觀察到，在我們最近提出的 15 類方向焦點資料集中，僅依賴 EEG 輸入的模型在離開一個受試者和離開一個試驗的場景中解碼方向焦點時，準確度顯著降低。透過將音訊空間頻譜與 EEG 特徵整合，可以有效提高解碼準確度。我們採用 CNN、LSM-CNN 和 EEG-Deformer 模型從聽眾的 EEG 訊號中解碼方向焦點，並輔以音訊空間頻譜。提出的 Sp-Aux-Deformer 模型分別在離開一個受試者和離開一個試驗的場景中達到顯著的 15 類解碼準確度 57.48% 和 61.83%。", "author": "Yuanming Zhang et.al.", "authors": "Yuanming Zhang, Jing Lu, Zhibin Lin, Fei Chen, Haoliang Du, Xia Gao", "id": "2411.06928v1", "paper_url": "http://arxiv.org/abs/2411.06928v1", "repo": "null"}}