{"2410.20838": {"publish_time": "2024-10-28", "title": "A Simple Yet Effective Corpus Construction Framework for Indonesian Grammatical Error Correction", "paper_summary": "Currently, the majority of research in grammatical error correction (GEC) is\nconcentrated on universal languages, such as English and Chinese. Many\nlow-resource languages lack accessible evaluation corpora. How to efficiently\nconstruct high-quality evaluation corpora for GEC in low-resource languages has\nbecome a significant challenge. To fill these gaps, in this paper, we present a\nframework for constructing GEC corpora. Specifically, we focus on Indonesian as\nour research language and construct an evaluation corpus for Indonesian GEC\nusing the proposed framework, addressing the limitations of existing evaluation\ncorpora in Indonesian. Furthermore, we investigate the feasibility of utilizing\nexisting large language models (LLMs), such as GPT-3.5-Turbo and GPT-4, to\nstreamline corpus annotation efforts in GEC tasks. The results demonstrate\nsignificant potential for enhancing the performance of LLMs in low-resource\nlanguage settings. Our code and corpus can be obtained from\nhttps://github.com/GKLMIP/GEC-Construction-Framework.", "paper_summary_zh": "目前，語法錯誤修正 (GEC) 的大多數研究都集中在通用語言，例如英語和中文。許多低資源語言缺乏可存取的評量語料庫。如何有效建構低資源語言中 GEC 的高品質評量語料庫已成為一項重大挑戰。為了填補這些空白，我們在本文中提出了一個建構 GEC 語料庫的架構。具體來說，我們專注於印尼語作為我們的研究語言，並使用所提出的架構建構一個印尼語 GEC 評量語料庫，解決印尼語中現有評量語料庫的限制。此外，我們探討了利用現有的大型語言模型 (LLM)，例如 GPT-3.5-Turbo 和 GPT-4，以簡化 GEC 任務中的語料庫註解工作的可行性。結果證明了提高低資源語言設定中 LLM 效能的顯著潛力。我們的程式碼和語料庫可從 https://github.com/GKLMIP/GEC-Construction-Framework 取得。", "author": "Nankai Lin et.al.", "authors": "Nankai Lin, Meiyu Zeng, Wentao Huang, Shengyi Jiang, Lixian Xiao, Aimin Yang", "id": "2410.20838v1", "paper_url": "http://arxiv.org/abs/2410.20838v1", "repo": "https://github.com/gklmip/gec-construction-framework"}}