{"2411.12350": {"publish_time": "2024-11-19", "title": "DiM: $f$-Divergence Minimization Guided Sharpness-Aware Optimization for Semi-supervised Medical Image Segmentation", "paper_summary": "As a technique to alleviate the pressure of data annotation, semi-supervised\nlearning (SSL) has attracted widespread attention. In the specific domain of\nmedical image segmentation, semi-supervised methods (SSMIS) have become a\nresearch hotspot due to their ability to reduce the need for large amounts of\nprecisely annotated data. SSMIS focuses on enhancing the model's generalization\nperformance by leveraging a small number of labeled samples and a large number\nof unlabeled samples. The latest sharpness-aware optimization (SAM) technique,\nwhich optimizes the model by reducing the sharpness of the loss function, has\nshown significant success in SSMIS. However, SAM and its variants may not fully\naccount for the distribution differences between different datasets. To address\nthis issue, we propose a sharpness-aware optimization method based on\n$f$-divergence minimization (DiM) for semi-supervised medical image\nsegmentation. This method enhances the model's stability by fine-tuning the\nsensitivity of model parameters and improves the model's adaptability to\ndifferent datasets through the introduction of $f$-divergence. By reducing\n$f$-divergence, the DiM method not only improves the performance balance\nbetween the source and target datasets but also prevents performance\ndegradation due to overfitting on the source dataset.", "paper_summary_zh": "作為一種減輕資料標註壓力的技術，半監督式學習 (SSL) 已廣受關注。在醫學影像分割的特定領域中，半監督式方法 (SSMIS) 由於能夠減少對大量精確標註資料的需求而成為研究熱點。SSMIS 專注於透過利用少數標籤樣本和大量未標籤樣本來增強模型的泛化效能。最新的銳利度感知最佳化 (SAM) 技術透過降低損失函數的銳利度來最佳化模型，已在 SSMIS 中展現顯著的成功。然而，SAM 及其變體可能無法完全考量不同資料集之間的分布差異。為了解決此問題，我們提出了一種基於 $f$-散度最小化 (DiM) 的銳利度感知最佳化方法，用於半監督式醫學影像分割。此方法透過微調模型參數的敏感度並透過引入 $f$-散度來改善模型對不同資料集的適應性，進而增強模型的穩定性。透過降低 $f$-散度，DiM 方法不僅改善了來源資料集和目標資料集之間的效能平衡，還防止了因過度擬合來源資料集而導致的效能下降。", "author": "Bingli Wang et.al.", "authors": "Bingli Wang, Houcheng Su, Nan Yin, Mengzhu Wang, Li Shen", "id": "2411.12350v1", "paper_url": "http://arxiv.org/abs/2411.12350v1", "repo": "null"}}