{"2411.03811": {"publish_time": "2024-11-06", "title": "The natural stability of autonomous morphology", "paper_summary": "Autonomous morphology, such as inflection class systems and paradigmatic\ndistribution patterns, is widespread and diachronically resilient in natural\nlanguage. Why this should be so has remained unclear given that autonomous\nmorphology imposes learning costs, offers no clear benefit relative to its\nabsence and could easily be removed by the analogical forces which are\nconstantly reshaping it. Here we propose an explanation for the resilience of\nautonomous morphology, in terms of a diachronic dynamic of attraction and\nrepulsion between morphomic categories, which emerges spontaneously from a\nsimple paradigm cell filling process. Employing computational evolutionary\nmodels, our key innovation is to bring to light the role of `dissociative\nevidence', i.e., evidence for inflectional distinctiveness which a rational\nreasoner will have access to during analogical inference. Dissociative evidence\ncreates a repulsion dynamic which prevents morphomic classes from collapsing\ntogether entirely, i.e., undergoing complete levelling. As we probe alternative\nmodels, we reveal the limits of conditional entropy as a measure for\npredictability in systems that are undergoing change. Finally, we demonstrate\nthat autonomous morphology, far from being `unnatural' (e.g.\n\\citealt{Aronoff1994}), is rather the natural (emergent) consequence of a\nnatural (rational) process of inference applied to inflectional systems.", "paper_summary_zh": "<paragraph>自主形態學，例如詞形變化類別系統和範例分佈模式，在自然語言中廣泛存在且歷時性強韌。為什麼會這樣一直不明確，因為自主形態學強加了學習成本，相對於其不存在沒有明顯的優勢，並且可以很容易地通過不斷重塑它的類比力去除。在這裡，我們提出了一個對自主形態學彈性的解釋，即形態學類別之間的歷時性吸引和排斥動態，它自發地從一個簡單的範例單元填充過程中出現。採用計算演化模型，我們的關鍵創新是闡明「分離證據」的作用，即理性推理者在類比推理過程中可以獲得的詞形變化獨特性證據。分離證據創造了一個排斥動態，防止形態學類別完全崩潰，即進行完全的平準化。當我們探究替代模型時，我們揭示了條件熵作為正在發生變化的系統中可預測性的測量極限。最後，我們證明自主形態學遠非「非自然」（例如 \\citealt{Aronoff1994}），而是應用於詞形變化系統的自然（理性）推理過程的自然（湧現）結果。</paragraph>", "author": "Erich Round et.al.", "authors": "Erich Round, Louise Esher, Sacha Beniamine", "id": "2411.03811v1", "paper_url": "http://arxiv.org/abs/2411.03811v1", "repo": "null"}}