{"2501.16377": {"publish_time": "2025-01-24", "title": "Optimal Signal Decomposition-based Multi-Stage Learning for Battery Health Estimation", "paper_summary": "Battery health estimation is fundamental to ensure battery safety and reduce\ncost. However, achieving accurate estimation has been challenging due to the\nbatteries' complex nonlinear aging patterns and capacity regeneration\nphenomena. In this paper, we propose OSL, an optimal signal decomposition-based\nmulti-stage machine learning for battery health estimation. OSL treats battery\nsignals optimally. It uses optimized variational mode decomposition to extract\ndecomposed signals capturing different frequency bands of the original battery\nsignals. It also incorporates a multi-stage learning process to analyze both\nspatial and temporal battery features effectively. An experimental study is\nconducted with a public battery aging dataset. OSL demonstrates exceptional\nperformance with a mean error of just 0.26%. It significantly outperforms\ncomparison algorithms, both those without and those with suboptimal signal\ndecomposition and analysis. OSL considers practical battery challenges and can\nbe integrated into real-world battery management systems, offering a good\nimpact on battery monitoring and optimization.", "paper_summary_zh": "電池健康評估對於確保電池安全和降低成本至關重要。然而，由於電池複雜的非線性老化模式和容量再生現象，要實現準確的評估一直是一項挑戰。在本文中，我們提出 OSL，一種基於最佳信號分解的多階段機器學習，用於電池健康評估。OSL 最佳化處理電池信號。它使用最佳化的變分模式分解來提取分解信號，捕捉原始電池信號的不同頻率帶。它還結合了一個多階段學習過程，以有效分析電池的空間和時間特徵。使用公開電池老化數據集進行了一項實驗研究。OSL 表現出卓越的性能，平均誤差僅為 0.26%。它明顯優於比較演算法，包括沒有次優信號分解和分析的演算法和具有次優信號分解和分析的演算法。OSL 考慮了實際電池挑戰，可以整合到實際電池管理系統中，對電池監控和最佳化產生良好的影響。", "author": "Vijay Babu Pamshetti et.al.", "authors": "Vijay Babu Pamshetti, Wei Zhang, King Jet Tseng, Bor Kiat Ng, Qingyu Yan", "id": "2501.16377v1", "paper_url": "http://arxiv.org/abs/2501.16377v1", "repo": "null"}}