{"2411.14975": {"publish_time": "2024-11-22", "title": "Exploring Foundation Models Fine-Tuning for Cytology Classification", "paper_summary": "Cytology slides are essential tools in diagnosing and staging cancer, but\ntheir analysis is time-consuming and costly. Foundation models have shown great\npotential to assist in these tasks. In this paper, we explore how existing\nfoundation models can be applied to cytological classification. More\nparticularly, we focus on low-rank adaptation, a parameter-efficient\nfine-tuning method suited to few-shot learning. We evaluated five foundation\nmodels across four cytological classification datasets. Our results demonstrate\nthat fine-tuning the pre-trained backbones with LoRA significantly improves\nmodel performance compared to fine-tuning only the classifier head, achieving\nstate-of-the-art results on both simple and complex classification tasks while\nrequiring fewer data samples.", "paper_summary_zh": "細胞學載玻片是診斷和分期癌症的重要工具，但其分析既耗時又昂貴。基礎模型已顯示出在這些任務中提供協助的巨大潛力。在本文中，我們探討了如何將現有的基礎模型應用於細胞學分類。更具體地說，我們專注於低秩適應，這是一種適合於少次學習的參數高效微調方法。我們評估了五個基礎模型，涵蓋四個細胞學分類數據集。我們的結果表明，與僅微調分類器頭部相比，使用 LoRA 微調預訓練的骨幹顯著提高了模型性能，在簡單和複雜的分類任務上都取得了最先進的結果，同時需要更少數據樣本。", "author": "Manon Dausort et.al.", "authors": "Manon Dausort, Tiffanie Godelaine, Maxime Zanella, Karim El Khoury, Isabelle Salmon, Benoît Macq", "id": "2411.14975v1", "paper_url": "http://arxiv.org/abs/2411.14975v1", "repo": "https://github.com/mdausort/Cytology-fine-tuning"}}