{"2501.13609": {"publish_time": "2025-01-23", "title": "Domain-Specific Machine Translation to Translate Medicine Brochures in English to Sorani Kurdish", "paper_summary": "Access to Kurdish medicine brochures is limited, depriving Kurdish-speaking\ncommunities of critical health information. To address this problem, we\ndeveloped a specialized Machine Translation (MT) model to translate English\nmedicine brochures into Sorani Kurdish using a parallel corpus of 22,940\naligned sentence pairs from 319 brochures, sourced from two pharmaceutical\ncompanies in the Kurdistan Region of Iraq (KRI). We trained a Statistical\nMachine Translation (SMT) model using the Moses toolkit, conducting seven\nexperiments that resulted in BLEU scores ranging from 22.65 to 48.93. We\ntranslated three new brochures to improve the evaluation process and\nencountered unknown words. We addressed unknown words through post-processing\nwith a medical dictionary, resulting in BLEU scores of 56.87, 31.05, and 40.01.\nHuman evaluation by native Kurdish-speaking pharmacists, physicians, and\nmedicine users showed that 50% of professionals found the translations\nconsistent, while 83.3% rated them accurate. Among users, 66.7% considered the\ntranslations clear and felt confident using the medications.", "paper_summary_zh": "庫德語醫療手冊的取得管道有限，剝奪了庫德語社群獲得關鍵醫療資訊的權利。為了解決這個問題，我們開發了一個專門機器翻譯 (MT) 模型，使用來自伊拉克庫德斯坦地區 (KRI) 兩家製藥公司的 319 本手冊、22,940 對校準句子的平行語料庫，將英文醫療手冊翻譯成索拉尼庫德語。我們使用 Moses 工具包訓練了一個統計機器翻譯 (SMT) 模型，進行了七次實驗，得到的 BLEU 分數介於 22.65 到 48.93 之間。我們翻譯了三本新的小冊子以改善評估程序，並遇到了未知的單字。我們透過使用醫學辭典進行後處理來處理未知的單字，得到的 BLEU 分數為 56.87、31.05 和 40.01。由庫德語母語的藥劑師、醫師和醫療使用者進行的人工評估顯示，50% 的專業人士認為翻譯內容一致，而 83.3% 的人評估它們準確。在使用者中，66.7% 的人認為翻譯內容清楚，並有信心使用這些藥物。", "author": "Mariam Shamal et.al.", "authors": "Mariam Shamal, Hossein Hassani", "id": "2501.13609v1", "paper_url": "http://arxiv.org/abs/2501.13609v1", "repo": "null"}}