{"2407.07406": {"publish_time": "2024-07-10", "title": "Weakly-supervised Medical Image Segmentation with Gaze Annotations", "paper_summary": "Eye gaze that reveals human observational patterns has increasingly been\nincorporated into solutions for vision tasks. Despite recent explorations on\nleveraging gaze to aid deep networks, few studies exploit gaze as an efficient\nannotation approach for medical image segmentation which typically entails\nheavy annotating costs. In this paper, we propose to collect dense weak\nsupervision for medical image segmentation with a gaze annotation scheme. To\ntrain with gaze, we propose a multi-level framework that trains multiple\nnetworks from discriminative human attention, simulated with a set of\npseudo-masks derived by applying hierarchical thresholds on gaze heatmaps.\nFurthermore, to mitigate gaze noise, a cross-level consistency is exploited to\nregularize overfitting noisy labels, steering models toward clean patterns\nlearned by peer networks. The proposed method is validated on two public\nmedical datasets of polyp and prostate segmentation tasks. We contribute a\nhigh-quality gaze dataset entitled GazeMedSeg as an extension to the popular\nmedical segmentation datasets. To the best of our knowledge, this is the first\ngaze dataset for medical image segmentation. Our experiments demonstrate that\ngaze annotation outperforms previous label-efficient annotation schemes in\nterms of both performance and annotation time. Our collected gaze data and code\nare available at: https://github.com/med-air/GazeMedSeg.", "paper_summary_zh": "人类观察模式的眼球注视已越来越多地融入视觉任务的解决方案中。尽管最近探索了利用注视来辅助深度网络，但很少有研究利用注视作为医学图像分割的有效注释方法，这通常需要大量的注释成本。在本文中，我们提出收集密集的弱监督，用于具有凝视注释方案的医学图像分割。为了用注视进行训练，我们提出了一个多级框架，该框架从区分性人类注意力训练多个网络，并通过在凝视热图上应用分层阈值来模拟一组伪掩码。此外，为了减轻注视噪声，利用跨级一致性来正则化过度拟合的噪声标签，将模型引导至由对等网络学习的干净模式。所提出的方法已在两个公共医学数据集的多息肉和前列腺分割任务上得到验证。我们贡献了一个名为 GazeMedSeg 的高质量凝视数据集，作为流行医学分割数据集的扩展。据我们所知，这是医学图像分割的第一个凝视数据集。我们的实验表明，在性能和注释时间方面，凝视注释优于以前的标签高效注释方案。我们收集的凝视数据和代码可在以下位置获得：https://github.com/med-air/GazeMedSeg。", "author": "Yuan Zhong et.al.", "authors": "Yuan Zhong, Chenhui Tang, Yumeng Yang, Ruoxi Qi, Kang Zhou, Yuqi Gong, Pheng Ann Heng, Janet H. Hsiao, Qi Dou", "id": "2407.07406v1", "paper_url": "http://arxiv.org/abs/2407.07406v1", "repo": "https://github.com/med-air/gazemedseg"}}