{"2411.08227": {"publish_time": "2024-11-12", "title": "DPU: Dynamic Prototype Updating for Multimodal Out-of-Distribution Detection", "paper_summary": "Out-of-distribution (OOD) detection is essential for ensuring the robustness\nof machine learning models by identifying samples that deviate from the\ntraining distribution. While traditional OOD detection has primarily focused on\nsingle-modality inputs, such as images, recent advances in multimodal models\nhave demonstrated the potential of leveraging multiple modalities (e.g., video,\noptical flow, audio) to enhance detection performance. However, existing\nmethods often overlook intra-class variability within in-distribution (ID)\ndata, assuming that samples of the same class are perfectly cohesive and\nconsistent. This assumption can lead to performance degradation, especially\nwhen prediction discrepancies are uniformly amplified across all samples. To\naddress this issue, we propose Dynamic Prototype Updating (DPU), a novel\nplug-and-play framework for multimodal OOD detection that accounts for\nintra-class variations. Our method dynamically updates class center\nrepresentations for each class by measuring the variance of similar samples\nwithin each batch, enabling adaptive adjustments. This approach allows us to\namplify prediction discrepancies based on the updated class centers, thereby\nimproving the model's robustness and generalization across different\nmodalities. Extensive experiments on two tasks, five datasets, and nine base\nOOD algorithms demonstrate that DPU significantly improves OOD detection\nperformance, setting a new state-of-the-art in multimodal OOD detection, with\nimprovements of up to 80 percent in Far-OOD detection. To facilitate\naccessibility and reproducibility, our code is publicly available on GitHub.", "paper_summary_zh": "異常偵測（OOD）對於確保機器學習模型的穩健性至關重要，它可以識別偏離訓練分佈的樣本。雖然傳統的 OOD 偵測主要集中在單一模態輸入，例如影像，但多模態模型的最新進展已展示了利用多種模態（例如影片、光流、音訊）來增強偵測效能的潛力。然而，現有方法通常忽略了分佈內 (ID) 資料中的類內變異性，假設同類別的樣本是完全內聚且一致的。此假設可能會導致效能下降，特別是在所有樣本中均勻放大預測差異時。為了解決這個問題，我們提出了動態原型更新 (DPU)，這是一個用於多模態 OOD 偵測的新穎即插即用架構，它考慮了類內變異。我們的模型透過量測每一批次中相似樣本的變異，動態更新每個類別的類別中心表示，從而實現自適應調整。此方法允許我們根據更新後的類別中心放大預測差異，從而改善模型在不同模態下的穩健性和泛化性。在兩個任務、五個資料集和九個基本 OOD 演算法上的大量實驗證明，DPU 大幅改善了 OOD 偵測效能，在多模態 OOD 偵測中樹立了新的技術水準，遠離 OOD 偵測的改善幅度高達 80%。為了促進可及性和可重製性，我們的程式碼已公開在 GitHub 上。", "author": "Shawn Li et.al.", "authors": "Shawn Li, Huixian Gong, Hao Dong, Tiankai Yang, Zhengzhong Tu, Yue Zhao", "id": "2411.08227v1", "paper_url": "http://arxiv.org/abs/2411.08227v1", "repo": "https://github.com/lili0415/dpu-ood-detection"}}