{"2408.02784": {"publish_time": "2024-08-05", "title": "LLM economicus? Mapping the Behavioral Biases of LLMs via Utility Theory", "paper_summary": "Humans are not homo economicus (i.e., rational economic beings). As humans,\nwe exhibit systematic behavioral biases such as loss aversion, anchoring,\nframing, etc., which lead us to make suboptimal economic decisions. Insofar as\nsuch biases may be embedded in text data on which large language models (LLMs)\nare trained, to what extent are LLMs prone to the same behavioral biases?\nUnderstanding these biases in LLMs is crucial for deploying LLMs to support\nhuman decision-making. We propose utility theory-a paradigm at the core of\nmodern economic theory-as an approach to evaluate the economic biases of LLMs.\nUtility theory enables the quantification and comparison of economic behavior\nagainst benchmarks such as perfect rationality or human behavior. To\ndemonstrate our approach, we quantify and compare the economic behavior of a\nvariety of open- and closed-source LLMs. We find that the economic behavior of\ncurrent LLMs is neither entirely human-like nor entirely economicus-like. We\nalso find that most current LLMs struggle to maintain consistent economic\nbehavior across settings. Finally, we illustrate how our approach can measure\nthe effect of interventions such as prompting on economic biases.", "paper_summary_zh": "人類並非經濟人（即理性的經濟個體）。作為人類，\n我們表現出系統性的行為偏差，例如厭惡損失、錨定、\n框架等，這些偏差導致我們做出次優的經濟決策。在\n此類偏差可能嵌入大型語言模型 (LLM) 接受訓練的文本數據中，LLM 在多大程度上容易出現相同的行為偏差？\n了解 LLM 中的這些偏差對於部署 LLM 以支持\n人類決策至關重要。我們提出效用理論——現代經濟理論的核心範式——作為一種評估 LLM 經濟偏差的方法。\n效用理論能夠量化和比較經濟行為\n與完美理性或人類行為等基準。為了\n展示我們的做法，我們量化和比較了\n各種開源和閉源 LLM 的經濟行為。我們發現，當前 LLM 的經濟行為既不像人類也不完全像經濟人。我們\n還發現，大多數當前 LLM 難以在不同設置中保持一致的經濟行為。最後，我們說明了我們的做法如何衡量\n提示等干預措施對經濟偏差的影響。", "author": "Jillian Ross et.al.", "authors": "Jillian Ross, Yoon Kim, Andrew W. Lo", "id": "2408.02784v1", "paper_url": "http://arxiv.org/abs/2408.02784v1", "repo": "null"}}