{"2409.08846": {"publish_time": "2024-09-13", "title": "FP-VEC: Fingerprinting Large Language Models via Efficient Vector Addition", "paper_summary": "Training Large Language Models (LLMs) requires immense computational power\nand vast amounts of data. As a result, protecting the intellectual property of\nthese models through fingerprinting is essential for ownership authentication.\nWhile adding fingerprints to LLMs through fine-tuning has been attempted, it\nremains costly and unscalable. In this paper, we introduce FP-VEC, a pilot\nstudy on using fingerprint vectors as an efficient fingerprinting method for\nLLMs. Our approach generates a fingerprint vector that represents a\nconfidential signature embedded in the model, allowing the same fingerprint to\nbe seamlessly incorporated into an unlimited number of LLMs via vector\naddition. Results on several LLMs show that FP-VEC is lightweight by running on\nCPU-only devices for fingerprinting, scalable with a single training and\nunlimited fingerprinting process, and preserves the model's normal behavior.\nThe project page is available at https://fingerprintvector.github.io .", "paper_summary_zh": "訓練大型語言模型 (LLM) 需要龐大的運算能力和大量的資料。因此，透過指紋辨識保護這些模型的智慧財產權對於所有權驗證至關重要。雖然已嘗試透過微調將指紋新增至 LLM，但它仍然昂貴且無法擴充。在本文中，我們介紹 FP-VEC，這是一個試驗研究，使用指紋向量作為 LLM 的一種有效指紋辨識方法。我們的做法會產生一個指紋向量，用來表示嵌入模型中的機密簽章，讓同一個指紋能透過向量加法無縫地整合到無限個 LLM 中。在多個 LLM 上的結果顯示，FP-VEC 透過僅在 CPU 裝置上執行指紋辨識而輕量化，且透過單一訓練和無限指紋辨識程序而具備擴充性，並保留模型的正常行為。專案頁面可於 https://fingerprintvector.github.io 取得。", "author": "Zhenhua Xu et.al.", "authors": "Zhenhua Xu, Wenpeng Xing, Zhebo Wang, Chang Hu, Chen Jie, Meng Han", "id": "2409.08846v1", "paper_url": "http://arxiv.org/abs/2409.08846v1", "repo": "null"}}