{"2412.21037": {"publish_time": "2024-12-30", "title": "TangoFlux: Super Fast and Faithful Text to Audio Generation with Flow Matching and Clap-Ranked Preference Optimization", "paper_summary": "We introduce TangoFlux, an efficient Text-to-Audio (TTA) generative model\nwith 515M parameters, capable of generating up to 30 seconds of 44.1kHz audio\nin just 3.7 seconds on a single A40 GPU. A key challenge in aligning TTA models\nlies in the difficulty of creating preference pairs, as TTA lacks structured\nmechanisms like verifiable rewards or gold-standard answers available for Large\nLanguage Models (LLMs). To address this, we propose CLAP-Ranked Preference\nOptimization (CRPO), a novel framework that iteratively generates and optimizes\npreference data to enhance TTA alignment. We demonstrate that the audio\npreference dataset generated using CRPO outperforms existing alternatives. With\nthis framework, TangoFlux achieves state-of-the-art performance across both\nobjective and subjective benchmarks. We open source all code and models to\nsupport further research in TTA generation.", "paper_summary_zh": "我們介紹 TangoFlux，一個高效的文字轉音訊 (TTA) 生成模型，具有 515M 參數，能夠在單個 A40 GPU 上僅需 3.7 秒就能產生長達 30 秒的 44.1kHz 音訊。TTA 模型對齊的一個主要挑戰在於難以建立偏好配對，因為 TTA 缺乏大型語言模型 (LLM) 可用的結構化機制，例如可驗證的獎勵或黃金標準答案。為了解決這個問題，我們提出 CLAP 排名偏好最佳化 (CRPO)，這是一個新穎的框架，可反覆生成和最佳化偏好資料以增強 TTA 對齊。我們展示使用 CRPO 生成的音訊偏好資料集優於現有的替代方案。有了這個框架，TangoFlux 在客觀和主觀基準上都達到了最先進的效能。我們開放所有程式碼和模型，以支援 TTA 生成進一步的研究。", "author": "Chia-Yu Hung et.al.", "authors": "Chia-Yu Hung, Navonil Majumder, Zhifeng Kong, Ambuj Mehrish, Rafael Valle, Bryan Catanzaro, Soujanya Poria", "id": "2412.21037v1", "paper_url": "http://arxiv.org/abs/2412.21037v1", "repo": "null"}}