{"2410.18975": {"publish_time": "2024-10-24", "title": "Unbounded: A Generative Infinite Game of Character Life Simulation", "paper_summary": "We introduce the concept of a generative infinite game, a video game that\ntranscends the traditional boundaries of finite, hard-coded systems by using\ngenerative models. Inspired by James P. Carse's distinction between finite and\ninfinite games, we leverage recent advances in generative AI to create\nUnbounded: a game of character life simulation that is fully encapsulated in\ngenerative models. Specifically, Unbounded draws inspiration from sandbox life\nsimulations and allows you to interact with your autonomous virtual character\nin a virtual world by feeding, playing with and guiding it - with open-ended\nmechanics generated by an LLM, some of which can be emergent. In order to\ndevelop Unbounded, we propose technical innovations in both the LLM and visual\ngeneration domains. Specifically, we present: (1) a specialized, distilled\nlarge language model (LLM) that dynamically generates game mechanics,\nnarratives, and character interactions in real-time, and (2) a new dynamic\nregional image prompt Adapter (IP-Adapter) for vision models that ensures\nconsistent yet flexible visual generation of a character across multiple\nenvironments. We evaluate our system through both qualitative and quantitative\nanalysis, showing significant improvements in character life simulation, user\ninstruction following, narrative coherence, and visual consistency for both\ncharacters and the environments compared to traditional related approaches.", "paper_summary_zh": "我們引入了生成式無限遊戲的概念，一種透過使用生成式模型而超越了有限、硬編碼系統的傳統界線的電子遊戲。受到詹姆士·P·卡斯的有限遊戲和無限遊戲之間的區別啟發，我們利用生成式 AI 的最新進展來創造 Unbounded：一個完全封裝在生成式模型中的角色生活模擬遊戲。具體來說，Unbounded 從沙盒生活模擬中汲取靈感，並允許你透過餵食、玩耍和引導你的虛擬角色，在虛擬世界中與你的自主虛擬角色互動——這些角色是由大型語言模型 (LLM) 所生成，其中一些可能是新出現的。為了開發 Unbounded，我們在 LLM 和視覺生成領域提出了技術創新。具體來說，我們提出了：(1) 一個專門的、精煉的大型語言模型 (LLM)，它動態生成遊戲機制、敘事和角色互動，並在實時進行，以及 (2) 一個新的動態區域影像提示適配器 (IP-Adapter)，用於視覺模型，它確保了角色在多個環境中的視覺生成的一致性，同時也具有靈活性。我們透過定性和定量分析對我們的系統進行評估，顯示出在角色生活模擬、使用者指令遵循、敘事連貫性和角色與環境的視覺一致性方面，與傳統相關方法相比有顯著的改進。", "author": "Jialu Li et.al.", "authors": "Jialu Li, Yuanzhen Li, Neal Wadhwa, Yael Pritch, David E. Jacobs, Michael Rubinstein, Mohit Bansal, Nataniel Ruiz", "id": "2410.18975v1", "paper_url": "http://arxiv.org/abs/2410.18975v1", "repo": "null"}}