{"2412.07515": {"publish_time": "2024-12-10", "title": "CoPrUS: Consistency Preserving Utterance Synthesis towards more realistic benchmark dialogues", "paper_summary": "Large-scale Wizard-Of-Oz dialogue datasets have enabled the training of deep\nlearning-based dialogue systems. While they are successful as benchmark\ndatasets, they lack certain types of utterances, which would make them more\nrealistic. In this work, we investigate the creation of synthetic communication\nerrors in an automatic pipeline. Based on linguistic theory, we propose and\nfollow a simple error taxonomy. We focus on three types of miscommunications\nthat could happen in real-world dialogues but are underrepresented in the\nbenchmark dataset: misunderstandings, non-understandings and vaguely related\nquestions. Our two-step approach uses a state-of-the-art Large Language Model\n(LLM) to first create the error and secondly the repairing utterance. We\nperform Language Model-based evaluation to ensure the quality of the generated\nutterances. We apply the method to the MultiWOZ dataset and evaluate it both\nqualitatively and empirically as well as with human judges. Our results\nindicate that current LLMs can aid in adding post-hoc miscommunications to\nbenchmark datasets as a form of data augmentation. We publish the resulting\ndataset, in which nearly 1900 dialogues have been modified, as CoPrUS-MultiWOZ\nto facilitate future work on dialogue systems.", "paper_summary_zh": "大型绿野仙踪对话数据集已能训练基于深度学习的对话系统。虽然它们作为基准数据集很成功，但它们缺乏某些类型的言论，这会使它们更真实。在这项工作中，我们研究了在自动管道中创建合成通信错误。基于语言理论，我们提出并遵循简单的错误分类法。我们专注于现实世界对话中可能发生但在基准数据集中代表性不足的三种类型的误传：误解、不理解和含糊相关的问题。我们的两步法使用最先进的大语言模型 (LLM) 首先创建错误，然后修复言论。我们执行基于语言模型的评估以确保生成言论的质量。我们将该方法应用于 MultiWOZ 数据集，并对其进行定性和经验评估以及人类评判。我们的结果表明，当前的 LLM 可以帮助将事后误传添加到基准数据集作为数据扩充的一种形式。我们发布了结果数据集，其中近 1900 个对话已被修改，作为 CoPrUS-MultiWOZ，以促进对话系统未来的工作。", "author": "Sebastian Steindl et.al.", "authors": "Sebastian Steindl, Ulrich Schäfer, Bernd Ludwig", "id": "2412.07515v1", "paper_url": "http://arxiv.org/abs/2412.07515v1", "repo": "null"}}