{"2405.16884": {"publish_time": "2024-05-27", "title": "Match, Compare, or Select? An Investigation of Large Language Models for Entity Matching", "paper_summary": "Entity matching (EM) is a critical step in entity resolution. Recently,\nentity matching based on large language models (LLMs) has shown great promise.\nHowever, current LLM-based entity matching approaches typically follow a binary\nmatching paradigm that ignores the global consistency between different\nrecords. In this paper, we investigate various methodologies for LLM-based\nentity matching that incorporate record interactions from different\nperspectives. Specifically, we comprehensively compare three representative\nstrategies: matching, comparing, and selecting, and analyze their respective\nadvantages and challenges in diverse scenarios. Based on our findings, we\nfurther design a compositional entity matching (ComEM) framework that leverages\nthe composition of multiple strategies and LLMs. In this way, ComEM can benefit\nfrom the advantages of different sides and achieve improvements in both\neffectiveness and efficiency. Experimental results show that ComEM not only\nachieves significant performance gains on various datasets but also reduces the\ncost of LLM-based entity matching in real-world application.", "paper_summary_zh": "實體配對 (EM) 是實體解決方案中至關重要的一步。最近，基於大型語言模型 (LLM) 的實體配對已展現出極大的前景。然而，當前基於 LLM 的實體配對方法通常遵循二元配對範例，忽略不同記錄之間的整體一致性。在本文中，我們研究了各種基於 LLM 的實體配對方法，這些方法從不同角度整合記錄互動。具體來說，我們全面比較了三種代表性策略：配對、比較和選擇，並分析了它們在不同場景中的各自優勢和挑戰。根據我們的發現，我們進一步設計了一個組合實體配對 (ComEM) 框架，利用了多種策略和 LLM 的組合。這樣，ComEM 可以從不同方面的優勢中受益，並在有效性和效率方面取得進步。實驗結果表明，ComEM 不僅在各種數據集上實現了顯著的性能提升，還降低了 LLM 基於實體配對在實際應用中的成本。", "author": "Tianshu Wang et.al.", "authors": "Tianshu Wang, Hongyu Lin, Xiaoyang Chen, Xianpei Han, Hao Wang, Zhenyu Zeng, Le Sun", "id": "2405.16884v1", "paper_url": "http://arxiv.org/abs/2405.16884v1", "repo": "https://github.com/tshu-w/llm4em"}}