{"2409.16025": {"publish_time": "2024-09-24", "title": "Unlocking Markets: A Multilingual Benchmark to Cross-Market Question Answering", "paper_summary": "Users post numerous product-related questions on e-commerce platforms,\naffecting their purchase decisions. Product-related question answering (PQA)\nentails utilizing product-related resources to provide precise responses to\nusers. We propose a novel task of Multilingual Cross-market Product-based\nQuestion Answering (MCPQA) and define the task as providing answers to\nproduct-related questions in a main marketplace by utilizing information from\nanother resource-rich auxiliary marketplace in a multilingual context. We\nintroduce a large-scale dataset comprising over 7 million questions from 17\nmarketplaces across 11 languages. We then perform automatic translation on the\nElectronics category of our dataset, naming it as McMarket. We focus on two\nsubtasks: review-based answer generation and product-related question ranking.\nFor each subtask, we label a subset of McMarket using an LLM and further\nevaluate the quality of the annotations via human assessment. We then conduct\nexperiments to benchmark our dataset, using models ranging from traditional\nlexical models to LLMs in both single-market and cross-market scenarios across\nMcMarket and the corresponding LLM subset. Results show that incorporating\ncross-market information significantly enhances performance in both tasks.", "paper_summary_zh": "<paragraph>用戶在電子商務平台上發布許多與產品相關的問題，影響其購買決策。與產品相關的問題回答 (PQA) 意味著利用與產品相關的資源來向用戶提供精確的回應。我們提出了一個多語言跨市場產品問題回答 (MCPQA) 的新任務，並將該任務定義為利用多語言環境中另一個資源豐富的輔助市場中的信息來回答主要市場中與產品相關的問題。我們引入了一個大型數據集，其中包含來自 11 種語言的 17 個市場的 700 多萬個問題。然後，我們對數據集的電子產品類別進行自動翻譯，並將其命名為 McMarket。我們專注於兩個子任務：基於評論的答案生成和與產品相關的問題排名。對於每個子任務，我們使用 LLM 標記 McMarket 的一個子集，並通過人工評估進一步評估註釋的質量。然後，我們使用從傳統詞彙模型到 LLM 的模型在 McMarket 和相應的 LLM 子集中進行單一市場和跨市場場景的基準測試，以對我們的數據集進行基準測試。結果表明，在兩個任務中，合併跨市場信息顯著提高了性能。</paragraph>", "author": "Yifei Yuan et.al.", "authors": "Yifei Yuan, Yang Deng, Anders Søgaard, Mohammad Aliannejadi", "id": "2409.16025v1", "paper_url": "http://arxiv.org/abs/2409.16025v1", "repo": "null"}}