{"2410.19627": {"publish_time": "2024-10-25", "title": "Knowledge Graph Enhanced Language Agents for Recommendation", "paper_summary": "Language agents have recently been used to simulate human behavior and\nuser-item interactions for recommendation systems. However, current language\nagent simulations do not understand the relationships between users and items,\nleading to inaccurate user profiles and ineffective recommendations. In this\nwork, we explore the utility of Knowledge Graphs (KGs), which contain extensive\nand reliable relationships between users and items, for recommendation. Our key\ninsight is that the paths in a KG can capture complex relationships between\nusers and items, eliciting the underlying reasons for user preferences and\nenriching user profiles. Leveraging this insight, we propose Knowledge Graph\nEnhanced Language Agents(KGLA), a framework that unifies language agents and KG\nfor recommendation systems. In the simulated recommendation scenario, we\nposition the user and item within the KG and integrate KG paths as natural\nlanguage descriptions into the simulation. This allows language agents to\ninteract with each other and discover sufficient rationale behind their\ninteractions, making the simulation more accurate and aligned with real-world\ncases, thus improving recommendation performance. Our experimental results show\nthat KGLA significantly improves recommendation performance (with a 33%-95%\nboost in NDCG@1 among three widely used benchmarks) compared to the previous\nbest baseline method.", "paper_summary_zh": "語言代理最近已被用於模擬人類行為和推薦系統中的使用者項目互動。然而，目前的語言代理模擬並未了解使用者和項目之間的關係，導致使用者輪廓不準確和推薦效果不佳。在這項工作中，我們探討了知識圖譜 (KG) 的效用，其中包含使用者和項目之間廣泛且可靠的關係，以供推薦。我們的關鍵見解是，KG 中的路徑可以捕捉使用者和項目之間的複雜關係，引出使用者偏好的根本原因並豐富使用者輪廓。利用此見解，我們提出了知識圖譜增強語言代理 (KGLA)，一個統一語言代理和 KG 以用於推薦系統的架構。在模擬推薦情境中，我們將使用者和項目定位在 KG 中，並將 KG 路徑整合為自然語言描述到模擬中。這允許語言代理彼此互動並發現其互動背後的充分依據，使模擬更準確且與實際案例相符，從而改善推薦效能。我們的實驗結果顯示，與先前最佳基準方法相比，KGLA 大幅改善了推薦效能（在三個廣泛使用的基準中，NDCG@1 提升了 33%-95%）。", "author": "Taicheng Guo et.al.", "authors": "Taicheng Guo, Chaochun Liu, Hai Wang, Varun Mannam, Fang Wang, Xin Chen, Xiangliang Zhang, Chandan K. Reddy", "id": "2410.19627v1", "paper_url": "http://arxiv.org/abs/2410.19627v1", "repo": "null"}}