{"2501.01372": {"publish_time": "2025-01-02", "title": "ScarNet: A Novel Foundation Model for Automated Myocardial Scar Quantification from LGE in Cardiac MRI", "paper_summary": "Background: Late Gadolinium Enhancement (LGE) imaging is the gold standard\nfor assessing myocardial fibrosis and scarring, with left ventricular (LV) LGE\nextent predicting major adverse cardiac events (MACE). Despite its importance,\nroutine LGE-based LV scar quantification is hindered by labor-intensive manual\nsegmentation and inter-observer variability. Methods: We propose ScarNet, a\nhybrid model combining a transformer-based encoder from the Medical Segment\nAnything Model (MedSAM) with a convolution-based U-Net decoder, enhanced by\ntailored attention blocks. ScarNet was trained on 552 ischemic cardiomyopathy\npatients with expert segmentations of myocardial and scar boundaries and tested\non 184 separate patients. Results: ScarNet achieved robust scar segmentation in\n184 test patients, yielding a median Dice score of 0.912 (IQR: 0.863--0.944),\nsignificantly outperforming MedSAM (median Dice = 0.046, IQR: 0.043--0.047) and\nnnU-Net (median Dice = 0.638, IQR: 0.604--0.661). ScarNet demonstrated lower\nbias (-0.63%) and coefficient of variation (4.3%) compared to MedSAM (bias:\n-13.31%, CoV: 130.3%) and nnU-Net (bias: -2.46%, CoV: 20.3%). In Monte Carlo\nsimulations with noise perturbations, ScarNet achieved significantly higher\nscar Dice (0.892 \\pm 0.053, CoV = 5.9%) than MedSAM (0.048 \\pm 0.112, CoV =\n233.3%) and nnU-Net (0.615 \\pm 0.537, CoV = 28.7%). Conclusion: ScarNet\noutperformed MedSAM and nnU-Net in accurately segmenting myocardial and scar\nboundaries in LGE images. The model exhibited robust performance across diverse\nimage qualities and scar patterns.", "paper_summary_zh": "<paragraph>背景：延迟钆增强（LGE）成像用于评估心肌纤维化和瘢痕的黄金标准，左心室 (LV) LGE 范围预测重大的心脏不良事件 (MACE)。尽管其重要性，但基于 LGE 的常规 LV 瘢痕量化受到劳动密集型手动分割和观察者间差异的阻碍。方法：我们提出 ScarNet，一种混合模型，它将来自医学分割任何模型 (MedSAM) 的基于 Transformer 的编码器与基于卷积的 U-Net 解码器相结合，并通过定制的注意力块进行增强。ScarNet 在 552 例缺血性心肌病患者上接受训练，这些患者的心肌和瘢痕边界由专家分割，并在 184 例单独患者上进行测试。结果：ScarNet 在 184 例测试患者中实现了稳健的瘢痕分割，产生 0.912 的中值 Dice 得分（IQR：0.863--0.944），明显优于 MedSAM（中值 Dice = 0.046，IQR：0.043--0.047）和 nnU-Net（中值 Dice = 0.638，IQR：0.604--0.661）。与 MedSAM（偏差：-13.31%，CoV：130.3%）和 nnU-Net（偏差：-2.46%，CoV：20.3%）相比，ScarNet 表现出较低的偏差（-0.63%）和变异系数（4.3%）。在带有噪声扰动的蒙特卡罗模拟中，ScarNet 实现了明显高于 MedSAM（0.048 ± 0.112，CoV = 233.3%）和 nnU-Net（0.615 ± 0.537，CoV = 28.7%）的瘢痕 Dice（0.892 ± 0.053，CoV = 5.9%）。结论：ScarNet 在准确分割 LGE 图像中的心肌和瘢痕边界方面优于 MedSAM 和 nnU-Net。该模型在不同的图像质量和瘢痕模式下表现出稳健的性能。</paragraph>", "author": "Neda Tavakoli et.al.", "authors": "Neda Tavakoli, Amir Ali Rahsepar, Brandon C. Benefield, Daming Shen, Santiago López-Tapia, Florian Schiffers, Jeffrey J. Goldberger, Christine M. Albert, Edwin Wu, Aggelos K. Katsaggelos, Daniel C. Lee, Daniel Kim", "id": "2501.01372v1", "paper_url": "http://arxiv.org/abs/2501.01372v1", "repo": "null"}}