{"2408.10003": {"publish_time": "2024-08-19", "title": "Towards a Knowledge Graph for Models and Algorithms in Applied Mathematics", "paper_summary": "Mathematical models and algorithms are an essential part of mathematical\nresearch data, as they are epistemically grounding numerical data. In order to\nrepresent models and algorithms as well as their relationship semantically to\nmake this research data FAIR, two previously distinct ontologies were merged\nand extended, becoming a living knowledge graph. The link between the two\nontologies is established by introducing computational tasks, as they occur in\nmodeling, corresponding to algorithmic tasks. Moreover, controlled vocabularies\nare incorporated and a new class, distinguishing base quantities from specific\nuse case quantities, was introduced. Also, both models and algorithms can now\nbe enriched with metadata. Subject-specific metadata is particularly relevant\nhere, such as the symmetry of a matrix or the linearity of a mathematical\nmodel. This is the only way to express specific workflows with concrete models\nand algorithms, as the feasible solution algorithm can only be determined if\nthe mathematical properties of a model are known. We demonstrate this using two\nexamples from different application areas of applied mathematics. In addition,\nwe have already integrated over 250 research assets from applied mathematics\ninto our knowledge graph.", "paper_summary_zh": "數學模型和演算法是數學研究資料的必要部分，因為它們是認識論上基礎的數值資料。為了表示模型和演算法以及它們的語義關係，以使此研究資料 FAIR，兩個先前不同的本体被合併並擴充，成為一個活的知識圖譜。兩個本体之間的連結是透過引入運算任務來建立的，因為它們出現在建模中，對應於演算法任務。此外，受控詞彙被納入，並引入一個新的類別，區分基本量和特定用例量。此外，模型和演算法現在都可以用元資料豐富化。特定主題的元資料在此特別相關，例如矩陣的對稱性或數學模型的線性。這是使用具體模型和演算法表達特定工作流程的唯一方法，因為只有在已知模型的數學特性時，才能確定可行的解決演算法。我們使用應用數學不同應用領域的兩個範例來說明這一點。此外，我們已經將超過 250 個應用數學研究資產整合到我們的知識圖譜中。", "author": "Björn Schembera et.al.", "authors": "Björn Schembera, Frank Wübbeling, Hendrik Kleikamp, Burkhard Schmidt, Aurela Shehu, Marco Reidelbach, Christine Biedinger, Jochen Fiedler, Thomas Koprucki, Dorothea Iglezakis, Dominik Göddeke", "id": "2408.10003v1", "paper_url": "http://arxiv.org/abs/2408.10003v1", "repo": "null"}}