{"2501.00169": {"publish_time": "2024-12-30", "title": "DeepLL: Considering Linear Logic for the Analysis of Deep Learning Experiments", "paper_summary": "Deep Learning experiments have critical requirements regarding the careful\nhandling of their datasets as well as the efficient and correct usage of APIs\nthat interact with hardware accelerators. On the one hand, software mistakes\nduring data handling can contaminate experiments and lead to incorrect results.\nOn the other hand, poorly coded APIs that interact with the hardware can lead\nto sub-optimal usage and untrustworthy conclusions. In this work we investigate\nthe use of Linear Logic for the analysis of Deep Learning experiments. We show\nthat primitives and operators of Linear Logic can be used to express: (i) an\nabstract representation of the control flow of an experiment, (ii) a set of\navailable experimental resources, such as API calls to the underlying\ndata-structures and hardware as well as (iii) reasoning rules about the correct\nconsumption of resources during experiments. Our proposed model is not only\nlightweight but also easy to comprehend having both a symbolic and a visual\ncomponent. Finally, its artifacts are themselves proofs in Linear Logic that\ncan be readily verified by off-the-shelf reasoners.", "paper_summary_zh": "深度學習實驗對於資料集的仔細處理以及與硬體加速器互動的 API 的有效且正確使用具有重要的要求。一方面，資料處理過程中的軟體錯誤可能會污染實驗並導致不正確的結果。另一方面，與硬體互動的編碼不良的 API 可能導致次佳使用和不可靠的結論。在這項工作中，我們探討了使用線性邏輯來分析深度學習實驗。我們展示了線性邏輯的基本原理和運算符可用於表達：(i) 實驗控制流程的抽象表示，(ii) 一組可用的實驗資源，例如對底層資料結構和硬體的 API 呼叫以及 (iii) 關於在實驗期間正確消耗資源的推理規則。我們提出的模型不僅輕量級，而且易於理解，既有符號組成，也有視覺組成。最後，其工件本身就是線性邏輯中的證明，可以使用現成的推理器輕鬆驗證。", "author": "Nick Papoulias et.al.", "authors": "Nick Papoulias", "id": "2501.00169v1", "paper_url": "http://arxiv.org/abs/2501.00169v1", "repo": "null"}}