{"2503.09535": {"publish_time": "2025-03-12", "title": "Evaluating Visual Explanations of Attention Maps for Transformer-based Medical Imaging", "paper_summary": "Although Vision Transformers (ViTs) have recently demonstrated superior\nperformance in medical imaging problems, they face explainability issues\nsimilar to previous architectures such as convolutional neural networks. Recent\nresearch efforts suggest that attention maps, which are part of decision-making\nprocess of ViTs can potentially address the explainability issue by identifying\nregions influencing predictions, especially in models pretrained with\nself-supervised learning. In this work, we compare the visual explanations of\nattention maps to other commonly used methods for medical imaging problems. To\ndo so, we employ four distinct medical imaging datasets that involve the\nidentification of (1) colonic polyps, (2) breast tumors, (3) esophageal\ninflammation, and (4) bone fractures and hardware implants. Through large-scale\nexperiments on the aforementioned datasets using various supervised and\nself-supervised pretrained ViTs, we find that although attention maps show\npromise under certain conditions and generally surpass GradCAM in\nexplainability, they are outperformed by transformer-specific interpretability\nmethods. Our findings indicate that the efficacy of attention maps as a method\nof interpretability is context-dependent and may be limited as they do not\nconsistently provide the comprehensive insights required for robust medical\ndecision-making.", "paper_summary_zh": "<paragraph>雖然視覺 Transformer (ViT) 近期在醫學影像問題中展現出優異的效能，但它們也面臨著與先前架構（如卷積神經網路）類似的可解釋性問題。近期的研究指出，注意力圖譜作為 ViT 決策過程的一部分，有可能透過識別影響預測的區域來解決可解釋性問題，尤其是在使用自監督學習預訓練的模型中。在這項工作中，我們將注意力圖譜的視覺解釋與其他常用於醫學影像問題的方法進行了比較。為此，我們使用了四個不同的醫學影像數據集，這些數據集涉及識別 (1) 結腸息肉、(2) 乳腺腫瘤、(3) 食道發炎和 (4) 骨折和硬件植入物。透過使用各種監督式和自監督式預訓練 ViT 對上述數據集進行大規模實驗，我們發現儘管注意力圖譜在某些條件下顯示出良好的前景，並且在可解釋性方面通常優於 GradCAM，但它們的表現不如 Transformer 專用的可解釋性方法。我們的研究結果表明，注意力圖譜作為一種可解釋性方法的有效性取決於具體情況，並且可能存在局限性，因為它們無法始終如一地提供可靠醫學決策所需的全面見解。</paragraph>\n", "author": "Minjae Chung et.al.", "authors": "Minjae Chung, Jong Bum Won, Ganghyun Kim, Yujin Kim, Utku Ozbulak", "id": "2503.09535v1", "paper_url": "http://arxiv.org/abs/2503.09535v1", "repo": "null"}}