{"2406.06403": {"publish_time": "2024-06-10", "title": "Meta Learning Text-to-Speech Synthesis in over 7000 Languages", "paper_summary": "In this work, we take on the challenging task of building a single\ntext-to-speech synthesis system that is capable of generating speech in over\n7000 languages, many of which lack sufficient data for traditional TTS\ndevelopment. By leveraging a novel integration of massively multilingual\npretraining and meta learning to approximate language representations, our\napproach enables zero-shot speech synthesis in languages without any available\ndata. We validate our system's performance through objective measures and human\nevaluation across a diverse linguistic landscape. By releasing our code and\nmodels publicly, we aim to empower communities with limited linguistic\nresources and foster further innovation in the field of speech technology.", "paper_summary_zh": "在這項工作中，我們承擔了建立單一文字轉語音合成系統的挑戰性任務，該系統能夠以超過 7000 種語言產生語音，其中許多語言缺乏足夠的資料來進行傳統的 TTS 開發。透過利用大量多語言預訓練和元學習的新穎整合來近似語言表示，我們的做法可以在沒有任何可用資料的語言中進行零次學習語音合成。我們透過客觀措施和人類評估在不同的語言環境中驗證我們系統的效能。透過公開我們的程式碼和模型，我們旨在賦能語言資源有限的社群，並促進語音技術領域的進一步創新。", "author": "Florian Lux et.al.", "authors": "Florian Lux, Sarina Meyer, Lyonel Behringer, Frank Zalkow, Phat Do, Matt Coler, Emanuël A. P. Habets, Ngoc Thang Vu", "id": "2406.06403v1", "paper_url": "http://arxiv.org/abs/2406.06403v1", "repo": "null"}}