{"2410.03394": {"publish_time": "2024-10-04", "title": "Killing Two Flies with One Stone: An Attempt to Break LLMs Using English->Icelandic Idioms and Proper Names", "paper_summary": "This paper presents the submission of the \\'Arni Magn\\'usson Institute's team\nto the WMT24 test suite subtask, focusing on idiomatic expressions and proper\nnames for the English->Icelandic translation direction.\n  Intuitively and empirically, idioms and proper names are known to be a\nsignificant challenge for modern translation models. We create two different\ntest suites. The first evaluates the competency of MT systems in translating\ncommon English idiomatic expressions, as well as testing whether systems can\ndistinguish between those expressions and the same phrases when used in a\nliteral context. The second test suite consists of place names that should be\ntranslated into their Icelandic exonyms (and correctly inflected) and pairs of\nIcelandic names that share a surface form between the male and female variants,\nso that incorrect translations impact meaning as well as readability.\n  The scores reported are relatively low, especially for idiomatic expressions\nand place names, and indicate considerable room for improvement.", "paper_summary_zh": "本文介紹了「Arni Magn'usson 研究所」團隊提交至 WMT24 測試套件子任務的內容，重點在於英語到冰島語翻譯方向的慣用語和專有名詞。\n直覺上和經驗上，慣用語和專有名詞是現代翻譯模型的一大挑戰。我們建立了兩個不同的測試套件。第一個評估機器翻譯系統翻譯常見英語慣用語的能力，以及測試系統是否能區分這些慣用語和在字面語境中使用的相同片語。第二個測試套件包含應翻譯成其冰島語外來語（並正確變格）的地名，以及表面形式在男性和女性變體之間相同的冰島語姓名，因此錯誤的翻譯會影響意義和可讀性。\n報告的分數相對較低，特別是慣用語和地名，這表示有很大的改進空間。", "author": "Bjarki Ármannsson et.al.", "authors": "Bjarki Ármannsson, Hinrik Hafsteinsson, Atli Jasonarson, Steinþór Steingrímsson", "id": "2410.03394v1", "paper_url": "http://arxiv.org/abs/2410.03394v1", "repo": "null"}}