{"2502.03323": {"publish_time": "2025-02-05", "title": "Out-of-Distribution Detection using Synthetic Data Generation", "paper_summary": "Distinguishing in- and out-of-distribution (OOD) inputs is crucial for\nreliable deployment of classification systems. However, OOD data is typically\nunavailable or difficult to collect, posing a significant challenge for\naccurate OOD detection. In this work, we present a method that harnesses the\ngenerative capabilities of Large Language Models (LLMs) to create high-quality\nsynthetic OOD proxies, eliminating the dependency on any external OOD data\nsource. We study the efficacy of our method on classical text classification\ntasks such as toxicity detection and sentiment classification as well as\nclassification tasks arising in LLM development and deployment, such as\ntraining a reward model for RLHF and detecting misaligned generations.\nExtensive experiments on nine InD-OOD dataset pairs and various model sizes\nshow that our approach dramatically lowers false positive rates (achieving a\nperfect zero in some cases) while maintaining high accuracy on in-distribution\ntasks, outperforming baseline methods by a significant margin.", "paper_summary_zh": "區分分佈內和分佈外 (OOD) 輸入對於分類系統的可靠部署至關重要。然而，OOD 資料通常不可用或難以收集，對準確的 OOD 偵測構成重大挑戰。在這項工作中，我們提出了一種利用大型語言模型 (LLM) 的生成能力來建立高品質的合成 OOD 代理的方法，消除了對任何外部 OOD 資料來源的依賴。我們研究了我們的方法在經典文字分類任務上的功效，例如毒性偵測和情緒分類，以及在 LLM 開發和部署中出現的分類任務，例如訓練 RLHF 的獎勵模型和偵測錯誤對齊的生成。在九個 InD-OOD 資料集配對和各種模型大小上的廣泛實驗表明，我們的做法大幅降低了假陽性率（在某些情況下達到完美的零），同時在分佈內任務上保持高準確度，大幅優於基準方法。", "author": "Momin Abbas et.al.", "authors": "Momin Abbas, Muneeza Azmat, Raya Horesh, Mikhail Yurochkin", "id": "2502.03323v1", "paper_url": "http://arxiv.org/abs/2502.03323v1", "repo": "null"}}