{"2409.16984": {"publish_time": "2024-09-25", "title": "AXCEL: Automated eXplainable Consistency Evaluation using LLMs", "paper_summary": "Large Language Models (LLMs) are widely used in both industry and academia\nfor various tasks, yet evaluating the consistency of generated text responses\ncontinues to be a challenge. Traditional metrics like ROUGE and BLEU show a\nweak correlation with human judgment. More sophisticated metrics using Natural\nLanguage Inference (NLI) have shown improved correlations but are complex to\nimplement, require domain-specific training due to poor cross-domain\ngeneralization, and lack explainability. More recently, prompt-based metrics\nusing LLMs as evaluators have emerged; while they are easier to implement, they\nstill lack explainability and depend on task-specific prompts, which limits\ntheir generalizability. This work introduces Automated eXplainable Consistency\nEvaluation using LLMs (AXCEL), a prompt-based consistency metric which offers\nexplanations for the consistency scores by providing detailed reasoning and\npinpointing inconsistent text spans. AXCEL is also a generalizable metric which\ncan be adopted to multiple tasks without changing the prompt. AXCEL outperforms\nboth non-prompt and prompt-based state-of-the-art (SOTA) metrics in detecting\ninconsistencies across summarization by 8.7%, free text generation by 6.2%, and\ndata-to-text conversion tasks by 29.4%. We also evaluate the influence of\nunderlying LLMs on prompt based metric performance and recalibrate the SOTA\nprompt-based metrics with the latest LLMs for fair comparison. Further, we show\nthat AXCEL demonstrates strong performance using open source LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 廣泛用於產業和學術界\n執行各種任務，然而評估所產生文字回應的一致性\n仍然是一項挑戰。傳統指標，例如 ROUGE 和 BLEU，顯示出\n與人類判斷的相關性較弱。使用自然語言推論 (NLI) 的更精密的指標顯示出改善的相關性，但實作複雜，由於跨領域概化性差，需要特定領域的訓練，並且缺乏可解釋性。最近，使用 LLM 作為評估器的提示式指標已經出現；雖然它們更容易實作，但它們仍然缺乏可解釋性，並且依賴於特定任務的提示，這限制了它們的概化性。這項工作引入了使用 LLM 的自動化可解釋一致性評估 (AXCEL)，這是一個基於提示的一致性指標，它透過提供詳細的推理和精確定位不一致的文字範圍，為一致性評分提供解釋。AXCEL 也是一個可概化的指標，可以在不更改提示的情況下採用於多項任務。AXCEL 在檢測摘要的不一致性方面優於非提示式和提示式最先進 (SOTA) 指標 8.7%，自由文字產生 6.2%，以及資料到文字轉換任務 29.4%。我們也評估了底層 LLM 對基於提示的指標效能的影響，並使用最新的 LLM 重新校準 SOTA 基於提示的指標以進行公平比較。此外，我們展示了 AXCEL 使用開源 LLM 具有強大的效能。", "author": "P Aditya Sreekar et.al.", "authors": "P Aditya Sreekar, Sahil Verma, Suransh Chopra, Sarik Ghazarian, Abhishek Persad, Narayanan Sadagopan", "id": "2409.16984v1", "paper_url": "http://arxiv.org/abs/2409.16984v1", "repo": "null"}}