{"2407.04620": {"publish_time": "2024-07-05", "title": "Learning to (Learn at Test Time): RNNs with Expressive Hidden States", "paper_summary": "Self-attention performs well in long context but has quadratic complexity.\nExisting RNN layers have linear complexity, but their performance in long\ncontext is limited by the expressive power of their hidden state. We propose a\nnew class of sequence modeling layers with linear complexity and an expressive\nhidden state. The key idea is to make the hidden state a machine learning model\nitself, and the update rule a step of self-supervised learning. Since the\nhidden state is updated by training even on test sequences, our layers are\ncalled Test-Time Training (TTT) layers. We consider two instantiations:\nTTT-Linear and TTT-MLP, whose hidden state is a linear model and a two-layer\nMLP respectively. We evaluate our instantiations at the scale of 125M to 1.3B\nparameters, comparing with a strong Transformer and Mamba, a modern RNN. Both\nTTT-Linear and TTT-MLP match or exceed the baselines. Similar to Transformer,\nthey can keep reducing perplexity by conditioning on more tokens, while Mamba\ncannot after 16k context. With preliminary systems optimization, TTT-Linear is\nalready faster than Transformer at 8k context and matches Mamba in wall-clock\ntime. TTT-MLP still faces challenges in memory I/O, but shows larger potential\nin long context, pointing to a promising direction for future research.", "paper_summary_zh": "自注意力在長語境中表現良好，但具有二次複雜度。\n現有的 RNN 層具有線性複雜度，但它們在長語境中的表現受到其隱藏狀態表達能力的限制。我們提出了一類具有線性複雜度和表達性隱藏狀態的新型序列建模層。關鍵思想是將隱藏狀態本身作為一個機器學習模型，並將更新規則作為自監督學習的一個步驟。由於隱藏狀態通過訓練即使在測試序列上也會更新，因此我們的層被稱為測試時訓練 (TTT) 層。我們考慮了兩個實例：TTT-Linear 和 TTT-MLP，它們的隱藏狀態分別是一個線性模型和一個兩層 MLP。我們在 125M 到 1.3B 參數的規模上評估我們的實例，並與一個強大的 Transformer 和一個現代 RNN Mamba 進行比較。TTT-Linear 和 TTT-MLP 都匹配或超過了基準。與 Transformer 類似，它們可以通過對更多令牌進行條件化來持續降低困惑度，而 Mamba 在 16k 語境後則不能。通過初步的系統優化，TTT-Linear 在 8k 語境下已經比 Transformer 更快，並且在時鐘時間上與 Mamba 匹配。TTT-MLP 仍然面臨內存 I/O 的挑戰，但在長語境中顯示出更大的潛力，這為未來的研究指明了一個有希望的方向。", "author": "Yu Sun et.al.", "authors": "Yu Sun, Xinhao Li, Karan Dalal, Jiarui Xu, Arjun Vikram, Genghan Zhang, Yann Dubois, Xinlei Chen, Xiaolong Wang, Sanmi Koyejo, Tatsunori Hashimoto, Carlos Guestrin", "id": "2407.04620v1", "paper_url": "http://arxiv.org/abs/2407.04620v1", "repo": "https://github.com/test-time-training/ttt-lm-jax"}}