{"2405.17893": {"publish_time": "2024-05-28", "title": "Arithmetic Reasoning with LLM: Prolog Generation & Permutation", "paper_summary": "Instructing large language models (LLMs) to solve elementary school math\nproblems has shown great success using Chain of Thought (CoT). However, the CoT\napproach relies on an LLM to generate a sequence of arithmetic calculations\nwhich can be prone to cascaded calculation errors. We hypothesize that an LLM\nshould focus on extracting predicates and generating symbolic formulas from the\nmath problem description so that the underlying calculation can be done via an\nexternal code interpreter. We investigate using LLM to generate Prolog programs\nto solve mathematical questions. Experimental results show that our\nProlog-based arithmetic problem-solving outperforms CoT generation in the GSM8K\nbenchmark across three distinct LLMs. In addition, given the insensitive\nordering of predicates and symbolic formulas in Prolog, we propose to permute\nthe ground truth predicates for more robust LLM training via data augmentation.", "paper_summary_zh": "指導大型語言模型 (LLM) 解決小學數學問題，已使用思維鏈 (CoT) 顯示出巨大的成功。然而，CoT 方法依賴於 LLM 來產生一連串的算術計算，這可能會導致連鎖的計算錯誤。我們假設 LLM 應專注於從數學問題描述中提取謂詞和產生符號公式，以便基礎計算可透過外部程式碼解釋器完成。我們研究使用 LLM 來產生 Prolog 程式，以解決數學問題。實驗結果顯示，我們的 Prolog 基礎算術問題求解在 GSM8K 基準測試中，超越了三個不同的 LLM 中的 CoT 產生。此外，鑑於 Prolog 中謂詞和符號公式的順序不敏感，我們建議排列基本事實謂詞，以透過資料擴充進行更穩健的 LLM 訓練。", "author": "Xiaocheng Yang et.al.", "authors": "Xiaocheng Yang, Bingsen Chen, Yik-Cheung Tam", "id": "2405.17893v1", "paper_url": "http://arxiv.org/abs/2405.17893v1", "repo": "null"}}