{"2405.14750": {"publish_time": "2024-05-23", "title": "Extreme Solar Flare Prediction Using Residual Networks with HMI Magnetograms and Intensitygrams", "paper_summary": "Solar flares, especially C, M, and X class, pose significant risks to\nsatellite operations, communication systems, and power grids. We present a\nnovel approach for predicting extreme solar flares using HMI intensitygrams and\nmagnetograms. By detecting sunspots from intensitygrams and extracting magnetic\nfield patches from magnetograms, we train a Residual Network (ResNet) to\nclassify extreme class flares. Our model demonstrates high accuracy, offering a\nrobust tool for predicting extreme solar flares and improving space weather\nforecasting. Additionally, we show that HMI magnetograms provide more useful\ndata for deep learning compared to other SDO AIA images by better capturing\nfeatures critical for predicting flare magnitudes. This study underscores the\nimportance of identifying magnetic fields in solar flare prediction, marking a\nsignificant advancement in solar activity prediction with practical\nimplications for mitigating space weather impacts.", "paper_summary_zh": "太陽耀斑，尤其是 C、M 和 X 等級，對衛星運作、通訊系統和電網造成重大風險。我們提出了一種使用 HMI 強度圖和磁像圖預測極端太陽耀斑的新方法。我們透過從強度圖中偵測太陽黑子，並從磁像圖中萃取磁場斑塊，來訓練殘差網路 (ResNet) 分類極端等級耀斑。我們的模型展現出高準確性，提供了一個用於預測極端太陽耀斑和改善太空天氣預測的強大工具。此外，我們證明與其他 SDO AIA 影像相比，HMI 磁像圖提供了更多有用的資料用於深度學習，因為它能更好地擷取預測耀斑大小的關鍵特徵。這項研究強調了在太陽耀斑預測中辨識磁場的重要性，標誌著太陽活動預測的重大進展，並對減輕太空天氣影響具有實際意義。", "author": "Juyoung Yun et.al.", "authors": "Juyoung Yun, Jungmin Shin", "id": "2405.14750v1", "paper_url": "http://arxiv.org/abs/2405.14750v1", "repo": "null"}}