{"2407.08067": {"publish_time": "2024-07-10", "title": "On LLM Wizards: Identifying Large Language Models' Behaviors for Wizard of Oz Experiments", "paper_summary": "The Wizard of Oz (WoZ) method is a widely adopted research approach where a\nhuman Wizard ``role-plays'' a not readily available technology and interacts\nwith participants to elicit user behaviors and probe the design space. With the\ngrowing ability for modern large language models (LLMs) to role-play, one can\napply LLMs as Wizards in WoZ experiments with better scalability and lower cost\nthan the traditional approach. However, methodological guidance on responsibly\napplying LLMs in WoZ experiments and a systematic evaluation of LLMs'\nrole-playing ability are lacking. Through two LLM-powered WoZ studies, we take\nthe first step towards identifying an experiment lifecycle for researchers to\nsafely integrate LLMs into WoZ experiments and interpret data generated from\nsettings that involve Wizards role-played by LLMs. We also contribute a\nheuristic-based evaluation framework that allows the estimation of LLMs'\nrole-playing ability in WoZ experiments and reveals LLMs' behavior patterns at\nscale.", "paper_summary_zh": "綠野仙蹤 (WoZ) 方法是一種廣泛採用的研究方法，其中人類「扮演」一種尚未問世的技術，並與參與者互動以引發使用者行為並探討設計空間。隨著現代大型語言模型 (LLM) 扮演角色的能力日益增強，人們可以將 LLM 應用於 WoZ 實驗中的精靈，其可擴充性和成本低於傳統方法。然而，目前缺乏關於在 WoZ 實驗中負責任地應用 LLM 的方法指導，以及對 LLM 角色扮演能力的系統性評估。透過兩項 LLM 驅動的 WoZ 研究，我們邁出了第一步，以識別實驗生命週期，讓研究人員可以安全地將 LLM 整合到 WoZ 實驗中，並解釋從精靈扮演 LLM 的設定中產生的資料。我們還提供了一個基於啟發法的評估架構，可以估計 LLM 在 WoZ 實驗中的角色扮演能力，並揭示 LLM 的行為模式。", "author": "Jingchao Fang et.al.", "authors": "Jingchao Fang, Nikos Arechiga, Keiichi Namaoshi, Nayeli Bravo, Candice Hogan, David A. Shamma", "id": "2407.08067v1", "paper_url": "http://arxiv.org/abs/2407.08067v1", "repo": "null"}}