{"2411.05184": {"publish_time": "2024-11-07", "title": "Discern-XR: An Online Classifier for Metaverse Network Traffic", "paper_summary": "In this paper, we design an exclusive Metaverse network traffic classifier,\nnamed Discern-XR, to help Internet service providers (ISP) and router\nmanufacturers enhance the quality of Metaverse services. Leveraging segmented\nlearning, the Frame Vector Representation (FVR) algorithm and Frame\nIdentification Algorithm (FIA) are proposed to extract critical frame-related\nstatistics from raw network data having only four application-level features. A\nnovel Augmentation, Aggregation, and Retention Online Training (A2R-OT)\nalgorithm is proposed to find an accurate classification model through online\ntraining methodology. In addition, we contribute to the real-world Metaverse\ndataset comprising virtual reality (VR) games, VR video, VR chat, augmented\nreality (AR), and mixed reality (MR) traffic, providing a comprehensive\nbenchmark. Discern-XR outperforms state-of-the-art classifiers by 7% while\nimproving training efficiency and reducing false-negative rates. Our work\nadvances Metaverse network traffic classification by standing as the\nstate-of-the-art solution.", "paper_summary_zh": "在本文中，我們設計了一個獨家的元宇宙網路流量分類器，\n名為 Discern-XR，以幫助網路服務供應商 (ISP) 和路由器\n製造商提升元宇宙服務的品質。利用分段學習，提出幀向量表示 (FVR) 演算法和幀\n識別演算法 (FIA) 從只有四個應用層功能的原始網路資料中萃取關鍵的幀相關\n統計資料。提出一個新穎的擴充、彙總和保留線上訓練 (A2R-OT)\n演算法，透過線上訓練方法找到一個精準的分類模型。此外，我們貢獻一個包含虛擬實境 (VR) 遊戲、VR 影片、VR 聊天、擴增實境 (AR) 和混合實境 (MR) 流量的真實世界元宇宙資料集，提供一個全面的\n基準。Discern-XR 在提升訓練效率和降低偽陰性率的同時，優於最先進的分類器 7%。我們的研究透過成為\n最先進的解決方案，推動元宇宙網路流量分類。", "author": "Yoga Suhas Kuruba Manjunath et.al.", "authors": "Yoga Suhas Kuruba Manjunath, Austin Wissborn, Mathew Szymanowski, Mushu Li, Lian Zhao, Xiao-Ping Zhang", "id": "2411.05184v1", "paper_url": "http://arxiv.org/abs/2411.05184v1", "repo": "null"}}