{"2412.13738": {"publish_time": "2024-12-18", "title": "Uncertainty separation via ensemble quantile regression", "paper_summary": "This paper introduces a novel and scalable framework for uncertainty\nestimation and separation with applications in data driven modeling in science\nand engineering tasks where reliable uncertainty quantification is critical.\nLeveraging an ensemble of quantile regression (E-QR) models, our approach\nenhances aleatoric uncertainty estimation while preserving the quality of\nepistemic uncertainty, surpassing competing methods, such as Deep Ensembles\n(DE) and Monte Carlo (MC) dropout. To address challenges in separating\nuncertainty types, we propose an algorithm that iteratively improves separation\nthrough progressive sampling in regions of high uncertainty. Our framework is\nscalable to large datasets and demonstrates superior performance on synthetic\nbenchmarks, offering a robust tool for uncertainty quantification in\ndata-driven applications.", "paper_summary_zh": "本文介紹一個創新且可擴充的架構，用於不確定性估計和分離，並應用於科學和工程任務中的資料驅動建模，這些任務中可靠的不確定性量化至關重要。\n利用分位數回歸 (E-QR) 模型的集合，我們的做法增強了隨機不確定性估計，同時保留了認識不確定性的品質，超越了競爭方法，例如深度集合 (DE) 和蒙地卡羅 (MC) 輟學。為了應對分離不確定性類型的挑戰，我們提出了一種演算法，透過在高不確定性區域進行漸進式抽樣，反覆改善分離。我們的架構可擴充到大型資料集，並在合成基準上展現出卓越的效能，為資料驅動應用中的不確定性量化提供了一個強大的工具。", "author": "Navid Ansari et.al.", "authors": "Navid Ansari, Hans-Peter Seidel, Vahid Babaei", "id": "2412.13738v1", "paper_url": "http://arxiv.org/abs/2412.13738v1", "repo": "null"}}