{"2407.06904": {"publish_time": "2024-07-09", "title": "Hypergraph based Understanding for Document Semantic Entity Recognition", "paper_summary": "Semantic entity recognition is an important task in the field of\nvisually-rich document understanding. It distinguishes the semantic types of\ntext by analyzing the position relationship between text nodes and the relation\nbetween text content. The existing document understanding models mainly focus\non entity categories while ignoring the extraction of entity boundaries. We\nbuild a novel hypergraph attention document semantic entity recognition\nframework, HGA, which uses hypergraph attention to focus on entity boundaries\nand entity categories at the same time. It can conduct a more detailed analysis\nof the document text representation analyzed by the upstream model and achieves\na better performance of semantic information. We apply this method on the basis\nof GraphLayoutLM to construct a new semantic entity recognition model\nHGALayoutLM. Our experiment results on FUNSD, CORD, XFUND and SROIE show that\nour method can effectively improve the performance of semantic entity\nrecognition tasks based on the original model. The results of HGALayoutLM on\nFUNSD and XFUND reach the new state-of-the-art results.", "paper_summary_zh": "语义实体识别是视觉丰富文档理解领域中的一项重要任务。它通过分析文本节点之间的位置关系和文本内容之间的关系来区分文本的语义类型。现有的文档理解模型主要关注实体类别，而忽略了实体边界的提取。我们构建了一个新颖的超图注意力文档语义实体识别框架 HGA，它利用超图注意力同时关注实体边界和实体类别。它可以对上游模型分析的文档文本表示进行更详细的分析，并实现更好的语义信息性能。我们在 GraphLayoutLM 的基础上应用这种方法来构建新的语义实体识别模型 HGALayoutLM。我们在 FUNSD、CORD、XFUND 和 SROIE 上的实验结果表明，我们的方法可以有效提高基于原始模型的语义实体识别任务的性能。HGALayoutLM 在 FUNSD 和 XFUND 上的结果达到了新的最先进的结果。", "author": "Qiwei Li et.al.", "authors": "Qiwei Li, Zuchao Li, Ping Wang, Haojun Ai, Hai Zhao", "id": "2407.06904v1", "paper_url": "http://arxiv.org/abs/2407.06904v1", "repo": "null"}}