{"2410.06551": {"publish_time": "2024-10-09", "title": "InstantIR: Blind Image Restoration with Instant Generative Reference", "paper_summary": "Handling test-time unknown degradation is the major challenge in Blind Image\nRestoration (BIR), necessitating high model generalization. An effective\nstrategy is to incorporate prior knowledge, either from human input or\ngenerative model. In this paper, we introduce Instant-reference Image\nRestoration (InstantIR), a novel diffusion-based BIR method which dynamically\nadjusts generation condition during inference. We first extract a compact\nrepresentation of the input via a pre-trained vision encoder. At each\ngeneration step, this representation is used to decode current diffusion latent\nand instantiate it in the generative prior. The degraded image is then encoded\nwith this reference, providing robust generation condition. We observe the\nvariance of generative references fluctuate with degradation intensity, which\nwe further leverage as an indicator for developing a sampling algorithm\nadaptive to input quality. Extensive experiments demonstrate InstantIR achieves\nstate-of-the-art performance and offering outstanding visual quality. Through\nmodulating generative references with textual description, InstantIR can\nrestore extreme degradation and additionally feature creative restoration.", "paper_summary_zh": "處理測試時間未知的退化是盲圖像修復 (BIR) 中的主要挑戰，需要很高的模型概化能力。一個有效的策略是納入先驗知識，無論是來自人類輸入或生成模型。在本文中，我們介紹了即時參考圖像修復 (InstantIR)，這是一種基於擴散的新型 BIR 方法，可以在推理過程中動態調整生成條件。我們首先通過預訓練的視覺編碼器提取輸入的緊湊表示。在每個生成步驟中，此表示用於解碼當前的擴散潛在，並在生成先驗中實例化它。然後使用此參考對降級的圖像進行編碼，從而提供穩健的生成條件。我們觀察到生成參考的方差隨降解強度而波動，我們進一步利用它作為開發適應輸入質量的採樣演算法的指標。大量的實驗表明，InstantIR 達到了最先進的性能，並提供了出色的視覺品質。通過用文字描述調節生成參考，InstantIR 可以修復極端的退化，並另外提供創意的修復。", "author": "Jen-Yuan Huang et.al.", "authors": "Jen-Yuan Huang, Haofan Wang, Qixun Wang, Xu Bai, Hao Ai, Peng Xing, Jen-Tse Huang", "id": "2410.06551v1", "paper_url": "http://arxiv.org/abs/2410.06551v1", "repo": "null"}}