{"2412.15588": {"publish_time": "2024-12-20", "title": "NeSyCoCo: A Neuro-Symbolic Concept Composer for Compositional Generalization", "paper_summary": "Compositional generalization is crucial for artificial intelligence agents to\nsolve complex vision-language reasoning tasks. Neuro-symbolic approaches have\ndemonstrated promise in capturing compositional structures, but they face\ncritical challenges: (a) reliance on predefined predicates for symbolic\nrepresentations that limit adaptability, (b) difficulty in extracting\npredicates from raw data, and (c) using non-differentiable operations for\ncombining primitive concepts. To address these issues, we propose NeSyCoCo, a\nneuro-symbolic framework that leverages large language models (LLMs) to\ngenerate symbolic representations and map them to differentiable neural\ncomputations. NeSyCoCo introduces three innovations: (a) augmenting natural\nlanguage inputs with dependency structures to enhance the alignment with\nsymbolic representations, (b) employing distributed word representations to\nlink diverse, linguistically motivated logical predicates to neural modules,\nand (c) using the soft composition of normalized predicate scores to align\nsymbolic and differentiable reasoning. Our framework achieves state-of-the-art\nresults on the ReaSCAN and CLEVR-CoGenT compositional generalization benchmarks\nand demonstrates robust performance with novel concepts in the CLEVR-SYN\nbenchmark.", "paper_summary_zh": "組合式泛化對於人工智慧代理人解決複雜的視覺語言推理任務至關重要。神經符號方法已證明在捕捉組合結構方面很有前景，但它們面臨嚴峻的挑戰：(a) 依賴於限制適應性的符號表示的預定義謂詞，(b) 難以從原始資料中提取謂詞，以及 (c) 使用不可微分的運算來組合原始概念。為了解決這些問題，我們提出了 NeSyCoCo，一個神經符號框架，它利用大型語言模型 (LLM) 來產生符號表示並將它們映射到可微分的類神經運算。NeSyCoCo 引入了三項創新：(a) 用依賴結構擴充自然語言輸入，以增強與符號表示的一致性，(b) 使用分散的詞語表示將不同的、受語言激勵的邏輯謂詞連結到神經模組，以及 (c) 使用正規化謂詞分數的軟組合來對齊符號和可微分的推理。我們的框架在 ReaSCAN 和 CLEVR-CoGenT 組合式泛化基準上達到了最先進的結果，並在 CLEVR-SYN 基準中展示了新概念的強大效能。", "author": "Danial Kamali et.al.", "authors": "Danial Kamali, Elham J. Barezi, Parisa Kordjamshidi", "id": "2412.15588v1", "paper_url": "http://arxiv.org/abs/2412.15588v1", "repo": "null"}}