{"2411.13590": {"publish_time": "2024-11-18", "title": "Deep learning waterways for rural infrastructure development", "paper_summary": "Surprisingly a number of Earth's waterways remain unmapped, with a\nsignificant number in low and middle income countries. Here we build a computer\nvision model (WaterNet) to learn the location of waterways in the United\nStates, based on high resolution satellite imagery and digital elevation\nmodels, and then deploy this in novel environments in the African continent.\nOur outputs provide detail of waterways structures hereto unmapped. When\nassessed against community needs requests for rural bridge building related to\naccess to schools, health care facilities and agricultural markets, we find\nthese newly generated waterways capture on average 93% (country range: 88-96%)\nof these requests whereas Open Street Map, and the state of the art data from\nTDX-Hydro, capture only 36% (5-72%) and 62% (37%-85%), respectively. Because\nthese new machine learning enabled maps are built on public and operational\ndata acquisition this approach offers promise for capturing humanitarian needs\nand planning for social development in places where cartographic efforts have\nso far failed to deliver. The improved performance in identifying community\nneeds missed by existing data suggests significant value for rural\ninfrastructure development and better targeting of development interventions.", "paper_summary_zh": "令人驚訝的是，地球上的許多水道仍然未繪製，其中有大量低收入和中等收入國家。在這裡，我們建立了一個電腦視覺模型（WaterNet）來學習美國水道的所在位置，該模型基於高解析度衛星影像和數位高程模型，然後將其部署到非洲大陸的新環境中。我們的輸出提供了迄今未繪製的水道結構的詳細資訊。在根據社區需求評估與學校、醫療保健設施和農業市場的通路相關的農村橋樑建設請求時，我們發現這些新生成的航道平均涵蓋了這些請求的 93%（國家範圍：88-96%），而 Open Street Map 和 TDX-Hydro 中最先進的資料分別只涵蓋了 36%（5-72%）和 62%（37%-85%）。因為這些新的機器學習啟用地圖建立在公開和運作的資料採集中，所以這種方法有望捕捉人道主義需求，並為製圖工作迄今未能提供的地區的社會發展進行規劃。在識別現有資料遺漏的社區需求方面表現的改善，顯示出對農村基礎設施開發和更佳的發展干預目標具有重大價值。", "author": "Matthew Pierson et.al.", "authors": "Matthew Pierson, Zia Mehrabi", "id": "2411.13590v1", "paper_url": "http://arxiv.org/abs/2411.13590v1", "repo": "null"}}