{"2407.08147": {"publish_time": "2024-07-11", "title": "Looks can be Deceptive: Distinguishing Repetition Disfluency from Reduplication", "paper_summary": "Reduplication and repetition, though similar in form, serve distinct\nlinguistic purposes. Reduplication is a deliberate morphological process used\nto express grammatical, semantic, or pragmatic nuances, while repetition is\noften unintentional and indicative of disfluency. This paper presents the first\nlarge-scale study of reduplication and repetition in speech using computational\nlinguistics. We introduce IndicRedRep, a new publicly available dataset\ncontaining Hindi, Telugu, and Marathi text annotated with reduplication and\nrepetition at the word level. We evaluate transformer-based models for\nmulti-class reduplication and repetition token classification, utilizing the\nReparandum-Interregnum-Repair structure to distinguish between the two\nphenomena. Our models achieve macro F1 scores of up to 85.62% in Hindi, 83.95%\nin Telugu, and 84.82% in Marathi for reduplication-repetition classification.", "paper_summary_zh": "重複和重言雖然形式相似，但在語言學上卻有不同的用途。重複是一種故意的形態過程，用於表達語法、語義或語用上的細微差別，而重言通常是不自覺的，且表示言語不流暢。本文提出使用計算語言學進行重複和重言的第一個大規模研究。我們引入了 IndicRedRep，一個新的公開可用的資料集，其中包含標註了印地語、泰盧固語和馬拉地語文字中詞級的重複和重言。我們評估了基於Transformer的多類重複和重言標記分類模型，利用 Reparandum-Interregnum-Repair 結構來區分這兩種現象。我們的模型在印地語中重複-重言分類的宏觀 F1 分數高達 85.62%，泰盧固語為 83.95%，馬拉地語為 84.82%。", "author": "Arif Ahmad et.al.", "authors": "Arif Ahmad, Mothika Gayathri Khyathi, Pushpak Bhattacharyya", "id": "2407.08147v1", "paper_url": "http://arxiv.org/abs/2407.08147v1", "repo": "null"}}