{"2409.06222": {"publish_time": "2024-09-10", "title": "Advancing Topic Segmentation of Broadcasted Speech with Multilingual Semantic Embeddings", "paper_summary": "Recent advancements in speech-based topic segmentation have highlighted the\npotential of pretrained speech encoders to capture semantic representations\ndirectly from speech. Traditionally, topic segmentation has relied on a\npipeline approach in which transcripts of the automatic speech recognition\nsystems are generated, followed by text-based segmentation algorithms. In this\npaper, we introduce an end-to-end scheme that bypasses this conventional\ntwo-step process by directly employing semantic speech encoders for\nsegmentation. Focused on the broadcasted news domain, which poses unique\nchallenges due to the diversity of speakers and topics within single\nrecordings, we address the challenge of accessing topic change points\nefficiently in an end-to-end manner. Furthermore, we propose a new benchmark\nfor spoken news topic segmentation by utilizing a dataset featuring\napproximately 1000 hours of publicly available recordings across six European\nlanguages and including an evaluation set in Hindi to test the model's\ncross-domain performance in a cross-lingual, zero-shot scenario. This setup\nreflects real-world diversity and the need for models adapting to various\nlinguistic settings. Our results demonstrate that while the traditional\npipeline approach achieves a state-of-the-art $P_k$ score of 0.2431 for\nEnglish, our end-to-end model delivers a competitive $P_k$ score of 0.2564.\nWhen trained multilingually, these scores further improve to 0.1988 and 0.2370,\nrespectively. To support further research, we release our model along with data\npreparation scripts, facilitating open research on multilingual spoken news\ntopic segmentation.", "paper_summary_zh": "<paragraph>最近在基於語音的主題區段化方面的新進展突顯了預先訓練的語音編碼器在直接從語音擷取語義表示方面的潛力。傳統上，主題區段化依賴於管線方法，其中會產生自動語音識別系統的轉錄，然後再進行基於文字的區段化演算法。在本文中，我們介紹了一個端到端的架構，它透過直接採用語義語音編碼器進行區段化，來繞過這個傳統的兩步驟流程。專注於廣播新聞領域，由於單一錄音中講者和主題的多樣性，因此構成了獨特的挑戰，我們以端到端的方式解決了有效存取主題變更點的挑戰。此外，我們透過利用一個包含六種歐洲語言約 1000 小時的公開錄音的資料集，並在印地語中加入一個評估集，來測試模型在跨語言、零次學習場景中的跨網域效能，進而提出一個新的基準，用於口說新聞主題區段化。此設定反映了真實世界的多樣性，以及模型適應各種語言設定的需求。我們的結果顯示，雖然傳統的管線方法達到了 0.2431 的最先進 $P_k$ 分數，但我們的端到端模型提供了 0.2564 的競爭性 $P_k$ 分數。當以多語言方式訓練時，這些分數進一步提高到 0.1988 和 0.2370。為了支持進一步的研究，我們發布了我們的模型以及資料準備腳本，促進了多語言口說新聞主題區段化的公開研究。</paragraph>", "author": "Sakshi Deo Shukla et.al.", "authors": "Sakshi Deo Shukla, Pavel Denisov, Tugtekin Turan", "id": "2409.06222v1", "paper_url": "http://arxiv.org/abs/2409.06222v1", "repo": "null"}}