{"2502.12996": {"publish_time": "2025-02-18", "title": "Eager Updates For Overlapped Communication and Computation in DiLoCo", "paper_summary": "Distributed optimization methods such as DiLoCo have been shown to be\neffective in training very large models across multiple distributed workers,\nsuch as datacenters. These methods split updates into two parts: an inner\noptimization phase, where the workers independently execute multiple\noptimization steps on their own local data, and an outer optimization step,\nwhere the inner updates are synchronized. While such approaches require orders\nof magnitude less communication than standard data-parallel training, in\nsettings where the workers are datacenters, even the limited communication\nrequirements of these approaches can still cause significant slow downs due to\nthe blocking necessary at each outer optimization step. In this paper, we\ninvestigate techniques to mitigate this issue by overlapping communication with\ncomputation in a manner that allows the outer optimization step to fully\noverlap with the inner optimization phase. We show that a particular variant,\ndubbed eager updates, provides competitive performance with standard DiLoCo in\nsettings with low bandwidth between workers.", "paper_summary_zh": "分散式優化方法（例如 DiLoCo）已被證明可有效訓練橫跨多個分散式工作者的超大型模型，例如資料中心。這些方法將更新拆分為兩部分：內部最佳化階段，其中工作者獨立地在自己的本地資料上執行多個最佳化步驟，以及外部最佳化步驟，其中內部更新會同步。雖然此類方法所需的通訊量比標準資料平行訓練少幾個數量級，但在工作者為資料中心的情況下，即使這些方法有限的通訊需求仍可能由於每個外部最佳化步驟所需的封鎖而導致顯著的減速。在本文中，我們探討了透過以允許外部最佳化步驟與內部最佳化階段完全重疊的方式將通訊與運算重疊，來減輕此問題的技術。我們展示了一個特定變體，稱為即時更新，在工作者之間頻寬較低的情況下，可提供與標準 DiLoCo 相當的效能。", "author": "Satyen Kale et.al.", "authors": "Satyen Kale, Arthur Douillard, Yanislav Donchev", "id": "2502.12996v1", "paper_url": "http://arxiv.org/abs/2502.12996v1", "repo": "null"}}