{"2406.04025": {"publish_time": "2024-06-06", "title": "The syntax-semantics interface in a child's path: A study of 3- to 11-year-olds' elicited production of Mandarin recursive relative clauses", "paper_summary": "There have been apparently conflicting claims over the syntax-semantics\nrelationship in child acquisition. However, few of them have assessed the\nchild's path toward the acquisition of recursive relative clauses (RRCs). The\nauthors of the current paper did experiments to investigate 3- to 11-year-olds'\nmost-structured elicited production of eight Mandarin RRCs in a 4 (syntactic\ntypes)*2 (semantic conditions) design. The four syntactic types were RRCs with\na subject-gapped RC embedded in an object-gapped RC (SORRCs), RRCs with an\nobject-gapped RC embedded in another object-gapped RC (OORRCs), RRCs with an\nobject-gapped RC embedded in a subject-gapped RC (OSRRCs), and RRCs with a\nsubject-gapped RC embedded in another subject-gapped RC (SSRRCs). Each\nsyntactic type was put in two conditions differing in internal semantics:\nirreversible internal semantics (IIS) and reversible internal semantics (RIS).\nFor example, \"the balloon that [the girl that _ eats the banana] holds _\" is\nSORRCs in the IIS condition; \"the monkey that [the dog that _ bites the pig]\nhits_\" is SORRCs in the RIS condition. For each target, the participants were\nprovided with a speech-visual stimulus constructing a condition of irreversible\nexternal semantics (IES). The results showed that SSRRCs, OSRRCs and SORRCs in\nthe IIS-IES condition were produced two years earlier than their counterparts\nin the RIS-IES condition. Thus, a 2-stage development path is proposed: the\nlanguage acquisition device starts with the interface between (irreversible)\nsyntax and IIS, and ends with the interface between syntax and IES, both\nabiding by the syntax-semantic interface principle.", "paper_summary_zh": "<paragraph>在兒童習得過程中，對於語法語意關係一直存在著明顯的爭議性說法。然而，很少有人評估兒童習得遞歸關係子句 (RRC) 的途徑。本文作者進行了實驗，以調查 3 至 11 歲兒童在 4（語法類型）*2（語義條件）設計中對八個漢語 RRC 最結構化的引發性產生。四種語法類型是 RRC，其中一個主語間隙 RC 嵌入在一個賓語間隙 RC（SORRC）中，RRC，其中一個賓語間隙 RC 嵌入在另一個賓語間隙 RC（OORRC）中，RRC，其中一個賓語間隙 RC 嵌入在一個主語間隙 RC（OSRRC）中，以及 RRC，其中一個主語間隙 RC 嵌入在另一個主語間隙 RC（SSRRC）中。每種類型的語法都被置於兩個在內部語義上不同的條件中：不可逆內部語義（IIS）和可逆內部語義（RIS）。例如，「[那個女孩吃香蕉]拿著的那個氣球」在 IIS 條件下是 SORRC；「[那條狗咬豬]打的那隻猴子」在 RIS 條件下是 SORRC。對於每個目標，參與者都被提供了一個構建不可逆外部語義（IES）條件的語音視覺刺激。結果表明，在 IIS-IES 條件下的 SSRRC、OSRRC 和 SORRC 比在 RIS-IES 條件下的對應條件早兩年產生。因此，提出了 2 階段發展路徑：語言習得裝置從（不可逆）語法和 IIS 之間的介面開始，並以語法和 IES 之間的介面結束，兩者都遵守語法語義介面原則。</paragraph>", "author": "Caimei Yang et.al.", "authors": "Caimei Yang, Qihang Yang, Xingzhi Su, Chenxi Fu, Xiaoyi Wang, Ying Yan, Zaijiang Man", "id": "2406.04025v1", "paper_url": "http://arxiv.org/abs/2406.04025v1", "repo": "null"}}