{"2412.08619": {"publish_time": "2024-12-11", "title": "Synthetic Vision: Training Vision-Language Models to Understand Physics", "paper_summary": "Physical reasoning, which involves the interpretation, understanding, and\nprediction of object behavior in dynamic environments, remains a significant\nchallenge for current Vision-Language Models (VLMs). In this work, we propose\ntwo methods to enhance VLMs' physical reasoning capabilities using simulated\ndata. First, we fine-tune a pre-trained VLM using question-answer (QA) pairs\ngenerated from simulations relevant to physical reasoning tasks. Second, we\nintroduce Physics Context Builders (PCBs), specialized VLMs fine-tuned to\ncreate scene descriptions enriched with physical properties and processes.\nDuring physical reasoning tasks, these PCBs can be leveraged as context to\nassist a Large Language Model (LLM) to improve its performance. We evaluate\nboth of our approaches using multiple benchmarks, including a new stability\ndetection QA dataset called Falling Tower, which includes both simulated and\nreal-world scenes, and CLEVRER. We demonstrate that a small QA fine-tuned VLM\ncan significantly outperform larger state-of-the-art foundational models. We\nalso show that integrating PCBs boosts the performance of foundational LLMs on\nphysical reasoning tasks. Using the real-world scenes from the Falling Tower\ndataset, we also validate the robustness of both approaches in Sim2Real\ntransfer. Our results highlight the utility that simulated data can have in the\ncreation of learning systems capable of advanced physical reasoning.", "paper_summary_zh": "物理推理涉及對動態環境中物體行為的解讀、理解和預測，仍然是當前視覺語言模型 (VLM) 的重大挑戰。在這項工作中，我們提出兩種方法，使用模擬數據增強 VLM 的物理推理能力。首先，我們使用與物理推理任務相關的模擬產生的問答 (QA) 對，微調預先訓練的 VLM。其次，我們引入了物理情境建構器 (PCB)，這是經過微調的專業 VLM，用於建立豐富了物理屬性和過程的情境描述。在物理推理任務期間，這些 PCB 可以作為情境，協助大型語言模型 (LLM) 改善其效能。我們使用多個基準對我們的兩種方法進行評估，包括一個稱為 Falling Tower 的新穩定性偵測 QA 資料集，其中包含模擬和真實世界的場景，以及 CLEVRER。我們證明了一個經過 QA 微調的小型 VLM 可以顯著優於更大的最先進基礎模型。我們還表明，整合 PCB 可以提升基礎 LLM 在物理推理任務上的效能。使用 Falling Tower 資料集中的真實世界場景，我們還驗證了兩種方法在 Sim2Real 轉移中的穩健性。我們的結果突顯了模擬數據在建立具備進階物理推理能力的學習系統中可能具有的效用。", "author": "Vahid Balazadeh et.al.", "authors": "Vahid Balazadeh, Mohammadmehdi Ataei, Hyunmin Cheong, Amir Hosein Khasahmadi, Rahul G. Krishnan", "id": "2412.08619v1", "paper_url": "http://arxiv.org/abs/2412.08619v1", "repo": "null"}}