{"2408.08431": {"publish_time": "2024-08-15", "title": "Multi-Modal Dialogue State Tracking for Playing GuessWhich Game", "paper_summary": "GuessWhich is an engaging visual dialogue game that involves interaction\nbetween a Questioner Bot (QBot) and an Answer Bot (ABot) in the context of\nimage-guessing. In this game, QBot's objective is to locate a concealed image\nsolely through a series of visually related questions posed to ABot. However,\neffectively modeling visually related reasoning in QBot's decision-making\nprocess poses a significant challenge. Current approaches either lack visual\ninformation or rely on a single real image sampled at each round as decoding\ncontext, both of which are inadequate for visual reasoning. To address this\nlimitation, we propose a novel approach that focuses on visually related\nreasoning through the use of a mental model of the undisclosed image. Within\nthis framework, QBot learns to represent mental imagery, enabling robust visual\nreasoning by tracking the dialogue state. The dialogue state comprises a\ncollection of representations of mental imagery, as well as representations of\nthe entities involved in the conversation. At each round, QBot engages in\nvisually related reasoning using the dialogue state to construct an internal\nrepresentation, generate relevant questions, and update both the dialogue state\nand internal representation upon receiving an answer. Our experimental results\non the VisDial datasets (v0.5, 0.9, and 1.0) demonstrate the effectiveness of\nour proposed model, as it achieves new state-of-the-art performance across all\nmetrics and datasets, surpassing previous state-of-the-art models. Codes and\ndatasets from our experiments are freely available at\n\\href{https://github.com/xubuvd/GuessWhich}.", "paper_summary_zh": "GuessWhich 是一款引人入勝的視覺對話遊戲，包含在圖像猜謎情境中，問答機器人 (QBot) 和回答機器人 (ABot) 之間的互動。在這個遊戲中，QBot 的目標是僅透過向 ABot 提出的一系列視覺相關問題，來找出隱藏的圖像。然而，在 QBot 的決策過程中有效地建模視覺相關推理，是一個重大的挑戰。目前的做法不是缺乏視覺資訊，就是依賴在每一輪中取樣的單一真實圖像作為解碼情境，這兩種做法都不足以進行視覺推理。為了解決這個限制，我們提出了一種新穎的方法，專注於透過使用未公開圖像的心智模型，進行視覺相關推理。在這個架構中，QBot 學習表徵心智意象，透過追蹤對話狀態，啟用強健的視覺推理。對話狀態包含心智意象表徵的集合，以及對話中所涉及實體的表徵。在每一輪中，QBot 使用對話狀態進行視覺相關推理，以建構內部表徵、產生相關問題，並在收到答案時更新對話狀態和內部表徵。我們在 VisDial 資料集 (v0.5、0.9 和 1.0) 上的實驗結果證明了我們所提出的模型的有效性，因為它在所有指標和資料集上都達到了新的最先進效能，超越了先前的最先進模型。我們實驗的程式碼和資料集可以在 \\href{https://github.com/xubuvd/GuessWhich} 免費取得。", "author": "Wei Pang et.al.", "authors": "Wei Pang, Ruixue Duan, Jinfu Yang, Ning Li", "id": "2408.08431v1", "paper_url": "http://arxiv.org/abs/2408.08431v1", "repo": "https://github.com/xubuvd/guesswhich"}}