{"2406.10229": {"publish_time": "2024-06-14", "title": "Quantifying Variance in Evaluation Benchmarks", "paper_summary": "Evaluation benchmarks are the cornerstone of measuring capabilities of large\nlanguage models (LLMs), as well as driving progress in said capabilities.\nOriginally designed to make claims about capabilities (or lack thereof) in\nfully pretrained models, evaluation benchmarks are now also extensively used to\ndecide between various training choices. Despite this widespread usage, we\nrarely quantify the variance in our evaluation benchmarks, which dictates\nwhether differences in performance are meaningful. Here, we define and measure\na range of metrics geared towards measuring variance in evaluation benchmarks,\nincluding seed variance across initialisations, and monotonicity during\ntraining. By studying a large number of models -- both openly available and\npretrained from scratch -- we provide empirical estimates for a variety of\nvariance metrics, with considerations and recommendations for practitioners. We\nalso evaluate the utility and tradeoffs of continuous versus discrete\nperformance measures and explore options for better understanding and reducing\nthis variance. We find that simple changes, such as framing choice tasks (like\nMMLU) as completion tasks, can often reduce variance for smaller scale\n($\\sim$7B) models, while more involved methods inspired from human testing\nliterature (such as item analysis and item response theory) struggle to\nmeaningfully reduce variance. Overall, our work provides insights into variance\nin evaluation benchmarks, suggests LM-specific techniques to reduce variance,\nand more generally encourages practitioners to carefully factor in variance\nwhen comparing models.", "paper_summary_zh": "評估基準是衡量大型語言模型 (LLM) 能力的基石，同時也能促進此類能力的進步。評估基準最初設計用於提出關於完全預訓練模型的能力（或缺乏能力）的說法，現在也廣泛用於在各種訓練選項之間做出決定。儘管如此廣泛的使用，我們很少量化評估基準中的差異，這決定了效能差異是否有意義。在這裡，我們定義和衡量一系列指標，這些指標旨在衡量評估基準中的差異，包括初始化時的種子差異和訓練期間的單調性。透過研究大量模型（包括公開可用的模型和從頭開始預訓練的模型），我們針對各種差異指標提供經驗估計，並提供給實務工作者的考量和建議。我們也評估連續與離散效能測量的方法及其權衡取捨，並探討更了解和減少此差異的選項。我們發現，一些簡單的變更，例如將選擇任務（例如 MMLU）設定為完成任務，通常可以減少較小規模（$\\sim$7B）模型的差異，而受到人類測試文獻啟發的更複雜方法（例如項目分析和項目反應理論）則難以有效減少差異。總體而言，我們的研究提供了對評估基準中差異的見解，提出了減少差異的特定於 LM 的技術，並更普遍地鼓勵實務工作者在比較模型時仔細考量差異。", "author": "Lovish Madaan et.al.", "authors": "Lovish Madaan, Aaditya K. Singh, Rylan Schaeffer, Andrew Poulton, Sanmi Koyejo, Pontus Stenetorp, Sharan Narang, Dieuwke Hupkes", "id": "2406.10229v1", "paper_url": "http://arxiv.org/abs/2406.10229v1", "repo": "null"}}