{"2408.01349": {"publish_time": "2024-08-02", "title": "PC$^2$: Pseudo-Classification Based Pseudo-Captioning for Noisy Correspondence Learning in Cross-Modal Retrieval", "paper_summary": "In the realm of cross-modal retrieval, seamlessly integrating diverse\nmodalities within multimedia remains a formidable challenge, especially given\nthe complexities introduced by noisy correspondence learning (NCL). Such noise\noften stems from mismatched data pairs, which is a significant obstacle\ndistinct from traditional noisy labels. This paper introduces\nPseudo-Classification based Pseudo-Captioning (PC$^2$) framework to address\nthis challenge. PC$^2$ offers a threefold strategy: firstly, it establishes an\nauxiliary \"pseudo-classification\" task that interprets captions as categorical\nlabels, steering the model to learn image-text semantic similarity through a\nnon-contrastive mechanism. Secondly, unlike prevailing margin-based techniques,\ncapitalizing on PC$^2$'s pseudo-classification capability, we generate\npseudo-captions to provide more informative and tangible supervision for each\nmismatched pair. Thirdly, the oscillation of pseudo-classification is borrowed\nto assistant the correction of correspondence. In addition to technical\ncontributions, we develop a realistic NCL dataset called Noise of Web (NoW),\nwhich could be a new powerful NCL benchmark where noise exists naturally.\nEmpirical evaluations of PC$^2$ showcase marked improvements over existing\nstate-of-the-art robust cross-modal retrieval techniques on both simulated and\nrealistic datasets with various NCL settings. The contributed dataset and\nsource code are released at https://github.com/alipay/PC2-NoiseofWeb.", "paper_summary_zh": "在跨模態檢索領域中，在多媒體中無縫整合不同的模態仍然是一項艱鉅的挑戰，特別是考慮到噪聲對應學習 (NCL) 所帶來的複雜性。這種噪聲通常源自不匹配的資料對，這是與傳統的噪聲標籤截然不同的重大障礙。本文介紹了基於偽分類的偽標題 (PC$^2$) 框架來解決這個挑戰。PC$^2$ 提供了一個三管齊下的策略：首先，它建立一個輔助的「偽分類」任務，將標題解釋為分類標籤，引導模型通過非對比機制學習圖像文字語義相似性。其次，與流行的基於邊緣的技術不同，利用 PC$^2$ 的偽分類能力，我們生成偽標題，為每個不匹配的對提供更具資訊性和具體的監督。第三，借用偽分類的振盪來協助對應的校正。除了技術貢獻之外，我們還開發了一個名為 Web 噪聲 (NoW) 的現實 NCL 資料集，這可能是一個新的強大 NCL 基準，其中噪聲自然存在。PC$^2$ 的經驗評估展示了在模擬和現實資料集上，在各種 NCL 設定下，對現有最先進的強健跨模態檢索技術的顯著改進。貢獻的資料集和原始碼發布於 https://github.com/alipay/PC2-NoiseofWeb。", "author": "Yue Duan et.al.", "authors": "Yue Duan, Zhangxuan Gu, Zhenzhe Ying, Lei Qi, Changhua Meng, Yinghuan Shi", "id": "2408.01349v1", "paper_url": "http://arxiv.org/abs/2408.01349v1", "repo": "null"}}