{"2501.08149": {"publish_time": "2025-01-14", "title": "Multiple-Input Variational Auto-Encoder for Anomaly Detection in Heterogeneous Data", "paper_summary": "Anomaly detection (AD) plays a pivotal role in AI applications, e.g., in\nclassification, and intrusion/threat detection in cybersecurity. However, most\nexisting methods face challenges of heterogeneity amongst feature subsets posed\nby non-independent and identically distributed (non-IID) data. We propose a\nnovel neural network model called Multiple-Input Auto-Encoder for AD (MIAEAD)\nto address this. MIAEAD assigns an anomaly score to each feature subset of a\ndata sample to indicate its likelihood of being an anomaly. This is done by\nusing the reconstruction error of its sub-encoder as the anomaly score. All\nsub-encoders are then simultaneously trained using unsupervised learning to\ndetermine the anomaly scores of feature subsets. The final AUC of MIAEAD is\ncalculated for each sub-dataset, and the maximum AUC obtained among the\nsub-datasets is selected. To leverage the modelling of the distribution of\nnormal data to identify anomalies of the generative models, we develop a novel\nneural network architecture/model called Multiple-Input Variational\nAuto-Encoder (MIVAE). MIVAE can process feature subsets through its\nsub-encoders before learning distribution of normal data in the latent space.\nThis allows MIVAE to identify anomalies that deviate from the learned\ndistribution. We theoretically prove that the difference in the average anomaly\nscore between normal samples and anomalies obtained by the proposed MIVAE is\ngreater than that of the Variational Auto-Encoder (VAEAD), resulting in a\nhigher AUC for MIVAE. Extensive experiments on eight real-world anomaly\ndatasets demonstrate the superior performance of MIAEAD and MIVAE over\nconventional methods and the state-of-the-art unsupervised models, by up to 6%\nin terms of AUC score. Alternatively, MIAEAD and MIVAE have a high AUC when\napplied to feature subsets with low heterogeneity based on the coefficient of\nvariation (CV) score.", "paper_summary_zh": "異常偵測 (AD) 在 AI 應用中扮演著關鍵角色，例如在分類、以及網路安全中的入侵/威脅偵測。然而，現有的方法大多面臨由非獨立同分佈 (non-IID) 資料所造成的特徵子集間的異質性挑戰。我們提出一個名為多輸入自動編碼器異常偵測 (MIAEAD) 的新穎神經網路模型來解決這個問題。MIAEAD 會為資料樣本的每個特徵子集分配一個異常分數，以表示其成為異常值的可能性。這是透過使用其子編碼器的重建誤差作為異常分數來完成的。然後所有子編碼器會同時使用非監督式學習進行訓練，以確定特徵子集的異常分數。MIAEAD 的最終 AUC 會針對每個子資料集計算，並選取在子資料集中獲得的最大 AUC。為了利用生成模型的常態資料分佈建模來識別異常值，我們開發了一個名為多輸入變異自動編碼器 (MIVAE) 的新穎神經網路架構/模型。MIVAE 可以透過其子編碼器處理特徵子集，然後在潛在空間中學習常態資料的分佈。這允許 MIVAE 識別出與所學習分佈不同的異常值。我們在理論上證明，MIVAE 所獲得的常態樣本與異常值之間的平均異常分數差異大於變異自動編碼器 (VAEAD)，導致 MIVAE 具有更高的 AUC。在八個真實世界的異常資料集上進行的廣泛實驗證明了 MIAEAD 和 MIVAE 優於傳統方法和最先進的非監督式模型，AUC 分數提高了 6%。或者，MIAEAD 和 MIVAE 在應用於根據變異係數 (CV) 分數具有低異質性的特徵子集時，具有很高的 AUC。", "author": "Phai Vu Dinh et.al.", "authors": "Phai Vu Dinh, Diep N. Nguyen, Dinh Thai Hoang, Quang Uy Nguyen, Eryk Dutkiewicz", "id": "2501.08149v1", "paper_url": "http://arxiv.org/abs/2501.08149v1", "repo": "null"}}