{"2502.14834": {"publish_time": "2025-02-20", "title": "LongWriter-V: Enabling Ultra-Long and High-Fidelity Generation in Vision-Language Models", "paper_summary": "Existing Large Vision-Language Models (LVLMs) can process inputs with context\nlengths up to 128k visual and text tokens, yet they struggle to generate\ncoherent outputs beyond 1,000 words. We find that the primary limitation is the\nabsence of long output examples during supervised fine-tuning (SFT). To tackle\nthis issue, we introduce LongWriter-V-22k, a SFT dataset comprising 22,158\nexamples, each with multiple input images, an instruction, and corresponding\noutputs ranging from 0 to 10,000 words. Moreover, to achieve long outputs that\nmaintain high-fidelity to the input images, we employ Direct Preference\nOptimization (DPO) to the SFT model. Given the high cost of collecting human\nfeedback for lengthy outputs (e.g., 3,000 words), we propose IterDPO, which\nbreaks long outputs into segments and uses iterative corrections to form\npreference pairs with the original outputs. Additionally, we develop\nMMLongBench-Write, a benchmark featuring six tasks to evaluate the\nlong-generation capabilities of VLMs. Our 7B parameter model, trained with\nLongWriter-V-22k and IterDPO, achieves impressive performance on this\nbenchmark, outperforming larger proprietary models like GPT-4o. Code and data:\nhttps://github.com/THU-KEG/LongWriter-V", "paper_summary_zh": "現有的大型視覺語言模型 (LVLMs) 能處理長度達 128k 視覺和文字符號的輸入內容，但卻難以產生超過 1,000 字的連貫輸出。我們發現，主要限制在於監督微調 (SFT) 期間缺少長輸出範例。為了解決此問題，我們引入了 LongWriter-V-22k，這是一個 SFT 資料集，包含 22,158 個範例，每個範例都有多個輸入影像、一個說明和對應的輸出，範圍從 0 到 10,000 字。此外，為了產生與輸入影像高度保真的長輸出，我們對 SFT 模型採用直接偏好最佳化 (DPO)。考量到收集人類回饋的成本很高（例如 3,000 字），我們提出 IterDPO，它會將長輸出區分成幾個區塊，並使用反覆修正來形成與原始輸出的偏好配對。此外，我們開發了 MMLongBench-Write，這是一個基準，包含六項任務，用於評估 VLM 的長生成能力。我們的 7B 參數模型使用 LongWriter-V-22k 和 IterDPO 進行訓練，在這個基準上取得令人印象深刻的效能，超越了 GPT-4o 等大型專有模型。程式碼和資料：https://github.com/THU-KEG/LongWriter-V", "author": "Shangqing Tu et.al.", "authors": "Shangqing Tu, Yucheng Wang, Daniel Zhang-Li, Yushi Bai, Jifan Yu, Yuhao Wu, Lei Hou, Huiqin Liu, Zhiyuan Liu, Bin Xu, Juanzi Li", "id": "2502.14834v1", "paper_url": "http://arxiv.org/abs/2502.14834v1", "repo": "null"}}