{"2405.03387": {"publish_time": "2024-05-06", "title": "The high dimensional psychological profile and cultural bias of ChatGPT", "paper_summary": "Given the rapid advancement of large-scale language models, artificial\nintelligence (AI) models, like ChatGPT, are playing an increasingly prominent\nrole in human society. However, to ensure that artificial intelligence models\nbenefit human society, we must first fully understand the similarities and\ndifferences between the human-like characteristics exhibited by artificial\nintelligence models and real humans, as well as the cultural stereotypes and\nbiases that artificial intelligence models may exhibit in the process of\ninteracting with humans. This study first measured ChatGPT in 84 dimensions of\npsychological characteristics, revealing differences between ChatGPT and human\nnorms in most dimensions as well as in high-dimensional psychological\nrepresentations. Additionally, through the measurement of ChatGPT in 13\ndimensions of cultural values, it was revealed that ChatGPT's cultural value\npatterns are dissimilar to those of various countries/regions worldwide.\nFinally, an analysis of ChatGPT's performance in eight decision-making tasks\ninvolving interactions with humans from different countries/regions revealed\nthat ChatGPT exhibits clear cultural stereotypes in most decision-making tasks\nand shows significant cultural bias in third-party punishment and ultimatum\ngames. The findings indicate that, compared to humans, ChatGPT exhibits a\ndistinct psychological profile and cultural value orientation, and it also\nshows cultural biases and stereotypes in interpersonal decision-making. Future\nresearch endeavors should emphasize enhanced technical oversight and augmented\ntransparency in the database and algorithmic training procedures to foster more\nefficient cross-cultural communication and mitigate social disparities.", "paper_summary_zh": "", "author": "Hang Yuan et.al.", "authors": "Hang Yuan,Zhongyue Che,Shao Li,Yue Zhang,Xiaomeng Hu,Siyang Luo", "id": "2405.03387v1", "paper_url": "http://arxiv.org/abs/2405.03387v1", "repo": "null"}}