{"2408.11296": {"publish_time": "2024-08-21", "title": "RePair: Automated Program Repair with Process-based Feedback", "paper_summary": "The gap between the trepidation of program reliability and the expense of\nrepairs underscores the indispensability of Automated Program Repair (APR). APR\nis instrumental in transforming vulnerable programs into more robust ones,\nbolstering program reliability while simultaneously diminishing the financial\nburden of manual repairs. Commercial-scale language models (LM) have taken APR\nto unprecedented levels. However, the emergence reveals that for models fewer\nthan 100B parameters, making single-step modifications may be difficult to\nachieve the desired effect. Moreover, humans interact with the LM through\nexplicit prompts, which hinders the LM from receiving feedback from compiler\nand test cases to automatically optimize its repair policies. In this\nliterature, we explore how small-scale LM (less than 20B) achieve excellent\nperformance through process supervision and feedback. We start by constructing\na dataset named CodeNet4Repair, replete with multiple repair records, which\nsupervises the fine-tuning of a foundational model. Building upon the\nencouraging outcomes of reinforcement learning, we develop a reward model that\nserves as a critic, providing feedback for the fine-tuned LM's action,\nprogressively optimizing its policy. During inference, we require the LM to\ngenerate solutions iteratively until the repair effect no longer improves or\nhits the maximum step limit. The results show that process-based not only\noutperforms larger outcome-based generation methods, but also nearly matches\nthe performance of closed-source commercial large-scale LMs.", "paper_summary_zh": "程式可靠性令人膽戰心驚，而維修費用高昂，這兩者之間的差距突顯了自動化程式修復 (APR) 的不可或缺性。APR 幫助將容易受攻擊的程式轉變為更強大的程式，同時提高程式可靠性，並降低人工維修的財務負擔。商用規模的語言模型 (LM) 已將 APR 提升到前所未有的水準。然而，新興技術顯示，對於參數少於 100B 的模型，進行單步修改可能難以達到預期的效果。此外，人類透過明確的提示與 LM 互動，這會阻礙 LM 從編譯器和測試案例中接收回饋，以自動最佳化其修復政策。在本篇文獻中，我們探討小規模 LM（小於 20B）如何透過流程監督和回饋來達成卓越的效能。我們從建立一個名為 CodeNet4Repair 的資料集開始，其中包含多筆修復記錄，用於監督基礎模型的微調。建立在強化學習的令人振奮的成果之上，我們開發了一個回饋模型，作為一個評論家，提供微調後的 LM 動作的回饋，逐步最佳化其政策。在推論期間，我們要求 LM 迭代產生解決方案，直到修復效果不再改善或達到最大步驟限制。結果顯示，基於流程的方法不僅優於較大型的基於結果的產生方法，而且幾乎與閉源商用大型 LM 的效能相匹配。", "author": "Yuze Zhao et.al.", "authors": "Yuze Zhao, Zhenya Huang, Yixiao Ma, Rui Li, Kai Zhang, Hao Jiang, Qi Liu, Linbo Zhu, Yu Su", "id": "2408.11296v1", "paper_url": "http://arxiv.org/abs/2408.11296v1", "repo": "https://github.com/tntwow/repair"}}