{"2408.14698": {"publish_time": "2024-08-26", "title": "Smart Multi-Modal Search: Contextual Sparse and Dense Embedding Integration in Adobe Express", "paper_summary": "As user content and queries become increasingly multi-modal, the need for\neffective multi-modal search systems has grown. Traditional search systems\noften rely on textual and metadata annotations for indexed images, while\nmulti-modal embeddings like CLIP enable direct search using text and image\nembeddings. However, embedding-based approaches face challenges in integrating\ncontextual features such as user locale and recency. Building a scalable\nmulti-modal search system requires fine-tuning several components. This paper\npresents a multi-modal search architecture and a series of AB tests that\noptimize embeddings and multi-modal technologies in Adobe Express template\nsearch. We address considerations such as embedding model selection, the roles\nof embeddings in matching and ranking, and the balance between dense and sparse\nembeddings. Our iterative approach demonstrates how utilizing sparse, dense,\nand contextual features enhances short and long query search, significantly\nreduces null rates (over 70\\%), and increases click-through rates (CTR). Our\nfindings provide insights into developing robust multi-modal search systems,\nthereby enhancing relevance for complex queries.", "paper_summary_zh": "隨著使用者內容和查詢變得越來越多元，對有效的多元搜尋系統的需求也隨之增加。傳統的搜尋系統經常依賴索引圖像的文字和元資料註解，而像 CLIP 這樣的多元嵌入則能使用文字和圖像嵌入進行直接搜尋。然而，基於嵌入的方法在整合上下文特徵（例如使用者的語言環境和最近性）時會面臨挑戰。建構可擴充的多元搜尋系統需要微調多個元件。本文提出一個多元搜尋架構和一系列的 AB 測試，在 Adobe Express 範本搜尋中最佳化嵌入和多元技術。我們探討了考量因素，例如嵌入模型選擇、嵌入在配對和排名中的角色，以及稠密和稀疏嵌入之間的平衡。我們的迭代方法示範了如何利用稀疏、稠密和上下文特徵來增強短查詢和長查詢搜尋，大幅降低空值率（超過 70%），並提高點擊率 (CTR)。我們的研究結果提供了開發強健多元搜尋系統的見解，進而提升複雜查詢的相關性。", "author": "Cherag Aroraa et.al.", "authors": "Cherag Aroraa, Tracy Holloway King, Jayant Kumar, Yi Lu, Sanat Sharma, Arvind Srikantan, David Uvalle, Josep Valls-Vargas, Harsha Vardhan", "id": "2408.14698v1", "paper_url": "http://arxiv.org/abs/2408.14698v1", "repo": "null"}}