{"2501.08057": {"publish_time": "2025-01-14", "title": "Optimizing Speech Multi-View Feature Fusion through Conditional Computation", "paper_summary": "Recent advancements have highlighted the efficacy of self-supervised learning\n(SSL) features in various speech-related tasks, providing lightweight and\nversatile multi-view speech representations. However, our study reveals that\nwhile SSL features expedite model convergence, they conflict with traditional\nspectral features like FBanks in terms of update directions. In response, we\npropose a novel generalized feature fusion framework grounded in conditional\ncomputation, featuring a gradient-sensitive gating network and a multi-stage\ndropout strategy. This framework mitigates feature conflicts and bolsters model\nrobustness to multi-view input features. By integrating SSL and spectral\nfeatures, our approach accelerates convergence and maintains performance on par\nwith spectral models across multiple speech translation tasks on the MUSTC\ndataset.", "paper_summary_zh": "最近的進展強調了自監督學習 (SSL) 特徵在各種語音相關任務中的效能，提供了輕量且多面向的語音表徵。然而，我們的研究顯示，儘管 SSL 特徵加速了模型收斂，但它們在更新方向上與 FBanks 等傳統頻譜特徵產生衝突。為了解決這個問題，我們提出了一個新的廣義特徵融合架構，其基礎在於條件運算，並採用了梯度敏感閘控網路和多階段中斷策略。這個架構減輕了特徵衝突，並增強了模型對多面向輸入特徵的穩健性。透過整合 SSL 和頻譜特徵，我們的做法加速了收斂，並在 MUSTC 資料集上的多項語音翻譯任務中，維持與頻譜模型同等的效能。", "author": "Weiqiao Shan et.al.", "authors": "Weiqiao Shan, Yuhao Zhang, Yuchen Han, Bei Li, Xiaofeng Zhao, Yuang Li, Min Zhang, Hao Yang, Tong Xiao, Jingbo Zhu", "id": "2501.08057v1", "paper_url": "http://arxiv.org/abs/2501.08057v1", "repo": "null"}}