{"2412.14835": {"publish_time": "2024-12-19", "title": "Progressive Multimodal Reasoning via Active Retrieval", "paper_summary": "Multi-step multimodal reasoning tasks pose significant challenges for\nmultimodal large language models (MLLMs), and finding effective ways to enhance\ntheir performance in such scenarios remains an unresolved issue. In this paper,\nwe propose AR-MCTS, a universal framework designed to progressively improve the\nreasoning capabilities of MLLMs through Active Retrieval (AR) and Monte Carlo\nTree Search (MCTS). Our approach begins with the development of a unified\nretrieval module that retrieves key supporting insights for solving complex\nreasoning problems from a hybrid-modal retrieval corpus. To bridge the gap in\nautomated multimodal reasoning verification, we employ the MCTS algorithm\ncombined with an active retrieval mechanism, which enables the automatic\ngeneration of step-wise annotations. This strategy dynamically retrieves key\ninsights for each reasoning step, moving beyond traditional beam search\nsampling to improve the diversity and reliability of the reasoning space.\nAdditionally, we introduce a process reward model that aligns progressively to\nsupport the automatic verification of multimodal reasoning tasks. Experimental\nresults across three complex multimodal reasoning benchmarks confirm the\neffectiveness of the AR-MCTS framework in enhancing the performance of various\nmultimodal models. Further analysis demonstrates that AR-MCTS can optimize\nsampling diversity and accuracy, yielding reliable multimodal reasoning.", "paper_summary_zh": "多步驟多模態推理任務對多模態大型語言模型 (MLLM) 構成重大挑戰，而尋找有效方法來提升它們在這種情況下的效能仍然是一個未解決的問題。在本文中，我們提出 AR-MCTS，一個通用框架，旨在透過主動檢索 (AR) 和蒙地卡羅樹狀搜尋 (MCTS) 逐步提升 MLLM 的推理能力。我們的做法從開發一個統一的檢索模組開始，該模組從混合模式檢索語料庫中檢索解決複雜推理問題的主要支持見解。為了彌合自動化多模態推理驗證的差距，我們採用 MCTS 演算法結合主動檢索機制，這使得能夠自動產生逐步註解。此策略動態檢索每個推理步驟的主要見解，超越傳統的波束搜尋取樣，以提升推理空間的多樣性和可靠性。此外，我們引入一個過程回饋模型，逐步調整以支援多模態推理任務的自動驗證。在三個複雜的多模態推理基準上的實驗結果證實了 AR-MCTS 框架在提升各種多模態模型效能方面的有效性。進一步的分析證明 AR-MCTS 能夠最佳化取樣多樣性和準確度，產生可靠的多模態推理。", "author": "Guanting Dong et.al.", "authors": "Guanting Dong, Chenghao Zhang, Mengjie Deng, Yutao Zhu, Zhicheng Dou, Ji-Rong Wen", "id": "2412.14835v1", "paper_url": "http://arxiv.org/abs/2412.14835v1", "repo": "null"}}