{"2411.05199": {"publish_time": "2024-11-07", "title": "CodeLutra: Boosting LLM Code Generation via Preference-Guided Refinement", "paper_summary": "Large Language Models (LLMs) have significantly advanced code generation but\noften require substantial resources and tend to over-generalize, limiting their\nefficiency for specific tasks. Fine-tuning smaller, open-source LLMs presents a\nviable alternative; however, it typically lags behind cutting-edge models due\nto supervised fine-tuning's reliance solely on correct code examples, which\nrestricts the model's ability to learn from its own mistakes and adapt to\ndiverse programming challenges. To bridge this gap, we introduce CodeLutra, a\nnovel framework that enhances low-performing LLMs by leveraging both successful\nand failed code generation attempts. Unlike conventional fine-tuning, CodeLutra\nemploys an iterative preference learning mechanism to compare correct and\nincorrect solutions as well as maximize the likelihood of correct codes.\nThrough continuous iterative refinement, CodeLutra enables smaller LLMs to\nmatch or surpass GPT-4's performance in various code generation tasks without\nrelying on vast external datasets or larger auxiliary models. On a challenging\ndata analysis task, using just 500 samples improved Llama-3-8B's accuracy from\n28.2% to 48.6%, approaching GPT-4's performance. These results highlight\nCodeLutra's potential to close the gap between open-source and closed-source\nmodels, making it a promising approach in the field of code generation.", "paper_summary_zh": "大型語言模型 (LLM) 已顯著提升程式碼產生，但通常需要大量資源，且傾向過度概化，限制其在特定任務中的效率。微調較小、開放原始碼的 LLM 提供了一個可行的替代方案；然而，由於監督微調僅依賴於正確的程式碼範例，因此通常落後於尖端模型，這限制了模型從其自身錯誤中學習和適應各種程式設計挑戰的能力。為了彌合這一差距，我們引入了 CodeLutra，這是一個通過利用成功和失敗的程式碼生成嘗試來增強效能不佳的 LLM 的新框架。與傳統微調不同，CodeLutra 採用反覆偏好學習機制來比較正確和不正確的解決方案，並最大化正確程式碼的可能性。透過持續的反覆改進，CodeLutra 能讓較小的 LLM 在各種程式碼生成任務中達到或超越 GPT-4 的效能，而無需依賴於龐大的外部資料集或較大的輔助模型。在一個具有挑戰性的資料分析任務中，僅使用 500 個範例就將 Llama-3-8B 的準確度從 28.2% 提升到 48.6%，接近 GPT-4 的效能。這些結果突顯了 CodeLutra 在縮小開放原始碼和閉源模型之間差距的潛力，使其成為程式碼生成領域中一個有前途的方法。", "author": "Leitian Tao et.al.", "authors": "Leitian Tao, Xiang Chen, Tong Yu, Tung Mai, Ryan Rossi, Yixuan Li, Saayan Mitra", "id": "2411.05199v1", "paper_url": "http://arxiv.org/abs/2411.05199v1", "repo": "null"}}