{"2501.08187": {"publish_time": "2025-01-14", "title": "A Multi-Modal AI Copilot for Single-Cell Analysis with Instruction Following", "paper_summary": "Large language models excel at interpreting complex natural language\ninstructions, enabling them to perform a wide range of tasks. In the life\nsciences, single-cell RNA sequencing (scRNA-seq) data serves as the \"language\nof cellular biology\", capturing intricate gene expression patterns at the\nsingle-cell level. However, interacting with this \"language\" through\nconventional tools is often inefficient and unintuitive, posing challenges for\nresearchers. To address these limitations, we present InstructCell, a\nmulti-modal AI copilot that leverages natural language as a medium for more\ndirect and flexible single-cell analysis. We construct a comprehensive\nmulti-modal instruction dataset that pairs text-based instructions with\nscRNA-seq profiles from diverse tissues and species. Building on this, we\ndevelop a multi-modal cell language architecture capable of simultaneously\ninterpreting and processing both modalities. InstructCell empowers researchers\nto accomplish critical tasks-such as cell type annotation, conditional\npseudo-cell generation, and drug sensitivity prediction-using straightforward\nnatural language commands. Extensive evaluations demonstrate that InstructCell\nconsistently meets or exceeds the performance of existing single-cell\nfoundation models, while adapting to diverse experimental conditions. More\nimportantly, InstructCell provides an accessible and intuitive tool for\nexploring complex single-cell data, lowering technical barriers and enabling\ndeeper biological insights.", "paper_summary_zh": "大型語言模型擅長解讀複雜的自然語言指令，讓它們能夠執行廣泛的任務。在生命科學中，單細胞 RNA 定序 (scRNA-seq) 資料作為「細胞生物學的語言」，捕捉單細胞層級複雜的基因表現模式。然而，透過傳統工具與這「語言」互動通常沒有效率且不直觀，對研究人員來說構成挑戰。為了解決這些限制，我們提出 InstructCell，一種多模態 AI 副駕駛，利用自然語言作為媒介進行更直接且彈性的單細胞分析。我們建構一個全面的多模態指令資料集，將文字指令與來自不同組織和物種的 scRNA-seq 特徵檔配對。在此基礎上，我們開發出一個多模態細胞語言架構，能夠同時解讀和處理這兩種模態。InstructCell 賦能研究人員使用直接的自然語言指令完成關鍵任務，例如細胞類型註解、條件偽細胞產生和藥物敏感性預測。廣泛的評估顯示，InstructCell 持續達到或超越現有單細胞基礎模型的效能，同時適應不同的實驗條件。更重要的是，InstructCell 提供一個易於使用且直觀的工具來探索複雜的單細胞資料，降低技術障礙並獲得更深入的生物見解。", "author": "Yin Fang et.al.", "authors": "Yin Fang, Xinle Deng, Kangwei Liu, Ningyu Zhang, Jingyang Qian, Penghui Yang, Xiaohui Fan, Huajun Chen", "id": "2501.08187v1", "paper_url": "http://arxiv.org/abs/2501.08187v1", "repo": "null"}}