{"2408.09651": {"publish_time": "2024-08-19", "title": "Data-driven Conditional Instrumental Variables for Debiasing Recommender Systems", "paper_summary": "In recommender systems, latent variables can cause user-item interaction data\nto deviate from true user preferences. This biased data is then used to train\nrecommendation models, further amplifying the bias and ultimately compromising\nboth recommendation accuracy and user satisfaction. Instrumental Variable (IV)\nmethods are effective tools for addressing the confounding bias introduced by\nlatent variables; however, identifying a valid IV is often challenging. To\novercome this issue, we propose a novel data-driven conditional IV (CIV)\ndebiasing method for recommender systems, called CIV4Rec. CIV4Rec automatically\ngenerates valid CIVs and their corresponding conditioning sets directly from\ninteraction data, significantly reducing the complexity of IV selection while\neffectively mitigating the confounding bias caused by latent variables in\nrecommender systems. Specifically, CIV4Rec leverages a variational autoencoder\n(VAE) to generate the representations of the CIV and its conditional set from\ninteraction data, followed by the application of least squares to derive causal\nrepresentations for click prediction. Extensive experiments on two real-world\ndatasets, Movielens-10M and Douban-Movie, demonstrate that our CIV4Rec\nsuccessfully identifies valid CIVs, effectively reduces bias, and consequently\nimproves recommendation accuracy.", "paper_summary_zh": "在推薦系統中，潛在變數會導致使用者與項目互動的資料偏離真正的使用者偏好。此有偏差的資料接著用於訓練推薦模型，進一步擴大偏差，並最終損害推薦準確度和使用者滿意度。工具變數 (IV) 方法是解決潛在變數引入的混淆偏差的有效工具；然而，找出有效的 IV 通常具有挑戰性。為了克服此問題，我們提出了一種新穎的資料驅動條件 IV (CIV) 去偏方法，用於推薦系統，稱為 CIV4Rec。CIV4Rec 自動從互動資料產生有效的 CIV 及其對應的條件集合，大幅降低 IV 選擇的複雜性，同時有效減輕推薦系統中潛在變數造成的混淆偏差。具體來說，CIV4Rec 採用變異自動編碼器 (VAE) 從互動資料產生 CIV 及其條件集合的表示，接著應用最小平方法導出用於點擊預測的因果表示。在兩個真實世界資料集 Movielens-10M 和 Douban-Movie 上進行的廣泛實驗證明，我們的 CIV4Rec 成功找出有效的 CIV，有效降低偏差，並因此提高推薦準確度。", "author": "Zhirong Huang et.al.", "authors": "Zhirong Huang, Shichao Zhang, Debo Cheng, Jiuyong Li, Lin Liu, Guangquan Lu", "id": "2408.09651v1", "paper_url": "http://arxiv.org/abs/2408.09651v1", "repo": "null"}}