{"2405.19320": {"publish_time": "2024-05-29", "title": "Value-Incentivized Preference Optimization: A Unified Approach to Online and Offline RLHF", "paper_summary": "Reinforcement learning from human feedback (RLHF) has demonstrated great\npromise in aligning large language models (LLMs) with human preference.\nDepending on the availability of preference data, both online and offline RLHF\nare active areas of investigation. A key bottleneck is understanding how to\nincorporate uncertainty estimation in the reward function learned from the\npreference data for RLHF, regardless of how the preference data is collected.\nWhile the principles of optimism or pessimism under uncertainty are\nwell-established in standard reinforcement learning (RL), a\npractically-implementable and theoretically-grounded form amenable to large\nlanguage models is not yet available, as standard techniques for constructing\nconfidence intervals become intractable under arbitrary policy\nparameterizations.\n  In this paper, we introduce a unified approach to online and offline RLHF --\nvalue-incentivized preference optimization (VPO) -- which regularizes the\nmaximum-likelihood estimate of the reward function with the corresponding value\nfunction, modulated by a $\\textit{sign}$ to indicate whether the optimism or\npessimism is chosen. VPO also directly optimizes the policy with implicit\nreward modeling, and therefore shares a simpler RLHF pipeline similar to direct\npreference optimization. Theoretical guarantees of VPO are provided for both\nonline and offline settings, matching the rates of their standard RL\ncounterparts. Moreover, experiments on text summarization and dialog verify the\npracticality and effectiveness of VPO.", "paper_summary_zh": "人類回饋強化學習 (RLHF) 已展現出極佳的潛力，能使大型語言模型 (LLM) 與人類偏好保持一致。取決於偏好資料的取得，線上和離線 RLHF 都是積極的研究領域。一個關鍵瓶頸在於了解如何將不確定性估計納入 RLHF 偏好資料所學習的獎勵函數中，而不管偏好資料是如何收集的。雖然樂觀或悲觀原則在標準強化學習 (RL) 中的不確定性下已廣為確立，但一種實用且有理論基礎且適用於大型語言模型的形式尚未出現，因為用於建構信心區間的標準技術在任意策略參數化下會變得難以處理。在本文中，我們介紹了線上和離線 RLHF 的統一方法，即價值激勵偏好最佳化 (VPO)，它使用對應的價值函數正規化獎勵函數的最大似然估計，並透過一個符號來調節，以表示選擇樂觀或悲觀。VPO 也直接最佳化具有內隱獎勵建模的策略，因此與直接偏好最佳化共享一個較為簡單的 RLHF 管線。VPO 的理論保證適用於線上和離線設定，與其標準 RL 對應項目的比率相符。此外，文本摘要和對話的實驗驗證了 VPO 的實用性和有效性。", "author": "Shicong Cen et.al.", "authors": "Shicong Cen, Jincheng Mei, Katayoon Goshvadi, Hanjun Dai, Tong Yang, Sherry Yang, Dale Schuurmans, Yuejie Chi, Bo Dai", "id": "2405.19320v1", "paper_url": "http://arxiv.org/abs/2405.19320v1", "repo": "null"}}