{"2407.17896": {"publish_time": "2024-07-25", "title": "3D Hole Filling using Deep Learning Inpainting", "paper_summary": "The current work presents a novel methodology for completing 3D surfaces\nproduced from 3D digitization technologies in places where there is a scarcity\nof meaningful geometric data. Incomplete or missing data in these\nthree-dimensional (3D) models can lead to erroneous or flawed renderings,\nlimiting their usefulness in a variety of applications such as visualization,\ngeometric computation, and 3D printing. Conventional surface estimation\napproaches often produce implausible results, especially when dealing with\ncomplex surfaces. To address this issue, we propose a technique that\nincorporates neural network-based 2D inpainting to effectively reconstruct 3D\nsurfaces. Our customized neural networks were trained on a dataset containing\nover 1 million curvature images. These images show the curvature of vertices as\nplanar representations in 2D. Furthermore, we used a coarse-to-fine surface\ndeformation technique to improve the accuracy of the reconstructed pictures and\nassure surface adaptability. This strategy enables the system to learn and\ngeneralize patterns from input data, resulting in the development of precise\nand comprehensive three-dimensional surfaces. Our methodology excels in the\nshape completion process, effectively filling complex holes in\nthree-dimensional surfaces with a remarkable level of realism and precision.", "paper_summary_zh": "本研究提出了一種新穎的方法，用於在有意義的幾何數據稀缺的地方，完成由 3D 數位化技術產生的 3D 表面。這些三維 (3D) 模型中的不完整或遺失數據可能會導致錯誤或有缺陷的渲染，限制了它們在可視化、幾何計算和 3D 列印等各種應用中的實用性。傳統的曲面估計方法通常會產生難以置信的結果，特別是在處理複雜曲面時。為了解決這個問題，我們提出了一種技術，結合了基於神經網路的 2D 修補，以有效重建 3D 曲面。我們的客製化神經網路是在包含超過 100 萬個曲率影像的資料集上訓練的。這些影像顯示了頂點的曲率，作為 2D 中的平面表示。此外，我們使用由粗到細的曲面變形技術來提高重建影像的準確性，並確保曲面適應性。此策略使系統能夠從輸入數據中學習和概括模式，從而開發出精確且全面的三維曲面。我們的技術在形狀完成過程中表現出色，有效地填補了三維曲面中複雜的孔洞，具有顯著的真實性和準確性。", "author": "Marina Hernández-Bautista et.al.", "authors": "Marina Hernández-Bautista, F. J. Melero", "id": "2407.17896v1", "paper_url": "http://arxiv.org/abs/2407.17896v1", "repo": "null"}}