{"2406.06976": {"publish_time": "2024-06-11", "title": "Discrete Dictionary-based Decomposition Layer for Structured Representation Learning", "paper_summary": "Neuro-symbolic neural networks have been extensively studied to integrate\nsymbolic operations with neural networks, thereby improving systematic\ngeneralization. Specifically, Tensor Product Representation (TPR) framework\nenables neural networks to perform differentiable symbolic operations by\nencoding the symbolic structure of data within vector spaces. However,\nTPR-based neural networks often struggle to decompose unseen data into\nstructured TPR representations, undermining their symbolic operations. To\naddress this decomposition problem, we propose a Discrete Dictionary-based\nDecomposition (D3) layer designed to enhance the decomposition capabilities of\nTPR-based models. D3 employs discrete, learnable key-value dictionaries trained\nto capture symbolic features essential for decomposition operations. It\nleverages the prior knowledge acquired during training to generate structured\nTPR representations by mapping input data to pre-learned symbolic features\nwithin these dictionaries. D3 is a straightforward drop-in layer that can be\nseamlessly integrated into any TPR-based model without modifications. Our\nexperimental results demonstrate that D3 significantly improves the systematic\ngeneralization of various TPR-based models while requiring fewer additional\nparameters. Notably, D3 outperforms baseline models on the synthetic task that\ndemands the systematic decomposition of unseen combinatorial data.", "paper_summary_zh": "神經符號神經網路已被廣泛研究，用於整合符號運算和神經網路，從而改善系統性泛化。具體來說，張量積表示 (TPR) 框架使神經網路能夠通過在向量空間內編碼資料的符號結構來執行可微分的符號運算。然而，基於 TPR 的神經網路通常難以將未見資料分解成結構化的 TPR 表示，從而損害其符號運算。為了解決這個分解問題，我們提出了一個基於離散字典的分解 (D3) 層，旨在增強基於 TPR 的模型的分解能力。D3 使用離散的可學習鍵值字典，經過訓練以擷取分解運算中必要的符號特徵。它利用訓練期間獲得的先驗知識，通過將輸入資料對應到這些字典中的預先學習的符號特徵，來產生結構化的 TPR 表示。D3 是一個直接的插入層，可以無縫整合到任何基於 TPR 的模型中，而無需修改。我們的實驗結果表明，D3 大幅改善了各種基於 TPR 的模型的系統性泛化，同時需要較少的額外參數。值得注意的是，D3 在需要系統性分解未見組合資料的合成任務上優於基線模型。", "author": "Taewon Park et.al.", "authors": "Taewon Park, Hyun-Chul Kim, Minho Lee", "id": "2406.06976v1", "paper_url": "http://arxiv.org/abs/2406.06976v1", "repo": "null"}}