{"2406.16524": {"publish_time": "2024-06-24", "title": "The Privileged Students: On the Value of Initialization in Multilingual Knowledge Distillation", "paper_summary": "Knowledge distillation (KD) has proven to be a successful strategy to improve\nthe performance of a smaller model in many NLP tasks. However, most of the work\nin KD only explores monolingual scenarios. In this paper, we investigate the\nvalue of KD in multilingual settings. We find the significance of KD and model\ninitialization by analyzing how well the student model acquires multilingual\nknowledge from the teacher model. Our proposed method emphasizes copying the\nteacher model's weights directly to the student model to enhance\ninitialization. Our finding shows that model initialization using copy-weight\nfrom the fine-tuned teacher contributes the most compared to the distillation\nprocess itself across various multilingual settings. Furthermore, we\ndemonstrate that efficient weight initialization preserves multilingual\ncapabilities even in low-resource scenarios.", "paper_summary_zh": "知識蒸餾 (KD) 已證明是一種成功的策略，可改善小型模型在許多 NLP 任務中的效能。然而，KD 中的大部分工作僅探索單語情境。在本文中，我們研究 KD 在多語系設定中的價值。我們透過分析學生模型從教師模型中獲取多語系知識的程度，發現 KD 和模型初始化的重要性。我們提出的方法強調直接將教師模型的權重複製到學生模型，以增強初始化。我們的發現顯示，與各種多語系設定中的蒸餾過程本身相比，使用微調教師的複製權重進行模型初始化的貢獻最大。此外，我們證明，即使在低資源情境中，有效率的權重初始化也能保留多語系能力。", "author": "Haryo Akbarianto Wibowo et.al.", "authors": "Haryo Akbarianto Wibowo, Thamar Solorio, Alham Fikri Aji", "id": "2406.16524v1", "paper_url": "http://arxiv.org/abs/2406.16524v1", "repo": "null"}}