{"2411.08438": {"publish_time": "2024-11-13", "title": "Towards Optimizing a Retrieval Augmented Generation using Large Language Model on Academic Data", "paper_summary": "Given the growing trend of many organizations integrating Retrieval Augmented\nGeneration (RAG) into their operations, we assess RAG on domain-specific data\nand test state-of-the-art models across various optimization techniques. We\nincorporate four optimizations; Multi-Query, Child-Parent-Retriever, Ensemble\nRetriever, and In-Context-Learning, to enhance the functionality and\nperformance in the academic domain. We focus on data retrieval, specifically\ntargeting various study programs at a large technical university. We\nadditionally introduce a novel evaluation approach, the RAG Confusion Matrix\ndesigned to assess the effectiveness of various configurations within the RAG\nframework. By exploring the integration of both open-source (e.g., Llama2,\nMistral) and closed-source (GPT-3.5 and GPT-4) Large Language Models, we offer\nvaluable insights into the application and optimization of RAG frameworks in\ndomain-specific contexts. Our experiments show a significant performance\nincrease when including multi-query in the retrieval phase.", "paper_summary_zh": "鉴于许多组织将检索增强生成 (RAG) 集成到其运营中的趋势不断增长，我们在特定领域的资料上评估 RAG，并跨各种优化技术测试最先进的模型。我们结合了四项优化：多查询、子父检索器、集成检索器和情境内学习，以增强学术领域的实用性和性能。我们专注于数据检索，特别是针对大型技术大学的各种学习计划。我们还引入了一种新颖的评估方法，即 RAG 混淆矩阵，旨在评估 RAG 框架内各种配置的有效性。通过探索开源（例如，Llama2、Mistral）和闭源（GPT-3.5 和 GPT-4）大型语言模型的集成，我们提供了有关在特定领域上下文中应用和优化 RAG 框架的宝贵见解。我们的实验表明，在检索阶段加入多查询时，性能显著提升。", "author": "Anum Afzal et.al.", "authors": "Anum Afzal, Juraj Vladika, Gentrit Fazlija, Andrei Staradubets, Florian Matthes", "id": "2411.08438v1", "paper_url": "http://arxiv.org/abs/2411.08438v1", "repo": "null"}}