{"2411.05504": {"publish_time": "2024-11-08", "title": "LBPE: Long-token-first Tokenization to Improve Large Language Models", "paper_summary": "The prevalent use of Byte Pair Encoding (BPE) in Large Language Models (LLMs)\nfacilitates robust handling of subword units and avoids issues of\nout-of-vocabulary words. Despite its success, a critical challenge persists:\nlong tokens, rich in semantic information, have fewer occurrences in tokenized\ndatasets compared to short tokens, which can result in imbalanced learning\nissue across different tokens. To address that, we propose LBPE, which\nprioritizes long tokens during the encoding process. LBPE generates tokens\naccording to their reverse ranks of token length rather than their ranks in the\nvocabulary, granting longer tokens higher priority during the encoding process.\nConsequently, LBPE smooths the frequency differences between short and long\ntokens, and thus mitigates the learning imbalance. Extensive experiments across\ndiverse language modeling tasks demonstrate that LBPE consistently outperforms\nthe original BPE, well demonstrating its effectiveness.", "paper_summary_zh": "在大型語言模型 (LLM) 中普遍使用位元組對編碼 (BPE)，\n有助於穩健處理次單字元單位，並避免詞彙外單字的問題。儘管它很成功，但仍存在一個嚴峻的挑戰：\n語義資訊豐富的長標記在標記化資料集中的出現次數比短標記少，這可能會導致不同標記之間的學習不平衡\n問題。為了解決這個問題，我們提出了 LBPE，它在編碼過程中優先考慮長標記。LBPE 根據標記長度的反向排名而不是它們在詞彙中的排名來產生標記，在編碼過程中賦予較長的標記較高的優先順序。因此，LBPE 平滑了短標記和長標記之間的頻率差異，從而減輕了學習不平衡。在各種語言建模任務中的廣泛實驗表明，LBPE 持續優於原始 BPE，充分證明了它的有效性。", "author": "Haoran Lian et.al.", "authors": "Haoran Lian, Yizhe Xiong, Zijia Lin, Jianwei Niu, Shasha Mo, Hui Chen, Peng Liu, Guiguang Ding", "id": "2411.05504v1", "paper_url": "http://arxiv.org/abs/2411.05504v1", "repo": "null"}}