{"2411.18084": {"publish_time": "2024-11-27", "title": "From Exploration to Revelation: Detecting Dark Patterns in Mobile Apps", "paper_summary": "Mobile apps are essential in daily life, yet they often employ dark patterns,\nsuch as visual tricks to highlight certain options or linguistic tactics to nag\nusers into making purchases, to manipulate user behavior. Current research\nmainly uses manual methods to detect dark patterns, a process that is\ntime-consuming and struggles to keep pace with continually updating and\nemerging apps. While some studies targeted at automated detection, they are\nconstrained to static patterns and still necessitate manual app exploration. To\nbridge these gaps, we present AppRay, an innovative system that seamlessly\nblends task-oriented app exploration with automated dark pattern detection,\nreducing manual efforts. Our approach consists of two steps: First, we harness\nthe commonsense knowledge of large language models for targeted app\nexploration, supplemented by traditional random exploration to capture a\nbroader range of UI states. Second, we developed a static and dynamic dark\npattern detector powered by a contrastive learning-based multi-label classifier\nand a rule-based refiner to perform detection. We contributed two datasets,\nAppRay-Dark and AppRay-Light, with 2,185 unique deceptive patterns (including\n149 dynamic instances) across 18 types from 876 UIs and 871 benign UIs. These\ndatasets cover both static and dynamic dark patterns while preserving UI\nrelationships. Experimental results confirm that AppRay can efficiently explore\nthe app and identify a wide range of dark patterns with great performance.", "paper_summary_zh": "行動應用程式在日常生活中不可或缺，但它們經常使用黑模式，例如視覺技巧來突顯特定選項或語言策略來催促用戶進行購買，以操縱用戶行為。目前的研究所主要使用手動方法來偵測黑模式，這個過程非常耗時，而且難以跟上持續更新和新興的應用程式。雖然有些研究針對自動化偵測，但它們受到靜態模式的限制，而且仍然需要手動應用程式探索。為了彌補這些差距，我們提出 AppRay，一個創新的系統，它將以任務為導向的應用程式探索與自動化黑模式偵測無縫結合，減少手動工作。我們的做法包含兩個步驟：首先，我們利用大型語言模型的常識知識進行目標應用程式探索，並輔以傳統的隨機探索，以擷取更廣泛的 UI 狀態。其次，我們開發了一個靜態和動態的黑模式偵測器，由對比學習的多標籤分類器和基於規則的精煉器提供支援，以執行偵測。我們貢獻了兩個資料集，AppRay-Dark 和 AppRay-Light，其中包含 876 個 UI 和 871 個良性 UI 中 18 種類型的 2,185 個獨特的欺騙模式（包括 149 個動態實例）。這些資料集涵蓋靜態和動態黑模式，同時保留 UI 關係。實驗結果證實，AppRay 可以有效地探索應用程式，並以極佳的效能識別各種黑模式。", "author": "Jieshan Chen et.al.", "authors": "Jieshan Chen, Zhen Wang, Jiamou Sun, Wenbo Zou, Zhenchang Xing, Qinghua Lu, Qing Huang, Xiwei Xu", "id": "2411.18084v1", "paper_url": "http://arxiv.org/abs/2411.18084v1", "repo": "null"}}