{"2502.02917": {"publish_time": "2025-02-05", "title": "Interactive Symbolic Regression through Offline Reinforcement Learning: A Co-Design Framework", "paper_summary": "Symbolic Regression (SR) holds great potential for uncovering underlying\nmathematical and physical relationships from observed data. However, the vast\ncombinatorial space of possible expressions poses significant challenges for\nboth online search methods and pre-trained transformer models. Additionally,\ncurrent state-of-the-art approaches typically do not consider the integration\nof domain experts' prior knowledge and do not support iterative interactions\nwith the model during the equation discovery process. To address these\nchallenges, we propose the Symbolic Q-network (Sym-Q), an advanced interactive\nframework for large-scale symbolic regression. Unlike previous large-scale\ntransformer-based SR approaches, Sym-Q leverages reinforcement learning without\nrelying on a transformer-based decoder. This formulation allows the agent to\nlearn through offline reinforcement learning using any type of tree encoder,\nenabling more efficient training and inference. Furthermore, we propose a\nco-design mechanism, where the reinforcement learning-based Sym-Q facilitates\neffective interaction with domain experts at any stage of the equation\ndiscovery process. Users can dynamically modify generated nodes of the\nexpression, collaborating with the agent to tailor the mathematical expression\nto best fit the problem and align with the assumed physical laws, particularly\nwhen there is prior partial knowledge of the expected behavior. Our experiments\ndemonstrate that the pre-trained Sym-Q surpasses existing SR algorithms on the\nchallenging SSDNC benchmark. Moreover, we experimentally show on real-world\ncases that its performance can be further enhanced by the interactive co-design\nmechanism, with Sym-Q achieving greater performance gains than other\nstate-of-the-art models. Our reproducible code is available at\nhttps://github.com/EPFL-IMOS/Sym-Q.", "paper_summary_zh": "符號回歸 (SR) 在從觀測資料中揭露底層數學和物理關係方面具有巨大潛力。然而，可能的表達式的龐大組合空間對線上搜尋方法和預先訓練的轉換器模型都構成重大挑戰。此外，目前的先進方法通常不考慮整合領域專家的先驗知識，也不支援在方程式發現過程中與模型進行反覆互動。為了應對這些挑戰，我們提出符號 Q 網路 (Sym-Q)，一個用於大規模符號回歸的先進互動框架。與先前的基於轉換器的大規模 SR 方法不同，Sym-Q 利用強化學習，而不依賴基於轉換器的解碼器。此公式允許代理透過使用任何類型的樹狀編碼器進行離線強化學習，從而實現更有效率的訓練和推論。此外，我們提出一個協同設計機制，其中基於強化學習的 Sym-Q 能在方程式發現過程的任何階段促進與領域專家的有效互動。使用者可以動態修改表達式的生成節點，與代理合作，調整數學表達式以最適合問題並與假設的物理定律保持一致，特別是在對預期的行為有先驗部分知識時。我們的實驗證明，預先訓練的 Sym-Q 在具有挑戰性的 SSDNC 基準上超越現有的 SR 演算法。此外，我們在實際案例中透過實驗表明，其效能可以透過互動協同設計機制進一步提升，Sym-Q 的效能提升優於其他先進模型。我們可重製的程式碼可在 https://github.com/EPFL-IMOS/Sym-Q 取得。", "author": "Yuan Tian et.al.", "authors": "Yuan Tian, Wenqi Zhou, Michele Viscione, Hao Dong, David Kammer, Olga Fink", "id": "2502.02917v1", "paper_url": "http://arxiv.org/abs/2502.02917v1", "repo": "null"}}