{"2409.18390": {"publish_time": "2024-09-27", "title": "Speech to Reality: On-Demand Production using Natural Language, 3D Generative AI, and Discrete Robotic Assembly", "paper_summary": "We present a system that transforms speech into physical objects by combining\n3D generative Artificial Intelligence with robotic assembly. The system\nleverages natural language input to make design and manufacturing more\naccessible, enabling individuals without expertise in 3D modeling or robotic\nprogramming to create physical objects. We propose utilizing discrete robotic\nassembly of lattice-based voxel components to address the challenges of using\ngenerative AI outputs in physical production, such as design variability,\nfabrication speed, structural integrity, and material waste. The system\ninterprets speech to generate 3D objects, discretizes them into voxel\ncomponents, computes an optimized assembly sequence, and generates a robotic\ntoolpath. The results are demonstrated through the assembly of various objects,\nranging from chairs to shelves, which are prompted via speech and realized\nwithin 5 minutes using a 6-axis robotic arm.", "paper_summary_zh": "<paragraph>我們提出一個系統，透過結合 3D 生成式人工智慧與機器人組裝，將語音轉換為實體物件。此系統利用自然語言輸入，讓設計和製造更易於使用，讓沒有 3D 建模或機器人程式專業知識的人員也能建立實體物件。我們建議利用格狀體素元件的離散機器人組裝，來解決在實體生產中使用生成式 AI 輸出的挑戰，例如設計變異性、製造速度、結構完整性和材料浪費。此系統會解譯語音以產生 3D 物件，將其離散化為體素元件，計算最佳組裝順序，並產生機器人刀具路徑。結果透過組裝各種物件來展示，從椅子到架子，這些物件都是透過語音提示，並在 5 分鐘內使用 6 軸機器手臂實現。</paragraph>", "author": "Alexander Htet Kyaw et.al.", "authors": "Alexander Htet Kyaw, Se Hwan Jeon, Miana Smith, Neil Gershenfeld", "id": "2409.18390v1", "paper_url": "http://arxiv.org/abs/2409.18390v1", "repo": "null"}}