{"2406.10011": {"publish_time": "2024-06-14", "title": "Beyond Slow Signs in High-fidelity Model Extraction", "paper_summary": "Deep neural networks, costly to train and rich in intellectual property\nvalue, are increasingly threatened by model extraction attacks that compromise\ntheir confidentiality. Previous attacks have succeeded in reverse-engineering\nmodel parameters up to a precision of float64 for models trained on random data\nwith at most three hidden layers using cryptanalytical techniques. However, the\nprocess was identified to be very time consuming and not feasible for larger\nand deeper models trained on standard benchmarks. Our study evaluates the\nfeasibility of parameter extraction methods of Carlini et al. [1] further\nenhanced by Canales-Mart\\'inez et al. [2] for models trained on standard\nbenchmarks. We introduce a unified codebase that integrates previous methods\nand reveal that computational tools can significantly influence performance. We\ndevelop further optimisations to the end-to-end attack and improve the\nefficiency of extracting weight signs by up to 14.8 times compared to former\nmethods through the identification of easier and harder to extract neurons.\nContrary to prior assumptions, we identify extraction of weights, not\nextraction of weight signs, as the critical bottleneck. With our improvements,\na 16,721 parameter model with 2 hidden layers trained on MNIST is extracted\nwithin only 98 minutes compared to at least 150 minutes previously. Finally,\naddressing methodological deficiencies observed in previous studies, we propose\nnew ways of robust benchmarking for future model extraction attacks.", "paper_summary_zh": "深度神经网络在训练上成本高昂，且富含知识产权价值，越来越受到模型提取攻击的威胁，而这些攻击会损害其机密性。之前的攻击成功地对训练在随机数据上的模型进行逆向工程，将模型参数精度提升至 float64，最多使用三层隐藏层，并采用密码分析技术。然而，这一过程被认为非常耗时，并且对于在标准基准上训练的更大、更深层次的模型来说不可行。我们的研究评估了 Carlini 等人提出的参数提取方法的可行性 [1]，该方法得到了 Canales-Martínez 等人的进一步增强 [2]，用于在标准基准上训练的模型。我们引入了一个统一的代码库，集成了以前的方法，并揭示了计算工具可以显著影响性能。我们进一步优化了端到端攻击，并通过识别更容易和更难提取的神经元，将提取权重符号的效率提高了 14.8 倍，与以前的方法相比。与先前的假设相反，我们认为提取权重，而不是提取权重符号，是关键瓶颈。通过我们的改进，在 MNIST 上训练的具有 2 个隐藏层的 16,721 参数模型仅在 98 分钟内提取，而之前至少需要 150 分钟。最后，针对以前的研究中观察到的方法缺陷，我们提出了针对未来模型提取攻击的稳健基准测试的新方法。", "author": "Hanna Foerster et.al.", "authors": "Hanna Foerster, Robert Mullins, Ilia Shumailov, Jamie Hayes", "id": "2406.10011v1", "paper_url": "http://arxiv.org/abs/2406.10011v1", "repo": "null"}}