{"2411.07602": {"publish_time": "2024-11-12", "title": "Circuit Complexity Bounds for RoPE-based Transformer Architecture", "paper_summary": "Characterizing the express power of the Transformer architecture is critical\nto understanding its capacity limits and scaling law. Recent works provide the\ncircuit complexity bounds to Transformer-like architecture. On the other hand,\nRotary Position Embedding ($\\mathsf{RoPE}$) has emerged as a crucial technique\nin modern large language models, offering superior performance in capturing\npositional information compared to traditional position embeddings, which shows\ngreat potential in application prospects, particularly for the long context\nscenario. Empirical evidence also suggests that $\\mathsf{RoPE}$-based\nTransformer architectures demonstrate greater generalization capabilities\ncompared to conventional Transformer models. In this work, we establish a\ntighter circuit complexity bound for Transformers with $\\mathsf{RoPE}$\nattention. Our key contribution is that we show that unless $\\mathsf{TC}^0 =\n\\mathsf{NC}^1$, a $\\mathsf{RoPE}$-based Transformer with\n$\\mathrm{poly}(n)$-precision, $O(1)$ layers, hidden dimension $d \\leq O(n)$\ncannot solve the arithmetic problem or the Boolean formula value problem. This\nresult significantly demonstrates the fundamental limitation of the\nexpressivity of the $\\mathsf{RoPE}$-based Transformer architecture, although it\nachieves giant empirical success. Our theoretical framework not only\nestablishes tighter complexity bounds but also may instruct further work on the\n$\\mathsf{RoPE}$-based Transformer.", "paper_summary_zh": "對於理解 Transformer 架構的表達能力極限和擴充定律而言，描述其表達能力至關重要。最近的研究提供了 Transformer 類似架構的電路複雜度界限。另一方面，旋轉位置嵌入（$\\mathsf{RoPE}$）已成為現代大型語言模型中的一項關鍵技術，與傳統位置嵌入相比，它在捕捉位置資訊方面提供了卓越的效能，在應用前景方面展現了巨大的潛力，特別是對於長語境場景。實證證據也表明，與傳統的 Transformer 模型相比，基於 $\\mathsf{RoPE}$ 的 Transformer 架構展示出更強大的概化能力。在這項研究中，我們為具備 $\\mathsf{RoPE}$ 注意力的 Transformer 建立了一個更嚴謹的電路複雜度界限。我們的關鍵貢獻在於，我們證明了除非 $\\mathsf{TC}^0 = \\mathsf{NC}^1$，否則一個具備 $\\mathrm{poly}(n)$ 精度、$O(1)$ 層、隱藏維度 $d \\leq O(n)$ 的基於 $\\mathsf{RoPE}$ 的 Transformer 無法解決算術問題或布林公式值問題。儘管取得了巨大的實證成功，但這個結果顯著地證明了基於 $\\mathsf{RoPE}$ 的 Transformer 架構在表達能力上的基本限制。我們的理論架構不僅建立了更嚴謹的複雜度界限，還能指導後續關於基於 $\\mathsf{RoPE}$ 的 Transformer 的研究。", "author": "Bo Chen et.al.", "authors": "Bo Chen, Xiaoyu Li, Yingyu Liang, Jiangxuan Long, Zhenmei Shi, Zhao Song", "id": "2411.07602v1", "paper_url": "http://arxiv.org/abs/2411.07602v1", "repo": "null"}}