{"2409.15980": {"publish_time": "2024-09-24", "title": "Leveraging Unsupervised Learning for Cost-Effective Visual Anomaly Detection", "paper_summary": "Traditional machine learning-based visual inspection systems require\nextensive data collection and repetitive model training to improve accuracy.\nThese systems typically require expensive camera, computing equipment and\nsignificant machine learning expertise, which can substantially burden small\nand medium-sized enterprises. This study explores leveraging unsupervised\nlearning methods with pre-trained models and low-cost hardware to create a\ncost-effective visual anomaly detection system. The research aims to develop a\nlow-cost visual anomaly detection solution that uses minimal data for model\ntraining while maintaining generalizability and scalability. The system\nutilises unsupervised learning models from Anomalib and is deployed on\naffordable Raspberry Pi hardware through openVINO. The results show that this\ncost-effective system can complete anomaly defection training and inference on\na Raspberry Pi in just 90 seconds using only 10 normal product images,\nachieving an F1 macro score exceeding 0.95. While the system is slightly\nsensitive to environmental changes like lighting, product positioning, or\nbackground, it remains a swift and economical method for factory automation\ninspection for small and medium-sized manufacturers", "paper_summary_zh": "傳統的機器學習視覺檢測系統需要廣泛的資料收集和重複的模型訓練才能提高準確度。這些系統通常需要昂貴的相機、運算設備和大量的機器學習專業知識，這可能會對中小型企業造成重大負擔。本研究探討了利用非監督式學習方法、預訓練模型和低成本硬體來建立一個具成本效益的視覺異常偵測系統。該研究旨在開發一個低成本的視覺異常偵測解決方案，在維持可概化性和可擴充性的同時，使用最少的資料進行模型訓練。該系統利用 Anomalib 的非監督式學習模型，並透過 openVINO 部署在經濟實惠的 Raspberry Pi 硬體上。結果顯示，這個具成本效益的系統僅使用 10 張正常的產品圖片，就能在 Raspberry Pi 上完成異常缺陷訓練和推論，只需 90 秒，即可達到超過 0.95 的 F1 巨集分數。雖然該系統對環境變化（例如光線、產品定位或背景）略微敏感，但它仍然是中小型製造商進行工廠自動化檢測的快速且經濟的方法", "author": "Yunbo Long et.al.", "authors": "Yunbo Long, Zhengyang Ling, Sam Brook, Duncan McFarlane, Alexandra Brintrup", "id": "2409.15980v1", "paper_url": "http://arxiv.org/abs/2409.15980v1", "repo": "null"}}