{"2409.20553": {"publish_time": "2024-09-30", "title": "Maia-2: A Unified Model for Human-AI Alignment in Chess", "paper_summary": "There are an increasing number of domains in which artificial intelligence\n(AI) systems both surpass human ability and accurately model human behavior.\nThis introduces the possibility of algorithmically-informed teaching in these\ndomains through more relatable AI partners and deeper insights into human\ndecision-making. Critical to achieving this goal, however, is coherently\nmodeling human behavior at various skill levels. Chess is an ideal model system\nfor conducting research into this kind of human-AI alignment, with its rich\nhistory as a pivotal testbed for AI research, mature superhuman AI systems like\nAlphaZero, and precise measurements of skill via chess rating systems. Previous\nwork in modeling human decision-making in chess uses completely independent\nmodels to capture human style at different skill levels, meaning they lack\ncoherence in their ability to adapt to the full spectrum of human improvement\nand are ultimately limited in their effectiveness as AI partners and teaching\ntools. In this work, we propose a unified modeling approach for human-AI\nalignment in chess that coherently captures human style across different skill\nlevels and directly captures how people improve. Recognizing the complex,\nnon-linear nature of human learning, we introduce a skill-aware attention\nmechanism to dynamically integrate players' strengths with encoded chess\npositions, enabling our model to be sensitive to evolving player skill. Our\nexperimental results demonstrate that this unified framework significantly\nenhances the alignment between AI and human players across a diverse range of\nexpertise levels, paving the way for deeper insights into human decision-making\nand AI-guided teaching tools.", "paper_summary_zh": "<paragraph>在人工智能（AI）系統既超越人類能力，又能準確模擬人類行為的領域中，數量正不斷增加。這引入了在這些領域中通過更具關聯性的 AI 合作夥伴和更深入的人類決策制定見解，進行演算法知情教學的可能性。然而，實現此目標的關鍵在於以連貫的方式模擬不同技能級別的人類行為。西洋棋是一個理想的模型系統，可用於對此類人機對齊進行研究，它作為 AI 研究的關鍵測試平台，擁有豐富的歷史，成熟的超人類 AI 系統，例如 AlphaZero，以及通過西洋棋評分系統進行的精確技能測量。先前在西洋棋中模擬人類決策制定的工作使用完全獨立的模型來捕捉不同技能級別的人類風格，這表示它們在適應人類進步全光譜的能力上缺乏連貫性，並且最終在作為 AI 合作夥伴和教學工具方面的效能受到限制。在這項工作中，我們提出了一種統一的建模方法，用於西洋棋中的人機對齊，它以連貫的方式捕捉不同技能級別的人類風格，並直接捕捉人們如何進步。認識到人類學習的複雜、非線性本質，我們引入了一種技能感知注意力機制，以動態整合玩家的優勢與編碼西洋棋位置，使我們的模型能夠對不斷變化的玩家技能做出反應。我們的實驗結果表明，這個統一的框架顯著增強了 AI 和人類玩家在各種專業級別之間的對齊，為更深入了解人類決策制定和 AI 指導的教學工具鋪平了道路。</paragraph>", "author": "Zhenwei Tang et.al.", "authors": "Zhenwei Tang, Difan Jiao, Reid McIlroy-Young, Jon Kleinberg, Siddhartha Sen, Ashton Anderson", "id": "2409.20553v1", "paper_url": "http://arxiv.org/abs/2409.20553v1", "repo": "null"}}