{"2407.09011": {"publish_time": "2024-07-12", "title": "One Stone, Four Birds: A Comprehensive Solution for QA System Using Supervised Contrastive Learning", "paper_summary": "This paper presents a novel and comprehensive solution to enhance both the\nrobustness and efficiency of question answering (QA) systems through supervised\ncontrastive learning (SCL). Training a high-performance QA system has become\nstraightforward with pre-trained language models, requiring only a small amount\nof data and simple fine-tuning. However, despite recent advances, existing QA\nsystems still exhibit significant deficiencies in functionality and training\nefficiency. We address the functionality issue by defining four key tasks: user\ninput intent classification, out-of-domain input detection, new intent\ndiscovery, and continual learning. We then leverage a unified SCL-based\nrepresentation learning method to efficiently build an intra-class compact and\ninter-class scattered feature space, facilitating both known intent\nclassification and unknown intent detection and discovery. Consequently, with\nminimal additional tuning on downstream tasks, our approach significantly\nimproves model efficiency and achieves new state-of-the-art performance across\nall tasks.", "paper_summary_zh": "本文提出了一個新穎且全面的解決方案，透過監督式對比學習 (SCL) 來增強問答 (QA) 系統的穩健性和效率。使用預先訓練好的語言模型來訓練高性能 QA 系統已變得簡單明瞭，只需要少量資料和簡單的微調。然而，儘管有最近的進展，現有的 QA 系統在功能性和訓練效率方面仍存在顯著的缺陷。我們透過定義四個關鍵任務來解決功能問題：使用者輸入意圖分類、領域外輸入偵測、新意圖發現和持續學習。然後，我們利用統一的基於 SCL 的表示學習方法來有效建立類內緊湊和類間分散的特徵空間，促進已知意圖分類和未知意圖偵測和發現。因此，透過對下游任務進行最小的額外調整，我們的做法顯著提高了模型效率，並在所有任務中實現了新的最先進性能。", "author": "Bo Wang et.al.", "authors": "Bo Wang, Tsunenori Mine", "id": "2407.09011v1", "paper_url": "http://arxiv.org/abs/2407.09011v1", "repo": "null"}}