{"2410.15819": {"publish_time": "2024-10-21", "title": "LiMTR: Time Series Motion Prediction for Diverse Road Users through Multimodal Feature Integration", "paper_summary": "Predicting the behavior of road users accurately is crucial to enable the\nsafe operation of autonomous vehicles in urban or densely populated areas.\nTherefore, there has been a growing interest in time series motion prediction\nresearch, leading to significant advancements in state-of-the-art techniques in\nrecent years. However, the potential of using LiDAR data to capture more\ndetailed local features, such as a person's gaze or posture, remains largely\nunexplored. To address this, we develop a novel multimodal approach for motion\nprediction based on the PointNet foundation model architecture, incorporating\nlocal LiDAR features. Evaluation on the Waymo Open Dataset shows a performance\nimprovement of 6.20% and 1.58% in minADE and mAP respectively, when integrated\nand compared with the previous state-of-the-art MTR. We open-source the code of\nour LiMTR model.", "paper_summary_zh": "準確預測道路使用者的行為對於在市區或人口稠密地區安全操作自動駕駛車輛至關重要。因此，時序運動預測研究引起了越來越大的興趣，並在近年來促成了最先進技術的重大進展。然而，利用 LiDAR 資料捕捉更多詳細的局部特徵（例如人的視線或姿勢）的潛力在很大程度上仍未開發。為了解決這個問題，我們基於 PointNet 基礎模型架構開發了一種新穎的多模式運動預測方法，並結合了局部 LiDAR 特徵。在 Waymo 開放資料集上的評估顯示，與先前的最先進 MTR 整合並進行比較時，minADE 和 mAP 分別改進了 6.20% 和 1.58%。我們開放了 LiMTR 模型的程式碼。", "author": "Camiel Oerlemans et.al.", "authors": "Camiel Oerlemans, Bram Grooten, Michiel Braat, Alaa Alassi, Emilia Silvas, Decebal Constantin Mocanu", "id": "2410.15819v1", "paper_url": "http://arxiv.org/abs/2410.15819v1", "repo": "https://github.com/cing2/limtr"}}