{"2408.10189": {"publish_time": "2024-08-19", "title": "Transformers to SSMs: Distilling Quadratic Knowledge to Subquadratic Models", "paper_summary": "Transformer architectures have become a dominant paradigm for domains like\nlanguage modeling but suffer in many inference settings due to their\nquadratic-time self-attention. Recently proposed subquadratic architectures,\nsuch as Mamba, have shown promise, but have been pretrained with substantially\nless computational resources than the strongest Transformer models. In this\nwork, we present a method that is able to distill a pretrained Transformer\narchitecture into alternative architectures such as state space models (SSMs).\nThe key idea to our approach is that we can view both Transformers and SSMs as\napplying different forms of mixing matrices over the token sequences. We can\nthus progressively distill the Transformer architecture by matching different\ndegrees of granularity in the SSM: first matching the mixing matrices\nthemselves, then the hidden units at each block, and finally the end-to-end\npredictions. Our method, called MOHAWK, is able to distill a Mamba-2 variant\nbased on the Phi-1.5 architecture (Phi-Mamba) using only 3B tokens and a hybrid\nversion (Hybrid Phi-Mamba) using 5B tokens. Despite using less than 1% of the\ntraining data typically used to train models from scratch, Phi-Mamba boasts\nsubstantially stronger performance compared to all past open-source\nnon-Transformer models. MOHAWK allows models like SSMs to leverage\ncomputational resources invested in training Transformer-based architectures,\nhighlighting a new avenue for building such models.", "paper_summary_zh": "變形器架構已成為語言模型等領域的主流範例，但由於其二次方時間自我注意，在許多推論設定中會遇到困難。最近提出的次二次方架構，例如 Mamba，已展現其前景，但預訓練時所用的運算資源遠低於最強大的變形器模型。在這項工作中，我們提出了一種方法，能夠將預訓練的變形器架構轉化為替代架構，例如狀態空間模型 (SSM)。我們方法的關鍵概念是，我們可以將變形器和 SSM 視為在令牌序列上套用不同形式的混合矩陣。因此，我們可以透過調整 SSM 中不同程度的詳細度來逐步轉化變形器架構：首先調整混合矩陣本身，然後調整每個區塊中的隱藏單元，最後調整端對端預測。我們的方法稱為 MOHAWK，能夠使用僅 3B 個令牌將基於 Phi-1.5 架構的 Mamba-2 變體（Phi-Mamba）轉化為混合版本（Hybrid Phi-Mamba），並使用 5B 個令牌。儘管使用少於從頭訓練模型通常使用的 1% 訓練資料，但與過去所有開源非變形器模型相比，Phi-Mamba 擁有顯著更強的效能。MOHAWK 允許像 SSM 這樣的模型利用投資於訓練基於變形器的架構的運算資源，突顯了建構此類模型的新途徑。", "author": "Aviv Bick et.al.", "authors": "Aviv Bick, Kevin Y. Li, Eric P. Xing, J. Zico Kolter, Albert Gu", "id": "2408.10189v1", "paper_url": "http://arxiv.org/abs/2408.10189v1", "repo": "null"}}