{"2405.03998": {"publish_time": "2024-05-07", "title": "Sketch Then Generate: Providing Incremental User Feedback and Guiding LLM Code Generation through Language-Oriented Code Sketches", "paper_summary": "Crafting effective prompts for code generation or editing with Large Language\nModels (LLMs) is not an easy task. Particularly, the absence of immediate,\nstable feedback during prompt crafting hinders effective interaction, as users\nare left to mentally imagine possible outcomes until the code is generated. In\nresponse, we introduce Language-Oriented Code Sketching, an interactive\napproach that provides instant, incremental feedback in the form of code\nsketches (i.e., incomplete code outlines) during prompt crafting. This approach\nconverts a prompt into a code sketch by leveraging the inherent linguistic\nstructures within the prompt and applying classic natural language processing\ntechniques. The sketch then serves as an intermediate placeholder that not only\npreviews the intended code structure but also guides the LLM towards the\ndesired code, thereby enhancing human-LLM interaction. We conclude by\ndiscussing the approach's applicability and future plans.", "paper_summary_zh": "為大型語言模型 (LLM) 編寫用於產生或編輯程式碼的有效提示並非易事。特別是，在提示編寫過程中缺乏立即且穩定的回饋會阻礙有效的互動，因為使用者只能在程式碼產生之前在腦海中想像可能的結果。為了解決此問題，我們引入了以語言為導向的程式碼草圖，這是一種互動式方法，可在提示編寫過程中提供即時、遞增的回饋，形式為程式碼草圖（即不完整的程式碼大綱）。此方法透過利用提示中的內在語言結構，並套用經典的自然語言處理技術，將提示轉換為程式碼草圖。然後，草圖會作為一個中間占位符，它不僅預覽預期的程式碼結構，還能引導 LLM 朝向所需的程式碼，進而增強人類與 LLM 的互動。我們最後討論此方法的適用性與未來計畫。", "author": "Chen Zhu-Tian et.al.", "authors": "Chen Zhu-Tian, Zeyu Xiong, Xiaoshuo Yao, Elena Glassman", "id": "2405.03998v1", "paper_url": "http://arxiv.org/abs/2405.03998v1", "repo": "null"}}