{"2411.04799": {"publish_time": "2024-11-07", "title": "Kwai-STaR: Transform LLMs into State-Transition Reasoners", "paper_summary": "Mathematical reasoning presents a significant challenge to the cognitive\ncapabilities of LLMs. Various methods have been proposed to enhance the\nmathematical ability of LLMs. However, few recognize the value of state\ntransition for LLM reasoning. In this work, we define mathematical\nproblem-solving as a process of transiting from an initial unsolved state to\nthe final resolved state, and propose Kwai-STaR framework, which transforms\nLLMs into State-Transition Reasoners to improve their intuitive reasoning\ncapabilities. Our approach comprises three main steps: (1) Define the state\nspace tailored to the mathematical reasoning. (2) Generate state-transition\ndata based on the state space. (3) Convert original LLMs into State-Transition\nReasoners via a curricular training strategy. Our experiments validate the\neffectiveness of Kwai-STaR in enhancing mathematical reasoning: After training\non the small-scale Kwai-STaR dataset, general LLMs, including Mistral-7B and\nLLaMA-3, achieve considerable performance gain on the GSM8K and GSM-Hard\ndataset. Additionally, the state transition-based design endows Kwai-STaR with\nremarkable training and inference efficiency. Further experiments are underway\nto establish the generality of Kwai-STaR.", "paper_summary_zh": "數學推理對 LLM 的認知能力提出重大挑戰。已經提出各種方法來增強 LLM 的數學能力。然而，很少有人認識到狀態轉換對 LLM 推理的價值。在這項工作中，我們將數學問題求解定義為從初始未解決狀態轉換到最終已解決狀態的過程，並提出 Kwai-STaR 框架，它將 LLM 轉換為狀態轉換推理器以提高其直覺推理能力。我們的做法包含三個主要步驟：(1) 定義適合數學推理的狀態空間。(2) 基於狀態空間生成狀態轉換數據。(3) 通過課程訓練策略將原始 LLM 轉換為狀態轉換推理器。我們的實驗驗證了 Kwai-STaR 在增強數學推理方面的有效性：在小規模 Kwai-STaR 數據集上訓練後，包括 Mistral-7B 和 LLaMA-3 在內的通用 LLM 在 GSM8K 和 GSM-Hard 數據集上取得了顯著的性能提升。此外，基於狀態轉換的設計賦予 Kwai-STaR 卓越的訓練和推理效率。進一步的實驗正在進行中，以建立 Kwai-STaR 的普遍性。", "author": "Xingyu Lu et.al.", "authors": "Xingyu Lu, Yuhang Hu, Changyi Liu, Tianke Zhang, Zhenyu Yang, Zhixiang Ding, Shengsheng Qian, Meng Du, Ruiwen Kang, Kaiyu Tang, Fan Yang, Tingting Gao, Di Zhang, Hai-Tao Zheng, Bin Wen", "id": "2411.04799v1", "paper_url": "http://arxiv.org/abs/2411.04799v1", "repo": "null"}}