{"2412.20495": {"publish_time": "2024-12-29", "title": "A Multiparty Homomorphic Encryption Approach to Confidential Federated Kaplan Meier Survival Analysis", "paper_summary": "The proliferation of healthcare data has expanded opportunities for\ncollaborative research, yet stringent privacy regulations hinder pooling\nsensitive patient records. We propose a \\emph{multiparty homomorphic\nencryption-based} framework for \\emph{privacy-preserving federated\nKaplan--Meier survival analysis}, offering native floating-point support, a\ntheoretical model, and explicit reconstruction-attack mitigation. Compared to\nprior work, our framework ensures encrypted federated survival estimates\nclosely match centralized outcomes, supported by formal utility-loss bounds\nthat demonstrate convergence as aggregation and decryption noise diminish.\nExtensive experiments on the NCCTG Lung Cancer and synthetic Breast Cancer\ndatasets confirm low \\emph{mean absolute error (MAE)} and \\emph{root mean\nsquared error (RMSE)}, indicating negligible deviations between encrypted and\nnon-encrypted survival curves. Log-rank and numerical accuracy tests reveal\n\\emph{no significant difference} between federated encrypted and non-encrypted\nanalyses, preserving statistical validity. A reconstruction-attack evaluation\nshows smaller federations (2--3 providers) with overlapping data between the\ninstitutions are vulnerable, a challenge mitigated by multiparty encryption.\nLarger federations (5--50 sites) degrade reconstruction accuracy further, with\nencryption improving confidentiality. Despite an 8--19$\\times$ computational\noverhead, threshold-based homomorphic encryption is \\emph{feasible for\nmoderate-scale deployments}, balancing security and runtime. By providing\nrobust privacy guarantees alongside high-fidelity survival estimates, our\nframework advances the state-of-the art in secure multi-institutional survival\nanalysis.", "paper_summary_zh": "醫療數據的激增擴大了協作研究的機會，但嚴格的隱私法規阻礙了敏感患者記錄的匯集。我們提出了一個基於多方同態加密的框架，用於隱私保護的聯邦 Kaplan-Meier 生存分析，提供原生浮點支持、理論模型和明確的重建攻擊緩解。與先前的研究相比，我們的框架確保加密的聯邦生存估計值與集中結果密切匹配，並得到正式的效用損失邊界的支持，證明了隨著聚合和解密噪聲的減少而收斂。在 NCCTG 肺癌和合成乳腺癌數據集上的大量實驗證實了較低的平均絕對誤差 (MAE) 和均方根誤差 (RMSE)，表明加密和非加密生存曲線之間的偏差可以忽略不計。對數秩和數值準確度測試表明，聯邦加密和非加密分析之間沒有顯著差異，從而保持了統計效度。重建攻擊評估表明，數據在機構之間重疊的較小聯盟（2-3 個提供者）容易受到攻擊，而多方加密可以緩解這一挑戰。較大的聯盟（5-50 個站點）進一步降低了重建準確度，而加密則提高了機密性。儘管計算開銷增加了 8-19 倍，但基於閾值的同態加密對於中等規模的部署是可行的，它平衡了安全性與運行時。通過提供強大的隱私保證以及高保真生存估計，我們的框架推動了安全的多機構生存分析的最新技術。", "author": "Narasimha Raghavan Veeraragavan et.al.", "authors": "Narasimha Raghavan Veeraragavan, Svetlana Boudko, Jan Franz Nygård", "id": "2412.20495v1", "paper_url": "http://arxiv.org/abs/2412.20495v1", "repo": "null"}}