{"2405.15194": {"publish_time": "2024-05-24", "title": "Efficient Reinforcement Learning via Large Language Model-based Search", "paper_summary": "Reinforcement Learning (RL) suffers from sample inefficiency in sparse reward\ndomains, and the problem is pronounced if there are stochastic transitions. To\nimprove the sample efficiency, reward shaping is a well-studied approach to\nintroduce intrinsic rewards that can help the RL agent converge to an optimal\npolicy faster. However, designing a useful reward shaping function specific to\neach problem is challenging, even for domain experts. They would either have to\nrely on task-specific domain knowledge or provide an expert demonstration\nindependently for each task. Given, that Large Language Models (LLMs) have\nrapidly gained prominence across a magnitude of natural language tasks, we aim\nto answer the following question: Can we leverage LLMs to construct a reward\nshaping function that can boost the sample efficiency of an RL agent? In this\nwork, we aim to leverage off-the-shelf LLMs to generate a guide policy by\nsolving a simpler deterministic abstraction of the original problem that can\nthen be used to construct the reward shaping function for the downstream RL\nagent. Given the ineffectiveness of directly prompting LLMs, we propose MEDIC:\na framework that augments LLMs with a Model-based feEDback critIC, which\nverifies LLM-generated outputs, to generate a possibly sub-optimal but valid\nplan for the abstract problem. Our experiments across domains from the BabyAI\nenvironment suite show 1) the effectiveness of augmenting LLMs with MEDIC, 2) a\nsignificant improvement in the sample complexity of PPO and A2C-based RL agents\nwhen guided by our LLM-generated plan, and finally, 3) pave the direction for\nfurther explorations of how these models can be used to augment existing RL\npipelines.", "paper_summary_zh": "<paragraph>強化學習 (RL) 在稀疏獎勵領域中會遇到樣本效率低下的問題，而如果存在隨機轉換，則問題會更加嚴重。為了提高樣本效率，獎勵成形是一種經過充分研究的方法，用於引入內在獎勵，可以幫助 RL 代理更快地收斂到最佳策略。然而，針對每個問題設計一個有用的獎勵成形函數是一項挑戰，即使對於領域專家而言也是如此。他們必須依賴特定於任務的領域知識，或者為每個任務獨立提供專家示範。鑑於大型語言模型 (LLM) 已迅速在大量自然語言任務中獲得突出地位，我們旨在回答以下問題：我們能利用 LLM 來建構一個獎勵成形函數，從而提升 RL 代理的樣本效率嗎？在這項工作中，我們旨在利用現成的 LLM，透過解決原始問題的一個更簡單的確定性抽象來產生一個引導策略，然後可以用它來為下游 RL 代理建構獎勵成形函數。鑑於直接提示 LLM 的無效性，我們提出了 MEDIC：一個使用基於模型的回饋批評器來擴充 LLM 的框架，它會驗證 LLM 產生的輸出，以產生一個可能次於最佳但有效的抽象問題計畫。我們在 BabyAI 環境套件中跨領域進行的實驗顯示 1) 使用 MEDIC 擴充 LLM 的有效性，2) 在由我們的 LLM 產生的計畫引導下，基於 PPO 和 A2C 的 RL 代理的樣本複雜度有顯著改善，最後，3) 為進一步探索如何使用這些模型來擴充現有的 RL 管線鋪平了道路。</paragraph>", "author": "Siddhant Bhambri et.al.", "authors": "Siddhant Bhambri, Amrita Bhattacharjee, Huan Liu, Subbarao Kambhampati", "id": "2405.15194v1", "paper_url": "http://arxiv.org/abs/2405.15194v1", "repo": "null"}}