{"2407.04105": {"publish_time": "2024-07-04", "title": "Can Pre-trained Language Models Understand Chinese Humor?", "paper_summary": "Humor understanding is an important and challenging research in natural\nlanguage processing. As the popularity of pre-trained language models (PLMs),\nsome recent work makes preliminary attempts to adopt PLMs for humor recognition\nand generation. However, these simple attempts do not substantially answer the\nquestion: {\\em whether PLMs are capable of humor understanding?} This paper is\nthe first work that systematically investigates the humor understanding ability\nof PLMs. For this purpose, a comprehensive framework with three evaluation\nsteps and four evaluation tasks is designed. We also construct a comprehensive\nChinese humor dataset, which can fully meet all the data requirements of the\nproposed evaluation framework. Our empirical study on the Chinese humor dataset\nyields some valuable observations, which are of great guiding value for future\noptimization of PLMs in humor understanding and generation.", "paper_summary_zh": "幽默理解是自然語言處理中一項重要且具有挑戰性的研究。隨著預訓練語言模型 (PLM) 的普及，一些近期研究嘗試初步採用 PLM 來進行幽默識別和生成。然而，這些簡單的嘗試並未實質性地回答這個問題：{\\em PLM 是否具備幽默理解能力？} 本論文是第一個系統性探討 PLM 幽默理解能力的研究。為此，設計了一個包含三個評估步驟和四個評估任務的綜合框架。我們還構建了一個全面的中文幽默數據集，它可以完全滿足所提出的評估框架的所有數據需求。我們對中文幽默數據集進行的實證研究產生了一些有價值的觀察，這些觀察對於未來優化 PLM 在幽默理解和生成方面的能力具有重要的指導意義。", "author": "Yuyan Chen et.al.", "authors": "Yuyan Chen, Zhixu Li, Jiaqing Liang, Yanghua Xiao, Bang Liu, Yunwen Chen", "id": "2407.04105v1", "paper_url": "http://arxiv.org/abs/2407.04105v1", "repo": "null"}}