{"2408.03633": {"publish_time": "2024-08-07", "title": "CARE: A Clue-guided Assistant for CSRs to Read User Manuals", "paper_summary": "It is time-saving to build a reading assistant for customer service\nrepresentations (CSRs) when reading user manuals, especially information-rich\nones. Current solutions don't fit the online custom service scenarios well due\nto the lack of attention to user questions and possible responses. Hence, we\npropose to develop a time-saving and careful reading assistant for CSRs, named\nCARE. It can help the CSRs quickly find proper responses from the user manuals\nvia explicit clue chains. Specifically, each of the clue chains is formed by\ninferring over the user manuals, starting from the question clue aligned with\nthe user question and ending at a possible response. To overcome the shortage\nof supervised data, we adopt the self-supervised strategy for model learning.\nThe offline experiment shows that CARE is efficient in automatically inferring\naccurate responses from the user manual. The online experiment further\ndemonstrates the superiority of CARE to reduce CSRs' reading burden and keep\nhigh service quality, in particular with >35% decrease in time spent and\nkeeping a >0.75 ICC score.", "paper_summary_zh": "為客服代表（CSR）建立閱讀助理，在閱讀使用者手冊時可以節省時間，特別是資訊豐富的手冊。目前的解決方案並不適合線上客服的場景，因為它們沒有關注使用者的問題和可能的回應。因此，我們提議為 CSR 開發一個節省時間且仔細的閱讀助理，稱為 CARE。它可以幫助 CSR 透過明確的線索鏈，快速從使用者手冊中找到適當的回應。具體來說，每個線索鏈都是透過推論使用者手冊而形成的，從與使用者問題對齊的問題線索開始，並以可能的回應結束。為了克服監督式資料的不足，我們採用了自監督策略進行模型學習。離線實驗顯示，CARE 可以有效地從使用者手冊中自動推論出準確的回應。線上實驗進一步證明了 CARE 在減輕 CSR 閱讀負擔和維持高服務品質方面的優越性，特別是將花費的時間減少了 >35%，並保持 >0.75 的 ICC 分數。", "author": "Weihong Du et.al.", "authors": "Weihong Du, Jia Liu, Zujie Wen, Dingnan Jin, Hongru Liang, Wenqiang Lei", "id": "2408.03633v1", "paper_url": "http://arxiv.org/abs/2408.03633v1", "repo": "null"}}