{"2503.11790": {"publish_time": "2025-03-14", "title": "Visualizing Thought: Conceptual Diagrams Enable Robust Planning in LMMs", "paper_summary": "Human reasoning relies on constructing and manipulating mental\nmodels-simplified internal representations of situations that we use to\nunderstand and solve problems. Conceptual diagrams (for example, sketches drawn\nby humans to aid reasoning) externalize these mental models, abstracting\nirrelevant details to efficiently capture relational and spatial information.\nIn contrast, Large Language Models (LLMs) and Large Multimodal Models (LMMs)\npredominantly reason through textual representations, limiting their\neffectiveness in complex multi-step combinatorial and planning tasks. In this\npaper, we propose a zero-shot fully automatic framework that enables LMMs to\nreason through multiple chains of self-generated intermediate conceptual\ndiagrams, significantly enhancing their combinatorial planning capabilities.\nOur approach does not require any human initialization beyond a natural\nlanguage description of the task. It integrates both textual and diagrammatic\nreasoning within an optimized graph-of-thought inference framework, enhanced by\nbeam search and depth-wise backtracking. Evaluated on multiple challenging PDDL\nplanning domains, our method substantially improves GPT-4o's performance (for\nexample, from 35.5% to 90.2% in Blocksworld). On more difficult planning\ndomains with solution depths up to 40, our approach outperforms even the\no1-preview reasoning model (for example, over 13% improvement in Parking).\nThese results highlight the value of conceptual diagrams as a complementary\nreasoning medium in LMMs.", "paper_summary_zh": "<paragraph>人類的推理依賴於構建和操縱心智模型——我們用來理解和解決問題的情境簡化內部表徵。概念圖（例如，人類為了輔助推理而繪製的草圖）將這些心智模型外部化，抽象出無關的細節，以有效地捕捉關係和空間資訊。相比之下，大型語言模型 (LLM) 和大型多模態模型 (LMM) 主要透過文本表徵進行推理，這限制了它們在複雜的多步驟組合和規劃任務中的有效性。在本文中，我們提出了一個零樣本全自動框架，使 LMM 能夠透過多個自生成的中間概念圖鏈進行推理，從而顯著增強其組合規劃能力。除了任務的自然語言描述外，我們的方法不需要任何人工初始化。它在一個優化的思維圖推理框架內整合了文本和圖表推理，並透過集束搜尋和深度回溯進行了增強。在多個具有挑戰性的 PDDL 規劃領域進行評估，我們的方法大幅提高了 GPT-4o 的效能（例如，在 Blocksworld 中從 35.5% 提高到 90.2%）。在解決方案深度高達 40 的更困難的規劃領域，我們的方法甚至優於 o1-preview 推理模型（例如，在 Parking 中提高了 13% 以上）。這些結果突顯了概念圖作為 LMM 中補充推理媒介的價值。</paragraph>\n", "author": "Nasim Borazjanizadeh et.al.", "authors": "Nasim Borazjanizadeh, Roei Herzig, Eduard Oks, Trevor Darrell, Rogerio Feris, Leonid Karlinsky", "id": "2503.11790v1", "paper_url": "http://arxiv.org/abs/2503.11790v1", "repo": "null"}}