{"2407.11511": {"publish_time": "2024-07-16", "title": "Reasoning with Large Language Models, a Survey", "paper_summary": "Scaling up language models to billions of parameters has opened up\npossibilities for in-context learning, allowing instruction tuning and few-shot\nlearning on tasks that the model was not specifically trained for. This has\nachieved breakthrough performance on language tasks such as translation,\nsummarization, and question-answering. Furthermore, in addition to these\nassociative \"System 1\" tasks, recent advances in Chain-of-thought prompt\nlearning have demonstrated strong \"System 2\" reasoning abilities, answering a\nquestion in the field of artificial general intelligence whether LLMs can\nreason. The field started with the question whether LLMs can solve grade school\nmath word problems. This paper reviews the rapidly expanding field of\nprompt-based reasoning with LLMs. Our taxonomy identifies different ways to\ngenerate, evaluate, and control multi-step reasoning. We provide an in-depth\ncoverage of core approaches and open problems, and we propose a research agenda\nfor the near future. Finally, we highlight the relation between reasoning and\nprompt-based learning, and we discuss the relation between reasoning,\nsequential decision processes, and reinforcement learning. We find that\nself-improvement, self-reflection, and some metacognitive abilities of the\nreasoning processes are possible through the judicious use of prompts. True\nself-improvement and self-reasoning, to go from reasoning with LLMs to\nreasoning by LLMs, remains future work.", "paper_summary_zh": "<paragraph>將語言模型擴展到數十億個參數開啟了情境學習的可能性，允許對模型未經特別訓練的任務進行指令調整和少量學習。這在翻譯、摘要和問答等語言任務上實現了突破性的表現。此外，除了這些聯想式的「系統 1」任務之外，思考鏈提示學習的最新進展展示了強大的「系統 2」推理能力，回答了人工通用智慧領域中 LLM 是否可以推理的問題。該領域始於 LLM 是否能解決小學數學文字題的問題。本文回顧了 LLM 提示式推理快速擴展的領域。我們的分類法識別了生成、評估和控制多步驟推理的不同方法。我們深入探討了核心方法和開放性問題，並提出了近期研究議程。最後，我們強調了推理和提示式學習之間的關係，並討論了推理、序列決策過程和強化學習之間的關係。我們發現，通過明智地使用提示，推理過程的自完善、自我反思和一些元認知能力是可能的。真正的自我完善和自我推理，從使用 LLM 推理轉變為由 LLM 推理，仍然是未來的研究工作。</paragraph>", "author": "Aske Plaat et.al.", "authors": "Aske Plaat, Annie Wong, Suzan Verberne, Joost Broekens, Niki van Stein, Thomas Back", "id": "2407.11511v1", "paper_url": "http://arxiv.org/abs/2407.11511v1", "repo": "null"}}