{"2411.03537": {"publish_time": "2024-11-05", "title": "Two-Stage Pretraining for Molecular Property Prediction in the Wild", "paper_summary": "Accurate property prediction is crucial for accelerating the discovery of new\nmolecules. Although deep learning models have achieved remarkable success,\ntheir performance often relies on large amounts of labeled data that are\nexpensive and time-consuming to obtain. Thus, there is a growing need for\nmodels that can perform well with limited experimentally-validated data. In\nthis work, we introduce MoleVers, a versatile pretrained model designed for\nvarious types of molecular property prediction in the wild, i.e., where\nexperimentally-validated molecular property labels are scarce. MoleVers adopts\na two-stage pretraining strategy. In the first stage, the model learns\nmolecular representations from large unlabeled datasets via masked atom\nprediction and dynamic denoising, a novel task enabled by a new branching\nencoder architecture. In the second stage, MoleVers is further pretrained using\nauxiliary labels obtained with inexpensive computational methods, enabling\nsupervised learning without the need for costly experimental data. This\ntwo-stage framework allows MoleVers to learn representations that generalize\neffectively across various downstream datasets. We evaluate MoleVers on a new\nbenchmark comprising 22 molecular datasets with diverse types of properties,\nthe majority of which contain 50 or fewer training labels reflecting real-world\nconditions. MoleVers achieves state-of-the-art results on 20 out of the 22\ndatasets, and ranks second among the remaining two, highlighting its ability to\nbridge the gap between data-hungry models and real-world conditions where\npractically-useful labels are scarce.", "paper_summary_zh": "準確的屬性預測對於加速新分子的發現至關重要。儘管深度學習模型已取得顯著成功，但它們的性能通常依賴於大量的標籤數據，而這些數據的取得既昂貴又耗時。因此，越來越需要能夠在經過實驗驗證的數據有限的情況下表現良好的模型。在這項工作中，我們介紹了 MoleVers，這是一個多功能的預訓練模型，旨在針對各種類型的分子屬性預測，即在經過實驗驗證的分子屬性標籤稀缺的情況下。MoleVers 採用兩階段預訓練策略。在第一階段，該模型通過掩碼原子預測和動態去噪（一項由新的分支編碼器架構啟用的新任務）從大量的未標籤數據集中學習分子表示。在第二階段，MoleVers 使用通過廉價計算方法獲得的輔助標籤進行進一步的預訓練，從而實現監督學習，而無需昂貴的實驗數據。這種兩階段框架使 MoleVers 能夠學習跨各種下游數據集有效泛化的表示。我們在一個新的基準上評估 MoleVers，該基準包含 22 個具有不同類型的屬性的分子數據集，其中大部分包含 50 個或更少的訓練標籤，反映了真實世界的條件。MoleVers 在 22 個數據集中有 20 個取得了最先進的結果，而在剩下的兩個數據集中排名第二，突顯了它彌合數據密集型模型和實際應用中實用標籤稀缺之間差距的能力。", "author": "Kevin Tirta Wijaya et.al.", "authors": "Kevin Tirta Wijaya, Minghao Guo, Michael Sun, Hans-Peter Seidel, Wojciech Matusik, Vahid Babaei", "id": "2411.03537v1", "paper_url": "http://arxiv.org/abs/2411.03537v1", "repo": "null"}}