{"2410.24059": {"publish_time": "2024-10-31", "title": "Identifying General Mechanism Shifts in Linear Causal Representations", "paper_summary": "We consider the linear causal representation learning setting where we\nobserve a linear mixing of $d$ unknown latent factors, which follow a linear\nstructural causal model. Recent work has shown that it is possible to recover\nthe latent factors as well as the underlying structural causal model over them,\nup to permutation and scaling, provided that we have at least $d$ environments,\neach of which corresponds to perfect interventions on a single latent node\n(factor). After this powerful result, a key open problem faced by the community\nhas been to relax these conditions: allow for coarser than perfect single-node\ninterventions, and allow for fewer than $d$ of them, since the number of latent\nfactors $d$ could be very large. In this work, we consider precisely such a\nsetting, where we allow a smaller than $d$ number of environments, and also\nallow for very coarse interventions that can very coarsely \\textit{change the\nentire causal graph over the latent factors}. On the flip side, we relax what\nwe wish to extract to simply the \\textit{list of nodes that have shifted\nbetween one or more environments}. We provide a surprising identifiability\nresult that it is indeed possible, under some very mild standard assumptions,\nto identify the set of shifted nodes. Our identifiability proof moreover is a\nconstructive one: we explicitly provide necessary and sufficient conditions for\na node to be a shifted node, and show that we can check these conditions given\nobserved data. Our algorithm lends itself very naturally to the sample setting\nwhere instead of just interventional distributions, we are provided datasets of\nsamples from each of these distributions. We corroborate our results on both\nsynthetic experiments as well as an interesting psychometric dataset. The code\ncan be found at https://github.com/TianyuCodings/iLCS.", "paper_summary_zh": "<paragraph>我們考慮線性因果表示學習設置，在其中我們觀察到 $d$ 個未知潛在因子的線性混合，它們遵循線性結構因果模型。最近的研究表明，只要我們至少有 $d$ 個環境，其中每個環境對應於對單個潛在節點（因子）的完美干預，就可以恢復潛在因子以及它們之上的底層結構因果模型，直到置換和縮放。在這個強有力的結果之後，社區面臨的一個關鍵開放問題是放寬這些條件：允許比完美的單節點干預更粗糙的干預，並且允許少於 $d$ 個干預，因為潛在因子 $d$ 的數量可能非常大。在這項工作中，我們準確地考慮了這樣一個設置，在其中我們允許小於 $d$ 個環境的數量，並且還允許非常粗糙的干預，這些干預可以非常粗糙地「改變潛在因子上的整個因果圖」。另一方面，我們放寬了我們希望提取的內容，僅為「在一個或多個環境之間轉移的節點列表」。我們提供了一個令人驚訝的可識別性結果，即在一些非常溫和的標準假設下，確實可以識別出轉移節點的集合。此外，我們的可識別性證明是一個建設性的證明：我們明確地提供了節點成為轉移節點的必要條件和充分條件，並表明我們可以在給定觀察數據的情況下檢查這些條件。我們的演算法非常自然地適用於樣本設置，在這種設置中，我們不是僅提供干預分佈，而是提供來自這些分佈中每一個的樣本數據集。我們在合成實驗和一個有趣的精神測量數據集上證實了我們的結果。代碼可以在 https://github.com/TianyuCodings/iLCS 中找到。</paragraph>", "author": "Tianyu Chen et.al.", "authors": "Tianyu Chen, Kevin Bello, Francesco Locatello, Bryon Aragam, Pradeep Ravikumar", "id": "2410.24059v1", "paper_url": "http://arxiv.org/abs/2410.24059v1", "repo": "null"}}