{"2408.02545": {"publish_time": "2024-08-05", "title": "RAG Foundry: A Framework for Enhancing LLMs for Retrieval Augmented Generation", "paper_summary": "Implementing Retrieval-Augmented Generation (RAG) systems is inherently\ncomplex, requiring deep understanding of data, use cases, and intricate design\ndecisions. Additionally, evaluating these systems presents significant\nchallenges, necessitating assessment of both retrieval accuracy and generative\nquality through a multi-faceted approach. We introduce RAG Foundry, an\nopen-source framework for augmenting large language models for RAG use cases.\nRAG Foundry integrates data creation, training, inference and evaluation into a\nsingle workflow, facilitating the creation of data-augmented datasets for\ntraining and evaluating large language models in RAG settings. This integration\nenables rapid prototyping and experimentation with various RAG techniques,\nallowing users to easily generate datasets and train RAG models using internal\nor specialized knowledge sources. We demonstrate the framework effectiveness by\naugmenting and fine-tuning Llama-3 and Phi-3 models with diverse RAG\nconfigurations, showcasing consistent improvements across three\nknowledge-intensive datasets. Code is released as open-source in\nhttps://github.com/IntelLabs/RAGFoundry.", "paper_summary_zh": "實作檢索增強生成（RAG）系統本質上很複雜，需要深入了解資料、使用案例和複雜的設計決策。此外，評估這些系統會帶來顯著的挑戰，需要透過多面向的方法評估檢索準確度和生成品質。我們介紹 RAG Foundry，一個用於擴充大型語言模型以進行 RAG 使用案例的開源架構。RAG Foundry 將資料建立、訓練、推論和評估整合到單一工作流程中，簡化了資料增強資料集的建立，以便在 RAG 設定中訓練和評估大型語言模型。這種整合能快速製作原型和使用各種 RAG 技術進行實驗，讓使用者能輕鬆使用內部或專業知識來源來產生資料集並訓練 RAG 模型。我們透過使用多樣化的 RAG 組態來擴充和微調 Llama-3 和 Phi-3 模型來展示架構的有效性，展示了在三個知識密集型資料集中的持續改進。程式碼已在 https://github.com/IntelLabs/RAGFoundry 中以開源方式釋出。", "author": "Daniel Fleischer et.al.", "authors": "Daniel Fleischer, Moshe Berchansky, Moshe Wasserblat, Peter Izsak", "id": "2408.02545v1", "paper_url": "http://arxiv.org/abs/2408.02545v1", "repo": "null"}}