{"2412.12865": {"publish_time": "2024-12-17", "title": "Preference-Oriented Supervised Fine-Tuning: Favoring Target Model Over Aligned Large Language Models", "paper_summary": "Alignment, endowing a pre-trained Large language model (LLM) with the ability\nto follow instructions, is crucial for its real-world applications.\nConventional supervised fine-tuning (SFT) methods formalize it as causal\nlanguage modeling typically with a cross-entropy objective, requiring a large\namount of high-quality instruction-response pairs. However, the quality of\nwidely used SFT datasets can not be guaranteed due to the high cost and\nintensive labor for the creation and maintenance in practice. To overcome the\nlimitations associated with the quality of SFT datasets, we introduce a novel\n\\textbf{p}reference-\\textbf{o}riented supervised \\textbf{f}ine-\\textbf{t}uning\napproach, namely PoFT. The intuition is to boost SFT by imposing a particular\npreference: \\textit{favoring the target model over aligned LLMs on the same SFT\ndata.} This preference encourages the target model to predict a higher\nlikelihood than that predicted by the aligned LLMs, incorporating assessment\ninformation on data quality (i.e., predicted likelihood by the aligned LLMs)\ninto the training process. Extensive experiments are conducted, and the results\nvalidate the effectiveness of the proposed method. PoFT achieves stable and\nconsistent improvements over the SFT baselines across different training\ndatasets and base models. Moreover, we prove that PoFT can be integrated with\nexisting SFT data filtering methods to achieve better performance, and further\nimproved by following preference optimization procedures, such as DPO.", "paper_summary_zh": "對齊是賦予預先訓練的大語言模型 (LLM) 遵循指令的能力，這對其真實世界的應用至關重要。\n傳統的監督式微調 (SFT) 方法將其形式化為因果語言模型，通常使用交叉熵目標，需要大量高品質的指令回應對。然而，由於實際中建立和維護的高成本和大量勞動力，廣泛使用的 SFT 資料集的品質無法得到保證。為了克服與 SFT 資料集品質相關的限制，我們引進了一種新穎的 \\textbf{p}reference-\\textbf{o}riented supervised \\textbf{f}ine-\\textbf{t}uning 方法，即 PoFT。直覺上，我們透過施加特定的偏好來提升 SFT：\\textit{在相同的 SFT 資料上偏好目標模型勝過對齊的 LLM。}此偏好鼓勵目標模型預測比對齊的 LLM 預測更高的可能性，將資料品質的評估資訊（即對齊的 LLM 預測的可能性）納入訓練程序中。我們進行了廣泛的實驗，結果驗證了所提出方法的有效性。PoFT 在不同的訓練資料集和基礎模型中，都獲得了穩定且持續優於 SFT 基準的改進。此外，我們證明 PoFT 可以與現有的 SFT 資料過濾方法整合，以達到更好的效能，並透過遵循偏好最佳化程序（例如 DPO）進一步提升。", "author": "Yuchen Fan et.al.", "authors": "Yuchen Fan, Yuzhong Hong, Qiushi Wang, Junwei Bao, Hongfei Jiang, Yang Song", "id": "2412.12865v1", "paper_url": "http://arxiv.org/abs/2412.12865v1", "repo": "https://github.com/Savannah120/alignment-handbook-PoFT"}}