{"2406.07162": {"publish_time": "2024-06-11", "title": "EmoBox: Multilingual Multi-corpus Speech Emotion Recognition Toolkit and Benchmark", "paper_summary": "Speech emotion recognition (SER) is an important part of human-computer\ninteraction, receiving extensive attention from both industry and academia.\nHowever, the current research field of SER has long suffered from the following\nproblems: 1) There are few reasonable and universal splits of the datasets,\nmaking comparing different models and methods difficult. 2) No commonly used\nbenchmark covers numerous corpus and languages for researchers to refer to,\nmaking reproduction a burden. In this paper, we propose EmoBox, an\nout-of-the-box multilingual multi-corpus speech emotion recognition toolkit,\nalong with a benchmark for both intra-corpus and cross-corpus settings. For\nintra-corpus settings, we carefully designed the data partitioning for\ndifferent datasets. For cross-corpus settings, we employ a foundation SER\nmodel, emotion2vec, to mitigate annotation errors and obtain a test set that is\nfully balanced in speakers and emotions distributions. Based on EmoBox, we\npresent the intra-corpus SER results of 10 pre-trained speech models on 32\nemotion datasets with 14 languages, and the cross-corpus SER results on 4\ndatasets with the fully balanced test sets. To the best of our knowledge, this\nis the largest SER benchmark, across language scopes and quantity scales. We\nhope that our toolkit and benchmark can facilitate the research of SER in the\ncommunity.", "paper_summary_zh": "語音情緒辨識（SER）是人機互動中重要的一環，受到產業界與學術界的廣泛關注。然而，SER 的現有研究領域長期以來一直飽受以下問題所苦：1）資料集的合理且通用的切分很少，導致難以比較不同的模型與方法。2）沒有廣泛使用的基準涵蓋多種語料庫和語言供研究人員參考，使得重現成為一種負擔。在本文中，我們提出 EmoBox，這是一個開箱即用的多語言多語料庫語音情緒辨識工具組，並提供一個適用於語料庫內和語料庫間設定的基準。對於語料庫內設定，我們仔細設計了不同資料集的資料分割。對於語料庫間設定，我們採用基礎 SER 模型 emotion2vec 來減輕註解錯誤，並取得在說話者和情緒分佈上完全平衡的測試集。基於 EmoBox，我們呈現 10 個預訓練語音模型在 32 個情緒資料集（涵蓋 14 種語言）上的語料庫內 SER 結果，以及在 4 個具有完全平衡測試集的資料集上的語料庫間 SER 結果。據我們所知，這是最大的 SER 基準，涵蓋語言範圍和數量規模。我們希望我們的工具組和基準能促進社群中 SER 的研究。", "author": "Ziyang Ma et.al.", "authors": "Ziyang Ma, Mingjie Chen, Hezhao Zhang, Zhisheng Zheng, Wenxi Chen, Xiquan Li, Jiaxin Ye, Xie Chen, Thomas Hain", "id": "2406.07162v1", "paper_url": "http://arxiv.org/abs/2406.07162v1", "repo": "https://github.com/emo-box/emobox"}}