{"2409.19954": {"publish_time": "2024-09-30", "title": "Attribute-Text Guided Forgetting Compensation for Lifelong Person Re-Identification", "paper_summary": "Lifelong person re-identification (LReID) aims to continuously learn from\nnon-stationary data to match individuals in different environments. Each task\nis affected by variations in illumination and person-related information (such\nas pose and clothing), leading to task-wise domain gaps. Current LReID methods\nfocus on task-specific knowledge and ignore intrinsic task-shared\nrepresentations within domain gaps, limiting model performance. Bridging\ntask-wise domain gaps is crucial for improving anti-forgetting and\ngeneralization capabilities, especially when accessing limited old classes\nduring training. To address these issues, we propose a novel attribute-text\nguided forgetting compensation (ATFC) model, which explores text-driven global\nrepresentations of identity-related information and attribute-related local\nrepresentations of identity-free information for LReID. Due to the lack of\npaired text-image data, we design an attribute-text generator (ATG) to\ndynamically generate a text descriptor for each instance. We then introduce a\ntext-guided aggregation network (TGA) to explore robust text-driven global\nrepresentations for each identity and knowledge transfer. Furthermore, we\npropose an attribute compensation network (ACN) to investigate\nattribute-related local representations, which distinguish similar identities\nand bridge domain gaps. Finally, we develop an attribute anti-forgetting (AF)\nloss and knowledge transfer (KT) loss to minimize domain gaps and achieve\nknowledge transfer, improving model performance. Extensive experiments\ndemonstrate that our ATFC method achieves superior performance, outperforming\nexisting LReID methods by over 9.0$\\%$/7.4$\\%$ in average mAP/R-1 on the seen\ndataset.", "paper_summary_zh": "終身人物再識別 (LReID) 旨在持續從非平穩資料中學習，以在不同環境中比對個人。每個任務都會受到光照和個人相關資訊（例如姿勢和服裝）的變化影響，導致任務間的領域差距。目前的 LReID 方法專注於任務特定知識，而忽略領域差距內的內在任務共享表徵，限制了模型效能。彌合任務間的領域差距對於提升抗遺忘和概化能力至關重要，尤其是在訓練期間存取受限的舊類別時。為了解決這些問題，我們提出一個新穎的屬性文字引導遺忘補償 (ATFC) 模型，探索與身分相關資訊的文字驅動全局表徵，以及 LReID 身分無關資訊的屬性相關局部表徵。由於缺乏成對文字影像資料，我們設計了一個屬性文字產生器 (ATG) 來動態產生每個實例的文字描述符。然後，我們引入一個文字引導聚合網路 (TGA) 來探索每個身分的強健文字驅動全局表徵和知識傳遞。此外，我們提出一個屬性補償網路 (ACN) 來探討屬性相關的局部表徵，區分相似的身分並彌合領域差距。最後，我們開發了一個屬性抗遺忘 (AF) 損失和知識傳遞 (KT) 損失，以最小化領域差距並實現知識傳遞，提升模型效能。廣泛的實驗證明，我們的 ATFC 方法實現了卓越的效能，在已見資料集上以平均 mAP/R-1 超過 9.0% / 7.4% 的幅度優於現有的 LReID 方法。", "author": "Shiben Liu et.al.", "authors": "Shiben Liu, Huijie Fan, Qiang Wang, Weihong Ren, Yandong Tang", "id": "2409.19954v1", "paper_url": "http://arxiv.org/abs/2409.19954v1", "repo": "null"}}