{"2408.07680": {"publish_time": "2024-08-14", "title": "A Spitting Image: Modular Superpixel Tokenization in Vision Transformers", "paper_summary": "Vision Transformer (ViT) architectures traditionally employ a grid-based\napproach to tokenization independent of the semantic content of an image. We\npropose a modular superpixel tokenization strategy which decouples tokenization\nand feature extraction; a shift from contemporary approaches where these are\ntreated as an undifferentiated whole. Using on-line content-aware tokenization\nand scale- and shape-invariant positional embeddings, we perform experiments\nand ablations that contrast our approach with patch-based tokenization and\nrandomized partitions as baselines. We show that our method significantly\nimproves the faithfulness of attributions, gives pixel-level granularity on\nzero-shot unsupervised dense prediction tasks, while maintaining predictive\nperformance in classification tasks. Our approach provides a modular\ntokenization framework commensurable with standard architectures, extending the\nspace of ViTs to a larger class of semantically-rich models.", "paper_summary_zh": "視覺轉換器 (ViT) 架構傳統上採用基於網格的方法進行標記化，而與影像的語義內容無關。我們提出一個模組化的超像素標記化策略，它解耦了標記化和特徵萃取；與將這些視為一個未區分的整體的當代方法不同。使用線上內容感知標記化和尺度及形狀不變的位置嵌入，我們執行實驗和消融，將我們的方法與基於修補程式的標記化和隨機分割作為基準進行對比。我們展示了我們的方法顯著提升了歸因的保真度，在零次學習無監督密集預測任務中提供了像素級粒度，同時在分類任務中維持預測效能。我們的方法提供了一個模組化的標記化架構，與標準架構相稱，將 ViT 的空間擴展到一類更大的語義豐富模型。", "author": "Marius Aasan et.al.", "authors": "Marius Aasan, Odd Kolbjørnsen, Anne Schistad Solberg, Adín Ramirez Rivera", "id": "2408.07680v2", "paper_url": "http://arxiv.org/abs/2408.07680v2", "repo": "https://github.com/dsb-ifi/spit"}}