{"2409.04927": {"publish_time": "2024-09-07", "title": "Just ASR + LLM? A Study on Speech Large Language Models' Ability to Identify and Understand Speaker in Spoken Dialogue", "paper_summary": "In recent years, we have observed a rapid advancement in speech language\nmodels (SpeechLLMs), catching up with humans' listening and reasoning\nabilities. Remarkably, SpeechLLMs have demonstrated impressive spoken dialogue\nquestion-answering (SQA) performance in benchmarks like Gaokao, the English\nlistening test of the college entrance exam in China, which seemingly requires\nunderstanding both the spoken content and voice characteristics of speakers in\na conversation. However, after carefully examining Gaokao's questions, we find\nthe correct answers to many questions can be inferred from the conversation\ncontext alone without identifying the speaker asked in the question. Our\nevaluation of state-of-the-art models Qwen-Audio and WavLLM in both Gaokao and\nour proposed \"What Do You Like?\" dataset shows a significantly higher accuracy\nin these context-based questions than in identity-critical questions, which can\nonly be answered correctly with correct speaker identification. Our results and\nanalysis suggest that when solving SQA, the current SpeechLLMs exhibit limited\nspeaker awareness from the audio and behave similarly to an LLM reasoning from\nthe conversation transcription without sound. We propose that our definitions\nand automated classification of context-based and identity-critical questions\ncould offer a more accurate evaluation framework of SpeechLLMs in SQA tasks.", "paper_summary_zh": "近年来，我们观察到语音语言模型（SpeechLLM）快速进步，赶上了人类的听力和推理能力。值得注意的是，SpeechLLM 在基准测试中展示了令人印象深刻的口语对话问答（SQA）表现，例如高考，这是中国大学入学考试的英语听力测试，它似乎需要理解对话中说话者的口语内容和声音特征。然而，在仔细审阅高考题目后，我们发现许多题目的正确答案可以仅从对话语境中推断出来，而无需识别问题中询问的说话者。我们对最先进的模型 Qwen-Audio 和 WavLLM 在高考和我们提出的“你喜欢什么？”数据集中的评估表明，这些基于上下文的题目比在身份关键题目中准确度高得多，而后者只有在正确识别说话者后才能正确回答。我们的结果和分析表明，在解决 SQA 时，当前的 SpeechLLM 从音频中表现出有限的说话者意识，并且在没有声音的情况下从对话转录中推理时表现得类似于 LLM。我们建议，我们对基于上下文和身份关键问题的定义和自动分类可以为 SQA 任务中的 SpeechLLM 提供更准确的评估框架。", "author": "Junkai Wu et.al.", "authors": "Junkai Wu, Xulin Fan, Bo-Ru Lu, Xilin Jiang, Nima Mesgarani, Mark Hasegawa-Johnson, Mari Ostendorf", "id": "2409.04927v1", "paper_url": "http://arxiv.org/abs/2409.04927v1", "repo": "https://github.com/wjk0925/slt2024-speechllm-speaker-understanding"}}