{"2410.03553": {"publish_time": "2024-10-04", "title": "Structure-Enhanced Protein Instruction Tuning: Towards General-Purpose Protein Understanding", "paper_summary": "Proteins, as essential biomolecules, play a central role in biological\nprocesses, including metabolic reactions and DNA replication. Accurate\nprediction of their properties and functions is crucial in biological\napplications. Recent development of protein language models (pLMs) with\nsupervised fine tuning provides a promising solution to this problem. However,\nthe fine-tuned model is tailored for particular downstream prediction task, and\nachieving general-purpose protein understanding remains a challenge. In this\npaper, we introduce Structure-Enhanced Protein Instruction Tuning (SEPIT)\nframework to bridge this gap. Our approach integrates a noval structure-aware\nmodule into pLMs to inform them with structural knowledge, and then connects\nthese enhanced pLMs to large language models (LLMs) to generate understanding\nof proteins. In this framework, we propose a novel two-stage instruction tuning\npipeline that first establishes a basic understanding of proteins through\ncaption-based instructions and then refines this understanding using a mixture\nof experts (MoEs) to learn more complex properties and functional information\nwith the same amount of activated parameters. Moreover, we construct the\nlargest and most comprehensive protein instruction dataset to date, which\nallows us to train and evaluate the general-purpose protein understanding\nmodel. Extensive experimental results on open-ended generation and closed-set\nanswer tasks demonstrate the superior performance of SEPIT over both\nclosed-source general LLMs and open-source LLMs trained with protein knowledge.", "paper_summary_zh": "蛋白質作為重要的生物分子，在生物過程中扮演著核心角色，包括代謝反應和 DNA 複製。準確預測其特性和功能在生物應用中至關重要。最近開發的蛋白質語言模型 (pLM)，透過監督微調提供了解決此問題的絕佳方案。然而，微調模型是針對特定下游預測任務量身打造，而達成通用的蛋白質理解仍是一項挑戰。在本文中，我們介紹了結構增強蛋白質指令微調 (SEPIT) 框架來彌補這個差距。我們的做法將一個新穎的結構感知模組整合到 pLM 中，以結構知識告知它們，然後將這些增強的 pLM 連接到大型語言模型 (LLM) 以產生對蛋白質的理解。在這個框架中，我們提出了一個新穎的兩階段指令微調管道，它首先透過基於標題的指令建立對蛋白質的基本理解，然後使用專家混合 (MoE) 來完善此理解，以使用相同數量的已啟動參數來學習更複雜的特性和功能資訊。此外，我們建構了迄今為止最大且最全面的蛋白質指令資料集，這讓我們能夠訓練和評估通用蛋白質理解模型。在開放式生成和封閉式回答任務上的廣泛實驗結果證明了 SEPIT 優於封閉原始碼通用 LLM 和使用蛋白質知識訓練的開放原始碼 LLM。", "author": "Wei Wu et.al.", "authors": "Wei Wu, Chao Wang, Liyi Chen, Mingze Yin, Yiheng Zhu, Kun Fu, Jieping Ye, Hui Xiong, Zheng Wang", "id": "2410.03553v1", "paper_url": "http://arxiv.org/abs/2410.03553v1", "repo": "null"}}