{"2409.10847": {"publish_time": "2024-09-17", "title": "BAD: Bidirectional Auto-regressive Diffusion for Text-to-Motion Generation", "paper_summary": "Autoregressive models excel in modeling sequential dependencies by enforcing\ncausal constraints, yet they struggle to capture complex bidirectional patterns\ndue to their unidirectional nature. In contrast, mask-based models leverage\nbidirectional context, enabling richer dependency modeling. However, they often\nassume token independence during prediction, which undermines the modeling of\nsequential dependencies. Additionally, the corruption of sequences through\nmasking or absorption can introduce unnatural distortions, complicating the\nlearning process. To address these issues, we propose Bidirectional\nAutoregressive Diffusion (BAD), a novel approach that unifies the strengths of\nautoregressive and mask-based generative models. BAD utilizes a\npermutation-based corruption technique that preserves the natural sequence\nstructure while enforcing causal dependencies through randomized ordering,\nenabling the effective capture of both sequential and bidirectional\nrelationships. Comprehensive experiments show that BAD outperforms\nautoregressive and mask-based models in text-to-motion generation, suggesting a\nnovel pre-training strategy for sequence modeling. The codebase for BAD is\navailable on https://github.com/RohollahHS/BAD.", "paper_summary_zh": "自回归模型通过强制因果约束在建模顺序依赖关系方面表现出色，但由于其单向性，它们难以捕捉复杂的双向模式。相比之下，基于掩码的模型利用双向上下文，支持更丰富的依赖关系建模。然而，它们在预测期间通常假设标记独立性，这会破坏顺序依赖关系的建模。此外，通过掩码或吸收对序列的破坏可能会引入不自然的失真，使学习过程复杂化。为了解决这些问题，我们提出了双向自回归扩散 (BAD)，这是一种新颖的方法，它统一了自回归和基于掩码的生成模型的优势。BAD 利用基于置换的破坏技术，该技术保留了自然序列结构，同时通过随机排序来强制因果依赖关系，从而能够有效捕捉顺序和双向关系。综合实验表明，BAD 在文本到动作生成中优于自回归和基于掩码的模型，这表明了一种用于序列建模的新型预训练策略。BAD 的代码库可在 https://github.com/RohollahHS/BAD 上获得。", "author": "S. Rohollah Hosseyni et.al.", "authors": "S. Rohollah Hosseyni, Ali Ahmad Rahmani, S. Jamal Seyedmohammadi, Sanaz Seyedin, Arash Mohammadi", "id": "2409.10847v1", "paper_url": "http://arxiv.org/abs/2409.10847v1", "repo": "null"}}