{"2405.14702": {"publish_time": "2024-05-23", "title": "G3: An Effective and Adaptive Framework for Worldwide Geolocalization Using Large Multi-Modality Models", "paper_summary": "Worldwide geolocalization aims to locate the precise location at the\ncoordinate level of photos taken anywhere on the Earth. It is very challenging\ndue to 1) the difficulty of capturing subtle location-aware visual semantics,\nand 2) the heterogeneous geographical distribution of image data. As a result,\nexisting studies have clear limitations when scaled to a worldwide context.\nThey may easily confuse distant images with similar visual contents, or cannot\nadapt to various locations worldwide with different amounts of relevant data.\nTo resolve these limitations, we propose G3, a novel framework based on\nRetrieval-Augmented Generation (RAG). In particular, G3 consists of three\nsteps, i.e., Geo-alignment, Geo-diversification, and Geo-verification to\noptimize both retrieval and generation phases of worldwide geolocalization.\nDuring Geo-alignment, our solution jointly learns expressive multi-modal\nrepresentations for images, GPS and textual descriptions, which allows us to\ncapture location-aware semantics for retrieving nearby images for a given\nquery. During Geo-diversification, we leverage a prompt ensembling method that\nis robust to inconsistent retrieval performance for different image queries.\nFinally, we combine both retrieved and generated GPS candidates in\nGeo-verification for location prediction. Experiments on two well-established\ndatasets IM2GPS3k and YFCC4k verify the superiority of G3 compared to other\nstate-of-the-art methods.", "paper_summary_zh": "全球地理定位旨在精確定位地球上任何地方拍攝的照片的座標層級。由於 1) 難以捕捉微妙的位置感知視覺語義，以及 2) 影像資料的異質地理分佈，因此這是一個非常具有挑戰性的任務。因此，現有的研究在擴展到全球範圍時具有明顯的限制。它們很容易將具有類似視覺內容的遠端影像混淆，或者無法適應全球各地具有不同相關資料量的各種位置。為了解決這些限制，我們提出了 G3，一個基於檢索增強生成 (RAG) 的新框架。特別是，G3 包含三個步驟，即地理對齊、地理多樣化和地理驗證，以最佳化全球地理定位的檢索和生成階段。在地理對齊期間，我們的解決方案聯合學習影像、GPS 和文字描述的表達式多模態表示，這使我們能夠捕捉位置感知語義，以檢索給定查詢的附近影像。在地理多樣化期間，我們利用提示集成方法，該方法對於不同影像查詢的不一致檢索效能具有魯棒性。最後，我們在地理驗證中結合檢索和生成的 GPS 候選項，以進行位置預測。在兩個公認的資料集 IM2GPS3k 和 YFCC4k 上的實驗驗證了 G3 優於其他最先進方法的優越性。", "author": "Pengyue Jia et.al.", "authors": "Pengyue Jia, Yiding Liu, Xiaopeng Li, Xiangyu Zhao, Yuhao Wang, Yantong Du, Xiao Han, Xuetao Wei, Shuaiqiang Wang, Dawei Yin", "id": "2405.14702v1", "paper_url": "http://arxiv.org/abs/2405.14702v1", "repo": "null"}}