{"2408.12080": {"publish_time": "2024-08-22", "title": "Exploring the Feasibility of Automated Data Standardization using Large Language Models for Seamless Positioning", "paper_summary": "We propose a feasibility study for real-time automated data standardization\nleveraging Large Language Models (LLMs) to enhance seamless positioning systems\nin IoT environments. By integrating and standardizing heterogeneous sensor data\nfrom smartphones, IoT devices, and dedicated systems such as Ultra-Wideband\n(UWB), our study ensures data compatibility and improves positioning accuracy\nusing the Extended Kalman Filter (EKF). The core components include the\nIntelligent Data Standardization Module (IDSM), which employs a fine-tuned LLM\nto convert varied sensor data into a standardized format, and the\nTransformation Rule Generation Module (TRGM), which automates the creation of\ntransformation rules and scripts for ongoing data standardization. Evaluated in\nreal-time environments, our study demonstrates adaptability and scalability,\nenhancing operational efficiency and accuracy in seamless navigation. This\nstudy underscores the potential of advanced LLMs in overcoming sensor data\nintegration complexities, paving the way for more scalable and precise IoT\nnavigation solutions.", "paper_summary_zh": "我們提出一個可行性研究，用於實時自動化資料標準化，利用大型語言模型 (LLM) 來增強物聯網環境中的無縫定位系統。透過整合和標準化來自智慧型手機、物聯網裝置和專用系統（例如超寬頻 (UWB)）的異質感測器資料，我們的研究確保資料相容性，並使用擴展卡爾曼濾波器 (EKF) 改善定位精確度。核心元件包括智慧資料標準化模組 (IDSM)，它採用微調的 LLM 將各種感測器資料轉換為標準化格式，以及轉換規則產生模組 (TRGM)，它自動化持續資料標準化的轉換規則和指令碼的建立。在實時環境中評估，我們的研究展示了適應性和可擴充性，增強了無縫導航的運作效率和精確度。這項研究強調了進階 LLM 在克服感測器資料整合複雜性方面的潛力，為更具可擴充性和精確度的物聯網導航解決方案鋪路。", "author": "Max J. L. Lee et.al.", "authors": "Max J. L. Lee, Ju Lin, Li-Ta Hsu", "id": "2408.12080v1", "paper_url": "http://arxiv.org/abs/2408.12080v1", "repo": "null"}}