{"2411.02525": {"publish_time": "2024-11-01", "title": "Strongly Topology-preserving GNNs for Brain Graph Super-resolution", "paper_summary": "Brain graph super-resolution (SR) is an under-explored yet highly relevant\ntask in network neuroscience. It circumvents the need for costly and\ntime-consuming medical imaging data collection, preparation, and processing.\nCurrent SR methods leverage graph neural networks (GNNs) thanks to their\nability to natively handle graph-structured datasets. However, most GNNs\nperform node feature learning, which presents two significant limitations: (1)\nthey require computationally expensive methods to learn complex node features\ncapable of inferring connectivity strength or edge features, which do not scale\nto larger graphs; and (2) computations in the node space fail to adequately\ncapture higher-order brain topologies such as cliques and hubs. However,\nnumerous studies have shown that brain graph topology is crucial in identifying\nthe onset and presence of various neurodegenerative disorders like Alzheimer\nand Parkinson. Motivated by these challenges and applications, we propose our\nSTP-GSR framework. It is the first graph SR architecture to perform\nrepresentation learning in higher-order topological space. Specifically, using\nthe primal-dual graph formulation from graph theory, we develop an efficient\nmapping from the edge space of our low-resolution (LR) brain graphs to the node\nspace of a high-resolution (HR) dual graph. This approach ensures that\nnode-level computations on this dual graph correspond naturally to edge-level\nlearning on our HR brain graphs, thereby enforcing strong topological\nconsistency within our framework. Additionally, our framework is GNN layer\nagnostic and can easily learn from smaller, scalable GNNs, reducing\ncomputational requirements. We comprehensively benchmark our framework across\nseven key topological measures and observe that it significantly outperforms\nthe previous state-of-the-art methods and baselines.", "paper_summary_zh": "腦圖像超解析度 (SR) 是網路神經科學中一個尚未充分探索但高度相關的任務。它避開了代價高昂且耗時的醫學影像資料收集、準備和處理的需要。目前的 SR 方法利用圖神經網路 (GNN)，因為它們能夠原生處理圖形結構的資料集。然而，大多數 GNN 都執行節點特徵學習，這提出了兩個重大的限制：(1) 它們需要以計算成本高的方式來學習複雜的節點特徵，這些特徵能夠推論連接強度或邊緣特徵，這無法擴展到更大的圖形；(2) 節點空間中的計算無法充分擷取高階腦部拓撲，例如派系和樞紐。然而，許多研究表明，腦圖形拓撲對於識別各種神經退化性疾病（如阿茲海默症和帕金森氏症）的發病和存在至關重要。受到這些挑戰和應用激勵，我們提出了我們的 STP-GSR 架構。它是第一個在高階拓撲空間中執行表示學習的圖形 SR 架構。具體來說，我們使用圖論中的原始對偶圖形公式，從我們低解析度 (LR) 腦圖形的邊緣空間開發了一個高效的對映，對映到高解析度 (HR) 對偶圖形節點空間。這種方法確保了在這個對偶圖形上的節點層級計算自然地對應於我們 HR 腦圖形上的邊緣層級學習，從而強制執行我們框架內強大的拓撲一致性。此外，我們的框架與 GNN 層無關，並且可以輕鬆地從更小、可擴展的 GNN 中學習，從而減少計算需求。我們在七項關鍵拓撲測量中全面評定了我們的框架，並觀察到它顯著優於以往的先進方法和基線。", "author": "Pragya Singh et.al.", "authors": "Pragya Singh, Islem Rekik", "id": "2411.02525v1", "paper_url": "http://arxiv.org/abs/2411.02525v1", "repo": "null"}}