{"2407.21315": {"publish_time": "2024-07-31", "title": "Beyond Silent Letters: Amplifying LLMs in Emotion Recognition with Vocal Nuances", "paper_summary": "This paper introduces a novel approach to emotion detection in speech using\nLarge Language Models (LLMs). We address the limitation of LLMs in processing\naudio inputs by translating speech characteristics into natural language\ndescriptions. Our method integrates these descriptions into text prompts,\nenabling LLMs to perform multimodal emotion analysis without architectural\nmodifications. We evaluate our approach on two datasets: IEMOCAP and MELD,\ndemonstrating significant improvements in emotion recognition accuracy,\nparticularly for high-quality audio data. Our experiments show that\nincorporating speech descriptions yields a 2 percentage point increase in\nweighted F1 score on IEMOCAP (from 70.111\\% to 72.596\\%). We also compare\nvarious LLM architectures and explore the effectiveness of different feature\nrepresentations. Our findings highlight the potential of this approach in\nenhancing emotion detection capabilities of LLMs and underscore the importance\nof audio quality in speech-based emotion recognition tasks. We'll release the\nsource code on Github.", "paper_summary_zh": "本文提出了一個新穎的方法，使用大型語言模型 (LLM) 進行語音的情緒偵測。我們透過將語音特徵轉換為自然語言描述，來解決 LLM 在處理音訊輸入時的限制。我們的技術將這些描述整合到文字提示中，讓 LLM 能夠在不修改架構的情況下執行多模態的情緒分析。我們在兩個資料集：IEMOCAP 和 MELD 上評估我們的技術，顯示出在情緒辨識準確度上大幅提升，特別是對於高品質的音訊資料。我們的實驗顯示，加入語音描述讓 IEMOCAP 上的加權 F1 分數提升了 2 個百分點（從 70.111% 到 72.596%）。我們也比較了各種 LLM 架構，並探索了不同特徵表徵的有效性。我們的發現突顯了這種技術在提升 LLM 情緒偵測能力的潛力，並強調了音訊品質在基於語音的情緒辨識任務中的重要性。我們將在 Github 上釋出原始碼。", "author": "Zehui Wu et.al.", "authors": "Zehui Wu, Ziwei Gong, Lin Ai, Pengyuan Shi, Kaan Donbekci, Julia Hirschberg", "id": "2407.21315v2", "paper_url": "http://arxiv.org/abs/2407.21315v2", "repo": "null"}}