{"2411.13400": {"publish_time": "2024-11-20", "title": "Executable QR codes with Machine Learning for Industrial Applications", "paper_summary": "Executable QR codes, also known as eQR codes or just sQRy, are a special kind\nof QR codes that embed programs conceived to run on mobile devices like\nsmartphones. Since the program is directly encoded in binary form within the QR\ncode, it can be executed even when the reading device is not provided with\nInternet access. The applications of this technology are manifold, and range\nfrom smart user guides to advisory systems. The first programming language made\navailable for eQR is QRtree, which enables the implementation of decision trees\naimed, for example, at guiding the user in operating/maintaining a complex\nmachinery or for reaching a specific location.\n  In this work, an additional language is proposed, we term QRind, which was\nspecifically devised for Industry. It permits to integrate distinct\ncomputational blocks into the QR code, e.g., machine learning models to enable\npredictive maintenance and algorithms to ease machinery usage. QRind permits\nthe Industry 4.0/5.0 paradigms to be implemented, in part, also in those cases\nwhere Internet is unavailable.", "paper_summary_zh": "可執行 QR 碼，又稱為 eQR 碼或 sQRy，是一種特殊類型的 QR 碼，其中嵌入程式，供行動裝置（如智慧型手機）執行。由於程式直接以二進位形式編碼在 QR 碼中，因此即使讀取裝置未連上網路，也可以執行程式。此技術的應用範圍廣泛，從智慧使用者指南到諮詢系統。第一個可供 eQR 使用的程式語言是 QRtree，它能實作決策樹，例如引導使用者操作/維護複雜的機械或到達特定地點。\n在這項工作中，我們提出了一種額外的語言，我們稱之為 QRind，它專門為產業設計。它允許將不同的運算區塊整合到 QR 碼中，例如機器學習模型，以實現預測性維護，以及演算法，以簡化機械使用。QRind 允許實作工業 4.0/5.0 典範，部分情況下，即使在無法使用網路時也可以實作。", "author": "Stefano Scanzio et.al.", "authors": "Stefano Scanzio, Francesco Velluto, Matteo Rosani, Lukasz Wisniewski, Gianluca Cena", "id": "2411.13400v1", "paper_url": "http://arxiv.org/abs/2411.13400v1", "repo": "null"}}