{"2408.14432": {"publish_time": "2024-08-26", "title": "Contextual Bandit with Herding Effects: Algorithms and Recommendation Applications", "paper_summary": "Contextual bandits serve as a fundamental algorithmic framework for\noptimizing recommendation decisions online. Though extensive attention has been\npaid to tailoring contextual bandits for recommendation applications, the\n\"herding effects\" in user feedback have been ignored. These herding effects\nbias user feedback toward historical ratings, breaking down the assumption of\nunbiased feedback inherent in contextual bandits. This paper develops a novel\nvariant of the contextual bandit that is tailored to address the feedback bias\ncaused by the herding effects. A user feedback model is formulated to capture\nthis feedback bias. We design the TS-Conf (Thompson Sampling under Conformity)\nalgorithm, which employs posterior sampling to balance the exploration and\nexploitation tradeoff. We prove an upper bound for the regret of the algorithm,\nrevealing the impact of herding effects on learning speed. Extensive\nexperiments on datasets demonstrate that TS-Conf outperforms four benchmark\nalgorithms. Analysis reveals that TS-Conf effectively mitigates the negative\nimpact of herding effects, resulting in faster learning and improved\nrecommendation accuracy.", "paper_summary_zh": "情境式多臂老虎機作為一種基本演算法架構，用於線上最佳化推薦決策。儘管已廣泛關注客製化情境式多臂老虎機以進行推薦應用，但使用者回饋中的「從眾效應」已被忽略。這些從眾效應會讓使用者回饋偏向歷史評分，打破情境式多臂老虎機中固有的無偏回饋假設。本文開發出一種新穎的情境式多臂老虎機變體，專門用於解決由從眾效應造成的回饋偏差。制定使用者回饋模型以捕捉此回饋偏差。我們設計了 TS-Conf（從眾下的湯普森取樣）演算法，它採用後驗取樣來平衡探索和利用的取捨。我們證明了演算法遺憾的上限，揭示了從眾效應對學習速度的影響。對資料集進行的大量實驗證明，TS-Conf 優於四種基準演算法。分析顯示，TS-Conf 有效減輕了從眾效應的負面影響，從而加快了學習速度並提高了推薦準確度。", "author": "Luyue Xu et.al.", "authors": "Luyue Xu, Liming Wang, Hong Xie, Mingqiang Zhou", "id": "2408.14432v2", "paper_url": "http://arxiv.org/abs/2408.14432v2", "repo": "null"}}