{"2404.12975": {"publish_time": "2024-04-19", "title": "FineRec:Exploring Fine-grained Sequential Recommendation", "paper_summary": "Sequential recommendation is dedicated to offering items of interest for\nusers based on their history behaviors. The attribute-opinion pairs, expressed\nby users in their reviews for items, provide the potentials to capture user\npreferences and item characteristics at a fine-grained level. To this end, we\npropose a novel framework FineRec that explores the attribute-opinion pairs of\nreviews to finely handle sequential recommendation. Specifically, we utilize a\nlarge language model to extract attribute-opinion pairs from reviews. For each\nattribute, a unique attribute-specific user-opinion-item graph is created,\nwhere corresponding opinions serve as the edges linking heterogeneous user and\nitem nodes. To tackle the diversity of opinions, we devise a diversity-aware\nconvolution operation to aggregate information within the graphs, enabling\nattribute-specific user and item representation learning. Ultimately, we\npresent an interaction-driven fusion mechanism to integrate attribute-specific\nuser/item representations across all attributes for generating recommendations.\nExtensive experiments conducted on several realworld datasets demonstrate the\nsuperiority of our FineRec over existing state-of-the-art methods. Further\nanalysis also verifies the effectiveness of our fine-grained manner in handling\nthe task.", "paper_summary_zh": "序列推薦專注於根據使用者的歷史行為提供使用者感興趣的項目。使用者在對項目進行評論時表達的屬性意見對，提供了在細粒度層級捕捉使用者偏好和項目特徵的潛力。為此，我們提出了探索評論的屬性意見對的 FineRec 新架構，以精細處理序列推薦。具體來說，我們利用大型語言模型從評論中提取屬性意見對。對於每個屬性，都會建立一個獨特的屬性特定使用者意見項目圖，其中對應的意見作為連結異質使用者和項目節點的邊緣。為了應對意見的多樣性，我們設計了一個意識到多樣性的卷積運算，以彙總圖形中的資訊，實現屬性特定使用者和項目表示學習。最終，我們提出了一個互動驅動的融合機制，以整合所有屬性中屬性特定的使用者/項目表示，以產生推薦。在幾個真實世界資料集上進行的廣泛實驗證明了我們的 FineRec 優於現有的最先進方法。進一步的分析也驗證了我們在處理任務中的細粒度方式的有效性。", "author": "Xiaokun Zhang et.al.", "authors": "Xiaokun Zhang, Bo Xu, Youlin Wu, Yuan Zhong, Hongfei Lin, Fenglong Ma", "id": "2404.12975v1", "paper_url": "http://arxiv.org/abs/2404.12975v1", "repo": "https://github.com/zhang-xiaokun/finerec"}}