{"2409.11071": {"publish_time": "2024-09-17", "title": "Improve Machine Learning carbon footprint using Parquet dataset format and Mixed Precision training for regression algorithms", "paper_summary": "This study was the 2nd part of my dissertation for my master degree and\ncompared the power consumption using the Comma-Separated-Values (CSV) and\nparquet dataset format with the default floating point (32bit) and Nvidia mixed\nprecision (16bit and 32bit) while training a regression ML model. The same\ncustom PC as per the 1st part, which was dedicated to the classification\ntesting and analysis, was built to perform the experiments, and different ML\nhyper-parameters, such as batch size, neurons, and epochs, were chosen to build\nDeep Neural Networks (DNN). A benchmarking test with default hyper-parameter\nvalues for the DNN was used as a reference, while the experiments used a\ncombination of different settings. The results were recorded in Excel, and\ndescriptive statistics were chosen to calculate the mean between the groups and\ncompare them using graphs and tables. The outcome was positive when using mixed\nprecision combined with specific hyper-parameters. Compared to the\nbenchmarking, optimising the regression models reduced the power consumption\nbetween 7 and 11 Watts. The regression results show that while mixed precision\ncan help improve power consumption, we must carefully consider the\nhyper-parameters. A high number of batch sizes and neurons will negatively\naffect power consumption. However, this research required inferential\nstatistics, specifically ANOVA and T-test, to compare the relationship between\nthe means. The results reported no statistical significance between the means\nin the regression tests and accepted H0. Therefore, choosing different ML\ntechniques and the Parquet dataset format will not improve the computational\npower consumption and the overall ML carbon footprint. However, a more\nextensive implementation with a cluster of GPUs can increase the sample size\nsignificantly, as it is an essential factor and can change the outcome of the\nstatistical analysis.", "paper_summary_zh": "本研究是我碩士論文的第二部分，比較了使用逗號分隔值 (CSV) 和 Parquet 資料集格式與預設浮點數 (32 位元) 和 Nvidia 混合精度 (16 位元和 32 位元) 在訓練回歸 ML 模型時的功耗。與第一部分相同，專門用於分類測試和分析的客製化個人電腦用於執行實驗，並選擇不同的 ML 超參數，例如批次大小、神經元和次數，以建立深度神經網路 (DNN)。使用預設 DNN 超參數值進行基準測試作為參考，而實驗則使用不同的設定組合。結果記錄在 Excel 中，並選擇描述性統計數據來計算組間平均值，並使用圖形和表格進行比較。結合特定超參數使用混合精度時，結果為正向。與基準測試相比，最佳化回歸模型可將功耗降低 7 到 11 瓦。回歸結果顯示，雖然混合精度有助於改善功耗，但我們必須仔細考慮超參數。大量的批次大小和神經元會對功耗產生負面影響。然而，本研究需要推論統計，特別是 ANOVA 和 T 檢定，以比較平均值之間的關係。結果顯示回歸測試的平均值之間沒有統計顯著性，並接受 H0。因此，選擇不同的 ML 技術和 Parquet 資料集格式不會改善運算功耗和整體 ML 碳足跡。然而，使用 GPU 群集進行更廣泛的實作可以顯著增加樣本大小，因為這是一個重要的因素，並且可以改變統計分析的結果。", "author": "Andrew Antonopoulos et.al.", "authors": "Andrew Antonopoulos", "id": "2409.11071v1", "paper_url": "http://arxiv.org/abs/2409.11071v1", "repo": "null"}}