{"2408.16261": {"publish_time": "2024-08-29", "title": "Evaluating Time-Series Training Dataset through Lens of Spectrum in Deep State Space Models", "paper_summary": "This study investigates a method to evaluate time-series datasets in terms of\nthe performance of deep neural networks (DNNs) with state space models (deep\nSSMs) trained on the dataset. SSMs have attracted attention as components\ninside DNNs to address time-series data. Since deep SSMs have powerful\nrepresentation capacities, training datasets play a crucial role in solving a\nnew task. However, the effectiveness of training datasets cannot be known until\ndeep SSMs are actually trained on them. This can increase the cost of data\ncollection for new tasks, as a trial-and-error process of data collection and\ntime-consuming training are needed to achieve the necessary performance. To\nadvance the practical use of deep SSMs, the metric of datasets to estimate the\nperformance early in the training can be one key element. To this end, we\nintroduce the concept of data evaluation methods used in system identification.\nIn system identification of linear dynamical systems, the effectiveness of\ndatasets is evaluated by using the spectrum of input signals. We introduce this\nconcept to deep SSMs, which are nonlinear dynamical systems. We propose the\nK-spectral metric, which is the sum of the top-K spectra of signals inside deep\nSSMs, by focusing on the fact that each layer of a deep SSM can be regarded as\na linear dynamical system. Our experiments show that the K-spectral metric has\na large absolute value of the correlation coefficient with the performance and\ncan be used to evaluate the quality of training datasets.", "paper_summary_zh": "本研究探討一種方法，以狀態空間模型 (deep SSM) 訓練資料集，來評估時間序列資料集在深度神經網路 (DNN) 上的效能。SSMs 作為 DNN 中的元件，在處理時間序列資料時備受關注。由於深度 SSM 具有強大的表示能力，因此訓練資料集在解決新任務時扮演著至關重要的角色。然而，在深度 SSM 實際訓練資料集之前，無法得知訓練資料集的有效性。這可能會增加新任務資料收集的成本，因為需要透過資料收集的試錯過程和耗時的訓練，才能達到必要的效能。為了促進深度 SSM 的實際應用，資料集的指標可以作為一個關鍵元素，在訓練早期估計效能。為此，我們引入了系統辨識中使用的資料評估方法的概念。在線性動態系統的系統辨識中，資料集的有效性是透過輸入訊號的頻譜來評估。我們將此概念引入非線性動態系統的深度 SSM。我們提出了 K 頻譜指標，這是深度 SSM 內訊號的前 K 個頻譜的總和，重點在於深度 SSM 的每一層都可以視為線性動態系統。我們的實驗顯示，K 頻譜指標與效能之間具有很大的相關係數絕對值，可用來評估訓練資料集的品質。", "author": "Sekitoshi Kanai et.al.", "authors": "Sekitoshi Kanai, Yasutoshi Ida, Kazuki Adachi, Mihiro Uchida, Tsukasa Yoshida, Shin'ya Yamaguchi", "id": "2408.16261v1", "paper_url": "http://arxiv.org/abs/2408.16261v1", "repo": "null"}}