{"2409.11501": {"publish_time": "2024-09-17", "title": "Egalitarian Language Representation in Language Models: It All Begins with Tokenizers", "paper_summary": "Tokenizers act as a bridge between human language and the latent space of\nlanguage models, influencing how language is represented in these models. Due\nto the immense popularity of English-Centric Large Language Models (LLMs),\nefforts are being made to adapt them for other languages. However, we\ndemonstrate that, from a tokenization standpoint, not all tokenizers offer fair\nrepresentation for complex script languages such as Tamil, Sinhala, and Hindi,\nprimarily due to the choice of pre-tokenization methods. We go further to show\nthat pre-tokenization plays a more critical role than the tokenization\nalgorithm itself in achieving an egalitarian representation of these complex\nscript languages. To address this, we introduce an improvement to the Byte Pair\nEncoding (BPE) algorithm by incorporating graphemes, which we term Grapheme\nPair Encoding (GPE). Our experiments show that grapheme-based character\nextraction outperforms byte-level tokenizers for complex scripts. We validate\nthis approach through experiments on Tamil, Sinhala, and Hindi.", "paper_summary_zh": "分词器扮演人类语言和语言模型潜在空间之间的桥梁，影响语言在这些模型中的表示方式。由于以英语为中心的语言模型（LLM）的巨大普及，人们正在努力使它们适应其他语言。然而，我们证明，从标记化的角度来看，并非所有标记器都能为泰米尔语、僧伽罗语和印地语等复杂脚本语言提供公平的表示，这主要是由于预标记化方法的选择。我们进一步表明，预标记化在实现这些复杂脚本语言的平等表示中所扮演的角色比标记化算法本身更关键。为了解决这个问题，我们在字节对编码（BPE）算法中引入了一个改进，通过合并音素，我们称之为音素对编码（GPE）。我们的实验表明，基于音素的字符提取优于字节级标记器，适用于复杂脚本。我们通过对泰米尔语、僧伽罗语和印地语的实验验证了这种方法。", "author": "Menan Velayuthan et.al.", "authors": "Menan Velayuthan, Kengatharaiyer Sarveswaran", "id": "2409.11501v1", "paper_url": "http://arxiv.org/abs/2409.11501v1", "repo": "null"}}