{"2501.14051": {"publish_time": "2025-01-23", "title": "Revisiting CLIP: Efficient Alignment of 3D MRI and Tabular Data using Domain-Specific Foundation Models", "paper_summary": "Multi-modal models require aligned, shared embedding spaces. However, common\nCLIP-based approaches need large amounts of samples and do not natively support\n3D or tabular data, both of which are crucial in the medical domain. To address\nthese issues, we revisit CLIP-style alignment by training a domain-specific 3D\nfoundation model as an image encoder and demonstrate that modality alignment is\nfeasible with only 62 MRI scans. Our approach is enabled by a simple embedding\naccumulation strategy required for training in 3D, which scales the amount of\nnegative pairs across batches in order to stabilize training. We perform a\nthorough evaluation of various design choices, including the choice of backbone\nand loss functions, and evaluate the proposed methodology on zero-shot\nclassification and image-retrieval tasks. While zero-shot image-retrieval\nremains challenging, zero-shot classification results demonstrate that the\nproposed approach can meaningfully align the representations of 3D MRI with\ntabular data.", "paper_summary_zh": "多模態模型需要對齊的共用嵌入空間。然而，常見的基於 CLIP 的方法需要大量的樣本，並且原生不支援 3D 或表格資料，而這兩者在醫療領域中都至關重要。為了解決這些問題，我們透過訓練一個領域特定的 3D 基礎模型作為影像編碼器，重新檢視 CLIP 風格的對齊，並證明只要 62 個 MRI 掃描即可達成模態對齊。我們的做法得益於一個簡單的嵌入累積策略，這是 3D 訓練所必需的，它會調整批次中的負對數量以穩定訓練。我們對各種設計選擇進行了徹底的評估，包括主幹和損失函數的選擇，並在零樣本分類和影像檢索任務上評估所提出的方法。儘管零樣本影像檢索仍然具有挑戰性，但零樣本分類結果證明，所提出的方法可以有意義地將 3D MRI 的表示與表格資料對齊。", "author": "Jakob Krogh Petersen et.al.", "authors": "Jakob Krogh Petersen, Valdemar Licht, Mads Nielsen, Asbjørn Munk", "id": "2501.14051v1", "paper_url": "http://arxiv.org/abs/2501.14051v1", "repo": "https://github.com/jakekrogh/3d-clip-for-brain-mri"}}