{"2406.08824": {"publish_time": "2024-06-13", "title": "LLM-Driven Robots Risk Enacting Discrimination, Violence, and Unlawful Actions", "paper_summary": "Members of the Human-Robot Interaction (HRI) and Artificial Intelligence (AI)\ncommunities have proposed Large Language Models (LLMs) as a promising resource\nfor robotics tasks such as natural language interactions, doing household and\nworkplace tasks, approximating `common sense reasoning', and modeling humans.\nHowever, recent research has raised concerns about the potential for LLMs to\nproduce discriminatory outcomes and unsafe behaviors in real-world robot\nexperiments and applications. To address these concerns, we conduct an\nHRI-based evaluation of discrimination and safety criteria on several\nhighly-rated LLMs. Our evaluation reveals that LLMs currently lack robustness\nwhen encountering people across a diverse range of protected identity\ncharacteristics (e.g., race, gender, disability status, nationality, religion,\nand their intersections), producing biased outputs consistent with directly\ndiscriminatory outcomes -- e.g. `gypsy' and `mute' people are labeled\nuntrustworthy, but not `european' or `able-bodied' people. Furthermore, we test\nmodels in settings with unconstrained natural language (open vocabulary)\ninputs, and find they fail to act safely, generating responses that accept\ndangerous, violent, or unlawful instructions -- such as incident-causing\nmisstatements, taking people's mobility aids, and sexual predation. Our results\nunderscore the urgent need for systematic, routine, and comprehensive risk\nassessments and assurances to improve outcomes and ensure LLMs only operate on\nrobots when it is safe, effective, and just to do so. Data and code will be\nmade available.", "paper_summary_zh": "人機互動 (HRI) 和人工智慧 (AI) 社群的成員已提出大型語言模型 (LLM) 作為機器人任務的有希望資源，例如自然語言互動、執行家庭和工作場所任務、近似「常識推理」以及人類建模。然而，最近的研究對 LLM 在現實世界的機器人實驗和應用中產生歧視性結果和不安全行為的可能性提出了擔憂。為了解決這些問題，我們對幾個評分很高的 LLM 進行了基於 HRI 的歧視和安全標準評估。我們的評估顯示，LLM 目前在遇到具有各種受保護身份特徵（例如種族、性別、殘疾狀況、國籍、宗教及其交集）的人時缺乏穩健性，產生與直接歧視性結果一致的偏見輸出——例如「吉普賽人」和「啞巴」被標記為不可信，但「歐洲人」或「健全人」則不然。此外，我們在具有不受約束的自然語言（開放式詞彙）輸入的設置中測試模型，發現它們無法安全地執行，會產生接受危險、暴力或非法指令的回應——例如造成事故的錯誤陳述、拿走人們的行動輔具和性掠奪。我們的結果強調了對系統性、例行性和全面的風險評估和保證的迫切需要，以改善結果並確保 LLM 僅在安全、有效和公正的情況下在機器人上運行。數據和代碼將會提供。", "author": "Rumaisa Azeem et.al.", "authors": "Rumaisa Azeem, Andrew Hundt, Masoumeh Mansouri, Martim Brandão", "id": "2406.08824v1", "paper_url": "http://arxiv.org/abs/2406.08824v1", "repo": "null"}}