{"2408.13074": {"publish_time": "2024-08-23", "title": "Hierarchical Spatio-Temporal State-Space Modeling for fMRI Analysis", "paper_summary": "Recent advances in deep learning structured state space models, especially\nthe Mamba architecture, have demonstrated remarkable performance improvements\nwhile maintaining linear complexity. In this study, we introduce functional\nspatiotemporal Mamba (FST-Mamba), a Mamba-based model designed for discovering\nneurological biomarkers using functional magnetic resonance imaging (fMRI). We\nfocus on dynamic functional network connectivity (dFNC) derived from fMRI and\npropose a hierarchical spatiotemporal Mamba-based network that processes\nspatial and temporal information separately using Mamba-based encoders.\nLeveraging the topological uniqueness of the FNC matrix, we introduce a\ncomponent-wise varied-scale aggregation (CVA) mechanism to aggregate\nconnectivity across individual components within brain networks, enabling the\nmodel to capture both inter-component and inter-network information. To better\nhandle the FNC data, we develop a new component-specific scanning order.\nAdditionally, we propose symmetric rotary position encoding (SymRope) to encode\nthe relative positions of each functional connection while considering the\nsymmetric nature of the FNC matrix. Experimental results demonstrate\nsignificant improvements in the proposed FST-Mamba model on various brain-based\nclassification and regression tasks. Our work reveals the substantial potential\nof attention-free sequence modeling in brain discovery.", "paper_summary_zh": "深度學習結構化狀態空間模型的最新進展，尤其是 Mamba 架構，在維持線性複雜度的同時，展現了顯著的效能提升。在這項研究中，我們介紹了功能性時空 Mamba (FST-Mamba)，這是一個基於 Mamba 的模型，專門用於使用功能性磁共振造影 (fMRI) 發現神經生物標記。我們專注於源自 fMRI 的動態功能網路連接 (dFNC)，並提出一個基於 Mamba 的階層式時空網路，使用基於 Mamba 的編碼器分別處理空間和時間資訊。利用 FNC 矩陣的拓撲獨特性，我們引入了一個組件級可變規模聚合 (CVA) 機制，以聚合腦網路內各個組件之間的連接，讓模型能夠擷取組件間和網路間的資訊。為了更好地處理 FNC 資料，我們開發了一個新的組件特定掃描順序。此外，我們提出了對稱旋轉位置編碼 (SymRope) 來編碼每個功能連接的相對位置，同時考慮 FNC 矩陣的對稱性質。實驗結果顯示，所提出的 FST-Mamba 模型在各種基於大腦的分類和回歸任務中都有顯著的改進。我們的研究揭示了無注意力序列建模在大腦發現中的巨大潛力。", "author": "Yuxiang Wei et.al.", "authors": "Yuxiang Wei, Anees Abrol, Reihaneh Hassanzadeh, Vince Calhoun", "id": "2408.13074v1", "paper_url": "http://arxiv.org/abs/2408.13074v1", "repo": "null"}}