{"2405.16766": {"publish_time": "2024-05-27", "title": "Reframing the Relationship in Out-of-Distribution Detection", "paper_summary": "The remarkable achievements of Large Language Models (LLMs) have captivated\nthe attention of both academia and industry, transcending their initial role in\ndialogue generation. The utilization of LLMs as intermediary agents in various\ntasks has yielded promising results, sparking a wave of innovation in\nartificial intelligence. Building on these breakthroughs, we introduce a novel\napproach that integrates the agent paradigm into the Out-of-distribution (OOD)\ndetection task, aiming to enhance its robustness and adaptability. Our proposed\nmethod, Concept Matching with Agent (CMA), employs neutral prompts as agents to\naugment the CLIP-based OOD detection process. These agents function as dynamic\nobservers and communication hubs, interacting with both In-distribution (ID)\nlabels and data inputs to form vector triangle relationships. This triangular\nframework offers a more nuanced approach than the traditional binary\nrelationship, allowing for better separation and identification of ID and OOD\ninputs. Our extensive experimental results showcase the superior performance of\nCMA over both zero-shot and training-required methods in a diverse array of\nreal-world scenarios.", "paper_summary_zh": "大型語言模型 (LLM) 的顯著成就吸引了學術界和產業的關注，超越了它們最初在對話生成中的角色。將 LLM 作為各種任務中的中介代理的使用產生了有希望的結果，引發了人工智慧創新浪潮。在這些突破的基礎上，我們引入了一種新方法，將代理範例整合到分布外 (OOD) 檢測任務中，旨在增強其穩健性和適應性。我們提出的方法，概念匹配代理 (CMA)，使用中立提示作為代理來擴充基於 CLIP 的 OOD 檢測過程。這些代理作為動態觀察者和通信中心，與分佈內 (ID) 標籤和數據輸入交互以形成向量三角形關係。這個三角形架構提供了一種比傳統二元關係更細緻的方法，允許更好地分離和識別 ID 和 OOD 輸入。我們廣泛的實驗結果展示了 CMA 在各種真實世界場景中優於零次學習和需要訓練的方法的卓越性能。", "author": "YuXiao Lee et.al.", "authors": "YuXiao Lee, Xiaofeng Cao", "id": "2405.16766v1", "paper_url": "http://arxiv.org/abs/2405.16766v1", "repo": "null"}}