{"2410.04941": {"publish_time": "2024-10-07", "title": "Detecting and Approximating Redundant Computational Blocks in Neural Networks", "paper_summary": "Deep neural networks often learn similar internal representations, both\nacross different models and within their own layers. While inter-network\nsimilarities have enabled techniques such as model stitching and merging,\nintra-network similarities present new opportunities for designing more\nefficient architectures. In this paper, we investigate the emergence of these\ninternal similarities across different layers in diverse neural architectures,\nshowing that similarity patterns emerge independently of the datataset used. We\nintroduce a simple metric, Block Redundancy, to detect redundant blocks,\nproviding a foundation for future architectural optimization methods. Building\non this, we propose Redundant Blocks Approximation (RBA), a general framework\nthat identifies and approximates one or more redundant computational blocks\nusing simpler transformations. We show that the transformation $\\mathcal{T}$\nbetween two representations can be efficiently computed in closed-form, and it\nis enough to replace the redundant blocks from the network. RBA reduces model\nparameters and time complexity while maintaining good performance. We validate\nour method on classification tasks in the vision domain using a variety of\npretrained foundational models and datasets.", "paper_summary_zh": "深度神经网络通常会学习相似的内部表示，无论是在不同模型之间还是在其自身的层内。虽然网络间相似性已使模型拼接和合并等技术成为可能，但网络内相似性为设计更有效的架构提供了新的机会。在本文中，我们调查了在不同神经架构的不同层中出现的这些内部相似性，表明相似性模式独立于所使用的数据集而出现。我们引入了一个简单的度量标准，即块冗余，以检测冗余块，为未来的架构优化方法奠定基础。在此基础上，我们提出了冗余块近似 (RBA)，这是一个通用框架，它使用更简单的变换来识别和近似一个或多个冗余计算块。我们表明，两个表示之间的变换$\\mathcal{T}$可以在封闭形式中有效计算，并且足以替换网络中的冗余块。RBA 减少了模型参数和时间复杂度，同时保持了良好的性能。我们使用各种预训练基础模型和数据集对视觉域中的分类任务验证了我们的方法。", "author": "Irene Cannistraci et.al.", "authors": "Irene Cannistraci, Emanuele Rodolà, Bastian Rieck", "id": "2410.04941v1", "paper_url": "http://arxiv.org/abs/2410.04941v1", "repo": "null"}}