{"2406.06144": {"publish_time": "2024-06-10", "title": "Language Models Resist Alignment", "paper_summary": "Large language models (LLMs) may exhibit undesirable behaviors. Recent\nefforts have focused on aligning these models to prevent harmful generation.\nDespite these efforts, studies have shown that even a well-conducted alignment\nprocess can be easily circumvented, whether intentionally or accidentally. Do\nalignment fine-tuning have robust effects on models, or are merely superficial?\nIn this work, we answer this question through both theoretical and empirical\nmeans. Empirically, we demonstrate the elasticity of post-alignment models,\ni.e., the tendency to revert to the behavior distribution formed during the\npre-training phase upon further fine-tuning. Using compression theory, we\nformally derive that such fine-tuning process \\textit{disproportionately}\nundermines alignment compared to pre-training, potentially by orders of\nmagnitude. We conduct experimental validations to confirm the presence of\nelasticity across models of varying types and sizes. Specifically, we find that\nmodel performance declines rapidly before reverting to the pre-training\ndistribution, after which the rate of decline drops significantly. We further\nreveal that elasticity positively correlates with increased model size and the\nexpansion of pre-training data. Our discovery signifies the importance of\ntaming the inherent elasticity of LLMs, thereby overcoming the resistance of\nLLMs to alignment finetuning.", "paper_summary_zh": "大型語言模型 (LLM) 可能會表現出不良行為。最近的努力集中於調整這些模型以防止有害生成。儘管有這些努力，研究表明，即使是進行良好的調整過程，也可能在有意或無意間輕易地被迴避。調整微調對模型有強大的影響，還是僅僅是表面上的？在這項工作中，我們通過理論和經驗方法回答這個問題。經驗上，我們展示了後調整模型的彈性，即在進一步微調時恢復到預訓練階段形成的行為分佈的趨勢。使用壓縮理論，我們正式推導出這種微調過程與預訓練相比，對齊方式的影響「不成比例」，可能達到數量級。我們進行實驗驗證以確認各種類型和規模的模型中彈性的存在。具體來說，我們發現模型性能在恢復到預訓練分佈之前迅速下降，之後下降率顯著下降。我們進一步揭示彈性與模型尺寸的增加和預訓練數據的擴展呈正相關。我們的發現表明馴服 LLM 固有的彈性非常重要，從而克服了 LLM 對調整微調的抵抗力。", "author": "Jiaming Ji et.al.", "authors": "Jiaming Ji, Kaile Wang, Tianyi Qiu, Boyuan Chen, Jiayi Zhou, Changye Li, Hantao Lou, Yaodong Yang", "id": "2406.06144v1", "paper_url": "http://arxiv.org/abs/2406.06144v1", "repo": "null"}}