{"2411.14808": {"publish_time": "2024-11-22", "title": "High-Resolution Image Synthesis via Next-Token Prediction", "paper_summary": "Denoising with a Joint-Embedding Predictive Architecture (D-JEPA), an\nautoregressive model, has demonstrated outstanding performance in\nclass-conditional image generation. However, the application of next-token\nprediction in high-resolution text-to-image generation remains underexplored.\nIn this paper, we introduce D-JEPA$\\cdot$T2I, an extension of D-JEPA\nincorporating flow matching loss, designed to enable data-efficient continuous\nresolution learning. D-JEPA$\\cdot$T2I leverages a multimodal visual transformer\nto effectively integrate textual and visual features and adopts Visual Rotary\nPositional Embedding (VoPE) to facilitate continuous resolution learning.\nFurthermore, we devise a data feedback mechanism that significantly enhances\ndata utilization efficiency. For the first time, we achieve state-of-the-art\n\\textbf{high-resolution} image synthesis via next-token prediction.\n  The experimental code and pretrained models will be open-sourced at\n\\url{https://d-jepa.github.io/t2i}.", "paper_summary_zh": "使用联合嵌入预测架构 (D-JEPA) 进行去噪，一种自回归模型，已在类别条件图像生成中展示了出色的性能。然而，在高分辨率文本到图像生成中使用下一个标记预测仍然未被充分探索。在本文中，我们介绍了 D-JEPA⋅T2I，它是 D-JEPA 的一个扩展，集成了流匹配损失，旨在实现数据高效的连续分辨率学习。D-JEPA⋅T2I 利用多模态视觉转换器有效地整合文本和视觉特征，并采用视觉旋转位置嵌入 (VoPE) 来促进连续分辨率学习。此外，我们设计了一种数据反馈机制，可以显著提高数据利用效率。我们首次通过下一个标记预测实现了最先进的\\textbf{高分辨率}图像合成。实验代码和预训练模型将在 \\url{https://d-jepa.github.io/t2i} 开源。", "author": "Dengsheng Chen et.al.", "authors": "Dengsheng Chen, Jie Hu, Tiezhu Yue, Xiaoming Wei", "id": "2411.14808v1", "paper_url": "http://arxiv.org/abs/2411.14808v1", "repo": "null"}}