{"2406.06382": {"publish_time": "2024-06-10", "title": "Diffusion-RPO: Aligning Diffusion Models through Relative Preference Optimization", "paper_summary": "Aligning large language models with human preferences has emerged as a\ncritical focus in language modeling research. Yet, integrating preference\nlearning into Text-to-Image (T2I) generative models is still relatively\nuncharted territory. The Diffusion-DPO technique made initial strides by\nemploying pairwise preference learning in diffusion models tailored for\nspecific text prompts. We introduce Diffusion-RPO, a new method designed to\nalign diffusion-based T2I models with human preferences more effectively. This\napproach leverages both prompt-image pairs with identical prompts and those\nwith semantically related content across various modalities. Furthermore, we\nhave developed a new evaluation metric, style alignment, aimed at overcoming\nthe challenges of high costs, low reproducibility, and limited interpretability\nprevalent in current evaluations of human preference alignment. Our findings\ndemonstrate that Diffusion-RPO outperforms established methods such as\nSupervised Fine-Tuning and Diffusion-DPO in tuning Stable Diffusion versions\n1.5 and XL-1.0, achieving superior results in both automated evaluations of\nhuman preferences and style alignment. Our code is available at\nhttps://github.com/yigu1008/Diffusion-RPO", "paper_summary_zh": "将大型语言模型与人类偏好相结合已成为语言建模研究中的一个关键焦点。然而，将偏好学习整合到文本到图像（T2I）生成模型中仍然是一个相对未知的领域。Diffusion-DPO 技术通过在针对特定文本提示定制的扩散模型中采用成对偏好学习，取得了初步进展。我们引入了 Diffusion-RPO，这是一种旨在更有效地将基于扩散的 T2I 模型与人类偏好相结合的新方法。这种方法同时利用了具有相同提示的提示图像对和跨各种模态具有语义相关内容的提示图像对。此外，我们开发了一种新的评估指标——风格对齐，旨在克服当前人类偏好对齐评估中普遍存在的高成本、低可重复性和有限的可解释性等挑战。我们的研究结果表明，Diffusion-RPO 在调整 Stable Diffusion 版本 1.5 和 XL-1.0 时优于已建立的方法，例如监督微调和 Diffusion-DPO，在人类偏好的自动化评估和风格对齐方面都取得了更好的结果。我们的代码可在 https://github.com/yigu1008/Diffusion-RPO 获得", "author": "Yi Gu et.al.", "authors": "Yi Gu, Zhendong Wang, Yueqin Yin, Yujia Xie, Mingyuan Zhou", "id": "2406.06382v1", "paper_url": "http://arxiv.org/abs/2406.06382v1", "repo": "https://github.com/yigu1008/diffusion-rpo"}}