{"2412.09751": {"publish_time": "2024-12-12", "title": "AI Red-Teaming is a Sociotechnical System. Now What?", "paper_summary": "As generative AI technologies find more and more real-world applications, the\nimportance of testing their performance and safety seems paramount.\n``Red-teaming'' has quickly become the primary approach to test AI\nmodels--prioritized by AI companies, and enshrined in AI policy and regulation.\nMembers of red teams act as adversaries, probing AI systems to test their\nsafety mechanisms and uncover vulnerabilities. Yet we know too little about\nthis work and its implications. This essay calls for collaboration between\ncomputer scientists and social scientists to study the sociotechnical systems\nsurrounding AI technologies, including the work of red-teaming, to avoid\nrepeating the mistakes of the recent past. We highlight the importance of\nunderstanding the values and assumptions behind red-teaming, the labor\ninvolved, and the psychological impacts on red-teamers.", "paper_summary_zh": "隨著生成式 AI 技術在現實世界中找到越來越多的應用，測試其效能和安全性顯得至關重要。\n「紅隊」已迅速成為測試 AI 模型的主要方法，由 AI 公司優先考慮，並載入 AI 政策和法規中。\n紅隊成員扮演對手，探測 AI 系統以測試其安全機制並找出漏洞。然而，我們對這項工作及其影響所知甚少。本文呼籲電腦科學家和社會科學家合作研究圍繞 AI 技術的社會技術系統，包括紅隊工作，以避免重蹈近期錯誤。我們強調了解紅隊背後的價值觀和假設、所涉及的勞動力以及對紅隊成員的心理影響的重要性。", "author": "Tarleton Gillespie et.al.", "authors": "Tarleton Gillespie, Ryland Shaw, Mary L. Gray, Jina Suh", "id": "2412.09751v1", "paper_url": "http://arxiv.org/abs/2412.09751v1", "repo": "null"}}