{"2501.08134": {"publish_time": "2025-01-14", "title": "An Empirical Wall-Pressure Spectrum Model for Aeroacoustic Predictions Based on Symbolic Regression", "paper_summary": "Fast-turn around methods to predict airfoil trailing-edge noise are crucial\nfor incorporating noise limitations into design optimization loops of several\napplications. Among these aeroacoustic predictive models, Amiet's theory offers\nthe best balance between accuracy and simplicity. The accuracy of the model\nrelies heavily on precise wall-pressure spectrum predictions, which are often\nbased on single-equation formulations with adjustable parameters. These\nparameters are calibrated for particular airfoils and flow conditions and\nconsequently tend to fail when applied outside their calibration range. This\npaper introduces a new wall-pressure spectrum empirical model designed to\nenhance the robustness and accuracy of current state-of-the-art predictions\nwhile widening the range of applicability of the model to different airfoils\nand flow conditions. The model is developed using AI-based symbolic regression\nvia a genetic-algorithm-based approach, and applied to a dataset of\nwall-pressure fluctuations measured on NACA 0008 and NACA 63018 airfoils at\nmultiple angles of attack and inflow velocities, covering turbulent boundary\nlayers with both adverse and favorable pressure gradients. Validation against\nexperimental data (outside the training dataset) demonstrates the robustness of\nthe model compared to well-accepted semi-empirical models. Finally, the model\nis integrated with Amiet's theory to predict the aeroacoustic noise of a\nfull-scale wind turbine, showing good agreement with experimental measurements.", "paper_summary_zh": "預測翼型後緣噪音的快速週轉方法對於將噪音限制納入多種應用的設計最佳化迴圈至關重要。在這些空氣動力聲學預測模型中，Amiet 的理論在準確性和簡便性之間取得了最佳平衡。模型的準確性在很大程度上依賴於精確的壁壓譜預測，而這些預測通常基於具有可調整參數的單一方程式公式。這些參數經過校準以適應特定的翼型和流動條件，因此當應用於校準範圍之外時往往會失效。本文介紹了一個新的壁壓譜經驗模型，旨在增強當前最先進預測的穩健性和準確性，同時擴大模型對不同翼型和流動條件的適用範圍。該模型是通過基於遺傳演算法的方法使用基於 AI 的符號回歸開發的，並應用於在 NACA 0008 和 NACA 63018 翼型上測量的壁壓波動數據集，涵蓋具有不利和有利壓力梯度的湍流邊界層。與公認的半經驗模型相比，針對實驗數據（訓練數據集之外）的驗證證明了該模型的穩健性。最後，該模型與 Amiet 的理論相結合，以預測全尺寸風力渦輪機的空氣動力聲學噪音，顯示出與實驗測量結果的一致性。", "author": "Laura Botero Bolívar et.al.", "authors": "Laura Botero Bolívar, David Huergo, Fernanda L. dos Santos, Cornelis H. Venner, Leandro D. de Santana, Esteban Ferrer", "id": "2501.08134v1", "paper_url": "http://arxiv.org/abs/2501.08134v1", "repo": "null"}}