{"2406.06406": {"publish_time": "2024-06-10", "title": "Controlling Emotion in Text-to-Speech with Natural Language Prompts", "paper_summary": "In recent years, prompting has quickly become one of the standard ways of\nsteering the outputs of generative machine learning models, due to its\nintuitive use of natural language. In this work, we propose a system\nconditioned on embeddings derived from an emotionally rich text that serves as\nprompt. Thereby, a joint representation of speaker and prompt embeddings is\nintegrated at several points within a transformer-based architecture. Our\napproach is trained on merged emotional speech and text datasets and varies\nprompts in each training iteration to increase the generalization capabilities\nof the model. Objective and subjective evaluation results demonstrate the\nability of the conditioned synthesis system to accurately transfer the emotions\npresent in a prompt to speech. At the same time, precise tractability of\nspeaker identities as well as overall high speech quality and intelligibility\nare maintained.", "paper_summary_zh": "近年来，提示已迅速成为引导生成式机器学习模型输出的标准方式之一，因为它直观地使用了自然语言。在这项工作中，我们提出了一个系统，该系统以来自情感丰富的文本的嵌入为条件，该文本用作提示。因此，说话人和提示嵌入的联合表示在基于 Transformer 的架构中的几个点上被集成。我们的方法在合并的情感语音和文本数据集上进行训练，并在每次训练迭代中改变提示，以提高模型的泛化能力。客观和主观评估结果证明了条件合成系统将提示中存在的情绪准确地转移到语音中的能力。同时，保持了说话人身份的精确可追溯性以及整体高语音质量和可懂度。", "author": "Thomas Bott et.al.", "authors": "Thomas Bott, Florian Lux, Ngoc Thang Vu", "id": "2406.06406v1", "paper_url": "http://arxiv.org/abs/2406.06406v1", "repo": "null"}}