{"2410.08972": {"publish_time": "2024-10-11", "title": "ALVIN: Active Learning Via INterpolation", "paper_summary": "Active Learning aims to minimize annotation effort by selecting the most\nuseful instances from a pool of unlabeled data. However, typical active\nlearning methods overlook the presence of distinct example groups within a\nclass, whose prevalence may vary, e.g., in occupation classification datasets\ncertain demographics are disproportionately represented in specific classes.\nThis oversight causes models to rely on shortcuts for predictions, i.e.,\nspurious correlations between input attributes and labels occurring in\nwell-represented groups. To address this issue, we propose Active Learning Via\nINterpolation (ALVIN), which conducts intra-class interpolations between\nexamples from under-represented and well-represented groups to create anchors,\ni.e., artificial points situated between the example groups in the\nrepresentation space. By selecting instances close to the anchors for\nannotation, ALVIN identifies informative examples exposing the model to regions\nof the representation space that counteract the influence of shortcuts.\nCrucially, since the model considers these examples to be of high certainty,\nthey are likely to be ignored by typical active learning methods. Experimental\nresults on six datasets encompassing sentiment analysis, natural language\ninference, and paraphrase detection demonstrate that ALVIN outperforms\nstate-of-the-art active learning methods in both in-distribution and\nout-of-distribution generalization.", "paper_summary_zh": "主動學習旨在透過從未標記資料庫中選取最有用的實例來最小化標記工作。然而，典型的主動學習方法忽略了類別中不同範例群組的存在，這些群組的流行程度可能有所不同，例如，在職業分類資料集中，某些人口統計資料在特定類別中過度呈現。這種疏忽導致模型依賴捷徑來進行預測，也就是說，在有良好代表性的群組中，輸入屬性和標籤之間出現虛假的相關性。為了解決這個問題，我們提出透過內插進行主動學習 (ALVIN)，它在代表性不足和代表性良好的群組中的範例之間進行類內插值，以建立錨點，也就是說，位於表示空間中範例群組之間的人工點。透過選擇接近錨點的實例進行標記，ALVIN 識別出具有資訊性的範例，將模型暴露在表示空間中對抗捷徑影響的區域。至關重要的是，由於模型認為這些範例具有高度確定性，因此它們很可能會被典型的主動學習方法所忽略。在涵蓋情緒分析、自然語言推論和同義詞偵測的六個資料集上的實驗結果證明，ALVIN 在分佈內和分佈外概化方面都優於最先進的主動學習方法。", "author": "Michalis Korakakis et.al.", "authors": "Michalis Korakakis, Andreas Vlachos, Adrian Weller", "id": "2410.08972v1", "paper_url": "http://arxiv.org/abs/2410.08972v1", "repo": "null"}}