{"2411.08514": {"publish_time": "2024-11-13", "title": "Explainers' Mental Representations of Explainees' Needs in Everyday Explanations", "paper_summary": "In explanations, explainers have mental representations of explainees'\ndeveloping knowledge and shifting interests regarding the explanandum. These\nmental representations are dynamic in nature and develop over time, thereby\nenabling explainers to react to explainees' needs by adapting and customizing\nthe explanation. XAI should be able to react to explainees' needs in a similar\nmanner. Therefore, a component that incorporates aspects of explainers' mental\nrepresentations of explainees is required. In this study, we took first steps\nby investigating explainers' mental representations in everyday explanations of\ntechnological artifacts. According to the dual nature theory, technological\nartifacts require explanations with two distinct perspectives, namely\nobservable and measurable features addressing \"Architecture\" or interpretable\naspects addressing \"Relevance\". We conducted extended semi structured pre-,\npost- and video recall-interviews with explainers (N=9) in the context of an\nexplanation. The transcribed interviews were analyzed utilizing qualitative\ncontent analysis. The explainers' answers regarding the explainees' knowledge\nand interests with regard to the technological artifact emphasized the\nvagueness of early assumptions of explainers toward strong beliefs in the\ncourse of explanations. The assumed knowledge of explainees in the beginning is\ncentered around Architecture and develops toward knowledge with regard to both\nArchitecture and Relevance. In contrast, explainers assumed higher interests in\nRelevance in the beginning to interests regarding both Architecture and\nRelevance in the further course of explanations. Further, explainers often\nfinished the explanation despite their perception that explainees still had\ngaps in knowledge. These findings are transferred into practical implications\nrelevant for user models for adaptive explainable systems.", "paper_summary_zh": "<paragraph>在說明中，說明者會在心智中建構被說明者的知識發展與對被說明對象的興趣轉變。這些心智建構本質上是動態的，並會隨著時間發展，因此能讓說明者透過調整和客製化說明來回應被說明者的需求。XAI 應能以類似的方式回應被說明者的需求。因此，需要一個元件將說明者對被說明者的心智建構面向納入其中。在這項研究中，我們透過探討說明者在日常技術製品說明中的心智建構，踏出了第一步。根據二元本質理論，技術製品需要從兩個不同觀點來進行說明，也就是說明「架構」的可觀察和可衡量特徵，或說明「關聯性」的可詮釋面向。我們在說明的脈絡中，對說明者 (N=9) 進行了擴充的半結構化事前、事後和影片回憶訪談。我們利用定性內容分析法來分析轉錄後的訪談。說明者針對被說明者對技術製品的知識和興趣的回答，強調了說明者在說明過程中，從早期的模糊假設轉變為堅定信念的過程。說明者在開始時假設的知識以架構為中心，並發展為同時具備架構和關聯性的知識。相反地，說明者在開始時假設較高的關聯性興趣，而在說明的過程中轉變為同時對架構和關聯性感興趣。此外，說明者即使認為被說明者在知識上仍有落差，也常常會結束說明。這些發現轉化為與適應性可解釋系統使用者模型相關的實務意涵。</paragraph>", "author": "Michael Erol Schaffer et.al.", "authors": "Michael Erol Schaffer, Lutz Terfloth, Carsten Schulte, Heike M. Buhl", "id": "2411.08514v1", "paper_url": "http://arxiv.org/abs/2411.08514v1", "repo": "null"}}