{"2409.02760": {"publish_time": "2024-09-04", "title": "An incremental preference elicitation-based approach to learning potentially non-monotonic preferences in multi-criteria sorting", "paper_summary": "This paper introduces a novel incremental preference elicitation-based\napproach to learning potentially non-monotonic preferences in multi-criteria\nsorting (MCS) problems, enabling decision makers to progressively provide\nassignment example preference information. Specifically, we first construct a\nmax-margin optimization-based model to model potentially non-monotonic\npreferences and inconsistent assignment example preference information in each\niteration of the incremental preference elicitation process. Using the optimal\nobjective function value of the max-margin optimization-based model, we devise\ninformation amount measurement methods and question selection strategies to\npinpoint the most informative alternative in each iteration within the\nframework of uncertainty sampling in active learning. Once the termination\ncriterion is satisfied, the sorting result for non-reference alternatives can\nbe determined through the use of two optimization models, i.e., the max-margin\noptimization-based model and the complexity controlling optimization model.\nSubsequently, two incremental preference elicitation-based algorithms are\ndeveloped to learn potentially non-monotonic preferences, considering different\ntermination criteria. Ultimately, we apply the proposed approach to a credit\nrating problem to elucidate the detailed implementation steps, and perform\ncomputational experiments on both artificial and real-world data sets to\ncompare the proposed question selection strategies with several benchmark\nstrategies.", "paper_summary_zh": "本文提出了一種基於漸進偏好引導的創新方法，用於學習多準則排序 (MCS) 問題中潛在的非單調偏好，使決策者能夠逐步提供指派範例偏好資訊。具體而言，我們首先建構一個基於最大邊際優化的模型，以建模在漸進偏好引導過程的每次反覆運算中潛在的非單調偏好和不一致的指派範例偏好資訊。使用基於最大邊際優化的模型的最佳目標函數值，我們設計資訊量測量方法和問題選擇策略，以在主動學習的不確定性抽樣架構中精確找出每次反覆運算中最具資訊性的替代方案。一旦滿足終止準則，就可以透過使用兩個最佳化模型（即基於最大邊際優化的模型和複雜度控制最佳化模型）來確定非參考替代方案的排序結果。隨後，開發了兩種基於漸進偏好引導的演算法來學習潛在的非單調偏好，考量不同的終止準則。最後，我們將提出的方法應用於信用評級問題，以闡明詳細的實作步驟，並針對人工和真實世界資料集執行運算實驗，以將提出的問題選擇策略與多個基準策略進行比較。", "author": "Zhuolin Li et.al.", "authors": "Zhuolin Li, Zhen Zhang, Witold Pedrycz", "id": "2409.02760v1", "paper_url": "http://arxiv.org/abs/2409.02760v1", "repo": "null"}}