{"2405.13099": {"publish_time": "2024-05-21", "title": "The Role of Emotions in Informational Support Question-Response Pairs in Online Health Communities: A Multimodal Deep Learning Approach", "paper_summary": "This study explores the relationship between informational support seeking\nquestions, responses, and helpfulness ratings in online health communities. We\ncreated a labeled data set of question-response pairs and developed multimodal\nmachine learning and deep learning models to reliably predict informational\nsupport questions and responses. We employed explainable AI to reveal the\nemotions embedded in informational support exchanges, demonstrating the\nimportance of emotion in providing informational support. This complex\ninterplay between emotional and informational support has not been previously\nresearched. The study refines social support theory and lays the groundwork for\nthe development of user decision aids. Further implications are discussed.", "paper_summary_zh": "本研究探討線上健康社群中尋求資訊支持的問題、回應，以及有幫助的評分之間的關係。我們建立了一組標記的問答配對資料集，並開發了多模態機器學習和深度學習模型，以可靠地預測資訊支持問題和回應。我們採用可解釋的 AI 來揭示資訊支持交流中蘊含的情緒，證明情緒在提供資訊支持中的重要性。這種情緒支持和資訊支持之間的複雜交互作用以前並未被研究過。本研究改進了社會支持理論，並為使用者決策輔助工具的開發奠定了基礎。討論了進一步的影響。", "author": "Mohsen Jozani et.al.", "authors": "Mohsen Jozani, Jason A. Williams, Ahmed Aleroud, Sarbottam Bhagat", "id": "2405.13099v1", "paper_url": "http://arxiv.org/abs/2405.13099v1", "repo": "null"}}