{"2409.10889": {"publish_time": "2024-09-17", "title": "Shaking the Fake: Detecting Deepfake Videos in Real Time via Active Probes", "paper_summary": "Real-time deepfake, a type of generative AI, is capable of \"creating\"\nnon-existing contents (e.g., swapping one's face with another) in a video. It\nhas been, very unfortunately, misused to produce deepfake videos (during web\nconferences, video calls, and identity authentication) for malicious purposes,\nincluding financial scams and political misinformation. Deepfake detection, as\nthe countermeasure against deepfake, has attracted considerable attention from\nthe academic community, yet existing works typically rely on learning passive\nfeatures that may perform poorly beyond seen datasets. In this paper, we\npropose SFake, a new real-time deepfake detection method that innovatively\nexploits deepfake models' inability to adapt to physical interference.\nSpecifically, SFake actively sends probes to trigger mechanical vibrations on\nthe smartphone, resulting in the controllable feature on the footage.\nConsequently, SFake determines whether the face is swapped by deepfake based on\nthe consistency of the facial area with the probe pattern. We implement SFake,\nevaluate its effectiveness on a self-built dataset, and compare it with six\nother detection methods. The results show that SFake outperforms other\ndetection methods with higher detection accuracy, faster process speed, and\nlower memory consumption.", "paper_summary_zh": "即時深度偽造是一種生成式 AI，能夠「創造」影片中不存在的內容（例如，將某人的臉換成另一個人）。不幸的是，它已被濫用於製作深度偽造影片（在網路會議、視訊通話和身分驗證中），用於惡意目的，包括金融詐騙和政治錯誤訊息。深度偽造偵測作為對抗深度偽造的對策，已引起學術界的廣泛關注，但現有的作品通常依賴於學習被動特徵，這些特徵在超出已見資料集時可能會表現不佳。在本文中，我們提出 SFake，這是一種新的即時深度偽造偵測方法，創新地利用深度偽造模型無法適應物理干擾的特性。具體來說，SFake 主動發送探針以觸發智慧型手機上的機械振動，從而導致影片中可控的特徵。因此，SFake 根據臉部區域與探針模式的一致性來判斷臉部是否被深度偽造替換。我們實作 SFake，評估其在自建資料集上的有效性，並將其與其他六種偵測方法進行比較。結果表明，SFake 在更高的偵測準確度、更快的處理速度和更低的記憶體消耗方面優於其他偵測方法。", "author": "Zhixin Xie et.al.", "authors": "Zhixin Xie, Jun Luo", "id": "2409.10889v1", "paper_url": "http://arxiv.org/abs/2409.10889v1", "repo": "null"}}