{"2405.19186": {"publish_time": "2024-05-29", "title": "MetaToken: Detecting Hallucination in Image Descriptions by Meta Classification", "paper_summary": "Large Vision Language Models (LVLMs) have shown remarkable capabilities in\nmultimodal tasks like visual question answering or image captioning. However,\ninconsistencies between the visual information and the generated text, a\nphenomenon referred to as hallucinations, remain an unsolved problem with\nregard to the trustworthiness of LVLMs. To address this problem, recent works\nproposed to incorporate computationally costly Large (Vision) Language Models\nin order to detect hallucinations on a sentence- or subsentence-level. In this\nwork, we introduce MetaToken, a lightweight binary classifier to detect\nhallucinations on the token-level at negligible cost. Based on a statistical\nanalysis, we reveal key factors of hallucinations in LVLMs which have been\noverseen in previous works. MetaToken can be applied to any open-source LVLM\nwithout any knowledge about ground truth data providing a reliable detection of\nhallucinations. We evaluate our method on four state-of-the-art LVLMs\ndemonstrating the effectiveness of our approach.", "paper_summary_zh": "大型視覺語言模型 (LVLMs) 在視覺問答或圖片標題等多模態任務中展現了卓越的能力。然而，視覺資訊和產生的文字之間的不一致，也就是所謂的幻覺現象，仍然是 LVLMs 可信度方面未解決的問題。為了解決這個問題，最近的研究建議結合計算成本高昂的大型 (視覺) 語言模型，以便在句子或子句層級偵測幻覺。在這項研究中，我們引入了 MetaToken，一個輕量級的二元分類器，可以在不增加成本的情況下，在代幣層級偵測幻覺。根據統計分析，我們揭露了 LVLMs 中幻覺的主要因素，這些因素在先前的研究中被忽略了。MetaToken 可以應用於任何開源 LVLM，而無需任何關於基本事實資料的知識，從而提供可靠的幻覺偵測。我們在四個最先進的 LVLMs 上評估了我們的模型，證明了我們方法的有效性。", "author": "Laura Fieback et.al.", "authors": "Laura Fieback, Jakob Spiegelberg, Hanno Gottschalk", "id": "2405.19186v1", "paper_url": "http://arxiv.org/abs/2405.19186v1", "repo": "null"}}