{"2412.15189": {"publish_time": "2024-12-19", "title": "Face the Facts! Evaluating RAG-based Fact-checking Pipelines in Realistic Settings", "paper_summary": "Natural Language Processing and Generation systems have recently shown the\npotential to complement and streamline the costly and time-consuming job of\nprofessional fact-checkers. In this work, we lift several constraints of\ncurrent state-of-the-art pipelines for automated fact-checking based on the\nRetrieval-Augmented Generation (RAG) paradigm. Our goal is to benchmark, under\nmore realistic scenarios, RAG-based methods for the generation of verdicts -\ni.e., short texts discussing the veracity of a claim - evaluating them on\nstylistically complex claims and heterogeneous, yet reliable, knowledge bases.\nOur findings show a complex landscape, where, for example, LLM-based retrievers\noutperform other retrieval techniques, though they still struggle with\nheterogeneous knowledge bases; larger models excel in verdict faithfulness,\nwhile smaller models provide better context adherence, with human evaluations\nfavouring zero-shot and one-shot approaches for informativeness, and fine-tuned\nmodels for emotional alignment.", "paper_summary_zh": "自然語言處理和生成系統最近已展現出補充和簡化專業事實查核員昂貴且耗時的任務的潛力。在這項工作中，我們解除了基於檢索增強生成 (RAG) 典範的當前最先進自動事實查核管線的若干限制。我們的目標是在更實際的場景下，對基於 RAG 的方法進行基準測試，以生成判決 - 即討論說法真實性的簡短文字 - 在風格複雜的說法和異質但可靠的知識庫上對其進行評估。我們的研究結果顯示了一個複雜的環境，例如，基於 LLM 的檢索器優於其他檢索技術，儘管它們仍難以應對異質知識庫；較大的模型在判決忠實度方面表現出色，而較小的模型則提供更好的上下文依附性，人類評估偏好零次學習和一次學習方法以獲取信息，並微調模型以進行情緒對齊。", "author": "Daniel Russo et.al.", "authors": "Daniel Russo, Stefano Menini, Jacopo Staiano, Marco Guerini", "id": "2412.15189v1", "paper_url": "http://arxiv.org/abs/2412.15189v1", "repo": "https://github.com/drusso98/face-the-facts"}}