{"2405.01259": {"publish_time": "2024-05-02", "title": "Identification of Entailment and Contradiction Relations between Natural Language Sentences: A Neurosymbolic Approach", "paper_summary": "Natural language inference (NLI), also known as Recognizing Textual\nEntailment (RTE), is an important aspect of natural language understanding.\nMost research now uses machine learning and deep learning to perform this task\non specific datasets, meaning their solution is not explainable nor explicit.\nTo address the need for an explainable approach to RTE, we propose a novel\npipeline that is based on translating text into an Abstract Meaning\nRepresentation (AMR) graph. For this we use a pre-trained AMR parser. We then\ntranslate the AMR graph into propositional logic and use a SAT solver for\nautomated reasoning. In text, often commonsense suggests that an entailment (or\ncontradiction) relationship holds between a premise and a claim, but because\ndifferent wordings are used, this is not identified from their logical\nrepresentations. To address this, we introduce relaxation methods to allow\nreplacement or forgetting of some propositions. Our experimental results show\nthis pipeline performs well on four RTE datasets.", "paper_summary_zh": "自然語言推論 (NLI)，也稱為識別文本蘊涵關係 (RTE)，是自然語言理解的重要面向。\n目前大多數的研究使用機器學習和深度學習在特定資料集上執行這項任務，這表示他們的解決方案無法解釋或明確說明。\n為了滿足 RTE 可解釋方法的需求，我們提出一個新穎的管道，其基礎是將文字轉換為抽象意義表示 (AMR) 圖表。為此，我們使用預先訓練好的 AMR 解析器。接著，我們將 AMR 圖表轉換為命題邏輯，並使用 SAT 求解器進行自動推理。在文字中，常識通常會暗示前提和主張之間存在蘊涵（或矛盾）關係，但由於使用了不同的措辭，因此無法從其邏輯表示中辨識出來。為了解決這個問題，我們引進放鬆方法，允許替換或遺忘某些命題。我們的實驗結果顯示，這個管道在四個 RTE 資料集上表現良好。", "author": "Xuyao Feng et.al.", "authors": "Xuyao Feng, Anthony Hunter", "id": "2405.01259v1", "paper_url": "http://arxiv.org/abs/2405.01259v1", "repo": "null"}}