{"2408.00274": {"publish_time": "2024-08-01", "title": "QUITO: Accelerating Long-Context Reasoning through Query-Guided Context Compression", "paper_summary": "In-context learning (ICL) capabilities are foundational to the success of\nlarge language models (LLMs). Recently, context compression has attracted\ngrowing interest since it can largely reduce reasoning complexities and\ncomputation costs of LLMs. In this paper, we introduce a novel Query-gUIded\naTtention cOmpression (QUITO) method, which leverages attention of the question\nover the contexts to filter useless information. Specifically, we take a\ntrigger token to calculate the attention distribution of the context in\nresponse to the question. Based on the distribution, we propose three different\nfiltering methods to satisfy the budget constraints of the context length. We\nevaluate the QUITO using two widely-used datasets, namely, NaturalQuestions and\nASQA. Experimental results demonstrate that QUITO significantly outperforms\nestablished baselines across various datasets and downstream LLMs, underscoring\nits effectiveness. Our code is available at\nhttps://github.com/Wenshansilvia/attention_compressor.", "paper_summary_zh": "脈絡學習 (ICL) 能力是大型語言模型 (LLM) 成功發展的基礎。最近，脈絡壓縮引起了越來越多的關注，因為它可以大幅降低 LLM 的推理複雜度和計算成本。在本文中，我們介紹了一種新穎的 Query 引導式注意力壓縮 (QUITO) 方法，它利用問題對脈絡的關注來過濾無用的資訊。具體來說，我們採用觸發詞彙來計算脈絡在回應問題時的注意力分佈。根據分佈，我們提出三種不同的過濾方法來滿足脈絡長度的預算限制。我們使用兩個廣泛使用的資料集，即 NaturalQuestions 和 ASQA，來評估 QUITO。實驗結果表明，QUITO 在各種資料集和下游 LLM 中都明顯優於已建立的基準，突顯了其有效性。我們的程式碼可在 https://github.com/Wenshansilvia/attention_compressor 取得。", "author": "Wenshan Wang et.al.", "authors": "Wenshan Wang, Yihang Wang, Yixing Fan, Huaming Liao, Jiafeng Guo", "id": "2408.00274v1", "paper_url": "http://arxiv.org/abs/2408.00274v1", "repo": "null"}}