{"2406.18845": {"publish_time": "2024-06-27", "title": "Retain, Blend, and Exchange: A Quality-aware Spatial-Stereo Fusion Approach for Event Stream Recognition", "paper_summary": "Existing event stream-based pattern recognition models usually represent the\nevent stream as the point cloud, voxel, image, etc., and design various deep\nneural networks to learn their features. Although considerable results can be\nachieved in simple cases, however, the model performance may be limited by\nmonotonous modality expressions, sub-optimal fusion, and readout mechanisms. In\nthis paper, we propose a novel dual-stream framework for event stream-based\npattern recognition via differentiated fusion, termed EFV++. It models two\ncommon event representations simultaneously, i.e., event images and event\nvoxels. The spatial and three-dimensional stereo information can be learned\nseparately by utilizing Transformer and Graph Neural Network (GNN). We believe\nthe features of each representation still contain both efficient and redundant\nfeatures and a sub-optimal solution may be obtained if we directly fuse them\nwithout differentiation. Thus, we divide each feature into three levels and\nretain high-quality features, blend medium-quality features, and exchange\nlow-quality features. The enhanced dual features will be fed into the fusion\nTransformer together with bottleneck features. In addition, we introduce a\nnovel hybrid interaction readout mechanism to enhance the diversity of features\nas final representations. Extensive experiments demonstrate that our proposed\nframework achieves state-of-the-art performance on multiple widely used event\nstream-based classification datasets. Specifically, we achieve new\nstate-of-the-art performance on the Bullying10k dataset, i.e., $90.51\\%$, which\nexceeds the second place by $+2.21\\%$. The source code of this paper has been\nreleased on\n\\url{https://github.com/Event-AHU/EFV_event_classification/tree/EFVpp}.", "paper_summary_zh": "現有的基於事件串流的模式辨識模型通常將事件串流表示為點雲、體素、影像等，並設計各種深度神經網路來學習其特徵。儘管在簡單案例中可以獲得相當的結果，但模型效能可能會受到單調的模態表達、次佳融合和讀出機制的限制。在本文中，我們提出了一個新的雙串流架構，用於透過差異化融合進行基於事件串流的模式辨識，稱為 EFV++。它同時建模了兩種常見的事件表示，即事件影像和事件體素。空間和三維立體資訊可以透過使用 Transformer 和圖神經網路 (GNN) 分別學習。我們相信每個表示的特徵仍然包含有效和冗餘的特徵，如果我們在沒有區分的情況下直接融合它們，可能會獲得次佳的解決方案。因此，我們將每個特徵分成三個層級，並保留高品質特徵、混合中品質特徵，並交換低品質特徵。增強的雙重特徵將與瓶頸特徵一起輸入融合 Transformer。此外，我們引入了一個新的混合互動讀出機制，以增強特徵的多樣性作為最終表示。廣泛的實驗證明，我們提出的架構在多個廣泛使用的基於事件串流的分類資料集上達到了最先進的效能。具體來說，我們在 Bullying10k 資料集上達到了新的最先進效能，即 90.51%，比第二名高出 +2.21%。本文的原始程式碼已在 https://github.com/Event-AHU/EFV_event_classification/tree/EFVpp 上發布。", "author": "Lan Chen et.al.", "authors": "Lan Chen, Dong Li, Xiao Wang, Pengpeng Shao, Wei Zhang, Yaowei Wang, Yonghong Tian, Jin Tang", "id": "2406.18845v1", "paper_url": "http://arxiv.org/abs/2406.18845v1", "repo": "https://github.com/event-ahu/efv_event_classification"}}