{"2405.14768": {"publish_time": "2024-05-23", "title": "WISE: Rethinking the Knowledge Memory for Lifelong Model Editing of Large Language Models", "paper_summary": "Large language models (LLMs) need knowledge updates to meet the ever-growing\nworld facts and correct the hallucinated responses, facilitating the methods of\nlifelong model editing. Where the updated knowledge resides in memories is a\nfundamental question for model editing. In this paper, we find that editing\neither long-term memory (direct model parameters) or working memory\n(non-parametric knowledge of neural network activations/representations by\nretrieval) will result in an impossible triangle -- reliability,\ngeneralization, and locality can not be realized together in the lifelong\nediting settings. For long-term memory, directly editing the parameters will\ncause conflicts with irrelevant pretrained knowledge or previous edits (poor\nreliability and locality). For working memory, retrieval-based activations can\nhardly make the model understand the edits and generalize (poor\ngeneralization). Therefore, we propose WISE to bridge the gap between memories.\nIn WISE, we design a dual parametric memory scheme, which consists of the main\nmemory for the pretrained knowledge and a side memory for the edited knowledge.\nWe only edit the knowledge in the side memory and train a router to decide\nwhich memory to go through when given a query. For continual editing, we devise\na knowledge-sharding mechanism where different sets of edits reside in distinct\nsubspaces of parameters, and are subsequently merged into a shared memory\nwithout conflicts. Extensive experiments show that WISE can outperform previous\nmodel editing methods and overcome the impossible triangle under lifelong model\nediting of question answering, hallucination, and out-of-distribution settings\nacross trending LLM architectures, e.g., GPT, LLaMA, and Mistral. Code will be\nreleased at https://github.com/zjunlp/EasyEdit.", "paper_summary_zh": "大型語言模型 (LLM) 需要知識更新才能滿足不斷增長的\n世界事實並修正虛構的回應，促進終身模型編輯的方法。更新的知識存放在哪個記憶體中是\n模型編輯的基本問題。在本文中，我們發現編輯\n長期記憶（直接模型參數）或工作記憶\n（神經網路激活/表示的非參數知識，透過擷取）將導致不可能三角——可靠性、\n概化和局部性無法在終身\n編輯設定中同時實現。對於長期記憶，直接編輯參數將\n會與不相關的預訓練知識或先前的編輯產生衝突（可靠性和局部性不佳）。對於工作記憶，基於擷取的激活難以讓模型了解編輯並概化（概化不佳）。因此，我們提出 WISE 來彌補記憶之間的差距。\n在 WISE 中，我們設計了一個雙參數記憶架構，其中包含用於預訓練知識的主記憶體和用於編輯知識的側邊記憶體。\n我們只編輯側邊記憶體中的知識，並訓練一個路由器來決定在給定查詢時要通過哪個記憶體。對於持續編輯，我們設計了一個知識分片機制，其中不同的編輯組位於參數的不同子空間中，然後合併到一個共用記憶體中，而不會發生衝突。大量的實驗表明，WISE 可以優於先前的\n模型編輯方法，並在問題解答、虛構和趨勢 LLM 架構（例如 GPT、LLaMA 和 Mistral）的分布外設定下的終身模型編輯中克服不可能三角。程式碼將於 https://github.com/zjunlp/EasyEdit 發布。", "author": "Peng Wang et.al.", "authors": "Peng Wang, Zexi Li, Ningyu Zhang, Ziwen Xu, Yunzhi Yao, Yong Jiang, Pengjun Xie, Fei Huang, Huajun Chen", "id": "2405.14768v1", "paper_url": "http://arxiv.org/abs/2405.14768v1", "repo": "https://github.com/zjunlp/easyedit"}}