{"2412.18139": {"publish_time": "2024-12-24", "title": "Ensuring Consistency for In-Image Translation", "paper_summary": "The in-image machine translation task involves translating text embedded\nwithin images, with the translated results presented in image format. While\nthis task has numerous applications in various scenarios such as film poster\ntranslation and everyday scene image translation, existing methods frequently\nneglect the aspect of consistency throughout this process. We propose the need\nto uphold two types of consistency in this task: translation consistency and\nimage generation consistency. The former entails incorporating image\ninformation during translation, while the latter involves maintaining\nconsistency between the style of the text-image and the original image,\nensuring background integrity. To address these consistency requirements, we\nintroduce a novel two-stage framework named HCIIT (High-Consistency In-Image\nTranslation) which involves text-image translation using a multimodal\nmultilingual large language model in the first stage and image backfilling with\na diffusion model in the second stage. Chain of thought learning is utilized in\nthe first stage to enhance the model's ability to leverage image information\nduring translation. Subsequently, a diffusion model trained for\nstyle-consistent text-image generation ensures uniformity in text style within\nimages and preserves background details. A dataset comprising 400,000\nstyle-consistent pseudo text-image pairs is curated for model training. Results\nobtained on both curated test sets and authentic image test sets validate the\neffectiveness of our framework in ensuring consistency and producing\nhigh-quality translated images.", "paper_summary_zh": "圖像內機器翻譯任務包含翻譯嵌入在圖像中的文字，翻譯結果以圖像格式呈現。雖然此任務在各種場景中都有許多應用，例如電影海報翻譯和日常場景圖像翻譯，現有方法經常忽略整個過程中一致性的方面。我們提出需要在此任務中維持兩種一致性：翻譯一致性和圖像生成一致性。前者需要在翻譯過程中納入圖像資訊，而後者則涉及維持文字圖像與原始圖像的風格一致性，確保背景完整性。為了滿足這些一致性需求，我們引進一個名為 HCIIT（高一致性圖像內翻譯）的新穎兩階段架構，其中包含在第一階段使用多模態多語言大型語言模型進行文字圖像翻譯，以及在第二階段使用擴散模型進行圖像回填。在第一階段利用思考鏈學習來增強模型在翻譯過程中利用圖像資訊的能力。隨後，針對風格一致的文字圖像生成訓練的擴散模型確保圖像中文字風格的一致性，並保留背景細節。整理了一個包含 400,000 個風格一致的偽文字圖像對的資料集，以進行模型訓練。在整理好的測試集和真實圖像測試集上獲得的結果驗證了我們架構在確保一致性並產生高品質翻譯圖像方面的有效性。", "author": "Chengpeng Fu et.al.", "authors": "Chengpeng Fu, Xiaocheng Feng, Yichong Huang, Wenshuai Huo, Baohang Li, Zhirui Zhang, Yunfei Lu, Dandan Tu, Duyu Tang, Hui Wang, Bing Qin, Ting Liu", "id": "2412.18139v1", "paper_url": "http://arxiv.org/abs/2412.18139v1", "repo": "null"}}