{"2408.09817": {"publish_time": "2024-08-19", "title": "Contextual Dual Learning Algorithm with Listwise Distillation for Unbiased Learning to Rank", "paper_summary": "Unbiased Learning to Rank (ULTR) aims to leverage biased implicit user\nfeedback (e.g., click) to optimize an unbiased ranking model. The effectiveness\nof the existing ULTR methods has primarily been validated on synthetic\ndatasets. However, their performance on real-world click data remains unclear.\nRecently, Baidu released a large publicly available dataset of their web search\nlogs. Subsequently, the NTCIR-17 ULTRE-2 task released a subset dataset\nextracted from it. We conduct experiments on commonly used or effective ULTR\nmethods on this subset to determine whether they maintain their effectiveness.\nIn this paper, we propose a Contextual Dual Learning Algorithm with Listwise\nDistillation (CDLA-LD) to simultaneously address both position bias and\ncontextual bias. We utilize a listwise-input ranking model to obtain\nreconstructed feature vectors incorporating local contextual information and\nemploy the Dual Learning Algorithm (DLA) method to jointly train this ranking\nmodel and a propensity model to address position bias. As this ranking model\nlearns the interaction information within the documents list of the training\nset, to enhance the ranking model's generalization ability, we additionally\ntrain a pointwise-input ranking model to learn the listwise-input ranking\nmodel's capability for relevance judgment in a listwise manner. Extensive\nexperiments and analysis confirm the effectiveness of our approach.", "paper_summary_zh": "無偏學習排名 (ULTR) 旨在利用有偏的隱式使用者回饋 (例如點擊) 來最佳化無偏的排名模型。現有 ULTR 方法的有效性主要已在合成資料集上得到驗證。然而，它們在真實世界點擊資料上的效能仍不明確。最近，百度發佈了一個大型公開可用的資料集，其中包含其網路搜尋記錄。隨後，NTCIR-17 ULTRE-2 任務發佈了一個從中提取的子集資料集。我們針對此子集執行常用或有效的 ULTR 方法的實驗，以確定它們是否維持其有效性。在本文中，我們提出一個具有清單式知識傳遞的脈絡雙重學習演算法 (CDLA-LD)，以同時處理位置偏誤和脈絡偏誤。我們利用清單式輸入排名模型，以取得包含局部脈絡資訊的重建特徵向量，並運用雙重學習演算法 (DLA) 方法來聯合訓練此排名模型和一個傾向模型，以處理位置偏誤。由於此排名模型會學習訓練集文件清單內的互動資訊，為了增強排名模型的概化能力，我們另外訓練一個點式輸入排名模型，以清單式方式學習清單式輸入排名模型在清單式相關性判斷的能力。廣泛的實驗和分析證實了我們方法的有效性。", "author": "Lulu Yu et.al.", "authors": "Lulu Yu, Keping Bi, Shiyu Ni, Jiafeng Guo", "id": "2408.09817v1", "paper_url": "http://arxiv.org/abs/2408.09817v1", "repo": "null"}}