{"2407.04482": {"publish_time": "2024-07-05", "title": "Controlling Whisper: Universal Acoustic Adversarial Attacks to Control Speech Foundation Models", "paper_summary": "Speech enabled foundation models, either in the form of flexible speech\nrecognition based systems or audio-prompted large language models (LLMs), are\nbecoming increasingly popular. One of the interesting aspects of these models\nis their ability to perform tasks other than automatic speech recognition (ASR)\nusing an appropriate prompt. For example, the OpenAI Whisper model can perform\nboth speech transcription and speech translation. With the development of\naudio-prompted LLMs there is the potential for even greater control options. In\nthis work we demonstrate that with this greater flexibility the systems can be\nsusceptible to model-control adversarial attacks. Without any access to the\nmodel prompt it is possible to modify the behaviour of the system by\nappropriately changing the audio input. To illustrate this risk, we demonstrate\nthat it is possible to prepend a short universal adversarial acoustic segment\nto any input speech signal to override the prompt setting of an ASR foundation\nmodel. Specifically, we successfully use a universal adversarial acoustic\nsegment to control Whisper to always perform speech translation, despite being\nset to perform speech transcription. Overall, this work demonstrates a new form\nof adversarial attack on multi-tasking speech enabled foundation models that\nneeds to be considered prior to the deployment of this form of model.", "paper_summary_zh": "語音啟用的基礎模型，無論是以彈性語音辨識為基礎的系統或音訊提示的大型語言模型 (LLM) 形式，都變得越來越普遍。這些模型的有趣面向之一是它們能夠執行自動語音辨識 (ASR) 以外的任務，使用適當的提示即可。例如，OpenAI Whisper 模型可以執行語音轉錄和語音翻譯。隨著音訊提示式 LLM 的發展，有潛力獲得更大的控制選項。在這項工作中，我們展示了有了這種更大的彈性，這些系統可能會受到模型控制對抗攻擊的影響。在無法取得模型提示的情況下，可以透過適當地改變音訊輸入來修改系統的行為。為了說明這個風險，我們展示了可以將一個簡短的通用對抗音訊片段附加到任何輸入語音訊號，以覆寫 ASR 基礎模型的提示設定。具體來說，我們成功地使用通用對抗音訊片段來控制 Whisper，使其始終執行語音翻譯，儘管設定為執行語音轉錄。總的來說，這項工作展示了一種新的多任務語音啟用基礎模型對抗攻擊形式，在部署這種形式的模型之前需要考慮這種攻擊形式。", "author": "Vyas Raina et.al.", "authors": "Vyas Raina, Mark Gales", "id": "2407.04482v1", "paper_url": "http://arxiv.org/abs/2407.04482v1", "repo": "null"}}