{"2410.06608": {"publish_time": "2024-10-09", "title": "Bahasa Harmony: A Comprehensive Dataset for Bahasa Text-to-Speech Synthesis with Discrete Codec Modeling of EnGen-TTS", "paper_summary": "This research introduces a comprehensive Bahasa text-to-speech (TTS) dataset\nand a novel TTS model, EnGen-TTS, designed to enhance the quality and\nversatility of synthetic speech in the Bahasa language. The dataset, spanning\n\\textasciitilde55.0 hours and 52K audio recordings, integrates diverse textual\nsources, ensuring linguistic richness. A meticulous recording setup captures\nthe nuances of Bahasa phonetics, employing professional equipment to ensure\nhigh-fidelity audio samples. Statistical analysis reveals the dataset's scale\nand diversity, laying the foundation for model training and evaluation. The\nproposed EnGen-TTS model performs better than established baselines, achieving\na Mean Opinion Score (MOS) of 4.45 $\\pm$ 0.13. Additionally, our investigation\non real-time factor and model size highlights EnGen-TTS as a compelling choice,\nwith efficient performance. This research marks a significant advancement in\nBahasa TTS technology, with implications for diverse language applications.\nLink to Generated Samples: \\url{https://bahasa-harmony-comp.vercel.app/}", "paper_summary_zh": "本研究引入了全面的印尼語文字轉語音 (TTS) 資料集和一個新穎的 TTS 模型 EnGen-TTS，旨在提升印尼語合成語音的品質和多功能性。該資料集橫跨約 55.0 小時和 52K 音訊錄音，整合了多樣化的文字來源，確保語言豐富性。細緻的錄音設定捕捉印尼語語音的細微差別，採用專業設備以確保高保真音訊範本。統計分析揭示了資料集的規模和多樣性，為模型訓練和評估奠定基礎。所提出的 EnGen-TTS 模型表現優於既定的基準，達到 4.45 ± 0.13 的平均意見分數 (MOS)。此外，我們對即時因素和模型大小的調查突顯出 EnGen-TTS 是一個引人注目的選擇，具有高效能表現。本研究標誌著印尼語 TTS 技術的重大進步，對多樣化的語言應用具有影響。生成的範例連結：\\url{https://bahasa-harmony-comp.vercel.app/}", "author": "Onkar Kishor Susladkar et.al.", "authors": "Onkar Kishor Susladkar, Vishesh Tripathi, Biddwan Ahmed", "id": "2410.06608v1", "paper_url": "http://arxiv.org/abs/2410.06608v1", "repo": "null"}}