{"2410.14184": {"publish_time": "2024-10-18", "title": "MetaAlign: Align Large Language Models with Diverse Preferences during Inference Time", "paper_summary": "Large Language Models (LLMs) acquire extensive knowledge and remarkable\nabilities from extensive text corpora, making them powerful tools for various\napplications. To make LLMs more usable, aligning them with human preferences is\nessential. Existing alignment techniques, such as Reinforcement Learning from\nHuman Feedback (RLHF) and Direct Preference Optimization (DPO), typically embed\npredefined preferences directly within the model's parameters. These methods,\nhowever, often result in a static alignment that can not account for the\ndiversity of human preferences in practical applications. In response to this\nchallenge, we propose an effective method, \\textbf{MetaAlign}, which aims to\nhelp LLMs dynamically align with various explicit or implicit preferences\nspecified at inference time. Experimental results show that LLMs optimized on\nour meticulously constructed MetaAlign Dataset can effectively align with any\npreferences specified at the inference stage, validating the feasibility of\nMetaAlign. We hope that our work can provide some insights into the alignment\nof language models.", "paper_summary_zh": "大型語言模型 (LLM) 從大量的文字語料庫中獲取廣泛的知識和非凡的能力，使其成為各種應用程序的強大工具。為了使 LLM 更易於使用，讓它們與人類偏好保持一致至關重要。現有的對齊技術，例如人類回饋強化學習 (RLHF) 和直接偏好最佳化 (DPO)，通常會將預定義的偏好直接嵌入模型參數中。然而，這些方法通常會導致靜態對齊，無法說明實際應用中人類偏好的多樣性。為了應對這一挑戰，我們提出了一種有效的方法，即 \\textbf{MetaAlign}，旨在幫助 LLM 動態地與在推理時指定的不同顯式或隱式偏好保持一致。實驗結果表明，在我們精心構建的 MetaAlign 數據集上優化的 LLM 可以有效地與推理階段指定的任何偏好保持一致，驗證了 MetaAlign 的可行性。我們希望我們的研究成果能為語言模型的對齊提供一些見解。", "author": "Mozhi Zhang et.al.", "authors": "Mozhi Zhang, Pengyu Wang, Chenkun Tan, Mianqiu Huang, Dong Zhang, Yaqian Zhou, Xipeng Qiu", "id": "2410.14184v1", "paper_url": "http://arxiv.org/abs/2410.14184v1", "repo": "https://github.com/Jihuai-wpy/MetaAlign"}}