{"2501.14540": {"publish_time": "2025-01-24", "title": "VERUS-LM: a Versatile Framework for Combining LLMs with Symbolic Reasoning", "paper_summary": "A recent approach to neurosymbolic reasoning is to explicitly combine the\nstrengths of large language models (LLMs) and symbolic solvers to tackle\ncomplex reasoning tasks. However, current approaches face significant\nlimitations, including poor generalizability due to task-specific prompts,\ninefficiencies caused by the lack of separation between knowledge and queries,\nand restricted inferential capabilities. These shortcomings hinder their\nscalability and applicability across diverse domains. In this paper, we\nintroduce VERUS-LM, a novel framework designed to address these challenges.\nVERUS-LM employs a generic prompting mechanism, clearly separates domain\nknowledge from queries, and supports a wide range of different logical\nreasoning tasks. This framework enhances adaptability, reduces computational\ncost, and allows for richer forms of reasoning, such as optimization and\nconstraint satisfaction. We show that our approach succeeds in diverse\nreasoning on a novel dataset, markedly outperforming LLMs. Additionally, our\nsystem achieves competitive results on common reasoning benchmarks when\ncompared to other state-of-the-art approaches, and significantly surpasses them\non the difficult AR-LSAT dataset. By pushing the boundaries of hybrid\nreasoning, VERUS-LM represents a significant step towards more versatile\nneurosymbolic AI systems", "paper_summary_zh": "最近神经符号推理的一种方法是明确结合大型语言模型 (LLM) 和符号求解器的优势来解决复杂的推理任务。然而，目前的方法面临着重大的局限性，包括由于特定任务提示导致的泛化能力差、由于缺乏知识和查询之间的分离而导致的效率低下以及受限的推理能力。这些缺点阻碍了它们在不同领域的可扩展性和适用性。在本文中，我们介绍了 VERUS-LM，这是一个旨在解决这些挑战的新框架。VERUS-LM 采用通用提示机制，将领域知识与查询明确分开，并支持各种不同的逻辑推理任务。该框架增强了适应性，降低了计算成本，并允许进行更丰富的推理形式，例如优化和约束满足。我们表明，我们的方法在新的数据集上取得了不同的推理成功，明显优于 LLM。此外，与其他最先进的方法相比，我们的系统在常见的推理基准上取得了有竞争力的结果，并且在困难的 AR-LSAT 数据集上明显超越了它们。通过突破混合推理的界限，VERUS-LM 代表了朝着更通用的神经符号 AI 系统迈出的重要一步", "author": "Benjamin Callewaert et.al.", "authors": "Benjamin Callewaert, Simon Vandevelde, Joost Vennekens", "id": "2501.14540v1", "paper_url": "http://arxiv.org/abs/2501.14540v1", "repo": "null"}}