{"2406.12680": {"publish_time": "2024-06-18", "title": "Measuring Psychological Depth in Language Models", "paper_summary": "Evaluations of creative stories generated by large language models (LLMs)\noften focus on objective properties of the text, such as its style, coherence,\nand toxicity. While these metrics are indispensable, they do not speak to a\nstory's subjective, psychological impact from a reader's perspective. We\nintroduce the Psychological Depth Scale (PDS), a novel framework rooted in\nliterary theory that measures an LLM's ability to produce authentic and\nnarratively complex stories that provoke emotion, empathy, and engagement. We\nempirically validate our framework by showing that humans can consistently\nevaluate stories based on PDS (0.72 Krippendorff's alpha). We also explore\ntechniques for automating the PDS to easily scale future analyses. GPT-4o,\ncombined with a novel Mixture-of-Personas (MoP) prompting strategy, achieves an\naverage Spearman correlation of $0.51$ with human judgment while Llama-3-70B\nscores as high as 0.68 for empathy. Finally, we compared the depth of stories\nauthored by both humans and LLMs. Surprisingly, GPT-4 stories either surpassed\nor were statistically indistinguishable from highly-rated human-written stories\nsourced from Reddit. By shifting the focus from text to reader, the\nPsychological Depth Scale is a validated, automated, and systematic means of\nmeasuring the capacity of LLMs to connect with humans through the stories they\ntell.", "paper_summary_zh": "大型語言模型 (LLM) 所產生的創意故事評量，通常會專注於文本的客觀屬性，例如其風格、連貫性和毒性。雖然這些指標不可或缺，但它們並未說明從讀者的角度來看，故事的主觀心理影響。我們引入了心理深度量表 (PDS)，這是一個植基於文學理論的新穎架構，用於衡量 LLM 產生真實且敘事複雜的故事的能力，這些故事能引起情緒、同理心和投入感。我們透過展示人類能根據 PDS 持續評估故事（Krippendorff's alpha 為 0.72）來驗證我們的架構。我們也探討自動化 PDS 的技術，以便輕鬆擴充未來的分析。GPT-4o 結合新穎的混合角色 (MoP) 提示策略，在人類判斷中達到平均 0.51 的 Spearman 相關性，而 Llama-3-70B 的同理心分數高達 0.68。最後，我們比較了人類和 LLM 創作的故事深度。令人驚訝的是，GPT-4 的故事超越或在統計上與取自 Reddit 的高評分人類撰寫故事無異。透過將焦點從文本轉移到讀者，心理深度量表是一種經過驗證、自動化且系統化的方式，用於衡量 LLM 透過他們所述故事與人類建立聯繫的能力。", "author": "Fabrice Harel-Canada et.al.", "authors": "Fabrice Harel-Canada, Hanyu Zhou, Sreya Mupalla, Zeynep Yildiz, Amit Sahai, Nanyun Peng", "id": "2406.12680v1", "paper_url": "http://arxiv.org/abs/2406.12680v1", "repo": "null"}}