{"2412.09906": {"publish_time": "2024-12-13", "title": "Enhancing the Reasoning Capabilities of Small Language Models via Solution Guidance Fine-Tuning", "paper_summary": "Large language models (LLMs) have demonstrated remarkable performance across\na wide range of tasks. Advances in prompt engineering and fine-tuning\ntechniques have further enhanced their ability to address complex reasoning\nchallenges. However, these advanced capabilities are often exclusive to models\nexceeding 100 billion parameters. Although Chain-of-Thought (CoT) fine-tuning\nmethods have been explored for smaller models (under 10 billion parameters),\nthey typically depend on extensive CoT training data, which can introduce\ninconsistencies and limit effectiveness in low-data settings. To overcome these\nlimitations, this paper introduce a new reasoning strategy Solution Guidance\n(SG) and a plug-and-play training paradigm Solution-Guidance Fine-Tuning (SGFT)\nfor enhancing the reasoning capabilities of small language models. SG focuses\non problem understanding and decomposition at the semantic and logical levels,\nrather than specific computations, which can effectively improve the SLMs'\ngeneralization and reasoning abilities. With only a small amount of SG training\ndata, SGFT can fine-tune a SLM to produce accurate problem-solving guidances,\nwhich can then be flexibly fed to any SLM as prompts, enabling it to generate\ncorrect answers directly. Experimental results demonstrate that our method\nsignificantly improves the performance of SLMs on various reasoning tasks,\nenhancing both their practicality and efficiency within resource-constrained\nenvironments.", "paper_summary_zh": "大型語言模型 (LLM) 已在廣泛的任務中展現出卓越的效能。提示工程和微調技術的進展進一步提升了它們處理複雜推理挑戰的能力。然而，這些進階功能通常專屬於超過 1000 億個參數的模型。儘管已針對較小模型（小於 100 億個參數）探索思維鏈 (CoT) 微調方法，但它們通常依賴於大量的 CoT 訓練資料，這可能會在資料量少的情況下造成不一致性並限制效能。為了克服這些限制，本文介紹了一種新的推理策略「解決方案指導」(SG) 和一種即插即用訓練範例「解決方案指導微調」(SGFT)，用於增強小型語言模型的推理能力。SG 專注於語意和邏輯層面的問題理解和分解，而非特定運算，這可以有效提升 SLM 的概化和推理能力。SGFT 僅需少量的 SG 訓練資料，就能微調 SLM 以產生準確的解決問題指導，然後可以靈活地將其提供給任何 SLM 作為提示，使其能夠直接產生正確的答案。實驗結果表明，我們的模型顯著提升了 SLM 在各種推理任務中的效能，在資源受限的環境中提升了其實用性和效率。", "author": "Jing Bi et.al.", "authors": "Jing Bi, Yuting Wu, Weiwei Xing, Zhenjie Wei", "id": "2412.09906v1", "paper_url": "http://arxiv.org/abs/2412.09906v1", "repo": "https://github.com/bijings/sgft"}}