{"2404.09763": {"publish_time": "2024-04-15", "title": "KG-CTG: Citation Generation through Knowledge Graph-guided Large Language Models", "paper_summary": "Citation Text Generation (CTG) is a task in natural language processing (NLP)\nthat aims to produce text that accurately cites or references a cited document\nwithin a source document. In CTG, the generated text draws upon contextual cues\nfrom both the source document and the cited paper, ensuring accurate and\nrelevant citation information is provided. Previous work in the field of\ncitation generation is mainly based on the text summarization of documents.\nFollowing this, this paper presents a framework, and a comparative study to\ndemonstrate the use of Large Language Models (LLMs) for the task of citation\ngeneration. Also, we have shown the improvement in the results of citation\ngeneration by incorporating the knowledge graph relations of the papers in the\nprompt for the LLM to better learn the relationship between the papers. To\nassess how well our model is performing, we have used a subset of standard\nS2ORC dataset, which only consists of computer science academic research papers\nin the English Language. Vicuna performs best for this task with 14.15 Meteor,\n12.88 Rouge-1, 1.52 Rouge-2, and 10.94 Rouge-L. Also, Alpaca performs best, and\nimproves the performance by 36.98% in Rouge-1, and 33.14% in Meteor by\nincluding knowledge graphs.", "paper_summary_zh": "引文文本生成 (CTG) 是自然語言處理 (NLP) 中的一項任務，旨在產生能準確引用或參考來源文件中的引文文件的文本。在 CTG 中，生成的文本從來源文件和引文論文中提取上下文線索，確保提供準確且相關的引文資訊。引文生成領域先前的研究主要基於文件的文字摘要。在此基礎上，本文提出了一個架構，並進行了一項比較研究，以展示大型語言模型 (LLM) 在引文生成任務中的使用。此外，我們展示了透過將論文的知識圖譜關聯納入 LLM 的提示中，進而改善引文生成的結果，以更好地學習論文之間的關聯。為了評估我們的模型表現如何，我們使用了標準 S2ORC 資料集的一個子集，其中僅包含英文的電腦科學學術研究論文。Vicuna 在這項任務中表現最佳，其 Meteor 為 14.15、Rouge-1 為 12.88、Rouge-2 為 1.52，以及 Rouge-L 為 10.94。此外，Alpaca 表現最佳，並透過納入知識圖譜，將 Rouge-1 的效能提升了 36.98%，以及 Meteor 的效能提升了 33.14%。", "author": "Avinash Anand et.al.", "authors": "Avinash Anand, Mohit Gupta, Kritarth Prasad, Ujjwal Goel, Naman Lal, Astha Verma, Rajiv Ratn Shah", "id": "2404.09763v1", "paper_url": "http://arxiv.org/abs/2404.09763v1", "repo": "null"}}