{"2409.06147": {"publish_time": "2024-09-10", "title": "Multiclass Arrhythmia Classification using Smartwatch Photoplethysmography Signals Collected in Real-life Settings", "paper_summary": "Most deep learning models of multiclass arrhythmia classification are tested\non fingertip photoplethysmographic (PPG) data, which has higher signal-to-noise\nratios compared to smartwatch-derived PPG, and the best reported sensitivity\nvalue for premature atrial/ventricular contraction (PAC/PVC) detection is only\n75%. To improve upon PAC/PVC detection sensitivity while maintaining high AF\ndetection, we use multi-modal data which incorporates 1D PPG, accelerometers,\nand heart rate data as the inputs to a computationally efficient 1D\nbi-directional Gated Recurrent Unit (1D-Bi-GRU) model to detect three\narrhythmia classes. We used motion-artifact prone smartwatch PPG data from the\nNIH-funded Pulsewatch clinical trial. Our multimodal model tested on 72\nsubjects achieved an unprecedented 83% sensitivity for PAC/PVC detection while\nmaintaining a high accuracy of 97.31% for AF detection. These results\noutperformed the best state-of-the-art model by 20.81% for PAC/PVC and 2.55%\nfor AF detection even while our model was computationally more efficient (14\ntimes lighter and 2.7 faster).", "paper_summary_zh": "大多數多類心律不整分類的深度學習模型都是在指尖光電容積描記法 (PPG) 資料上進行測試，與智慧手錶衍生的 PPG 相比，其訊號雜訊比更高，而對於期前心房/心室收縮 (PAC/PVC) 偵測所報告的最佳敏感度值僅為 75%。為了在維持高房顫偵測的同時提高 PAC/PVC 偵測敏感度，我們使用多模式資料，將 1D PPG、加速度計和心率資料作為計算效率高的 1D 雙向閘控遞迴單元 (1D-Bi-GRU) 模型的輸入，以偵測三類心律不整。我們使用了美國國家衛生研究院資助的 Pulsewatch 臨床試驗中的運動偽影易感智慧手錶 PPG 資料。我們在 72 名受試者身上測試的多模式模型，對於 PAC/PVC 偵測達到了前所未有的 83% 敏感度，同時對於房顫偵測維持了 97.31% 的高準確度。即使我們的模型在計算上更有效率（輕 14 倍，快 2.7 倍），這些結果仍比最先進的模型在 PAC/PVC 偵測上高出 20.81%，在房顫偵測上高出 2.55%。", "author": "Dong Han et.al.", "authors": "Dong Han, Jihye Moon, Luís Roberto Mercado Díaz, Darren Chen, Devan Williams, Eric Y. Ding, Khanh-Van Tran, David D. McManus, Ki H. Chon", "id": "2409.06147v1", "paper_url": "http://arxiv.org/abs/2409.06147v1", "repo": "null"}}