{"2409.14908": {"publish_time": "2024-09-23", "title": "KARMA: Augmenting Embodied AI Agents with Long-and-short Term Memory Systems", "paper_summary": "Embodied AI agents responsible for executing interconnected, long-sequence\nhousehold tasks often face difficulties with in-context memory, leading to\ninefficiencies and errors in task execution. To address this issue, we\nintroduce KARMA, an innovative memory system that integrates long-term and\nshort-term memory modules, enhancing large language models (LLMs) for planning\nin embodied agents through memory-augmented prompting. KARMA distinguishes\nbetween long-term and short-term memory, with long-term memory capturing\ncomprehensive 3D scene graphs as representations of the environment, while\nshort-term memory dynamically records changes in objects' positions and states.\nThis dual-memory structure allows agents to retrieve relevant past scene\nexperiences, thereby improving the accuracy and efficiency of task planning.\nShort-term memory employs strategies for effective and adaptive memory\nreplacement, ensuring the retention of critical information while discarding\nless pertinent data. Compared to state-of-the-art embodied agents enhanced with\nmemory, our memory-augmented embodied AI agent improves success rates by 1.3x\nand 2.3x in Composite Tasks and Complex Tasks within the AI2-THOR simulator,\nrespectively, and enhances task execution efficiency by 3.4x and 62.7x.\nFurthermore, we demonstrate that KARMA's plug-and-play capability allows for\nseamless deployment on real-world robotic systems, such as mobile manipulation\nplatforms.Through this plug-and-play memory system, KARMA significantly\nenhances the ability of embodied agents to generate coherent and contextually\nappropriate plans, making the execution of complex household tasks more\nefficient. The experimental videos from the work can be found at\nhttps://youtu.be/4BT7fnw9ehs.", "paper_summary_zh": "負責執行相互連接的長序列家庭任務的具身化 AI 代理經常面臨情境記憶的困難，導致任務執行效率低下和錯誤。為了解決這個問題，我們引入了 KARMA，這是一個創新的記憶系統，它整合了長期和短期記憶模組，透過記憶增強提示，增強具身化代理中用於規劃的大語言模型 (LLM)。KARMA 區分長期和短期記憶，長期記憶擷取全面的 3D 場景圖形作為環境的表示，而短期記憶則動態記錄物件位置和狀態的變化。這種雙重記憶結構允許代理擷取相關的過去場景經驗，從而提高任務規劃的準確性和效率。短期記憶採用策略來進行有效和適應性的記憶替換，確保保留關鍵資訊，同時捨棄較不相關的資料。與具備增強記憶功能的最新具身化代理相比，我們的記憶增強具身化 AI 代理在 AI2-THOR 模擬器中的複合任務和複雜任務中，分別將成功率提高了 1.3 倍和 2.3 倍，並將任務執行效率提高了 3.4 倍和 62.7 倍。此外，我們證明了 KARMA 的即插即用功能允許在真實世界的機器人系統上進行無縫部署，例如行動操作平台。透過這個即插即用記憶系統，KARMA 大幅增強了具身化代理產生一致且符合情境的計畫的能力，使複雜家庭任務的執行更有效率。這項工作的實驗影片可以在 https://youtu.be/4BT7fnw9ehs 找到。", "author": "Zixuan Wang et.al.", "authors": "Zixuan Wang, Bo Yu, Junzhe Zhao, Wenhao Sun, Sai Hou, Shuai Liang, Xing Hu, Yinhe Han, Yiming Gan", "id": "2409.14908v1", "paper_url": "http://arxiv.org/abs/2409.14908v1", "repo": "null"}}