{"2407.02883": {"publish_time": "2024-07-03", "title": "CoIR: A Comprehensive Benchmark for Code Information Retrieval Models", "paper_summary": "Despite the substantial success of Information Retrieval (IR) in various NLP\ntasks, most IR systems predominantly handle queries and corpora in natural\nlanguage, neglecting the domain of code retrieval. Code retrieval is critically\nimportant yet remains under-explored, with existing methods and benchmarks\ninadequately representing the diversity of code in various domains and tasks.\nAddressing this gap, we present \\textbf{\\name} (\\textbf{Co}de\n\\textbf{I}nformation \\textbf{R}etrieval Benchmark), a robust and comprehensive\nbenchmark specifically designed to assess code retrieval capabilities. \\name\ncomprises \\textbf{ten} meticulously curated code datasets, spanning\n\\textbf{eight} distinctive retrieval tasks across \\textbf{seven} diverse\ndomains. We first discuss the construction of \\name and its diverse dataset\ncomposition. Further, we evaluate nine widely used retrieval models using\n\\name, uncovering significant difficulties in performing code retrieval tasks\neven with state-of-the-art systems. To facilitate easy adoption and integration\nwithin existing research workflows, \\name has been developed as a user-friendly\nPython framework, readily installable via pip. It shares same data schema as\nother popular benchmarks like MTEB and BEIR, enabling seamless cross-benchmark\nevaluations. Through \\name, we aim to invigorate research in the code retrieval\ndomain, providing a versatile benchmarking tool that encourages further\ndevelopment and exploration of code retrieval systems\\footnote{\\url{\nhttps://github.com/CoIR-team/coir}}.", "paper_summary_zh": "儘管資訊檢索 (IR) 在各種自然語言處理 (NLP) 任務中獲得顯著成功，但大多數 IR 系統主要處理自然語言中的查詢和語料庫，忽略了程式碼檢索領域。程式碼檢索至關重要，但仍未得到充分探索，現有方法和基準無法充分代表各個領域和任務中程式碼的多樣性。為了填補這一空白，我們提出了 **\\name**（**程式碼** **資**訊 **檢**索基準），這是一個專門設計用於評估程式碼檢索功能的強大且全面的基準。**\\name** 包含 **十** 個精心整理的程式碼資料集，涵蓋 **八** 個跨越 **七** 個不同領域的獨特檢索任務。我們首先討論了 **\\name** 及其多樣化資料集組成的建構。此外，我們使用 **\\name** 評估了九個廣泛使用的檢索模型，發現即使使用最先進的系統，執行程式碼檢索任務也存在顯著困難。為了便於在現有研究工作流程中輕鬆採用和整合，**\\name** 已開發為一個使用者友善的 Python 框架，可透過 pip 輕鬆安裝。它與 MTEB 和 BEIR 等其他熱門基準共用相同的資料架構，可實現無縫的跨基準評估。透過 **\\name**，我們旨在激勵程式碼檢索領域的研究，提供一個多功能的基準工具，鼓勵進一步開發和探索程式碼檢索系統\\footnote{\\url{ https://github.com/CoIR-team/coir}}。", "author": "Xiangyang Li et.al.", "authors": "Xiangyang Li, Kuicai Dong, Yi Quan Lee, Wei Xia, Yichun Yin, Hao Zhang, Yong Liu, Yasheng Wang, Ruiming Tang", "id": "2407.02883v1", "paper_url": "http://arxiv.org/abs/2407.02883v1", "repo": "https://github.com/coir-team/coir"}}