{"2503.15796": {"publish_time": "2025-03-20", "title": "Blend the Separated: Mixture of Synergistic Experts for Data-Scarcity Drug-Target Interaction Prediction", "paper_summary": "Drug-target interaction prediction (DTI) is essential in various applications\nincluding drug discovery and clinical application. There are two perspectives\nof input data widely used in DTI prediction: Intrinsic data represents how\ndrugs or targets are constructed, and extrinsic data represents how drugs or\ntargets are related to other biological entities. However, any of the two\nperspectives of input data can be scarce for some drugs or targets, especially\nfor those unpopular or newly discovered. Furthermore, ground-truth labels for\nspecific interaction types can also be scarce. Therefore, we propose the first\nmethod to tackle DTI prediction under input data and/or label scarcity. To make\nour model functional when only one perspective of input data is available, we\ndesign two separate experts to process intrinsic and extrinsic data\nrespectively and fuse them adaptively according to different samples.\nFurthermore, to make the two perspectives complement each other and remedy\nlabel scarcity, two experts synergize with each other in a mutually supervised\nway to exploit the enormous unlabeled data. Extensive experiments on 3\nreal-world datasets under different extents of input data scarcity and/or label\nscarcity demonstrate our model outperforms states of the art significantly and\nsteadily, with a maximum improvement of 53.53%. We also test our model without\nany data scarcity and it still outperforms current methods.", "paper_summary_zh": "<paragraph>藥物-靶點相互作用預測 (DTI) 在包括藥物發現和臨床應用在內的各種應用中至關重要。DTI 預測中廣泛使用的輸入數據有兩個角度：內在數據表示藥物或靶點是如何構建的，外在數據表示藥物或靶點如何與其他生物實體相關聯。然而，對於某些藥物或靶點，尤其是那些不常用或新發現的藥物或靶點，這兩個角度的輸入數據都可能很稀缺。此外，特定交互類型的真實標籤也可能很稀缺。因此，我們提出了第一種在輸入數據和/或標籤稀缺的情況下處理 DTI 預測的方法。為了使我們的模型在只有一種角度的輸入數據可用的情況下也能正常工作，我們設計了兩個獨立的專家來分別處理內在數據和外在數據，並根據不同的樣本自適應地融合它們。此外，為了使兩個角度的數據相互補充並彌補標籤的稀缺性，兩個專家以相互監督的方式協同工作，以利用大量的未標記數據。在 3 個真實世界數據集上進行的不同程度的輸入數據稀缺性和/或標籤稀缺性的廣泛實驗表明，我們的模型顯著且穩定地優於最先進的模型，最大改進了 53.53%。我們還在沒有任何數據稀缺性的情況下測試了我們的模型，它仍然優於目前的方法。</paragraph>\n", "author": "Xinlong Zhai et.al.", "authors": "Xinlong Zhai, Chunchen Wang, Ruijia Wang, Jiazheng Kang, Shujie Li, Boyu Chen, Tengfei Ma, Zikai Zhou, Cheng Yang, Chuan Shi", "id": "2503.15796v1", "paper_url": "http://arxiv.org/abs/2503.15796v1", "repo": "null"}}