{"2410.12457": {"publish_time": "2024-10-16", "title": "Sharpness-Aware Black-Box Optimization", "paper_summary": "Black-box optimization algorithms have been widely used in various machine\nlearning problems, including reinforcement learning and prompt fine-tuning.\nHowever, directly optimizing the training loss value, as commonly done in\nexisting black-box optimization methods, could lead to suboptimal model quality\nand generalization performance. To address those problems in black-box\noptimization, we propose a novel Sharpness-Aware Black-box Optimization (SABO)\nalgorithm, which applies a sharpness-aware minimization strategy to improve the\nmodel generalization. Specifically, the proposed SABO method first\nreparameterizes the objective function by its expectation over a Gaussian\ndistribution. Then it iteratively updates the parameterized distribution by\napproximated stochastic gradients of the maximum objective value within a small\nneighborhood around the current solution in the Gaussian distribution space.\nTheoretically, we prove the convergence rate and generalization bound of the\nproposed SABO algorithm. Empirically, extensive experiments on the black-box\nprompt fine-tuning tasks demonstrate the effectiveness of the proposed SABO\nmethod in improving model generalization performance.", "paper_summary_zh": "黑盒優化演算法已被廣泛用於各種機器學習問題中，包括強化學習和提示微調。\n然而，直接優化訓練損失值，就像現有黑盒優化方法中常見的那樣，可能會導致次優模型品質和泛化效能。為了解決黑盒優化中的那些問題，我們提出了一種新穎的敏銳度感知黑盒優化 (SABO) 演算法，它應用一種敏銳度感知最小化策略來改善模型泛化。具體來說，所提出的 SABO 方法首先透過其在高斯分佈上的期望值對目標函數進行重新參數化。然後，它透過高斯分佈空間中目前解附近一個小鄰域內最大目標值的近似隨機梯度，反覆更新參數化分佈。理論上，我們證明了所提出的 SABO 演算法的收斂速度和泛化界限。根據經驗，在黑盒提示微調任務上進行的廣泛實驗證明了所提出的 SABO 方法在改善模型泛化效能方面的有效性。", "author": "Feiyang Ye et.al.", "authors": "Feiyang Ye, Yueming Lyu, Xuehao Wang, Masashi Sugiyama, Yu Zhang, Ivor Tsang", "id": "2410.12457v1", "paper_url": "http://arxiv.org/abs/2410.12457v1", "repo": "null"}}