{"2409.17091": {"publish_time": "2024-09-25", "title": "Ctrl-GenAug: Controllable Generative Augmentation for Medical Sequence Classification", "paper_summary": "In the medical field, the limited availability of large-scale datasets and\nlabor-intensive annotation processes hinder the performance of deep models.\nDiffusion-based generative augmentation approaches present a promising solution\nto this issue, having been proven effective in advancing downstream medical\nrecognition tasks. Nevertheless, existing works lack sufficient semantic and\nsequential steerability for challenging video/3D sequence generation, and\nneglect quality control of noisy synthesized samples, resulting in unreliable\nsynthetic databases and severely limiting the performance of downstream tasks.\nIn this work, we present Ctrl-GenAug, a novel and general generative\naugmentation framework that enables highly semantic- and sequential-customized\nsequence synthesis and suppresses incorrectly synthesized samples, to aid\nmedical sequence classification. Specifically, we first design a multimodal\nconditions-guided sequence generator for controllably synthesizing\ndiagnosis-promotive samples. A sequential augmentation module is integrated to\nenhance the temporal/stereoscopic coherence of generated samples. Then, we\npropose a noisy synthetic data filter to suppress unreliable cases at semantic\nand sequential levels. Extensive experiments on 3 medical datasets, using 11\nnetworks trained on 3 paradigms, comprehensively analyze the effectiveness and\ngenerality of Ctrl-GenAug, particularly in underrepresented high-risk\npopulations and out-domain conditions.", "paper_summary_zh": "在医学領域中，大規模數據集的可用性有限，且人工標註過程繁瑣，阻礙了深度模型的執行。基於擴散的生成式擴充方法為此問題提供了有前景的解決方案，已被證實能有效推進下游醫療識別任務。儘管如此，現有作品缺乏足夠的語義和序列可控性，難以進行具有挑戰性的視訊/3D 序列生成，且忽略了對有雜訊合成樣本的品質控制，導致合成式資料庫不可靠，並嚴重限制了下游任務的執行。在這項工作中，我們提出了 Ctrl-GenAug，一個新穎且通用的生成式擴充架構，能實現高度語義和序列自訂的序列合成，並抑制錯誤合成的樣本，以協助醫療序列分類。具體來說，我們首先設計了一個多模態條件引導序列生成器，用於可控地合成促進診斷的樣本。整合了一個序列擴充模組，以增強生成樣本的時間/立體一致性。然後，我們提出了一個有雜訊的合成資料濾波器，以抑制語義和序列層級中不可靠的案例。在 3 個醫療數據集上進行的廣泛實驗，使用在 3 個範例中訓練的 11 個網路，全面分析了 Ctrl-GenAug 的有效性和普遍性，特別是在代表性不足的高風險族群和領域外條件中。", "author": "Xinrui Zhou et.al.", "authors": "Xinrui Zhou, Yuhao Huang, Haoran Dou, Shijing Chen, Ao Chang, Jia Liu, Weiran Long, Jian Zheng, Erjiao Xu, Jie Ren, Ruobing Huang, Jun Cheng, Wufeng Xue, Dong Ni", "id": "2409.17091v1", "paper_url": "http://arxiv.org/abs/2409.17091v1", "repo": "null"}}