{"2407.20712": {"publish_time": "2024-07-30", "title": "Cocobo: Exploring Large Language Models as the Engine for End-User Robot Programming", "paper_summary": "End-user development allows everyday users to tailor service robots or\napplications to their needs. One user-friendly approach is natural language\nprogramming. However, it encounters challenges such as an expansive user\nexpression space and limited support for debugging and editing, which restrict\nits application in end-user programming. The emergence of large language models\n(LLMs) offers promising avenues for the translation and interpretation between\nhuman language instructions and the code executed by robots, but their\napplication in end-user programming systems requires further study. We\nintroduce Cocobo, a natural language programming system with interactive\ndiagrams powered by LLMs. Cocobo employs LLMs to understand users' authoring\nintentions, generate and explain robot programs, and facilitate the conversion\nbetween executable code and flowchart representations. Our user study shows\nthat Cocobo has a low learning curve, enabling even users with zero coding\nexperience to customize robot programs successfully.", "paper_summary_zh": "終端使用者開發允許一般使用者依據其需求調整服務機器人或應用程式。一種使用者友善的方法是自然語言程式設計。然而，它會遭遇挑戰，例如廣泛的使用者表達空間，以及對除錯和編輯的支援有限，這限制了它在終端使用者程式設計中的應用。大型語言模型 (LLM) 的出現為人類語言指令與機器人執行的程式碼之間的翻譯和詮釋提供了有希望的途徑，但它們在終端使用者程式設計系統中的應用需要進一步研究。我們介紹 Cocobo，一個由 LLM 驅動的互動式圖表自然語言程式設計系統。Cocobo 使用 LLM 來理解使用者的編寫意圖，產生並解釋機器人程式，並促進可執行程式碼和流程圖表示之間的轉換。我們的使用者研究顯示，Cocobo 具有低學習曲線，即使是沒有任何程式設計經驗的使用者也能成功自訂機器人程式。", "author": "Yate Ge et.al.", "authors": "Yate Ge, Yi Dai, Run Shan, Kechun Li, Yuanda Hu, Xiaohua Sun", "id": "2407.20712v1", "paper_url": "http://arxiv.org/abs/2407.20712v1", "repo": "null"}}