{"2408.05646": {"publish_time": "2024-08-10", "title": "Eigen Attention: Attention in Low-Rank Space for KV Cache Compression", "paper_summary": "Large language models (LLMs) represent a groundbreaking advancement in the\ndomain of natural language processing due to their impressive reasoning\nabilities. Recently, there has been considerable interest in increasing the\ncontext lengths for these models to enhance their applicability to complex\ntasks. However, at long context lengths and large batch sizes, the key-value\n(KV) cache, which stores the attention keys and values, emerges as the new\nbottleneck in memory usage during inference. To address this, we propose Eigen\nAttention, which performs the attention operation in a low-rank space, thereby\nreducing the KV cache memory overhead. Our proposed approach is orthogonal to\nexisting KV cache compression techniques and can be used synergistically with\nthem. Through extensive experiments over OPT, MPT, and Llama model families, we\ndemonstrate that Eigen Attention results in up to 40% reduction in KV cache\nsizes and up to 60% reduction in attention operation latency with minimal drop\nin performance.", "paper_summary_zh": "大型語言模型 (LLM) 由於其令人印象深刻的推理能力，代表了自然語言處理領域的突破性進展。最近，人們相當有興趣增加這些模型的上下文長度，以增強其對複雜任務的適用性。然而，在較長的上下文長度和較大的批次大小下，儲存注意力鍵和值的快取記憶體 (KV) 成為推論期間記憶體使用量的新瓶頸。為了解決這個問題，我們提出了特徵值注意力，它在低秩空間中執行注意力操作，從而減少了 KV 快取記憶體的開銷。我們提出的方法與現有的 KV 快取壓縮技術正交，並且可以與它們協同使用。通過對 OPT、MPT 和 Llama 模型系列進行廣泛的實驗，我們證明特徵值注意力可使 KV 快取大小減少多達 40%，注意力操作延遲減少多達 60%，而效能下降幅度很小。", "author": "Utkarsh Saxena et.al.", "authors": "Utkarsh Saxena, Gobinda Saha, Sakshi Choudhary, Kaushik Roy", "id": "2408.05646v1", "paper_url": "http://arxiv.org/abs/2408.05646v1", "repo": "null"}}