{"2408.10995": {"publish_time": "2024-08-20", "title": "CTP-LLM: Clinical Trial Phase Transition Prediction Using Large Language Models", "paper_summary": "New medical treatment development requires multiple phases of clinical\ntrials. Despite the significant human and financial costs of bringing a drug to\nmarket, less than 20% of drugs in testing will make it from the first phase to\nfinal approval. Recent literature indicates that the design of the trial\nprotocols significantly contributes to trial performance. We investigated\nClinical Trial Outcome Prediction (CTOP) using trial design documents to\npredict phase transitions automatically. We propose CTP-LLM, the first Large\nLanguage Model (LLM) based model for CTOP. We also introduce the\nPhaseTransition (PT) Dataset; which labels trials based on their progression\nthrough the regulatory process and serves as a benchmark for CTOP evaluation.\nOur fine-tuned GPT-3.5-based model (CTP-LLM) predicts clinical trial phase\ntransition by analyzing the trial's original protocol texts without requiring\nhuman-selected features. CTP-LLM achieves a 67% accuracy rate in predicting\ntrial phase transitions across all phases and a 75% accuracy rate specifically\nin predicting the transition from Phase~III to final approval. Our experimental\nperformance highlights the potential of LLM-powered applications in forecasting\nclinical trial outcomes and assessing trial design.", "paper_summary_zh": "新藥物治療的開發需要多階段的臨床試驗。儘管將藥物推向市場需要大量的人力和財力成本，但只有不到 20% 的藥物在測試中能從第一階段順利通過，獲得最終核准。最近的文獻指出，試驗規程的設計對試驗成效有顯著的影響。我們利用試驗設計文件研究臨床試驗結果預測 (CTOP)，以自動預測各階段的轉換。我們提出 CTP-LLM，這是第一個基於大型語言模型 (LLM) 的 CTOP 模型。我們也引入了 PhaseTransition (PT) 資料集，這個資料集根據試驗在法規程序中的進展標記試驗，並作為 CTOP 評估的基準。我們微調後的 GPT-3.5 基礎模型 (CTP-LLM) 會分析試驗的原始規程文字，來預測臨床試驗的階段轉換，而不需要人工選擇的特徵。CTP-LLM 在預測所有階段的試驗階段轉換時，達到了 67% 的準確度，而在預測從第 III 期轉換到最終核准的階段轉換時，達到了 75% 的準確度。我們的實驗成效突顯了 LLM 驅動的應用程式在預測臨床試驗結果和評估試驗設計方面的潛力。", "author": "Michael Reinisch et.al.", "authors": "Michael Reinisch, Jianfeng He, Chenxi Liao, Sauleh Ahmad Siddiqui, Bei Xiao", "id": "2408.10995v1", "paper_url": "http://arxiv.org/abs/2408.10995v1", "repo": "null"}}