{"2411.17558": {"publish_time": "2024-11-26", "title": "Natural Language Understanding and Inference with MLLM in Visual Question Answering: A Survey", "paper_summary": "Visual Question Answering (VQA) is a challenge task that combines natural\nlanguage processing and computer vision techniques and gradually becomes a\nbenchmark test task in multimodal large language models (MLLMs). The goal of\nour survey is to provide an overview of the development of VQA and a detailed\ndescription of the latest models with high timeliness. This survey gives an\nup-to-date synthesis of natural language understanding of images and text, as\nwell as the knowledge reasoning module based on image-question information on\nthe core VQA tasks. In addition, we elaborate on recent advances in extracting\nand fusing modal information with vision-language pretraining models and\nmultimodal large language models in VQA. We also exhaustively review the\nprogress of knowledge reasoning in VQA by detailing the extraction of internal\nknowledge and the introduction of external knowledge. Finally, we present the\ndatasets of VQA and different evaluation metrics and discuss possible\ndirections for future work.", "paper_summary_zh": "視覺問答 (VQA) 是一項結合自然語言處理和電腦視覺技術的挑戰性任務，並逐漸成為多模態大型語言模型 (MLLM) 的基準測試任務。我們的調查目標是提供 VQA 發展的概觀，並詳細描述具有高度時效性的最新模型。這項調查提供了圖像和文字自然語言理解的最新綜合，以及基於核心 VQA 任務中圖像問題資訊的知識推理模組。此外，我們闡述了在 VQA 中使用視覺語言預訓練模型和多模態大型語言模型提取和融合模態資訊的最新進展。我們也詳盡地回顧了 VQA 中知識推理的進展，詳細說明內部知識的提取和外部知識的引入。最後，我們介紹了 VQA 的資料集和不同的評估指標，並討論未來工作的可能方向。", "author": "Jiayi Kuang et.al.", "authors": "Jiayi Kuang, Jingyou Xie, Haohao Luo, Ronghao Li, Zhe Xu, Xianfeng Cheng, Yinghui Li, Xika Lin, Ying Shen", "id": "2411.17558v1", "paper_url": "http://arxiv.org/abs/2411.17558v1", "repo": "null"}}