{"2410.21157": {"publish_time": "2024-10-28", "title": "M2rc-Eval: Massively Multilingual Repository-level Code Completion Evaluation", "paper_summary": "Repository-level code completion has drawn great attention in software\nengineering, and several benchmark datasets have been introduced. However,\nexisting repository-level code completion benchmarks usually focus on a limited\nnumber of languages (<5), which cannot evaluate the general code intelligence\nabilities across different languages for existing code Large Language Models\n(LLMs). Besides, the existing benchmarks usually report overall average scores\nof different languages, where the fine-grained abilities in different\ncompletion scenarios are ignored. Therefore, to facilitate the research of code\nLLMs in multilingual scenarios, we propose a massively multilingual\nrepository-level code completion benchmark covering 18 programming languages\n(called M2RC-EVAL), and two types of fine-grained annotations (i.e.,\nbucket-level and semantic-level) on different completion scenarios are\nprovided, where we obtain these annotations based on the parsed abstract syntax\ntree. Moreover, we also curate a massively multilingual instruction corpora\nM2RC- INSTRUCT dataset to improve the repository-level code completion\nabilities of existing code LLMs. Comprehensive experimental results demonstrate\nthe effectiveness of our M2RC-EVAL and M2RC-INSTRUCT.", "paper_summary_zh": "儲存庫層級程式碼補完在軟體工程領域備受關注，且已推出多個基準資料集。然而，現有的儲存庫層級程式碼補完基準通常僅專注於有限的程式語言（<5），這無法評估現有大型語言模型（LLM）針對不同程式語言的一般程式碼智慧能力。此外，現有的基準通常會回報不同程式語言的整體平均分數，其中會忽略在不同補完情境中的細微能力。因此，為了促進多語言情境中程式碼 LLM 的研究，我們提出了一個涵蓋 18 種程式語言的大型多語言儲存庫層級程式碼補完基準（稱為 M2RC-EVAL），並在不同的補完情境中提供了兩種細微註解類型（即儲存區層級和語義層級），我們根據已剖析的抽象語法樹取得這些註解。此外，我們也整理了一個大型多語言指令語料庫 M2RC-INSTRUCT 資料集，以提升現有程式碼 LLM 的儲存庫層級程式碼補完能力。全面的實驗結果證明了我們 M2RC-EVAL 和 M2RC-INSTRUCT 的有效性。", "author": "Jiaheng Liu et.al.", "authors": "Jiaheng Liu, Ken Deng, Congnan Liu, Jian Yang, Shukai Liu, He Zhu, Peng Zhao, Linzheng Chai, Yanan Wu, Ke Jin, Ge Zhang, Zekun Wang, Guoan Zhang, Bangyu Xiang, Wenbo Su, Bo Zheng", "id": "2410.21157v1", "paper_url": "http://arxiv.org/abs/2410.21157v1", "repo": "null"}}