{"2502.09018": {"publish_time": "2025-02-13", "title": "Zero-shot Concept Bottleneck Models", "paper_summary": "Concept bottleneck models (CBMs) are inherently interpretable and\nintervenable neural network models, which explain their final label prediction\nby the intermediate prediction of high-level semantic concepts. However, they\nrequire target task training to learn input-to-concept and concept-to-label\nmappings, incurring target dataset collections and training resources. In this\npaper, we present \\textit{zero-shot concept bottleneck models} (Z-CBMs), which\npredict concepts and labels in a fully zero-shot manner without training neural\nnetworks. Z-CBMs utilize a large-scale concept bank, which is composed of\nmillions of vocabulary extracted from the web, to describe arbitrary input in\nvarious domains. For the input-to-concept mapping, we introduce concept\nretrieval, which dynamically finds input-related concepts by the cross-modal\nsearch on the concept bank. In the concept-to-label inference, we apply concept\nregression to select essential concepts from the retrieved concepts by sparse\nlinear regression. Through extensive experiments, we confirm that our Z-CBMs\nprovide interpretable and intervenable concepts without any additional\ntraining. Code will be available at https://github.com/yshinya6/zcbm.", "paper_summary_zh": "概念瓶頸模型 (CBM) 本質上是可解釋且可干預的神經網路模型，它們透過對高階語意概念的中間預測來解釋其最終標籤預測。然而，它們需要目標任務訓練來學習輸入到概念和概念到標籤的對應，導致目標資料集收集和訓練資源。在本文中，我們展示了「零次學習概念瓶頸模型」(Z-CBM)，它以完全零次學習的方式預測概念和標籤，而無需訓練神經網路。Z-CBM 利用一個大型概念庫，其中包含從網路中擷取的數百萬個詞彙，來描述各種領域中的任意輸入。對於輸入到概念的對應，我們引入了概念擷取，它透過對概念庫的跨模態搜尋，動態地找出與輸入相關的概念。在概念到標籤的推論中，我們應用概念迴歸，透過稀疏線性迴歸從擷取的概念中選擇必要的概念。透過廣泛的實驗，我們確認我們的 Z-CBM 在沒有任何額外訓練的情況下提供了可解釋且可干預的概念。程式碼將可在 https://github.com/yshinya6/zcbm 取得。", "author": "Shin'ya Yamaguchi et.al.", "authors": "Shin'ya Yamaguchi, Kosuke Nishida, Daiki Chijiwa, Yasutoshi Ida", "id": "2502.09018v1", "paper_url": "http://arxiv.org/abs/2502.09018v1", "repo": "null"}}