{"2302.03008": {"publish_time": "2023-02-06", "title": "LAVA: Granular Neuron-Level Explainable AI for Alzheimer's Disease Assessment from Fundus Images", "paper_summary": "Alzheimer's Disease (AD) is a progressive neurodegenerative disease and the\nleading cause of dementia. Early diagnosis is critical for patients to benefit\nfrom potential intervention and treatment. The retina has been hypothesized as\na diagnostic site for AD detection owing to its anatomical connection with the\nbrain. Developed AI models for this purpose have yet to provide a rational\nexplanation about the decision and neither infer the stage of disease's\nprogression. Along this direction, we propose a novel model-agnostic\nexplainable-AI framework, called Granular Neuron-level Explainer (LAVA), an\ninterpretation prototype that probes into intermediate layers of the\nConvolutional Neural Network (CNN) models to assess the AD continuum directly\nfrom the retinal imaging without longitudinal or clinical evaluation. This\nmethod is applied to validate the retinal vasculature as a biomarker and\ndiagnostic modality for Alzheimer's Disease (AD) evaluation. UK Biobank\ncognitive tests and vascular morphological features suggest LAVA shows strong\npromise and effectiveness in identifying AD stages across the progression\ncontinuum.", "paper_summary_zh": "阿茲海默症 (AD) 是一種進行性的神經退化性疾病，也是導致失智症的主因。早期診斷對於患者接受潛在干預和治療至關重要。由於視網膜與大腦有解剖學上的連結，因此假設視網膜可以作為 AD 檢測的診斷部位。為此目的而開發的 AI 模型，尚未對決策提供合理的解釋，也無法推論疾病進展的階段。沿著這個方向，我們提出了一個新穎的模型不可知論可解釋 AI 架構，稱為顆粒神經元級別解釋器 (LAVA)，這是一個解釋原型，可以探測卷積神經網路 (CNN) 模型的中間層，以直接從視網膜影像評估 AD 連續體，而無需縱向或臨床評估。此方法用於驗證視網膜血管作為生物標記和阿茲海默症 (AD) 評估的診斷方式。英國生物資料庫的認知測試和血管形態特徵表明，LAVA 在識別進展連續體中的 AD 階段方面顯示出強大的前景和有效性。", "author": "Nooshin Yousefzadeh et.al.", "authors": "Nooshin Yousefzadeh, Charlie Tran, Adolfo Ramirez-Zamora, Jinghua Chen, Ruogu Fang, My T. Thai", "id": "2302.03008v2", "paper_url": "http://arxiv.org/abs/2302.03008v2", "repo": "null"}}