{"2405.20003": {"publish_time": "2024-05-30", "title": "Kernel Language Entropy: Fine-grained Uncertainty Quantification for LLMs from Semantic Similarities", "paper_summary": "Uncertainty quantification in Large Language Models (LLMs) is crucial for\napplications where safety and reliability are important. In particular,\nuncertainty can be used to improve the trustworthiness of LLMs by detecting\nfactually incorrect model responses, commonly called hallucinations.\nCritically, one should seek to capture the model's semantic uncertainty, i.e.,\nthe uncertainty over the meanings of LLM outputs, rather than uncertainty over\nlexical or syntactic variations that do not affect answer correctness. To\naddress this problem, we propose Kernel Language Entropy (KLE), a novel method\nfor uncertainty estimation in white- and black-box LLMs. KLE defines positive\nsemidefinite unit trace kernels to encode the semantic similarities of LLM\noutputs and quantifies uncertainty using the von Neumann entropy. It considers\npairwise semantic dependencies between answers (or semantic clusters),\nproviding more fine-grained uncertainty estimates than previous methods based\non hard clustering of answers. We theoretically prove that KLE generalizes the\nprevious state-of-the-art method called semantic entropy and empirically\ndemonstrate that it improves uncertainty quantification performance across\nmultiple natural language generation datasets and LLM architectures.", "paper_summary_zh": "在大型语言模型 (LLM) 中量化不确定性对于安全性和可靠性至关重要的应用程序至关重要。具体而言，不确定性可用于通过检测事实错误的模型响应（通常称为幻觉）来提高 LLM 的可信度。至关重要的是，人们应该寻求捕捉模型的语义不确定性，即对 LLM 输出的含义的不确定性，而不是对不影响答案正确性的词法或句法变异的不确定性。为了解决这个问题，我们提出了核语言熵 (KLE)，这是一种用于白盒和黑盒 LLM 中不确定性估计的新方法。KLE 定义正半定单位迹核来编码 LLM 输出的语义相似性，并使用冯诺依曼熵量化不确定性。它考虑答案（或语义簇）之间的成对语义依赖关系，比基于答案硬聚类的先前方法提供了更细粒度的不确定性估计。我们从理论上证明，KLE 概括了以前称为语义熵的最新方法，并通过实验证明，它提高了跨多个自然语言生成数据集和 LLM 架构的不确定性量化性能。", "author": "Alexander Nikitin et.al.", "authors": "Alexander Nikitin, Jannik Kossen, Yarin Gal, Pekka Marttinen", "id": "2405.20003v1", "paper_url": "http://arxiv.org/abs/2405.20003v1", "repo": "null"}}