{"2406.06465": {"publish_time": "2024-06-10", "title": "AID: Adapting Image2Video Diffusion Models for Instruction-guided Video Prediction", "paper_summary": "Text-guided video prediction (TVP) involves predicting the motion of future\nframes from the initial frame according to an instruction, which has wide\napplications in virtual reality, robotics, and content creation. Previous TVP\nmethods make significant breakthroughs by adapting Stable Diffusion for this\ntask. However, they struggle with frame consistency and temporal stability\nprimarily due to the limited scale of video datasets. We observe that\npretrained Image2Video diffusion models possess good priors for video dynamics\nbut they lack textual control. Hence, transferring Image2Video models to\nleverage their video dynamic priors while injecting instruction control to\ngenerate controllable videos is both a meaningful and challenging task. To\nachieve this, we introduce the Multi-Modal Large Language Model (MLLM) to\npredict future video states based on initial frames and text instructions. More\nspecifically, we design a dual query transformer (DQFormer) architecture, which\nintegrates the instructions and frames into the conditional embeddings for\nfuture frame prediction. Additionally, we develop Long-Short Term Temporal\nAdapters and Spatial Adapters that can quickly transfer general video diffusion\nmodels to specific scenarios with minimal training costs. Experimental results\nshow that our method significantly outperforms state-of-the-art techniques on\nfour datasets: Something Something V2, Epic Kitchen-100, Bridge Data, and\nUCF-101. Notably, AID achieves 91.2% and 55.5% FVD improvements on Bridge and\nSSv2 respectively, demonstrating its effectiveness in various domains. More\nexamples can be found at our website https://chenhsing.github.io/AID.", "paper_summary_zh": "<paragraph>文字引導影片預測 (TVP) 涉及根據指令從初始影格預測未來影格的動作，這在虛擬實境、機器人和內容創作中具有廣泛的應用。先前的 TVP 方法通過調整 Stable Diffusion 來執行這項任務，取得重大的突破。然而，它們面臨影格一致性和時間穩定性的問題，主要是由於影片資料集的規模有限。我們觀察到預訓練的 Image2Video diffusion 模型擁有良好的影片動態先驗，但它們缺乏文字控制。因此，將 Image2Video 模型轉移以利用其影片動態先驗，同時注入指令控制以產生可控制影片，這是一項有意義且具有挑戰性的任務。為了達成此目的，我們引入了多模態大型語言模型 (MLLM) 來根據初始影格和文字指令預測未來的影片狀態。更具體地說，我們設計了雙查詢轉換器 (DQFormer) 架構，它將指令和影格整合到未來影格預測的條件嵌入中。此外，我們開發了長短期時間適配器和空間適配器，它們可以快速將一般影片 diffusion 模型轉移到特定場景，且訓練成本極低。實驗結果顯示，我們的模型在四個資料集上明顯優於最先進的技術：Something Something V2、Epic Kitchen-100、Bridge Data 和 UCF-101。值得注意的是，AID 分別在 Bridge 和 SSv2 上達到了 91.2% 和 55.5% 的 FVD 改進，證明了它在各種領域的有效性。更多範例可以在我們的網站 https://chenhsing.github.io/AID 中找到。</paragraph>", "author": "Zhen Xing et.al.", "authors": "Zhen Xing, Qi Dai, Zejia Weng, Zuxuan Wu, Yu-Gang Jiang", "id": "2406.06465v1", "paper_url": "http://arxiv.org/abs/2406.06465v1", "repo": "null"}}