{"2412.10347": {"publish_time": "2024-12-13", "title": "COMET: Benchmark for Comprehensive Biological Multi-omics Evaluation Tasks and Language Models", "paper_summary": "As key elements within the central dogma, DNA, RNA, and proteins play crucial\nroles in maintaining life by guaranteeing accurate genetic expression and\nimplementation. Although research on these molecules has profoundly impacted\nfields like medicine, agriculture, and industry, the diversity of machine\nlearning approaches-from traditional statistical methods to deep learning\nmodels and large language models-poses challenges for researchers in choosing\nthe most suitable models for specific tasks, especially for cross-omics and\nmulti-omics tasks due to the lack of comprehensive benchmarks. To address this,\nwe introduce the first comprehensive multi-omics benchmark COMET (Benchmark for\nBiological COmprehensive Multi-omics Evaluation Tasks and Language Models),\ndesigned to evaluate models across single-omics, cross-omics, and multi-omics\ntasks. First, we curate and develop a diverse collection of downstream tasks\nand datasets covering key structural and functional aspects in DNA, RNA, and\nproteins, including tasks that span multiple omics levels. Then, we evaluate\nexisting foundational language models for DNA, RNA, and proteins, as well as\nthe newly proposed multi-omics method, offering valuable insights into their\nperformance in integrating and analyzing data from different biological\nmodalities. This benchmark aims to define critical issues in multi-omics\nresearch and guide future directions, ultimately promoting advancements in\nunderstanding biological processes through integrated and different omics data\nanalysis.", "paper_summary_zh": "作為中心法則中的關鍵元素，DNA、RNA 和蛋白質在維持生命方面發揮著至關重要的作用，它們保證了準確的基因表達和實施。儘管對這些分子的研究對醫學、農業和工業等領域產生了深遠的影響，但機器學習方法的多樣性（從傳統的統計方法到深度學習模型和大語言模型）對研究人員在為特定任務選擇最合適的模型提出了挑戰，特別是對於組學間和多組學任務，這是由於缺乏全面的基準。為了解決這個問題，我們引入了第一個全面的多組學基準 COMET（生物綜合多組學評估任務和語言模型基準），旨在評估模型在單組學、組學間和多組學任務中的表現。首先，我們策劃並開發了一系列多樣的下游任務和數據集，涵蓋了 DNA、RNA 和蛋白質中的關鍵結構和功能方面，包括跨越多個組學層級的任務。然後，我們評估了現有的 DNA、RNA 和蛋白質基礎語言模型，以及新提出的多組學方法，對它們整合和分析來自不同生物模式的數據的性能提供了寶貴的見解。這個基準旨在定義多組學研究中的關鍵問題並指導未來的方向，最終通過整合和不同的組學數據分析促進對生物過程的理解。", "author": "Yuchen Ren et.al.", "authors": "Yuchen Ren, Wenwei Han, Qianyuan Zhang, Yining Tang, Weiqiang Bai, Yuchen Cai, Lifeng Qiao, Hao Jiang, Dong Yuan, Tao Chen, Siqi Sun, Pan Tan, Wanli Ouyang, Nanqing Dong, Xinzhu Ma, Peng Ye", "id": "2412.10347v1", "paper_url": "http://arxiv.org/abs/2412.10347v1", "repo": "null"}}