{"2501.02905": {"publish_time": "2025-01-06", "title": "Skillful High-Resolution Ensemble Precipitation Forecasting with an Integrated Deep Learning Framework", "paper_summary": "High-resolution precipitation forecasts are crucial for providing accurate\nweather prediction and supporting effective responses to extreme weather\nevents. Traditional numerical models struggle with stochastic subgrid-scale\nprocesses, while recent deep learning models often produce blurry results. To\naddress these challenges, we propose a physics-inspired deep learning framework\nfor high-resolution (0.05\\textdegree{} $\\times$ 0.05\\textdegree{}) ensemble\nprecipitation forecasting. Trained on ERA5 and CMPA high-resolution\nprecipitation datasets, the framework integrates deterministic and\nprobabilistic components. The deterministic model, based on a 3D\nSwinTransformer, captures average precipitation at mesoscale resolution and\nincorporates strategies to enhance performance, particularly for moderate to\nheavy rainfall. The probabilistic model employs conditional diffusion in latent\nspace to account for uncertainties in residual precipitation at convective\nscales. During inference, ensemble members are generated by repeatedly sampling\nlatent variables, enabling the model to represent precipitation uncertainty.\nOur model significantly enhances spatial resolution and forecast accuracy. Rank\nhistogram shows that the ensemble system is reliable and unbiased. In a case\nstudy of heavy precipitation in southern China, the model outputs align more\nclosely with observed precipitation distributions than ERA5, demonstrating\nsuperior capability in capturing extreme precipitation events. Additionally,\n5-day real-time forecasts show good performance in terms of CSI scores.", "paper_summary_zh": "高解析度降水預測對於提供準確的天氣預測和支持對極端天氣事件的有效應對至關重要。傳統的數值模型難以處理隨機子網格尺度過程，而最近的深度學習模型通常會產生模糊的結果。為了應對這些挑戰，我們提出了一個受物理啟發的深度學習框架，用於高解析度 (0.05\\textdegree{} $\\times$ 0.05\\textdegree{}) 集合降水預測。該框架在 ERA5 和 CMPA 高解析度降水數據集上進行訓練，集成了確定性和概率性組成部分。確定性模型基於 3D SwinTransformer，捕捉中尺度解析度的平均降水量，並結合策略來增強性能，特別是對於中到大雨。概率性模型採用潛在空間中的條件擴散來考慮對流尺度上殘餘降水的影響。在推理過程中，通過重複採樣潛在變量來生成集合成員，使模型能夠表示降水不確定性。我們的模型顯著提高了空間解析度和預測精度。秩直方圖顯示集合系統是可靠且無偏差的。在中國南部大暴雨的案例研究中，模型輸出與觀測到的降水分佈相比，與 ERA5 更為接近，展示了捕捉極端降水事件的卓越能力。此外，5 天的實時預測在 CSI 分數方面表現良好。", "author": "Shuangshuang He et.al.", "authors": "Shuangshuang He, Hongli Liang, Yuanting Zhang, Xingyuan Yuan", "id": "2501.02905v1", "paper_url": "http://arxiv.org/abs/2501.02905v1", "repo": "null"}}