{"2501.11447": {"publish_time": "2025-01-20", "title": "Decomposing Interventional Causality into Synergistic, Redundant, and Unique Components", "paper_summary": "We introduce a novel framework for decomposing interventional causal effects\ninto synergistic, redundant, and unique components, building on the intuition\nof Partial Information Decomposition (PID) and the principle of M\\\"obius\ninversion. While recent work has explored a similar decomposition of an\nobservational measure, we argue that a proper causal decomposition must be\ninterventional in nature. We develop a mathematical approach that\nsystematically quantifies how causal power is distributed among variables in a\nsystem, using a recently derived closed-form expression for the M\\\"obius\nfunction of the redundancy lattice. The formalism is then illustrated by\ndecomposing the causal power in logic gates, cellular automata, and chemical\nreaction networks. Our results reveal how the distribution of causal power can\nbe context- and parameter-dependent. This decomposition provides new insights\ninto complex systems by revealing how causal influences are shared and combined\namong multiple variables, with potential applications ranging from attribution\nof responsibility in legal or AI systems, to the analysis of biological\nnetworks or climate models.", "paper_summary_zh": "我們引進一個新穎的架構，用來將介入因果關係分解為協同、冗餘和獨特成分，建立在局部資訊分解 (PID) 的直覺和莫比烏斯反演原理之上。雖然最近的研究探索了觀測測量的類似分解，我們主張適當的因果分解本質上必須是介入的。我們開發了一種數學方法，系統性地量化因果力如何在系統中的變數間分配，使用最近衍生的冗餘格的莫比烏斯函數閉合形式表達式。形式主義隨後透過分解邏輯閘、細胞自動機和化學反應網路中的因果力來說明。我們的結果揭示了因果力的分配如何可能是依賴於脈絡和參數的。這個分解透過揭示因果影響如何在多個變數間共享和組合，提供了對複雜系統的新見解，潛在應用從法律或 AI 系統中責任的歸屬，到生物網路或氣候模型的分析。", "author": "Abel Jansma et.al.", "authors": "Abel Jansma", "id": "2501.11447v1", "paper_url": "http://arxiv.org/abs/2501.11447v1", "repo": "null"}}