{"2406.03001": {"publish_time": "2024-06-05", "title": "EdgeSync: Faster Edge-model Updating via Adaptive Continuous Learning for Video Data Drift", "paper_summary": "Real-time video analytics systems typically place models with fewer weights\non edge devices to reduce latency. The distribution of video content features\nmay change over time for various reasons (i.e. light and weather change) ,\nleading to accuracy degradation of existing models, to solve this problem,\nrecent work proposes a framework that uses a remote server to continually train\nand adapt the lightweight model at edge with the help of complex model.\nHowever, existing analytics approaches leave two challenges untouched: firstly,\nretraining task is compute-intensive, resulting in large model update delays;\nsecondly, new model may not fit well enough with the data distribution of the\ncurrent video stream. To address these challenges, in this paper, we present\nEdgeSync, EdgeSync filters the samples by considering both timeliness and\ninference results to make training samples more relevant to the current video\ncontent as well as reduce the update delay, to improve the quality of training,\nEdgeSync also designs a training management module that can efficiently adjusts\nthe model training time and training order on the runtime. By evaluating real\ndatasets with complex scenes, our method improves about 3.4% compared to\nexisting methods and about 10% compared to traditional means.", "paper_summary_zh": "实时视频分析系统通常在边缘设备上放置权重较少的模型以减少延迟。视频内容特征的分布可能因各种原因（即光线和天气变化）而随时间变化，从而导致现有模型的准确性下降，为了解决这个问题，最近的工作提出了一种使用远程服务器来持续训练和调整边缘设备上的轻量级模型的框架，在复杂模型的帮助下。然而，现有的分析方法留下了两个未解决的挑战：首先，重新训练任务计算密集，导致模型更新延迟大；其次，新模型可能与当前视频流的数据分布不够匹配。为了应对这些挑战，在本文中，我们提出了 EdgeSync，EdgeSync 通过考虑及时性和推理结果来过滤样本，以使训练样本与当前视频内容更相关，并减少更新延迟，以提高训练质量，EdgeSync 还设计了一个训练管理模块，可以在运行时有效地调整模型训练时间和训练顺序。通过评估具有复杂场景的真实数据集，我们的方法与现有方法相比提高了约 3.4%，与传统方法相比提高了约 10%。", "author": "Peng Zhao et.al.", "authors": "Peng Zhao, Runchu Dong, Guiqin Wang, Cong Zhao", "id": "2406.03001v1", "paper_url": "http://arxiv.org/abs/2406.03001v1", "repo": "null"}}