{"2502.01925": {"publish_time": "2025-02-04", "title": "PANDAS: Improving Many-shot Jailbreaking via Positive Affirmation, Negative Demonstration, and Adaptive Sampling", "paper_summary": "Many-shot jailbreaking circumvents the safety alignment of large language\nmodels by exploiting their ability to process long input sequences. To achieve\nthis, the malicious target prompt is prefixed with hundreds of fabricated\nconversational turns between the user and the model. These fabricated exchanges\nare randomly sampled from a pool of malicious questions and responses, making\nit appear as though the model has already complied with harmful instructions.\nIn this paper, we present PANDAS: a hybrid technique that improves many-shot\njailbreaking by modifying these fabricated dialogues with positive\naffirmations, negative demonstrations, and an optimized adaptive sampling\nmethod tailored to the target prompt's topic. Extensive experiments on AdvBench\nand HarmBench, using state-of-the-art LLMs, demonstrate that PANDAS\nsignificantly outperforms baseline methods in long-context scenarios. Through\nan attention analysis, we provide insights on how long-context vulnerabilities\nare exploited and show how PANDAS further improves upon many-shot jailbreaking.", "paper_summary_zh": "多發式越獄透過利用大型語言模型處理長輸入序列的能力，規避了其安全比對。為達成此目的，惡意目標提示詞會加上數百個使用者與模型之間捏造的對話回合。這些捏造的對話會從惡意問題與回應的池中隨機抽樣，讓模型看起來已經遵循了有害的指令。在本文中，我們提出 PANDAS：一種透過修改這些捏造的對話，加入正向肯定、負面示範，以及根據目標提示詞主題量身打造的最佳化自適應抽樣方法，來改善多發式越獄的混合技術。在使用最先進 LLM 的 AdvBench 和 HarmBench 上進行的廣泛實驗顯示，PANDAS 在長脈絡場景中顯著優於基線方法。透過關注分析，我們提供了有關如何利用長脈絡漏洞的見解，並展示 PANDAS 如何進一步改善多發式越獄。", "author": "Avery Ma et.al.", "authors": "Avery Ma, Yangchen Pan, Amir-massoud Farahmand", "id": "2502.01925v1", "paper_url": "http://arxiv.org/abs/2502.01925v1", "repo": "null"}}