{"2409.18819": {"publish_time": "2024-09-27", "title": "Local Transcription Models in Home Care Nursing in Switzerland: an Interdisciplinary Case Study", "paper_summary": "Latest advances in the field of natural language processing (NLP) enable new\nuse cases for different domains, including the medical sector. In particular,\ntranscription can be used to support automation in the nursing documentation\nprocess and give nurses more time to interact with the patients. However,\ndifferent challenges including (a) data privacy, (b) local languages and\ndialects, and (c) domain-specific vocabulary need to be addressed. In this case\nstudy, we investigate the case of home care nursing documentation in\nSwitzerland. We assessed different transcription tools and models, and\nconducted several experiments with OpenAI Whisper, involving different\nvariations of German (i.e., dialects, foreign accent) and manually curated\nexample texts by a domain expert of home care nursing. Our results indicate\nthat even the used out-of-the-box model performs sufficiently well to be a good\nstarting point for future research in the field.", "paper_summary_zh": "自然語言處理 (NLP) 領域的最新進展為包括醫療領域在內的不同領域提供了新的用例。特別是，轉錄可用於支援護理文件處理中的自動化，並讓護理人員有更多時間與患者互動。然而，需要解決包括 (a) 資料隱私、(b) 地方語言和方言，以及 (c) 領域特定詞彙在內的不同挑戰。在本案例研究中，我們調查了瑞士居家護理文件處理的案例。我們評估了不同的轉錄工具和模型，並使用 OpenAI Whisper 進行了多項實驗，涉及德語的不同變體（即方言、外語口音）和居家護理領域專家手動整理的範例文字。我們的結果表明，即使使用現成的模型也能表現得足夠好，足以作為該領域未來研究的良好起點。", "author": "Jeremy Kramer et.al.", "authors": "Jeremy Kramer, Tetiana Kravchenko, Beatrice Kaufmann, Friederike J. S. Thilo, Mascha Kurpicz-Briki", "id": "2409.18819v1", "paper_url": "http://arxiv.org/abs/2409.18819v1", "repo": "null"}}