{"2408.12798": {"publish_time": "2024-08-23", "title": "BackdoorLLM: A Comprehensive Benchmark for Backdoor Attacks on Large Language Models", "paper_summary": "Generative Large Language Models (LLMs) have made significant strides across\nvarious tasks, but they remain vulnerable to backdoor attacks, where specific\ntriggers in the prompt cause the LLM to generate adversary-desired responses.\nWhile most backdoor research has focused on vision or text classification\ntasks, backdoor attacks in text generation have been largely overlooked. In\nthis work, we introduce \\textit{BackdoorLLM}, the first comprehensive benchmark\nfor studying backdoor attacks on LLMs. \\textit{BackdoorLLM} features: 1) a\nrepository of backdoor benchmarks with a standardized training pipeline, 2)\ndiverse attack strategies, including data poisoning, weight poisoning, hidden\nstate attacks, and chain-of-thought attacks, 3) extensive evaluations with over\n200 experiments on 8 attacks across 7 scenarios and 6 model architectures, and\n4) key insights into the effectiveness and limitations of backdoors in LLMs. We\nhope \\textit{BackdoorLLM} will raise awareness of backdoor threats and\ncontribute to advancing AI safety. The code is available at\n\\url{https://github.com/bboylyg/BackdoorLLM}.", "paper_summary_zh": "生成式大型語言模型 (LLM) 在各項任務中已取得顯著進展，但它們仍然容易受到後門攻擊，而後門攻擊中提示中的特定觸發因素會導致 LLM 產生對手想要的回應。雖然大多數後門研究都集中在視覺或文本分類任務上，但文本生成中的後門攻擊在很大程度上被忽視了。在這項工作中，我們介紹了 \\textit{BackdoorLLM}，這是第一個針對 LLM 上後門攻擊進行研究的綜合基準測試。\\textit{BackdoorLLM} 的特點：1) 具有標準化訓練管線的後門基準測試儲存庫，2) 多樣化的攻擊策略，包括資料中毒、權重中毒、隱藏狀態攻擊和思維鏈攻擊，3) 在 7 個場景和 6 個模型架構中對 8 次攻擊進行了 200 多次實驗的廣泛評估，以及 4) 對 LLM 中後門的有效性和限制的主要見解。我們希望 \\textit{BackdoorLLM} 能提高人們對後門威脅的認識，並有助於推進 AI 安全。程式碼可在 \\url{https://github.com/bboylyg/BackdoorLLM} 取得。", "author": "Yige Li et.al.", "authors": "Yige Li, Hanxun Huang, Yunhan Zhao, Xingjun Ma, Jun Sun", "id": "2408.12798v1", "paper_url": "http://arxiv.org/abs/2408.12798v1", "repo": "null"}}