{"2409.07725": {"publish_time": "2024-09-12", "title": "GRE^2-MDCL: Graph Representation Embedding Enhanced via Multidimensional Contrastive Learning", "paper_summary": "Graph representation learning has emerged as a powerful tool for preserving\ngraph topology when mapping nodes to vector representations, enabling various\ndownstream tasks such as node classification and community detection. However,\nmost current graph neural network models face the challenge of requiring\nextensive labeled data, which limits their practical applicability in\nreal-world scenarios where labeled data is scarce. To address this challenge,\nresearchers have explored Graph Contrastive Learning (GCL), which leverages\nenhanced graph data and contrastive learning techniques. While promising,\nexisting GCL methods often struggle with effectively capturing both local and\nglobal graph structures, and balancing the trade-off between nodelevel and\ngraph-level representations. In this work, we propose Graph Representation\nEmbedding Enhanced via Multidimensional Contrastive Learning (GRE2-MDCL). Our\nmodel introduces a novel triple network architecture with a multi-head\nattention GNN as the core. GRE2-MDCL first globally and locally augments the\ninput graph using SVD and LAGNN techniques. It then constructs a\nmultidimensional contrastive loss, incorporating cross-network, cross-view, and\nneighbor contrast, to optimize the model. Extensive experiments on benchmark\ndatasets Cora, Citeseer, and PubMed demonstrate that GRE2-MDCL achieves\nstate-of-the-art performance, with average accuracies of 82.5%, 72.5%, and\n81.6% respectively. Visualizations further show tighter intra-cluster\naggregation and clearer inter-cluster boundaries, highlighting the\neffectiveness of our framework in improving upon baseline GCL models.", "paper_summary_zh": "圖形表徵學習已成為一種強大的工具，用於在將節點對應到向量表徵時保留圖形拓撲，進而能進行各種下游任務，例如節點分類和社群偵測。然而，目前大多數圖形神經網路模型都面臨需要大量標籤資料的挑戰，這限制了它們在標籤資料稀少的實際場景中的實際應用性。為了應對這一挑戰，研究人員探索了圖形對比學習 (GCL)，它利用增強的圖形資料和對比學習技術。雖然有前景，但現有的 GCL 方法通常難以有效擷取局部和全域圖形結構，並平衡節點級和圖形級表徵之間的權衡。在這項工作中，我們提出了透過多維度對比學習增強的圖形表徵嵌入 (GRE2-MDCL)。我們的模型引入了一種新穎的三重網路架構，以多頭注意力 GNN 為核心。GRE2-MDCL 首先使用 SVD 和 LAGNN 技術在全域和局部增強輸入圖形。然後，它建構一個多維度對比損失，結合跨網路、跨視圖和鄰近對比，以最佳化模型。在基準資料集 Cora、Citeseer 和 PubMed 上進行的廣泛實驗證明，GRE2-MDCL 達到了最先進的效能，平均準確率分別為 82.5%、72.5% 和 81.6%。可視化進一步顯示出更緊密的群集內聚合和更清晰的群集間界線，突顯了我們的架構在改善基準 GCL 模型方面的有效性。", "author": "Kaizhe Fan et.al.", "authors": "Kaizhe Fan, Quanjun Li", "id": "2409.07725v1", "paper_url": "http://arxiv.org/abs/2409.07725v1", "repo": "null"}}