{"2411.09844": {"publish_time": "2024-11-14", "title": "Deep Autoencoders for Unsupervised Anomaly Detection in Wildfire Prediction", "paper_summary": "Wildfires pose a significantly increasing hazard to global ecosystems due to\nthe climate crisis. Due to its complex nature, there is an urgent need for\ninnovative approaches to wildfire prediction, such as machine learning. This\nresearch took a unique approach, differentiating from classical supervised\nlearning, and addressed the gap in unsupervised wildfire prediction using\nautoencoders and clustering techniques for anomaly detection. Historical\nweather and normalised difference vegetation index datasets of Australia for\n2005 - 2021 were utilised. Two main unsupervised approaches were analysed. The\nfirst used a deep autoencoder to obtain latent features, which were then fed\ninto clustering models, isolation forest, local outlier factor and one-class\nSVM for anomaly detection. The second approach used a deep autoencoder to\nreconstruct the input data and use reconstruction errors to identify anomalies.\nLong Short-Term Memory (LSTM) autoencoders and fully connected (FC)\nautoencoders were employed in this part, both in an unsupervised way learning\nonly from nominal data. The FC autoencoder outperformed its counterparts,\nachieving an accuracy of 0.71, an F1-score of 0.74, and an MCC of 0.42. These\nfindings highlight the practicality of this method, as it effectively predicts\nwildfires in the absence of ground truth, utilising an unsupervised learning\ntechnique.", "paper_summary_zh": "野火因气候危机对全球生态系统构成日益严重的危害。由于其复杂性，迫切需要采用创新方法来预测野火，例如机器学习。本研究采取了一种独特的方法，区别于经典的监督学习，并使用自动编码器和聚类技术解决了无监督野火预测中的差距，用于异常检测。利用了 2005 年至 2021 年澳大利亚的历史天气和归一化差异植被指数数据集。分析了两种主要的无监督方法。第一个使用深度自动编码器来获取潜在特征，然后将其输入聚类模型、隔离森林、局部异常因子和一类 SVM 以进行异常检测。第二种方法使用深度自动编码器来重建输入数据并使用重建误差来识别异常。长短期记忆 (LSTM) 自动编码器和全连接 (FC) 自动编码器用于这部分，两者都以无监督的方式仅从标称数据中学习。FC 自动编码器优于其对应项，准确率达到 0.71，F1 分数为 0.74，MCC 为 0.42。这些发现突出了该方法的实用性，因为它在没有地面真实值的情况下有效地预测野火，利用无监督学习技术。", "author": "İrem Üstek et.al.", "authors": "İrem Üstek, Miguel Arana-Catania, Alexander Farr, Ivan Petrunin", "id": "2411.09844v1", "paper_url": "http://arxiv.org/abs/2411.09844v1", "repo": "null"}}