{"2408.11799": {"publish_time": "2024-08-21", "title": "Practical token pruning for foundation models in few-shot conversational virtual assistant systems", "paper_summary": "In an enterprise Virtual Assistant (VA) system, intent classification is the\ncrucial component that determines how a user input is handled based on what the\nuser wants. The VA system is expected to be a cost-efficient SaaS service with\nlow training and inference time while achieving high accuracy even with a small\nnumber of training samples. We pretrain a transformer-based sentence embedding\nmodel with a contrastive learning objective and leverage the embedding of the\nmodel as features when training intent classification models. Our approach\nachieves the state-of-the-art results for few-shot scenarios and performs\nbetter than other commercial solutions on popular intent classification\nbenchmarks. However, generating features via a transformer-based model\nincreases the inference time, especially for longer user inputs, due to the\nquadratic runtime of the transformer's attention mechanism. On top of model\ndistillation, we introduce a practical multi-task adaptation approach that\nconfigures dynamic token pruning without the need for task-specific training\nfor intent classification. We demonstrate that this approach improves the\ninference speed of popular sentence transformer models without affecting model\nperformance.", "paper_summary_zh": "在企業虛擬助理 (VA) 系統中，意圖分類是基於使用者想要什麼來決定如何處理使用者輸入的關鍵組成部分。VA 系統預計將成為具有低訓練和推理時間的高成本效益 SaaS 服務，即使訓練樣本數量很少也能達到高準確度。我們使用對比學習目標預訓練基於轉換器的句子嵌入模型，並在訓練意圖分類模型時利用模型的嵌入作為特徵。我們的做法達到了少量場景的最新結果，並且在流行的意圖分類基準上優於其他商業解決方案。然而，通過基於轉換器的模型生成特徵會增加推理時間，特別是對於較長的使用者輸入，這是由於轉換器注意力機制的二次執行時間。在模型蒸餾之上，我們引入了一種實用的多任務適應方法，該方法配置動態令牌修剪，而無需針對意圖分類進行特定任務的訓練。我們證明這種方法提高了流行句子轉換器模型的推理速度，而不會影響模型效能。", "author": "Haode Qi et.al.", "authors": "Haode Qi, Cheng Qian, Jian Ni, Pratyush Singh, Reza Fazeli, Gengyu Wang, Zhongzheng Shu, Eric Wayne, Juergen Bross", "id": "2408.11799v1", "paper_url": "http://arxiv.org/abs/2408.11799v1", "repo": "null"}}