{"2410.08115": {"publish_time": "2024-10-10", "title": "Optima: Optimizing Effectiveness and Efficiency for LLM-Based Multi-Agent System", "paper_summary": "Large Language Model (LLM) based multi-agent systems (MAS) show remarkable\npotential in collaborative problem-solving, yet they still face critical\nchallenges: low communication efficiency, poor scalability, and a lack of\neffective parameter-updating optimization methods. We present Optima, a novel\nframework that addresses these issues by significantly enhancing both\ncommunication efficiency and task effectiveness in LLM-based MAS through LLM\ntraining. Optima employs an iterative generate, rank, select, and train\nparadigm with a reward function balancing task performance, token efficiency,\nand communication readability. We explore various RL algorithms, including\nSupervised Fine-Tuning, Direct Preference Optimization, and their hybrid\napproaches, providing insights into their effectiveness-efficiency trade-offs.\nWe integrate Monte Carlo Tree Search-inspired techniques for DPO data\ngeneration, treating conversation turns as tree nodes to explore diverse\ninteraction paths. Evaluated on common multi-agent tasks, including\ninformation-asymmetric question answering and complex reasoning, Optima shows\nconsistent and substantial improvements over single-agent baselines and vanilla\nMAS based on Llama 3 8B, achieving up to 2.8x performance gain with less than\n10\\% tokens on tasks requiring heavy information exchange. Moreover, Optima's\nefficiency gains open new possibilities for leveraging inference-compute more\neffectively, leading to improved inference-time scaling laws. By addressing\nfundamental challenges in LLM-based MAS, Optima shows the potential towards\nscalable, efficient, and effective MAS\n(https://chenweize1998.github.io/optima-project-page).", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 為基礎的多重代理系統 (MAS) 在協作問題解決方面展現了非凡的潛力，但仍面臨關鍵挑戰：低溝通效率、可擴充性差，以及缺乏有效的參數更新最佳化方法。我們提出 Optima，一個新穎的架構，透過 LLM 訓練大幅提升 LLM 為基礎的 MAS 中的溝通效率和任務效能，來解決這些問題。Optima 採用反覆生成、排名、選擇和訓練的範例，其獎勵函數平衡了任務表現、符號效率和溝通可讀性。我們探討了各種 RL 演算法，包括監督微調、直接偏好最佳化，以及其混合方法，進一步了解其效能效率的權衡取捨。我們整合了蒙地卡羅樹狀搜尋啟發的技術，用於 DPO 資料產生，將對話回合視為樹狀節點，以探索多樣化的互動路徑。在常見的多重代理任務中進行評估，包括資訊不對稱問答和複雜推理，Optima 在單一代理基準和基於 Llama 3 8B 的香草 MAS 上展現了一致且顯著的進步，在需要大量資訊交換的任務中，以不到 10% 的符號獲得了高達 2.8 倍的效能提升。此外，Optima 的效率提升為更有效地運用推理運算開啟了新的可能性，進而改善推理時間的縮放定律。透過解決 LLM 為基礎的 MAS 中的基本挑戰，Optima 展現了邁向可擴充、高效和有效的 MAS 的潛力\n(https://chenweize1998.github.io/optima-project-page)。</paragraph>", "author": "Weize Chen et.al.", "authors": "Weize Chen, Jiarui Yuan, Chen Qian, Cheng Yang, Zhiyuan Liu, Maosong Sun", "id": "2410.08115v1", "paper_url": "http://arxiv.org/abs/2410.08115v1", "repo": "null"}}