{"2406.18034": {"publish_time": "2024-06-26", "title": "LLMs for Doctors: Leveraging Medical LLMs to Assist Doctors, Not Replace Them", "paper_summary": "The recent success of Large Language Models (LLMs) has had a significant\nimpact on the healthcare field, providing patients with medical advice,\ndiagnostic information, and more. However, due to a lack of professional\nmedical knowledge, patients are easily misled by generated erroneous\ninformation from LLMs, which may result in serious medical problems. To address\nthis issue, we focus on tuning the LLMs to be medical assistants who\ncollaborate with more experienced doctors. We first conduct a two-stage survey\nby inspiration-feedback to gain a broad understanding of the real needs of\ndoctors for medical assistants. Based on this, we construct a Chinese medical\ndataset called DoctorFLAN to support the entire workflow of doctors, which\nincludes 92K Q\\&A samples from 22 tasks and 27 specialists. Moreover, we\nevaluate LLMs in doctor-oriented scenarios by constructing the\nDoctorFLAN-\\textit{test} containing 550 single-turn Q\\&A and DotaBench\ncontaining 74 multi-turn conversations. The evaluation results indicate that\nbeing a medical assistant still poses challenges for existing open-source\nmodels, but DoctorFLAN can help them significantly. It demonstrates that the\ndoctor-oriented dataset and benchmarks we construct can complement existing\npatient-oriented work and better promote medical LLMs research.", "paper_summary_zh": "大型語言模型 (LLM) 近期的成功對醫療領域產生了重大影響，為患者提供醫療建議、診斷資訊等。然而，由於缺乏專業的醫療知識，患者很容易被 LLM 生成的錯誤資訊誤導，這可能會導致嚴重的醫療問題。為了解決這個問題，我們專注於調整 LLM，使其成為與經驗豐富的醫生合作的醫療助理。我們首先進行一項兩階段的調查，透過靈感回饋來廣泛了解醫生對醫療助理的實際需求。基於此，我們構建了一個名為 DoctorFLAN 的中文醫療資料集，以支援醫生的整個工作流程，其中包括來自 22 個任務和 27 位專家的 92K 問答範例。此外，我們透過構建包含 550 個單回合問答的 DoctorFLAN-\\textit{test} 和包含 74 個多回合對話的 DotaBench，在面向醫生的場景中評估 LLM。評估結果表明，成為一名醫療助理對現有的開源模型來說仍然是一個挑戰，但 DoctorFLAN 可以為它們提供顯著的幫助。這證明了我們構建的面向醫生的資料集和基準可以補充現有的面向患者的工作，並更好地促進醫療 LLM 研究。", "author": "Wenya Xie et.al.", "authors": "Wenya Xie, Qingying Xiao, Yu Zheng, Xidong Wang, Junying Chen, Ke Ji, Anningzhe Gao, Xiang Wan, Feng Jiang, Benyou Wang", "id": "2406.18034v1", "paper_url": "http://arxiv.org/abs/2406.18034v1", "repo": "null"}}