{"2408.04909": {"publish_time": "2024-08-09", "title": "Surveying the Landscape of Image Captioning Evaluation: A Comprehensive Taxonomy and Novel Ensemble Method", "paper_summary": "The task of image captioning has recently been gaining popularity, and with\nit the complex task of evaluating the quality of image captioning models. In\nthis work, we present the first survey and taxonomy of over 70 different image\ncaptioning metrics and their usage in hundreds of papers. We find that despite\nthe diversity of proposed metrics, the vast majority of studies rely on only\nfive popular metrics, which we show to be weakly correlated with human\njudgements. Instead, we propose EnsembEval -- an ensemble of evaluation methods\nachieving the highest reported correlation with human judgements across 5 image\ncaptioning datasets, showing there is a lot of room for improvement by\nleveraging a diverse set of metrics.", "paper_summary_zh": "影像標題生成任務最近獲得廣泛關注，而評估影像標題生成模型品質的複雜任務也隨之而來。在本文中，我們提供首次調查和分類，涵蓋超過 70 種不同的影像標題生成指標，以及它們在數百篇論文中的使用方式。我們發現，儘管提出了多樣化的指標，但絕大多數研究僅依賴五種熱門指標，而我們證明這些指標與人為判斷相關性較弱。相反地，我們提出 EnsembEval，這是一種評估方法的集合，在 5 個影像標題生成資料集上與人為判斷達到最高相關性，顯示透過利用多樣化的指標集合，有很大的改進空間。", "author": "Uri Berger et.al.", "authors": "Uri Berger, Gabriel Stanovsky, Omri Abend, Lea Frermann", "id": "2408.04909v1", "paper_url": "http://arxiv.org/abs/2408.04909v1", "repo": "null"}}