{"2501.13884": {"publish_time": "2025-01-23", "title": "Exploring Finetuned Audio-LLM on Heart Murmur Features", "paper_summary": "Large language models (LLMs) for audio have excelled in recognizing and\nanalyzing human speech, music, and environmental sounds. However, their\npotential for understanding other types of sounds, particularly biomedical\nsounds, remains largely underexplored despite significant scientific interest.\nIn this study, we focus on diagnosing cardiovascular diseases using\nphonocardiograms, i.e., heart sounds. Most existing deep neural network (DNN)\nparadigms are restricted to heart murmur classification (healthy vs unhealthy)\nand do not predict other acoustic features of the murmur such as timing,\ngrading, harshness, pitch, and quality, which are important in helping\nphysicians diagnose the underlying heart conditions. We propose to finetune an\naudio LLM, Qwen2-Audio, on the PhysioNet CirCor DigiScope phonocardiogram (PCG)\ndataset and evaluate its performance in classifying 11 expert-labeled murmur\nfeatures. Additionally, we aim to achieve more noise-robust and generalizable\nsystem by exploring a preprocessing segmentation algorithm using an audio\nrepresentation model, SSAMBA. Our results indicate that the LLM-based model\noutperforms state-of-the-art methods in 8 of the 11 features and performs\ncomparably in the remaining 3. Moreover, the LLM successfully classifies\nlong-tail murmur features with limited training data, a task that all previous\nmethods have failed to classify. These findings underscore the potential of\naudio LLMs as assistants to human cardiologists in enhancing heart disease\ndiagnosis.", "paper_summary_zh": "大型語言模型 (LLM) 在識別和分析人類語言、音樂和環境音方面表現出色。然而，儘管科學界對此有濃厚的興趣，但它們在理解其他類型的聲音，特別是生物醫學聲音方面的潛力在很大程度上仍未得到充分探索。在本研究中，我們專注於使用心音圖（即心音）診斷心血管疾病。現有的大多數深度神經網路 (DNN) 典範僅限於心雜音分類（健康與不健康），並且不會預測雜音的其他聲學特徵，例如時序、分級、粗糙度、音高和品質，這些特徵對於幫助醫生診斷潛在的心臟疾病非常重要。我們建議對音訊 LLM Qwen2-Audio 進行微調，使用 PhysioNet CirCor DigiScope 心音圖 (PCG) 資料集，並評估其在分類 11 個專家標記雜音特徵方面的效能。此外，我們旨在透過探索使用音訊表示模型 SSAMBA 的預處理分割演算法，來實現更強大的抗噪性和可概化的系統。我們的結果表明，基於 LLM 的模型在 11 個特徵中的 8 個特徵中優於最先進的方法，而在其餘 3 個特徵中表現相當。此外，LLM 成功地對具有有限訓練資料的長尾雜音特徵進行分類，這是以前所有方法都無法分類的一項任務。這些發現強調了音訊 LLM 作為人類心臟病專家的助手在增強心臟病診斷方面的潛力。", "author": "Adrian Florea et.al.", "authors": "Adrian Florea, Xilin Jiang, Nima Mesgarani, Xiaofan Jiang", "id": "2501.13884v1", "paper_url": "http://arxiv.org/abs/2501.13884v1", "repo": "null"}}