{"2410.01591": {"publish_time": "2024-10-02", "title": "Imaging foundation model for universal enhancement of non-ideal measurement CT", "paper_summary": "Non-ideal measurement computed tomography (NICT), which sacrifices optimal\nimaging standards for new advantages in CT imaging, is expanding the clinical\napplication scope of CT images. However, with the reduction of imaging\nstandards, the image quality has also been reduced, extremely limiting the\nclinical acceptability. Although numerous studies have demonstrated the\nfeasibility of deep learning for the NICT enhancement in specific scenarios,\ntheir high data cost and limited generalizability have become large obstacles.\nThe recent research on the foundation model has brought new opportunities for\nbuilding a universal NICT enhancement model - bridging the image quality\ndegradation with minimal data cost. However, owing to the challenges in the\ncollection of large pre-training datasets and the compatibility of data\nvariation, no success has been reported. In this paper, we propose a\nmulti-scale integrated Transformer AMPlifier (TAMP), the first imaging\nfoundation model for universal NICT enhancement. It has been pre-trained on a\nlarge-scale physical-driven simulation dataset with 3.6 million NICT-ICT image\npairs, and is able to directly generalize to the NICT enhancement tasks with\nvarious non-ideal settings and body regions. Via the adaptation with few data,\nit can further achieve professional performance in real-world specific\nscenarios. Our extensive experiments have demonstrated that the proposed TAMP\nhas significant potential for promoting the exploration and application of NICT\nand serving a wider range of medical scenarios.", "paper_summary_zh": "非理想測量電腦斷層掃描 (NICT) 犧牲了最佳影像標準以換取電腦斷層掃描影像的新優勢，正在擴展電腦斷層影像的臨床應用範圍。然而，隨著影像標準的降低，影像品質也隨之降低，極大地限制了臨床可接受性。儘管許多研究已證明深度學習在特定場景中可行，但其高資料成本和有限的概括性已成為重大的障礙。最近對基礎模型的研究為建立通用 NICT 增強模型帶來了新的機會，以最小的資料成本彌合影像品質下降的問題。然而，由於收集大型預訓練資料集和資料變異的相容性方面的挑戰，尚未報告成功。在本文中，我們提出了一個多尺度整合Transformer放大器 (TAMP)，這是第一個用於通用 NICT 增強的影像基礎模型。它已在一個包含 360 萬個 NICT-ICT 影像對的大型物理驅動模擬資料集上進行預訓練，並且能夠直接概括到具有各種非理想設定和身體區域的 NICT 增強任務。透過少數資料的適應，它可以在現實世界的特定場景中進一步實現專業效能。我們的廣泛實驗表明，所提出的 TAMP 具有促進 NICT 的探索和應用並服務於更廣泛的醫療場景的巨大潛力。", "author": "Yuxin Liu et.al.", "authors": "Yuxin Liu, Rongjun Ge, Yuting He, Zhan Wu, Chenyu You, Shuo Li, Yang Chen", "id": "2410.01591v1", "paper_url": "http://arxiv.org/abs/2410.01591v1", "repo": "https://github.com/yutinghe-list/tamp"}}