{"2501.08922": {"publish_time": "2025-01-15", "title": "Modeling Melt Pool Features and Spatter Using Symbolic Regression and Machine Learning", "paper_summary": "Additive manufacturing (AM) is a rapidly evolving technology that has\nattracted applications across a wide range of fields due to its ability to\nfabricate complex geometries. However, one of the key challenges in AM is\nachieving consistent print quality. This inconsistency is often attributed to\nuncontrolled melt pool dynamics, partly caused by spatter which can lead to\ndefects. Therefore, capturing and controlling the evolution of the melt pool is\ncrucial for enhancing process stability and part quality. In this study, we\ndeveloped a framework to support decision-making in AM operations, facilitating\nquality control and minimizing defects via machine learning (ML) and polynomial\nsymbolic regression models. We implemented experimentally validated\ncomputational tools as a cost-effective approach to collect large datasets from\nlaser powder bed fusion (LPBF) processes. For a dataset consisting of 281\nprocess conditions, parameters such as melt pool dimensions (length, width,\ndepth), melt pool geometry (area, volume), and volume indicated as spatter were\nextracted. Using machine learning (ML) and polynomial symbolic regression\nmodels, a high R2 of over 95 % was achieved in predicting the melt pool\ndimensions and geometry features for both the training and testing datasets,\nwith either process conditions (power and velocity) or melt pool dimensions as\nthe model inputs. In the case of volume indicated as spatter, R2 improved after\nlogarithmic transforming the model inputs, which was either the process\nconditions or the melt pool dimensions. Among the investigated ML models, the\nExtraTree model achieved the highest R2 values of 96.7 % and 87.5 %.", "paper_summary_zh": "增材製造 (AM) 是一項快速發展的技術，由於其製造複雜幾何形狀的能力，在廣泛的領域中備受關注。然而，AM 的主要挑戰之一是實現一致的列印品質。這種不一致性通常歸因於熔池動力學不受控，部分原因是飛濺可能導致缺陷。因此，捕捉和控制熔池的演變對於提高製程穩定性和零件品質至關重要。在本研究中，我們開發了一個架構來支援 AM 作業中的決策制定，透過機器學習 (ML) 和多項式符號回歸模型，促進品質控管並將缺陷降至最低。我們實作了經過實驗驗證的計算工具，作為一種具成本效益的方法，從雷射粉末床熔合 (LPBF) 製程中收集大型資料集。對於由 281 個製程條件組成的資料集，萃取了熔池尺寸（長度、寬度、深度）、熔池幾何形狀（面積、體積）和標示為飛濺的體積等參數。使用機器學習 (ML) 和多項式符號回歸模型，在訓練和測試資料集中預測熔池尺寸和幾何特徵時，達到了超過 95% 的高 R2，模型輸入為製程條件（功率和速度）或熔池尺寸。在標示為飛濺的體積情況下，在對模型輸入（製程條件或熔池尺寸）進行對數轉換後，R2 有所提升。在所調查的 ML 模型中，ExtraTree 模型達到了最高的 R2 值，分別為 96.7% 和 87.5%。", "author": "Olabode T. Ajenifujah et.al.", "authors": "Olabode T. Ajenifujah, Amir Barati Farimani", "id": "2501.08922v1", "paper_url": "http://arxiv.org/abs/2501.08922v1", "repo": "null"}}