{"2501.17479": {"publish_time": "2025-01-29", "title": "DFPE: A Diverse Fingerprint Ensemble for Enhancing LLM Performance", "paper_summary": "Large Language Models (LLMs) have shown remarkable capabilities across\nvarious natural language processing tasks but often struggle to excel uniformly\nin diverse or complex domains. We propose a novel ensemble method - Diverse\nFingerprint Ensemble (DFPE), which leverages the complementary strengths of\nmultiple LLMs to achieve more robust performance. Our approach involves: (1)\nclustering models based on response \"fingerprints\" patterns, (2) applying a\nquantile-based filtering mechanism to remove underperforming models at a\nper-subject level, and (3) assigning adaptive weights to remaining models based\non their subject-wise validation accuracy. In experiments on the Massive\nMultitask Language Understanding (MMLU) benchmark, DFPE outperforms the best\nsingle model by 3% overall accuracy and 5% in discipline-level accuracy. This\nmethod increases the robustness and generalization of LLMs and underscores how\nmodel selection, diversity preservation, and performance-driven weighting can\neffectively address challenging, multi-faceted language understanding tasks.", "paper_summary_zh": "大型語言模型 (LLM) 在各種自然語言處理任務中展現出非凡的能力，但通常難以在多元或複雜的領域中全面表現優異。我們提出了一種新穎的整體方法 - 多元指紋整體 (DFPE)，它利用多個 LLM 的互補優勢來實現更穩健的效能。我們的方法包括：(1) 根據回應「指紋」模式對模型進行分群，(2) 應用基於分位數的過濾機制來移除在每個主題層級表現不佳的模型，以及 (3) 根據模型在每個主題的驗證準確度，為其分配自適應權重。在 Massive Multitask Language Understanding (MMLU) 基準測試的實驗中，DFPE 在整體準確度上優於最佳單一模型 3%，在學科層級準確度上優於 5%。此方法增加了 LLM 的穩健性和泛化性，並強調模型選擇、多元性保留和效能驅動的加權如何能有效地解決具有挑戰性的多面向語言理解任務。", "author": "Seffi Cohen et.al.", "authors": "Seffi Cohen, Niv Goldshlager, Nurit Cohen-Inger, Bracha Shapira, Lior Rokach", "id": "2501.17479v1", "paper_url": "http://arxiv.org/abs/2501.17479v1", "repo": "https://github.com/nivgold/dfpe"}}