{"2502.15681": {"publish_time": "2025-02-21", "title": "One-step Diffusion Models with $f$-Divergence Distribution Matching", "paper_summary": "Sampling from diffusion models involves a slow iterative process that hinders\ntheir practical deployment, especially for interactive applications. To\naccelerate generation speed, recent approaches distill a multi-step diffusion\nmodel into a single-step student generator via variational score distillation,\nwhich matches the distribution of samples generated by the student to the\nteacher's distribution. However, these approaches use the reverse\nKullback-Leibler (KL) divergence for distribution matching which is known to be\nmode seeking. In this paper, we generalize the distribution matching approach\nusing a novel $f$-divergence minimization framework, termed $f$-distill, that\ncovers different divergences with different trade-offs in terms of mode\ncoverage and training variance. We derive the gradient of the $f$-divergence\nbetween the teacher and student distributions and show that it is expressed as\nthe product of their score differences and a weighting function determined by\ntheir density ratio. This weighting function naturally emphasizes samples with\nhigher density in the teacher distribution, when using a less mode-seeking\ndivergence. We observe that the popular variational score distillation approach\nusing the reverse-KL divergence is a special case within our framework.\nEmpirically, we demonstrate that alternative $f$-divergences, such as\nforward-KL and Jensen-Shannon divergences, outperform the current best\nvariational score distillation methods across image generation tasks. In\nparticular, when using Jensen-Shannon divergence, $f$-distill achieves current\nstate-of-the-art one-step generation performance on ImageNet64 and zero-shot\ntext-to-image generation on MS-COCO. Project page:\nhttps://research.nvidia.com/labs/genair/f-distill", "paper_summary_zh": "從擴散模型中取樣涉及一個緩慢的迭代過程，這會阻礙它們的實際部署，特別是對於互動式應用程式。為了加速生成速度，最近的方法透過變異分數蒸餾將多步驟擴散模型提煉成單步驟學生生成器，這會將學生生成的樣本分佈與教師的分佈相匹配。然而，這些方法使用反向 Kullback-Leibler (KL) 散度進行分佈匹配，已知這會尋求模式。在本文中，我們使用新穎的 $f$-散度最小化架構，稱為 $f$-distill，將分佈匹配方法概括化，它涵蓋了具有不同模式覆蓋率和訓練變異折衷的不同散度。我們推導出教師和學生分佈之間的 $f$-散度的梯度，並表明它表示為它們的分數差的乘積和由它們的密度比決定的加權函數。當使用較少尋求模式的散度時，此加權函數自然會強調教師分佈中密度較高的樣本。我們觀察到使用反向 KL 散度的流行變異分數蒸餾方法是我們架構中的特例。根據經驗，我們證明了替代 $f$-散度，例如前向 KL 和 Jensen-Shannon 散度，在影像生成任務中優於目前最好的變異分數蒸餾方法。特別是，當使用 Jensen-Shannon 散度時，$f$-distill 在 ImageNet64 上實現了目前最先進的單步生成效能，以及在 MS-COCO 上實現了零次學習文字轉影像生成。專案頁面：\nhttps://research.nvidia.com/labs/genair/f-distill", "author": "Yilun Xu et.al.", "authors": "Yilun Xu, Weili Nie, Arash Vahdat", "id": "2502.15681v1", "paper_url": "http://arxiv.org/abs/2502.15681v1", "repo": "null"}}