{"2409.02489": {"publish_time": "2024-09-04", "title": "NeuroSpex: Neuro-Guided Speaker Extraction with Cross-Modal Attention", "paper_summary": "In the study of auditory attention, it has been revealed that there exists a\nrobust correlation between attended speech and elicited neural responses,\nmeasurable through electroencephalography (EEG). Therefore, it is possible to\nuse the attention information available within EEG signals to guide the\nextraction of the target speaker in a cocktail party computationally. In this\npaper, we present a neuro-guided speaker extraction model, i.e. NeuroSpex,\nusing the EEG response of the listener as the sole auxiliary reference cue to\nextract attended speech from monaural speech mixtures. We propose a novel EEG\nsignal encoder that captures the attention information. Additionally, we\npropose a cross-attention (CA) mechanism to enhance the speech feature\nrepresentations, generating a speaker extraction mask. Experimental results on\na publicly available dataset demonstrate that our proposed model outperforms\ntwo baseline models across various evaluation metrics.", "paper_summary_zh": "在聽覺注意力的研究中，已經發現被關注的言語和引發的神經反應之間存在穩固的關聯性，這可以用腦電圖 (EEG) 來測量。因此，可以利用 EEG 訊號中可用的注意力資訊，在計算雞尾酒會中引導目標說話者的提取。在本文中，我們提出了一個神經引導的說話者提取模型，即 NeuroSpex，它使用聽眾的 EEG 反應作為唯一的輔助參考線索，從單聲道語音混合中提取被關注的言語。我們提出了一個新穎的 EEG 訊號編碼器，它可以擷取注意力資訊。此外，我們提出了一個交叉注意力 (CA) 機制，以增強語音特徵表徵，生成說話者提取遮罩。在公開可用的資料集上的實驗結果表明，我們提出的模型在各種評估指標上都優於兩個基準模型。", "author": "Dashanka De Silva et.al.", "authors": "Dashanka De Silva, Siqi Cai, Saurav Pahuja, Tanja Schultz, Haizhou Li", "id": "2409.02489v1", "paper_url": "http://arxiv.org/abs/2409.02489v1", "repo": "null"}}