{"2503.19801": {"publish_time": "2025-03-25", "title": "SeLIP: Similarity Enhanced Contrastive Language Image Pretraining for Multi-modal Head MRI", "paper_summary": "Despite that deep learning (DL) methods have presented tremendous potential\nin many medical image analysis tasks, the practical applications of medical DL\nmodels are limited due to the lack of enough data samples with manual\nannotations. By noting that the clinical radiology examinations are associated\nwith radiology reports that describe the images, we propose to develop a\nfoundation model for multi-model head MRI by using contrastive learning on the\nimages and the corresponding radiology findings. In particular, a contrastive\nlearning framework is proposed, where a mixed syntax and semantic similarity\nmatching metric is integrated to reduce the thirst of extreme large dataset in\nconventional contrastive learning framework. Our proposed similarity enhanced\ncontrastive language image pretraining (SeLIP) is able to effectively extract\nmore useful features. Experiments revealed that our proposed SeLIP performs\nwell in many downstream tasks including image-text retrieval task,\nclassification task, and image segmentation, which highlights the importance of\nconsidering the similarities among texts describing different images in\ndeveloping medical image foundation models.", "paper_summary_zh": "<paragraph>儘管深度學習 (DL) 方法在許多醫學影像分析任務中展現出巨大的潛力，但由於缺乏足夠的手動標記數據樣本，醫學深度學習模型的實際應用仍然有限。注意到臨床放射學檢查與描述影像的放射學報告相關聯，我們提議開發一個基於多模態頭部 MRI 的基礎模型，並利用影像和相應放射學診斷結果進行對比學習。具體來說，我們提出了一個對比學習框架，其中整合了混合語法和語義相似性匹配指標，以減少傳統對比學習框架中對極大數據集的需求。我們提出的相似性增強型對比語言影像預訓練 (SeLIP)能夠有效地提取更多有用的特徵。實驗表明，我們提出的 SeLIP 在許多下游任務中表現良好，包括圖文檢索任務、分類任務和影像分割任務，這凸顯了在開發醫學影像基礎模型時考慮描述不同影像的文本之間相似性的重要性。</paragraph>\n", "author": "Zhiyang Liu et.al.", "authors": "Zhiyang Liu, Dong Yang, Minghao Zhang, Hanyu Sun, Hong Wu, Huiying Wang, Wen Shen, Chao Chai, Shuang Xia", "id": "2503.19801v1", "paper_url": "http://arxiv.org/abs/2503.19801v1", "repo": "null"}}