{"2411.08324": {"publish_time": "2024-11-13", "title": "Are LLMs Prescient? A Continuous Evaluation using Daily News as the Oracle", "paper_summary": "Many existing evaluation benchmarks for Large Language Models (LLMs) quickly\nbecome outdated due to the emergence of new models and training data. These\nbenchmarks also fall short in assessing how LLM performance changes over time,\nas they consist of static questions without a temporal dimension. To address\nthese limitations, we propose using future event prediction as a continuous\nevaluation method to assess LLMs' temporal generalization and forecasting\nabilities. Our benchmark, Daily Oracle, automatically generates question-answer\n(QA) pairs from daily news, challenging LLMs to predict \"future\" event\noutcomes. Our findings reveal that as pre-training data becomes outdated, LLM\nperformance degrades over time. While Retrieval Augmented Generation (RAG) has\nthe potential to enhance prediction accuracy, the performance degradation\npattern persists, highlighting the need for continuous model updates.", "paper_summary_zh": "許多現有的大型語言模型（LLM）評量基準由於新模型和訓練資料的出現，很快就會過時。這些基準在評估 LLM 效能隨著時間推移而產生的變化方面也有所不足，因為它們包含沒有時間維度的靜態問題。為了解決這些限制，我們建議使用未來事件預測作為一種持續評估方法，以評估 LLM 的時間概化和預測能力。我們的基準 Daily Oracle 從每日新聞中自動產生問題解答 (QA) 配對，挑戰 LLM 預測「未來」事件結果。我們的研究結果顯示，隨著預訓練資料過時，LLM 效能會隨著時間推移而下降。儘管檢索擴充生成（RAG）具有增強預測精準度的潛力，但效能下降的模式仍然存在，這突顯了持續模型更新的必要性。", "author": "Hui Dai et.al.", "authors": "Hui Dai, Ryan Teehan, Mengye Ren", "id": "2411.08324v1", "paper_url": "http://arxiv.org/abs/2411.08324v1", "repo": "null"}}