{"2406.01145": {"publish_time": "2024-06-03", "title": "Explore then Determine: A GNN-LLM Synergy Framework for Reasoning over Knowledge Graph", "paper_summary": "The task of reasoning over Knowledge Graphs (KGs) poses a significant\nchallenge for Large Language Models (LLMs) due to the complex structure and\nlarge amounts of irrelevant information. Existing LLM reasoning methods\noverlook the importance of compositional learning on KG to supply with precise\nknowledge. Besides, the fine-tuning and frequent interaction with LLMs incur\nsubstantial time and resource costs. This paper focuses on the Question\nAnswering over Knowledge Graph (KGQA) task and proposes an\nExplore-then-Determine (EtD) framework that synergizes LLMs with graph neural\nnetworks (GNNs) for reasoning over KGs. The Explore stage employs a lightweight\nGNN to explore promising candidates and relevant fine-grained knowledge to the\nquestions, while the Determine stage utilizes the explored information to\nconstruct a knowledge-enhanced multiple-choice prompt, guiding a frozen LLM to\ndetermine the final answer. Extensive experiments on three benchmark KGQA\ndatasets demonstrate that EtD achieves state-of-the-art performance and\ngenerates faithful reasoning results.", "paper_summary_zh": "由於知識圖譜 (KG) 的複雜結構和大量的無關資訊，對知識圖譜 (KG) 進行推理的任務對大型語言模型 (LLM) 構成重大挑戰。現有的 LLM 推理方法忽略了在 KG 上進行組合學習以提供精確知識的重要性。此外，對 LLM 進行微調和頻繁互動會產生大量的時間和資源成本。本文重點關注知識圖譜 (KGQA) 上的問題解答任務，並提出了一個探索然後確定 (EtD) 框架，該框架將 LLM 與圖神經網路 (GNN) 協同作用以對 KG 進行推理。探索階段採用輕量級 GNN 來探索有希望的候選者和與問題相關的精細知識，而確定階段利用探索的資訊來構建知識增強的多選提示，指導凍結的 LLM 來確定最終答案。在三個基準 KGQA 資料集上進行的廣泛實驗表明，EtD 達到了最先進的效能，並產生了忠實的推理結果。", "author": "Guangyi Liu et.al.", "authors": "Guangyi Liu, Yongqi Zhang, Yong Li, Quanming Yao", "id": "2406.01145v1", "paper_url": "http://arxiv.org/abs/2406.01145v1", "repo": "null"}}