{"2502.11471": {"publish_time": "2025-02-17", "title": "GLTW: Joint Improved Graph Transformer and LLM via Three-Word Language for Knowledge Graph Completion", "paper_summary": "Knowledge Graph Completion (KGC), which aims to infer missing or incomplete\nfacts, is a crucial task for KGs. However, integrating the vital structural\ninformation of KGs into Large Language Models (LLMs) and outputting predictions\ndeterministically remains challenging. To address this, we propose a new method\ncalled GLTW, which encodes the structural information of KGs and merges it with\nLLMs to enhance KGC performance. Specifically, we introduce an improved Graph\nTransformer (iGT) that effectively encodes subgraphs with both local and global\nstructural information and inherits the characteristics of language model,\nbypassing training from scratch. Also, we develop a subgraph-based\nmulti-classification training objective, using all entities within KG as\nclassification objects, to boost learning efficiency.Importantly, we combine\niGT with an LLM that takes KG language prompts as input.Our extensive\nexperiments on various KG datasets show that GLTW achieves significant\nperformance gains compared to SOTA baselines.", "paper_summary_zh": "知識圖譜補全 (KGC) 旨在推論遺失或不完整的\n事實，是 KGs 的一項關鍵任務。然而，將 KGs 的重要結構\n資訊整合至大型語言模型 (LLM)，並確定性地輸出預測結果，仍然是一項挑戰。為了解決這個問題，我們提出了一種新的方法，稱為 GLTW，它編碼了 KGs 的結構資訊，並將其與 LLM 合併，以增強 KGC 的效能。具體來說，我們引進了一個改良的圖形轉換器 (iGT)，它能有效地編碼具有局部和全域結構資訊的子圖，並繼承語言模型的特徵，繞過從頭開始的訓練。此外，我們開發了一個基於子圖的多分類訓練目標，使用 KG 中的所有實體作為\n分類物件，以提升學習效率。重要的是，我們將 iGT 與一個將 KG 語言提示作為輸入的 LLM 結合起來。我們在各種 KG 資料集上進行的廣泛實驗顯示，與 SOTA 基準線相比，GLTW 獲得了顯著的效能提升。", "author": "Kangyang Luo et.al.", "authors": "Kangyang Luo, Yuzhuo Bai, Cheng Gao, Shuzheng Si, Yingli Shen, Zhu Liu, Zhitong Wang, Cunliang Kong, Wenhao Li, Yufei Huang, Ye Tian, Xuantang Xiong, Lei Han, Maosong Sun", "id": "2502.11471v1", "paper_url": "http://arxiv.org/abs/2502.11471v1", "repo": "null"}}