{"2411.14962": {"publish_time": "2024-11-22", "title": "LLM for Barcodes: Generating Diverse Synthetic Data for Identity Documents", "paper_summary": "Accurate barcode detection and decoding in Identity documents is crucial for\napplications like security, healthcare, and education, where reliable data\nextraction and verification are essential. However, building robust detection\nmodels is challenging due to the lack of diverse, realistic datasets an issue\noften tied to privacy concerns and the wide variety of document formats.\nTraditional tools like Faker rely on predefined templates, making them less\neffective for capturing the complexity of real-world identity documents. In\nthis paper, we introduce a new approach to synthetic data generation that uses\nLLMs to create contextually rich and realistic data without relying on\npredefined field. Using the vast knowledge LLMs have about different documents\nand content, our method creates data that reflects the variety found in real\nidentity documents. This data is then encoded into barcode and overlayed on\ntemplates for documents such as Driver's licenses, Insurance cards, Student\nIDs. Our approach simplifies the process of dataset creation, eliminating the\nneed for extensive domain knowledge or predefined fields. Compared to\ntraditional methods like Faker, data generated by LLM demonstrates greater\ndiversity and contextual relevance, leading to improved performance in barcode\ndetection models. This scalable, privacy-first solution is a big step forward\nin advancing machine learning for automated document processing and identity\nverification.", "paper_summary_zh": "準確條碼辨識與解碼身分證件對於安全、醫療保健和教育等應用程式至關重要，在這些應用程式中，可靠的資料擷取和驗證至關重要。然而，由於缺乏多樣化、真實的資料集，建立強大的偵測模型具有挑戰性，而這個問題通常與隱私問題和文件格式的多樣性有關。像是 Faker 等傳統工具依賴於預定義的範本，這使得它們在捕捉真實世界身分證件的複雜性方面效率較低。在本文中，我們介紹一種新的合成資料生成方法，該方法使用 LLM 來建立豐富且真實的資料，而無需依賴預定義的欄位。利用 LLM 對不同文件和內容的廣泛知識，我們的技術建立了反映真實身分證件中多樣性的資料。然後將這些資料編碼成條碼，並疊加在駕照、保險卡、學生證等文件的範本上。我們的技術簡化了資料集建立的流程，消除了對廣泛領域知識或預定義欄位的需求。與 Faker 等傳統方法相比，LLM 生成的資料表現出更大的多樣性和上下文相關性，從而提升條碼偵測模型的效能。這個可擴充、以隱私為優先的解決方案是推進機器學習用於自動文件處理和身分驗證的重要一步。", "author": "Hitesh Laxmichand Patel et.al.", "authors": "Hitesh Laxmichand Patel, Amit Agarwal, Bhargava Kumar, Karan Gupta, Priyaranjan Pattnayak", "id": "2411.14962v1", "paper_url": "http://arxiv.org/abs/2411.14962v1", "repo": "null"}}