{"2409.07672": {"publish_time": "2024-09-12", "title": "An Unsupervised Dialogue Topic Segmentation Model Based on Utterance Rewriting", "paper_summary": "Dialogue topic segmentation plays a crucial role in various types of dialogue\nmodeling tasks. The state-of-the-art unsupervised DTS methods learn topic-aware\ndiscourse representations from conversation data through adjacent discourse\nmatching and pseudo segmentation to further mine useful clues in unlabeled\nconversational relations. However, in multi-round dialogs, discourses often\nhave co-references or omissions, leading to the fact that direct use of these\ndiscourses for representation learning may negatively affect the semantic\nsimilarity computation in the neighboring discourse matching task. In order to\nfully utilize the useful cues in conversational relations, this study proposes\na novel unsupervised dialog topic segmentation method that combines the\nUtterance Rewriting (UR) technique with an unsupervised learning algorithm to\nefficiently utilize the useful cues in unlabeled dialogs by rewriting the\ndialogs in order to recover the co-referents and omitted words. Compared with\nexisting unsupervised models, the proposed Discourse Rewriting Topic\nSegmentation Model (UR-DTS) significantly improves the accuracy of topic\nsegmentation. The main finding is that the performance on DialSeg711 improves\nby about 6% in terms of absolute error score and WD, achieving 11.42% in terms\nof absolute error score and 12.97% in terms of WD. on Doc2Dial the absolute\nerror score and WD improves by about 3% and 2%, respectively, resulting in SOTA\nreaching 35.17% in terms of absolute error score and 38.49% in terms of WD.\nThis shows that the model is very effective in capturing the nuances of\nconversational topics, as well as the usefulness and challenges of utilizing\nunlabeled conversations.", "paper_summary_zh": "對話主題分段在各種對話建模任務中扮演著至關重要的角色。最先進的無監督 DTS 方法透過相鄰對話比對和偽分段從對話資料中學習與主題相關的對話表徵，以進一步挖掘未標記對話關係中的有用線索。然而，在多輪對話中，對話通常會有共同引用或省略，導致直接使用這些對話進行表徵學習可能會對鄰近對話比對任務中的語意相似性計算產生負面影響。為了充分利用對話關係中的有用線索，本研究提出了一種新的無監督對話主題分段方法，該方法將話語重寫 (UR) 技術與無監督學習演算法相結合，透過重寫對話以恢復共同引用和省略的詞語，從而有效利用未標記對話中的有用線索。與現有的無監督模型相比，所提出的對話重寫主題分段模型 (UR-DTS) 大幅提升了主題分段的準確度。主要發現是 DialSeg711 的效能以絕對誤差分數和 WD 而言提升了約 6%，在絕對誤差分數方面達到 11.42%，在 WD 方面達到 12.97%。在 Doc2Dial 上，絕對誤差分數和 WD 分別提升了約 3% 和 2%，導致 SOTA 在絕對誤差分數方面達到 35.17%，在 WD 方面達到 38.49%。這顯示了該模型在捕捉對話主題的細微差別方面非常有效，以及利用未標記對話的用處和挑戰。", "author": "Xia Hou et.al.", "authors": "Xia Hou, Qifeng Li, Tongliang Li", "id": "2409.07672v1", "paper_url": "http://arxiv.org/abs/2409.07672v1", "repo": "null"}}