{"2412.12997": {"publish_time": "2024-12-17", "title": "Enabling Low-Resource Language Retrieval: Establishing Baselines for Urdu MS MARCO", "paper_summary": "As the Information Retrieval (IR) field increasingly recognizes the\nimportance of inclusivity, addressing the needs of low-resource languages\nremains a significant challenge. This paper introduces the first large-scale\nUrdu IR dataset, created by translating the MS MARCO dataset through machine\ntranslation. We establish baseline results through zero-shot learning for IR in\nUrdu and subsequently apply the mMARCO multilingual IR methodology to this\nnewly translated dataset. Our findings demonstrate that the fine-tuned model\n(Urdu-mT5-mMARCO) achieves a Mean Reciprocal Rank (MRR@10) of 0.247 and a\nRecall@10 of 0.439, representing significant improvements over zero-shot\nresults and showing the potential for expanding IR access for Urdu speakers. By\nbridging access gaps for speakers of low-resource languages, this work not only\nadvances multilingual IR research but also emphasizes the ethical and societal\nimportance of inclusive IR technologies. This work provides valuable insights\ninto the challenges and solutions for improving language representation and\nlays the groundwork for future research, especially in South Asian languages,\nwhich can benefit from the adaptable methods used in this study.", "paper_summary_zh": "隨著資訊檢索 (IR) 領域日益重視包容性，滿足低資源語言的需求仍然是一項重大挑戰。本文介紹了第一個大規模的烏爾都語 IR 資料集，該資料集是透過機器翻譯翻譯 MS MARCO 資料集而建立。我們透過烏爾都語 IR 的零次學習建立基準結果，並隨後將 mMARCO 多語言 IR 方法應用於這個新翻譯的資料集。我們的研究結果顯示，微調模型 (Urdu-mT5-mMARCO) 在平均倒數排名 (MRR@10) 中達到 0.247，在召回率@10 中達到 0.439，與零次學習結果相比有顯著的進步，並顯示出擴展烏爾都語使用者 IR 存取的潛力。透過縮小低資源語言使用者之間的存取差距，這項工作不僅推動了多語言 IR 研究，也強調了包容性 IR 技術的道德和社會重要性。這項工作提供了關於改善語言表達的挑戰和解決方案的寶貴見解，並為未來的研究奠定基礎，特別是在南亞語言方面，這些語言可以受益於本研究中使用的可適應方法。", "author": "Umer Butt et.al.", "authors": "Umer Butt, Stalin Veranasi, Günter Neumann", "id": "2412.12997v1", "paper_url": "http://arxiv.org/abs/2412.12997v1", "repo": "null"}}