{"2411.15888": {"publish_time": "2024-11-24", "title": "Evaluating Large Language Models for Causal Modeling", "paper_summary": "In this paper, we consider the process of transforming causal domain\nknowledge into a representation that aligns more closely with guidelines from\ncausal data science. To this end, we introduce two novel tasks related to\ndistilling causal domain knowledge into causal variables and detecting\ninteraction entities using LLMs. We have determined that contemporary LLMs are\nhelpful tools for conducting causal modeling tasks in collaboration with human\nexperts, as they can provide a wider perspective. Specifically, LLMs, such as\nGPT-4-turbo and Llama3-70b, perform better in distilling causal domain\nknowledge into causal variables compared to sparse expert models, such as\nMixtral-8x22b. On the contrary, sparse expert models such as Mixtral-8x22b\nstand out as the most effective in identifying interaction entities. Finally,\nwe highlight the dependency between the domain where the entities are generated\nand the performance of the chosen LLM for causal modeling.", "paper_summary_zh": "在本文中，我们考慮將因果領域知識轉換為與因果數據科學指南更緊密對齊的表示形式的過程。為此，我們引入了兩個新任務，分別是將因果領域知識提煉為因果變數，以及使用 LLM 檢測交互作用實體。我們已確定，當代 LLM 是與人類專家合作進行因果建模任務的有用工具，因為它們可以提供更廣闊的觀點。具體來說，與稀疏專家模型（例如 Mixtral-8x22b）相比，LLM（例如 GPT-4-turbo 和 Llama3-70b）在將因果領域知識提煉為因果變數方面表現得更好。相反，稀疏專家模型（例如 Mixtral-8x22b）在識別交互作用實體方面表現最為出色。最後，我們強調了實體生成所在的領域與所選 LLM 在因果建模中的效能之間的依賴關係。", "author": "Houssam Razouk et.al.", "authors": "Houssam Razouk, Leonie Benischke, Georg Niess, Roman Kern", "id": "2411.15888v1", "paper_url": "http://arxiv.org/abs/2411.15888v1", "repo": "null"}}