{"2411.14157": {"publish_time": "2024-11-20", "title": "DrugGen: Advancing Drug Discovery with Large Language Models and Reinforcement Learning Feedback", "paper_summary": "Traditional drug design faces significant challenges due to inherent chemical\nand biological complexities, often resulting in high failure rates in clinical\ntrials. Deep learning advancements, particularly generative models, offer\npotential solutions to these challenges. One promising algorithm is DrugGPT, a\ntransformer-based model, that generates small molecules for input protein\nsequences. Although promising, it generates both chemically valid and invalid\nstructures and does not incorporate the features of approved drugs, resulting\nin time-consuming and inefficient drug discovery. To address these issues, we\nintroduce DrugGen, an enhanced model based on the DrugGPT structure. DrugGen is\nfine-tuned on approved drug-target interactions and optimized with proximal\npolicy optimization. By giving reward feedback from protein-ligand binding\naffinity prediction using pre-trained transformers (PLAPT) and a customized\ninvalid structure assessor, DrugGen significantly improves performance.\nEvaluation across multiple targets demonstrated that DrugGen achieves 100%\nvalid structure generation compared to 95.5% with DrugGPT and produced\nmolecules with higher predicted binding affinities (7.22 [6.30-8.07]) compared\nto DrugGPT (5.81 [4.97-6.63]) while maintaining diversity and novelty. Docking\nsimulations further validate its ability to generate molecules targeting\nbinding sites effectively. For example, in the case of fatty acid-binding\nprotein 5 (FABP5), DrugGen generated molecules with superior docking scores\n(FABP5/11, -9.537 and FABP5/5, -8.399) compared to the reference molecule\n(Palmitic acid, -6.177). Beyond lead compound generation, DrugGen also shows\npotential for drug repositioning and creating novel pharmacophores for existing\ntargets. By producing high-quality small molecules, DrugGen provides a\nhigh-performance medium for advancing pharmaceutical research and drug\ndiscovery.", "paper_summary_zh": "傳統藥物設計因其化學和生物複雜性而面臨重大挑戰，這通常會導致臨床試驗的高失敗率。深度學習的進展，特別是生成模型，為這些挑戰提供了潛在的解決方案。一種有前途的演算法是 DrugGPT，這是一種基於轉換器的模型，它為輸入蛋白質序列生成小分子。儘管有前景，但它既產生化學有效結構，也產生無效結構，並且不包含已核准藥物的特徵，導致耗時且低效的藥物發現。為了解決這些問題，我們引入了 DrugGen，這是一種基於 DrugGPT 結構的增強模型。DrugGen 在已核准的藥物目標交互作用上進行微調，並使用近端策略最佳化進行最佳化。通過使用預先訓練的轉換器 (PLAPT) 和自訂無效結構評估器，從蛋白質配體結合親和力預測中提供獎勵回饋，DrugGen 大幅提升了效能。多個目標的評估顯示，與 DrugGPT 的 95.5% 相比，DrugGen 達到了 100% 的有效結構生成，並且產生了預測結合親和力較高的分子 (7.22 [6.30-8.07])，而 DrugGPT 為 (5.81 [4.97-6.63])，同時保持了多樣性和新穎性。對接模擬進一步驗證了其有效生成分子以針對結合位點的能力。例如，在脂肪酸結合蛋白 5 (FABP5) 的情況下，與參考分子（棕櫚酸，-6.177）相比，DrugGen 生成了對接評分較高的分子 (FABP5/11，-9.537 和 FABP5/5，-8.399)。除了先導化合物生成之外，DrugGen 還顯示了藥物重新定位和為現有目標建立新型藥效團的潛力。通過產生高品質的小分子，DrugGen 為推進製藥研究和藥物發現提供了一個高性能的媒介。", "author": "Mahsa Sheikholeslami et.al.", "authors": "Mahsa Sheikholeslami, Navid Mazrouei, Yousof Gheisari, Afshin Fasihi, Matin Irajpour, Ali Motahharynia", "id": "2411.14157v1", "paper_url": "http://arxiv.org/abs/2411.14157v1", "repo": "https://huggingface.co/alimotahharynia/DrugGen"}}