{"2501.08441": {"publish_time": "2025-01-14", "title": "Religious Bias Landscape in Language and Text-to-Image Models: Analysis, Detection, and Debiasing Strategies", "paper_summary": "Note: This paper includes examples of potentially offensive content related\nto religious bias, presented solely for academic purposes. The widespread\nadoption of language models highlights the need for critical examinations of\ntheir inherent biases, particularly concerning religion. This study\nsystematically investigates religious bias in both language models and\ntext-to-image generation models, analyzing both open-source and closed-source\nsystems. We construct approximately 400 unique, naturally occurring prompts to\nprobe language models for religious bias across diverse tasks, including mask\nfilling, prompt completion, and image generation. Our experiments reveal\nconcerning instances of underlying stereotypes and biases associated\ndisproportionately with certain religions. Additionally, we explore\ncross-domain biases, examining how religious bias intersects with demographic\nfactors such as gender, age, and nationality. This study further evaluates the\neffectiveness of targeted debiasing techniques by employing corrective prompts\ndesigned to mitigate the identified biases. Our findings demonstrate that\nlanguage models continue to exhibit significant biases in both text and image\ngeneration tasks, emphasizing the urgent need to develop fairer language models\nto achieve global acceptability.", "paper_summary_zh": "注意：本文包含與宗教偏見相關的潛在冒犯性內容範例，僅出於學術目的而呈現。語言模型的廣泛採用凸顯了批判性檢視其內在偏見的必要性，特別是關於宗教。本研究系統性地調查了語言模型和文字轉圖像生成模型中的宗教偏見，分析了開源和閉源系統。我們構建了大約 400 個獨特的、自然發生的提示，以探討語言模型在不同任務中的宗教偏見，包括填空、提示完成和圖像生成。我們的實驗揭示了與某些宗教不成比例地相關的潛在刻板印象和偏見。此外，我們探討了跨領域偏見，檢視宗教偏見如何與性別、年齡和國籍等人口因素相交。本研究進一步評估了目標去偏技術的有效性，採用旨在減輕已識別偏見的修正提示。我們的研究結果表明，語言模型在文字和圖像生成任務中持續展現顯著的偏見，強調了開發更公平的語言模型以實現全球可接受性的迫切需要。", "author": "Ajwad Abrar et.al.", "authors": "Ajwad Abrar, Nafisa Tabassum Oeshy, Mohsinul Kabir, Sophia Ananiadou", "id": "2501.08441v1", "paper_url": "http://arxiv.org/abs/2501.08441v1", "repo": "null"}}