{"2412.06341": {"publish_time": "2024-12-09", "title": "Elastic-DETR: Making Image Resolution Learnable with Content-Specific Network Prediction", "paper_summary": "Multi-scale image resolution is a de facto standard approach in modern object\ndetectors, such as DETR. This technique allows for the acquisition of various\nscale information from multiple image resolutions. However, manual\nhyperparameter selection of the resolution can restrict its flexibility, which\nis informed by prior knowledge, necessitating human intervention. This work\nintroduces a novel strategy for learnable resolution, called Elastic-DETR,\nenabling elastic utilization of multiple image resolutions. Our network\nprovides an adaptive scale factor based on the content of the image with a\ncompact scale prediction module (< 2 GFLOPs). The key aspect of our method lies\nin how to determine the resolution without prior knowledge. We present two loss\nfunctions derived from identified key components for resolution optimization:\nscale loss, which increases adaptiveness according to the image, and\ndistribution loss, which determines the overall degree of scaling based on\nnetwork performance. By leveraging the resolution's flexibility, we can\ndemonstrate various models that exhibit varying trade-offs between accuracy and\ncomputational complexity. We empirically show that our scheme can unleash the\npotential of a wide spectrum of image resolutions without constraining\nflexibility. Our models on MS COCO establish a maximum accuracy gain of 3.5%p\nor 26% decrease in computation than MS-trained DN-DETR.", "paper_summary_zh": "多尺度影像解析度是現代物體偵測器的事實標準方法，例如 DETR。此技術允許從多個影像解析度取得各種尺度資訊。然而，解析度的超參數手動選擇會限制其彈性，這由先驗知識告知，需要人工介入。這項工作引入了一個可學習解析度的創新策略，稱為 Elastic-DETR，實現了多個影像解析度的彈性使用。我們的網路提供了一個基於影像內容的自適應縮放因子，並具備一個緊湊的縮放預測模組（< 2 GFLOPs）。我們方法的關鍵方面在於如何在沒有先驗知識的情況下確定解析度。我們提出了兩個從解析度最佳化的已識別關鍵組成部分衍生的損失函數：尺度損失，它會根據影像增加自適應性，以及分佈損失，它會根據網路效能確定整體縮放程度。透過利用解析度的彈性，我們可以展示各種模型，這些模型在準確度和計算複雜度之間展現出不同的權衡。我們經驗性地表明，我們的方案可以釋放各種影像解析度的潛力，而不會限制彈性。我們在 MS COCO 上的模型建立了 3.5%p 的最大準確度提升，或比 MS 訓練的 DN-DETR 減少 26% 的計算。", "author": "Daeun Seo et.al.", "authors": "Daeun Seo, Hoeseok Yang, Sihyeong Park, Hyungshin Kim", "id": "2412.06341v1", "paper_url": "http://arxiv.org/abs/2412.06341v1", "repo": "null"}}