{"2406.19271": {"publish_time": "2024-06-27", "title": "AutoPureData: Automated Filtering of Web Data for LLM Fine-tuning", "paper_summary": "Up-to-date and reliable Large Language Models (LLMs) are consistently sought\nafter. Typically, LLMs are trained on a fixed dataset and then deployed.\nHowever, the training data continually becomes outdated. Enable automatic\ntraining of AI using web data involves significant concerns regarding data\nquality and safety due to bias, spam, and other unsafe or unwanted text. Pure\ndata is essential for producing reliable models. Training a model on impure\ndata may result in undesirable outcomes. This research proposes a system that\ncollects web data and automatically filters out unwanted text with the\nassistance of existing trusted AI models. In the experiment, a small sample of\nweb data was collected and filtered, demonstrating the system's effectiveness\nin purifying the data.", "paper_summary_zh": "持續尋找最新且可靠的大語言模型 (LLM)。通常，LLM 會在固定資料集上進行訓練，然後部署。然而，訓練資料會持續過時。使用網路資料自動訓練 AI 會涉及到資料品質和安全性的重大疑慮，因為資料會有偏見、垃圾郵件和其他不安全或不需要的文字。純淨的資料對於建立可靠的模型至關重要。使用不純淨的資料訓練模型可能會導致不良的結果。本研究提出了一個系統，可以收集網路資料，並在現有可信賴 AI 模型的協助下自動過濾掉不需要的文字。在實驗中，收集並過濾了網路資料的小樣本，證明了系統在淨化資料方面的有效性。", "author": "Praneeth Vadlapati et.al.", "authors": "Praneeth Vadlapati", "id": "2406.19271v1", "paper_url": "http://arxiv.org/abs/2406.19271v1", "repo": "https://github.com/Pro-GenAI/AutoPureData"}}