{"2501.12877": {"publish_time": "2025-01-22", "title": "WisdomBot: Tuning Large Language Models with Artificial Intelligence Knowledge", "paper_summary": "Large language models (LLMs) have emerged as powerful tools in natural\nlanguage processing (NLP), showing a promising future of artificial generated\nintelligence (AGI). Despite their notable performance in the general domain,\nLLMs have remained suboptimal in the field of education, owing to the unique\nchallenges presented by this domain, such as the need for more specialized\nknowledge, the requirement for personalized learning experiences, and the\nnecessity for concise explanations of complex concepts. To address these\nissues, this paper presents a novel LLM for education named WisdomBot, which\ncombines the power of LLMs with educational theories, enabling their seamless\nintegration into educational contexts. To be specific, we harness\nself-instructed knowledge concepts and instructions under the guidance of\nBloom's Taxonomy as training data. To further enhance the accuracy and\nprofessionalism of model's response on factual questions, we introduce two key\nenhancements during inference, i.e., local knowledge base retrieval\naugmentation and search engine retrieval augmentation during inference. We\nsubstantiate the effectiveness of our approach by applying it to several\nChinese LLMs, thereby showcasing that the fine-tuned models can generate more\nreliable and professional responses.", "paper_summary_zh": "大型語言模型（LLM）已成為自然語言處理（NLP）中的強大工具，展示了人工智慧（AGI）的未來前景。儘管在一般領域有顯著的表現，但 LLM 在教育領域仍未達到最佳狀態，這是由於該領域提出的獨特挑戰，例如需要更多專業知識、個性化學習體驗的要求，以及對複雜概念的簡潔解釋。為了解決這些問題，本文提出了一個名為 WisdomBot 的教育 LLM，它結合了 LLM 的力量和教育理論，使其能夠無縫整合到教育環境中。具體來說，我們利用布魯姆分類法指導下的自學知識概念和說明作為訓練資料。為了進一步提高模型對事實問題的回應的準確性和專業性，我們在推理過程中引入了兩項關鍵的改進，即，局部知識庫檢索擴充和搜索引擎檢索擴充。我們通過將其應用於幾個中文 LLM 來驗證我們方法的有效性，從而展示微調模型可以產生更可靠和專業的回應。", "author": "Jingyuan Chen et.al.", "authors": "Jingyuan Chen, Tao Wu, Wei Ji, Fei Wu", "id": "2501.12877v1", "paper_url": "http://arxiv.org/abs/2501.12877v1", "repo": "null"}}