{"2411.03945": {"publish_time": "2024-11-06", "title": "Can Custom Models Learn In-Context? An Exploration of Hybrid Architecture Performance on In-Context Learning Tasks", "paper_summary": "In-Context Learning (ICL) is a phenomenon where task learning occurs through\na prompt sequence without the necessity of parameter updates. ICL in\nMulti-Headed Attention (MHA) with absolute positional embedding has been the\nfocus of more study than other sequence model varieties. We examine\nimplications of architectural differences between GPT-2 and LLaMa as well as\nLlaMa and Mamba. We extend work done by Garg et al. (2022) and Park et al.\n(2024) to GPT-2/LLaMa hybrid and LLaMa/Mamba hybrid models - examining the\ninterplay between sequence transformation blocks and regressive performance\nin-context. We note that certain architectural changes cause degraded training\nefficiency/ICL accuracy by converging to suboptimal predictors or converging\nslower. We also find certain hybrids showing optimistic performance\nimprovements, informing potential future ICL-focused architecture\nmodifications. Additionally, we propose the \"ICL regression score\", a scalar\nmetric describing a model's whole performance on a specific task. Compute\nlimitations impose restrictions on our architecture-space, training duration,\nnumber of training runs, function class complexity, and benchmark complexity.\nTo foster reproducible and extensible research, we provide a typed, modular,\nand extensible Python package on which we run all experiments.", "paper_summary_zh": "情境學習 (ICL) 是一種現象，其中任務學習透過提示序列發生，而無需參數更新。具有絕對位置嵌入的多頭注意力 (MHA) 中的 ICL 一直比其他序列模型種類受到更多研究的關注。我們探討了 GPT-2 和 LLaMa 之間的架構差異以及 LLaMa 和 Mamba 之間的架構差異的含義。我們將 Garg 等人 (2022) 和 Park 等人 (2024) 所做的工作擴展到 GPT-2/LLaMa 混合模型和 LLaMa/Mamba 混合模型，探討了序列轉換區塊和情境中回歸效能之間的交互作用。我們注意到某些架構變更會導致訓練效率/ICL 準確度下降，這是因為它們收斂到次佳預測器或收斂速度較慢。我們還發現某些混合模型顯示樂觀的效能改善，這為潛在的未來以 ICL 為重點的架構修改提供了資訊。此外，我們提出了「ICL 回歸分數」，這是一個描述模型在特定任務上的整體效能的標量指標。運算限制對我們的架構空間、訓練持續時間、訓練執行次數、函數類別複雜度和基準複雜度施加了限制。為了促進可複製且可擴充的研究，我們提供了一個類型化、模組化且可擴充的 Python 套件，我們在其中執行所有實驗。", "author": "Ryan Campbell et.al.", "authors": "Ryan Campbell, Nelson Lojo, Kesava Viswanadha, Christoffer Grondal Tryggestad, Derrick Han Sun, Sriteja Vijapurapu, August Rolfsen, Anant Sahai", "id": "2411.03945v1", "paper_url": "http://arxiv.org/abs/2411.03945v1", "repo": "null"}}