{"2407.16030": {"publish_time": "2024-07-22", "title": "Enhancing Temporal Understanding in LLMs for Semi-structured Tables", "paper_summary": "Temporal reasoning over tabular data presents substantial challenges for\nlarge language models (LLMs), as evidenced by recent research. In this study,\nwe conduct a comprehensive analysis of temporal datasets to pinpoint the\nspecific limitations of LLMs. Our investigation leads to enhancements in\nTempTabQA, a dataset specifically designed for tabular temporal question\nanswering. We provide critical insights for improving LLM performance in\ntemporal reasoning tasks with tabular data. Furthermore, we introduce a novel\napproach, C.L.E.A.R to strengthen LLM capabilities in this domain. Our findings\ndemonstrate that our method significantly improves evidence-based reasoning\nacross various models. Additionally, our experimental results reveal that\nindirect supervision with auxiliary data substantially boosts model performance\nin these tasks. This work contributes to a deeper understanding of LLMs'\ntemporal reasoning abilities over tabular data and promotes advancements in\ntheir application across diverse fields.", "paper_summary_zh": "基於表格資料的時序推理對大型語言模型 (LLM) 構成重大挑戰，最近的研究已證實這一點。在此研究中，我們對時序資料集進行全面分析，以精確找出 LLM 的具體限制。我們的調查促成了 TempTabQA 的改進，TempTabQA 是專門為表格時序問題解答而設計的資料集。我們提供關鍵見解，以提升 LLM 在使用表格資料進行時序推理任務時的效能。此外，我們提出了一種新方法 C.L.E.A.R，以強化 LLM 在此領域的能力。我們的發現證明，我們的方法顯著改善了各種模型的基於證據的推理。此外，我們的實驗結果顯示，使用輔助資料進行間接監督會大幅提升模型在這些任務中的效能。這項工作有助於更深入了解 LLM 對表格資料的時序推理能力，並促使它們在不同領域的應用進一步發展。", "author": "Irwin Deng et.al.", "authors": "Irwin Deng, Kushagra Dixit, Vivek Gupta, Dan Roth", "id": "2407.16030v1", "paper_url": "http://arxiv.org/abs/2407.16030v1", "repo": "null"}}