{"2406.04214": {"publish_time": "2024-06-06", "title": "ValueBench: Towards Comprehensively Evaluating Value Orientations and Understanding of Large Language Models", "paper_summary": "Large Language Models (LLMs) are transforming diverse fields and gaining\nincreasing influence as human proxies. This development underscores the urgent\nneed for evaluating value orientations and understanding of LLMs to ensure\ntheir responsible integration into public-facing applications. This work\nintroduces ValueBench, the first comprehensive psychometric benchmark for\nevaluating value orientations and value understanding in LLMs. ValueBench\ncollects data from 44 established psychometric inventories, encompassing 453\nmultifaceted value dimensions. We propose an evaluation pipeline grounded in\nrealistic human-AI interactions to probe value orientations, along with novel\ntasks for evaluating value understanding in an open-ended value space. With\nextensive experiments conducted on six representative LLMs, we unveil their\nshared and distinctive value orientations and exhibit their ability to\napproximate expert conclusions in value-related extraction and generation\ntasks. ValueBench is openly accessible at\nhttps://github.com/Value4AI/ValueBench.", "paper_summary_zh": "大型語言模型 (LLM) 正在轉變各種領域，並作為人類代理人獲得越來越大的影響力。這種發展強調了評估價值取向和理解 LLM 的迫切需要，以確保它們負責任地整合到面向公眾的應用程式中。這項工作引入了 ValueBench，這是第一個全面的心理測量基準，用於評估 LLM 中的價值取向和價值理解。ValueBench 從 44 份既定的心理測量清單中收集資料，涵蓋 453 個多面向的價值維度。我們提出了一個評估管道，它以現實的人工智慧互動為基礎，用於探討價值取向，以及評估開放式價值空間中價值理解的新任務。透過對六個具代表性的 LLM 進行廣泛的實驗，我們揭示了它們的共同和獨特價值取向，並展示了它們在與價值相關的萃取和生成任務中逼近專家結論的能力。ValueBench 可在 https://github.com/Value4AI/ValueBench 公開取得。", "author": "Yuanyi Ren et.al.", "authors": "Yuanyi Ren, Haoran Ye, Hanjun Fang, Xin Zhang, Guojie Song", "id": "2406.04214v1", "paper_url": "http://arxiv.org/abs/2406.04214v1", "repo": "https://github.com/value4ai/valuebench"}}