{"2502.13718": {"publish_time": "2025-02-19", "title": "Multi-Scale and Multi-Objective Optimization for Cross-Lingual Aspect-Based Sentiment Analysis", "paper_summary": "Aspect-based sentiment analysis (ABSA) is a sequence labeling task that has\ngarnered growing research interest in multilingual contexts. However, recent\nstudies lack more robust feature alignment and finer aspect-level alignment. In\nthis paper, we propose a novel framework, Multi-Scale and Multi-Objective\noptimization (MSMO) for cross-lingual ABSA. During multi-scale alignment, we\nachieve cross-lingual sentence-level and aspect-level alignment, aligning\nfeatures of aspect terms in different contextual environments. Specifically, we\nintroduce code-switched bilingual sentences into the language discriminator and\nconsistency training modules to enhance the model's robustness. During\nmulti-objective optimization, we design two optimization objectives: supervised\ntraining and consistency training, aiming to enhance cross-lingual semantic\nalignment. To further improve model performance, we incorporate distilled\nknowledge of the target language into the model. Results show that MSMO\nsignificantly enhances cross-lingual ABSA by achieving state-of-the-art\nperformance across multiple languages and models.", "paper_summary_zh": "面向方面的观点分析 (ABSA) 是一項序列標籤任務，在多語言環境中引起了越來越多的研究興趣。然而，最近的研究缺乏更強大的特徵對齊和更精細的方面層級對齊。在本文中，我們提出了一個新的框架，即多尺度和多目標優化 (MSMO) 用於跨語言 ABSA。在多尺度對齊期間，我們實現了跨語言句子層級和方面層級對齊，對齊了不同上下文環境中方面條款的特徵。具體來說，我們將代碼轉換的雙語句子引入語言判別器和一致性訓練模組中，以增強模型的健壯性。在多目標優化期間，我們設計了兩個優化目標：監督訓練和一致性訓練，旨在增強跨語言語義對齊。為了進一步提高模型效能，我們將目標語言的蒸餾知識納入模型中。結果表明，MSMO 透過在多種語言和模型中實現最先進的效能，顯著增強了跨語言 ABSA。", "author": "Chengyan Wu et.al.", "authors": "Chengyan Wu, Bolei Ma, Ningyuan Deng, Yanqing He, Yun Xue", "id": "2502.13718v1", "paper_url": "http://arxiv.org/abs/2502.13718v1", "repo": "null"}}