{"2410.01686": {"publish_time": "2024-10-02", "title": "Positional Attention: Out-of-Distribution Generalization and Expressivity for Neural Algorithmic Reasoning", "paper_summary": "There has been a growing interest in the ability of neural networks to solve\nalgorithmic tasks, such as arithmetic, summary statistics, and sorting. While\nstate-of-the-art models like Transformers have demonstrated good generalization\nperformance on in-distribution tasks, their out-of-distribution (OOD)\nperformance is poor when trained end-to-end. In this paper, we focus on value\ngeneralization, a common instance of OOD generalization where the test\ndistribution has the same input sequence length as the training distribution,\nbut the value ranges in the training and test distributions do not necessarily\noverlap. To address this issue, we propose that using fixed positional\nencodings to determine attention weights-referred to as positional\nattention-enhances empirical OOD performance while maintaining expressivity. We\nsupport our claim about expressivity by proving that Transformers with\npositional attention can effectively simulate parallel algorithms.", "paper_summary_zh": "對於神經網路解決演算法任務，例如算術、摘要統計和排序的能力，人們越來越感興趣。雖然像 Transformer 這樣的最先進模型已在分佈內任務上展示出良好的泛化效能，但當端對端訓練時，它們的分佈外 (OOD) 效能很差。在本文中，我們專注於值泛化，這是 OOD 泛化的常見範例，其中測試分佈具有與訓練分佈相同的輸入序列長度，但訓練和測試分佈中的值範圍不一定重疊。為了解決這個問題，我們建議使用固定的位置編碼來確定注意力權重，稱為位置注意力，它可以在保持表達力的同時增強經驗性的 OOD 效能。我們透過證明具有位置注意力的 Transformer 可以有效模擬平行演算法，來支持我們對表達力的主張。", "author": "Artur Back de Luca et.al.", "authors": "Artur Back de Luca, George Giapitzakis, Shenghao Yang, Petar Veličković, Kimon Fountoulakis", "id": "2410.01686v1", "paper_url": "http://arxiv.org/abs/2410.01686v1", "repo": "https://github.com/opallab/positional_attention"}}