{"2412.03359": {"publish_time": "2024-12-04", "title": "WiS Platform: Enhancing Evaluation of LLM-Based Multi-Agent Systems Through Game-Based Analysis", "paper_summary": "Recent advancements in autonomous multi-agent systems (MAS) based on large\nlanguage models (LLMs) have enhanced the application scenarios and improved the\ncapability of LLMs to handle complex tasks. Despite demonstrating\neffectiveness, existing studies still evidently struggle to evaluate, analysis,\nand reproducibility of LLM-based MAS. In this paper, to facilitate the research\non LLM-based MAS, we introduce an open, scalable, and real-time updated\nplatform for accessing and analyzing the LLM-based MAS based on the games Who\nis Spy?\" (WiS). Our platform is featured with three main worths: (1) a unified\nmodel evaluate interface that supports models available on Hugging Face; (2)\nreal-time updated leaderboard for model evaluation; (3) a comprehensive\nevaluation covering game-winning rates, attacking, defense strategies, and\nreasoning of LLMs. To rigorously test WiS, we conduct extensive experiments\ncoverage of various open- and closed-source LLMs, we find that different agents\nexhibit distinct and intriguing behaviors in the game. The experimental results\ndemonstrate the effectiveness and efficiency of our platform in evaluating\nLLM-based MAS. Our platform and its documentation are publicly available at\n\\url{https://whoisspy.ai/}", "paper_summary_zh": "<paragraph>基於大型語言模型 (LLM) 的自主多智能體系統 (MAS) 近期的進展，擴展了應用場景，並提升了 LLM 處理複雜任務的能力。儘管證明了其有效性，但現有研究仍明顯難以評估、分析和重現基於 LLM 的 MAS。在本文中，為了促進對基於 LLM 的 MAS 的研究，我們介紹了一個開放、可擴充且即時更新的平台，用於存取和分析基於遊戲「誰是間諜？」(WiS) 的基於 LLM 的 MAS。我們的平台具有三個主要價值：(1) 統一的模型評估介面，支援 Hugging Face 上可用的模型；(2) 即時更新的模型評估排行榜；(3) 全面的評估，涵蓋遊戲獲勝率、攻擊、防禦策略和 LLM 的推理。為了嚴格測試 WiS，我們對各種開源和閉源 LLM 進行廣泛的實驗，我們發現不同的智能體在遊戲中表現出截然不同且有趣的行為。實驗結果證明了我們的平台在評估基於 LLM 的 MAS 時的有效性和效率。我們的平台及其文件在 \\url{https://whoisspy.ai/} 公開提供</paragraph>", "author": "Chengwei Hu et.al.", "authors": "Chengwei Hu, Jianhui Zheng, Yancheng He, Hangyu Guo, Junguang Jiang, Han Zhu, Kai Sun, Yuning Jiang, Wenbo Su, Bo Zheng", "id": "2412.03359v1", "paper_url": "http://arxiv.org/abs/2412.03359v1", "repo": "null"}}