{"2411.17661": {"publish_time": "2024-11-26", "title": "BERT or FastText? A Comparative Analysis of Contextual as well as Non-Contextual Embeddings", "paper_summary": "Natural Language Processing (NLP) for low-resource languages presents\nsignificant challenges, particularly due to the scarcity of high-quality\nannotated data and linguistic resources. The choice of embeddings plays a\ncritical role in enhancing the performance of NLP tasks, such as news\nclassification, sentiment analysis, and hate speech detection, especially for\nlow-resource languages like Marathi. In this study, we investigate the impact\nof various embedding techniques- Contextual BERT-based, Non-Contextual\nBERT-based, and FastText-based on NLP classification tasks specific to the\nMarathi language. Our research includes a thorough evaluation of both\ncompressed and uncompressed embeddings, providing a comprehensive overview of\nhow these embeddings perform across different scenarios. Specifically, we\ncompare two BERT model embeddings, Muril and MahaBERT, as well as two FastText\nmodel embeddings, IndicFT and MahaFT. Our evaluation includes applying\nembeddings to a Multiple Logistic Regression (MLR) classifier for task\nperformance assessment, as well as TSNE visualizations to observe the spatial\ndistribution of these embeddings. The results demonstrate that contextual\nembeddings outperform non-contextual embeddings. Furthermore, BERT-based\nnon-contextual embeddings extracted from the first BERT embedding layer yield\nbetter results than FastText-based embeddings, suggesting a potential\nalternative to FastText embeddings.", "paper_summary_zh": "自然語言處理 (NLP) 對於低資源語言來說是一個重大的挑戰，特別是因為缺乏高品質的註解資料和語言資源。嵌入式的選擇在提升 NLP 任務的效能上扮演著關鍵的角色，例如新聞分類、情緒分析和仇恨言論偵測，特別是對於像馬拉提語這類的低資源語言。在本研究中，我們探討各種嵌入式技術對馬拉提語特定 NLP 分類任務的影響，包括基於脈絡的 BERT、非基於脈絡的 BERT 和基於 FastText。我們的研究包含對壓縮和未壓縮嵌入式的全面評估，提供這些嵌入式在不同場景下的效能表現的全面概觀。具體來說，我們比較了兩個 BERT 模型嵌入式，Muril 和 MahaBERT，以及兩個 FastText 模型嵌入式，IndicFT 和 MahaFT。我們的評估包括將嵌入式應用於多重邏輯迴歸 (MLR) 分類器，以進行任務效能評估，以及使用 t-SNE 視覺化來觀察這些嵌入式的空間分佈。結果表明，基於脈絡的嵌入式優於非基於脈絡的嵌入式。此外，從第一個 BERT 嵌入式層中提取的非基於脈絡的 BERT 嵌入式比基於 FastText 的嵌入式產生更好的結果，這表明了 FastText 嵌入式的潛在替代方案。", "author": "Abhay Shanbhag et.al.", "authors": "Abhay Shanbhag, Suramya Jadhav, Amogh Thakurdesai, Ridhima Sinare, Raviraj Joshi", "id": "2411.17661v1", "paper_url": "http://arxiv.org/abs/2411.17661v1", "repo": "null"}}