{"2405.17382": {"publish_time": "2024-05-27", "title": "ReMoDetect: Reward Models Recognize Aligned LLM's Generations", "paper_summary": "The remarkable capabilities and easy accessibility of large language models\n(LLMs) have significantly increased societal risks (e.g., fake news\ngeneration), necessitating the development of LLM-generated text (LGT)\ndetection methods for safe usage. However, detecting LGTs is challenging due to\nthe vast number of LLMs, making it impractical to account for each LLM\nindividually; hence, it is crucial to identify the common characteristics\nshared by these models. In this paper, we draw attention to a common feature of\nrecent powerful LLMs, namely the alignment training, i.e., training LLMs to\ngenerate human-preferable texts. Our key finding is that as these aligned LLMs\nare trained to maximize the human preferences, they generate texts with higher\nestimated preferences even than human-written texts; thus, such texts are\neasily detected by using the reward model (i.e., an LLM trained to model human\npreference distribution). Based on this finding, we propose two training\nschemes to further improve the detection ability of the reward model, namely\n(i) continual preference fine-tuning to make the reward model prefer aligned\nLGTs even further and (ii) reward modeling of Human/LLM mixed texts (a\nrephrased texts from human-written texts using aligned LLMs), which serves as a\nmedian preference text corpus between LGTs and human-written texts to learn the\ndecision boundary better. We provide an extensive evaluation by considering six\ntext domains across twelve aligned LLMs, where our method demonstrates\nstate-of-the-art results. Code is available at\nhttps://github.com/hyunseoklee-ai/reward_llm_detect.", "paper_summary_zh": "大型語言模型 (LLM) 的卓越功能和易於取得，大幅增加了社會風險（例如，假新聞產生），這使得必須開發 LLM 生成的文字 (LGT) 偵測方法，以安全使用。然而，偵測 LGT 具有挑戰性，原因在於 LLM 數量龐大，要個別考量每個 LLM 都是不切實際的；因此，找出這些模型共有的特徵至關重要。在本文中，我們將注意力集中在近期強大的 LLM 的共同特徵，即對齊訓練，也就是訓練 LLM 產生人類偏好的文字。我們的關鍵發現是，由於這些對齊的 LLM 經過訓練以最大化人類偏好，因此它們產生的文字估計偏好甚至高於人類撰寫的文字；因此，此類文字很容易使用回饋模型（也就是訓練 LLM 以建構人類偏好分佈）來偵測。基於此發現，我們提出兩種訓練架構，以進一步提升回饋模型的偵測能力，即 (i) 持續偏好微調，讓回饋模型進一步偏好對齊的 LGT，以及 (ii) 人類/LLM 混合文字的回饋建模（使用對齊的 LLM 從人類撰寫的文字重新表述的文字），這作為 LGT 和人類撰寫的文字之間的偏好文字語料庫的中間值，以更好地學習決策邊界。我們考量六個文本領域和十二個對齊的 LLM，提供廣泛的評估，而我們的模型展示了最先進的結果。程式碼可在 https://github.com/hyunseoklee-ai/reward_llm_detect 取得。", "author": "Hyunseok Lee et.al.", "authors": "Hyunseok Lee, Jihoon Tack, Jinwoo Shin", "id": "2405.17382v1", "paper_url": "http://arxiv.org/abs/2405.17382v1", "repo": "null"}}