{"2406.08101": {"publish_time": "2024-06-12", "title": "CoXQL: A Dataset for Parsing Explanation Requests in Conversational XAI Systems", "paper_summary": "Conversational explainable artificial intelligence (ConvXAI) systems based on\nlarge language models (LLMs) have garnered significant interest from the\nresearch community in natural language processing (NLP) and human-computer\ninteraction (HCI). Such systems can provide answers to user questions about\nexplanations, have the potential to enhance users' comprehension and offer more\ninformation about the decision-making and generation processes of LLMs.\nCurrently available ConvXAI systems are based on intent recognition rather than\nfree chat. Thus, reliably grasping users' intentions in ConvXAI systems still\npresents a challenge, because there is a broad range of XAI methods to map\nrequests onto and each of them can have multiple slots to take care of. In\norder to bridge this gap, we present CoXQL, the first dataset for user intent\nrecognition in ConvXAI, covering 31 intents, seven of which require filling\nadditional slots. Subsequently, we enhance an existing parsing approach by\nincorporating template validations, and conduct an evaluation of several LLMs\non CoXQL using different parsing strategies. We conclude that the improved\nparsing approach (MP+) surpasses the performance of previous approaches. We\nalso discover that intents with multiple slots remain highly challenging for\nLLMs.", "paper_summary_zh": "基於大型語言模型 (LLM) 的對話式可解釋人工智慧 (ConvXAI) 系統在自然語言處理 (NLP) 和人機互動 (HCI) 的研究社群中獲得極大的關注。此類系統可以提供使用者關於解釋的問題解答，有潛力增強使用者的理解力，並提供更多有關 LLM 決策制定和產生程序的資訊。目前可用的 ConvXAI 系統是基於意圖辨識，而非自由對話。因此，在 ConvXAI 系統中可靠地掌握使用者的意圖仍是一個挑戰，因為有廣泛的 XAI 方法可以將請求對應到，而且每個方法都可以有多個時段需要處理。為了彌合這個差距，我們提出了 CoXQL，這是 ConvXAI 中第一個使用者意圖辨識的資料集，涵蓋 31 個意圖，其中七個需要填寫額外的時段。隨後，我們透過整合範本驗證來增強現有的剖析方法，並使用不同的剖析策略對 CoXQL 上的幾個 LLM 進行評估。我們得出結論，改良的剖析方法 (MP+) 超越了先前方法的效能。我們也發現，具有多個時段的意圖對於 LLM 來說仍然極具挑戰性。", "author": "Qianli Wang et.al.", "authors": "Qianli Wang, Tatiana Anikina, Nils Feldhus, Simon Ostermann, Sebastian Möller", "id": "2406.08101v1", "paper_url": "http://arxiv.org/abs/2406.08101v1", "repo": "null"}}