{"2407.02485": {"publish_time": "2024-07-02", "title": "RankRAG: Unifying Context Ranking with Retrieval-Augmented Generation in LLMs", "paper_summary": "Large language models (LLMs) typically utilize the top-k contexts from a\nretriever in retrieval-augmented generation (RAG). In this work, we propose a\nnovel instruction fine-tuning framework RankRAG, which instruction-tunes a\nsingle LLM for the dual purpose of context ranking and answer generation in\nRAG. In particular, the instruction-tuned LLMs work surprisingly well by adding\na small fraction of ranking data into the training blend, and outperform\nexisting expert ranking models, including the same LLM exclusively fine-tuned\non a large amount of ranking data. For generation, we compare our model with\nmany strong baselines, including GPT-4-0613, GPT-4-turbo-2024-0409, and\nChatQA-1.5, an open-sourced model with the state-of-the-art performance on RAG\nbenchmarks. Specifically, our Llama3-RankRAG significantly outperforms\nLlama3-ChatQA-1.5 and GPT-4 models on nine knowledge-intensive benchmarks. In\naddition, it also performs comparably to GPT-4 on five RAG benchmarks in the\nbiomedical domain without instruction fine-tuning on biomedical data,\ndemonstrating its superb capability for generalization to new domains.", "paper_summary_zh": "大型語言模型（LLM）通常在檢索增強生成（RAG）中利用檢索器的 top-k 背景。在這項工作中，我們提出了一個新穎的指令微調框架 RankRAG，它為單一 LLM 進行指令微調，以達到 RAG 中背景排名和答案生成的雙重目的。特別是，指令微調的 LLM 透過將一小部分排名資料新增到訓練混合中而產生驚人的效果，並優於現有的專家排名模型，包括在大量排名資料上進行獨家微調的相同 LLM。對於生成，我們將我們的模型與許多強大的基線進行比較，包括 GPT-4-0613、GPT-4-turbo-2024-0409 和 ChatQA-1.5，這是一個在 RAG 基準上具有最先進效能的開源模型。具體來說，我們的 Llama3-RankRAG 在九個知識密集型基準上顯著優於 Llama3-ChatQA-1.5 和 GPT-4 模型。此外，它在生物醫學領域的五個 RAG 基準上也表現出與 GPT-4 相當的效能，而無需對生物醫學資料進行指令微調，證明了它對新領域的出色泛化能力。", "author": "Yue Yu et.al.", "authors": "Yue Yu, Wei Ping, Zihan Liu, Boxin Wang, Jiaxuan You, Chao Zhang, Mohammad Shoeybi, Bryan Catanzaro", "id": "2407.02485v1", "paper_url": "http://arxiv.org/abs/2407.02485v1", "repo": "null"}}