{"2502.03272": {"publish_time": "2025-02-05", "title": "Deep Learning Pipeline for Fully Automated Myocardial Infarct Segmentation from Clinical Cardiac MR Scans", "paper_summary": "Purpose: To develop and evaluate a deep learning-based method that allows to\nperform myocardial infarct segmentation in a fully-automated way.\n  Materials and Methods: For this retrospective study, a cascaded framework of\ntwo and three-dimensional convolutional neural networks (CNNs), specialized on\nidentifying ischemic myocardial scars on late gadolinium enhancement (LGE)\ncardiac magnetic resonance (CMR) images, was trained on an in-house training\ndataset consisting of 144 examinations. On a separate test dataset from the\nsame institution, including images from 152 examinations obtained between 2021\nand 2023, a quantitative comparison between artificial intelligence (AI)-based\nsegmentations and manual segmentations was performed. Further, qualitative\nassessment of segmentation accuracy was evaluated for both human and\nAI-generated contours by two CMR experts in a blinded experiment.\n  Results: Excellent agreement could be found between manually and\nautomatically calculated infarct volumes ($\\rho_c$ = 0.9). The qualitative\nevaluation showed that compared to human-based measurements, the experts rated\nthe AI-based segmentations to better represent the actual extent of infarction\nsignificantly (p < 0.001) more often (33.4% AI, 25.1% human, 41.5% equal). On\nthe contrary, for segmentation of microvascular obstruction (MVO), manual\nmeasurements were still preferred (11.3% AI, 55.6% human, 33.1% equal).\n  Conclusion: This fully-automated segmentation pipeline enables CMR infarct\nsize to be calculated in a very short time and without requiring any\npre-processing of the input images while matching the segmentation quality of\ntrained human observers. In a blinded experiment, experts preferred automated\ninfarct segmentations more often than manual segmentations, paving the way for\na potential clinical application.", "paper_summary_zh": "<paragraph>目的：開發和評估一種基於深度學習的方法，允許以全自動的方式執行心肌梗塞分割。\n材料和方法：對於這項回顧性研究，一個由二維和三維卷積神經網路 (CNN) 組成的串聯架構，專門用於識別晚期釓增強 (LGE) 心臟磁振造影 (CMR) 影像上的缺血性心肌疤痕，並在包含 144 項檢查的內部訓練資料集上受訓。在來自同一家機構的獨立測試資料集上，包括 2021 年至 2023 年間獲得的 152 項檢查的影像，執行基於人工智慧 (AI) 的分割和手動分割之間的定量比較。此外，由兩位 CMR 專家在盲測實驗中評估人類和 AI 生成的輪廓的分割準確度。\n結果：在手動和自動計算的梗塞體積之間可以發現極佳的一致性（ρ_c = 0.9）。定性評估顯示，與基於人類的測量相比，專家評估 AI 基於分割能更能代表梗塞的實際範圍，顯著（p < 0.001）更常發生（33.4% AI，25.1% 人類，41.5% 相等）。相反，對於微血管阻塞 (MVO) 的分割，手動測量仍然較受青睞（11.3% AI，55.6% 人類，33.1% 相等）。\n結論：這個全自動分割管道可以在很短的時間內計算 CMR 梗塞大小，而且無需對輸入影像進行任何前處理，同時匹配受過訓練的人類觀察者的分割品質。在盲測實驗中，專家比手動分割更常偏好自動梗塞分割，為潛在的臨床應用鋪平了道路。</paragraph>", "author": "Matthias Schwab et.al.", "authors": "Matthias Schwab, Mathias Pamminger, Christian Kremser, Agnes Mayr", "id": "2502.03272v1", "paper_url": "http://arxiv.org/abs/2502.03272v1", "repo": "null"}}