{"2405.03799": {"publish_time": "2024-05-06", "title": "Synthetic Data from Diffusion Models Improve Drug Discovery Prediction", "paper_summary": "Artificial intelligence (AI) is increasingly used in every stage of drug\ndevelopment. Continuing breakthroughs in AI-based methods for drug discovery\nrequire the creation, improvement, and refinement of drug discovery data. We\nposit a new data challenge that slows the advancement of drug discovery AI:\ndatasets are often collected independently from each other, often with little\noverlap, creating data sparsity. Data sparsity makes data curation difficult\nfor researchers looking to answer key research questions requiring values posed\nacross multiple datasets. We propose a novel diffusion GNN model Syngand\ncapable of generating ligand and pharmacokinetic data end-to-end. We show and\nprovide a methodology for sampling pharmacokinetic data for existing ligands\nusing our Syngand model. We show the initial promising results on the efficacy\nof the Syngand-generated synthetic target property data on downstream\nregression tasks with AqSolDB, LD50, and hERG central. Using our proposed model\nand methodology, researchers can easily generate synthetic ligand data to help\nthem explore research questions that require data spanning multiple datasets.", "paper_summary_zh": "人工智慧（AI）在藥物開發的每個階段都越來越廣泛地使用。基於 AI 的藥物發現方法的持續突破需要建立、改進和優化藥物發現數據。我們提出了一個新的數據挑戰，它會減緩藥物發現 AI 的進展：數據集通常是彼此獨立收集的，通常重疊很少，造成數據稀疏。數據稀疏使得研究人員難以進行數據管理，因為他們希望回答需要跨多個數據集提供值的關鍵研究問題。我們提出了一種新穎的擴散 GNN 模型 Syngand，它能夠端到端生成配體和藥代動力學數據。我們展示並提供了一種使用我們的 Syngand 模型對現有配體進行藥代動力學數據採樣的辦法。我們展示了 Syngand 生成的合成目標屬性數據在使用 AqSolDB、LD50 和 hERG central 進行下游回歸任務時的初步有希望的結果。使用我們提出的模型和方法，研究人員可以輕鬆生成合成配體數據，以幫助他們探索需要跨多個數據集的數據的研究問題。", "author": "Bing Hu et.al.", "authors": "Bing Hu, Ashish Saragadam, Anita Layton, Helen Chen", "id": "2405.03799v1", "paper_url": "http://arxiv.org/abs/2405.03799v1", "repo": "null"}}