{"2407.00147": {"publish_time": "2024-06-28", "title": "Predicting Elevated Risk of Hospitalization Following Emergency Department Discharges", "paper_summary": "Hospitalizations that follow closely on the heels of one or more emergency\ndepartment visits are often symptoms of missed opportunities to form a proper\ndiagnosis. These diagnostic errors imply a failure to recognize the need for\nhospitalization and deliver appropriate care, and thus also bear important\nconnotations for patient safety. In this paper, we show how data mining\ntechniques can be applied to a large existing hospitalization data set to learn\nuseful models that predict these upcoming hospitalizations with high accuracy.\nSpecifically, we use an ensemble of logistics regression, na\\\"ive Bayes and\nassociation rule classifiers to successfully predict hospitalization within 3,\n7 and 14 days of an emergency department discharge. Aside from high accuracy,\none of the advantages of the techniques proposed here is that the resulting\nclassifier is easily inspected and interpreted by humans so that the learned\nrules can be readily operationalized. These rules can then be easily\ndistributed and applied directly by physicians in emergency department settings\nto predict the risk of early admission prior to discharging their emergency\ndepartment patients.", "paper_summary_zh": "緊接在一次或多次急診科就診後住院，通常是錯失適當診斷機會的徵兆。這些診斷錯誤意味著未能察覺住院需求並提供適當照護，因此也對病患安全造成重大影響。在本文中，我們將展示資料探勘技術如何應用於現有的大型住院資料集，以學習預測這些即將到來的住院事件且準確度極高的有用模型。具體來說，我們使用邏輯迴歸、樸素貝氏和關聯規則分類器的組合，成功預測急診科出院後 3、7 和 14 天內的住院。除了高準確度之外，本文提出的技術優勢之一是，產生的分類器容易被人類檢查和解讀，因此可以輕鬆地將學習到的規則付諸實行。然後，這些規則可以輕易地被分發，並由急診科的醫師直接應用，以在出院前預測急診科病患早期入院的風險。", "author": "Dat Hong et.al.", "authors": "Dat Hong, Philip M. Polgreen, Alberto Maria Segre", "id": "2407.00147v1", "paper_url": "http://arxiv.org/abs/2407.00147v1", "repo": "null"}}