{"2407.08003": {"publish_time": "2024-07-10", "title": "Machine Learning for ALSFRS-R Score Prediction: Making Sense of the Sensor Data", "paper_summary": "Amyotrophic Lateral Sclerosis (ALS) is characterized as a rapidly progressive\nneurodegenerative disease that presents individuals with limited treatment\noptions in the realm of medical interventions and therapies. The disease\nshowcases a diverse range of onset patterns and progression trajectories,\nemphasizing the critical importance of early detection of functional decline to\nenable tailored care strategies and timely therapeutic interventions. The\npresent investigation, spearheaded by the iDPP@CLEF 2024 challenge, focuses on\nutilizing sensor-derived data obtained through an app. This data is used to\nconstruct various machine learning models specifically designed to forecast the\nadvancement of the ALS Functional Rating Scale-Revised (ALSFRS-R) score,\nleveraging the dataset provided by the organizers. In our analysis, multiple\npredictive models were evaluated to determine their efficacy in handling ALS\nsensor data. The temporal aspect of the sensor data was compressed and\namalgamated using statistical methods, thereby augmenting the interpretability\nand applicability of the gathered information for predictive modeling\nobjectives. The models that demonstrated optimal performance were a naive\nbaseline and ElasticNet regression. The naive model achieved a Mean Absolute\nError (MAE) of 0.20 and a Root Mean Square Error (RMSE) of 0.49, slightly\noutperforming the ElasticNet model, which recorded an MAE of 0.22 and an RMSE\nof 0.50. Our comparative analysis suggests that while the naive approach\nyielded marginally better predictive accuracy, the ElasticNet model provides a\nrobust framework for understanding feature contributions.", "paper_summary_zh": "肌萎縮性脊髓側索硬化症 (ALS) 的特徵為快速進展的神經退化性疾病，在醫療介入和治療領域中，患者的治療選擇有限。此疾病展示出多樣化的發病模式和進展軌跡，強調早期偵測功能衰退至關重要，以制定客製化的照護策略和及時的治療介入。本研究由 iDPP@CLEF 2024 挑戰帶頭，專注於利用透過應用程式取得的感測器衍生資料。這些資料用於建構各種機器學習模型，特別設計用於預測 ALS 功能評分量表修訂版 (ALSFRS-R) 分數的進展，並利用主辦單位提供的資料集。在我們的分析中，評估了多種預測模型，以確定它們在處理 ALS 感測器資料方面的效能。感測器資料的時間面向使用統計方法進行壓縮和合併，從而增強收集資訊在預測建模目標方面的可解釋性和適用性。表現最佳的模型是樸素基準和 ElasticNet 回歸。樸素模型達到了平均絕對誤差 (MAE) 為 0.20 和均方根誤差 (RMSE) 為 0.49，略勝於 ElasticNet 模型，後者的 MAE 為 0.22，RMSE 為 0.50。我們的比較分析表明，雖然樸素方法產生的預測準確度略高，但 ElasticNet 模型提供了一個穩健的架構，用於瞭解特徵貢獻。", "author": "Ritesh Mehta et.al.", "authors": "Ritesh Mehta, Aleksandar Pramov, Shashank Verma", "id": "2407.08003v1", "paper_url": "http://arxiv.org/abs/2407.08003v1", "repo": "null"}}