{"2405.15521": {"publish_time": "2024-05-24", "title": "A Preference-oriented Diversity Model Based on Mutual-information in Re-ranking for E-commerce Search", "paper_summary": "Re-ranking is a process of rearranging ranking list to more effectively meet\nuser demands by accounting for the interrelationships between items. Existing\nmethods predominantly enhance the precision of search results, often at the\nexpense of diversity, leading to outcomes that may not fulfill the varied needs\nof users. Conversely, methods designed to promote diversity might compromise\nthe precision of the results, failing to satisfy the users' requirements for\naccuracy. To alleviate the above problems, this paper proposes a\nPreference-oriented Diversity Model Based on Mutual-information (PODM-MI),\nwhich consider both accuracy and diversity in the re-ranking process.\nSpecifically, PODM-MI adopts Multidimensional Gaussian distributions based on\nvariational inference to capture users' diversity preferences with uncertainty.\nThen we maximize the mutual information between the diversity preferences of\nthe users and the candidate items using the maximum variational inference lower\nbound to enhance their correlations. Subsequently, we derive a utility matrix\nbased on the correlations, enabling the adaptive ranking of items in line with\nuser preferences and establishing a balance between the aforementioned\nobjectives. Experimental results on real-world online e-commerce systems\ndemonstrate the significant improvements of PODM-MI, and we have successfully\ndeployed PODM-MI on an e-commerce search platform.", "paper_summary_zh": "重新排序是透過考慮項目之間的相互關係，重新排列排名清單的過程，以更有效地滿足使用者需求。現有方法主要提升搜尋結果的精確度，通常是以多樣性為代價，導致無法滿足使用者多元需求的結果。相反地，旨在提升多樣性的方法可能會影響結果的精確度，無法滿足使用者對精確度的要求。為了緩解上述問題，本文提出一個基於互信息的偏好導向多樣性模型 (PODM-MI)，在重新排序過程中同時考慮精確度和多樣性。具體來說，PODM-MI 採用基於變異推論的多維高斯分布，以不確定性捕捉使用者的多樣性偏好。然後，我們使用最大變異推論下界最大化使用者多樣性偏好和候選項目之間的互信息，以提升它們之間的關聯性。隨後，我們根據關聯性推導一個效用矩陣，讓項目能夠根據使用者偏好進行自適應排名，並在上述目標之間取得平衡。在真實世界的線上電子商務系統上的實驗結果證明了 PODM-MI 的顯著改進，我們已成功將 PODM-MI 部署在電子商務搜尋平台上。", "author": "Huimu Wang et.al.", "authors": "Huimu Wang, Mingming Li, Dadong Miao, Songlin Wang, Guoyu Tang, Lin Liu, Sulong Xu, Jinghe Hu", "id": "2405.15521v1", "paper_url": "http://arxiv.org/abs/2405.15521v1", "repo": "null"}}