{"2409.05105": {"publish_time": "2024-09-08", "title": "EdaCSC: Two Easy Data Augmentation Methods for Chinese Spelling Correction", "paper_summary": "Chinese Spelling Correction (CSC) aims to detect and correct spelling errors\nin Chinese sentences caused by phonetic or visual similarities. While current\nCSC models integrate pinyin or glyph features and have shown significant\nprogress,they still face challenges when dealing with sentences containing\nmultiple typos and are susceptible to overcorrection in real-world scenarios.\nIn contrast to existing model-centric approaches, we propose two data\naugmentation methods to address these limitations. Firstly, we augment the\ndataset by either splitting long sentences into shorter ones or reducing typos\nin sentences with multiple typos. Subsequently, we employ different training\nprocesses to select the optimal model. Experimental evaluations on the SIGHAN\nbenchmarks demonstrate the superiority of our approach over most existing\nmodels, achieving state-of-the-art performance on the SIGHAN15 test set.", "paper_summary_zh": "中文拼寫校正（CSC）旨在偵測並修正中文句子中因注音或視覺相似性而產生的拼寫錯誤。雖然目前的 CSC 模型整合了注音或字形特徵，並已展現顯著進展，但它們在處理包含多個錯字的句子時仍面臨挑戰，且容易在實際場景中發生過度修正。與現有的以模型為中心的途徑不同，我們提出兩種資料擴充方法來解決這些限制。首先，我們透過將長句子拆分為較短的句子或減少包含多個錯字的句子中的錯字來擴充資料集。隨後，我們採用不同的訓練流程來選擇最佳模型。在 SIGHAN 基準上的實驗評估證明了我們的方法優於大多數現有模型，在 SIGHAN15 測試集中達到了最先進的效能。", "author": "Lei Sheng et.al.", "authors": "Lei Sheng, Shuai-Shuai Xu", "id": "2409.05105v1", "paper_url": "http://arxiv.org/abs/2409.05105v1", "repo": "null"}}