{"2407.10626": {"publish_time": "2024-07-15", "title": "NoviCode: Generating Programs from Natural Language Utterances by Novices", "paper_summary": "Current Text-to-Code models demonstrate impressive capabilities in generating\nexecutable code from natural language snippets. However, current studies focus\non technical instructions and programmer-oriented language, and it is an open\nquestion whether these models can effectively translate natural language\ndescriptions given by non-technical users and express complex goals, to an\nexecutable program that contains an intricate flow - composed of API access and\ncontrol structures as loops, conditions, and sequences. To unlock the challenge\nof generating a complete program from a plain non-technical description we\npresent NoviCode, a novel NL Programming task, which takes as input an API and\na natural language description by a novice non-programmer and provides an\nexecutable program as output. To assess the efficacy of models on this task, we\nprovide a novel benchmark accompanied by test suites wherein the generated\nprogram code is assessed not according to their form, but according to their\nfunctional execution. Our experiments show that, first, NoviCode is indeed a\nchallenging task in the code synthesis domain, and that generating complex code\nfrom non-technical instructions goes beyond the current Text-to-Code paradigm.\nSecond, we show that a novel approach wherein we align the NL utterances with\nthe compositional hierarchical structure of the code, greatly enhances the\nperformance of LLMs on this task, compared with the end-to-end Text-to-Code\ncounterparts.", "paper_summary_zh": "目前文本到程式碼模型在從自然語言片段產生可執行程式碼方面展現了令人印象深刻的能力。然而，目前的研究著重於技術指令和以程式設計師為導向的語言，而這些模型是否能有效翻譯非技術使用者提供的自然語言描述，並將其表達為包含複雜流程的可執行程式（由 API 存取和控制結構組成，例如迴圈、條件和順序），這是一個開放性的問題。為了解鎖從純粹的非技術描述產生完整程式的挑戰，我們提出了 NoviCode，這是一個新穎的自然語言程式設計任務，它以 API 和非程式設計師新手的自然語言描述作為輸入，並提供可執行程式作為輸出。為了評估模型在此任務上的效能，我們提供了一個新穎的基準，並附上測試套件，其中產生的程式碼不是根據其形式評估，而是根據其功能執行來評估。我們的實驗表明，首先，NoviCode 確實是程式碼合成領域的一項具有挑戰性的任務，而且從非技術指令產生複雜程式碼超出了目前的文本到程式碼範例。其次，我們展示了一種新穎的方法，其中我們將自然語言語句與程式碼的組合階層結構對齊，與端到端的文本到程式碼對應程式相比，這大大增強了大型語言模型在此任務上的效能。", "author": "Asaf Achi Mordechai et.al.", "authors": "Asaf Achi Mordechai, Yoav Goldberg, Reut Tsarfaty", "id": "2407.10626v2", "paper_url": "http://arxiv.org/abs/2407.10626v2", "repo": "https://github.com/asafam/novicode"}}