{"2405.17234": {"publish_time": "2024-05-27", "title": "Benchmarking General Purpose In-Context Learning", "paper_summary": "In-context learning (ICL) capabilities is becoming increasingly appealing\ntowards building general intelligence. Taking this concept one step further, we\ndraw a parallel to humans and many animals, who inherit primarily learning\ncapabilities but refine their memory and acquire diverse skills and knowledge\nthrough extensive lifelong experiences. This parallel inspires our approach to\ngeneral purpose in-context learning (GPICL). This paper introduces two\nlightweight but insightful benchmarks specifically crafted to train and\nevaluate GPICL functionalities. Each benchmark encompasses a wide range of\ndiverse tasks characterized by generation and interaction, minimal transferable\nknowledge, and long-term dependency. These features present significant\nchallenges for models that primarily rely on context or interactions to enhance\ntheir proficiency. We hope that these benchmarks will not only advance research\nin GPICL but also contribute significantly to the broader field of general\nintelligence.", "paper_summary_zh": "情境學習（ICL）能力對於建構一般智慧正變得越來越有吸引力。進一步採取此概念，我們將人類和許多動物視為平行，他們繼承了主要的學習能力，但透過廣泛的終身經驗，改善他們的記憶力並習得多元的技能和知識。這種平行激勵我們採取一般用途情境學習（GPICL）的方法。此論文介紹兩個輕量級但有見地的基準，專門設計用於訓練和評估 GPICL 功能。每個基準都包含廣泛的多元任務，其特點是產生和互動、最少的可轉移知識，以及長期依賴性。這些特點對主要依賴情境或互動來提升其熟練度的模型提出了重大挑戰。我們希望這些基準不僅能推進 GPICL 的研究，也能對一般智慧的更廣泛領域做出重大貢獻。", "author": "Fan Wang et.al.", "authors": "Fan Wang, Chuan Lin, Yang Cao, Yu Kang", "id": "2405.17234v1", "paper_url": "http://arxiv.org/abs/2405.17234v1", "repo": "null"}}