{"2410.21324": {"publish_time": "2024-10-26", "title": "Mathematical Derivation Graphs: A Task for Summarizing Equation Dependencies in STEM Manuscripts", "paper_summary": "Recent advances in natural language processing (NLP), particularly with the\nemergence of large language models (LLMs), have significantly enhanced the\nfield of textual analysis. However, while these developments have yielded\nsubstantial progress in analyzing textual data, applying analysis to\nmathematical equations and their relationships within texts has produced mixed\nresults. In this paper, we take the initial steps toward understanding the\ndependency relationships between mathematical expressions in STEM articles. Our\ndataset, sourced from a random sampling of the arXiv corpus, contains an\nanalysis of 107 published STEM manuscripts whose inter-equation dependency\nrelationships have been hand-labeled, resulting in a new object we refer to as\na derivation graph that summarizes the mathematical content of the manuscript.\nWe exhaustively evaluate analytical and NLP-based models to assess their\ncapability to identify and extract the derivation relationships for each\narticle and compare the results with the ground truth. Our comprehensive\ntesting finds that both analytical and NLP models (including LLMs) achieve\n$\\sim$40-50% F1 scores for extracting derivation graphs from articles,\nrevealing that the recent advances in NLP have not made significant inroads in\ncomprehending mathematical texts compared to simpler analytic models. While\ncurrent approaches offer a solid foundation for extracting mathematical\ninformation, further research is necessary to improve accuracy and depth in\nthis area.", "paper_summary_zh": "自然語言處理（NLP）的最新進展，特別是大語言模型（LLM）的出現，已顯著增強了文本分析領域。然而，儘管這些發展在分析文本資料方面取得了實質性進展，但將分析應用於數學方程式及其在文本中的關係卻產生了不同的結果。在本文中，我們採取了初步步驟來了解 STEM 文章中數學表達式之間的依賴關係。我們的資料集取自 arXiv 語料庫的隨機抽樣，其中包含對 107 篇已發表的 STEM 手稿的分析，其方程式間的依賴關係已進行手動標記，產生了一個我們稱為衍生圖的新物件，該物件總結了手稿的數學內容。我們徹底評估了分析和基於 NLP 的模型，以評估它們識別和提取每篇文章的衍生關係的能力，並將結果與真實情況進行比較。我們的全面測試發現，分析和 NLP 模型（包括 LLM）在從文章中提取衍生圖方面的 F1 分數均達到 $\\sim$40-50%，這表明與更簡單的分析模型相比，NLP 的最新進展並沒有在理解數學文本方面取得重大進展。儘管目前的方法為提取數學資訊提供了堅實的基礎，但仍需要進一步的研究來提高此領域的準確性和深度。", "author": "Vishesh Prasad et.al.", "authors": "Vishesh Prasad, Brian Kim, Nickvash Kani", "id": "2410.21324v1", "paper_url": "http://arxiv.org/abs/2410.21324v1", "repo": "null"}}