{"2406.06196": {"publish_time": "2024-06-10", "title": "LINGOLY: A Benchmark of Olympiad-Level Linguistic Reasoning Puzzles in Low-Resource and Extinct Languages", "paper_summary": "In this paper, we present the LingOly benchmark, a novel benchmark for\nadvanced reasoning abilities in large language models. Using challenging\nLinguistic Olympiad puzzles, we evaluate (i) capabilities for in-context\nidentification and generalisation of linguistic patterns in very low-resource\nor extinct languages, and (ii) abilities to follow complex task instructions.\nThe LingOly benchmark covers more than 90 mostly low-resource languages,\nminimising issues of data contamination, and contains 1,133 problems across 6\nformats and 5 levels of human difficulty. We assess performance with both\ndirect accuracy and comparison to a no-context baseline to penalise\nmemorisation. Scores from 11 state-of-the-art LLMs demonstrate the benchmark to\nbe challenging, and models perform poorly on the higher difficulty problems. On\nharder problems, even the top model only achieved 35.3% accuracy, 21.7%\nimprovement over the no-context baseline. Large closed models typically\noutperform open models, and in general, the higher resource the language, the\nbetter the scores. These results indicate, in absence of memorisation, true\nmulti-step out-of-domain reasoning remains a challenge for current language\nmodels.", "paper_summary_zh": "在本文中，我们提出了 LingOly Benchmark，这是一个针对大型语言模型的高级推理能力的新基准。通过使用具有挑战性的语言奥林匹克难题，我们评估了（i）在极低资源或灭绝语言中对语言模式进行语境识别和概括的能力，以及（ii）遵循复杂任务说明的能力。LingOly Benchmark 涵盖了 90 多种低资源语言，最大程度地减少了数据污染问题，并包含了 6 种格式和 5 个难度等级的 1,133 个问题。我们通过直接准确性和与无上下文基准的比较来评估性能，以惩罚记忆。来自 11 个最先进 LLM 的分数表明该基准具有挑战性，并且模型在难度较高的难题上表现不佳。在较难的问题上，即使是顶级模型也只达到 35.3% 的准确度，比无上下文基准提高了 21.7%。大型封闭模型通常优于开放模型，并且一般来说，语言资源越多，分数就越好。这些结果表明，在没有记忆的情况下，真正的多步骤域外推理仍然是当前语言模型面临的挑战。", "author": "Andrew M. Bean et.al.", "authors": "Andrew M. Bean, Simi Hellsten, Harry Mayne, Jabez Magomere, Ethan A. Chi, Ryan Chi, Scott A. Hale, Hannah Rose Kirk", "id": "2406.06196v1", "paper_url": "http://arxiv.org/abs/2406.06196v1", "repo": "https://github.com/am-bean/lingOly"}}