{"2406.06196": {"publish_time": "2024-06-10", "title": "LINGOLY: A Benchmark of Olympiad-Level Linguistic Reasoning Puzzles in Low-Resource and Extinct Languages", "paper_summary": "In this paper, we present the LingOly benchmark, a novel benchmark for\nadvanced reasoning abilities in large language models. Using challenging\nLinguistic Olympiad puzzles, we evaluate (i) capabilities for in-context\nidentification and generalisation of linguistic patterns in very low-resource\nor extinct languages, and (ii) abilities to follow complex task instructions.\nThe LingOly benchmark covers more than 90 mostly low-resource languages,\nminimising issues of data contamination, and contains 1,133 problems across 6\nformats and 5 levels of human difficulty. We assess performance with both\ndirect accuracy and comparison to a no-context baseline to penalise\nmemorisation. Scores from 11 state-of-the-art LLMs demonstrate the benchmark to\nbe challenging, and models perform poorly on the higher difficulty problems. On\nharder problems, even the top model only achieved 38.7% accuracy, 24.7%\nimprovement over the no-context baseline. Large closed models typically\noutperform open models, and in general, the higher resource the language, the\nbetter the scores. These results indicate, in absence of memorisation, true\nmulti-step out-of-domain reasoning remains a challenge for current language\nmodels.", "paper_summary_zh": "在本文中，我们提出了 LingOly 基準，這是大型語言模型中高級推理能力的新基準。使用具有挑戰性的語言奧林匹克謎題，我們評估 (i) 在極低資源或已滅絕的語言中，在情境中識別和概括語言模式的能力，以及 (ii) 遵循複雜任務說明的能力。LingOly 基準涵蓋了 90 多種大多數低資源語言，最大程度地減少了數據污染問題，並包含了 6 種格式和 5 個人類難度級別的 1,133 個問題。我們使用直接準確度和與無情境基準的比較來評估性能，以懲罰記憶。來自 11 個最先進的 LLM 的分數證明了基準具有挑戰性，並且模型在較高難度問題上的表現很差。在更困難的問題上，即使是頂級模型也只達到了 38.7% 的準確度，比無情境基準提高了 24.7%。大型封閉模型通常優於開放模型，而且一般來說，語言資源越多，分數就越好。這些結果表明，在沒有記憶的情況下，真正的多步驟領域外推理仍然是當前語言模型的挑戰。", "author": "Andrew M. Bean et.al.", "authors": "Andrew M. Bean, Simi Hellsten, Harry Mayne, Jabez Magomere, Ethan A. Chi, Ryan Chi, Scott A. Hale, Hannah Rose Kirk", "id": "2406.06196v2", "paper_url": "http://arxiv.org/abs/2406.06196v2", "repo": "https://github.com/am-bean/lingOly"}}