{"2412.03248": {"publish_time": "2024-12-04", "title": "AIM: Adaptive Inference of Multi-Modal LLMs via Token Merging and Pruning", "paper_summary": "Large language models (LLMs) have enabled the creation of multi-modal LLMs\nthat exhibit strong comprehension of visual data such as images and videos.\nHowever, these models usually rely on extensive visual tokens from visual\nencoders, leading to high computational demands, which limits their\napplicability in resource-constrained environments and for long-context tasks.\nIn this work, we propose a training-free adaptive inference method for\nmulti-modal LLMs that can accommodate a broad range of efficiency requirements\nwith a minimum performance drop. Our method consists of a) iterative token\nmerging based on embedding similarity before LLMs, and b) progressive token\npruning within LLM layers based on multi-modal importance. With a minimalist\ndesign, our method can be applied to both video and image LLMs. Extensive\nexperiments on diverse video and image benchmarks demonstrate that, our method\nsubstantially reduces computation load (e.g., a $\\textbf{7-fold}$ reduction in\nFLOPs) while preserving the performance of video and image LLMs. Further, under\na similar computational cost, our method outperforms the state-of-the-art\nmethods in long video understanding (e.g., $\\textbf{+4.6}$ on MLVU).\nAdditionally, our in-depth analysis provides insights into token redundancy and\nLLM layer behaviors, offering guidance for future research in designing\nefficient multi-modal LLMs. Our code will be available at\nhttps://github.com/LaVi-Lab/AIM.", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 已能建立多模態 LLM，能對視覺資料（例如影像和影片）展現強大的理解力。\n然而，這些模型通常仰賴視覺編碼器的廣泛視覺符號，導致高運算需求，限制其在資源受限環境和長脈絡任務中的應用。\n在這項工作中，我們為多模態 LLM 提出一個免訓練的自適應推論方法，能以最小的效能下降來適應廣泛的效率需求。我們的做法包括 a) 在 LLM 之前根據嵌入相似性進行反覆符號合併，以及 b) 根據多模態重要性在 LLM 層中進行漸進符號修剪。我們的做法採用極簡設計，可應用於影片和影像 LLM。在各種影片和影像基準上的廣泛實驗證明，我們的做法大幅降低運算負載（例如，FLOP 減少了 $\\textbf{7 倍}$），同時保留影片和影像 LLM 的效能。此外，在類似的運算成本下，我們的做法在長影片理解方面優於現有技術（例如，在 MLVU 上 $\\textbf{+4.6}$）。\n此外，我們的深入分析提供了符號冗餘和 LLM 層行為的見解，為未來設計高效多模態 LLM 的研究提供指導。我們的程式碼將於 https://github.com/LaVi-Lab/AIM 上提供。</paragraph>", "author": "Yiwu Zhong et.al.", "authors": "Yiwu Zhong, Zhuoming Liu, Yin Li, Liwei Wang", "id": "2412.03248v1", "paper_url": "http://arxiv.org/abs/2412.03248v1", "repo": "https://github.com/lavi-lab/aim"}}