{"2212.00951": {"publish_time": "2022-12-02", "title": "SimpleMind adds thinking to deep neural networks", "paper_summary": "Deep neural networks (DNNs) detect patterns in data and have shown\nversatility and strong performance in many computer vision applications.\nHowever, DNNs alone are susceptible to obvious mistakes that violate simple,\ncommon sense concepts and are limited in their ability to use explicit\nknowledge to guide their search and decision making. While overall DNN\nperformance metrics may be good, these obvious errors, coupled with a lack of\nexplainability, have prevented widespread adoption for crucial tasks such as\nmedical image analysis. The purpose of this paper is to introduce SimpleMind,\nan open-source software framework for Cognitive AI focused on medical image\nunderstanding. It allows creation of a knowledge base that describes expected\ncharacteristics and relationships between image objects in an intuitive\nhuman-readable form. The SimpleMind framework brings thinking to DNNs by: (1)\nproviding methods for reasoning with the knowledge base about image content,\nsuch as spatial inferencing and conditional reasoning to check DNN outputs; (2)\napplying process knowledge, in the form of general-purpose software agents,\nthat are chained together to accomplish image preprocessing, DNN prediction,\nand result post-processing, and (3) performing automatic co-optimization of all\nknowledge base parameters to adapt agents to specific problems. SimpleMind\nenables reasoning on multiple detected objects to ensure consistency, providing\ncross checking between DNN outputs. This machine reasoning improves the\nreliability and trustworthiness of DNNs through an interpretable model and\nexplainable decisions. Example applications are provided that demonstrate how\nSimpleMind supports and improves deep neural networks by embedding them within\na Cognitive AI framework.", "paper_summary_zh": "", "author": "Youngwon Choi et.al.", "authors": "Youngwon Choi,M. Wasil Wahi-Anwar,Matthew S. Brown", "id": "2212.00951v1", "paper_url": "http://arxiv.org/abs/2212.00951v1", "repo": "https://gitlab.com/sm-ai-team/simplemind"}}