{"2410.23953": {"publish_time": "2024-10-31", "title": "Representative Social Choice: From Learning Theory to AI Alignment", "paper_summary": "Social choice theory is the study of preference aggregation across a\npopulation, used both in mechanism design for human agents and in the\ndemocratic alignment of language models. In this study, we propose the\nrepresentative social choice framework for the modeling of democratic\nrepresentation in collective decisions, where the number of issues and\nindividuals are too large for mechanisms to consider all preferences directly.\nThese scenarios are widespread in real-world decision-making processes, such as\njury trials, indirect elections, legislation processes, corporate governance,\nand, more recently, language model alignment. In representative social choice,\nthe population is represented by a finite sample of individual-issue pairs\nbased on which social choice decisions are made. We show that many of the\ndeepest questions in representative social choice can be naturally formulated\nas statistical learning problems, and prove the generalization properties of\nsocial choice mechanisms using the theory of machine learning. We further\nformulate axioms for representative social choice, and prove Arrow-like\nimpossibility theorems with new combinatorial tools of analysis. Our framework\nintroduces the representative approach to social choice, opening up research\ndirections at the intersection of social choice, learning theory, and AI\nalignment.", "paper_summary_zh": "社會選擇理論是研究人口偏好彙整，用於人類代理機制的設計和語言模型的民主對齊。在本研究中，我們提出代表性社會選擇架構，用於建模集體決策中的民主代表性，其中議題和個人數量太多，無法讓機制直接考慮所有偏好。這些場景廣泛存在於現實世界的決策過程中，例如陪審團審判、間接選舉、立法程序、公司治理，最近還有語言模型對齊。在代表性社會選擇中，人口由有限的個人議題配對樣本表示，基於此做出社會選擇決策。我們展示了代表性社會選擇中的許多最深層問題都可以自然地表述為統計學習問題，並使用機器學習理論證明了社會選擇機制的泛化性質。我們進一步為代表性社會選擇制定公理，並使用新的組合分析工具證明了類似 Arrow 的不可能定理。我們的框架引入了社會選擇的代表性方法，開啟了社會選擇、學習理論和 AI 對齊交叉領域的研究方向。", "author": "Tianyi Qiu et.al.", "authors": "Tianyi Qiu", "id": "2410.23953v1", "paper_url": "http://arxiv.org/abs/2410.23953v1", "repo": "null"}}