{"2412.07121": {"publish_time": "2024-12-10", "title": "Bridging the Gap for Test-Time Multimodal Sentiment Analysis", "paper_summary": "Multimodal sentiment analysis (MSA) is an emerging research topic that aims\nto understand and recognize human sentiment or emotions through multiple\nmodalities. However, in real-world dynamic scenarios, the distribution of\ntarget data is always changing and different from the source data used to train\nthe model, which leads to performance degradation. Common adaptation methods\nusually need source data, which could pose privacy issues or storage overheads.\nTherefore, test-time adaptation (TTA) methods are introduced to improve the\nperformance of the model at inference time. Existing TTA methods are always\nbased on probabilistic models and unimodal learning, and thus can not be\napplied to MSA which is often considered as a multimodal regression task. In\nthis paper, we propose two strategies: Contrastive Adaptation and Stable\nPseudo-label generation (CASP) for test-time adaptation for multimodal\nsentiment analysis. The two strategies deal with the distribution shifts for\nMSA by enforcing consistency and minimizing empirical risk, respectively.\nExtensive experiments show that CASP brings significant and consistent\nimprovements to the performance of the model across various distribution shift\nsettings and with different backbones, demonstrating its effectiveness and\nversatility. Our codes are available at https://github.com/zrguo/CASP.", "paper_summary_zh": "多模态情感分析 (MSA) 是一项新兴的研究主题，旨在通过多种模态来理解和识别人类的情感或情绪。然而，在现实世界的动态场景中，目标数据的分布总是在变化，并且不同于用于训练模型的源数据，这会导致性能下降。常见的适应方法通常需要源数据，这可能会带来隐私问题或存储开销。因此，引入了测试时适应 (TTA) 方法来提高模型在推理时的性能。现有的 TTA 方法总是基于概率模型和单模态学习，因此不能应用于 MSA，MSA 通常被认为是一种多模态回归任务。在本文中，我们提出了两种策略：对比适应和稳定伪标签生成 (CASP)，用于多模态情感分析的测试时适应。这两种策略分别通过强制一致性和最小化经验风险来处理 MSA 的分布偏移。大量实验表明，CASP 在各种分布偏移设置和不同的主干下为模型的性能带来了显著且一致的改进，证明了其有效性和多功能性。我们的代码可在 https://github.com/zrguo/CASP 获得。", "author": "Zirun Guo et.al.", "authors": "Zirun Guo, Tao Jin, Wenlong Xu, Wang Lin, Yangyang Wu", "id": "2412.07121v1", "paper_url": "http://arxiv.org/abs/2412.07121v1", "repo": "https://github.com/zrguo/casp"}}