{"2405.01799": {"publish_time": "2024-05-03", "title": "Exploiting ChatGPT for Diagnosing Autism-Associated Language Disorders and Identifying Distinct Features", "paper_summary": "Diagnosing language disorders associated with autism is a complex and nuanced\nchallenge, often hindered by the subjective nature and variability of\ntraditional assessment methods. Traditional diagnostic methods not only require\nintensive human effort but also often result in delayed interventions due to\ntheir lack of speed and specificity. In this study, we explored the application\nof ChatGPT, a state of the art large language model, to overcome these\nobstacles by enhancing diagnostic accuracy and profiling specific linguistic\nfeatures indicative of autism. Leveraging ChatGPT advanced natural language\nprocessing capabilities, this research aims to streamline and refine the\ndiagnostic process. Specifically, we compared ChatGPT's performance with that\nof conventional supervised learning models, including BERT, a model acclaimed\nfor its effectiveness in various natural language processing tasks. We showed\nthat ChatGPT substantially outperformed these models, achieving over 13%\nimprovement in both accuracy and F1 score in a zero shot learning\nconfiguration. This marked enhancement highlights the model potential as a\nsuperior tool for neurological diagnostics. Additionally, we identified ten\ndistinct features of autism associated language disorders that vary\nsignificantly across different experimental scenarios. These features, which\nincluded echolalia, pronoun reversal, and atypical language usage, were crucial\nfor accurately diagnosing ASD and customizing treatment plans. Together, our\nfindings advocate for adopting sophisticated AI tools like ChatGPT in clinical\nsettings to assess and diagnose developmental disorders. Our approach not only\npromises greater diagnostic precision but also aligns with the goals of\npersonalized medicine, potentially transforming the evaluation landscape for\nautism and similar neurological conditions.", "paper_summary_zh": "", "author": "Chuanbo Hu et.al.", "authors": "Chuanbo Hu,Wenqi Li,Mindi Ruan,Xiangxu Yu,Lynn K. Paul,Shuo Wang,Xin Li", "id": "2405.01799v1", "paper_url": "http://arxiv.org/abs/2405.01799v1", "repo": "null"}}