{"2407.20756": {"publish_time": "2024-07-30", "title": "SynthVLM: High-Efficiency and High-Quality Synthetic Data for Vision Language Models", "paper_summary": "Recently, with the rise of web images, managing and understanding large-scale\nimage datasets has become increasingly important. Vision Large Language Models\n(VLLMs) have recently emerged due to their robust vision-understanding\ncapabilities. However, training these models requires vast amounts of data,\nposing challenges to efficiency, effectiveness, data quality, and privacy. In\nthis paper, we introduce SynthVLM, a novel data synthesis pipeline for VLLMs.\nUnlike existing methods that generate captions from images, SynthVLM employs\nadvanced diffusion models and high-quality captions to automatically generate\nand select high-resolution images from captions, creating precisely aligned\nimage-text pairs. Leveraging these pairs, we achieve state-of-the-art (SoTA)\nperformance on various vision question answering tasks, maintaining high\nalignment quality and preserving advanced language abilities. Moreover,\nSynthVLM surpasses traditional GPT-4 Vision-based caption generation methods in\nperformance while significantly reducing computational overhead. Crucially, our\nmethod's reliance on purely generated data ensures the preservation of privacy,\nachieving SoTA performance with just 100k data points (only 18% of the official\ndataset size).", "paper_summary_zh": "<paragraph>最近，隨著網路影像的興起，管理和理解大規模影像資料集變得越來越重要。視覺大型語言模型 (VLLM) 近期因其強大的視覺理解能力而備受矚目。然而，訓練這些模型需要大量的資料，對效率、效能、資料品質和隱私都提出了挑戰。在本文中，我們介紹了 SynthVLM，一種用於 VLLM 的新資料合成管道。與從影像產生標題的現有方法不同，SynthVLM 採用先進的擴散模型和高品質標題，從標題自動產生並選擇高解析度影像，建立精確對齊的影像文字配對。透過利用這些配對，我們在各種視覺問題解答任務中達到了最先進 (SoTA) 的效能，維持了高對齊品質並保留了先進的語言能力。此外，SynthVLM 在效能上超越了傳統的 GPT-4 視覺化標題產生方法，同時大幅降低了運算開銷。至關重要的是，我們的方法依賴於純粹產生的資料，確保了隱私的保護，僅使用 10 萬個資料點（僅為官方資料集大小的 18%）就達到了 SoTA 效能。</paragraph>", "author": "Zheng Liu et.al.", "authors": "Zheng Liu, Hao Liang, Wentao Xiong, Qinhan Yu, Conghui He, Bin Cui, Wentao Zhang", "id": "2407.20756v1", "paper_url": "http://arxiv.org/abs/2407.20756v1", "repo": "https://github.com/starriver030515/synthvlm"}}