{"2410.07673": {"publish_time": "2024-10-10", "title": "Multimodal Clickbait Detection by De-confounding Biases Using Causal Representation Inference", "paper_summary": "This paper focuses on detecting clickbait posts on the Web. These posts often\nuse eye-catching disinformation in mixed modalities to mislead users to click\nfor profit. That affects the user experience and thus would be blocked by\ncontent provider. To escape detection, malicious creators use tricks to add\nsome irrelevant non-bait content into bait posts, dressing them up as legal to\nfool the detector. This content often has biased relations with non-bait\nlabels, yet traditional detectors tend to make predictions based on simple\nco-occurrence rather than grasping inherent factors that lead to malicious\nbehavior. This spurious bias would easily cause misjudgments. To address this\nproblem, we propose a new debiased method based on causal inference. We first\nemploy a set of features in multiple modalities to characterize the posts.\nConsidering these features are often mixed up with unknown biases, we then\ndisentangle three kinds of latent factors from them, including the invariant\nfactor that indicates intrinsic bait intention; the causal factor which\nreflects deceptive patterns in a certain scenario, and non-causal noise. By\neliminating the noise that causes bias, we can use invariant and causal factors\nto build a robust model with good generalization ability. Experiments on three\npopular datasets show the effectiveness of our approach.", "paper_summary_zh": "本論文專注於偵測網路上的聳動標題貼文。這些貼文通常使用引人注目的錯誤資訊，並以混合模式誤導使用者點擊以獲利。這會影響使用者體驗，因此會被內容提供者封鎖。為了逃避偵測，惡意創作者會使用技巧將一些無關的非誘餌內容加入誘餌貼文中，將它們偽裝成合法的貼文以愚弄偵測器。這些內容通常與非誘餌標籤有偏誤的關聯，但傳統的偵測器傾向於根據簡單的共現，而不是掌握導致惡意行為的內在因素來做出預測。這種虛假的偏誤很容易造成錯誤判斷。為了解決這個問題，我們提出了一種新的基於因果推論的去偏方法。我們首先使用多種模式中的一組特徵來描述貼文。考慮到這些特徵通常與未知的偏誤混在一起，我們接著從中解開三種類型的潛在因素，包括表示內在誘餌意圖的不變因素；在特定場景中反映欺騙模式的因果因素，以及非因果噪音。透過消除造成偏誤的噪音，我們可以使用不變和因果因素來建立一個具有良好泛化能力的強健模型。在三個熱門資料集上的實驗顯示了我們方法的有效性。", "author": "Jianxing Yu et.al.", "authors": "Jianxing Yu, Shiqi Wang, Han Yin, Zhenlong Sun, Ruobing Xie, Bo Zhang, Yanghui Rao", "id": "2410.07673v1", "paper_url": "http://arxiv.org/abs/2410.07673v1", "repo": "null"}}