{"2408.01866": {"publish_time": "2024-08-03", "title": "Efficient Solutions For An Intriguing Failure of LLMs: Long Context Window Does Not Mean LLMs Can Analyze Long Sequences Flawlessly", "paper_summary": "Large Language Models (LLMs) have demonstrated remarkable capabilities in\ncomprehending and analyzing lengthy sequential inputs, owing to their extensive\ncontext windows that allow processing millions of tokens in a single forward\npass. However, this paper uncovers a surprising limitation: LLMs fall short\nwhen handling long input sequences. We investigate this issue using three\ndatasets and two tasks (sentiment analysis and news categorization) across\nvarious LLMs, including Claude 3, Gemini Pro, GPT 3.5 Turbo, Llama 3 Instruct,\nand Mistral Instruct models. To address this limitation, we propose and\nevaluate ad-hoc solutions that substantially enhance LLMs' performance on long\ninput sequences by up to 50%, while reducing API cost and latency by up to 93%\nand 50%, respectively.", "paper_summary_zh": "大型語言模型 (LLM) 在理解和分析冗長的順序輸入方面表現出非凡的能力，這要歸功於它們廣泛的上下文視窗，允許在單次前向傳遞中處理數百萬個符號。然而，本文揭示了一個令人驚訝的限制：LLM 在處理長輸入序列時表現不佳。我們使用三個資料集和兩個任務（情緒分析和新聞分類）調查了這個問題，涉及各種 LLM，包括 Claude 3、Gemini Pro、GPT 3.5 Turbo、Llama 3 Instruct 和 Mistral Instruct 模型。為了解決這個限制，我們提出並評估了臨時解決方案，這些解決方案大幅提升了 LLM 在長輸入序列上的效能，最高達 50%，同時將 API 成本和延遲分別降低了 93% 和 50%。", "author": "Peyman Hosseini et.al.", "authors": "Peyman Hosseini, Ignacio Castro, Iacopo Ghinassi, Matthew Purver", "id": "2408.01866v1", "paper_url": "http://arxiv.org/abs/2408.01866v1", "repo": "null"}}