{"2410.19546": {"publish_time": "2024-10-25", "title": "Bongard in Wonderland: Visual Puzzles that Still Make AI Go Mad?", "paper_summary": "Recently, newly developed Vision-Language Models (VLMs), such as OpenAI's\nGPT-4o, have emerged, seemingly demonstrating advanced reasoning capabilities\nacross text and image modalities. Yet, the depth of these advances in\nlanguage-guided perception and abstract reasoning remains underexplored, and it\nis unclear whether these models can truly live up to their ambitious promises.\nTo assess the progress and identify shortcomings, we enter the wonderland of\nBongard problems, a set of classical visual reasoning puzzles that require\nhuman-like abilities of pattern recognition and abstract reasoning. While VLMs\noccasionally succeed in identifying discriminative concepts and solving some of\nthe problems, they frequently falter, failing to understand and reason about\nvisual concepts. Surprisingly, even elementary concepts that may seem trivial\nto humans, such as simple spirals, pose significant challenges. Moreover, even\nwhen asked to explicitly focus on and analyze these concepts, they continue to\nfalter, suggesting not only a lack of understanding of these elementary visual\nconcepts but also an inability to generalize to unseen concepts. These\nobservations underscore the current limitations of VLMs, emphasize that a\nsignificant gap remains between human-like visual reasoning and machine\ncognition, and highlight the ongoing need for innovation in this area.", "paper_summary_zh": "最近，新开发的视觉语言模型 (VLM)，例如 OpenAI 的 GPT-4o，已应运而生，似乎展示了跨文本和图像模式的高级推理能力。然而，语言引导感知和抽象推理的这些进步的深度仍未得到充分探索，并且目前尚不清楚这些模型是否真正能够兑现其雄心勃勃的承诺。为了评估进展并找出不足之处，我们进入了邦加德问题的神奇世界，这是一组经典的视觉推理难题，需要人类般的模式识别和抽象推理能力。虽然 VLM 偶尔能够成功识别辨别性概念并解决其中一些问题，但它们经常出现失误，无法理解和推理视觉概念。令人惊讶的是，即使是人类看来微不足道的基本概念，例如简单的螺旋，也构成了重大挑战。此外，即使要求它们明确关注并分析这些概念，它们仍然会失误，这不仅表明它们缺乏对这些基本视觉概念的理解，还表明它们无法推广到看不见的概念。这些观察结果强调了 VLM 当前的局限性，强调人类般的视觉推理和机器认知之间仍然存在巨大差距，并突出了在这个领域持续创新的必要性。", "author": "Antonia Wüst et.al.", "authors": "Antonia Wüst, Tim Tobiasch, Lukas Helff, Devendra S. Dhami, Constantin A. Rothkopf, Kristian Kersting", "id": "2410.19546v1", "paper_url": "http://arxiv.org/abs/2410.19546v1", "repo": "https://github.com/ml-research/bongard-in-wonderland"}}