{"2406.09961": {"publish_time": "2024-06-14", "title": "ChartMimic: Evaluating LMM's Cross-Modal Reasoning Capability via Chart-to-Code Generation", "paper_summary": "We introduce a new benchmark, ChartMimic, aimed at assessing the\nvisually-grounded code generation capabilities of large multimodal models\n(LMMs). ChartMimic utilizes information-intensive visual charts and textual\ninstructions as inputs, requiring LMMs to generate the corresponding code for\nchart rendering. ChartMimic includes 1,000 human-curated (figure, instruction,\ncode) triplets, which represent the authentic chart use cases found in\nscientific papers across various domains(e.g., Physics, Computer Science,\nEconomics, etc). These charts span 18 regular types and 4 advanced types,\ndiversifying into 191 subcategories. Furthermore, we propose multi-level\nevaluation metrics to provide an automatic and thorough assessment of the\noutput code and the rendered charts. Unlike existing code generation\nbenchmarks, ChartMimic places emphasis on evaluating LMMs' capacity to\nharmonize a blend of cognitive capabilities, encompassing visual understanding,\ncode generation, and cross-modal reasoning. The evaluation of 3 proprietary\nmodels and 11 open-weight models highlights the substantial challenges posed by\nChartMimic. Even the advanced GPT-4V, Claude-3-opus only achieve an average\nscore of 73.2 and 53.7, respectively, indicating significant room for\nimprovement. We anticipate that ChartMimic will inspire the development of\nLMMs, advancing the pursuit of artificial general intelligence.", "paper_summary_zh": "<paragraph>我們推出了新的基準 ChartMimic，旨在評估大型多模態模型 (LMM) 的視覺基礎程式碼生成能力。ChartMimic 利用資訊密集的視覺圖表和文字說明作為輸入，要求 LMM 產生對應的圖表繪製程式碼。ChartMimic 包含 1,000 個由人策劃的 (圖形、說明、程式碼) 三元組，代表在各個領域 (例如物理、電腦科學、經濟學等) 的科學論文中發現的真實圖表使用案例。這些圖表涵蓋 18 種常規類型和 4 種進階類型，分為 191 個子類別。此外，我們提出了多層級評估指標，以自動且徹底地評估輸出程式碼和繪製的圖表。與現有的程式碼生成基準不同，ChartMimic 強調評估 LMM 將視覺理解、程式碼生成和跨模態推理等認知能力融會貫通的能力。對 3 個專有模型和 11 個開放權重模型的評估突顯了 ChartMimic 帶來的重大挑戰。即使是進階的 GPT-4V 和 Claude-3-opus 也只分別達到 73.2 和 53.7 的平均分數，表示有很大的進步空間。我們預期 ChartMimic 將激勵 LMM 的發展，推動人工通用智慧的研究。</paragraph>", "author": "Chufan Shi et.al.", "authors": "Chufan Shi, Cheng Yang, Yaxin Liu, Bo Shui, Junjie Wang, Mohan Jing, Linran Xu, Xinyu Zhu, Siheng Li, Yuxiang Zhang, Gongye Liu, Xiaomei Nie, Deng Cai, Yujiu Yang", "id": "2406.09961v1", "paper_url": "http://arxiv.org/abs/2406.09961v1", "repo": "https://github.com/chartmimic/chartmimic"}}