{"2407.11371": {"publish_time": "2024-07-16", "title": "Estimating Agreement by Chance for Sequence Annotation", "paper_summary": "In the field of natural language processing, correction of performance\nassessment for chance agreement plays a crucial role in evaluating the\nreliability of annotations. However, there is a notable dearth of research\nfocusing on chance correction for assessing the reliability of sequence\nannotation tasks, despite their widespread prevalence in the field. To address\nthis gap, this paper introduces a novel model for generating random\nannotations, which serves as the foundation for estimating chance agreement in\nsequence annotation tasks. Utilizing the proposed randomization model and a\nrelated comparison approach, we successfully derive the analytical form of the\ndistribution, enabling the computation of the probable location of each\nannotated text segment and subsequent chance agreement estimation. Through a\ncombination simulation and corpus-based evaluation, we successfully assess its\napplicability and validate its accuracy and efficacy.", "paper_summary_zh": "在自然語言處理領域，修正機會一致性的表現評估在評估註釋的可信度方面扮演著至關重要的角色。然而，儘管序列註釋任務在該領域廣泛盛行，但專注於機會修正以評估序列註釋任務可信度的研究卻相當匱乏。為了解決這個差距，本文介紹了一個用於產生隨機註釋的新穎模型，作為在序列註釋任務中估計機會一致性的基礎。利用所提出的隨機化模型和相關的比較方法，我們成功地推導出分佈的解析形式，進而能計算每個註釋文本區段的可能位置和後續的機會一致性估計。透過結合模擬和基於語料庫的評估，我們成功地評估了其適用性，並驗證了其準確性和有效性。", "author": "Diya Li et.al.", "authors": "Diya Li, Carolyn Rosé, Ao Yuan, Chunxiao Zhou", "id": "2407.11371v1", "paper_url": "http://arxiv.org/abs/2407.11371v1", "repo": "null"}}