{"2410.24220": {"publish_time": "2024-10-31", "title": "Bridging Geometric States via Geometric Diffusion Bridge", "paper_summary": "The accurate prediction of geometric state evolution in complex systems is\ncritical for advancing scientific domains such as quantum chemistry and\nmaterial modeling. Traditional experimental and computational methods face\nchallenges in terms of environmental constraints and computational demands,\nwhile current deep learning approaches still fall short in terms of precision\nand generality. In this work, we introduce the Geometric Diffusion Bridge\n(GDB), a novel generative modeling framework that accurately bridges initial\nand target geometric states. GDB leverages a probabilistic approach to evolve\ngeometric state distributions, employing an equivariant diffusion bridge\nderived by a modified version of Doob's $h$-transform for connecting geometric\nstates. This tailored diffusion process is anchored by initial and target\ngeometric states as fixed endpoints and governed by equivariant transition\nkernels. Moreover, trajectory data can be seamlessly leveraged in our GDB\nframework by using a chain of equivariant diffusion bridges, providing a more\ndetailed and accurate characterization of evolution dynamics. Theoretically, we\nconduct a thorough examination to confirm our framework's ability to preserve\njoint distributions of geometric states and capability to completely model the\nunderlying dynamics inducing trajectory distributions with negligible error.\nExperimental evaluations across various real-world scenarios show that GDB\nsurpasses existing state-of-the-art approaches, opening up a new pathway for\naccurately bridging geometric states and tackling crucial scientific challenges\nwith improved accuracy and applicability.", "paper_summary_zh": "準確預測複雜系統中的幾何狀態演化對於推進量子化學和材料建模等科學領域至關重要。傳統的實驗和計算方法在環境約束和計算需求方面面臨挑戰，而當前的深度學習方法在精確度和普遍性方面仍然不足。在這項工作中，我們引入了幾何擴散橋 (GDB)，這是一種新穎的生成模型框架，可以準確地橋接初始幾何狀態和目標幾何狀態。GDB 採用概率方法來演化幾何狀態分佈，採用通過修改版本的 Doob $h$-變換導出的等變擴散橋來連接幾何狀態。這個量身定制的擴散過程以初始和目標幾何狀態作為固定端點，並受等變遷移核的支配。此外，軌跡數據可以使用等變擴散橋鏈在我們的 GDB 框架中無縫利用，從而提供更詳細和準確的演化動力學表徵。在理論上，我們進行了徹底的檢驗，以確認我們的框架保留幾何狀態的聯合分佈的能力，以及完全建模誘導軌跡分佈的基礎動力學的能力，且誤差可以忽略不計。在各種真實世界場景中的實驗評估表明，GDB 超越了現有的最先進方法，為準確橋接幾何狀態和以更高的準確度和適用性解決關鍵科學挑戰開闢了一條新途徑。", "author": "Shengjie Luo et.al.", "authors": "Shengjie Luo, Yixian Xu, Di He, Shuxin Zheng, Tie-Yan Liu, Liwei Wang", "id": "2410.24220v1", "paper_url": "http://arxiv.org/abs/2410.24220v1", "repo": "null"}}