{"2406.03789": {"publish_time": "2024-06-06", "title": "Enhancing Graph U-Nets for Mesh-Agnostic Spatio-Temporal Flow Prediction", "paper_summary": "This study aims to overcome the conventional deep-learning approaches based\non convolutional neural networks, whose applicability to complex geometries and\nunstructured meshes is limited due to their inherent mesh dependency. We\npropose novel approaches to improve mesh-agnostic spatio-temporal prediction of\ntransient flow fields using graph U-Nets, enabling accurate prediction on\ndiverse mesh configurations. Key enhancements to the graph U-Net architecture,\nincluding the Gaussian mixture model convolutional operator and noise injection\napproaches, provide increased flexibility in modeling node dynamics: the former\nreduces prediction error by 95\\% compared to conventional convolutional\noperators, while the latter improves long-term prediction robustness, resulting\nin an error reduction of 86\\%. We also investigate transductive and\ninductive-learning perspectives of graph U-Nets with proposed improvements. In\nthe transductive setting, they effectively predict quantities for unseen nodes\nwithin the trained graph. In the inductive setting, they successfully perform\nin mesh scenarios with different vortex-shedding periods, showing 98\\%\nimprovement in predicting the future flow fields compared to a model trained\nwithout the inductive settings. It is found that graph U-Nets without pooling\noperations, i.e. without reducing and restoring the node dimensionality of the\ngraph data, perform better in inductive settings due to their ability to learn\nfrom the detailed structure of each graph. Meanwhile, we also discover that the\nchoice of normalization technique significantly impacts graph U-Net\nperformance.", "paper_summary_zh": "本研究旨在克服基於卷積神經網路的傳統深度學習方法，由於其對複雜幾何和非結構網格的適用性受限於其固有的網格依賴性。我們提出新的方法，使用圖形 U-Net 來改善網格不可知時空預測暫態流場，從而能夠對不同的網格配置進行準確預測。圖形 U-Net 架構的主要改進，包括高斯混合模型卷積算子與雜訊注入方法，提供了建模節點動態的靈活性：前者與傳統卷積算子相比，將預測誤差減少了 95%，而後者改善了長期預測的穩健性，從而將誤差減少了 86%。我們還研究了圖形 U-Net 的轉導學習和歸納學習觀點，並提出改進建議。在轉導設置中，它們有效地預測了訓練圖形中未見節點的數量。在歸納設置中，它們成功地在具有不同渦旋脫落週期的網格場景中執行，與未經歸納設置訓練的模型相比，預測未來流場的準確度提高了 98%。我們發現，沒有池化操作的圖形 U-Net，即沒有減少和恢復圖形數據節點維度的圖形 U-Net，由於它們能夠從每個圖形的詳細結構中學習，因此在歸納設置中表現得更好。同時，我們還發現，正規化技術的選擇會顯著影響圖形 U-Net 的性能。", "author": "Sunwoong Yang et.al.", "authors": "Sunwoong Yang, Ricardo Vinuesa, Namwoo Kang", "id": "2406.03789v1", "paper_url": "http://arxiv.org/abs/2406.03789v1", "repo": "null"}}