{"2408.16272": {"publish_time": "2024-08-29", "title": "Beyond Uncertainty: Evidential Deep Learning for Robust Video Temporal Grounding", "paper_summary": "Existing Video Temporal Grounding (VTG) models excel in accuracy but often\noverlook open-world challenges posed by open-vocabulary queries and untrimmed\nvideos. This leads to unreliable predictions for noisy, corrupted, and\nout-of-distribution data. Adapting VTG models to dynamically estimate\nuncertainties based on user input can address this issue. To this end, we\nintroduce SRAM, a robust network module that benefits from a two-stage\ncross-modal alignment task. More importantly, it integrates Deep Evidential\nRegression (DER) to explicitly and thoroughly quantify uncertainty during\ntraining, thus allowing the model to say \"I do not know\" in scenarios beyond\nits handling capacity. However, the direct application of traditional DER\ntheory and its regularizer reveals structural flaws, leading to unintended\nconstraints in VTG tasks. In response, we develop a simple yet effective\nGeom-regularizer that enhances the uncertainty learning framework from the\nground up. To the best of our knowledge, this marks the first successful\nattempt of DER in VTG. Our extensive quantitative and qualitative results\naffirm the effectiveness, robustness, and interpretability of our modules and\nthe uncertainty learning paradigm in VTG tasks. The code will be made\navailable.", "paper_summary_zh": "現有的影片時序定位 (VTG) 模型在準確度方面表現出色，但通常會忽略開放詞彙查詢和未修剪影片所帶來的開放世界挑戰。這會導致對雜訊、損毀和分佈外資料進行不可靠的預測。根據使用者輸入動態估計不確定性，以適應 VTG 模型可以解決此問題。為此，我們引入了 SRAM，這是一個健全的網路模組，受益於兩階段跨模態對齊任務。更重要的是，它整合了深度證據回歸 (DER)，以在訓練期間明確且徹底地量化不確定性，從而允許模型在超出其處理能力的情況下說「我不知道」。然而，傳統 DER 理論及其正則化的直接應用揭示了結構缺陷，導致 VTG 任務中出現意外的約束。為了解決此問題，我們開發了一個簡單但有效的幾何正則化器，從頭開始增強不確定性學習架構。據我們所知，這是 DER 在 VTG 中首次成功嘗試。我們廣泛的量化和定性結果肯定了我們的模組和 VTG 任務中不確定性學習範例的有效性、健全性和可解釋性。程式碼將會提供。", "author": "Kaijing Ma et.al.", "authors": "Kaijing Ma, Haojian Huang, Jin Chen, Haodong Chen, Pengliang Ji, Xianghao Zang, Han Fang, Chao Ban, Hao Sun, Mulin Chen, Xuelong Li", "id": "2408.16272v1", "paper_url": "http://arxiv.org/abs/2408.16272v1", "repo": "null"}}