{"2407.06823": {"publish_time": "2024-07-09", "title": "Cue Point Estimation using Object Detection", "paper_summary": "Cue points indicate possible temporal boundaries in a transition between two\npieces of music in DJ mixing and constitute a crucial element in autonomous DJ\nsystems as well as for live mixing. In this work, we present a novel method for\nautomatic cue point estimation, interpreted as a computer vision object\ndetection task. Our proposed system is based on a pre-trained object detection\ntransformer which we fine-tune on our novel cue point dataset. Our provided\ndataset contains 21k manually annotated cue points from human experts as well\nas metronome information for nearly 5k individual tracks, making this dataset\n35x larger than the previously available cue point dataset. Unlike previous\nmethods, our approach does not require low-level musical information analysis,\nwhile demonstrating increased precision in retrieving cue point positions.\nMoreover, our proposed method demonstrates high adherence to phrasing, a type\nof high-level music structure commonly emphasized in electronic dance music.\nThe code, model checkpoints, and dataset are made publicly available.", "paper_summary_zh": "提示點表示 DJ 混音中兩段音樂之間可能的暫停時間，並構成自主 DJ 系統和現場混音的重要元素。在這項工作中，我們提出了一種自動提示點估計的新方法，它被解釋為電腦視覺物件偵測任務。我們提出的系統基於預先訓練的物件偵測轉換器，我們對我們新穎的提示點資料集進行微調。我們提供的資料集包含來自人類專家的 21k 個手動標記提示點，以及近 5k 個個別音軌的節拍器資訊，這使得此資料集比以前可用的提示點資料集大 35 倍。與先前的做法不同，我們的做法不需要低階音樂資訊分析，同時在擷取提示點位置時展現出更高的精確度。此外，我們提出的方法展現出高度符合樂句，這是一種電子舞曲中常見的高階音樂結構。程式碼、模型檢查點和資料集已公開提供。", "author": "Giulia Argüello et.al.", "authors": "Giulia Argüello, Luca A. Lanzendörfer, Roger Wattenhofer", "id": "2407.06823v1", "paper_url": "http://arxiv.org/abs/2407.06823v1", "repo": "https://github.com/eth-disco/cue-detr"}}