{"2412.04718": {"publish_time": "2024-12-06", "title": "Adaptive Optimization for Enhanced Efficiency in Large-Scale Language Model Training", "paper_summary": "With the rapid development of natural language processing technology,\nlarge-scale language models (LLM) have achieved remarkable results in a variety\nof tasks. However, how to effectively train these huge models and improve their\nperformance and computational efficiency remains an important challenge. This\npaper proposes an improved method based on adaptive optimization algorithm,\naiming to improve the training efficiency and final performance of LLM. Through\ncomparative experiments on the SQuAD and GLUE data sets, the experimental\nresults show that compared with traditional optimization algorithms (such as\nSGD, Momentum, AdaGrad, RMSProp and Adam), the adaptive optimization algorithm\nwe proposed has better accuracy and F1 score. Both have achieved significant\nimprovements, especially showed stronger training capabilities when processed\nlarge-scale texts and complex tasks. The research results verify the advantages\nof adaptive optimization algorithms in large-scale language model training and\nprovide new ideas and directions for future optimization methods.", "paper_summary_zh": "隨著自然語言處理技術的快速發展，\n大規模語言模型 (LLM) 在各種任務中取得了顯著的成果。\n然而，如何有效地訓練這些龐大的模型並提高其\n效能和計算效率仍然是一項重要的挑戰。本文提出了一種基於自適應優化演算法的改進方法，\n旨在提高 LLM 的訓練效率和最終效能。通過\n在 SQuAD 和 GLUE 資料集上進行比較實驗，實驗\n結果表明，與傳統優化演算法（例如\nSGD、Momentum、AdaGrad、RMSProp 和 Adam）相比，我們提出的自適應優化演算法具有更好的準確度和 F1 分數。兩者都取得了顯著的\n進步，特別是在處理\n大規模文字和複雜任務時表現出更強的訓練能力。研究結果驗證了自適應優化演算法在大規模語言模型訓練中的優點，並為未來的優化方法提供了新的思路和方向。", "author": "Jiajing Chen et.al.", "authors": "Jiajing Chen, Bingying Liu, Xiaoxuan Liao, Jia Gao, Hongye Zheng, Yue Li", "id": "2412.04718v1", "paper_url": "http://arxiv.org/abs/2412.04718v1", "repo": "null"}}