{"2406.12732": {"publish_time": "2024-06-18", "title": "Automatic generation of insights from workers' actions in industrial workflows with explainable Machine Learning", "paper_summary": "New technologies such as Machine Learning (ML) gave great potential for\nevaluating industry workflows and automatically generating key performance\nindicators (KPIs). However, despite established standards for measuring the\nefficiency of industrial machinery, there is no precise equivalent for workers'\nproductivity, which would be highly desirable given the lack of a skilled\nworkforce for the next generation of industry workflows. Therefore, an ML\nsolution combining data from manufacturing processes and workers' performance\nfor that goal is required. Additionally, in recent times intense effort has\nbeen devoted to explainable ML approaches that can automatically explain their\ndecisions to a human operator, thus increasing their trustworthiness. We\npropose to apply explainable ML solutions to differentiate between expert and\ninexpert workers in industrial workflows, which we validate at a quality\nassessment industrial workstation. Regarding the methodology used, input data\nare captured by a manufacturing machine and stored in a NoSQL database. Data\nare processed to engineer features used in automatic classification and to\ncompute workers' KPIs to predict their level of expertise (with all\nclassification metrics exceeding 90 %). These KPIs, and the relevant features\nin the decisions are textually explained by natural language expansion on an\nexplainability dashboard. These automatic explanations made it possible to\ninfer knowledge from expert workers for inexpert workers. The latter\nillustrates the interest of research in self-explainable ML for automatically\ngenerating insights to improve productivity in industrial workflows.", "paper_summary_zh": "機器學習 (ML) 等新技術為評估產業工作流程和自動生成關鍵績效指標 (KPI) 帶來了巨大的潛力。然而，儘管有既定的標準來衡量工業機械的效率，但對於工人的生產力卻沒有精確的等價物，這在下一代產業工作流程缺乏熟練勞動力的情況下是非常需要的。因此，需要一種結合製造流程和工人績效數據的 ML 解决方案來達成此目標。此外，近年來，人們投入了大量精力來解釋 ML 方法，這些方法可以自動向人機操作員解釋其決策，從而提高其可信度。我們建議將可解釋的 ML 解决方案應用於區分產業工作流程中的專家和非專家工人，我們在一個品質評估工業工作站驗證了這一點。關於所使用的技術，輸入數據由製造機器擷取並儲存在 NoSQL 資料庫中。處理數據以設計用於自動分類的功能，並計算工人的 KPI 以預測他們的專業知識水準（所有分類指標均超過 90%）。這些 KPI 和決策中的相關功能由可解釋性儀表板上的自然語言擴充以文字方式解釋。這些自動解釋使得可以從專家工人那裡推論出知識，以供非專家工人使用。後者說明了自解釋性 ML 研究在自動生成見解以提高產業工作流程生產力方面的興趣。", "author": "Francisco de Arriba-Pérez et.al.", "authors": "Francisco de Arriba-Pérez, Silvia García-Méndez, Javier Otero-Mosquera, Francisco J. González-Castaño, Felipe Gil-Castiñeira", "id": "2406.12732v1", "paper_url": "http://arxiv.org/abs/2406.12732v1", "repo": "null"}}