{"2412.05127": {"publish_time": "2024-12-06", "title": "The Prompt Canvas: A Literature-Based Practitioner Guide for Creating Effective Prompts in Large Language Models", "paper_summary": "The rise of large language models (LLMs) has highlighted the importance of\nprompt engineering as a crucial technique for optimizing model outputs. While\nexperimentation with various prompting methods, such as Few-shot,\nChain-of-Thought, and role-based techniques, has yielded promising results,\nthese advancements remain fragmented across academic papers, blog posts and\nanecdotal experimentation. The lack of a single, unified resource to\nconsolidate the field's knowledge impedes the progress of both research and\npractical application. This paper argues for the creation of an overarching\nframework that synthesizes existing methodologies into a cohesive overview for\npractitioners. Using a design-based research approach, we present the Prompt\nCanvas, a structured framework resulting from an extensive literature review on\nprompt engineering that captures current knowledge and expertise. By combining\nthe conceptual foundations and practical strategies identified in prompt\nengineering, the Prompt Canvas provides a practical approach for leveraging the\npotential of Large Language Models. It is primarily designed as a learning\nresource for pupils, students and employees, offering a structured introduction\nto prompt engineering. This work aims to contribute to the growing discourse on\nprompt engineering by establishing a unified methodology for researchers and\nproviding guidance for practitioners.", "paper_summary_zh": "大型語言模型 (LLM) 的興起凸顯了提示工程作為優化模型輸出的關鍵技術的重要性。雖然對各種提示方法（例如小樣本、思維鏈和基於角色的技術）的實驗已經產生了有希望的結果，但這些進展仍然分散在學術論文、部落格文章和軼事實驗中。缺乏單一、統一的資源來整合該領域的知識，阻礙了研究和實際應用的進展。本文主張建立一個總括性的框架，將現有方法綜合成一個連貫的概觀，供從業者使用。我們使用基於設計的研究方法，提出了提示畫布，這是一個結構化的框架，源自對提示工程的廣泛文獻回顧，捕捉了當前的知識和專業知識。通過結合在提示工程中確定的概念基礎和實用策略，提示畫布提供了一種實用的方法來利用大型語言模型的潛力。它主要設計為學生和員工的學習資源，提供提示工程的結構化介紹。這項工作旨在通過為研究人員建立統一的方法論並為從業者提供指導，為提示工程的討論做出貢獻。", "author": "Michael Hewing et.al.", "authors": "Michael Hewing, Vincent Leinhos", "id": "2412.05127v1", "paper_url": "http://arxiv.org/abs/2412.05127v1", "repo": "null"}}