{"2406.16730": {"publish_time": "2024-06-24", "title": "Convolutional neural network for Lyman break galaxies classification and redshift regression in DESI (Dark Energy Spectroscopic Instrument)", "paper_summary": "DESI is a groundbreaking international project to observe more than 40\nmillion quasars and galaxies over a 5-year period to create a 3D map of the\nsky. This map will enable us to probe multiple aspects of cosmology, from dark\nenergy to neutrino mass. We are focusing here on one type of object observed by\nDESI, the Lyman Break Galaxies (LBGs). The aim is to use their spectra to\ndetermine whether they are indeed LBGs, and if so, to determine their distance\nfrom the Earth using a phenomenon called redshift. This will enable us to place\nthese galaxies on the DESI 3D map.\n  The aim is therefore to develop a convolutional neural network (CNN) inspired\nby QuasarNET (See arXiv:1808.09955), performing simultaneously a classification\n(LBG type or not) and a regression task (determine the redshift of the LBGs).\nInitially, data augmentation techniques such as shifting the spectra in\nwavelengths, adding noise to the spectra, or adding synthetic spectra were used\nto increase the model training dataset from 3,019 data to over 66,000. In a\nsecond phase, modifications to the QuasarNET architecture, notably through\ntransfer learning and hyperparameter tuning with Bayesian optimization, boosted\nmodel performance.\n  Gains of up to 26% were achieved on the Purity/Efficiency curve, which is\nused to evaluate model performance, particularly in areas with interesting\nredshifts, at low (around 2) and high (around 4) redshifts. The best model\nobtained an average score of 94%, compared with 75% for the initial model.", "paper_summary_zh": "DESI 是一個創新的國際專案，在 5 年期間觀測超過 4000 萬個類星體和星系，以建立天空的 3D 地圖。這張地圖將使我們能夠探測宇宙學的各個方面，從暗能量到微中子質量。我們這裡專注於 DESI 觀測到的一種類型物體，萊曼斷裂星系 (LBG)。目的是使用它們的光譜來確定它們是否真的是 LBG，如果是，則使用稱為紅移的現象來確定它們與地球的距離。這將使我們能夠將這些星系放置在 DESI 3D 地圖上。\n因此，目標是開發一個卷積神經網路 (CNN)，靈感來自 QuasarNET（見 arXiv:1808.09955），同時執行分類（LBG 類型或非 LBG 類型）和回歸任務（確定 LBG 的紅移）。\n最初，數據擴充技術（例如在波長上移動光譜、向光譜中添加雜訊或添加合成光譜）被用於將模型訓練資料集從 3,019 個資料增加到超過 66,000 個。在第二階段，對 QuasarNET 架構進行修改，特別是通過轉移學習和使用貝氏最佳化調整超參數，提升了模型效能。\n在純度/效率曲線上獲得了高達 26% 的增益，該曲線用於評估模型效能，特別是在具有有趣的紅移區域，在低（約 2）和高（約 4）紅移。與初始模型的 75% 相比，獲得的最佳模型平均得分為 94%。", "author": "Julien Taran et.al.", "authors": "Julien Taran", "id": "2406.16730v1", "paper_url": "http://arxiv.org/abs/2406.16730v1", "repo": "null"}}