{"2409.19898": {"publish_time": "2024-09-30", "title": "UniSumEval: Towards Unified, Fine-Grained, Multi-Dimensional Summarization Evaluation for LLMs", "paper_summary": "Existing benchmarks for summarization quality evaluation often lack diverse\ninput scenarios, focus on narrowly defined dimensions (e.g., faithfulness), and\nstruggle with subjective and coarse-grained annotation schemes. To address\nthese shortcomings, we create UniSumEval benchmark, which extends the range of\ninput context (e.g., domain, length) and provides fine-grained,\nmulti-dimensional annotations. We use AI assistance in data creation,\nidentifying potentially hallucinogenic input texts, and also helping human\nannotators reduce the difficulty of fine-grained annotation tasks. With\nUniSumEval, we benchmark nine latest language models as summarizers, offering\ninsights into their performance across varying input contexts and evaluation\ndimensions. Furthermore, we conduct a thorough comparison of SOTA automated\nsummary evaluators. Our benchmark data will be available at\nhttps://github.com/DISL-Lab/UniSumEval-v1.0.", "paper_summary_zh": "現有的摘要品質評估基準通常缺乏多樣化的輸入場景，專注於狹義的維度（例如忠實度），並與主觀且粗略的註解範例作鬥爭。為了解決這些缺點，我們建立了 UniSumEval 基準，它擴展了輸入脈絡的範圍（例如，網域、長度），並提供了細緻且多面向的註解。我們在資料建立中使用 AI 輔助，識別潛在的幻覺輸入文字，並協助人工註解者降低細緻註解任務的難度。透過 UniSumEval，我們將九個最新的語言模型作為摘要工具進行基準測試，深入了解它們在不同輸入脈絡和評估維度中的表現。此外，我們對 SOTA 自動摘要評估器進行了徹底的比較。我們的基準資料將於 https://github.com/DISL-Lab/UniSumEval-v1.0 提供。", "author": "Yuho Lee et.al.", "authors": "Yuho Lee, Taewon Lee, Jason Cai, Hang Su, Hwanjun Song", "id": "2409.19898v1", "paper_url": "http://arxiv.org/abs/2409.19898v1", "repo": "https://github.com/disl-lab/unisumeval-v1.0"}}