{"2407.13511": {"publish_time": "2024-07-18", "title": "Can Open-Source LLMs Compete with Commercial Models? Exploring the Few-Shot Performance of Current GPT Models in Biomedical Tasks", "paper_summary": "Commercial large language models (LLMs), like OpenAI's GPT-4 powering ChatGPT\nand Anthropic's Claude 3 Opus, have dominated natural language processing (NLP)\nbenchmarks across different domains. New competing Open-Source alternatives\nlike Mixtral 8x7B or Llama 3 have emerged and seem to be closing the gap while\noften offering higher throughput and being less costly to use. Open-Source LLMs\ncan also be self-hosted, which makes them interesting for enterprise and\nclinical use cases where sensitive data should not be processed by third\nparties. We participated in the 12th BioASQ challenge, which is a retrieval\naugmented generation (RAG) setting, and explored the performance of current GPT\nmodels Claude 3 Opus, GPT-3.5-turbo and Mixtral 8x7b with in-context learning\n(zero-shot, few-shot) and QLoRa fine-tuning. We also explored how additional\nrelevant knowledge from Wikipedia added to the context-window of the LLM might\nimprove their performance. Mixtral 8x7b was competitive in the 10-shot setting,\nboth with and without fine-tuning, but failed to produce usable results in the\nzero-shot setting. QLoRa fine-tuning and Wikipedia context did not lead to\nmeasurable performance gains. Our results indicate that the performance gap\nbetween commercial and open-source models in RAG setups exists mainly in the\nzero-shot setting and can be closed by simply collecting few-shot examples for\ndomain-specific use cases. The code needed to rerun these experiments is\navailable through GitHub.", "paper_summary_zh": "商業大型語言模型（LLM），例如 OpenAI 的 GPT-4 支援 ChatGPT，以及 Anthropic 的 Claude 3 Opus，已在不同領域主宰自然語言處理（NLP）基準。新的競爭性開源替代方案，例如 Mixtral 8x7B 或 Llama 3 已出現，並似乎正在縮小差距，同時通常提供更高的處理量，而且使用成本更低。開源 LLM 也可以自行託管，這使得它們對敏感資料不應由第三方處理的企業和臨床用例很有吸引力。我們參加了第 12 屆 BioASQ 挑戰，這是一個檢索增強生成（RAG）設定，並探討了當前 GPT 模型 Claude 3 Opus、GPT-3.5-turbo 和 Mixtral 8x7b 在情境學習（零次學習、少次學習）和 QLoRa 微調中的效能。我們還探討了從維基百科新增到 LLM 的情境視窗中的額外相關知識如何提升其效能。Mixtral 8x7b 在 10 次學習設定中具有競爭力，無論是否進行微調，但無法在零次學習設定中產生可用的結果。QLoRa 微調和維基百科情境並未帶來可衡量的效能提升。我們的結果表明，在 RAG 設定中，商業和開源模型之間的效能差距主要存在於零次學習設定中，而且可以透過僅收集特定領域用例的少次學習範例來縮小差距。執行這些實驗所需的程式碼可透過 GitHub 取得。", "author": "Samy Ateia et.al.", "authors": "Samy Ateia, Udo Kruschwitz", "id": "2407.13511v1", "paper_url": "http://arxiv.org/abs/2407.13511v1", "repo": "null"}}