{"2501.01005": {"publish_time": "2025-01-02", "title": "FlashInfer: Efficient and Customizable Attention Engine for LLM Inference Serving", "paper_summary": "Transformers, driven by attention mechanisms, form the foundation of large\nlanguage models (LLMs). As these models scale up, efficient GPU attention\nkernels become essential for high-throughput and low-latency inference. Diverse\nLLM applications demand flexible and high-performance attention solutions. We\npresent FlashInfer: a customizable and efficient attention engine for LLM\nserving. FlashInfer tackles KV-cache storage heterogeneity using block-sparse\nformat and composable formats to optimize memory access and reduce redundancy.\nIt also offers a customizable attention template, enabling adaptation to\nvarious settings through Just-In-Time (JIT) compilation. Additionally,\nFlashInfer's load-balanced scheduling algorithm adjusts to dynamism of user\nrequests while maintaining compatibility with CUDAGraph which requires static\nconfiguration. FlashInfer have been integrated into leading LLM serving\nframeworks like SGLang, vLLM and MLC-Engine. Comprehensive kernel-level and\nend-to-end evaluations demonstrate FlashInfer's ability to significantly boost\nkernel performance across diverse inference scenarios: compared to\nstate-of-the-art LLM serving solutions, FlashInfer achieve 29-69%\ninter-token-latency reduction compared to compiler backends for LLM serving\nbenchmark, 28-30% latency reduction for long-context inference, and 13-17%\nspeedup for LLM serving with parallel generation.", "paper_summary_zh": "<paragraph>受注意力机制驱动的 Transformer 构成了大型语言模型 (LLM) 的基础。随着这些模型的扩展，高效的 GPU 注意力内核对于高吞吐量和低延迟推理变得至关重要。各种 LLM 应用程序需要灵活且高性能的注意力解决方案。我们展示了 FlashInfer：一个可定制且高效的注意力引擎，用于 LLM 服务。FlashInfer 使用块稀疏格式和可组合格式来解决 KV 缓存存储异构性，以优化内存访问并减少冗余。它还提供了一个可定制的注意力模板，通过即时 (JIT) 编译实现对各种设置的适应。此外，FlashInfer 的负载均衡调度算法可调整用户请求的动态性，同时保持与需要静态配置的 CUDAGraph 的兼容性。FlashInfer 已集成到领先的 LLM 服务框架中，如 SGLang、vLLM 和 MLC-Engine。全面的内核级和端到端评估证明了 FlashInfer 在各种推理场景中显着提升内核性能的能力：与最先进的 LLM 服务解决方案相比，FlashInfer 实现 29-69% 的令牌间延迟降低，与 LLM 服务基准的编译器后端相比，延迟降低 28-30%，长上下文推理延迟降低 13-17%，并加快 LLM 服务与并行生成的速度 13-17%。</paragraph>", "author": "Zihao Ye et.al.", "authors": "Zihao Ye, Lequn Chen, Ruihang Lai, Wuwei Lin, Yineng Zhang, Stephanie Wang, Tianqi Chen, Baris Kasikci, Vinod Grover, Arvind Krishnamurthy, Luis Ceze", "id": "2501.01005v1", "paper_url": "http://arxiv.org/abs/2501.01005v1", "repo": "https://github.com/flashinfer-ai/flashinfer"}}