{"2409.18901": {"publish_time": "2024-09-27", "title": "Improving Visual Object Tracking through Visual Prompting", "paper_summary": "Learning a discriminative model to distinguish a target from its surrounding\ndistractors is essential to generic visual object tracking. Dynamic target\nrepresentation adaptation against distractors is challenging due to the limited\ndiscriminative capabilities of prevailing trackers. We present a new visual\nPrompting mechanism for generic Visual Object Tracking (PiVOT) to address this\nissue. PiVOT proposes a prompt generation network with the pre-trained\nfoundation model CLIP to automatically generate and refine visual prompts,\nenabling the transfer of foundation model knowledge for tracking. While CLIP\noffers broad category-level knowledge, the tracker, trained on\ninstance-specific data, excels at recognizing unique object instances. Thus,\nPiVOT first compiles a visual prompt highlighting potential target locations.\nTo transfer the knowledge of CLIP to the tracker, PiVOT leverages CLIP to\nrefine the visual prompt based on the similarities between candidate objects\nand the reference templates across potential targets. Once the visual prompt is\nrefined, it can better highlight potential target locations, thereby reducing\nirrelevant prompt information. With the proposed prompting mechanism, the\ntracker can generate improved instance-aware feature maps through the guidance\nof the visual prompt, thus effectively reducing distractors. The proposed\nmethod does not involve CLIP during training, thereby keeping the same training\ncomplexity and preserving the generalization capability of the pretrained\nfoundation model. Extensive experiments across multiple benchmarks indicate\nthat PiVOT, using the proposed prompting method can suppress distracting\nobjects and enhance the tracker.", "paper_summary_zh": "學習一個區別目標與其周圍干擾物的判別模型對於一般的視覺目標追蹤至關重要。由於現有追蹤器的判別能力有限，因此針對干擾物的動態目標表示適應具有挑戰性。我們提出了一種新的視覺提示機制，用於一般的視覺目標追蹤 (PiVOT)，以解決這個問題。PiVOT 提出了一個提示生成網路，並使用預先訓練好的基礎模型 CLIP 來自動生成和優化視覺提示，從而能夠將基礎模型知識轉移到追蹤中。雖然 CLIP 提供了廣泛的類別層級知識，但追蹤器經過特定於實例的資料訓練，擅長識別唯一的物件實例。因此，PiVOT 首先編譯一個視覺提示，重點標示潛在目標位置。為了將 CLIP 的知識轉移到追蹤器，PiVOT 利用 CLIP 根據候選物件與潛在目標之間參考範本的相似性來優化視覺提示。一旦視覺提示經過優化，它就能夠更好地標示潛在目標位置，從而減少不相關的提示資訊。有了建議的提示機制，追蹤器可以透過視覺提示的引導來生成改進的實例感知特徵圖，從而有效地減少干擾物。所提出的方法在訓練期間不涉及 CLIP，從而保持相同的訓練複雜度並保留預訓練基礎模型的泛化能力。跨多個基準的大量實驗表明，使用建議提示方法的 PiVOT 可以抑制干擾物件並增強追蹤器。", "author": "Shih-Fang Chen et.al.", "authors": "Shih-Fang Chen, Jun-Cheng Chen, I-Hong Jhuo, Yen-Yu Lin", "id": "2409.18901v1", "paper_url": "http://arxiv.org/abs/2409.18901v1", "repo": "null"}}