{"2411.11344": {"publish_time": "2024-11-18", "title": "Mitigating Knowledge Conflicts in Language Model-Driven Question Answering", "paper_summary": "Knowledge-aware sequence to sequence generation tasks such as document\nquestion answering and abstract summarization typically requires two types of\nknowledge: encoded parametric knowledge and retrieved contextual information.\nPrevious work show improper correlation between parametric knowledge and\nanswers in the training set could cause the model ignore input information at\ntest time, resulting in un-desirable model behaviour such as over-stability and\nhallucination. In this work, we argue that hallucination could be mitigated via\nexplicit correlation between input source and generated content. We focus on a\ntypical example of hallucination, entity-based knowledge conflicts in question\nanswering, where correlation of entities and their description at training time\nhinders model behaviour during inference.", "paper_summary_zh": "知識感知序列到序列生成任務，例如文件問題回答和摘要摘要，通常需要兩種類型的知識：編碼參數知識和檢索的上下文信息。\n先前的工作表明，訓練集中參數知識和答案之間的不適當相關性可能會導致模型在測試時忽略輸入信息，從而導致不希望的模型行為，例如過度穩定性和幻覺。在這項工作中，我們認為幻覺可以通過輸入源和生成內容之間的明確相關性來減輕。我們專注於幻覺的一個典型例子，即問題回答中的基於實體的知識衝突，其中實體及其在訓練時間的描述的相關性會阻礙推理過程中的模型行為。", "author": "Han Cao et.al.", "authors": "Han Cao, Zhaoyang Zhang, Xiangtian Li, Chufan Wu, Hansong Zhang, Wenqing Zhang", "id": "2411.11344v1", "paper_url": "http://arxiv.org/abs/2411.11344v1", "repo": "null"}}