{"2502.13957": {"publish_time": "2025-02-19", "title": "RAG-Gym: Optimizing Reasoning and Search Agents with Process Supervision", "paper_summary": "Retrieval-augmented generation (RAG) has shown great potential for\nknowledge-intensive tasks, but its traditional architectures rely on static\nretrieval, limiting their effectiveness for complex questions that require\nsequential information-seeking. While agentic reasoning and search offer a more\nadaptive approach, most existing methods depend heavily on prompt engineering.\nIn this work, we introduce RAG-Gym, a unified optimization framework that\nenhances information-seeking agents through fine-grained process supervision at\neach search step. We also propose ReSearch, a novel agent architecture that\nsynergizes answer reasoning and search query generation within the RAG-Gym\nframework. Experiments on four challenging datasets show that RAG-Gym improves\nperformance by up to 25.6\\% across various agent architectures, with ReSearch\nconsistently outperforming existing baselines. Further analysis highlights the\neffectiveness of advanced LLMs as process reward judges and the transferability\nof trained reward models as verifiers for different LLMs. Additionally, we\nexamine the scaling properties of training and inference in agentic RAG. The\nproject homepage is available at https://rag-gym.github.io/.", "paper_summary_zh": "檢索增強生成 (RAG) 已在知識密集型任務中展現出極大的潛力，但其傳統架構依賴於靜態檢索，限制了其對需要循序資訊搜尋的複雜問題的有效性。雖然代理推理和搜尋提供了更具適應性的方法，但現有方法大多高度依賴提示工程。在這項工作中，我們引入了 RAG-Gym，一個統一的最佳化架構，它透過在每個搜尋步驟中進行細緻的流程監督來增強資訊搜尋代理。我們還提出了 ReSearch，這是一種新穎的代理架構，它在 RAG-Gym 架構中協同進行答案推理和搜尋查詢生成。在四個具有挑戰性的資料集上進行的實驗表明，RAG-Gym 透過各種代理架構將效能提升了 25.6%，而 ReSearch 則始終優於現有的基線。進一步的分析突顯了進階 LLM 作為流程獎勵評審員的有效性，以及訓練好的獎勵模型作為不同 LLM 驗證器的可轉移性。此外，我們檢視了代理 RAG 中訓練和推論的縮放特性。專案首頁可於 https://rag-gym.github.io/ 取得。", "author": "Guangzhi Xiong et.al.", "authors": "Guangzhi Xiong, Qiao Jin, Xiao Wang, Yin Fang, Haolin Liu, Yifan Yang, Fangyuan Chen, Zhixing Song, Dengyu Wang, Minjia Zhang, Zhiyong Lu, Aidong Zhang", "id": "2502.13957v1", "paper_url": "http://arxiv.org/abs/2502.13957v1", "repo": "null"}}