{"2409.03905": {"publish_time": "2024-09-05", "title": "CACER: Clinical Concept Annotations for Cancer Events and Relations", "paper_summary": "Clinical notes contain unstructured representations of patient histories,\nincluding the relationships between medical problems and prescription drugs. To\ninvestigate the relationship between cancer drugs and their associated symptom\nburden, we extract structured, semantic representations of medical problem and\ndrug information from the clinical narratives of oncology notes. We present\nClinical Concept Annotations for Cancer Events and Relations (CACER), a novel\ncorpus with fine-grained annotations for over 48,000 medical problems and drug\nevents and 10,000 drug-problem and problem-problem relations. Leveraging CACER,\nwe develop and evaluate transformer-based information extraction (IE) models\nsuch as BERT, Flan-T5, Llama3, and GPT-4 using fine-tuning and in-context\nlearning (ICL). In event extraction, the fine-tuned BERT and Llama3 models\nachieved the highest performance at 88.2-88.0 F1, which is comparable to the\ninter-annotator agreement (IAA) of 88.4 F1. In relation extraction, the\nfine-tuned BERT, Flan-T5, and Llama3 achieved the highest performance at\n61.8-65.3 F1. GPT-4 with ICL achieved the worst performance across both tasks.\nThe fine-tuned models significantly outperformed GPT-4 in ICL, highlighting the\nimportance of annotated training data and model optimization. Furthermore, the\nBERT models performed similarly to Llama3. For our task, LLMs offer no\nperformance advantage over the smaller BERT models. The results emphasize the\nneed for annotated training data to optimize models. Multiple fine-tuned\ntransformer models achieved performance comparable to IAA for several\nextraction tasks.", "paper_summary_zh": "<paragraph>臨床筆記包含患者病史的非結構化表示，包括醫療問題和處方藥之間的關係。為了調查癌症藥物及其相關症狀負擔之間的關係，我們從腫瘤學筆記的臨床敘述中提取了醫療問題和藥物信息的結構化語義表示。我們提出了癌症事件和關係的臨床概念註釋 (CACER)，這是一個新的語料庫，對超過 48,000 個醫療問題和藥物事件以及 10,000 個藥物問題和問題問題關係進行了細粒度註釋。利用 CACER，我們開發並評估了基於Transformer的信息提取 (IE) 模型，例如 BERT、Flan-T5、Llama3 和 GPT-4，使用微調和上下文學習 (ICL)。在事件提取中，微調後的 BERT 和 Llama3 模型在 88.2-88.0 F1 中實現了最高性能，這與 88.4 F1 的標註間協議 (IAA) 相當。在關係提取中，微調後的 BERT、Flan-T5 和 Llama3 在 61.8-65.3 F1 中實現了最高性能。具有 ICL 的 GPT-4 在兩項任務中的表現最差。微調後的模型在 ICL 中明顯優於 GPT-4，突顯了註釋訓練數據和模型優化的重要性。此外，BERT 模型的性能與 Llama3 類似。對於我們的任務，LLM 對較小的 BERT 模型沒有性能優勢。結果強調了對註釋訓練數據以優化模型的需求。多個微調後的Transformer模型實現了與 IAA 相當的性能，用於多項提取任務。</paragraph>", "author": "Yujuan Fu et.al.", "authors": "Yujuan Fu, Giridhar Kaushik Ramachandran, Ahmad Halwani, Bridget T. McInnes, Fei Xia, Kevin Lybarger, Meliha Yetisgen, Özlem Uzuner", "id": "2409.03905v1", "paper_url": "http://arxiv.org/abs/2409.03905v1", "repo": "null"}}