{"2410.02378": {"publish_time": "2024-10-03", "title": "Towards Comprehensive Detection of Chinese Harmful Memes", "paper_summary": "This paper has been accepted in the NeurIPS 2024 D & B Track. Harmful memes\nhave proliferated on the Chinese Internet, while research on detecting Chinese\nharmful memes significantly lags behind due to the absence of reliable datasets\nand effective detectors. To this end, we focus on the comprehensive detection\nof Chinese harmful memes. We construct ToxiCN MM, the first Chinese harmful\nmeme dataset, which consists of 12,000 samples with fine-grained annotations\nfor various meme types. Additionally, we propose a baseline detector,\nMultimodal Knowledge Enhancement (MKE), incorporating contextual information of\nmeme content generated by the LLM to enhance the understanding of Chinese\nmemes. During the evaluation phase, we conduct extensive quantitative\nexperiments and qualitative analyses on multiple baselines, including LLMs and\nour MKE. The experimental results indicate that detecting Chinese harmful memes\nis challenging for existing models while demonstrating the effectiveness of\nMKE. The resources for this paper are available at\nhttps://github.com/DUT-lujunyu/ToxiCN_MM.", "paper_summary_zh": "這篇論文已被 NeurIPS 2024 D & B Track 接受。有害迷因在中國網際網路上大量散布，而由於缺乏可靠的資料集和有效的偵測器，偵測中文有害迷因的研究顯著落後。為此，我們專注於全面偵測中文有害迷因。我們建構了 ToxiCN MM，這是第一個中文有害迷因資料集，其中包含 12,000 個範例，並針對各種迷因類型進行細緻的註解。此外，我們提出了一個基準偵測器，多模式知識增強 (MKE)，它結合了 LLM 生成的迷因內容的背景資訊，以增強對中文迷因的理解。在評估階段，我們對多個基準進行廣泛的量化實驗和定性分析，包括 LLM 和我們的 MKE。實驗結果表明，偵測中文有害迷因對現有模型來說具有挑戰性，同時也證明了 MKE 的有效性。這篇論文的資源可在 https://github.com/DUT-lujunyu/ToxiCN_MM 取得。", "author": "Junyu Lu et.al.", "authors": "Junyu Lu, Bo Xu, Xiaokun Zhang, Hongbo Wang, Haohao Zhu, Dongyu Zhang, Liang Yang, Hongfei Lin", "id": "2410.02378v1", "paper_url": "http://arxiv.org/abs/2410.02378v1", "repo": "https://github.com/dut-lujunyu/toxicn_mm"}}