{"2502.09688": {"publish_time": "2025-02-13", "title": "Towards Virtual Clinical Trials of Radiology AI with Conditional Generative Modeling", "paper_summary": "Artificial intelligence (AI) is poised to transform healthcare by enabling\npersonalized and efficient care through data-driven insights. Although\nradiology is at the forefront of AI adoption, in practice, the potential of AI\nmodels is often overshadowed by severe failures to generalize: AI models can\nhave performance degradation of up to 20% when transitioning from controlled\ntest environments to clinical use by radiologists. This mismatch raises\nconcerns that radiologists will be misled by incorrect AI predictions in\npractice and/or grow to distrust AI, rendering these promising technologies\npractically ineffectual. Exhaustive clinical trials of AI models on abundant\nand diverse data is thus critical to anticipate AI model degradation when\nencountering varied data samples. Achieving these goals, however, is\nchallenging due to the high costs of collecting diverse data samples and\ncorresponding annotations. To overcome these limitations, we introduce a novel\nconditional generative AI model designed for virtual clinical trials (VCTs) of\nradiology AI, capable of realistically synthesizing full-body CT images of\npatients with specified attributes. By learning the joint distribution of\nimages and anatomical structures, our model enables precise replication of\nreal-world patient populations with unprecedented detail at this scale. We\ndemonstrate meaningful evaluation of radiology AI models through VCTs powered\nby our synthetic CT study populations, revealing model degradation and\nfacilitating algorithmic auditing for bias-inducing data attributes. Our\ngenerative AI approach to VCTs is a promising avenue towards a scalable\nsolution to assess model robustness, mitigate biases, and safeguard patient\ncare by enabling simpler testing and evaluation of AI models in any desired\nrange of diverse patient populations.", "paper_summary_zh": "<paragraph>人工智慧 (AI) 準備透過資料驅動的見解，轉型醫療保健，並提供個人化且有效率的照護。儘管放射科處於 AI 採用的最前線，但在實務上，AI 模型的潛力往往會被嚴重的概化失敗所掩蓋：AI 模型在從受控測試環境轉移到放射科醫師的臨床使用時，效能可能會降低多達 20%。這種不匹配引發了疑慮，即放射科醫師在實務上會被不正確的 AI 預測誤導，和/或開始不信任 AI，讓這些有前景的技術在實務上形同失效。因此，在 AI 模型遭遇各種資料範例時，預期 AI 模型的衰退，對豐富且多樣化的資料進行 AI 模型的全面臨床試驗至關重要。然而，由於收集多樣化的資料範例和對應註解的成本很高，實現這些目標具有挑戰性。為了克服這些限制，我們引進一個創新的條件式生成式 AI 模型，專門用於放射科 AI 的虛擬臨床試驗 (VCT)，能夠真實地合成具有特定屬性的病患全身電腦斷層 (CT) 影像。透過學習影像和解剖結構的聯合分佈，我們的模型能夠以空前的細節精確複製真實世界的病患族群。我們透過由我們合成的電腦斷層研究族群支援的 VCT，展示了放射科 AI 模型有意義的評估，揭露模型衰退，並促進演算法稽核，以找出導致偏差的資料屬性。我們對 VCT 的生成式 AI 方法，是一個有前景的途徑，可以評估模型的穩健性、減輕偏差，並透過在任何所需的各種病患族群中，進行更簡單的 AI 模型測試和評估，來保障病患照護。</paragraph>", "author": "Benjamin D. Killeen et.al.", "authors": "Benjamin D. Killeen, Bohua Wan, Aditya V. Kulkarni, Nathan Drenkow, Michael Oberst, Paul H. Yi, Mathias Unberath", "id": "2502.09688v1", "paper_url": "http://arxiv.org/abs/2502.09688v1", "repo": "null"}}