{"2503.10633": {"publish_time": "2025-03-13", "title": "Charting and Navigating Hugging Face's Model Atlas", "paper_summary": "As there are now millions of publicly available neural networks, searching\nand analyzing large model repositories becomes increasingly important.\nNavigating so many models requires an atlas, but as most models are poorly\ndocumented charting such an atlas is challenging. To explore the hidden\npotential of model repositories, we chart a preliminary atlas representing the\ndocumented fraction of Hugging Face. It provides stunning visualizations of the\nmodel landscape and evolution. We demonstrate several applications of this\natlas including predicting model attributes (e.g., accuracy), and analyzing\ntrends in computer vision models. However, as the current atlas remains\nincomplete, we propose a method for charting undocumented regions.\nSpecifically, we identify high-confidence structural priors based on dominant\nreal-world model training practices. Leveraging these priors, our approach\nenables accurate mapping of previously undocumented areas of the atlas. We\npublicly release our datasets, code, and interactive atlas.", "paper_summary_zh": "由於現在有數百萬個公開可用的神經網路，搜尋和分析大型模型庫變得越來越重要。瀏覽這麼多模型需要一個圖譜，但由於大多數模型的說明文件都很差，繪製這樣的圖譜具有挑戰性。為了探索模型庫的隱藏潛力，我們繪製了一個初步圖譜，代表了 Hugging Face 文件記錄的部分。它提供了模型景觀和演變的絕佳視覺化效果。我們展示了這個圖譜的幾個應用，包括預測模型屬性（例如，準確性）和分析電腦視覺模型的趨勢。然而，由於目前的圖譜仍然不完整，我們提出了一種繪製未記錄區域的方法。具體來說，我們根據主流的實際模型訓練實踐，確定了高置信度的結構先驗。利用這些先驗，我們的方法能夠準確地繪製圖譜中先前未記錄的區域。我們公開發布了我們的數據集、程式碼和互動式圖譜。\n", "author": "Eliahu Horwitz et.al.", "authors": "Eliahu Horwitz, Nitzan Kurer, Jonathan Kahana, Liel Amar, Yedid Hoshen", "id": "2503.10633v1", "paper_url": "http://arxiv.org/abs/2503.10633v1", "repo": "null"}}