{"2412.09563": {"publish_time": "2024-12-12", "title": "Does Representation Matter? Exploring Intermediate Layers in Large Language Models", "paper_summary": "Understanding what defines a good representation in large language models\n(LLMs) is fundamental to both theoretical understanding and practical\napplications. In this paper, we investigate the quality of intermediate\nrepresentations in various LLM architectures, including Transformers and State\nSpace Models (SSMs). We find that intermediate layers often yield more\ninformative representations for downstream tasks than the final layers. To\nmeasure the representation quality, we adapt and apply a suite of metrics -\nsuch as prompt entropy, curvature, and augmentation-invariance - originally\nproposed in other contexts. Our empirical study reveals significant\narchitectural differences, how representations evolve throughout training, and\nhow factors like input randomness and prompt length affect each layer. Notably,\nwe observe a bimodal pattern in the entropy of some intermediate layers and\nconsider potential explanations tied to training data. Overall, our results\nilluminate the internal mechanics of LLMs and guide strategies for\narchitectural optimization and training.", "paper_summary_zh": "了解大型語言模型 (LLM) 中良好表徵的定義，對於理論理解和實際應用至關重要。在本文中，我們探討了各種 LLM 架構（包括 Transformer 和狀態空間模型 (SSM)）中中間表徵的品質。我們發現，中間層通常會產生比最後一層更具資訊性的表徵，以供下游任務使用。為了衡量表徵品質，我們調整並套用了一組量度，例如提示熵、曲率和擴充不變性，這些量度最初是在其他背景中提出的。我們的實證研究揭示了顯著的架構差異、表徵在整個訓練過程中如何演變，以及輸入隨機性和提示長度如何影響每一層。值得注意的是，我們觀察到某些中間層的熵呈現雙峰模式，並考慮了與訓練資料相關的潛在解釋。總體而言，我們的結果闡明了 LLM 的內部機制，並為架構最佳化和訓練策略提供指導。", "author": "Oscar Skean et.al.", "authors": "Oscar Skean, Md Rifat Arefin, Yann LeCun, Ravid Shwartz-Ziv", "id": "2412.09563v1", "paper_url": "http://arxiv.org/abs/2412.09563v1", "repo": "null"}}