{"2411.08794": {"publish_time": "2024-11-13", "title": "Evaluating World Models with LLM for Decision Making", "paper_summary": "World model emerges as a key module in decision making, where MuZero and\nDreamer achieve remarkable successes in complex tasks. Recent work leverages\nLarge Language Models (LLMs) as general world simulators to simulate the\ndynamics of the world due to their generalizability. LLMs also serve as the\nworld model for deliberative reasoning in Reasoning via Planning (RAP) and Tree\nof Thought (ToT). However, the world models are either evaluated as a general\nworld simulator, or as a functional module of the agent, i.e., predicting the\ntransitions to assist the planning. In this work, we propose a comprehensive\nevaluation of the world models with LLMs from the decision making perspective.\nSpecifically, we leverage the 31 diverse environments from (Wang et al.,\n2023;2024) and curate the rule-based policy of each environment for the diverse\nevaluation. Then, we design three main tasks, i.e., policy verification, action\nproposal, and policy planning, where the world models can be used for decision\nmaking solely. Finally, we conduct the comprehensive evaluation of the advanced\nLLMs, i.e., GPT-4o and GPT-4o-mini, on the environments for the three main\ntasks under various settings. The key observations include: i) GPT-4o\nsignificantly outperforms GPT-4o-mini on the three main tasks, especially for\nthe tasks which require the domain knowledge, ii) the performance of the world\nmodel with LLM will be decreased for long-term decision-making tasks, and iii)\nthe combination of different functionalities of the world model will brings\nadditional unstabilities of the performance.", "paper_summary_zh": "世界模型成為決策中的一個關鍵模組，其中 MuZero 和 Dreamer 在複雜任務中取得顯著成功。最近的研究利用大型語言模型 (LLM) 作為通用的世界模擬器，模擬世界的動態，因為它們具有普遍性。LLM 也可用作規劃推理 (RAP) 和思考樹 (ToT) 中審議推理的世界模型。然而，世界模型要么被評估為一個通用的世界模擬器，要么作為代理的一個功能模組，即預測過渡以協助規劃。在這項工作中，我們提出了從決策制定角度對使用 LLM 的世界模型進行全面評估。具體來說，我們利用了來自 (Wang et al., 2023;2024) 的 31 個不同的環境，並為不同的評估整理了每個環境的基於規則的策略。然後，我們設計了三個主要任務，即策略驗證、動作建議和策略規劃，世界模型可以僅用於決策制定。最後，我們對先進的 LLM（即 GPT-4o 和 GPT-4o-mini）在不同環境下進行了三個主要任務的綜合評估。關鍵觀察結果包括：i) GPT-4o 在三個主要任務上明顯優於 GPT-4o-mini，特別是對於需要領域知識的任務，ii) 使用 LLM 的世界模型的性能會因長期決策制定任務而降低，以及 iii) 世界模型的不同功能的結合會帶來額外的性能不穩定性。", "author": "Chang Yang et.al.", "authors": "Chang Yang, Xinrun Wang, Junzhe Jiang, Qinggang Zhang, Xiao Huang", "id": "2411.08794v1", "paper_url": "http://arxiv.org/abs/2411.08794v1", "repo": "null"}}