{"2411.02785": {"publish_time": "2024-11-05", "title": "Stochastic Monkeys at Play: Random Augmentations Cheaply Break LLM Safety Alignment", "paper_summary": "Safety alignment of Large Language Models (LLMs) has recently become a\ncritical objective of model developers. In response, a growing body of work has\nbeen investigating how safety alignment can be bypassed through various\njailbreaking methods, such as adversarial attacks. However, these jailbreak\nmethods can be rather costly or involve a non-trivial amount of creativity and\neffort, introducing the assumption that malicious users are high-resource or\nsophisticated. In this paper, we study how simple random augmentations to the\ninput prompt affect safety alignment effectiveness in state-of-the-art LLMs,\nsuch as Llama 3 and Qwen 2. We perform an in-depth evaluation of 17 different\nmodels and investigate the intersection of safety under random augmentations\nwith multiple dimensions: augmentation type, model size, quantization,\nfine-tuning-based defenses, and decoding strategies (e.g., sampling\ntemperature). We show that low-resource and unsophisticated attackers, i.e.\n$\\textit{stochastic monkeys}$, can significantly improve their chances of\nbypassing alignment with just 25 random augmentations per prompt.", "paper_summary_zh": "大型語言模型 (LLM) 的安全調整最近已成為模型開發者的重要目標。為此，越來越多的研究探討如何透過各種越獄方法（例如對抗攻擊）來繞過安全調整。然而，這些越獄方法可能相當昂貴，或需要大量創意和精力，這表示惡意使用者擁有豐富資源或老練。在本文中，我們研究輸入提示的簡單隨機增強如何影響最先進的 LLM（例如 Llama 3 和 Qwen 2）中的安全調整效能。我們對 17 種不同的模型進行深入評估，並研究隨機增強下的安全性與多個面向的交集：增強類型、模型大小、量化、基於微調的防禦，以及解碼策略（例如，抽樣溫度）。我們表明，資源不足且不老練的攻擊者，即「隨機猴子」，只需在每個提示中進行 25 次隨機增強，就能顯著提高他們繞過調整的機率。", "author": "Jason Vega et.al.", "authors": "Jason Vega, Junsheng Huang, Gaokai Zhang, Hangoo Kang, Minjia Zhang, Gagandeep Singh", "id": "2411.02785v1", "paper_url": "http://arxiv.org/abs/2411.02785v1", "repo": "null"}}