{"2502.15623": {"publish_time": "2025-02-21", "title": "Dynamic Knowledge Selector and Evaluator for recommendation with Knowledge Graph", "paper_summary": "In recent years recommendation systems typically employ the edge information\nprovided by knowledge graphs combined with the advantages of high-order\nconnectivity of graph networks in the recommendation field. However, this\nmethod is limited by the sparsity of labels, cannot learn the graph structure\nwell, and a large number of noisy entities in the knowledge graph will affect\nthe accuracy of the recommendation results. In order to alleviate the above\nproblems, we propose a dynamic knowledge-selecting and evaluating method guided\nby collaborative signals to distill information in the knowledge graph.\nSpecifically, we use a Chain Route Evaluator to evaluate the contributions of\ndifferent neighborhoods for the recommendation task and employ a Knowledge\nSelector strategy to filter the less informative knowledge before evaluating.\nWe conduct baseline model comparison and experimental ablation evaluations on\nthree public datasets. The experiments demonstrate that our proposed model\noutperforms current state-of-the-art baseline models, and each modules\neffectiveness in our model is demonstrated through ablation experiments.", "paper_summary_zh": "近年來推薦系統通常採用知識圖譜提供的邊緣資訊，結合圖網路的高階連通性優勢在推薦領域中。然而，此方法受限於標籤的稀疏性，無法學習圖結構，且知識圖譜中大量的雜訊實體將影響推薦結果的準確性。為了緩解上述問題，我們提出一個動態知識選擇與評估方法，由協同訊號引導，以提煉知識圖譜中的資訊。具體來說，我們使用鏈路路由評估器來評估不同鄰域對推薦任務的貢獻，並採用知識選擇策略在評估之前過濾較不具資訊性的知識。我們在三個公開資料集上進行基準模型比較和實驗性消融評估。實驗證明我們提出的模型優於目前的最新基準模型，且透過消融實驗證明我們模型中每個模組的有效性。", "author": "Feng Xia et.al.", "authors": "Feng Xia, Zhifei Hu", "id": "2502.15623v1", "paper_url": "http://arxiv.org/abs/2502.15623v1", "repo": "null"}}