{"2408.06632": {"publish_time": "2024-08-13", "title": "EditScribe: Non-Visual Image Editing with Natural Language Verification Loops", "paper_summary": "Image editing is an iterative process that requires precise visual evaluation\nand manipulation for the output to match the editing intent. However, current\nimage editing tools do not provide accessible interaction nor sufficient\nfeedback for blind and low vision individuals to achieve this level of control.\nTo address this, we developed EditScribe, a prototype system that makes image\nediting accessible using natural language verification loops powered by large\nmultimodal models. Using EditScribe, the user first comprehends the image\ncontent through initial general and object descriptions, then specifies edit\nactions using open-ended natural language prompts. EditScribe performs the\nimage edit, and provides four types of verification feedback for the user to\nverify the performed edit, including a summary of visual changes, AI judgement,\nand updated general and object descriptions. The user can ask follow-up\nquestions to clarify and probe into the edits or verification feedback, before\nperforming another edit. In a study with ten blind or low-vision users, we\nfound that EditScribe supported participants to perform and verify image edit\nactions non-visually. We observed different prompting strategies from\nparticipants, and their perceptions on the various types of verification\nfeedback. Finally, we discuss the implications of leveraging natural language\nverification loops to make visual authoring non-visually accessible.", "paper_summary_zh": "影像編輯是一個反覆的過程，需要精準的視覺評估和操作，才能讓輸出結果符合編輯意圖。然而，現有的影像編輯工具無法提供無障礙的互動，也無法提供足夠的回饋，讓失明或視力低落的使用者達到這樣的控制水準。為了解決這個問題，我們開發了 EditScribe，一個原型系統，它利用大型多模態模型提供自然語言驗證迴圈，讓使用者可以無障礙地編輯影像。使用 EditScribe 時，使用者會先透過最初的一般描述和物件描述來理解影像內容，然後使用開放式的自然語言提示來指定編輯動作。EditScribe 會執行影像編輯，並提供四種類型的驗證回饋，讓使用者驗證已執行的編輯，包括視覺變化的摘要、AI 判斷，以及更新的一般描述和物件描述。使用者可以在執行另一項編輯之前，提出後續問題來釐清和探討編輯或驗證回饋。在與十位失明或視力低落的使用者進行的研究中，我們發現 EditScribe 能夠協助參與者非視覺地執行和驗證影像編輯動作。我們觀察到參與者不同的提示策略，以及他們對各種驗證回饋的看法。最後，我們討論了利用自然語言驗證迴圈來讓非視覺化創作無障礙的意涵。", "author": "Ruei-Che Chang et.al.", "authors": "Ruei-Che Chang, Yuxuan Liu, Lotus Zhang, Anhong Guo", "id": "2408.06632v1", "paper_url": "http://arxiv.org/abs/2408.06632v1", "repo": "null"}}