{"2410.07706": {"publish_time": "2024-10-10", "title": "AgentBank: Towards Generalized LLM Agents via Fine-Tuning on 50000+ Interaction Trajectories", "paper_summary": "Fine-tuning on agent-environment interaction trajectory data holds\nsignificant promise for surfacing generalized agent capabilities in open-source\nlarge language models (LLMs). In this work, we introduce AgentBank, by far the\nlargest trajectory tuning data collection featuring more than 50k diverse\nhigh-quality interaction trajectories which comprises 16 tasks covering five\ndistinct agent skill dimensions. Leveraging a novel annotation pipeline, we are\nable to scale the annotated trajectories and generate a trajectory dataset with\nminimized difficulty bias. Furthermore, we fine-tune LLMs on AgentBank to get a\nseries of agent models, Samoyed. Our comparative experiments demonstrate the\neffectiveness of scaling the interaction trajectory data to acquire generalized\nagent capabilities. Additional studies also reveal some key observations\nregarding trajectory tuning and agent skill generalization.", "paper_summary_zh": "在代理環境互動軌跡資料上進行微調，對於在開源大型語言模型 (LLM) 中浮現廣義的代理功能具有顯著的希望。在這個工作中，我們介紹了 AgentBank，目前為止最大的軌跡調校資料收集，具有超過 50k 個多樣化的優質互動軌跡，其中包含涵蓋五個不同代理技能維度的 16 個任務。利用新穎的註釋管道，我們能夠擴展註釋的軌跡並生成具有最小化難度偏差的軌跡資料集。此外，我們在 AgentBank 上微調 LLM 以獲得一系列代理模型，Samoyed。我們的比較實驗證明了擴展互動軌跡資料以獲取廣義代理功能的有效性。其他研究也揭示了一些關於軌跡調校和代理技能概括化的關鍵觀察。", "author": "Yifan Song et.al.", "authors": "Yifan Song, Weimin Xiong, Xiutian Zhao, Dawei Zhu, Wenhao Wu, Ke Wang, Cheng Li, Wei Peng, Sujian Li", "id": "2410.07706v1", "paper_url": "http://arxiv.org/abs/2410.07706v1", "repo": "null"}}