{"2405.19332": {"publish_time": "2024-05-29", "title": "Self-Exploring Language Models: Active Preference Elicitation for Online Alignment", "paper_summary": "Preference optimization, particularly through Reinforcement Learning from\nHuman Feedback (RLHF), has achieved significant success in aligning Large\nLanguage Models (LLMs) to adhere to human intentions. Unlike offline alignment\nwith a fixed dataset, online feedback collection from humans or AI on model\ngenerations typically leads to more capable reward models and better-aligned\nLLMs through an iterative process. However, achieving a globally accurate\nreward model requires systematic exploration to generate diverse responses that\nspan the vast space of natural language. Random sampling from standard\nreward-maximizing LLMs alone is insufficient to fulfill this requirement. To\naddress this issue, we propose a bilevel objective optimistically biased\ntowards potentially high-reward responses to actively explore\nout-of-distribution regions. By solving the inner-level problem with the\nreparameterized reward function, the resulting algorithm, named Self-Exploring\nLanguage Models (SELM), eliminates the need for a separate RM and iteratively\nupdates the LLM with a straightforward objective. Compared to Direct Preference\nOptimization (DPO), the SELM objective reduces indiscriminate favor of unseen\nextrapolations and enhances exploration efficiency. Our experimental results\ndemonstrate that when finetuned on Zephyr-7B-SFT and Llama-3-8B-Instruct\nmodels, SELM significantly boosts the performance on instruction-following\nbenchmarks such as MT-Bench and AlpacaEval 2.0, as well as various standard\nacademic benchmarks in different settings. Our code and models are available at\nhttps://github.com/shenao-zhang/SELM.", "paper_summary_zh": "偏好最佳化，尤其是透過人類回饋的強化學習 (RLHF)，在讓大型語言模型 (LLM) 符合人類意圖方面取得顯著的成功。與使用固定資料集的離線校準不同，從人類或人工智慧對模型產生的在線回饋通常會透過反覆的過程產生更有能力的獎勵模型和更佳校準的 LLM。然而，要達成全球精準的獎勵模型需要有系統的探索，以產生橫跨自然語言廣大空間的多元回應。僅從標準獎勵最大化的 LLM 進行隨機取樣不足以滿足此項需求。為了解決此問題，我們提出一個雙層次目標，樂觀偏向於潛在高獎勵回應，以積極探索分佈外區域。透過使用重新參數化的獎勵函數解決內層次問題，所產生的演算法，稱為自我探索語言模型 (SELM)，消除了對單獨 RM 的需求，並使用直接的目標反覆更新 LLM。與直接偏好最佳化 (DPO) 相比，SELM 目標減少了對未見外推的無差別偏好，並提升探索效率。我們的實驗結果顯示，當在 Zephyr-7B-SFT 和 Llama-3-8B-Instruct 模型上進行微調時，SELM 在遵循指令的基準測試（例如 MT-Bench 和 AlpacaEval 2.0）以及不同設定中的各種標準學術基準測試上大幅提升效能。我們的程式碼和模型可在 https://github.com/shenao-zhang/SELM 取得。", "author": "Shenao Zhang et.al.", "authors": "Shenao Zhang, Donghan Yu, Hiteshi Sharma, Ziyi Yang, Shuohang Wang, Hany Hassan, Zhaoran Wang", "id": "2405.19332v1", "paper_url": "http://arxiv.org/abs/2405.19332v1", "repo": "https://github.com/shenao-zhang/selm"}}