{"2410.23856": {"publish_time": "2024-10-31", "title": "Can Language Models Perform Robust Reasoning in Chain-of-thought Prompting with Noisy Rationales?", "paper_summary": "This paper investigates an under-explored challenge in large language models\n(LLMs): chain-of-thought prompting with noisy rationales, which include\nirrelevant or inaccurate reasoning thoughts within examples used for in-context\nlearning. We construct NoRa dataset that is tailored to evaluate the robustness\nof reasoning in the presence of noisy rationales. Our findings on NoRa dataset\nreveal a prevalent vulnerability to such noise among current LLMs, with\nexisting robust methods like self-correction and self-consistency showing\nlimited efficacy. Notably, compared to prompting with clean rationales, base\nLLM drops by 1.4%-19.8% in accuracy with irrelevant thoughts and more\ndrastically by 2.2%-40.4% with inaccurate thoughts.\n  Addressing this challenge necessitates external supervision that should be\naccessible in practice. Here, we propose the method of contrastive denoising\nwith noisy chain-of-thought (CD-CoT). It enhances LLMs' denoising-reasoning\ncapabilities by contrasting noisy rationales with only one clean rationale,\nwhich can be the minimal requirement for denoising-purpose prompting. This\nmethod follows a principle of exploration and exploitation: (1) rephrasing and\nselecting rationales in the input space to achieve explicit denoising and (2)\nexploring diverse reasoning paths and voting on answers in the output space.\nEmpirically, CD-CoT demonstrates an average improvement of 17.8% in accuracy\nover the base model and shows significantly stronger denoising capabilities\nthan baseline methods. The source code is publicly available at:\nhttps://github.com/tmlr-group/NoisyRationales.", "paper_summary_zh": "<paragraph>本文探討了大型語言模型 (LLM) 中一個未充分探討的挑戰：帶有雜訊論證的思考鏈提示，其中包括在用於情境中學習的範例中包含不相關或不準確的推理思考。我們構建了 NoRa 資料集，專門用於評估在存在雜訊論證的情況下推理的穩健性。我們在 NoRa 資料集上的發現揭示了當前 LLM 對這種雜訊普遍存在的脆弱性，現有的穩健方法（例如自我修正和自我一致性）顯示出有限的功效。值得注意的是，與使用乾淨論證進行提示相比，基礎 LLM 在有不相干想法的情況下準確度下降了 1.4%-19.8%，而在有錯誤想法的情況下則更大幅度地下降了 2.2%-40.4%。\n解決這個挑戰需要外部監督，這在實務上應該是可行的。在此，我們提出帶有雜訊思考鏈的對比式去雜訊方法 (CD-CoT)。它通過將雜訊論證與僅一個乾淨論證進行對比來增強 LLM 的去雜訊推理能力，這可能是去雜訊目的提示的最低要求。此方法遵循探索和利用的原則：(1) 在輸入空間中重新表述和選擇論證以實現明確的去雜訊，以及 (2) 探索不同的推理路徑並對輸出空間中的答案進行投票。根據經驗，CD-CoT 在準確度上比基礎模型平均提高了 17.8%，並且顯示出比基準方法更強大的去雜訊能力。原始碼公開於：\nhttps://github.com/tmlr-group/NoisyRationales。</paragraph>", "author": "Zhanke Zhou et.al.", "authors": "Zhanke Zhou, Rong Tao, Jianing Zhu, Yiwen Luo, Zengmao Wang, Bo Han", "id": "2410.23856v1", "paper_url": "http://arxiv.org/abs/2410.23856v1", "repo": "https://github.com/tmlr-group/noisyrationales"}}