{"2407.07342": {"publish_time": "2024-07-10", "title": "Multilingual Blending: LLM Safety Alignment Evaluation with Language Mixture", "paper_summary": "As safety remains a crucial concern throughout the development lifecycle of\nLarge Language Models (LLMs), researchers and industrial practitioners have\nincreasingly focused on safeguarding and aligning LLM behaviors with human\npreferences and ethical standards. LLMs, trained on extensive multilingual\ncorpora, exhibit powerful generalization abilities across diverse languages and\ndomains. However, current safety alignment practices predominantly focus on\nsingle-language scenarios, which leaves their effectiveness in complex\nmultilingual contexts, especially for those complex mixed-language formats,\nlargely unexplored. In this study, we introduce Multilingual Blending, a\nmixed-language query-response scheme designed to evaluate the safety alignment\nof various state-of-the-art LLMs (e.g., GPT-4o, GPT-3.5, Llama3) under\nsophisticated, multilingual conditions. We further investigate language\npatterns such as language availability, morphology, and language family that\ncould impact the effectiveness of Multilingual Blending in compromising the\nsafeguards of LLMs. Our experimental results show that, without meticulously\ncrafted prompt templates, Multilingual Blending significantly amplifies the\ndetriment of malicious queries, leading to dramatically increased bypass rates\nin LLM safety alignment (67.23% on GPT-3.5 and 40.34% on GPT-4o), far exceeding\nthose of single-language baselines. Moreover, the performance of Multilingual\nBlending varies notably based on intrinsic linguistic properties, with\nlanguages of different morphology and from diverse families being more prone to\nevading safety alignments. These findings underscore the necessity of\nevaluating LLMs and developing corresponding safety alignment strategies in a\ncomplex, multilingual context to align with their superior cross-language\ngeneralization capabilities.", "paper_summary_zh": "由於安全性在大型語言模型 (LLM) 的整個開發週期中仍然是一個至關重要的問題，因此研究人員和產業從業者越來越專注於保障和調整 LLM 行為，以符合人類偏好和道德標準。LLM 在廣泛的多語言語料庫上訓練，展現出跨越不同語言和領域的強大泛化能力。然而，目前的安全性調整實務主要專注於單一語言場景，這使得它們在複雜的多語言環境中，特別是那些複雜的混合語言格式中的有效性，在很大程度上仍未得到探討。在這項研究中，我們引入了多語言混合，這是一種混合語言查詢回應機制，旨在評估各種最先進的 LLM（例如 GPT-4o、GPT-3.5、Llama3）在複雜的多語言條件下的安全性調整。我們進一步研究了語言模式，例如語言可用性、形態和語言系，這些模式可能會影響多語言混合在破壞 LLM 保障措施方面的有效性。我們的實驗結果表明，在沒有精心製作的提示範本的情況下，多語言混合會顯著放大惡意查詢的損害，導致 LLM 安全性調整的繞過率大幅增加（GPT-3.5 上為 67.23%，GPT-4o 上為 40.34%），遠遠超過單一語言基線。此外，多語言混合的效能會根據內在語言特性而有顯著差異，不同形態和來自不同語言系的語言更容易規避安全性調整。這些發現強調了在複雜的多語言環境中評估 LLM 並制定相應的安全性調整策略的必要性，以符合它們卓越的跨語言泛化能力。", "author": "Jiayang Song et.al.", "authors": "Jiayang Song, Yuheng Huang, Zhehua Zhou, Lei Ma", "id": "2407.07342v1", "paper_url": "http://arxiv.org/abs/2407.07342v1", "repo": "null"}}