{"2409.16904": {"publish_time": "2024-09-25", "title": "Discriminative Anchor Learning for Efficient Multi-view Clustering", "paper_summary": "Multi-view clustering aims to study the complementary information across\nviews and discover the underlying structure. For solving the relatively high\ncomputational cost for the existing approaches, works based on anchor have been\npresented recently. Even with acceptable clustering performance, these methods\ntend to map the original representation from multiple views into a fixed shared\ngraph based on the original dataset. However, most studies ignore the\ndiscriminative property of the learned anchors, which ruin the representation\ncapability of the built model. Moreover, the complementary information among\nanchors across views is neglected to be ensured by simply learning the shared\nanchor graph without considering the quality of view-specific anchors. In this\npaper, we propose discriminative anchor learning for multi-view clustering\n(DALMC) for handling the above issues. We learn discriminative view-specific\nfeature representations according to the original dataset and build anchors\nfrom different views based on these representations, which increase the quality\nof the shared anchor graph. The discriminative feature learning and consensus\nanchor graph construction are integrated into a unified framework to improve\neach other for realizing the refinement. The optimal anchors from multiple\nviews and the consensus anchor graph are learned with the orthogonal\nconstraints. We give an iterative algorithm to deal with the formulated\nproblem. Extensive experiments on different datasets show the effectiveness and\nefficiency of our method compared with other methods.", "paper_summary_zh": "多視圖聚類旨在研究跨視圖的互補資訊並發現底層結構。為了解決現有方法相對較高的運算成本，最近提出了基於錨點的運算。即使具有可接受的聚類效能，這些方法傾向於根據原始資料集將來自多個視圖的原始表示映射到一個固定的共享圖形中。然而，大多數研究忽視了學習錨點的判別特性，這會破壞構建模型的表示能力。此外，僅通過學習共享錨點圖形而不考慮特定於視圖的錨點的品質，會忽略跨視圖錨點之間的互補資訊。在本文中，我們提出用於多視圖聚類的判別錨點學習 (DALMC) 來處理上述問題。我們根據原始資料集學習判別的特定於視圖的特徵表示，並根據這些表示從不同的視圖構建錨點，這會提高共享錨點圖形的品質。判別特徵學習和共識錨點圖形構建整合到一個統一的架構中，以相互改進以實現精煉。來自多個視圖的最佳錨點和共識錨點圖形在正交約束下學習。我們給出一個反覆運算演算法來處理公式化的問題。在不同資料集上的大量實驗顯示了我們的方法與其他方法相比的有效性和效率。", "author": "Yalan Qin et.al.", "authors": "Yalan Qin, Nan Pu, Hanzhou Wu, Nicu Sebe", "id": "2409.16904v1", "paper_url": "http://arxiv.org/abs/2409.16904v1", "repo": "null"}}