{"2409.01903": {"publish_time": "2024-09-03", "title": "A randomized simulation trial evaluating ABiMed, a clinical decision support system for medication reviews and polypharmacy management", "paper_summary": "Background: Medication review is a structured interview of the patient,\nperformed by the pharmacist and aimed at optimizing drug treatments. In\npractice, medication review is a long and cognitively-demanding task that\nrequires specific knowledge. Clinical practice guidelines have been proposed,\nbut their application is tedious. Methods: We designed ABiMed, a clinical\ndecision support system for medication reviews, based on the implementation of\nthe STOPP/START v2 guidelines and on the visual presentation of aggregated drug\nknowledge using tables, graphs and flower glyphs. We evaluated ABiMed with 39\ncommunity pharmacists during a randomized simulation trial, each pharmacist\nperforming a medication review for two fictitious patients without ABiMed, and\ntwo others with ABiMed. We recorded the problems identified by the pharmacists,\nthe interventions proposed, the response time, the perceived usability and the\ncomments. Pharmacists' medication reviews were compared to an expert-designed\ngold standard. Results: With ABiMed, pharmacists found 1.6 times more relevant\ndrug-related problems during the medication review (p=1.1e-12) and proposed\nbetter interventions (p=9.8e-9), without needing more time (p=0.56). The System\nUsability Scale score is 82.7, which is ranked \"excellent\". In their comments,\npharmacists appreciated the visual aspect of ABiMed and its ability to compare\nthe current treatment with the proposed one. A multifactor analysis showed no\ndifference in the support offered by ABiMed according to the pharmacist's age\nor sex, in terms of percentage of problems identified or quality of the\nproposed interventions. Conclusions: The use of an intelligent and visual\nclinical decision support system can help pharmacists when they perform\nmedication reviews. Our main perspective is the validation of the system in\nclinical conditions.", "paper_summary_zh": "<paragraph>背景：用藥審查是由藥師執行的一種結構化患者訪談，目的在於優化藥物治療。在實務上，用藥審查是一項冗長且認知需求高的任務，需要具備特定知識。雖然已提出臨床實務指引，但其應用很繁瑣。方法：我們根據 STOPP/START v2 指引的實作，並使用表格、圖表和花形符號視覺化呈現彙整的藥物知識，設計了一套用藥審查的臨床決策支援系統 ABiMed。我們在隨機模擬試驗中，讓 39 位社區藥師評估 ABiMed，每位藥師針對兩位虛構患者執行用藥審查，兩次沒有使用 ABiMed，兩次使用 ABiMed。我們記錄了藥師識別出的問題、建議的介入措施、反應時間、感知可用性和評論。將藥師的用藥審查與專家設計的金標準進行比較。結果：使用 ABiMed 後，藥師在用藥審查期間發現了多 1.6 倍相關的藥物相關問題（p=1.1e-12），並提出更好的介入措施（p=9.8e-9），而無需花費更多時間（p=0.56）。系統可用性評分為 82.7，被評為「優良」。在他們的評論中，藥師讚賞 ABiMed 的視覺化面向，以及它比較目前治療與建議治療的能力。多因素分析顯示，ABiMed 提供的支援在藥師的年齡或性別方面沒有差異，就識別出的問題百分比或建議介入措施的品質而言。結論：使用智慧且視覺化的臨床決策支援系統，可以協助藥師執行用藥審查。我們的觀點主要是驗證系統在臨床條件下的效度。</paragraph>", "author": "Abdelmalek Mouazer et.al.", "authors": "Abdelmalek Mouazer, Sophie Dubois, Romain Léguillon, Nada Boudegzdame, Thibaud Levrard, Yoann Le Bars, Christian Simon, Brigitte Séroussi, Julien Grosjean, Romain Lelong, Catherine Letord, Stéfan Darmoni, Karima Sedki, Pierre Meneton, Rosy Tsopra, Hector Falcoff, Jean-Baptiste Lamy", "id": "2409.01903v1", "paper_url": "http://arxiv.org/abs/2409.01903v1", "repo": "null"}}