{"2410.04814": {"publish_time": "2024-10-07", "title": "Learning Interpretable Hierarchical Dynamical Systems Models from Time Series Data", "paper_summary": "In science, we are often interested in obtaining a generative model of the\nunderlying system dynamics from observed time series. While powerful methods\nfor dynamical systems reconstruction (DSR) exist when data come from a single\ndomain, how to best integrate data from multiple dynamical regimes and leverage\nit for generalization is still an open question. This becomes particularly\nimportant when individual time series are short, and group-level information\nmay help to fill in for gaps in single-domain data. At the same time, averaging\nis not an option in DSR, as it will wipe out crucial dynamical properties\n(e.g., limit cycles in one domain vs. chaos in another). Hence, a framework is\nneeded that enables to efficiently harvest group-level (multi-domain)\ninformation while retaining all single-domain dynamical characteristics. Here\nwe provide such a hierarchical approach and showcase it on popular DSR\nbenchmarks, as well as on neuroscientific and medical time series. In addition\nto faithful reconstruction of all individual dynamical regimes, our\nunsupervised methodology discovers common low-dimensional feature spaces in\nwhich datasets with similar dynamics cluster. The features spanning these\nspaces were further dynamically highly interpretable, surprisingly in often\nlinear relation to control parameters that govern the dynamics of the\nunderlying system. Finally, we illustrate transfer learning and generalization\nto new parameter regimes.", "paper_summary_zh": "在科學中，我們常常有興趣從觀察到的時間序列中獲得基礎系統動態的生成模型。雖然當資料來自單一領域時，強大的動態系統重建 (DSR) 方法已經存在，但如何最佳整合來自多個動態機制的資料並利用它進行概括仍然是一個開放的問題。當個別時間序列很短時，這一點尤其重要，而且群組層級的資訊可能有助於填補單一領域資料中的空白。同時，平均化並非 DSR 中的選項，因為它會消除關鍵的動態特性（例如，一個領域中的極限週期相對於另一個領域中的混亂）。因此，需要一個框架，能夠有效收集群組層級（多領域）資訊，同時保留所有單一領域動態特性。在這裡，我們提供這種階層式方法，並在流行的 DSR 基準以及神經科學和醫學時間序列中展示它。除了忠實重建所有個別動態機制之外，我們的非監督方法還發現了常見的低維特徵空間，其中具有相似動態的資料集會成群。跨越這些空間的特徵在動態上進一步具有高度可解釋性，令人驚訝的是，它們通常與控制基礎系統動態的控制參數呈線性關係。最後，我們說明了遷移式學習和對新參數機制的概括。", "author": "Manuel Brenner et.al.", "authors": "Manuel Brenner, Elias Weber, Georgia Koppe, Daniel Durstewitz", "id": "2410.04814v1", "paper_url": "http://arxiv.org/abs/2410.04814v1", "repo": "null"}}