{"2412.08565": {"publish_time": "2024-12-11", "title": "GenPlan: Generative sequence models as adaptive planners", "paper_summary": "Offline reinforcement learning has shown tremendous success in behavioral\nplanning by learning from previously collected demonstrations. However,\ndecision-making in multitask missions still presents significant challenges.\nFor instance, a mission might require an agent to explore an unknown\nenvironment, discover goals, and navigate to them, even if it involves\ninteracting with obstacles along the way. Such behavioral planning problems are\ndifficult to solve due to: a) agents failing to adapt beyond the single task\nlearned through their reward function, and b) the inability to generalize to\nnew environments not covered in the training demonstrations, e.g., environments\nwhere all doors were unlocked in the demonstrations. Consequently,\nstate-of-the-art decision making methods are limited to missions where the\nrequired tasks are well-represented in the training demonstrations and can be\nsolved within a short (temporal) planning horizon. To address this, we propose\nGenPlan: a stochastic and adaptive planner that leverages discrete-flow models\nfor generative sequence modeling, enabling sample-efficient exploration and\nexploitation. This framework relies on an iterative denoising procedure to\ngenerate a sequence of goals and actions. This approach captures multi-modal\naction distributions and facilitates goal and task discovery, thereby enhancing\ngeneralization to out-of-distribution tasks and environments, i.e., missions\nnot part of the training data. We demonstrate the effectiveness of our method\nthrough multiple simulation environments. Notably, GenPlan outperforms the\nstate-of-the-art methods by over 10% on adaptive planning tasks, where the\nagent adapts to multi-task missions while leveraging demonstrations on\nsingle-goal-reaching tasks.", "paper_summary_zh": "<paragraph>離線強化學習已在行為規劃方面展現出巨大的成功，方法是從先前收集的示範中學習。然而，多任務任務中的決策制定仍帶來重大挑戰。例如，任務可能需要代理探索未知環境、發現目標並導航至目標，即使這涉及與沿途障礙物互動。此類行為規劃問題難以解決，原因有：a) 代理無法適應超出其獎勵函數所學到的單一任務，以及 b) 無法概括到訓練示範中未涵蓋的新環境，例如，在示範中所有門都已解鎖的環境。因此，最先進的決策制定方法僅限於訓練示範中充分呈現所需任務且可以在短（時間）規劃範圍內解決的任務。為了解決此問題，我們提出 GenPlan：一個隨機且自適應規劃器，它利用離散流模型進行生成序列建模，從而實現樣本有效探索和利用。此框架依賴於反覆的去噪程序，以產生目標和動作序列。此方法擷取多模態動作分佈，並促進目標和任務發現，從而增強對分布外任務和環境的概括，即，不屬於訓練數據的任務。我們透過多個模擬環境展示了我們方法的有效性。值得注意的是，在自適應規劃任務上，GenPlan 的表現優於最先進的方法超過 10%，其中代理適應多任務任務，同時利用單一目標到達任務的示範。</paragraph>", "author": "Akash Karthikeyan et.al.", "authors": "Akash Karthikeyan, Yash Vardhan Pant", "id": "2412.08565v1", "paper_url": "http://arxiv.org/abs/2412.08565v1", "repo": "null"}}