{"2409.04009": {"publish_time": "2024-09-06", "title": "Large Margin Prototypical Network for Few-shot Relation Classification with Fine-grained Features", "paper_summary": "Relation classification (RC) plays a pivotal role in both natural language\nunderstanding and knowledge graph completion. It is generally formulated as a\ntask to recognize the relationship between two entities of interest appearing\nin a free-text sentence. Conventional approaches on RC, regardless of feature\nengineering or deep learning based, can obtain promising performance on\ncategorizing common types of relation leaving a large proportion of\nunrecognizable long-tail relations due to insufficient labeled instances for\ntraining. In this paper, we consider few-shot learning is of great practical\nsignificance to RC and thus improve a modern framework of metric learning for\nfew-shot RC. Specifically, we adopt the large-margin ProtoNet with fine-grained\nfeatures, expecting they can generalize well on long-tail relations. Extensive\nexperiments were conducted by FewRel, a large-scale supervised few-shot RC\ndataset, to evaluate our framework: LM-ProtoNet (FGF). The results demonstrate\nthat it can achieve substantial improvements over many baseline approaches.", "paper_summary_zh": "關係分類 (RC) 在自然語言理解和知識圖譜完成中扮演著關鍵角色。它通常被表述為一個任務，用於辨識出現在自由文字句子中的兩個感興趣實體之間的關係。無論是基於特徵工程還是深度學習的傳統 RC 方法，都可以對常見的關係類型進行分類，從而獲得有希望的效能，但由於訓練標籤實例不足，因此無法辨識出大量的長尾關係。在本文中，我們認為少樣本學習對 RC 具有重要的實用意義，因此改進了度量學習的現代框架，以進行少樣本 RC。具體來說，我們採用具有細粒度特徵的大邊距 ProtoNet，期望它們能在長尾關係上很好地概括。我們使用大型監督少樣本 RC 資料集 FewRel 進行了廣泛的實驗，以評估我們的框架：LM-ProtoNet (FGF)。結果表明，它可以比許多基線方法獲得顯著改進。", "author": "Miao Fan et.al.", "authors": "Miao Fan, Yeqi Bai, Mingming Sun, Ping Li", "id": "2409.04009v1", "paper_url": "http://arxiv.org/abs/2409.04009v1", "repo": "null"}}