{"2408.11788": {"publish_time": "2024-08-21", "title": "DreamFactory: Pioneering Multi-Scene Long Video Generation with a Multi-Agent Framework", "paper_summary": "Current video generation models excel at creating short, realistic clips, but\nstruggle with longer, multi-scene videos. We introduce \\texttt{DreamFactory},\nan LLM-based framework that tackles this challenge. \\texttt{DreamFactory}\nleverages multi-agent collaboration principles and a Key Frames Iteration\nDesign Method to ensure consistency and style across long videos. It utilizes\nChain of Thought (COT) to address uncertainties inherent in large language\nmodels. \\texttt{DreamFactory} generates long, stylistically coherent, and\ncomplex videos. Evaluating these long-form videos presents a challenge. We\npropose novel metrics such as Cross-Scene Face Distance Score and Cross-Scene\nStyle Consistency Score. To further research in this area, we contribute the\nMulti-Scene Videos Dataset containing over 150 human-rated videos.", "paper_summary_zh": "當前的影片生成模型擅長於製作短而逼真的片段，但對於較長的多場景影片則有困難。我們介紹了 \\texttt{DreamFactory}，一個基於 LLM 的架構，用於應對此挑戰。\\texttt{DreamFactory} 利用多重代理協作原則和關鍵影格迭代設計方法，以確保長影片中的一致性和風格。它利用思考鏈 (COT) 來解決大型語言模型中固有的不確定性。\\texttt{DreamFactory} 會產生長、風格一致且複雜的影片。評估這些長篇影片是一個挑戰。我們提出了新的指標，例如跨場景人臉距離分數和跨場景風格一致性分數。為了進一步研究這個領域，我們提供了包含超過 150 個由人類評分的影片的多場景影片資料集。", "author": "Zhifei Xie et.al.", "authors": "Zhifei Xie, Daniel Tang, Dingwei Tan, Jacques Klein, Tegawend F. Bissyand, Saad Ezzini", "id": "2408.11788v1", "paper_url": "http://arxiv.org/abs/2408.11788v1", "repo": "null"}}