{"2502.15040": {"publish_time": "2025-02-20", "title": "Reducing Hallucinations of Medical Multimodal Large Language Models with Visual Retrieval-Augmented Generation", "paper_summary": "Multimodal Large Language Models (MLLMs) have shown impressive performance in\nvision and text tasks. However, hallucination remains a major challenge,\nespecially in fields like healthcare where details are critical. In this work,\nwe show how MLLMs may be enhanced to support Visual RAG (V-RAG), a\nretrieval-augmented generation framework that incorporates both text and visual\ndata from retrieved images. On the MIMIC-CXR chest X-ray report generation and\nMulticare medical image caption generation datasets, we show that Visual RAG\nimproves the accuracy of entity probing, which asks whether a medical entities\nis grounded by an image. We show that the improvements extend both to frequent\nand rare entities, the latter of which may have less positive training data.\nDownstream, we apply V-RAG with entity probing to correct hallucinations and\ngenerate more clinically accurate X-ray reports, obtaining a higher RadGraph-F1\nscore.", "paper_summary_zh": "多模態大型語言模型 (MLLM) 在視覺和文字任務中展現出令人印象深刻的表現。然而，幻覺仍然是一項重大的挑戰，特別是在醫療保健等細節至關重要的領域。在這項工作中，我們展示 MLLM 如何增強以支援視覺 RAG (V-RAG)，這是一種檢索增強生成架構，它結合了檢索影像中的文字和視覺資料。在 MIMIC-CXR 胸部 X 光報告生成和 Multicare 醫學影像標題生成資料集上，我們展示視覺 RAG 提升了實體探查的準確性，這會詢問醫學實體是否由影像為基礎。我們展示這些改進同時擴展到頻繁和罕見的實體，後者可能具有較少的正面訓練資料。下游中，我們將 V-RAG 與實體探查應用於修正幻覺並生成更具臨床準確性的 X 光報告，取得較高的 RadGraph-F1 分數。", "author": "Yun-Wei Chu et.al.", "authors": "Yun-Wei Chu, Kai Zhang, Christopher Malon, Martin Renqiang Min", "id": "2502.15040v1", "paper_url": "http://arxiv.org/abs/2502.15040v1", "repo": "null"}}