{"2502.03283": {"publish_time": "2025-02-05", "title": "SymAgent: A Neural-Symbolic Self-Learning Agent Framework for Complex Reasoning over Knowledge Graphs", "paper_summary": "Recent advancements have highlighted that Large Language Models (LLMs) are\nprone to hallucinations when solving complex reasoning problems, leading to\nerroneous results. To tackle this issue, researchers incorporate Knowledge\nGraphs (KGs) to improve the reasoning ability of LLMs. However, existing\nmethods face two limitations: 1) they typically assume that all answers to the\nquestions are contained in KGs, neglecting the incompleteness issue of KGs, and\n2) they treat the KG as a static repository and overlook the implicit logical\nreasoning structures inherent in KGs. In this paper, we introduce SymAgent, an\ninnovative neural-symbolic agent framework that achieves collaborative\naugmentation between KGs and LLMs. We conceptualize KGs as dynamic environments\nand transform complex reasoning tasks into a multi-step interactive process,\nenabling KGs to participate deeply in the reasoning process. SymAgent consists\nof two modules: Agent-Planner and Agent-Executor. The Agent-Planner leverages\nLLM's inductive reasoning capability to extract symbolic rules from KGs,\nguiding efficient question decomposition. The Agent-Executor autonomously\ninvokes predefined action tools to integrate information from KGs and external\ndocuments, addressing the issues of KG incompleteness. Furthermore, we design a\nself-learning framework comprising online exploration and offline iterative\npolicy updating phases, enabling the agent to automatically synthesize\nreasoning trajectories and improve performance. Experimental results\ndemonstrate that SymAgent with weak LLM backbones (i.e., 7B series) yields\nbetter or comparable performance compared to various strong baselines. Further\nanalysis reveals that our agent can identify missing triples, facilitating\nautomatic KG updates.", "paper_summary_zh": "<paragraph>最近的進展強調出，大型語言模型 (LLM) 在解決複雜推理問題時容易出現幻覺，導致錯誤的結果。為了解決這個問題，研究人員結合知識圖譜 (KG) 來改善 LLM 的推理能力。然而，現有方法面臨兩個限制：1) 它們通常假設問題的所有答案都包含在 KG 中，忽略了 KG 的不完整性問題，以及 2) 它們將 KG 視為一個靜態儲存庫，而忽略了 KG 中固有的隱式邏輯推理結構。在本文中，我們介紹了 SymAgent，一個創新的神經符號代理架構，它在 KG 和 LLM 之間實現了協作擴充。我們將 KG 概念化為動態環境，並將複雜的推理任務轉化為一個多步驟的互動過程，使 KG 能夠深入參與推理過程。SymAgent 包含兩個模組：代理規劃器和代理執行器。代理規劃器利用 LLM 的歸納推理能力從 KG 中提取符號規則，指導有效的問題分解。代理執行器自主地調用預定義的動作工具來整合來自 KG 和外部文件的資訊，解決 KG 不完整性的問題。此外，我們設計了一個自學習框架，包括線上探索和離線反覆的政策更新階段，使代理能夠自動合成推理軌跡並改善效能。實驗結果表明，具有弱 LLM 主幹的 SymAgent（例如，7B 系列）與各種強大的基線相比，產生了更好或相當的效能。進一步的分析表明，我們的代理可以識別遺失的三元組，促進自動 KG 更新。</paragraph>", "author": "Ben Liu et.al.", "authors": "Ben Liu, Jihai Zhang, Fangquan Lin, Cheng Yang, Min Peng, Wotao Yin", "id": "2502.03283v2", "paper_url": "http://arxiv.org/abs/2502.03283v2", "repo": "null"}}