{"2412.10104": {"publish_time": "2024-12-13", "title": "RETQA: A Large-Scale Open-Domain Tabular Question Answering Dataset for Real Estate Sector", "paper_summary": "The real estate market relies heavily on structured data, such as property\ndetails, market trends, and price fluctuations. However, the lack of\nspecialized Tabular Question Answering datasets in this domain limits the\ndevelopment of automated question-answering systems. To fill this gap, we\nintroduce RETQA, the first large-scale open-domain Chinese Tabular Question\nAnswering dataset for Real Estate. RETQA comprises 4,932 tables and 20,762\nquestion-answer pairs across 16 sub-fields within three major domains: property\ninformation, real estate company finance information and land auction\ninformation. Compared with existing tabular question answering datasets, RETQA\nposes greater challenges due to three key factors: long-table structures,\nopen-domain retrieval, and multi-domain queries. To tackle these challenges, we\npropose the SLUTQA framework, which integrates large language models with\nspoken language understanding tasks to enhance retrieval and answering\naccuracy. Extensive experiments demonstrate that SLUTQA significantly improves\nthe performance of large language models on RETQA by in-context learning. RETQA\nand SLUTQA provide essential resources for advancing tabular question answering\nresearch in the real estate domain, addressing critical challenges in\nopen-domain and long-table question-answering. The dataset and code are\npublicly available at \\url{https://github.com/jensen-w/RETQA}.", "paper_summary_zh": "房地產市場極度依賴結構化資料，例如地產明細、市場趨勢和價格波動。然而，此領域缺乏專業的表格問答資料集，限制了自動化問答系統的發展。為了填補此缺口，我們引進 RETQA，這是第一個針對房地產的大規模開放領域中文表格問答資料集。RETQA 包含 4,932 個表格和 20,762 個問答組，涵蓋三個主要領域內的 16 個子領域：地產資訊、房地產公司財務資訊和土地拍賣資訊。與現有的表格問答資料集相比，RETQA 由於三個關鍵因素而帶來更大的挑戰：長表格結構、開放領域擷取和多領域查詢。為了應對這些挑戰，我們提出了 SLUTQA 框架，它將大型語言模型與口語理解任務整合在一起，以增強擷取和回答的準確性。廣泛的實驗證明，SLUTQA 透過情境學習，大幅提升大型語言模型在 RETQA 上的效能。RETQA 和 SLUTQA 提供了必要的資源，用於推進房地產領域的表格問答研究，解決開放領域和長表格問答中的關鍵挑戰。資料集和程式碼已公開於 \\url{https://github.com/jensen-w/RETQA}。", "author": "Zhensheng Wang et.al.", "authors": "Zhensheng Wang, Wenmian Yang, Kun Zhou, Yiquan Zhang, Weijia Jia", "id": "2412.10104v1", "paper_url": "http://arxiv.org/abs/2412.10104v1", "repo": "https://github.com/jensen-w/retqa"}}