{"2409.20187": {"publish_time": "2024-09-30", "title": "Choosing DAG Models Using Markov and Minimal Edge Count in the Absence of Ground Truth", "paper_summary": "We give a novel nonparametric pointwise consistent statistical test (the\nMarkov Checker) of the Markov condition for directed acyclic graph (DAG) or\ncompleted partially directed acyclic graph (CPDAG) models given a dataset. We\nalso introduce the Cross-Algorithm Frugality Search (CAFS) for rejecting DAG\nmodels that either do not pass the Markov Checker test or that are not edge\nminimal. Edge minimality has been used previously by Raskutti and Uhler as a\nnonparametric simplicity criterion, though CAFS readily generalizes to other\nsimplicity conditions. Reference to the ground truth is not necessary for CAFS,\nso it is useful for finding causal structure learning algorithms and tuning\nparameter settings that output causal models that are approximately true from a\ngiven data set. We provide a software tool for this analysis that is suitable\nfor even quite large or dense models, provided a suitably fast pointwise\nconsistent test of conditional independence is available. In addition, we show\nin simulation that the CAFS procedure can pick approximately correct models\nwithout knowing the ground truth.", "paper_summary_zh": "我們提供了一個新穎的非參數點態一致性統計檢定（馬可夫檢驗器），用於有向非循環圖（DAG）或已完成的部分有向非循環圖（CPDAG）模型的馬可夫條件，給定一個資料集。我們還引入了交叉演算法節儉搜尋（CAFS），用於拒絕未通過馬可夫檢驗器檢定或邊緣非最小的 DAG 模型。邊緣最少性先前已被 Raskutti 和 Uhler 用作非參數簡潔性準則，儘管 CAFS 很容易概括到其他簡潔性條件。CAFS 不需要參考真實情況，因此對於尋找因果結構學習演算法和調整參數設定很有用，這些參數設定會從給定的資料集輸出近似真實的因果模型。我們提供了一個適用於相當大或密集模型的軟體工具，只要有適當的條件獨立點態一致性檢定可用即可。此外，我們在模擬中顯示，CAFS 程序可以在不知道真實情況下挑選近似正確的模型。", "author": "Joseph D. Ramsey et.al.", "authors": "Joseph D. Ramsey, Bryan Andrews, Peter Spirtes", "id": "2409.20187v1", "paper_url": "http://arxiv.org/abs/2409.20187v1", "repo": "null"}}