{"2408.10760": {"publish_time": "2024-08-20", "title": "SAM-COD: SAM-guided Unified Framework for Weakly-Supervised Camouflaged Object Detection", "paper_summary": "Most Camouflaged Object Detection (COD) methods heavily rely on mask\nannotations, which are time-consuming and labor-intensive to acquire. Existing\nweakly-supervised COD approaches exhibit significantly inferior performance\ncompared to fully-supervised methods and struggle to simultaneously support all\nthe existing types of camouflaged object labels, including scribbles, bounding\nboxes, and points. Even for Segment Anything Model (SAM), it is still\nproblematic to handle the weakly-supervised COD and it typically encounters\nchallenges of prompt compatibility of the scribble labels, extreme response,\nsemantically erroneous response, and unstable feature representations,\nproducing unsatisfactory results in camouflaged scenes. To mitigate these\nissues, we propose a unified COD framework in this paper, termed SAM-COD, which\nis capable of supporting arbitrary weakly-supervised labels. Our SAM-COD\nemploys a prompt adapter to handle scribbles as prompts based on SAM.\nMeanwhile, we introduce response filter and semantic matcher modules to improve\nthe quality of the masks obtained by SAM under COD prompts. To alleviate the\nnegative impacts of inaccurate mask predictions, a new strategy of\nprompt-adaptive knowledge distillation is utilized to ensure a reliable feature\nrepresentation. To validate the effectiveness of our approach, we have\nconducted extensive empirical experiments on three mainstream COD benchmarks.\nThe results demonstrate the superiority of our method against state-of-the-art\nweakly-supervised and even fully-supervised methods.", "paper_summary_zh": "大多數偽裝目標檢測 (COD) 方法都高度依賴於遮罩註解，而這些註解的取得耗時且費力。現有的弱監督 COD 方法與完全監督方法相比，表現明顯較差，且難以同時支援所有現有的偽裝目標標籤類型，包括塗鴉、邊界框和點。即使對於 Segment Anything Model (SAM)，處理弱監督 COD 仍然存在問題，且通常會遇到塗鴉標籤提示相容性、極端回應、語義錯誤回應和不穩定的特徵表示等挑戰，導致在偽裝場景中產生不令人滿意的結果。為了減輕這些問題，我們在本文中提出一個統一的 COD 框架，稱為 SAM-COD，它能夠支援任意弱監督標籤。我們的 SAM-COD 使用提示適配器來處理基於 SAM 的塗鴉提示。同時，我們引入了回應過濾器和語義比對器模組，以提高 SAM 在 COD 提示下取得的遮罩品質。為了減輕不準確遮罩預測的負面影響，我們利用一種新的提示適應式知識提煉策略來確保可靠的特徵表示。為了驗證我們方法的有效性，我們在三個主流 COD 基準上進行了廣泛的實證實驗。結果證明了我們的方法優於最先進的弱監督甚至完全監督方法。", "author": "Huafeng Chen et.al.", "authors": "Huafeng Chen, Pengxu Wei, Guangqian Guo, Shan Gao", "id": "2408.10760v1", "paper_url": "http://arxiv.org/abs/2408.10760v1", "repo": "null"}}