{"2412.17323": {"publish_time": "2024-12-23", "title": "xPatch: Dual-Stream Time Series Forecasting with Exponential Seasonal-Trend Decomposition", "paper_summary": "In recent years, the application of transformer-based models in time-series\nforecasting has received significant attention. While often demonstrating\npromising results, the transformer architecture encounters challenges in fully\nexploiting the temporal relations within time series data due to its attention\nmechanism. In this work, we design eXponential Patch (xPatch for short), a\nnovel dual-stream architecture that utilizes exponential decomposition.\nInspired by the classical exponential smoothing approaches, xPatch introduces\nthe innovative seasonal-trend exponential decomposition module. Additionally,\nwe propose a dual-flow architecture that consists of an MLP-based linear stream\nand a CNN-based non-linear stream. This model investigates the benefits of\nemploying patching and channel-independence techniques within a non-transformer\nmodel. Finally, we develop a robust arctangent loss function and a sigmoid\nlearning rate adjustment scheme, which prevent overfitting and boost\nforecasting performance. The code is available at the following repository:\nhttps://github.com/stitsyuk/xPatch.", "paper_summary_zh": "近年來，基於 Transformer 的模型在時間序列預測中的應用備受關注。儘管通常展示出有希望的結果，但 Transformer 架構在充分利用時間序列資料中的時間關係方面遇到了挑戰，這是因為它的注意力機制。在這項工作中，我們設計了指數貼片（簡稱 xPatch），一種利用指數分解的新型雙流架構。受經典指數平滑方法的啟發，xPatch 引入了創新的季節趨勢指數分解模組。此外，我們提出了一種雙流架構，它包含一個基於 MLP 的線性流和一個基於 CNN 的非線性流。這個模型探討了在非 Transformer 模型中採用貼片和通道獨立技術的好處。最後，我們開發了一個穩健的反正切損失函數和一個 sigmoid 學習率調整方案，它們可以防止過度擬合並提升預測性能。程式碼可在以下儲存庫中取得：https://github.com/stitsyuk/xPatch。", "author": "Artyom Stitsyuk et.al.", "authors": "Artyom Stitsyuk, Jaesik Choi", "id": "2412.17323v1", "paper_url": "http://arxiv.org/abs/2412.17323v1", "repo": "https://github.com/stitsyuk/xpatch"}}