{"2408.02978": {"publish_time": "2024-08-06", "title": "ASR-enhanced Multimodal Representation Learning for Cross-Domain Product Retrieval", "paper_summary": "E-commerce is increasingly multimedia-enriched, with products exhibited in a\nbroad-domain manner as images, short videos, or live stream promotions. A\nunified and vectorized cross-domain production representation is essential. Due\nto large intra-product variance and high inter-product similarity in the\nbroad-domain scenario, a visual-only representation is inadequate. While\nAutomatic Speech Recognition (ASR) text derived from the short or live-stream\nvideos is readily accessible, how to de-noise the excessively noisy text for\nmultimodal representation learning is mostly untouched. We propose ASR-enhanced\nMultimodal Product Representation Learning (AMPere). In order to extract\nproduct-specific information from the raw ASR text, AMPere uses an\neasy-to-implement LLM-based ASR text summarizer. The LLM-summarized text,\ntogether with visual data, is then fed into a multi-branch network to generate\ncompact multimodal embeddings. Extensive experiments on a large-scale\ntri-domain dataset verify the effectiveness of AMPere in obtaining a unified\nmultimodal product representation that clearly improves cross-domain product\nretrieval.", "paper_summary_zh": "電子商務日益豐富多媒體，產品以影像、短片或直播促銷等廣域方式展示。統一且向量化的跨域製作表示至關重要。由於廣域場景中產品內部差異大，產品間相似性高，僅視覺表示是不夠的。雖然可以輕易取得短片或直播影片的自動語音辨識 (ASR) 文字，但如何為多模態表示學習去雜訊化過度雜訊的文字，大多數仍未觸及。我們提出 ASR 增強的多模態產品表示學習 (AMPere)。為了從原始 ASR 文字中萃取產品特定資訊，AMPere 使用容易實作的 LLM-based ASR 文字摘要器。LLM 摘要的文字與視覺資料一起，接著輸入多分支網路，產生緊湊的多模態嵌入。在大型三域資料集上進行廣泛的實驗，驗證了 AMPere 在取得統一的多模態產品表示上的效能，明顯改善了跨域產品檢索。", "author": "Ruixiang Zhao et.al.", "authors": "Ruixiang Zhao, Jian Jia, Yan Li, Xuehan Bai, Quan Chen, Han Li, Peng Jiang, Xirong Li", "id": "2408.02978v1", "paper_url": "http://arxiv.org/abs/2408.02978v1", "repo": "null"}}