{"2404.18981": {"publish_time": "2024-04-29", "title": "Decoding Radiologists' Intentions: A Novel System for Accurate Region Identification in Chest X-ray Image Analysis", "paper_summary": "In the realm of chest X-ray (CXR) image analysis, radiologists meticulously\nexamine various regions, documenting their observations in reports. The\nprevalence of errors in CXR diagnoses, particularly among inexperienced\nradiologists and hospital residents, underscores the importance of\nunderstanding radiologists' intentions and the corresponding regions of\ninterest. This understanding is crucial for correcting mistakes by guiding\nradiologists to the accurate regions of interest, especially in the diagnosis\nof chest radiograph abnormalities. In response to this imperative, we propose a\nnovel system designed to identify the primary intentions articulated by\nradiologists in their reports and the corresponding regions of interest in CXR\nimages. This system seeks to elucidate the visual context underlying\nradiologists' textual findings, with the potential to rectify errors made by\nless experienced practitioners and direct them to precise regions of interest.\nImportantly, the proposed system can be instrumental in providing constructive\nfeedback to inexperienced radiologists or junior residents in the hospital,\nbridging the gap in face-to-face communication. The system represents a\nvaluable tool for enhancing diagnostic accuracy and fostering continuous\nlearning within the medical community.", "paper_summary_zh": "在胸部 X 光 (CXR) 影像分析領域，放射科醫師會仔細檢查各區域，並將觀察結果記錄在報告中。CXR 診斷錯誤的盛行率，特別是在經驗不足的放射科醫師和醫院住院醫師中，凸顯了了解放射科醫師意圖和對應關注區域的重要性。這種理解對於糾正錯誤至關重要，可引導放射科醫師關注準確的區域，特別是在胸部 X 光異常診斷中。為了回應這項當務之急，我們提出一個新系統，旨在識別放射科醫師在報告中表達的主要意圖和 CXR 影像中對應的關注區域。此系統旨在闡明放射科醫師文字發現背後的視覺脈絡，並有可能糾正經驗較少的從業人員所犯的錯誤，並引導他們關注精確的區域。重要的是，所提出的系統可以作為提供建設性回饋給經驗不足的放射科醫師或醫院初級住院醫師的工具，彌補面對面溝通的差距。該系統代表了一種有價值的工具，可用於提高診斷準確性，並在醫學界內促進持續學習。", "author": "Akash Awasthi et.al.", "authors": "Akash Awasthi, Safwan Ahmad, Bryant Le, Hien Van Nguyen", "id": "2404.18981v1", "paper_url": "http://arxiv.org/abs/2404.18981v1", "repo": "null"}}