{"2410.08948": {"publish_time": "2024-10-11", "title": "The Dynamics of Social Conventions in LLM populations: Spontaneous Emergence, Collective Biases and Tipping Points", "paper_summary": "Social conventions are the foundation for social and economic life. As\nlegions of AI agents increasingly interact with each other and with humans,\ntheir ability to form shared conventions will determine how effectively they\nwill coordinate behaviors, integrate into society and influence it. Here, we\ninvestigate the dynamics of conventions within populations of Large Language\nModel (LLM) agents using simulated interactions. First, we show that globally\naccepted social conventions can spontaneously arise from local interactions\nbetween communicating LLMs. Second, we demonstrate how strong collective biases\ncan emerge during this process, even when individual agents appear to be\nunbiased. Third, we examine how minority groups of committed LLMs can drive\nsocial change by establishing new social conventions. We show that once these\nminority groups reach a critical size, they can consistently overturn\nestablished behaviors. In all cases, contrasting the experimental results with\npredictions from a minimal multi-agent model allows us to isolate the specific\nrole of LLM agents. Our results clarify how AI systems can autonomously develop\nnorms without explicit programming and have implications for designing AI\nsystems that align with human values and societal goals.", "paper_summary_zh": "社會規範是社會和經濟生活的基礎。隨著大軍的人工智慧代理人越來越頻繁地彼此互動，以及與人類互動，他們形成共同規範的能力將決定他們協調行為、融入社會並影響社會的有效程度。在這裡，我們使用模擬互動來探討大型語言模型 (LLM) 代理人族群內部規範的動態。首先，我們證明全球接受的社會規範可以自發地從溝通 LLM 之間的本地互動中產生。其次，我們證明了強烈的集體偏見如何在這個過程中出現，即使個別代理人看起來沒有偏見。第三，我們探討了少數群體的忠誠 LLM 如何透過建立新的社會規範來推動社會變革。我們證明，一旦這些少數群體達到臨界規模，他們就能持續推翻既定的行為。在所有情況下，將實驗結果與最小多代理模型的預測進行對比，使我們能夠孤立 LLM 代理人的特定角色。我們的結果闡明了人工智慧系統如何在沒有明確程式設計的情況下自主發展規範，並對設計符合人類價值觀和社會目標的人工智慧系統產生影響。", "author": "Ariel Flint Ashery et.al.", "authors": "Ariel Flint Ashery, Luca Maria Aiello, Andrea Baronchelli", "id": "2410.08948v1", "paper_url": "http://arxiv.org/abs/2410.08948v1", "repo": "null"}}