{"2405.18405": {"publish_time": "2024-05-28", "title": "WIDIn: Wording Image for Domain-Invariant Representation in Single-Source Domain Generalization", "paper_summary": "Language has been useful in extending the vision encoder to data from diverse\ndistributions without empirical discovery in training domains. However, as the\nimage description is mostly at coarse-grained level and ignores visual details,\nthe resulted embeddings are still ineffective in overcoming complexity of\ndomains at inference time. We present a self-supervision framework WIDIn,\nWording Images for Domain-Invariant representation, to disentangle\ndiscriminative visual representation, by only leveraging data in a single\ndomain and without any test prior. Specifically, for each image, we first\nestimate the language embedding with fine-grained alignment, which can be\nconsequently used to adaptively identify and then remove domain-specific\ncounterpart from the raw visual embedding. WIDIn can be applied to both\npretrained vision-language models like CLIP, and separately trained uni-modal\nmodels like MoCo and BERT. Experimental studies on three domain generalization\ndatasets demonstrate the effectiveness of our approach.", "paper_summary_zh": "語言在將視覺編碼器擴展到來自不同分佈的資料中，而無需在訓練領域中進行經驗發現方面很有用。然而，由於影像描述大多處於粗略的層級，且忽略了視覺細節，因此產生的嵌入式仍然無法有效克服推理時間中領域的複雜性。我們提出了一個自我監督架構 WIDIn，用於領域不變表示的文字影像，以僅利用單一領域中的資料，且無任何先驗測試來解開歧視性視覺表示。具體來說，對於每個影像，我們首先使用細粒度對齊來估計語言嵌入式，然後可以使用它來自適應性地識別並從原始視覺嵌入式中移除特定於領域的對應部分。WIDIn 可以應用於預先訓練好的視覺語言模型（例如 CLIP）和單獨訓練的單一模式模型（例如 MoCo 和 BERT）。在三個領域概化資料集上的實驗研究證明了我們方法的有效性。", "author": "Jiawei Ma et.al.", "authors": "Jiawei Ma, Yulei Niu, Shiyuan Huang, Guangxing Han, Shih-Fu Chang", "id": "2405.18405v1", "paper_url": "http://arxiv.org/abs/2405.18405v1", "repo": "null"}}