{"2406.12585": {"publish_time": "2024-06-18", "title": "Breaking the Ceiling of the LLM Community by Treating Token Generation as a Classification for Ensembling", "paper_summary": "Ensembling multiple models has always been an effective approach to push the\nlimits of existing performance and is widely used in classification tasks by\nsimply averaging the classification probability vectors from multiple\nclassifiers to achieve better accuracy. However, in the thriving open-source\nLarge Language Model (LLM) community, ensembling methods are rare and typically\nlimited to ensembling the full-text outputs of LLMs, such as selecting the best\noutput using a ranker, which leads to underutilization of token-level\nprobability information. In this paper, we treat the Generation of each token\nby LLMs as a Classification (GaC) for ensembling. This approach fully exploits\nthe probability information at each generation step and better prevents LLMs\nfrom producing early incorrect tokens that lead to snowballing errors. In\nexperiments, we ensemble state-of-the-art LLMs on several benchmarks, including\nexams, mathematics and reasoning, and observe that our method breaks the\nexisting community performance ceiling. Furthermore, we observed that most of\nthe tokens in the answer are simple and do not affect the correctness of the\nfinal answer. Therefore, we also experimented with ensembling only key tokens,\nand the results showed better performance with lower latency across benchmarks.", "paper_summary_zh": "整合多個模型一直是推動現有效能極限的有效方法，並廣泛用於分類任務中，只需平均多個分類器的分類機率向量即可獲得更好的準確度。然而，在蓬勃發展的開源大型語言模型 (LLM) 社群中，整合方法很少見，而且通常僅限於整合 LLM 的全文輸出，例如使用排名器選擇最佳輸出，這導致無法充分利用代幣級別的機率資訊。在本文中，我們將 LLM 產生的每個代幣視為分類 (GaC) 以進行整合。此方法充分利用每個產生步驟中的機率資訊，並能更好地防止 LLM 產生導致錯誤累積的早期錯誤代幣。在實驗中，我們在幾個基準上整合了最先進的 LLM，包括考試、數學和推理，並觀察到我們的方法打破了現有社群效能上限。此外，我們觀察到答案中的大多數代幣都很簡單，不會影響最終答案的正確性。因此，我們也嘗試僅整合關鍵代幣，結果顯示在所有基準上效能更好，且延遲時間更低。", "author": "Yao-Ching Yu et.al.", "authors": "Yao-Ching Yu, Chun-Chih Kuo, Ziqi Ye, Yu-Cheng Chang, Yueh-Se Li", "id": "2406.12585v1", "paper_url": "http://arxiv.org/abs/2406.12585v1", "repo": "https://github.com/yaoching0/gac"}}