{"2501.14644": {"publish_time": "2025-01-24", "title": "Whisper D-SGD: Correlated Noise Across Agents for Differentially Private Decentralized Learning", "paper_summary": "Decentralized learning enables distributed agents to train a shared machine\nlearning model through local computation and peer-to-peer communication.\nAlthough each agent retains its dataset locally, the communication of local\nmodels can still expose private information to adversaries. To mitigate these\nthreats, local differential privacy (LDP) injects independent noise per agent,\nbut it suffers a larger utility gap than central differential privacy (CDP). We\nintroduce Whisper D-SGD, a novel covariance-based approach that generates\ncorrelated privacy noise across agents, unifying several state-of-the-art\nmethods as special cases. By leveraging network topology and mixing weights,\nWhisper D-SGD optimizes the noise covariance to achieve network-wide noise\ncancellation. Experimental results show that Whisper D-SGD cancels more noise\nthan existing pairwise-correlation schemes, substantially narrowing the CDP-LDP\ngap and improving model performance under the same privacy guarantees.", "paper_summary_zh": "分散式學習使分散式代理能夠透過本地運算和點對點通訊訓練共享機器學習模型。儘管每個代理在本地保留其資料集，但本地模型的通訊仍可能向對手揭露私人資訊。為了減輕這些威脅，本地差異隱私 (LDP) 會針對每個代理注入獨立雜訊，但它會造成比中央差異隱私 (CDP) 更大的效用差距。我們引入了 Whisper D-SGD，一種新的基於協方差的方法，它會產生代理之間相關的隱私雜訊，將數種最先進的方法統一為特例。透過利用網路拓撲和混合權重，Whisper D-SGD 會最佳化雜訊協方差，以達成網路範圍的雜訊消除。實驗結果顯示，Whisper D-SGD 消除了比現有的成對相關性方案更多的雜訊，大幅縮小了 CDP-LDP 差距，並在相同的隱私保證下提升了模型效能。", "author": "Angelo Rodio et.al.", "authors": "Angelo Rodio, Zheng Chen, Erik G. Larsson", "id": "2501.14644v1", "paper_url": "http://arxiv.org/abs/2501.14644v1", "repo": "https://github.com/arodio/whisperdsgd"}}