{"2411.12473": {"publish_time": "2024-11-19", "title": "NMT-Obfuscator Attack: Ignore a sentence in translation with only one word", "paper_summary": "Neural Machine Translation systems are used in diverse applications due to\ntheir impressive performance. However, recent studies have shown that these\nsystems are vulnerable to carefully crafted small perturbations to their\ninputs, known as adversarial attacks. In this paper, we propose a new type of\nadversarial attack against NMT models. In this attack, we find a word to be\nadded between two sentences such that the second sentence is ignored and not\ntranslated by the NMT model. The word added between the two sentences is such\nthat the whole adversarial text is natural in the source language. This type of\nattack can be harmful in practical scenarios since the attacker can hide\nmalicious information in the automatic translation made by the target NMT\nmodel. Our experiments show that different NMT models and translation tasks are\nvulnerable to this type of attack. Our attack can successfully force the NMT\nmodels to ignore the second part of the input in the translation for more than\n50% of all cases while being able to maintain low perplexity for the whole\ninput.", "paper_summary_zh": "神經機器翻譯系統因其令人印象深刻的表現而用於各種應用中。然而，最近的研究表明，這些系統容易受到對其輸入進行精心設計的小擾動的影響，這稱為對抗性攻擊。在本文中，我們提出了一種針對 NMT 模型的新型對抗性攻擊。在此攻擊中，我們找到一個詞語加在兩個句子之間，使得第二個句子被忽略，且不會被 NMT 模型翻譯。加在兩個句子之間的詞語使得整個對抗性文本在原始語言中是自然的。這種攻擊在實際場景中可能是有害的，因為攻擊者可以在目標 NMT 模型進行的自動翻譯中隱藏惡意資訊。我們的實驗表明，不同的 NMT 模型和翻譯任務容易受到這種攻擊。我們的攻擊可以成功迫使 NMT 模型在超過 50% 的情況下忽略輸入的第二部分，同時能夠保持整個輸入的低困惑度。", "author": "Sahar Sadrizadeh et.al.", "authors": "Sahar Sadrizadeh, César Descalzo, Ljiljana Dolamic, Pascal Frossard", "id": "2411.12473v1", "paper_url": "http://arxiv.org/abs/2411.12473v1", "repo": "null"}}