{"2504.11091": {"publish_time": "2025-04-15", "title": "AI-guided Antibiotic Discovery Pipeline from Target Selection to Compound Identification", "paper_summary": "Antibiotic resistance presents a growing global health crisis, demanding new\ntherapeutic strategies that target novel bacterial mechanisms. Recent advances\nin protein structure prediction and machine learning-driven molecule generation\noffer a promising opportunity to accelerate drug discovery. However, practical\nguidance on selecting and integrating these models into real-world pipelines\nremains limited. In this study, we develop an end-to-end, artificial\nintelligence-guided antibiotic discovery pipeline that spans target\nidentification to compound realization. We leverage structure-based clustering\nacross predicted proteomes of multiple pathogens to identify conserved,\nessential, and non-human-homologous targets. We then systematically evaluate\nsix leading 3D-structure-aware generative models$\\unicode{x2014}$spanning\ndiffusion, autoregressive, graph neural network, and language model\narchitectures$\\unicode{x2014}$on their usability, chemical validity, and\nbiological relevance. Rigorous post-processing filters and commercial analogue\nsearches reduce over 100 000 generated compounds to a focused, synthesizable\nset. Our results highlight DeepBlock and TamGen as top performers across\ndiverse criteria, while also revealing critical trade-offs between model\ncomplexity, usability, and output quality. This work provides a comparative\nbenchmark and blueprint for deploying artificial intelligence in early-stage\nantibiotic development.", "paper_summary_zh": "<paragraph>抗生素抗藥性構成了日益嚴重的全球健康危機，需要針對新型細菌機制的新治療策略。蛋白質結構預測和機器學習驅動的分子生成的最新進展，為加速藥物發現提供了充滿希望的機會。然而，關於選擇這些模型並將其整合到實際流程中的實用指導仍然有限。在這項研究中，我們開發了一個端到端的、人工智慧引導的抗生素發現流程，涵蓋了從靶點識別到化合物實現的整個過程。我們利用跨多種病原體的預測蛋白質組的基於結構的聚類來識別保守的、必要的和非人類同源的靶點。然後，我們系統地評估了六個領先的 3D 結構感知生成模型——涵蓋擴散、自回歸、圖神經網路和語言模型架構——的可用性、化學有效性和生物學相關性。嚴格的後處理過濾器和商業類似物搜尋將超過 100,000 種生成的化合物縮減為一個重點的、可合成的集合。我們的結果突顯了 DeepBlock 和 TamGen 在各種標準中都是最佳表現者，同時也揭示了模型複雜性、可用性和輸出質量之間的關鍵權衡。這項工作為在早期抗生素開發中部署人工智慧提供了比較基準和藍圖。</paragraph>\n", "author": "Maximilian G. Schuh et.al.", "authors": "Maximilian G. Schuh, Joshua Hesse, Stephan A. Sieber", "id": "2504.11091v1", "paper_url": "http://arxiv.org/abs/2504.11091v1", "repo": "null"}}