{"2410.13822": {"publish_time": "2024-10-17", "title": "Multi-style conversion for semantic segmentation of lesions in fundus images by adversarial attacks", "paper_summary": "The diagnosis of diabetic retinopathy, which relies on fundus images, faces\nchallenges in achieving transparency and interpretability when using a global\nclassification approach. However, segmentation-based databases are\nsignificantly more expensive to acquire and combining them is often\nproblematic. This paper introduces a novel method, termed adversarial style\nconversion, to address the lack of standardization in annotation styles across\ndiverse databases. By training a single architecture on combined databases, the\nmodel spontaneously modifies its segmentation style depending on the input,\ndemonstrating the ability to convert among different labeling styles. The\nproposed methodology adds a linear probe to detect dataset origin based on\nencoder features and employs adversarial attacks to condition the model's\nsegmentation style. Results indicate significant qualitative and quantitative\nthrough dataset combination, offering avenues for improved model\ngeneralization, uncertainty estimation and continuous interpolation between\nannotation styles. Our approach enables training a segmentation model with\ndiverse databases while controlling and leveraging annotation styles for\nimproved retinopathy diagnosis.", "paper_summary_zh": "糖尿病視網膜病變的診斷依賴於眼底影像，在使用整體分類方法時，面臨透明度和可解釋性的挑戰。然而，基於分割的資料庫取得成本高昂，且合併時常出現問題。本文提出了一種創新的方法，稱為對抗式風格轉換，以解決不同資料庫中標註風格缺乏標準化的問題。透過在合併的資料庫上訓練單一架構，模型會根據輸入自動修改其分割風格，證明了在不同標籤風格之間轉換的能力。所提出的方法在編碼器特徵的基礎上加入線性探測，以偵測資料集來源，並採用對抗式攻擊來調整模型的分割風格。結果顯示透過資料集組合，在質量和數量上都有顯著的進步，為模型泛化、不確定性估計和標註風格之間的連續插值提供了途徑。我們的做法能夠訓練出具備多元資料庫的分割模型，同時控制和利用標註風格，以改善視網膜病變診斷。", "author": "Clément Playout et.al.", "authors": "Clément Playout, Renaud Duval, Marie Carole Boucher, Farida Cheriet", "id": "2410.13822v1", "paper_url": "http://arxiv.org/abs/2410.13822v1", "repo": "https://github.com/clementpla/multistyle_funduslesionsegmentation"}}