{"2406.10196": {"publish_time": "2024-06-14", "title": "TRIP-PAL: Travel Planning with Guarantees by Combining Large Language Models and Automated Planners", "paper_summary": "Travel planning is a complex task that involves generating a sequence of\nactions related to visiting places subject to constraints and maximizing some\nuser satisfaction criteria. Traditional approaches rely on problem formulation\nin a given formal language, extracting relevant travel information from web\nsources, and use an adequate problem solver to generate a valid solution. As an\nalternative, recent Large Language Model (LLM) based approaches directly output\nplans from user requests using language. Although LLMs possess extensive travel\ndomain knowledge and provide high-level information like points of interest and\npotential routes, current state-of-the-art models often generate plans that\nlack coherence, fail to satisfy constraints fully, and do not guarantee the\ngeneration of high-quality solutions. We propose TRIP-PAL, a hybrid method that\ncombines the strengths of LLMs and automated planners, where (i) LLMs get and\ntranslate travel information and user information into data structures that can\nbe fed into planners; and (ii) automated planners generate travel plans that\nguarantee constraint satisfaction and optimize for users' utility. Our\nexperiments across various travel scenarios show that TRIP-PAL outperforms an\nLLM when generating travel plans.", "paper_summary_zh": "旅遊規劃是一項複雜的任務，它涉及到產生一系列與參觀受約束地點相關的動作，並最大化某些使用者滿意度標準。傳統方法依賴於在既定的形式語言中制定問題、從網路來源中提取相關旅遊資訊，並使用適當的問題解決器來產生一個有效的解決方案。作為一種替代方案，最近的大語言模型 (LLM) 基於直接從使用者要求中使用語言輸出計畫的方法。儘管 LLM 擁有廣泛的旅遊領域知識，並提供諸如景點和潛在路線等高級資訊，但目前的最新模型通常會產生缺乏連貫性、無法完全滿足約束條件且無法保證產生高品質解決方案的計畫。我們提出 TRIP-PAL，這是一種結合 LLM 和自動化計畫員優勢的混合方法，其中 (i) LLM 取得並將旅遊資訊和使用者資訊轉換成可以提供給計畫員的資料結構；以及 (ii) 自動化計畫員產生旅遊計畫，以保證約束條件得到滿足，並針對使用者的效用進行最佳化。我們在各種旅遊情境中進行的實驗顯示，TRIP-PAL 在產生旅遊計畫時優於 LLM。", "author": "Tomas de la Rosa et.al.", "authors": "Tomas de la Rosa, Sriram Gopalakrishnan, Alberto Pozanco, Zhen Zeng, Daniel Borrajo", "id": "2406.10196v1", "paper_url": "http://arxiv.org/abs/2406.10196v1", "repo": "null"}}