{"2408.11976": {"publish_time": "2024-08-21", "title": "Sentiment and Emotion-aware Multi-criteria Fuzzy Group Decision Making System", "paper_summary": "In today's world, making decisions as a group is common, whether choosing a\nrestaurant or deciding on a holiday destination. Group decision-making (GDM)\nsystems play a crucial role by facilitating consensus among participants with\ndiverse preferences. Discussions are one of the main tools people use to make\ndecisions. When people discuss alternatives, they use natural language to\nexpress their opinions. Traditional GDM systems generally require participants\nto provide explicit opinion values to the system. However, in real-life\nscenarios, participants often express their opinions through some text (e.g.,\nin comments, social media, messengers, etc.). This paper introduces a sentiment\nand emotion-aware multi-criteria fuzzy GDM system designed to enhance\nconsensus-reaching effectiveness in group settings. This system incorporates\nnatural language processing to analyze sentiments and emotions expressed in\ntextual data, enabling an understanding of participant opinions besides the\nexplicit numerical preference inputs. Once all the experts have provided their\npreferences for the alternatives, the individual preferences are aggregated\ninto a single collective preference matrix. This matrix represents the\ncollective expert opinion regarding the other options. Then, sentiments,\nemotions, and preference scores are inputted into a fuzzy inference system to\nget the overall score. The proposed system was used for a small decision-making\nprocess - choosing the hotel for a vacation by a group of friends. Our findings\ndemonstrate that integrating sentiment and emotion analysis into GDM systems\nallows everyone's feelings and opinions to be considered during discussions and\nsignificantly improves consensus among participants.", "paper_summary_zh": "<paragraph>在當今世界中，無論是選擇餐廳或決定度假目的地，以小組形式做出決策是很常見的。小組決策（GDM）系統透過促進具有不同偏好的參與者達成共識，發揮了至關重要的作用。討論是人們用來做出決策的主要工具之一。當人們討論備選方案時，他們會使用自然語言表達自己的意見。傳統的 GDM 系統通常要求參與者向系統提供明確的意見值。然而，在現實生活中，參與者通常透過一些文字（例如，在評論、社群媒體、通訊軟體等中）表達自己的意見。本文介紹了一個情緒和情感感知的多準則模糊 GDM 系統，旨在增強小組環境中達成共識的有效性。此系統結合了自然語言處理，以分析在文字資料中表達的情緒和情感，除了明確的數值偏好輸入外，還能了解參與者的意見。一旦所有專家都提供了他們對備選方案的偏好，則將個別偏好彙總成一個單一的集體偏好矩陣。此矩陣代表了集體專家意見，關於其他選項。然後，將情緒、情感和偏好分數輸入模糊推理系統以取得總分。所提出的系統用於一個小型決策制定過程 - 由一群朋友選擇度假飯店。我們的研究結果表明，將情緒和情感分析整合到 GDM 系統中，讓每個人的感受和意見都能在討論中被考慮，並顯著改善參與者之間的共識。</paragraph>", "author": "Adilet Yerkin et.al.", "authors": "Adilet Yerkin, Pakizar Shamoi, Elnara Kadyrgali", "id": "2408.11976v1", "paper_url": "http://arxiv.org/abs/2408.11976v1", "repo": "null"}}