{"2504.02828": {"publish_time": "2025-04-03", "title": "Concept Lancet: Image Editing with Compositional Representation Transplant", "paper_summary": "Diffusion models are widely used for image editing tasks. Existing editing\nmethods often design a representation manipulation procedure by curating an\nedit direction in the text embedding or score space. However, such a procedure\nfaces a key challenge: overestimating the edit strength harms visual\nconsistency while underestimating it fails the editing task. Notably, each\nsource image may require a different editing strength, and it is costly to\nsearch for an appropriate strength via trial-and-error. To address this\nchallenge, we propose Concept Lancet (CoLan), a zero-shot plug-and-play\nframework for principled representation manipulation in diffusion-based image\nediting. At inference time, we decompose the source input in the latent (text\nembedding or diffusion score) space as a sparse linear combination of the\nrepresentations of the collected visual concepts. This allows us to accurately\nestimate the presence of concepts in each image, which informs the edit. Based\non the editing task (replace/add/remove), we perform a customized concept\ntransplant process to impose the corresponding editing direction. To\nsufficiently model the concept space, we curate a conceptual representation\ndataset, CoLan-150K, which contains diverse descriptions and scenarios of\nvisual terms and phrases for the latent dictionary. Experiments on multiple\ndiffusion-based image editing baselines show that methods equipped with CoLan\nachieve state-of-the-art performance in editing effectiveness and consistency\npreservation.", "paper_summary_zh": "擴散模型廣泛用於圖像編輯任務。現有的編輯方法通常透過在文本嵌入或分數空間中策劃編輯方向來設計表示操作程序。然而，這樣的程序面臨一個關鍵挑戰：高估編輯強度會損害視覺一致性，而低估則會導致編輯任務失敗。值得注意的是，每個來源圖像可能需要不同的編輯強度，並且透過試錯法搜尋合適的強度成本很高。為了應對這一挑戰，我們提出了概念柳葉刀 (CoLan)，這是一個用於在基於擴散的圖像編輯中進行原則性表示操作的零樣本即插即用框架。在推理時，我們將潛在（文本嵌入或擴散分數）空間中的源輸入分解為收集到的視覺概念表示的稀疏線性組合。這使我們能夠準確估計每個圖像中概念的存在，從而為編輯提供信息。根據編輯任務（替換/添加/刪除），我們執行自定義的概念移植過程以施加相應的編輯方向。為了充分建模概念空間，我們策劃了一個概念表示數據集 CoLan-150K，其中包含用於潛在字典的視覺術語和短語的各種描述和場景。在多個基於擴散的圖像編輯基準上的實驗表明，配備 CoLan 的方法在編輯有效性和一致性保留方面達到了最先進的性能。\n", "author": "Jinqi Luo et.al.", "authors": "Jinqi Luo, Tianjiao Ding, Kwan Ho Ryan Chan, Hancheng Min, Chris Callison-Burch, René Vidal", "id": "2504.02828v1", "paper_url": "http://arxiv.org/abs/2504.02828v1", "repo": "null"}}