{"2410.23861": {"publish_time": "2024-10-31", "title": "Audio Is the Achilles' Heel: Red Teaming Audio Large Multimodal Models", "paper_summary": "Large Multimodal Models (LMMs) have demonstrated the ability to interact with\nhumans under real-world conditions by combining Large Language Models (LLMs)\nand modality encoders to align multimodal information (visual and auditory)\nwith text. However, such models raise new safety challenges of whether models\nthat are safety-aligned on text also exhibit consistent safeguards for\nmultimodal inputs. Despite recent safety-alignment research on vision LMMs, the\nsafety of audio LMMs remains under-explored. In this work, we comprehensively\nred team the safety of five advanced audio LMMs under three settings: (i)\nharmful questions in both audio and text formats, (ii) harmful questions in\ntext format accompanied by distracting non-speech audio, and (iii)\nspeech-specific jailbreaks. Our results under these settings demonstrate that\nopen-source audio LMMs suffer an average attack success rate of 69.14% on\nharmful audio questions, and exhibit safety vulnerabilities when distracted\nwith non-speech audio noise. Our speech-specific jailbreaks on Gemini-1.5-Pro\nachieve an attack success rate of 70.67% on the harmful query benchmark. We\nprovide insights on what could cause these reported safety-misalignments.\nWarning: this paper contains offensive examples.", "paper_summary_zh": "大型多模态模型（LMM）已展示出在现实世界条件下与人类互动，方法是结合大型语言模型（LLM）和模态编码器，将多模态信息（视觉和听觉）与文本对齐。然而，这些模型提出了新的安全挑战，即在文本上安全对齐的模型是否也对多模态输入表现出一致的保障措施。尽管最近对视觉 LMM 进行了安全对齐研究，但音频 LMM 的安全性仍未得到充分探索。在这项工作中，我们在三种设置下全面地对五种先进的音频 LMM 的安全性进行了红队测试：(i) 音频和文本格式的有害问题，(ii) 文本格式的有害问题，并伴有分散注意力的非语音音频，以及 (iii) 特定的语音越狱。我们在这些设置下的结果表明，开源音频 LMM 在有害音频问题上的平均攻击成功率为 69.14%，并且在被非语音音频噪音分散注意力时表现出安全漏洞。我们在 Gemini-1.5-Pro 上针对特定语音的越狱在有害查询基准上实现了 70.67% 的攻击成功率。我们提供了对可能导致这些报告的安全错位的原因的见解。警告：本文包含攻击性示例。", "author": "Hao Yang et.al.", "authors": "Hao Yang, Lizhen Qu, Ehsan Shareghi, Gholamreza Haffari", "id": "2410.23861v1", "paper_url": "http://arxiv.org/abs/2410.23861v1", "repo": "null"}}