{"2405.16907": {"publish_time": "2024-05-27", "title": "GTA: Generative Trajectory Augmentation with Guidance for Offline Reinforcement Learning", "paper_summary": "Offline Reinforcement Learning (Offline RL) presents challenges of learning\neffective decision-making policies from static datasets without any online\ninteractions. Data augmentation techniques, such as noise injection and data\nsynthesizing, aim to improve Q-function approximation by smoothing the learned\nstate-action region. However, these methods often fall short of directly\nimproving the quality of offline datasets, leading to suboptimal results. In\nresponse, we introduce \\textbf{GTA}, Generative Trajectory Augmentation, a\nnovel generative data augmentation approach designed to enrich offline data by\naugmenting trajectories to be both high-rewarding and dynamically plausible.\nGTA applies a diffusion model within the data augmentation framework. GTA\npartially noises original trajectories and then denoises them with\nclassifier-free guidance via conditioning on amplified return value. Our\nresults show that GTA, as a general data augmentation strategy, enhances the\nperformance of widely used offline RL algorithms in both dense and sparse\nreward settings. Furthermore, we conduct a quality analysis of data augmented\nby GTA and demonstrate that GTA improves the quality of the data. Our code is\navailable at https://github.com/Jaewoopudding/GTA", "paper_summary_zh": "離線強化學習 (Offline RL) 提出從靜態資料集學習有效決策制定政策的挑戰，而沒有任何線上互動。資料擴充技術，例如雜訊注入和資料合成，旨在透過平滑學習的狀態動作區域來改善 Q 函數逼近。然而，這些方法通常無法直接改善離線資料集的品質，導致次佳結果。為了解決這個問題，我們引入了 **GTA**，生成軌跡擴充，一種新穎的生成資料擴充方法，旨在透過擴充軌跡以獲得高報酬和動態可信度來豐富離線資料。GTA 在資料擴充架構中應用擴散模型。GTA 部分雜訊化原始軌跡，然後透過對放大回報值進行條件化，以無分類器引導的方式對其去雜訊。我們的結果顯示，GTA 作為一種通用的資料擴充策略，在密集和稀疏報酬設定中都增強了廣泛使用的離線 RL 演算法的效能。此外，我們對 GTA 擴充的資料進行品質分析，並證明 GTA 改善了資料品質。我們的程式碼可在 https://github.com/Jaewoopudding/GTA 取得", "author": "Jaewoo Lee et.al.", "authors": "Jaewoo Lee, Sujin Yun, Taeyoung Yun, Jinkyoo Park", "id": "2405.16907v2", "paper_url": "http://arxiv.org/abs/2405.16907v2", "repo": "https://github.com/jaewoopudding/gta"}}