{"2407.01214": {"publish_time": "2024-07-01", "title": "Revisiting Random Walks for Learning on Graphs", "paper_summary": "We revisit a simple idea for machine learning on graphs, where a random walk\non a graph produces a machine-readable record, and this record is processed by\na deep neural network to directly make vertex-level or graph-level predictions.\nWe refer to these stochastic machines as random walk neural networks, and show\nthat we can design them to be isomorphism invariant while capable of universal\napproximation of graph functions in probability. A useful finding is that\nalmost any kind of record of random walk guarantees probabilistic invariance as\nlong as the vertices are anonymized. This enables us to record random walks in\nplain text and adopt a language model to read these text records to solve graph\ntasks. We further establish a parallelism to message passing neural networks\nusing tools from Markov chain theory, and show that over-smoothing in message\npassing is alleviated by construction in random walk neural networks, while\nover-squashing manifests as probabilistic under-reaching. We show that random\nwalk neural networks based on pre-trained language models can solve several\nhard problems on graphs, such as separating strongly regular graphs where the\n3-WL test fails, counting substructures, and transductive classification on\narXiv citation network without training. Code is available at\nhttps://github.com/jw9730/random-walk.", "paper_summary_zh": "<paragraph>我們重新審視圖形機器學習的一個簡單想法，其中圖形上的隨機遊走會產生機器可讀的記錄，而這個記錄會由深度神經網路處理，以直接進行頂點層級或圖形層級的預測。我們將這些隨機機器稱為隨機遊走神經網路，並展示我們可以將它們設計成同構不變，同時具備機率中圖形函數的通用近似能力。一個有用的發現是，只要頂點是匿名的，幾乎任何類型的隨機遊走記錄都可以保證機率不變性。這使我們能夠以純文字記錄隨機遊走，並採用語言模型來讀取這些文字記錄，以解決圖形任務。我們進一步建立了一個與訊息傳遞神經網路的平行性，使用馬可夫鏈理論的工具，並展示訊息傳遞中的過度平滑會因隨機遊走神經網路中的構造而得到緩解，而過度壓縮則表現為機率性不足。我們展示了基於預先訓練語言模型的隨機遊走神經網路可以解決圖形上的幾個困難問題，例如分離 3-WL 測試失敗的強正則圖形、計算子結構，以及在 arXiv 引文網路中進行轉導分類，而無需訓練。程式碼可在 https://github.com/jw9730/random-walk 取得。</paragraph>", "author": "Jinwoo Kim et.al.", "authors": "Jinwoo Kim, Olga Zaghen, Ayhan Suleymanzade, Youngmin Ryou, Seunghoon Hong", "id": "2407.01214v1", "paper_url": "http://arxiv.org/abs/2407.01214v1", "repo": "https://github.com/jw9730/random-walk"}}