{"2410.23108": {"publish_time": "2024-10-30", "title": "Controllable Game Level Generation: Assessing the Effect of Negative Examples in GAN Models", "paper_summary": "Generative Adversarial Networks (GANs) are unsupervised models designed to\nlearn and replicate a target distribution. The vanilla versions of these models\ncan be extended to more controllable models. Conditional Generative Adversarial\nNetworks (CGANs) extend vanilla GANs by conditioning both the generator and\ndiscriminator on some additional information (labels). Controllable models\nbased on complementary learning, such as Rumi-GAN, have been introduced.\nRumi-GANs leverage negative examples to enhance the generator's ability to\nlearn positive examples. We evaluate the performance of two controllable GAN\nvariants, CGAN and Rumi-GAN, in generating game levels targeting specific\nconstraints of interest: playability and controllability. This evaluation is\nconducted under two scenarios: with and without the inclusion of negative\nexamples. The goal is to determine whether incorporating negative examples\nhelps the GAN models avoid generating undesirable outputs. Our findings\nhighlight the strengths and weaknesses of each method in enforcing the\ngeneration of specific conditions when generating outputs based on given\npositive and negative examples.", "paper_summary_zh": "生成對抗網路 (GAN) 為非監督式模型，旨在學習並複製目標分配。這些模型的香草版本可延伸至更具可控性的模型。條件生成對抗網路 (CGAN) 透過在生成器和判別器中加入一些額外資訊 (標籤) 來延伸香草 GAN。已經引入了基於互補學習的可控模型，例如 Rumi-GAN。Rumi-GAN 利用負面範例來增強生成器學習正面範例的能力。我們評估了兩種可控 GAN 變體 (CGAN 和 Rumi-GAN) 在產生針對特定感興趣約束的遊戲關卡方面的效能：可玩性和可控性。此評估在兩種場景下進行：包含和不包含負面範例。目標是確定納入負面範例是否有助於 GAN 模型避免產生不良輸出。我們的研究結果突顯了每種方法在根據給定的正面和負面範例產生輸出時，在強制產生特定條件方面的優點和缺點。", "author": "Mahsa Bazzaz et.al.", "authors": "Mahsa Bazzaz, Seth Cooper", "id": "2410.23108v1", "paper_url": "http://arxiv.org/abs/2410.23108v1", "repo": "null"}}