{"2410.21127": {"publish_time": "2024-10-28", "title": "Retrieval-Enhanced Mutation Mastery: Augmenting Zero-Shot Prediction of Protein Language Model", "paper_summary": "Enzyme engineering enables the modification of wild-type proteins to meet\nindustrial and research demands by enhancing catalytic activity, stability,\nbinding affinities, and other properties. The emergence of deep learning\nmethods for protein modeling has demonstrated superior results at lower costs\ncompared to traditional approaches such as directed evolution and rational\ndesign. In mutation effect prediction, the key to pre-training deep learning\nmodels lies in accurately interpreting the complex relationships among protein\nsequence, structure, and function. This study introduces a retrieval-enhanced\nprotein language model for comprehensive analysis of native properties from\nsequence and local structural interactions, as well as evolutionary properties\nfrom retrieved homologous sequences. The state-of-the-art performance of the\nproposed ProtREM is validated on over 2 million mutants across 217 assays from\nan open benchmark (ProteinGym). We also conducted post-hoc analyses of the\nmodel's ability to improve the stability and binding affinity of a VHH\nantibody. Additionally, we designed 10 new mutants on a DNA polymerase and\nconducted wet-lab experiments to evaluate their enhanced activity at higher\ntemperatures. Both in silico and experimental evaluations confirmed that our\nmethod provides reliable predictions of mutation effects, offering an auxiliary\ntool for biologists aiming to evolve existing enzymes. The implementation is\npublicly available at https://github.com/tyang816/ProtREM.", "paper_summary_zh": "酵素工程可藉由強化催化活性、穩定性、結合親合度及其他特性，來修改野生型蛋白質以滿足產業及研究需求。與傳統方法（例如定向演化與合理設計）相比，深度學習方法在蛋白質建模方面已展現出更佳的結果，且成本更低。在突變效應預測中，預先訓練深度學習模型的關鍵在於準確詮釋蛋白質序列、結構與功能之間的複雜關係。本研究引入一個檢索增強蛋白質語言模型，用於全面分析序列與局部結構交互作用的原生特性，以及檢索到的同源序列的演化特性。所提出的 ProtREM 驗證了在來自開放基準（ProteinGym）的 217 項測定中超過 200 萬個突變體的最新效能。我們也對模型改善 VHH 抗體穩定性與結合親合度的能力進行事後分析。此外，我們在 DNA 聚合酶上設計了 10 個新的突變體，並進行實驗室實驗以評估它們在較高溫度下的增強活性。電腦模擬和實驗評估都證實，我們的模型提供可靠的突變效應預測，為生物學家提供一個輔助工具，用以演化現有的酵素。實作公開於 https://github.com/tyang816/ProtREM。", "author": "Yang Tan et.al.", "authors": "Yang Tan, Ruilin Wang, Banghao Wu, Liang Hong, Bingxin Zhou", "id": "2410.21127v1", "paper_url": "http://arxiv.org/abs/2410.21127v1", "repo": "https://github.com/tyang816/protrem"}}