{"2406.07545": {"publish_time": "2024-06-11", "title": "Open-LLM-Leaderboard: From Multi-choice to Open-style Questions for LLMs Evaluation, Benchmark, and Arena", "paper_summary": "Multiple-choice questions (MCQ) are frequently used to assess large language\nmodels (LLMs). Typically, an LLM is given a question and selects the answer\ndeemed most probable after adjustments for factors like length. Unfortunately,\nLLMs may inherently favor certain answer choice IDs, such as A/B/C/D, due to\ninherent biases of priori unbalanced probabilities, influencing the prediction\nof answers based on these IDs. Previous research has introduced methods to\nreduce this ''selection bias'' by simply permutating options on a few test\nsamples and applying to new ones. Another problem of MCQ is the lottery ticket\nchoice by ''random guessing''. The LLM does not learn particular knowledge, but\nthe option is guessed correctly. This situation is especially serious for those\nsmall-scale LLMs. To address them, a more thorough approach involves shifting\nfrom MCQ to open-style questions, which can fundamentally eliminate selection\nbias and random guessing issues. However, transitioning causes its own set of\nchallenges in (1) identifying suitable open-style questions and (2) validating\nthe correctness of LLM open-style responses against human-annotated\nground-truths. This work aims to tackle these significant difficulties, and\nestablish a new LLM evaluation benchmark through entirely open-style questions.\nConsequently, we introduce the Open-LLM-Leaderboard to track various LLMs'\nperformance and reflect true capability of them, such as GPT-4o/4/3.5, Claude\n3, Gemini, etc. Our code and dataset are available at\nhttps://github.com/VILA-Lab/Open-LLM-Leaderboard.", "paper_summary_zh": "多選題 (MCQ) 常用於評量大型語言模型 (LLM)。通常，LLM 會收到一個問題，並在針對長度等因素進行調整後，選擇最有可能的答案。不幸的是，由於先驗不平衡機率的內在偏誤，LLM 可能天生偏好某些答案選項 ID，例如 A/B/C/D，這會影響根據這些 ID 預測答案。先前的研究已引入方法，透過僅在幾個測試樣本上排列選項並套用到新的樣本，來減少這種「選擇偏誤」。MCQ 的另一個問題是「隨機猜測」的樂透選項。LLM 沒有學習特定知識，但選項猜對了。對於那些小規模的 LLM 來說，這種情況尤其嚴重。為了解決這些問題，更徹底的方法涉及從 MCQ 轉換為開放式問題，這可以從根本上消除選擇偏誤和隨機猜測的問題。然而，轉換會在 (1) 找出合適的開放式問題和 (2) 驗證 LLM 開放式回應的正確性是否符合人工標記的真實情況方面，造成其自身的挑戰。這項工作旨在解決這些重大的困難，並透過完全開放式問題建立新的 LLM 評量基準。因此，我們引入了 Open-LLM-Leaderboard 來追蹤各種 LLM 的效能，並反映它們的真實能力，例如 GPT-4o/4/3.5、Claude 3、Gemini 等。我們的程式碼和資料集可在 https://github.com/VILA-Lab/Open-LLM-Leaderboard 取得。", "author": "Aidar Myrzakhan et.al.", "authors": "Aidar Myrzakhan, Sondos Mahmoud Bsharat, Zhiqiang Shen", "id": "2406.07545v1", "paper_url": "http://arxiv.org/abs/2406.07545v1", "repo": "https://github.com/vila-lab/open-llm-leaderboard"}}