{"2406.12546": {"publish_time": "2024-06-18", "title": "Liar, Liar, Logical Mire: A Benchmark for Suppositional Reasoning in Large Language Models", "paper_summary": "Knights and knaves problems represent a classic genre of logical puzzles\nwhere characters either tell the truth or lie. The objective is to logically\ndeduce each character's identity based on their statements. The challenge\narises from the truth-telling or lying behavior, which influences the logical\nimplications of each statement. Solving these puzzles requires not only direct\ndeductions from individual statements, but the ability to assess the\ntruthfulness of statements by reasoning through various hypothetical scenarios.\nAs such, knights and knaves puzzles serve as compelling examples of\nsuppositional reasoning. In this paper, we introduce $\\textit{TruthQuest}$, a\nbenchmark for suppositional reasoning based on the principles of knights and\nknaves puzzles. Our benchmark presents problems of varying complexity,\nconsidering both the number of characters and the types of logical statements\ninvolved. Evaluations on $\\textit{TruthQuest}$ show that large language models\nlike Llama 3 and Mixtral-8x7B exhibit significant difficulties solving these\ntasks. A detailed error analysis of the models' output reveals that\nlower-performing models exhibit a diverse range of reasoning errors, frequently\nfailing to grasp the concept of truth and lies. In comparison, more proficient\nmodels primarily struggle with accurately inferring the logical implications of\npotentially false statements.", "paper_summary_zh": "騎士與惡棍問題代表了一種經典的邏輯謎題類型，其中人物不是說真話就是說謊。目標是根據角色的陳述邏輯地推論出每個角色的身份。挑戰來自說真話或說謊的行為，這會影響每個陳述的邏輯含義。解決這些謎題不僅需要從個別陳述中直接推論，還需要通過推理各種假設場景來評估陳述的真實性。因此，騎士與惡棍謎題是假設推理的有力範例。在本文中，我們介紹了 $\\textit{TruthQuest}$，一個基於騎士與惡棍謎題原理的假設推理基準。我們的基準提出了不同複雜程度的問題，同時考慮了角色數量和涉及的邏輯陳述類型。在 $\\textit{TruthQuest}$ 上的評估顯示，像 Llama 3 和 Mixtral-8x7B 這樣的大語言模型在解決這些任務時遇到了顯著困難。對模型輸出的詳細錯誤分析表明，表現較差的模型表現出各種推理錯誤，經常無法掌握真假概念。相比之下，表現較好的模型主要難以準確推斷出潛在錯誤陳述的邏輯含義。", "author": "Philipp Mondorf et.al.", "authors": "Philipp Mondorf, Barbara Plank", "id": "2406.12546v1", "paper_url": "http://arxiv.org/abs/2406.12546v1", "repo": "null"}}