{"2410.18890": {"publish_time": "2024-10-24", "title": "Improving Small-Scale Large Language Models Function Calling for Reasoning Tasks", "paper_summary": "Recent advancements in Large Language Models (LLMs) have demonstrated\nexceptional capabilities in natural language understanding and generation.\nWhile these models excel in general complex reasoning tasks, they still face\nchallenges in mathematical problem-solving and logical reasoning. To address\nthese limitations, researchers have explored function calling abilities,\nallowing LLMs to execute provided functions and utilize their outputs for task\ncompletion. However, concentrating on specific tasks can be very inefficient\nfor large-scale LLMs to be used, because of the expensive cost of training and\ninference stages they need in terms of computational resources. This study\nintroduces a novel framework for training smaller language models in function\ncalling, focusing on specific logical and mathematical reasoning tasks. The\napproach aims to improve performances of small-scale models for these tasks\nusing function calling, ensuring a high level of accuracy. Our framework\nemploys an agent that, given a problem and a set of callable functions, queries\nthe LLM by injecting a description and examples of the usable functions into\nthe prompt and managing their calls in a step-by-step reasoning chain. This\nprocess is used to create a dataset of correct and incorrect reasoning chain\nchat completions from a large-scale LLM. This dataset is used to train a\nsmaller LLM using Reinforcement Learning from Human Feedback (RLHF),\nspecifically employing the Direct Preference Optimization (DPO) technique.\nExperimental results demonstrate how the proposed approach balances the\ntrade-off between model size and performance, improving the ability of function\ncalling for reasoning tasks, in smaller models.", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 的最新進展已證明在自然語言理解和生成方面具有非凡的能力。雖然這些模型在一般複雜推理任務中表現出色，但它們在數學問題解決和邏輯推理方面仍然面臨挑戰。為了解決這些限制，研究人員探索了函數呼叫能力，允許 LLM 執行提供的函數並利用其輸出進行任務完成。然而，專注於特定任務對於使用大規模 LLM 來說可能非常低效，因為它們在計算資源方面需要昂貴的訓練和推理階段成本。本研究引入了一個新框架，用於訓練函數呼叫中的較小語言模型，重點關注具體的邏輯和數學推理任務。該方法旨在使用函數呼叫改善小規模模型對這些任務的性能，確保高準確度。我們的框架採用了一個代理，給定一個問題和一組可呼叫函數，通過將可用函數的描述和範例注入提示中並逐步推理鏈中管理其呼叫，對 LLM 進行查詢。此流程用於從大規模 LLM 創建正確和不正確推理鏈聊天完成項目的資料集。此資料集用於使用人類回饋強化學習 (RLHF) 訓練較小的 LLM，特別是採用直接偏好最佳化 (DPO) 技術。實驗結果證明了所提出的方法如何平衡模型大小和性能之間的取捨，在較小的模型中提高函數呼叫推理任務的能力。</paragraph>", "author": "Graziano A. Manduzio et.al.", "authors": "Graziano A. Manduzio, Federico A. Galatolo, Mario G. C. A. Cimino, Enzo Pasquale Scilingo, Lorenzo Cominelli", "id": "2410.18890v1", "paper_url": "http://arxiv.org/abs/2410.18890v1", "repo": "null"}}