{"2409.06111": {"publish_time": "2024-09-09", "title": "PaRCE: Probabilistic and Reconstruction-Based Competency Estimation for Safe Navigation Under Perception Uncertainty", "paper_summary": "Perception-based navigation systems are useful for unmanned ground vehicle\n(UGV) navigation in complex terrains, where traditional depth-based navigation\nschemes are insufficient. However, these data-driven methods are highly\ndependent on their training data and can fail in surprising and dramatic ways\nwith little warning. To ensure the safety of the vehicle and the surrounding\nenvironment, it is imperative that the navigation system is able to recognize\nthe predictive uncertainty of the perception model and respond safely and\neffectively in the face of uncertainty. In an effort to enable safe navigation\nunder perception uncertainty, we develop a probabilistic and\nreconstruction-based competency estimation (PaRCE) method to estimate the\nmodel's level of familiarity with an input image as a whole and with specific\nregions in the image. We find that the overall competency score can correctly\npredict correctly classified, misclassified, and out-of-distribution (OOD)\nsamples. We also confirm that the regional competency maps can accurately\ndistinguish between familiar and unfamiliar regions across images. We then use\nthis competency information to develop a planning and control scheme that\nenables effective navigation while maintaining a low probability of error. We\nfind that the competency-aware scheme greatly reduces the number of collisions\nwith unfamiliar obstacles, compared to a baseline controller with no competency\nawareness. Furthermore, the regional competency information is very valuable in\nenabling efficient navigation.", "paper_summary_zh": "基於感知的導航系統對於無人地面載具 (UGV) 在複雜地形中進行導航很有用，在這些地形中，傳統的基於深度的導航方案是不夠的。然而，這些資料驅動的方法高度依賴於其訓練資料，並且可能會以令人驚訝且戲劇性的方式在幾乎沒有警告的情況下失敗。為了確保車輛和周圍環境的安全，導航系統必須能夠識別感知模型的預測不確定性，並在不確定性面前做出安全有效的回應。為了在感知不確定性下實現安全導航，我們開發了一種基於概率和重建的勝任力估計 (PaRCE) 方法，以估計模型對輸入影像整體和影像中特定區域的熟悉程度。我們發現，整體勝任力評分可以正確預測正確分類、分類錯誤和分佈外 (OOD) 樣本。我們還確認，區域勝任力圖可以準確區分影像中的熟悉和不熟悉區域。然後，我們使用此勝任力資訊來開發一種規劃和控制方案，在保持低錯誤機率的同時，能夠有效導航。我們發現，與沒有勝任力感知的基準控制器相比，具備勝任力感知的方案大幅減少了與不熟悉障礙物的碰撞次數。此外，區域勝任力資訊對於實現有效導航非常有價值。", "author": "Sara Pohland et.al.", "authors": "Sara Pohland, Claire Tomlin", "id": "2409.06111v1", "paper_url": "http://arxiv.org/abs/2409.06111v1", "repo": "null"}}