{"2408.04723": {"publish_time": "2024-08-08", "title": "Survey: Transformer-based Models in Data Modality Conversion", "paper_summary": "Transformers have made significant strides across various artificial\nintelligence domains, including natural language processing, computer vision,\nand audio processing. This success has naturally garnered considerable interest\nfrom both academic and industry researchers. Consequently, numerous Transformer\nvariants (often referred to as X-formers) have been developed for these fields.\nHowever, a thorough and systematic review of these modality-specific\nconversions remains lacking. Modality Conversion involves the transformation of\ndata from one form of representation to another, mimicking the way humans\nintegrate and interpret sensory information. This paper provides a\ncomprehensive review of transformer-based models applied to the primary\nmodalities of text, vision, and speech, discussing their architectures,\nconversion methodologies, and applications. By synthesizing the literature on\nmodality conversion, this survey aims to underline the versatility and\nscalability of transformers in advancing AI-driven content generation and\nunderstanding.", "paper_summary_zh": "Transformer 在各種人工智能領域取得重大進展，包括自然語言處理、電腦視覺和音訊處理。這項成功自然引起了學術界和產業研究人員的極大興趣。因此，針對這些領域開發了許多 Transformer 變體（通常稱為 X-former）。然而，這些特定於模式的轉換仍缺乏全面且系統性的回顧。模式轉換涉及將資料從一種表示形式轉換為另一種表示形式，模擬人類整合和詮釋感官資訊的方式。本文提供了基於 Transformer 的模型的全面回顧，應用於文字、視覺和語音的主要模式，討論其架構、轉換方法和應用。透過綜合模式轉換的文獻，本調查旨在強調 Transformer 在推動 AI 驅動的內容生成和理解方面的多功能性和可擴充性。", "author": "Elyas Rashno et.al.", "authors": "Elyas Rashno, Amir Eskandari, Aman Anand, Farhana Zulkernine", "id": "2408.04723v1", "paper_url": "http://arxiv.org/abs/2408.04723v1", "repo": "null"}}