{"2412.09203": {"publish_time": "2024-12-12", "title": "CleanComedy: Creating Friendly Humor through Generative Techniques", "paper_summary": "Humor generation is a challenging task in natural language processing due to\nlimited resources and the quality of existing datasets. Available humor\nlanguage resources often suffer from toxicity and duplication, limiting their\neffectiveness for training robust models. This paper proposes CleanComedy, a\nspecialized, partially annotated toxicity-filtered corpus of English and\nRussian jokes collected from various sources. We study the effectiveness of our\ndata filtering approach through a survey on humor and toxicity levels in\nvarious joke groups. In addition, we study advances in computer humor\ngeneration by comparing jokes written by humans with various groups of\ngenerative jokes, including our baseline models trained on the CleanComedy\ndatasets.", "paper_summary_zh": "幽默生成是自然語言處理中的一項具有挑戰性的任務，原因在於資源有限且現有資料集的品質不佳。現有的幽默語言資源經常受到毒性和重複性的影響，限制了它們在訓練穩健模型方面的效用。本文提出 CleanComedy，一個由各種來源收集的英語和俄語笑話所組成的專業且部分註解的非毒性過濾語料庫。我們透過針對各種笑話群組進行幽默和毒性程度的調查，來研究我們的資料過濾方法的效用。此外，我們透過比較人類撰寫的笑話與各種生成笑話的群組（包括我們在 CleanComedy 資料集上訓練的基線模型）來研究電腦幽默生成的進展。", "author": "Dmitry Vikhorev et.al.", "authors": "Dmitry Vikhorev, Daria Galimzianova, Svetlana Gorovaia, Elizaveta Zhemchuzhina, Ivan P. Yamshchikov", "id": "2412.09203v1", "paper_url": "http://arxiv.org/abs/2412.09203v1", "repo": "null"}}