{"2502.02787": {"publish_time": "2025-02-05", "title": "SimMark: A Robust Sentence-Level Similarity-Based Watermarking Algorithm for Large Language Models", "paper_summary": "The rapid proliferation of large language models (LLMs) has created an urgent\nneed for reliable methods to detect whether a text is generated by such models.\nIn this paper, we propose SimMark, a posthoc watermarking algorithm that makes\nLLMs' outputs traceable without requiring access to the model's internal\nlogits, enabling compatibility with a wide range of LLMs, including API-only\nmodels. By leveraging the similarity of semantic sentence embeddings and\nrejection sampling to impose detectable statistical patterns imperceptible to\nhumans, and employing a soft counting mechanism, SimMark achieves robustness\nagainst paraphrasing attacks. Experimental results demonstrate that SimMark\nsets a new benchmark for robust watermarking of LLM-generated content,\nsurpassing prior sentence-level watermarking techniques in robustness, sampling\nefficiency, and applicability across diverse domains, all while preserving the\ntext quality.", "paper_summary_zh": "大型語言模型 (LLM) 的快速擴散創造了迫切需要可靠方法來檢測文本是否是由此類模型產生的。\n在本文中，我們提出 SimMark，這是一種事後浮水印演算法，它使 LLM 的輸出可追蹤，而不需要存取模型的內部邏輯，從而能與各種 LLM 相容，包括僅限 API 的模型。透過利用語義句子嵌入的相似性，以及拒絕抽樣來施加人類無法察覺的可偵測統計模式，並採用軟計數機制，SimMark 對改寫攻擊具備穩健性。實驗結果表明，SimMark 為 LLM 產生的內容的穩健浮水印設定了新的基準，在穩健性、抽樣效率和跨不同領域的適用性方面都超越了先前的句子級浮水印技術，同時保留了文字品質。", "author": "Amirhossein Dabiriaghdam et.al.", "authors": "Amirhossein Dabiriaghdam, Lele Wang", "id": "2502.02787v1", "paper_url": "http://arxiv.org/abs/2502.02787v1", "repo": "null"}}