{"2410.17787": {"publish_time": "2024-10-23", "title": "Large Language Models Engineer Too Many Simple Features For Tabular Data", "paper_summary": "Tabular machine learning problems often require time-consuming and\nlabor-intensive feature engineering. Recent efforts have focused on using large\nlanguage models (LLMs) to capitalize on their potential domain knowledge. At\nthe same time, researchers have observed ethically concerning negative biases\nin other LLM-related use cases, such as text generation. These developments\nmotivated us to investigate whether LLMs exhibit a bias that negatively impacts\nthe performance of feature engineering. While not ethically concerning, such a\nbias could hinder practitioners from fully utilizing LLMs for automated data\nscience. Therefore, we propose a method to detect potential biases by detecting\nanomalies in the frequency of operators (e.g., adding two features) suggested\nby LLMs when engineering new features. Our experiments evaluate the bias of\nfour LLMs, two big frontier and two small open-source models, across 27 tabular\ndatasets. Our results indicate that LLMs are biased toward simple operators,\nsuch as addition, and can fail to utilize more complex operators, such as\ngrouping followed by aggregations. Furthermore, the bias can negatively impact\nthe predictive performance when using LLM-generated features. Our results call\nfor mitigating bias when using LLMs for feature engineering.", "paper_summary_zh": "表格機器學習問題通常需要耗時且勞力密集的特徵工程。最近的努力集中於使用大型語言模型 (LLM) 來利用其潛在的領域知識。與此同時，研究人員觀察到在其他 LLM 相關用例中，例如文字生成，存在倫理上令人擔憂的負面偏見。這些發展促使我們調查 LLM 是否表現出對特徵工程效能產生負面影響的偏見。雖然在倫理上並未引起關注，但這種偏見可能會阻礙從業人員充分利用 LLM 進行自動化資料科學。因此，我們提出了一種方法，透過偵測 LLM 在設計新特徵時建議的運算子（例如，新增兩個特徵）的頻率異常值來偵測潛在偏見。我們的實驗評估了四個 LLM 的偏見，兩個大型前沿模型和兩個小型開源模型，橫跨 27 個表格資料集。我們的結果表明，LLM 偏向於簡單的運算子，例如加法，並且可能無法利用更複雜的運算子，例如群組後聚合。此外，在使用 LLM 生成的特徵時，偏見可能會對預測效能產生負面影響。我們的結果要求在使用 LLM 進行特徵工程時減輕偏見。", "author": "Jaris Küken et.al.", "authors": "Jaris Küken, Lennart Purucker, Frank Hutter", "id": "2410.17787v1", "paper_url": "http://arxiv.org/abs/2410.17787v1", "repo": "null"}}