{"2501.12434": {"publish_time": "2025-01-21", "title": "Enhancing Retrosynthesis with Conformer: A Template-Free Method", "paper_summary": "Retrosynthesis plays a crucial role in the fields of organic synthesis and\ndrug development, where the goal is to identify suitable reactants that can\nyield a target product molecule. Although existing methods have achieved\nnotable success, they typically overlook the 3D conformational details and\ninternal spatial organization of molecules. This oversight makes it challenging\nto predict reactants that conform to genuine chemical principles, particularly\nwhen dealing with complex molecular structures, such as polycyclic and\nheteroaromatic compounds. In response to this challenge, we introduce a novel\ntransformer-based, template-free approach that incorporates 3D conformer data\nand spatial information. Our approach includes an Atom-align Fusion module that\nintegrates 3D positional data at the input stage, ensuring correct alignment\nbetween atom tokens and their respective 3D coordinates. Additionally, we\npropose a Distance-weighted Attention mechanism that refines the self-attention\nprocess, constricting the model s focus to relevant atom pairs in 3D space.\nExtensive experiments on the USPTO-50K dataset demonstrate that our model\noutperforms previous template-free methods, setting a new benchmark for the\nfield. A case study further highlights our method s ability to predict\nreasonable and accurate reactants.", "paper_summary_zh": "逆合成在有机合成和药物开发领域中扮演着至关重要的角色，其目标是识别出能够产生目标产物分子的合适的反应物。虽然现有的方法已经取得了显著的成功，但它们通常忽略了分子的 3D 构象细节和内部空间组织。这种疏忽使得预测符合真实化学原理的反应物变得具有挑战性，尤其是在处理复杂分子结构（例如多环和杂芳族化合物）时。为了应对这一挑战，我们引入了一种新颖的基于 Transformer 的无模板方法，该方法结合了 3D 构象数据和空间信息。我们的方法包括一个原子对齐融合模块，该模块在输入阶段集成了 3D 位置数据，确保原子标记与其各自的 3D 坐标之间正确对齐。此外，我们提出了一种距离加权注意力机制，该机制优化了自注意力过程，将模型的焦点限制在 3D 空间中的相关原子对上。在 USPTO-50K 数据集上的大量实验表明，我们的模型优于以往的无模板方法，为该领域树立了新的基准。案例研究进一步突出了我们方法预测合理且准确的反应物的能力。", "author": "Jiaxi Zhuang et.al.", "authors": "Jiaxi Zhuang, Qian Zhang, Ying Qian", "id": "2501.12434v1", "paper_url": "http://arxiv.org/abs/2501.12434v1", "repo": "null"}}