{"2502.13233": {"publish_time": "2025-02-18", "title": "SearchRAG: Can Search Engines Be Helpful for LLM-based Medical Question Answering?", "paper_summary": "Large Language Models (LLMs) have shown remarkable capabilities in general\ndomains but often struggle with tasks requiring specialized knowledge.\nConventional Retrieval-Augmented Generation (RAG) techniques typically retrieve\nexternal information from static knowledge bases, which can be outdated or\nincomplete, missing fine-grained clinical details essential for accurate\nmedical question answering. In this work, we propose SearchRAG, a novel\nframework that overcomes these limitations by leveraging real-time search\nengines. Our method employs synthetic query generation to convert complex\nmedical questions into search-engine-friendly queries and utilizes\nuncertainty-based knowledge selection to filter and incorporate the most\nrelevant and informative medical knowledge into the LLM's input. Experimental\nresults demonstrate that our method significantly improves response accuracy in\nmedical question answering tasks, particularly for complex questions requiring\ndetailed and up-to-date knowledge.", "paper_summary_zh": "大型語言模型 (LLM) 在一般領域展現出驚人的能力，但經常在需要專業知識的任務中掙扎。\n傳統的檢索增強生成 (RAG) 技術通常從靜態知識庫中檢索外部資訊，這些資訊可能過時或不完整，缺少準確回答醫療問題所需的細微臨床細節。在這項工作中，我們提出 SearchRAG，這是一種新穎的架構，透過利用即時搜尋引擎克服這些限制。我們的模型採用合成查詢生成，將複雜的醫療問題轉換成搜尋引擎友善的查詢，並利用基於不確定性的知識選擇來過濾和納入 LLM 輸入中最相關且最有資訊的醫療知識。實驗結果證明，我們的模型顯著改善了醫療問題回答任務中的回應準確度，特別是需要詳細且最新的知識的複雜問題。", "author": "Yucheng Shi et.al.", "authors": "Yucheng Shi, Tianze Yang, Canyu Chen, Quanzheng Li, Tianming Liu, Xiang Li, Ninghao Liu", "id": "2502.13233v1", "paper_url": "http://arxiv.org/abs/2502.13233v1", "repo": "null"}}