{"2405.10936": {"publish_time": "2024-05-17", "title": "A Survey on Large Language Models with Multilingualism: Recent Advances and New Frontiers", "paper_summary": "The rapid development of Large Language Models (LLMs) demonstrates remarkable\nmultilingual capabilities in natural language processing, attracting global\nattention in both academia and industry. To mitigate potential discrimination\nand enhance the overall usability and accessibility for diverse language user\ngroups, it is important for the development of language-fair technology.\nDespite the breakthroughs of LLMs, the investigation into the multilingual\nscenario remains insufficient, where a comprehensive survey to summarize recent\napproaches, developments, limitations, and potential solutions is desirable. To\nthis end, we provide a survey with multiple perspectives on the utilization of\nLLMs in the multilingual scenario. We first rethink the transitions between\nprevious and current research on pre-trained language models. Then we introduce\nseveral perspectives on the multilingualism of LLMs, including training and\ninference methods, model security, multi-domain with language culture, and\nusage of datasets. We also discuss the major challenges that arise in these\naspects, along with possible solutions. Besides, we highlight future research\ndirections that aim at further enhancing LLMs with multilingualism. The survey\naims to help the research community address multilingual problems and provide a\ncomprehensive understanding of the core concepts, key techniques, and latest\ndevelopments in multilingual natural language processing based on LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 的快速發展展示了自然語言處理中顯著的多語言能力，吸引了學術界和產業界的全球關注。為了減輕潛在的歧視並增強不同語言使用者群體的整體可用性和可及性，語言公平技術的發展非常重要。儘管 LLM 取得了突破，但對多語言場景的研究仍然不足，需要進行全面的調查來總結最近的方法、發展、限制和潛在的解決方案。為此，我們提供了一項調查，對 LLM 在多語言場景中的利用提出了多種觀點。我們首先重新思考預訓練語言模型之前和當前研究之間的轉變。然後，我們介紹了 LLM 多語言的幾個觀點，包括訓練和推理方法、模型安全性、具有語言文化的多領域以及資料集的使用。我們還討論了這些方面出現的主要挑戰以及可能的解決方案。此外，我們重點介紹了旨在進一步增強具有多語言能力的 LLM 的未來研究方向。該調查旨在幫助研究社群解決多語言問題，並提供基於 LLM 的多語言自然語言處理的核心概念、關鍵技術和最新發展的全面理解。", "author": "Kaiyu Huang et.al.", "authors": "Kaiyu Huang, Fengran Mo, Hongliang Li, You Li, Yuanchi Zhang, Weijian Yi, Yulong Mao, Jinchen Liu, Yuzhuang Xu, Jinan Xu, Jian-Yun Nie, Yang Liu", "id": "2405.10936v1", "paper_url": "http://arxiv.org/abs/2405.10936v1", "repo": "https://github.com/kaiyuhwang/mllm-survey"}}