{"2410.20926": {"publish_time": "2024-10-28", "title": "Long Sequence Modeling with Attention Tensorization: From Sequence to Tensor Learning", "paper_summary": "As the demand for processing extended textual data grows, the ability to\nhandle long-range dependencies and maintain computational efficiency is more\ncritical than ever. One of the key issues for long-sequence modeling using\nattention-based model is the mismatch between the limited-range modeling power\nof full attention and the long-range token dependency in the input sequence. In\nthis work, we propose to scale up the attention receptive field by tensorizing\nlong input sequences into compact tensor representations followed by attention\non each transformed dimension. The resulting Tensorized Attention can be\nadopted as efficient transformer backbones to extend input context length with\nimproved memory and time efficiency. We show that the proposed attention\ntensorization encodes token dependencies as a multi-hop attention process, and\nis equivalent to Kronecker decomposition of full attention. Extensive\nexperiments show that tensorized attention can be used to adapt pretrained LLMs\nwith improved efficiency. Notably, Llama-8B with tensorization is trained under\n32,768 context length and can steadily extrapolate to 128k length during\ninference with $11\\times$ speedup, compared to full attention with\nFlashAttention-2.", "paper_summary_zh": "隨著處理延伸文本資料的需求增加，處理長距離依賴關係並維持運算效率的能力比以往任何時候都更為關鍵。使用基於注意力的模型進行長序列建模的主要問題之一，在於全注意力的有限範圍建模能力與輸入序列中的長距離 token 依賴關係之間的不匹配。在這項工作中，我們建議透過將長輸入序列張量化為緊湊的張量表示，然後對每個轉換維度進行注意力，來擴充注意力感受野。由此產生的張量化注意力可以採用為高效的 Transformer 主幹，以擴充輸入上下文長度，並提高記憶體和時間效率。我們展示了所提出的注意力張量化將 token 依賴關係編碼為多跳注意力處理，並且等於全注意力的克羅內克分解。廣泛的實驗表明，張量化注意力可用於調整預訓練的 LLM，並提高效率。值得注意的是，採用張量化的 Llama-8B 在 32,768 的上下文長度下訓練，並且在推論期間可以穩定地外推到 128k 的長度，與採用 FlashAttention-2 的全注意力相比，速度提升了 $11\\times$。", "author": "Aosong Feng et.al.", "authors": "Aosong Feng, Rex Ying, Leandros Tassiulas", "id": "2410.20926v1", "paper_url": "http://arxiv.org/abs/2410.20926v1", "repo": "null"}}