{"2408.12850": {"publish_time": "2024-08-23", "title": "Multi-Faceted Question Complexity Estimation Targeting Topic Domain-Specificity", "paper_summary": "Question difficulty estimation remains a multifaceted challenge in\neducational and assessment settings. Traditional approaches often focus on\nsurface-level linguistic features or learner comprehension levels, neglecting\nthe intricate interplay of factors contributing to question complexity. This\npaper presents a novel framework for domain-specific question difficulty\nestimation, leveraging a suite of NLP techniques and knowledge graph analysis.\nWe introduce four key parameters: Topic Retrieval Cost, Topic Salience, Topic\nCoherence, and Topic Superficiality, each capturing a distinct facet of\nquestion complexity within a given subject domain. These parameters are\noperationalized through topic modelling, knowledge graph analysis, and\ninformation retrieval techniques. A model trained on these features\ndemonstrates the efficacy of our approach in predicting question difficulty. By\noperationalizing these parameters, our framework offers a novel approach to\nquestion complexity estimation, paving the way for more effective question\ngeneration, assessment design, and adaptive learning systems across diverse\nacademic disciplines.", "paper_summary_zh": "問題難度評估在教育和評量設定中仍然是一個多面向的挑戰。傳統方法通常專注於表面層次的語言特徵或學習者理解程度，忽略了導致問題複雜性的各種因素之間的複雜交互作用。本文提出了一個針對特定領域問題難度評估的新穎架構，利用了一系列自然語言處理技術和知識圖譜分析。我們引入了四個關鍵參數：主題檢索成本、主題顯著性、主題連貫性和主題表層性，每個參數都捕捉到特定主題領域內問題複雜性的不同方面。這些參數通過主題建模、知識圖譜分析和資訊檢索技術進行操作化。根據這些特徵訓練的模型證明了我們的方法在預測問題難度方面的效能。透過操作化這些參數，我們的架構提供了一個問題複雜性評估的新穎方法，為跨越不同學科的更有效問題產生、評量設計和適應性學習系統鋪平了道路。", "author": "Sujay R et.al.", "authors": "Sujay R, Suki Perumal, Yash Nagraj, Anushka Ghei, Srinivas K S", "id": "2408.12850v1", "paper_url": "http://arxiv.org/abs/2408.12850v1", "repo": "null"}}