{"2410.09012": {"publish_time": "2024-10-11", "title": "Software Engineering and Foundation Models: Insights from Industry Blogs Using a Jury of Foundation Models", "paper_summary": "Foundation models (FMs) such as large language models (LLMs) have\nsignificantly impacted many fields, including software engineering (SE). The\ninteraction between SE and FMs has led to the integration of FMs into SE\npractices (FM4SE) and the application of SE methodologies to FMs (SE4FM). While\nseveral literature surveys exist on academic contributions to these trends, we\nare the first to provide a practitioner's view. We analyze 155 FM4SE and 997\nSE4FM blog posts from leading technology companies, leveraging an FM-powered\nsurveying approach to systematically label and summarize the discussed\nactivities and tasks. We observed that while code generation is the most\nprominent FM4SE task, FMs are leveraged for many other SE activities such as\ncode understanding, summarization, and API recommendation. The majority of blog\nposts on SE4FM are about model deployment & operation, and system architecture\n& orchestration. Although the emphasis is on cloud deployments, there is a\ngrowing interest in compressing FMs and deploying them on smaller devices such\nas edge or mobile devices. We outline eight future research directions inspired\nby our gained insights, aiming to bridge the gap between academic findings and\nreal-world applications. Our study not only enriches the body of knowledge on\npractical applications of FM4SE and SE4FM but also demonstrates the utility of\nFMs as a powerful and efficient approach in conducting literature surveys\nwithin technical and grey literature domains. Our dataset, results, code and\nused prompts can be found in our online replication package at\nhttps://github.com/SAILResearch/fmse-blogs.", "paper_summary_zh": "基礎模型（FM），例如大型語言模型（LLM），已對許多領域產生重大影響，包括軟體工程（SE）。SE 與 FM 之間的互動已導致 FM 整合到 SE 實務（FM4SE）中，以及 SE 方法論應用於 FM（SE4FM）。雖然對這些趨勢的學術貢獻已有數篇文獻調查，但我們是第一個提供實務工作者的觀點。我們分析了來自領先科技公司的 155 篇 FM4SE 和 997 篇 SE4FM 部落格文章，利用 FM 驅動的調查方法來系統性地標記和總結討論的活動和任務。我們觀察到，雖然程式碼產生是最突出的 FM4SE 任務，但 FM 可用於許多其他 SE 活動，例如程式碼理解、摘要和 API 建議。大多數關於 SE4FM 的部落格文章都是關於模型部署與操作，以及系統架構與協調。儘管重點在於雲端部署，但對壓縮 FM 並將其部署在較小的裝置（例如邊緣或行動裝置）上越來越感興趣。我們根據獲得的見解概述了八個未來的研究方向，旨在彌合理論發現與實際應用之間的差距。我們的研究不僅豐富了有關 FM4SE 和 SE4FM 實際應用知識，也展示了 FM 作為在技術和灰色文獻領域進行文獻調查的強大且有效方法的效用。我們的資料集、結果、程式碼和使用的提示可以在我們的線上複製套件中找到，網址為 https://github.com/SAILResearch/fmse-blogs。", "author": "Hao Li et.al.", "authors": "Hao Li, Cor-Paul Bezemer, Ahmed E. Hassan", "id": "2410.09012v1", "paper_url": "http://arxiv.org/abs/2410.09012v1", "repo": "null"}}