{"2501.09801": {"publish_time": "2025-01-16", "title": "Conversational Text Extraction with Large Language Models Using Retrieval-Augmented Systems", "paper_summary": "This study introduces a system leveraging Large Language Models (LLMs) to\nextract text and enhance user interaction with PDF documents via a\nconversational interface. Utilizing Retrieval-Augmented Generation (RAG), the\nsystem provides informative responses to user inquiries while highlighting\nrelevant passages within the PDF. Upon user upload, the system processes the\nPDF, employing sentence embeddings to create a document-specific vector store.\nThis vector store enables efficient retrieval of pertinent sections in response\nto user queries. The LLM then engages in a conversational exchange, using the\nretrieved information to extract text and generate comprehensive, contextually\naware answers. While our approach demonstrates competitive ROUGE values\ncompared to existing state-of-the-art techniques for text extraction and\nsummarization, we acknowledge that further qualitative evaluation is necessary\nto fully assess its effectiveness in real-world applications. The proposed\nsystem gives competitive ROUGE values as compared to existing state-of-the-art\ntechniques for text extraction and summarization, thus offering a valuable tool\nfor researchers, students, and anyone seeking to efficiently extract knowledge\nand gain insights from documents through an intuitive question-answering\ninterface.", "paper_summary_zh": "本研究介紹一個系統，利用大型語言模型 (LLM) 來\n提取文字，並透過對話式介面增強使用者與 PDF 文件的互動。利用檢索增強生成 (RAG)，這個系統會提供資訊豐富的回應來回答使用者的詢問，同時也會在 PDF 中標示出相關段落。在使用者上傳後，系統會處理 PDF，使用句子嵌入來建立特定於文件向量的儲存庫。這個向量儲存庫可以在回應使用者詢問時，有效率地檢索出相關部分。LLM 接著會進行對話式的交流，使用檢索到的資訊來提取文字，並產生全面且符合脈絡的答案。雖然我們的做法展現出有競爭力的 ROUGE 值，與現有最先進的文字提取和摘要技術相比，我們承認需要進一步的定性評估，才能完整評估其在實際應用中的有效性。與現有的最先進的文字提取和摘要技術相比，所提出的系統給出有競爭力的 ROUGE 值，因此提供了一個有價值的工具，供研究人員、學生和任何尋求透過直覺式的問答介面有效率地提取知識並從文件中獲得見解的人使用。", "author": "Soham Roy et.al.", "authors": "Soham Roy, Mitul Goswami, Nisharg Nargund, Suneeta Mohanty, Prasant Kumar Pattnaik", "id": "2501.09801v1", "paper_url": "http://arxiv.org/abs/2501.09801v1", "repo": "null"}}