{"2408.14908": {"publish_time": "2024-08-27", "title": "Triplètoile: Extraction of Knowledge from Microblogging Text", "paper_summary": "Numerous methods and pipelines have recently emerged for the automatic\nextraction of knowledge graphs from documents such as scientific publications\nand patents. However, adapting these methods to incorporate alternative text\nsources like micro-blogging posts and news has proven challenging as they\nstruggle to model open-domain entities and relations, typically found in these\nsources. In this paper, we propose an enhanced information extraction pipeline\ntailored to the extraction of a knowledge graph comprising open-domain entities\nfrom micro-blogging posts on social media platforms. Our pipeline leverages\ndependency parsing and classifies entity relations in an unsupervised manner\nthrough hierarchical clustering over word embeddings. We provide a use case on\nextracting semantic triples from a corpus of 100 thousand tweets about digital\ntransformation and publicly release the generated knowledge graph. On the same\ndataset, we conduct two experimental evaluations, showing that the system\nproduces triples with precision over 95% and outperforms similar pipelines of\naround 5% in terms of precision, while generating a comparatively higher number\nof triples.", "paper_summary_zh": "近來出現許多方法和管線，可自動從科學出版物和專利等文件萃取知識圖譜。然而，將這些方法調整為納入微網誌貼文和新聞等其他文字來源已證明具有挑戰性，因為這些方法難以建構在這些來源中常見的開放領域實體和關係模型。在本文中，我們提出了一個增強型資訊萃取管線，專門用於從社群媒體平台上的微網誌貼文中萃取包含開放領域實體的知識圖譜。我們的管線利用依賴剖析，並透過詞嵌入的階層式分群，以非監督的方式分類實體關係。我們提供了一個使用案例，說明如何從 10 萬則關於數位轉型的推文語料中萃取語意三元組，並公開發布產生的知識圖譜。在同一個資料集上，我們進行了兩次實驗評估，結果顯示系統產生的三元組準確率超過 95%，且在準確率方面優於類似的管線約 5%，同時產生了數量相對較高的三元組。", "author": "Vanni Zavarella et.al.", "authors": "Vanni Zavarella, Sergio Consoli, Diego Reforgiato Recupero, Gianni Fenu, Simone Angioni, Davide Buscaldi, Danilo Dessì, Francesco Osborne", "id": "2408.14908v1", "paper_url": "http://arxiv.org/abs/2408.14908v1", "repo": "null"}}