{"2409.11123": {"publish_time": "2024-09-17", "title": "Gradient-free Post-hoc Explainability Using Distillation Aided Learnable Approach", "paper_summary": "The recent advancements in artificial intelligence (AI), with the release of\nseveral large models having only query access, make a strong case for\nexplainability of deep models in a post-hoc gradient free manner. In this\npaper, we propose a framework, named distillation aided explainability (DAX),\nthat attempts to generate a saliency-based explanation in a model agnostic\ngradient free application. The DAX approach poses the problem of explanation in\na learnable setting with a mask generation network and a distillation network.\nThe mask generation network learns to generate the multiplier mask that finds\nthe salient regions of the input, while the student distillation network aims\nto approximate the local behavior of the black-box model. We propose a joint\noptimization of the two networks in the DAX framework using the locally\nperturbed input samples, with the targets derived from input-output access to\nthe black-box model. We extensively evaluate DAX across different modalities\n(image and audio), in a classification setting, using a diverse set of\nevaluations (intersection over union with ground truth, deletion based and\nsubjective human evaluation based measures) and benchmark it with respect to\n$9$ different methods. In these evaluations, the DAX significantly outperforms\nthe existing approaches on all modalities and evaluation metrics.", "paper_summary_zh": "隨著人工智慧 (AI) 的最新進展，以及發布了幾種僅具有查詢存取權的大型模型，這為事後無梯度深度模型的可解釋性提供了強有力的論據。在本文中，我們提出了一個名為蒸餾輔助可解釋性 (DAX) 的框架，它嘗試在與模型無關的無梯度應用中產生基於顯著性的解釋。DAX 方法以可學習的設定提出了解釋問題，並使用遮罩生成網路和蒸餾網路。遮罩生成網路會學習產生倍率遮罩，以找出輸入的顯著區域，而學生蒸餾網路則旨在近似黑盒模型的局部行為。我們提出在 DAX 框架中對兩個網路進行聯合最佳化，使用局部擾動的輸入樣本，目標源自對黑盒模型的輸入輸出存取。我們在分類設定中，使用多種評估（與真實情況的交集並集、基於刪除和基於主觀人類評估的測量）廣泛評估不同模式（影像和音訊）中的 DAX，並針對 $9$ 種不同的方法對其進行評量。在這些評估中，DAX 在所有模式和評估指標上都顯著優於現有方法。", "author": "Debarpan Bhattacharya et.al.", "authors": "Debarpan Bhattacharya, Amir H. Poorjam, Deepak Mittal, Sriram Ganapathy", "id": "2409.11123v1", "paper_url": "http://arxiv.org/abs/2409.11123v1", "repo": "https://github.com/iiscleap/dax"}}