{"2410.02740": {"publish_time": "2024-10-03", "title": "Revisit Large-Scale Image-Caption Data in Pre-training Multimodal Foundation Models", "paper_summary": "Recent advancements in multimodal models highlight the value of rewritten\ncaptions for improving performance, yet key challenges remain. For example,\nwhile synthetic captions often provide superior quality and image-text\nalignment, it is not clear whether they can fully replace AltTexts: the role of\nsynthetic captions and their interaction with original web-crawled AltTexts in\npre-training is still not well understood. Moreover, different multimodal\nfoundation models may have unique preferences for specific caption formats, but\nefforts to identify the optimal captions for each model remain limited. In this\nwork, we propose a novel, controllable, and scalable captioning pipeline\ndesigned to generate diverse caption formats tailored to various multimodal\nmodels. By examining Short Synthetic Captions (SSC) towards Dense Synthetic\nCaptions (DSC+) as case studies, we systematically explore their effects and\ninteractions with AltTexts across models such as CLIP, multimodal LLMs, and\ndiffusion models. Our findings reveal that a hybrid approach that keeps both\nsynthetic captions and AltTexts can outperform the use of synthetic captions\nalone, improving both alignment and performance, with each model demonstrating\npreferences for particular caption formats. This comprehensive analysis\nprovides valuable insights into optimizing captioning strategies, thereby\nadvancing the pre-training of multimodal foundation models.", "paper_summary_zh": "多模態模型的最新進展突顯了改寫字幕在提升效能方面的價值，但仍有重要的挑戰存在。例如，儘管合成字幕通常提供優異的品質和影像文字對齊，但目前尚不清楚它們是否能完全取代 AltText：合成字幕的角色及其與原始網路爬取的 AltText 在預訓練中的互動仍未被充分理解。此外，不同的多模態基礎模型可能對特定的字幕格式有獨特的偏好，但找出每個模型最佳字幕的努力仍然有限。在這項工作中，我們提出一個新穎、可控且可擴充的字幕處理程序，旨在產生針對各種多模態模型量身打造的不同字幕格式。透過檢視簡短合成字幕 (SSC) 到密集合成字幕 (DSC+) 作為案例研究，我們系統性地探討它們對 CLIP、多模態 LLM 和擴散模型等模型中 AltText 的影響和互動。我們的研究結果顯示，保留合成字幕和 AltText 的混合方法可以優於僅使用合成字幕，同時改善對齊和效能，每個模型都展現出對特定字幕格式的偏好。這項全面的分析提供了優化字幕策略的寶貴見解，從而推動多模態基礎模型的預訓練。", "author": "Zhengfeng Lai et.al.", "authors": "Zhengfeng Lai, Vasileios Saveris, Chen Chen, Hong-You Chen, Haotian Zhang, Bowen Zhang, Juan Lao Tebar, Wenze Hu, Zhe Gan, Peter Grasch, Meng Cao, Yinfei Yang", "id": "2410.02740v1", "paper_url": "http://arxiv.org/abs/2410.02740v1", "repo": "null"}}