{"2501.09982": {"publish_time": "2025-01-17", "title": "RichSpace: Enriching Text-to-Video Prompt Space via Text Embedding Interpolation", "paper_summary": "Text-to-video generation models have made impressive progress, but they still\nstruggle with generating videos with complex features. This limitation often\narises from the inability of the text encoder to produce accurate embeddings,\nwhich hinders the video generation model. In this work, we propose a novel\napproach to overcome this challenge by selecting the optimal text embedding\nthrough interpolation in the embedding space. We demonstrate that this method\nenables the video generation model to produce the desired videos. Additionally,\nwe introduce a simple algorithm using perpendicular foot embeddings and cosine\nsimilarity to identify the optimal interpolation embedding. Our findings\nhighlight the importance of accurate text embeddings and offer a pathway for\nimproving text-to-video generation performance.", "paper_summary_zh": "文字轉影片生成模型已取得令人印象深刻的進展，但它們在生成具有複雜特徵的影片方面仍面臨挑戰。這種限制通常源於文字編碼器無法產生準確的嵌入，這會阻礙影片生成模型。在這項工作中，我們提出了一種新的方法，透過在嵌入空間中進行內插來選擇最佳文字嵌入，以克服此挑戰。我們證明了此方法使影片生成模型能夠產生所需的影片。此外，我們引入了一個使用垂直足嵌入和餘弦相似性的簡單演算法，以識別最佳內插嵌入。我們的研究結果突顯了準確文字嵌入的重要性，並提供了一條途徑來改善文字轉影片的生成效能。", "author": "Yuefan Cao et.al.", "authors": "Yuefan Cao, Chengyue Gong, Xiaoyu Li, Yingyu Liang, Zhizhou Sha, Zhenmei Shi, Zhao Song", "id": "2501.09982v1", "paper_url": "http://arxiv.org/abs/2501.09982v1", "repo": "null"}}