{"2405.15320": {"publish_time": "2024-05-24", "title": "Organic Data-Driven Approach for Turkish Grammatical Error Correction and LLMs", "paper_summary": "Grammatical Error Correction has seen significant progress with the recent\nadvancements in deep learning. As those methods require huge amounts of data,\nsynthetic datasets are being built to fill this gap. Unfortunately, synthetic\ndatasets are not organic enough in some cases and even require clean data to\nstart with. Furthermore, most of the work that has been done is focused mostly\non English. In this work, we introduce a new organic data-driven approach,\nclean insertions, to build parallel Turkish Grammatical Error Correction\ndatasets from any organic data, and to clean the data used for training Large\nLanguage Models. We achieve state-of-the-art results on two Turkish Grammatical\nError Correction test sets out of the three publicly available ones. We also\nshow the effectiveness of our method on the training losses of training\nlanguage models.", "paper_summary_zh": "語法錯誤更正已隨著深度學習的最新進展而顯著進步。由於這些方法需要大量資料，因此正在建立合成資料集以填補此差距。不幸的是，在某些情況下，合成資料集不夠自然，甚至需要從乾淨的資料開始。此外，大多數已完成的工作主要集中在英語上。在這項工作中，我們介紹了一種新的有機資料驅動方法，即乾淨插入，以從任何有機資料建立平行的土耳其語法錯誤更正資料集，並清理用於訓練大型語言模型的資料。我們在三組公開可用的資料集中，於兩組土耳其語法錯誤更正測試集中達到了最先進的結果。我們還展示了我們的方法在訓練語言模型的訓練損失上的有效性。", "author": "Asım Ersoy et.al.", "authors": "Asım Ersoy, Olcay Taner Yıldız", "id": "2405.15320v1", "paper_url": "http://arxiv.org/abs/2405.15320v1", "repo": "https://github.com/asimokby/turkish-gec"}}