{"2409.11078": {"publish_time": "2024-09-17", "title": "MonoKAN: Certified Monotonic Kolmogorov-Arnold Network", "paper_summary": "Artificial Neural Networks (ANNs) have significantly advanced various fields\nby effectively recognizing patterns and solving complex problems. Despite these\nadvancements, their interpretability remains a critical challenge, especially\nin applications where transparency and accountability are essential. To address\nthis, explainable AI (XAI) has made progress in demystifying ANNs, yet\ninterpretability alone is often insufficient. In certain applications, model\npredictions must align with expert-imposed requirements, sometimes exemplified\nby partial monotonicity constraints. While monotonic approaches are found in\nthe literature for traditional Multi-layer Perceptrons (MLPs), they still face\ndifficulties in achieving both interpretability and certified partial\nmonotonicity. Recently, the Kolmogorov-Arnold Network (KAN) architecture, based\non learnable activation functions parametrized as splines, has been proposed as\na more interpretable alternative to MLPs. Building on this, we introduce a\nnovel ANN architecture called MonoKAN, which is based on the KAN architecture\nand achieves certified partial monotonicity while enhancing interpretability.\nTo achieve this, we employ cubic Hermite splines, which guarantee monotonicity\nthrough a set of straightforward conditions. Additionally, by using positive\nweights in the linear combinations of these splines, we ensure that the network\npreserves the monotonic relationships between input and output. Our experiments\ndemonstrate that MonoKAN not only enhances interpretability but also improves\npredictive performance across the majority of benchmarks, outperforming\nstate-of-the-art monotonic MLP approaches.", "paper_summary_zh": "人工神经網路 (ANN) 透過有效辨識模式和解決複雜問題，在各個領域取得顯著進展。儘管有這些進展，其可解釋性仍然是一項重大挑戰，特別是在透明度和問責制至關重要的應用中。為了解決這個問題，可解釋 AI (XAI) 已在破解 ANN 方面取得進展，但僅有可解釋性通常是不夠的。在特定應用中，模型預測必須符合專家施加的要求，有時以部分單調性約束為例。雖然在傳統多層感知器 (MLP) 的文獻中發現了單調方法，但它們在實現可解釋性和經過認證的部分單調性方面仍然面臨困難。最近，基於可學習的激活函數參數化為樣條的 Kolmogorov-Arnold 網路 (KAN) 架構已被提出作為 MLP 的更具可解釋性的替代方案。在此基礎上，我們引入了一種稱為 MonoKAN 的新型 ANN 架構，它基於 KAN 架構，並在增強可解釋性的同時實現了經過認證的部分單調性。為達成此目的，我們採用三次 Hermite 樣條，它透過一組簡單的條件來保證單調性。此外，透過在這些樣條的線性組合中使用正權重，我們確保網路保留輸入和輸出之間的單調關係。我們的實驗表明，MonoKAN 不僅增強了可解釋性，而且還改善了大多數基準測試的預測效能，優於最先進的單調 MLP 方法。", "author": "Alejandro Polo-Molina et.al.", "authors": "Alejandro Polo-Molina, David Alfaya, Jose Portela", "id": "2409.11078v1", "paper_url": "http://arxiv.org/abs/2409.11078v1", "repo": "null"}}