{"2410.10580": {"publish_time": "2024-10-14", "title": "Multilingual Controlled Generation And Gold-Standard-Agnostic Evaluation of Code-Mixed Sentences", "paper_summary": "Code-mixing, the practice of alternating between two or more languages in an\nutterance, is a common phenomenon in multilingual communities. Due to the\ncolloquial nature of code-mixing, there is no singular correct way to translate\nan English sentence into a code-mixed sentence. For this reason, standard\nn-gram-based MT evaluation metrics such as the BLEU score are not appropriate\nfor code-mixed evaluation. To demonstrate this, we propose a novel method for\ncode-mixed text generation: Controlled Generation, which parameterizes the\ncode-mixing degree (CMD) and enables the generation of multiple semantically\nequivalent code-mixed sentences from a given English sentence. We introduce a\nrobust new evaluation metric: GAME: A Gold-Standard Agnostic Measure for\nEvaluation of Code-Mixed Sentences. GAME is both language-agnostic and\ngold-standard-agnostic, i.e. unlike other metrics, GAME does not require\ngold-standard code-mixed sentences for evaluation, thus eliminating the need\nfor human annotators in the code-mixed evaluation process. When used to\nevaluate semantically equivalent code-mixed sentences, we find that GAME scores\nhave a lower standard deviation than BLEU scores. Further, we create and\nrelease a dataset containing gold-standard code-mixed sentences across 4\nlanguage pairs: English-{Hindi, Bengali, French, Spanish} to encourage more\ncomputational research on code-mixing.", "paper_summary_zh": "<paragraph>在多語系社群中，代碼混合是一種常見現象，意指在言語表達中交替使用兩種或多種語言。由於代碼混合的口語本質，並沒有一種正確的方法可以將英文句子翻譯成代碼混合句子。因此，標準的 n-gram 基於 MT 評估指標，例如 BLEU 分數，並不適用於代碼混合評估。為了證明這一點，我們提出了一種新的代碼混合文本生成方法：受控生成，它參數化了代碼混合程度 (CMD)，並能夠從給定的英文句子生成多個語義等價的代碼混合句子。我們引入了一個強大的新評估指標：GAME：一種用於評估代碼混合句子的金標準不可知度量。GAME 既與語言無關，也與金標準無關，亦即與其他指標不同，GAME 在評估時不需要金標準代碼混合句子，從而消除了代碼混合評估過程中對人工註解者的需求。當用於評估語義等價的代碼混合句子時，我們發現 GAME 分數的標準差低於 BLEU 分數。此外，我們創建並發布了一個包含 4 種語言對的金標準代碼混合句子的資料集：英語-{印地語、孟加拉語、法語、西班牙語}，以鼓勵更多關於代碼混合的計算研究。</paragraph>", "author": "Ayushman Gupta et.al.", "authors": "Ayushman Gupta, Akhil Bhogal, Kripabandhu Ghosh", "id": "2410.10580v1", "paper_url": "http://arxiv.org/abs/2410.10580v1", "repo": "null"}}