{"2406.16995": {"publish_time": "2024-06-24", "title": "A large language model for predicting T cell receptor-antigen binding specificity", "paper_summary": "The human immune response depends on the binding of T-cell receptors (TCRs)\nto antigens (pTCR), which elicits the T cells to eliminate viruses, tumor\ncells, and other pathogens. The ability of human immunity system responding to\nunknown viruses and bacteria stems from the TCR diversity. However, this vast\ndiversity poses challenges on the TCR-antigen binding prediction methods. In\nthis study, we propose a Masked Language Model (MLM), referred to as tcrLM, to\novercome limitations in model generalization. Specifically, we randomly masked\nsequence segments and train tcrLM to infer the masked segment, thereby extract\nexpressive feature from TCR sequences. Meanwhile, we introduced virtual\nadversarial training techniques to enhance the model's robustness. We built the\nlargest TCR CDR3 sequence dataset to date (comprising 2,277,773,840 residuals),\nand pre-trained tcrLM on this dataset. Our extensive experimental results\ndemonstrate that tcrLM achieved AUC values of 0.937 and 0.933 on independent\ntest sets and external validation sets, respectively, which remarkably\noutperformed four previously published prediction methods. On a large-scale\nCOVID-19 pTCR binding test set, our method outperforms the current\nstate-of-the-art method by at least 8%, highlighting the generalizability of\nour method. Furthermore, we validated that our approach effectively predicts\nimmunotherapy response and clinical outcomes on a clinical cohorts. These\nfindings clearly indicate that tcrLM exhibits significant potential in\npredicting antigenic immunogenicity.", "paper_summary_zh": "人體免疫反應取決於 T 細胞受體 (TCR) 與抗原 (pTCR) 的結合，這會引發 T 細胞消除病毒、腫瘤細胞和其他病原體。人體免疫系統對未知病毒和細菌做出反應的能力源於 TCR 的多樣性。然而，這種廣泛的多樣性對 TCR-抗原結合預測方法提出了挑戰。在這項研究中，我們提出了一個稱為 tcrLM 的遮罩語言模型 (MLM)，以克服模型概括中的限制。具體來說，我們隨機遮罩序列片段並訓練 tcrLM 推斷遮罩片段，從而從 TCR 序列中提取表達特徵。同時，我們引入了虛擬對抗訓練技術來增強模型的魯棒性。我們建立了迄今為止最大的 TCR CDR3 序列數據集（包含 2,277,773,840 個殘基），並在該數據集上預訓練了 tcrLM。我們廣泛的實驗結果表明，tcrLM 在獨立測試集和外部驗證集上分別實現了 0.937 和 0.933 的 AUC 值，這顯著優於四種先前發表的預測方法。在一個大規模的 COVID-19 pTCR 結合測試集中，我們的模型比當前最先進的模型至少高出 8%，突出了我們模型的概括性。此外，我們驗證了我們的模型有效預測了臨床人群的免疫治療反應和臨床結果。這些發現明確表明 tcrLM 在預測抗原免疫原性方面具有顯著的潛力。", "author": "Xing Fang et.al.", "authors": "Xing Fang, Chenpeng Yu, Shiye Tian, Hui Liu", "id": "2406.16995v1", "paper_url": "http://arxiv.org/abs/2406.16995v1", "repo": "https://github.com/hliulab/tcrlm"}}