{"2501.17980": {"publish_time": "2025-01-29", "title": "Limits to AI Growth: The Ecological and Social Consequences of Scaling", "paper_summary": "The accelerating development and deployment of AI technologies depend on the\ncontinued ability to scale their infrastructure. This has implied increasing\namounts of monetary investment and natural resources. Frontier AI applications\nhave thus resulted in rising financial, environmental, and social costs. While\nthe factors that AI scaling depends on reach its limits, the push for its\naccelerated advancement and entrenchment continues. In this paper, we provide a\nholistic review of AI scaling using four lenses (technical, economic,\necological, and social) and review the relationships between these lenses to\nexplore the dynamics of AI growth. We do so by drawing on system dynamics\nconcepts including archetypes such as \"limits to growth\" to model the dynamic\ncomplexity of AI scaling and synthesize several perspectives. Our work maps out\nthe entangled relationships between the technical, economic, ecological and\nsocial perspectives and the apparent limits to growth. The analysis explains\nhow industry's responses to external limits enables continued (but temporary)\nscaling and how this benefits Big Tech while externalizing social and\nenvironmental damages. To avoid an \"overshoot and collapse\" trajectory, we\nadvocate for realigning priorities and norms around scaling to prioritize\nsustainable and mindful advancements.", "paper_summary_zh": "人工智能技術的加速開發和部署取決於擴展其基礎設施的持續能力。這意味著增加大量的金錢投資和自然資源。因此，前沿人工智能應用導致了財務、環境和社會成本的上升。雖然人工智能擴展依賴的因素達到其極限，但其加速推進和根深蒂固的趨勢仍在繼續。在本文中，我們使用四個視角（技術、經濟、生態和社會）對人工智能擴展進行整體評估，並回顧這些視角之間的關係，以探討人工智能增長的動態。我們通過借鑒系統動力學概念（包括「增長極限」等原型）來模擬人工智能擴展的動態複雜性，並綜合多種觀點。我們的研究闡述了技術、經濟、生態和社會觀點之間的糾纏關係以及增長的明顯極限。分析解釋了產業如何應對外部限制，從而實現持續（但暫時）擴展，以及這如何使大型科技公司受益，同時將社會和環境損害外化。為了避免「超調和崩潰」的軌跡，我們提倡重新調整優先事項和規範，圍繞擴展來優先考慮可持續和謹慎的進步。", "author": "Eshta Bhardwaj et.al.", "authors": "Eshta Bhardwaj, Rohan Alexander, Christoph Becker", "id": "2501.17980v1", "paper_url": "http://arxiv.org/abs/2501.17980v1", "repo": "null"}}