{"2501.03545": {"publish_time": "2025-01-07", "title": "Beyond Factual Accuracy: Evaluating Coverage of Diverse Factual Information in Long-form Text Generation", "paper_summary": "This paper presents ICAT, an evaluation framework for measuring coverage of\ndiverse factual information in long-form text generation. ICAT breaks down a\nlong output text into a list of atomic claims and not only verifies each claim\nthrough retrieval from a (reliable) knowledge source, but also computes the\nalignment between the atomic factual claims and various aspects expected to be\npresented in the output. We study three implementations of the ICAT framework,\neach with a different assumption on the availability of aspects and alignment\nmethod. By adopting data from the diversification task in the TREC Web Track\nand the ClueWeb corpus, we evaluate the ICAT framework. We demonstrate strong\ncorrelation with human judgments and provide comprehensive evaluation across\nmultiple state-of-the-art LLMs. Our framework further offers interpretable and\nfine-grained analysis of diversity and coverage. Its modular design allows for\neasy adaptation to different domains and datasets, making it a valuable tool\nfor evaluating the qualitative aspects of long-form responses produced by LLMs.", "paper_summary_zh": "本論文提出 ICAT，一個用於衡量長篇文字生成中多元事實資訊涵蓋範圍的評估架構。ICAT 將長篇輸出文字分解成一個原子斷言清單，並不僅透過從（可靠的）知識來源中擷取來驗證每個斷言，還計算原子事實斷言與預期會出現在輸出中的各個面向之間的對齊程度。我們研究了 ICAT 架構的三個實作，每個實作對於面向的可用性與對齊方法都有不同的假設。透過採用 TREC 網路軌跡中的多元化任務資料和 ClueWeb 語料庫，我們評估了 ICAT 架構。我們展示了與人類判斷的強相關性，並在多個最先進的 LLM 上提供了全面的評估。我們的架構進一步提供了可解釋且細緻的多元性和涵蓋範圍分析。其模組化設計允許輕鬆適應不同的領域和資料集，使其成為評估 LLM 產生的長篇回應的品質面向的寶貴工具。", "author": "Chris Samarinas et.al.", "authors": "Chris Samarinas, Alexander Krubner, Alireza Salemi, Youngwoo Kim, Hamed Zamani", "id": "2501.03545v1", "paper_url": "http://arxiv.org/abs/2501.03545v1", "repo": "null"}}