{"2410.12327": {"publish_time": "2024-10-16", "title": "Neuron-based Personality Trait Induction in Large Language Models", "paper_summary": "Large language models (LLMs) have become increasingly proficient at\nsimulating various personality traits, an important capability for supporting\nrelated applications (e.g., role-playing). To further improve this capacity, in\nthis paper, we present a neuron-based approach for personality trait induction\nin LLMs, with three major technical contributions. First, we construct\nPersonalityBench, a large-scale dataset for identifying and evaluating\npersonality traits in LLMs. This dataset is grounded in the Big Five\npersonality traits from psychology and is designed to assess the generative\ncapabilities of LLMs towards specific personality traits. Second, by leveraging\nPersonalityBench, we propose an efficient method for identifying\npersonality-related neurons within LLMs by examining the opposite aspects of a\ngiven trait. Third, we develop a simple yet effective induction method that\nmanipulates the values of these identified personality-related neurons. This\nmethod enables fine-grained control over the traits exhibited by LLMs without\ntraining and modifying model parameters. Extensive experiments validate the\nefficacy of our neuron identification and trait induction methods. Notably, our\napproach achieves comparable performance as fine-tuned models, offering a more\nefficient and flexible solution for personality trait induction in LLMs. We\nprovide access to all the mentioned resources at\nhttps://github.com/RUCAIBox/NPTI.", "paper_summary_zh": "大型語言模型 (LLM) 在模擬各種人格特質方面變得越來越熟練，這對於支援相關應用程式（例如角色扮演）來說是一項重要的能力。為了進一步提升這種能力，我們在本文中提出了一種基於神經元的 LLM 人格特質誘導方法，並有三大技術貢獻。首先，我們構建了 PersonalityBench，這是一個用於識別和評估 LLM 中人格特質的大規模資料集。此資料集以心理學中的五大性格特質為基礎，旨在評估 LLM 對特定人格特質的生成能力。其次，透過利用 PersonalityBench，我們提出了一種有效的方法，透過檢視特定特質的相反面向來識別 LLM 中與人格相關的神經元。第三，我們開發了一種簡單但有效的方法，用於調整這些已識別與人格相關的神經元的值。這種方法可以在不訓練和修改模型參數的情況下，精細地控制 LLM 所表現出的特質。廣泛的實驗驗證了我們的神經元識別和特質誘導方法的效能。值得注意的是，我們的做法達到了與微調模型相當的效能，為 LLM 中的人格特質誘導提供了更有效率且更靈活的解決方案。我們在 https://github.com/RUCAIBox/NPTI 提供所有上述資源的存取權。", "author": "Jia Deng et.al.", "authors": "Jia Deng, Tianyi Tang, Yanbin Yin, Wenhao Yang, Wayne Xin Zhao, Ji-Rong Wen", "id": "2410.12327v1", "paper_url": "http://arxiv.org/abs/2410.12327v1", "repo": "null"}}