{"2409.16751": {"publish_time": "2024-09-25", "title": "E-SQL: Direct Schema Linking via Question Enrichment in Text-to-SQL", "paper_summary": "Translating Natural Language Queries into Structured Query Language\n(Text-to-SQL or NLQ-to-SQL) is a critical task extensively studied by both the\nnatural language processing and database communities, aimed at providing a\nnatural language interface to databases (NLIDB) and lowering the barrier for\nnon-experts. Despite recent advancements made through the use of Large Language\nModels (LLMs), significant challenges remain. These include handling complex\ndatabase schemas, resolving ambiguity in user queries, and generating SQL\nqueries with intricate structures that accurately reflect the user's intent. In\nthis work, we introduce E-SQL, a novel pipeline specifically designed to\naddress these challenges through direct schema linking and candidate predicate\naugmentation. E-SQL enhances the natural language query by incorporating\nrelevant database items (i.e., tables, columns, and values) and conditions\ndirectly into the question, bridging the gap between the query and the database\nstructure. The pipeline leverages candidate predicate augmentation to mitigate\nerroneous or incomplete predicates in generated SQLs. We further investigate\nthe impact of schema filtering, a technique widely explored in previous work,\nand demonstrate its diminishing returns when applied alongside advanced large\nlanguage models. Comprehensive evaluations on the BIRD benchmark illustrate\nthat E-SQL achieves competitive performance, particularly excelling in complex\nqueries with a 66.29% execution accuracy on the test set. All code required to\nreproduce the reported results is publicly available on our GitHub repository.", "paper_summary_zh": "將自然語言查詢轉換為結構化查詢語言（文本轉 SQL 或 NLQ 轉 SQL）是一項重要的任務，自然語言處理和資料庫社群廣泛研究，旨在提供資料庫的自然語言介面（NLIDB），並降低非專家的門檻。儘管透過使用大型語言模型（LLM）取得了最近的進展，但仍有重大挑戰。這些挑戰包括處理複雜的資料庫架構、解決使用者查詢中的歧義，以及產生精細結構的 SQL 查詢，以準確反映使用者的意圖。在這項工作中，我們介紹了 E-SQL，這是一個專門設計用於透過直接架構連結和候選謂詞擴充來解決這些挑戰的新穎管道。E-SQL 透過將相關資料庫項目（即表格、欄位和值）和條件直接納入問題中，來增強自然語言查詢，縮小查詢和資料庫結構之間的差距。該管道利用候選謂詞擴充來減輕產生 SQL 中錯誤或不完整的謂詞。我們進一步探討了架構過濾的影響，這是一種在先前工作中廣泛探討的技術，並證明當與先進的大型語言模型一起應用時，它的報酬遞減。在 BIRD 基準上的全面評估表明，E-SQL 達到了競爭力的效能，特別是在複雜查詢中，在測試集中執行準確度為 66.29%。重現報告結果所需的所有程式碼都公開在我們的 GitHub 儲存庫中。", "author": "Hasan Alp Caferoğlu et.al.", "authors": "Hasan Alp Caferoğlu, Özgür Ulusoy", "id": "2409.16751v1", "paper_url": "http://arxiv.org/abs/2409.16751v1", "repo": "https://github.com/HasanAlpCaferoglu/E-SQL"}}