{"2502.02544": {"publish_time": "2025-02-04", "title": "Addressing Label Shift in Distributed Learning via Entropy Regularization", "paper_summary": "We address the challenge of minimizing true risk in multi-node distributed\nlearning. These systems are frequently exposed to both inter-node and\nintra-node label shifts, which present a critical obstacle to effectively\noptimizing model performance while ensuring that data remains confined to each\nnode. To tackle this, we propose the Versatile Robust Label Shift (VRLS)\nmethod, which enhances the maximum likelihood estimation of the test-to-train\nlabel density ratio. VRLS incorporates Shannon entropy-based regularization and\nadjusts the density ratio during training to better handle label shifts at the\ntest time. In multi-node learning environments, VRLS further extends its\ncapabilities by learning and adapting density ratios across nodes, effectively\nmitigating label shifts and improving overall model performance. Experiments\nconducted on MNIST, Fashion MNIST, and CIFAR-10 demonstrate the effectiveness\nof VRLS, outperforming baselines by up to 20% in imbalanced settings. These\nresults highlight the significant improvements VRLS offers in addressing label\nshifts. Our theoretical analysis further supports this by establishing\nhigh-probability bounds on estimation errors.", "paper_summary_zh": "我們解決了在多節點分布式學習中最小化真實風險的挑戰。這些系統經常同時受到節點間和節點內標籤轉移的影響，這對有效最佳化模型效能並確保資料僅限於每個節點構成了關鍵障礙。為了解決這個問題，我們提出了通用穩健標籤轉移 (VRLS) 方法，它增強了測試與訓練標籤密度比的最大似然估計。VRLS 結合了基於香農熵的正則化，並在訓練期間調整密度比，以便在測試時更好地處理標籤轉移。在多節點學習環境中，VRLS 進一步擴展其功能，透過學習和調整節點間的密度比，有效減輕標籤轉移並改善整體模型效能。在 MNIST、Fashion MNIST 和 CIFAR-10 上進行的實驗證明了 VRLS 的有效性，在不平衡的設定中，其效能比基準高出 20%。這些結果突出了 VRLS 在解決標籤轉移方面提供的顯著改進。我們的理論分析進一步支持了這一點，方法是建立估計誤差的高機率界限。", "author": "Zhiyuan Wu et.al.", "authors": "Zhiyuan Wu, Changkyu Choi, Xiangcheng Cao, Volkan Cevher, Ali Ramezani-Kebrya", "id": "2502.02544v1", "paper_url": "http://arxiv.org/abs/2502.02544v1", "repo": "null"}}