{"2407.08473": {"publish_time": "2024-07-11", "title": "Natural language is not enough: Benchmarking multi-modal generative AI for Verilog generation", "paper_summary": "Natural language interfaces have exhibited considerable potential in the\nautomation of Verilog generation derived from high-level specifications through\nthe utilization of large language models, garnering significant attention.\nNevertheless, this paper elucidates that visual representations contribute\nessential contextual information critical to design intent for hardware\narchitectures possessing spatial complexity, potentially surpassing the\nefficacy of natural-language-only inputs. Expanding upon this premise, our\npaper introduces an open-source benchmark for multi-modal generative models\ntailored for Verilog synthesis from visual-linguistic inputs, addressing both\nsingular and complex modules. Additionally, we introduce an open-source visual\nand natural language Verilog query language framework to facilitate efficient\nand user-friendly multi-modal queries. To evaluate the performance of the\nproposed multi-modal hardware generative AI in Verilog generation tasks, we\ncompare it with a popular method that relies solely on natural language. Our\nresults demonstrate a significant accuracy improvement in the multi-modal\ngenerated Verilog compared to queries based solely on natural language. We hope\nto reveal a new approach to hardware design in the large-hardware-design-model\nera, thereby fostering a more diversified and productive approach to hardware\ndesign.", "paper_summary_zh": "自然語言介面在透過利用大型語言模型，從高階規格中自動生成 Verilog 上展現出相當的潛力，並因此獲得大量的關注。然而，本論文闡明了視覺表徵提供了對硬體架構設計意圖至關重要的背景資訊，其空間複雜性可能超越僅使用自然語言輸入的效能。本論文在這個前提下進一步延伸，介紹了一個開放原始碼基準，用於針對視覺語言輸入進行 Verilog 合成的多模式生成模型，並同時處理單一和複雜的模組。此外，我們還介紹了一個開放原始碼的視覺和自然語言 Verilog 查詢語言架構，以利進行有效且使用者友善的多模式查詢。為了評估所提出的多模式硬體生成 AI 在 Verilog 生成任務中的效能，我們將其與一種僅依賴自然語言的熱門方法進行比較。我們的結果顯示，與僅基於自然語言的查詢相比，多模式生成的 Verilog 在準確性上有顯著的提升。我們希望在大型硬體設計模型時代揭示硬體設計的新方法，從而促進更多元化且高生產力的硬體設計方法。", "author": "Kaiyan Chang et.al.", "authors": "Kaiyan Chang, Zhirong Chen, Yunhao Zhou, Wenlong Zhu, kun wang, Haobo Xu, Cangyuan Li, Mengdi Wang, Shengwen Liang, Huawei Li, Yinhe Han, Ying Wang", "id": "2407.08473v1", "paper_url": "http://arxiv.org/abs/2407.08473v1", "repo": "https://github.com/aichipdesign/chipgptv"}}