{"2412.18293": {"publish_time": "2024-12-24", "title": "MinsStudio: A Streamlined Package for Minecraft AI Agent Development", "paper_summary": "Minecraft has emerged as a valuable testbed for embodied intelligence and\nsequential decision-making research, yet the development and validation of\nnovel agents remains hindered by significant engineering challenges. This paper\npresents MineStudio, an open-source software package designed to streamline\nembodied policy development in Minecraft. MineStudio represents the first\ncomprehensive integration of seven critical engineering components: simulator,\ndata, model, offline pretraining, online finetuning, inference, and benchmark,\nthereby allowing users to concentrate their efforts on algorithm innovation. We\nprovide a user-friendly API design accompanied by comprehensive documentation\nand tutorials. The complete codebase is publicly available at\nhttps://github.com/CraftJarvis/MineStudio.", "paper_summary_zh": "Minecraft 已成為具象智能和序貫決策研究的寶貴測試平台，但新代理的開發和驗證仍受到重大工程挑戰的阻礙。本文介紹 MineStudio，這是一個開源軟體套件，旨在簡化 Minecraft 中具象政策的開發。MineStudio 代表了七個關鍵工程組件的首次全面整合：模擬器、資料、模型、離線預訓練、線上微調、推論和基準，從而使用戶能夠將精力集中在演算法創新上。我們提供使用者友善的 API 設計，並附有全面的文件和教學課程。完整的程式碼庫可在 https://github.com/CraftJarvis/MineStudio 公開取得。", "author": "Shaofei Cai et.al.", "authors": "Shaofei Cai, Zhancun Mu, Kaichen He, Bowei Zhang, Xinyue Zheng, Anji Liu, Yitao Liang", "id": "2412.18293v1", "paper_url": "http://arxiv.org/abs/2412.18293v1", "repo": "https://github.com/craftjarvis/minestudio"}}