{"2407.05688": {"publish_time": "2024-07-08", "title": "Learning with Alignments: Tackling the Inter- and Intra-domain Shifts for Cross-multidomain Facial Expression Recognition", "paper_summary": "Facial Expression Recognition (FER) holds significant importance in\nhuman-computer interactions. Existing cross-domain FER methods often transfer\nknowledge solely from a single labeled source domain to an unlabeled target\ndomain, neglecting the comprehensive information across multiple sources.\nNevertheless, cross-multidomain FER (CMFER) is very challenging for (i) the\ninherent inter-domain shifts across multiple domains and (ii) the intra-domain\nshifts stemming from the ambiguous expressions and low inter-class\ndistinctions. In this paper, we propose a novel Learning with Alignments CMFER\nframework, named LA-CMFER, to handle both inter- and intra-domain shifts.\nSpecifically, LA-CMFER is constructed with a global branch and a local branch\nto extract features from the full images and local subtle expressions,\nrespectively. Based on this, LA-CMFER presents a dual-level inter-domain\nalignment method to force the model to prioritize hard-to-align samples in\nknowledge transfer at a sample level while gradually generating a\nwell-clustered feature space with the guidance of class attributes at a cluster\nlevel, thus narrowing the inter-domain shifts. To address the intra-domain\nshifts, LA-CMFER introduces a multi-view intra-domain alignment method with a\nmulti-view clustering consistency constraint where a prediction similarity\nmatrix is built to pursue consistency between the global and local views, thus\nrefining pseudo labels and eliminating latent noise. Extensive experiments on\nsix benchmark datasets have validated the superiority of our LA-CMFER.", "paper_summary_zh": "人臉表情辨識 (FER) 在人機互動中至關重要。現有的跨領域 FER 方法通常僅從單一標籤來源領域傳輸知識到未標籤的目標領域，忽略了跨多個來源的綜合資訊。儘管如此，跨多領域 FER (CMFER) 對於 (i) 多個領域之間固有的領域間轉移和 (ii) 來自模稜兩可的表情和低類間區別的領域內轉移來說非常具有挑戰性。在本文中，我們提出了一個名為 LA-CMFER 的新穎學習對齊 CMFER 框架，以處理領域間和領域內轉移。具體來說，LA-CMFER 由一個全局分支和一個局部分支構建，分別從完整影像和局部細微表情中提取特徵。基於此，LA-CMFER 提出了一種雙層次領域間對齊方法，以強制模型在知識傳輸中優先考慮難以對齊的樣本，同時在類別屬性的指導下逐漸生成一個群集良好的特徵空間，從而縮小領域間轉移。為了解決領域內轉移，LA-CMFER 引入了一個具有多視角群集一致性約束的多視角領域內對齊方法，其中建立了一個預測相似性矩陣來追求全局和局部視角之間的一致性，從而優化偽標籤並消除潛在雜訊。在六個基準資料集上的大量實驗驗證了我們 LA-CMFER 的優越性。", "author": "Yuxiang Yang et.al.", "authors": "Yuxiang Yang, Lu Wen, Xinyi Zeng, Yuanyuan Xu, Xi Wu, Jiliu Zhou, Yan Wang", "id": "2407.05688v1", "paper_url": "http://arxiv.org/abs/2407.05688v1", "repo": "null"}}