{"2411.16053": {"publish_time": "2024-11-25", "title": "UnitedVLN: Generalizable Gaussian Splatting for Continuous Vision-Language Navigation", "paper_summary": "Vision-and-Language Navigation (VLN), where an agent follows instructions to\nreach a target destination, has recently seen significant advancements. In\ncontrast to navigation in discrete environments with predefined trajectories,\nVLN in Continuous Environments (VLN-CE) presents greater challenges, as the\nagent is free to navigate any unobstructed location and is more vulnerable to\nvisual occlusions or blind spots. Recent approaches have attempted to address\nthis by imagining future environments, either through predicted future visual\nimages or semantic features, rather than relying solely on current\nobservations. However, these RGB-based and feature-based methods lack intuitive\nappearance-level information or high-level semantic complexity crucial for\neffective navigation. To overcome these limitations, we introduce a novel,\ngeneralizable 3DGS-based pre-training paradigm, called UnitedVLN, which enables\nagents to better explore future environments by unitedly rendering\nhigh-fidelity 360 visual images and semantic features. UnitedVLN employs two\nkey schemes: search-then-query sampling and separate-then-united rendering,\nwhich facilitate efficient exploitation of neural primitives, helping to\nintegrate both appearance and semantic information for more robust navigation.\nExtensive experiments demonstrate that UnitedVLN outperforms state-of-the-art\nmethods on existing VLN-CE benchmarks.", "paper_summary_zh": "視覺和語言導航 (VLN) 讓代理人遵循指示前往目標目的地，最近有了顯著的進展。與具有預定義軌跡的離散環境中的導航相比，連續環境中的 VLN (VLN-CE) 提出更大的挑戰，因為代理人可以自由導航任何無障礙位置，並且更容易受到視覺遮擋或盲點的影響。最近的方法嘗試通過想像未來的環境（透過預測未來的視覺影像或語義特徵）來解決這個問題，而不是僅依賴目前的觀察。然而，這些基於 RGB 和基於特徵的方法缺乏有效的導航所需的直觀外觀層級資訊或高層級語義複雜性。為了克服這些限制，我們引入了一個新穎、可概括的基於 3DGS 的預訓練範例，稱為 UnitedVLN，它使代理人能夠透過統一呈現高保真 360 視覺影像和語義特徵來更好地探索未來的環境。UnitedVLN 採用兩個關鍵方案：先搜尋再查詢的抽樣和先分開再統一的呈現，這有助於有效利用神經基元，幫助整合外觀和語義資訊以進行更穩健的導航。廣泛的實驗證明，UnitedVLN 在現有的 VLN-CE 基準上優於最先進的方法。", "author": "Guangzhao Dai et.al.", "authors": "Guangzhao Dai, Jian Zhao, Yuantao Chen, Yusen Qin, Hao Zhao, Guosen Xie, Yazhou Yao, Xiangbo Shu, Xuelong Li", "id": "2411.16053v1", "paper_url": "http://arxiv.org/abs/2411.16053v1", "repo": "null"}}