{"2408.08105": {"publish_time": "2024-08-15", "title": "Multimodal Causal Reasoning Benchmark: Challenging Vision Large Language Models to Infer Causal Links Between Siamese Images", "paper_summary": "Large Language Models (LLMs) have showcased exceptional ability in causal\nreasoning from textual information. However, will these causalities remain\nstraightforward for Vision Large Language Models (VLLMs) when only visual hints\nare provided? Motivated by this, we propose a novel Multimodal Causal Reasoning\nbenchmark, namely MuCR, to challenge VLLMs to infer semantic cause-and-effect\nrelationship when solely relying on visual cues such as action, appearance,\nclothing, and environment. Specifically, we introduce a prompt-driven image\nsynthesis approach to create siamese images with embedded semantic causality\nand visual cues, which can effectively evaluate VLLMs' causal reasoning\ncapabilities. Additionally, we develop tailored metrics from multiple\nperspectives, including image-level match, phrase-level understanding, and\nsentence-level explanation, to comprehensively assess VLLMs' comprehension\nabilities. Our extensive experiments reveal that the current state-of-the-art\nVLLMs are not as skilled at multimodal causal reasoning as we might have hoped.\nFurthermore, we perform a comprehensive analysis to understand these models'\nshortcomings from different views and suggest directions for future research.\nWe hope MuCR can serve as a valuable resource and foundational benchmark in\nmultimodal causal reasoning research. The project is available at:\nhttps://github.com/Zhiyuan-Li-John/MuCR", "paper_summary_zh": "大型語言模型 (LLM) 已展現出從文字資訊進行因果推理的非凡能力。然而，當僅提供視覺提示時，這些因果關係對於視覺大型語言模型 (VLLM) 來說是否仍然直截了當？受此啟發，我們提出了一個新穎的多模態因果推理基準，即 MuCR，以挑戰 VLLM 在僅依賴動作、外觀、服裝和環境等視覺線索時推斷語義因果關係。具體來說，我們引入了一個提示驅動的影像合成方法，以建立具有嵌入式語義因果關係和視覺線索的連體影像，這可以有效評估 VLLM 的因果推理能力。此外，我們從多個角度開發了量身定制的指標，包括影像層級比對、詞組層級理解和句子層級解釋，以全面評估 VLLM 的理解能力。我們廣泛的實驗表明，當前最先進的 VLLM 在多模態因果推理方面並不如我們所希望的那麼熟練。此外，我們進行了全面的分析，以從不同的觀點了解這些模型的缺點，並提出未來研究的方向。我們希望 MuCR 能夠作為多模態因果推理研究中一個有價值的資源和基礎基準。此專案可在以下網址取得：\nhttps://github.com/Zhiyuan-Li-John/MuCR", "author": "Zhiyuan Li et.al.", "authors": "Zhiyuan Li, Heng Wang, Dongnan Liu, Chaoyi Zhang, Ao Ma, Jieting Long, Weidong Cai", "id": "2408.08105v1", "paper_url": "http://arxiv.org/abs/2408.08105v1", "repo": "https://github.com/zhiyuan-li-john/mucr"}}