{"2405.14055": {"publish_time": "2024-05-22", "title": "How Many Bytes Can You Take Out Of Brain-To-Text Decoding?", "paper_summary": "Brain-computer interfaces have promising medical and scientific applications\nfor aiding speech and studying the brain. In this work, we propose an\ninformation-based evaluation metric for brain-to-text decoders. Using this\nmetric, we examine two methods to augment existing state-of-the-art continuous\ntext decoders. We show that these methods, in concert, can improve brain\ndecoding performance by upwards of 40% when compared to a baseline model. We\nfurther examine the informatic properties of brain-to-text decoders and show\nempirically that they have Zipfian power law dynamics. Finally, we provide an\nestimate for the idealized performance of an fMRI-based text decoder. We\ncompare this idealized model to our current model, and use our\ninformation-based metric to quantify the main sources of decoding error. We\nconclude that a practical brain-to-text decoder is likely possible given\nfurther algorithmic improvements.", "paper_summary_zh": "腦機介面在輔助說話和研究大腦方面具有很有前景的醫療和科學應用。在這項工作中，我們提出了一個基於資訊的評估指標，用於腦對文字的解碼器。使用此指標，我們探討了兩種方法來擴充現有的最先進的連續文字解碼器。我們表明，這些方法協同作用，與基準模型相比，可以將腦解碼性能提高 40% 以上。我們進一步探討了腦對文字解碼器的資訊特性，並憑經驗表明它們具有齊夫定律動態。最後，我們提供了基於 fMRI 的文字解碼器的理想化性能估計。我們將這個理想化的模型與我們目前的模型進行比較，並使用我們基於資訊的指標量化解碼錯誤的主要來源。我們得出結論，如果進一步改進演算法，實用的腦對文字解碼器很可能實現。", "author": "Richard Antonello et.al.", "authors": "Richard Antonello, Nihita Sarma, Jerry Tang, Jiaru Song, Alexander Huth", "id": "2405.14055v1", "paper_url": "http://arxiv.org/abs/2405.14055v1", "repo": "null"}}