{"2406.02349": {"publish_time": "2024-06-04", "title": "CADE: Cosine Annealing Differential Evolution for Spiking Neural Network", "paper_summary": "Spiking neural networks (SNNs) have gained prominence for their potential in\nneuromorphic computing and energy-efficient artificial intelligence, yet\noptimizing them remains a formidable challenge for gradient-based methods due\nto their discrete, spike-based computation. This paper attempts to tackle the\nchallenges by introducing Cosine Annealing Differential Evolution (CADE),\ndesigned to modulate the mutation factor (F) and crossover rate (CR) of\ndifferential evolution (DE) for the SNN model, i.e., Spiking Element Wise (SEW)\nResNet. Extensive empirical evaluations were conducted to analyze CADE. CADE\nshowed a balance in exploring and exploiting the search space, resulting in\naccelerated convergence and improved accuracy compared to existing\ngradient-based and DE-based methods. Moreover, an initialization method based\non a transfer learning setting was developed, pretraining on a source dataset\n(i.e., CIFAR-10) and fine-tuning the target dataset (i.e., CIFAR-100), to\nimprove population diversity. It was found to further enhance CADE for SNN.\nRemarkably, CADE elevates the performance of the highest accuracy SEW model by\nan additional 0.52 percentage points, underscoring its effectiveness in\nfine-tuning and enhancing SNNs. These findings emphasize the pivotal role of a\nscheduler for F and CR adjustment, especially for DE-based SNN. Source Code on\nGithub: https://github.com/Tank-Jiang/CADE4SNN.", "paper_summary_zh": "<paragraph>脈衝神經網路 (SNN) 因其在神經形態運算和節能人工智能的潛力而備受矚目，但由於其離散的脈衝式運算，對梯度方法而言，最佳化它們仍然是一項艱鉅的挑戰。本文嘗試透過引進餘弦退火差分演化 (CADE) 來應對這些挑戰，CADE 旨在調整差分演化 (DE) 的變異因子 (F) 和交叉率 (CR)，以用於 SNN 模型，即脈衝元素級 (SEW) ResNet。我們進行了廣泛的實證評估以分析 CADE。CADE 在探索和開發搜尋空間方面表現出平衡，與現有的基於梯度和基於 DE 的方法相比，加速了收斂速度並提高了準確度。此外，開發了一種基於遷移學習設定的初始化方法，在源資料集（即 CIFAR-10）上進行預訓練，並微調目標資料集（即 CIFAR-100），以提高族群多樣性。發現這進一步增強了 SNN 的 CADE。值得注意的是，CADE 將最高準確度 SEW 模型的效能提升了額外的 0.52 個百分點，突顯了其在微調和增強 SNN 方面的有效性。這些發現強調了調度器在調整 F 和 CR 中的關鍵作用，特別是對於基於 DE 的 SNN。Github 上的原始碼：https://github.com/Tank-Jiang/CADE4SNN。</paragraph>", "author": "Runhua Jiang et.al.", "authors": "Runhua Jiang, Guodong Du, Shuyang Yu, Yifei Guo, Sim Kuan Goh, Ho-Kin Tang", "id": "2406.02349v1", "paper_url": "http://arxiv.org/abs/2406.02349v1", "repo": "https://github.com/tank-jiang/cade4snn"}}