{"2405.20967": {"publish_time": "2024-05-31", "title": "Superlatives in Context: Explicit and Implicit Domain Restrictions for Superlative Frames", "paper_summary": "Superlatives are used to single out elements with a maximal/minimal property.\nSemantically, superlatives perform a set comparison: something (or some things)\nhas the min/max property out of a set. As such, superlatives provide an ideal\nphenomenon for studying implicit phenomena and discourse restrictions. While\nthis comparison set is often not explicitly defined, its (implicit)\nrestrictions can be inferred from the discourse context the expression appears\nin. In this work we provide an extensive computational study on the semantics\nof superlatives. We propose a unified account of superlative semantics which\nallows us to derive a broad-coverage annotation schema. Using this unified\nschema we annotated a multi-domain dataset of superlatives and their semantic\ninterpretations. We specifically focus on interpreting implicit or ambiguous\nsuperlative expressions, by analyzing how the discourse context restricts the\nset of interpretations. In a set of experiments we then analyze how well models\nperform at variations of predicting superlative semantics, with and without\ncontext. We show that the fine-grained semantics of superlatives in context can\nbe challenging for contemporary models, including GPT-4.", "paper_summary_zh": "最高级用于挑选具有最大/最小属性的元素。\n语义上，最高级执行集合比较：某物（或某些事物）\n在集合中具有最小/最大属性。因此，最高级为研究隐含现象和话语限制提供了理想现象。虽然\n此比较集合通常未明确定义，但其（隐含的）\n限制可以从表达式出现的语篇上下文中推断出来。在这项工作中，我们对语义\n最高级进行了广泛的计算研究。我们提出了一个统一的最高级语义说明，它\n使我们能够推导出广泛覆盖的注释模式。使用此统一\n模式，我们注释了一个包含最高级及其语义的多域数据集\n解释。我们特别专注于解释隐含或模棱两可的\n最高级表达式，通过分析语篇上下文如何限制\n解释集。在一组实验中，我们随后分析了模型\n在预测最高级语义的变体中执行得如何，有和没有\n上下文。我们表明，上下文中最高级的细粒度语义对当代模型来说可能具有挑战性，包括 GPT-4。", "author": "Valentina Pyatkin et.al.", "authors": "Valentina Pyatkin, Bonnie Webber, Ido Dagan, Reut Tsarfaty", "id": "2405.20967v1", "paper_url": "http://arxiv.org/abs/2405.20967v1", "repo": "null"}}