{"2412.19031": {"publish_time": "2024-12-26", "title": "Repository Structure-Aware Training Makes SLMs Better Issue Resolver", "paper_summary": "Language models have been applied to various software development tasks, but\nthe performance varies according to the scale of the models. Large Language\nModels (LLMs) outperform Small Language Models (SLMs) in complex tasks like\nrepository-level issue resolving, but raise concerns about privacy and cost. In\ncontrast, SLMs are more accessible but under-perform in complex tasks. In this\npaper, we introduce ReSAT (Repository Structure-Aware Training), construct\ntraining data based on a large number of issues and corresponding pull requests\nfrom open-source communities to enhance the model's understanding of repository\nstructure and issue resolving ability. We construct two types of training data:\n(1) localization training data, a multi-level progressive localization data to\nimprove code understanding and localization capability; (2) code edit training\ndata, which improves context-based code editing capability. The evaluation\nresults on SWE-Bench-verified and RepoQA demonstrate that ReSAT effectively\nenhances SLMs' issue-resolving and repository-level long-context understanding\ncapabilities.", "paper_summary_zh": "語言模型已應用於各種軟體開發任務，但效能會根據模型的規模而有所不同。大型語言模型 (LLM) 在複雜任務中優於小型語言模型 (SLM)，例如儲存庫層級問題解決，但引發了對隱私和成本的擔憂。相反地，SLM 更容易取得，但在複雜任務中的表現較差。在本文中，我們介紹 ReSAT（儲存庫結構感知訓練），根據大量問題和來自開源社群的對應拉取請求建構訓練資料，以增強模型對儲存庫結構和問題解決能力的理解。我們建構了兩種類型的訓練資料：(1) 本地化訓練資料，一種多層級漸進式本地化資料，以改善程式碼理解和本地化能力；(2) 程式碼編輯訓練資料，可改善基於內容的程式碼編輯能力。在 SWE-Bench 驗證和 RepoQA 上的評估結果證明，ReSAT 有效地增強了 SLM 的問題解決和儲存庫層級長內容理解能力。", "author": "Zexiong Ma et.al.", "authors": "Zexiong Ma, Shengnan An, Zeqi Lin, Yanzhen Zou, Bing Xie", "id": "2412.19031v1", "paper_url": "http://arxiv.org/abs/2412.19031v1", "repo": "null"}}