{"2406.09612": {"publish_time": "2024-06-13", "title": "Automated Molecular Concept Generation and Labeling with Large Language Models", "paper_summary": "Artificial intelligence (AI) is significantly transforming scientific\nresearch. Explainable AI methods, such as concept-based models (CMs), are\npromising for driving new scientific discoveries because they make predictions\nbased on meaningful concepts and offer insights into the prediction process. In\nmolecular science, however, explainable CMs are not as common compared to\nblack-box models like Graph Neural Networks (GNNs), primarily due to their\nrequirement for predefined concepts and manual label for each instance, which\ndemand domain knowledge and can be labor-intensive. This paper introduces a\nnovel framework for Automated Molecular Concept (AutoMolCo) generation and\nlabeling. AutoMolCo leverages the knowledge in Large Language Models (LLMs) to\nautomatically generate predictive molecular concepts and label them for each\nmolecule. Such procedures are repeated through iterative interactions with LLMs\nto refine concepts, enabling simple linear models on the refined concepts to\noutperform GNNs and LLM in-context learning on several benchmarks. The whole\nAutoMolCo framework is automated without any human knowledge inputs in either\nconcept generation, labeling, or refinement, thereby surpassing the limitations\nof extant CMs while maintaining their explainability and allowing easy\nintervention. Through systematic experiments on MoleculeNet and High-Throughput\nExperimentation (HTE) datasets, we demonstrate that the AutoMolCo-induced\nexplainable CMs are beneficial and promising for molecular science research.", "paper_summary_zh": "人工智慧（AI）正在顯著地轉變科學研究。可解釋的 AI 方法，例如基於概念的模型（CM），對於推動新的科學發現很有希望，因為它們根據有意義的概念進行預測，並提供對預測過程的見解。然而，在分子科學中，可解釋的 CM 並不像圖神經網路（GNN）這樣的黑箱模型那麼常見，這主要是由於它們需要預定義的概念和每個實例的手動標籤，這需要領域知識並且可能需要大量人工。本文介紹了一個用於自動分子概念（AutoMolCo）生成和標籤的全新框架。AutoMolCo 利用大語言模型（LLM）中的知識自動生成預測分子概念並為每個分子標記它們。此類程序通過與 LLM 的反覆交互來重複，以優化概念，使基於優化概念的簡單線性模型在幾個基準上優於 GNN 和 LLM 的上下文學習。整個 AutoMolCo 框架是自動化的，在概念生成、標記或優化中都沒有任何人工知識輸入，從而超越了現有 CM 的限制，同時保持了它們的可解釋性並允許輕鬆干預。通過對 MoleculeNet 和高通量實驗（HTE）數據集進行系統的實驗，我們證明了 AutoMolCo 誘導的可解釋 CM 對分子科學研究是有益且有希望的。", "author": "Shichang Zhang et.al.", "authors": "Shichang Zhang, Botao Xia, Zimin Zhang, Qianli Wu, Fang Sun, Ziniu Hu, Yizhou Sun", "id": "2406.09612v1", "paper_url": "http://arxiv.org/abs/2406.09612v1", "repo": "null"}}