{"2405.09980": {"publish_time": "2024-05-16", "title": "FinTextQA: A Dataset for Long-form Financial Question Answering", "paper_summary": "Accurate evaluation of financial question answering (QA) systems necessitates\na comprehensive dataset encompassing diverse question types and contexts.\nHowever, current financial QA datasets lack scope diversity and question\ncomplexity. This work introduces FinTextQA, a novel dataset for long-form\nquestion answering (LFQA) in finance. FinTextQA comprises 1,262 high-quality,\nsource-attributed QA pairs extracted and selected from finance textbooks and\ngovernment agency websites.Moreover, we developed a Retrieval-Augmented\nGeneration (RAG)-based LFQA system, comprising an embedder, retriever,\nreranker, and generator. A multi-faceted evaluation approach, including human\nranking, automatic metrics, and GPT-4 scoring, was employed to benchmark the\nperformance of different LFQA system configurations under heightened noisy\nconditions. The results indicate that: (1) Among all compared generators,\nBaichuan2-7B competes closely with GPT-3.5-turbo in accuracy score; (2) The\nmost effective system configuration on our dataset involved setting the\nembedder, retriever, reranker, and generator as Ada2, Automated Merged\nRetrieval, Bge-Reranker-Base, and Baichuan2-7B, respectively; (3) models are\nless susceptible to noise after the length of contexts reaching a specific\nthreshold.", "paper_summary_zh": "準確評估財務問答 (QA) 系統需要一個包含各種問題類型和背景的綜合資料集。然而，當前的財務 QA 資料集缺乏範圍的多樣性和問題的複雜性。這項工作引入了 FinTextQA，一個用於財務中的長篇問答 (LFQA) 的新穎資料集。FinTextQA 包含 1,262 個高品質、來源明確的 QA 對，從財務教科書和政府機構網站中提取和選取。此外，我們開發了一個基於檢索增強生成 (RAG) 的 LFQA 系統，包括嵌入器、檢索器、重新排序器和生成器。採用了一個多方面的評估方法，包括人工排名、自動化指標和 GPT-4 評分，用於在加強的雜訊條件下對不同 LFQA 系統組態的效能進行基準測試。結果表明：(1) 在所有比較過的生成器中，Baichuan2-7B 在準確度分數上與 GPT-3.5-turbo 競爭激烈；(2) 在我們的資料集上最有效的系統組態涉及將嵌入器、檢索器、重新排序器和生成器分別設定為 Ada2、自動合併檢索、Bge-Reranker-Base 和 Baichuan2-7B；(3) 在背景長度達到特定閾值後，模型對雜訊的影響較小。", "author": "Jian Chen et.al.", "authors": "Jian Chen, Peilin Zhou, Yining Hua, Yingxin Loh, Kehui Chen, Ziyuan Li, Bing Zhu, Junwei Liang", "id": "2405.09980v1", "paper_url": "http://arxiv.org/abs/2405.09980v1", "repo": "null"}}