{"2502.09974": {"publish_time": "2025-02-14", "title": "Has My System Prompt Been Used? Large Language Model Prompt Membership Inference", "paper_summary": "Prompt engineering has emerged as a powerful technique for optimizing large\nlanguage models (LLMs) for specific applications, enabling faster prototyping\nand improved performance, and giving rise to the interest of the community in\nprotecting proprietary system prompts. In this work, we explore a novel\nperspective on prompt privacy through the lens of membership inference. We\ndevelop Prompt Detective, a statistical method to reliably determine whether a\ngiven system prompt was used by a third-party language model. Our approach\nrelies on a statistical test comparing the distributions of two groups of model\noutputs corresponding to different system prompts. Through extensive\nexperiments with a variety of language models, we demonstrate the effectiveness\nof Prompt Detective for prompt membership inference. Our work reveals that even\nminor changes in system prompts manifest in distinct response distributions,\nenabling us to verify prompt usage with statistical significance.", "paper_summary_zh": "提示工程已成為針對特定應用最佳化大型語言模型 (LLM) 的強大技術，可實現更快速的原型製作和更佳的效能，並引起社群對保護專有系統提示的興趣。在這項工作中，我們透過成員推論的觀點探討提示隱私的新觀點。我們開發了提示偵探，這是一種統計方法，可可靠地判斷第三方語言模型是否使用了給定的系統提示。我們的做法依賴於統計檢定，比較對應於不同系統提示的兩組模型輸出的分布。透過對各種語言模型進行廣泛的實驗，我們展示了提示偵探在提示成員推論方面的有效性。我們的研究顯示，即使系統提示有微小的變更，也會在不同的回應分布中顯現，讓我們能夠以統計顯著性驗證提示使用。", "author": "Roman Levin et.al.", "authors": "Roman Levin, Valeriia Cherepanova, Abhimanyu Hans, Avi Schwarzschild, Tom Goldstein", "id": "2502.09974v1", "paper_url": "http://arxiv.org/abs/2502.09974v1", "repo": "null"}}