{"2412.09034": {"publish_time": "2024-12-12", "title": "Dialogue Language Model with Large-Scale Persona Data Engineering", "paper_summary": "Maintaining persona consistency is paramount in the application of\nopen-domain dialogue systems, as exemplified by models like ChatGPT. Despite\nsignificant advancements, the limited scale and diversity of current persona\ndialogue datasets remain challenges to achieving robust persona-consistent\ndialogue models. In this study, drawing inspiration from the success of\nlarge-scale pre-training, we introduce PPDS, an open-domain persona dialogue\nsystem that employs extensive generative pre-training on a persona dialogue\ndataset to enhance persona consistency. Specifically, we present a persona\nextraction model designed to autonomously and precisely generate vast persona\ndialogue datasets. Additionally, we unveil a pioneering persona augmentation\ntechnique to address the invalid persona bias inherent in the constructed\ndataset. Both quantitative and human evaluations consistently highlight the\nsuperior response quality and persona consistency of our proposed model,\nunderscoring its effectiveness.", "paper_summary_zh": "在開放領域對話系統的應用中，維持角色一致性至關重要，如同 ChatGPT 等模型所例證的。儘管有顯著的進展，但當前角色對話資料集的規模和多樣性有限，這仍然是實現穩健的角色一致對話模型的挑戰。在本研究中，從大規模預訓練的成功中汲取靈感，我們引入了 PPDS，這是一個開放領域角色對話系統，它採用廣泛的生成式預訓練，在角色對話資料集上增強角色一致性。具體來說，我們提出了一個角色萃取模型，旨在自主且精確地生成大量的角色對話資料集。此外，我們揭示了一種創新的角色擴充技術，以解決建構資料集中固有的無效角色偏差。定量和人工評估持續強調我們提出的模型的優異回應品質和角色一致性，強調其有效性。", "author": "Mengze Hong et.al.", "authors": "Mengze Hong, Chen Zhang, Chaotao Chen, Rongzhong Lian, Di Jiang", "id": "2412.09034v1", "paper_url": "http://arxiv.org/abs/2412.09034v1", "repo": "null"}}