{"2405.18802": {"publish_time": "2024-05-29", "title": "Enhancing Security and Privacy in Federated Learning using Update Digests and Voting-Based Defense", "paper_summary": "Federated Learning (FL) is a promising privacy-preserving machine learning\nparadigm that allows data owners to collaboratively train models while keeping\ntheir data localized. Despite its potential, FL faces challenges related to the\ntrustworthiness of both clients and servers, especially in the presence of\ncurious or malicious adversaries. In this paper, we introduce a novel framework\nnamed \\underline{\\textbf{F}}ederated \\underline{\\textbf{L}}earning with\n\\underline{\\textbf{U}}pdate \\underline{\\textbf{D}}igest (FLUD), which addresses\nthe critical issues of privacy preservation and resistance to Byzantine attacks\nwithin distributed learning environments. FLUD utilizes an innovative approach,\nthe $\\mathsf{LinfSample}$ method, allowing clients to compute the $l_{\\infty}$\nnorm across sliding windows of updates as an update digest. This digest enables\nthe server to calculate a shared distance matrix, significantly reducing the\noverhead associated with Secure Multi-Party Computation (SMPC) by three orders\nof magnitude while effectively distinguishing between benign and malicious\nupdates. Additionally, FLUD integrates a privacy-preserving, voting-based\ndefense mechanism that employs optimized SMPC protocols to minimize\ncommunication rounds. Our comprehensive experiments demonstrate FLUD's\neffectiveness in countering Byzantine adversaries while incurring low\ncommunication and runtime overhead. FLUD offers a scalable framework for secure\nand reliable FL in distributed environments, facilitating its application in\nscenarios requiring robust data management and security.", "paper_summary_zh": "联邦學習 (FL) 是一種有前途的隱私保護機器學習範例，它允許資料擁有者在保留資料本機化的同時，共同訓練模型。儘管有其潛力，FL 面臨與用戶端和伺服器可信度相關的挑戰，特別是在存在好奇或惡意攻擊者的情況下。在本文中，我們介紹了一個名為\\underline{\\textbf{F}}ederated \\underline{\\textbf{L}}earning with \\underline{\\textbf{U}}pdate \\underline{\\textbf{D}}igest (FLUD) 的新框架，它解決了在分散式學習環境中隱私保護和對抗拜占庭攻擊的關鍵問題。FLUD 利用了一種創新的方法，即 $\\mathsf{LinfSample}$ 方法，允許用戶端計算更新滑動視窗上的 $l_{\\infty}$ 範數作為更新摘要。此摘要使伺服器能夠計算共享距離矩陣，將安全多方計算 (SMPC) 相關的開銷有效減少了三個數量級，同時有效區分良性和惡意更新。此外，FLUD 整合了一個基於隱私保護的投票式防禦機制，該機制採用最佳化的 SMPC 協定來最小化通訊回合。我們的綜合實驗證明了 FLUD 在對抗拜占庭攻擊者時的有效性，同時產生低通訊和執行時間開銷。FLUD 為分散式環境中的安全且可靠的 FL 提供了一個可擴充的框架，促進其在需要強健資料管理和安全性的場景中的應用。", "author": "Wenjie Li et.al.", "authors": "Wenjie Li, Kai Fan, Jingyuan Zhang, Hui Li, Wei Yang Bryan Lim, Qiang Yang", "id": "2405.18802v1", "paper_url": "http://arxiv.org/abs/2405.18802v1", "repo": "null"}}