{"2406.07909": {"publish_time": "2024-06-12", "title": "Guiding Frame-Level CTC Alignments Using Self-knowledge Distillation", "paper_summary": "Transformer encoder with connectionist temporal classification (CTC)\nframework is widely used for automatic speech recognition (ASR). However,\nknowledge distillation (KD) for ASR displays a problem of disagreement between\nteacher-student models in frame-level alignment which ultimately hinders it\nfrom improving the student model's performance. In order to resolve this\nproblem, this paper introduces a self-knowledge distillation (SKD) method that\nguides the frame-level alignment during the training time. In contrast to the\nconventional method using separate teacher and student models, this study\nintroduces a simple and effective method sharing encoder layers and applying\nthe sub-model as the student model. Overall, our approach is effective in\nimproving both the resource efficiency as well as performance. We also\nconducted an experimental analysis of the spike timings to illustrate that the\nproposed method improves performance by reducing the alignment disagreement.", "paper_summary_zh": "連接主義時序分類 (CTC) 框架的 Transformer 編碼器廣泛用於自動語音辨識 (ASR)。然而，ASR 的知識蒸餾 (KD) 在框架層級對齊上會出現師生模型之間意見分歧的問題，最終阻礙了它提升學生模型的效能。為了解決這個問題，本文介紹了一種自我知識蒸餾 (SKD) 方法，在訓練期間引導框架層級對齊。與使用獨立師生模型的傳統方法相反，本研究介紹了一種簡單且有效的方法，共享編碼器層並將子模型應用為學生模型。總的來說，我們的做法有效地提升了資源效率和效能。我們還進行了尖峰時序的實驗分析，以說明所提出的方法透過減少對齊分歧來提升效能。", "author": "Eungbeom Kim et.al.", "authors": "Eungbeom Kim, Hantae Kim, Kyogu Lee", "id": "2406.07909v1", "paper_url": "http://arxiv.org/abs/2406.07909v1", "repo": "null"}}