{"2410.07745": {"publish_time": "2024-10-10", "title": "StepTool: A Step-grained Reinforcement Learning Framework for Tool Learning in LLMs", "paper_summary": "Despite having powerful reasoning and inference capabilities, Large Language\nModels (LLMs) still need external tools to acquire real-time information\nretrieval or domain-specific expertise to solve complex tasks, which is\nreferred to as tool learning. Existing tool learning methods primarily rely on\ntuning with expert trajectories, focusing on token-sequence learning from a\nlinguistic perspective. However, there are several challenges: 1) imitating\nstatic trajectories limits their ability to generalize to new tasks. 2) even\nexpert trajectories can be suboptimal, and better solution paths may exist. In\nthis work, we introduce StepTool, a novel step-grained reinforcement learning\nframework to improve tool learning in LLMs. It consists of two components:\nStep-grained Reward Shaping, which assigns rewards at each tool interaction\nbased on tool invocation success and its contribution to the task, and\nStep-grained Optimization, which uses policy gradient methods to optimize the\nmodel in a multi-step manner. Experimental results demonstrate that StepTool\nsignificantly outperforms existing methods in multi-step, tool-based tasks,\nproviding a robust solution for complex task environments. Codes are available\nat https://github.com/yuyq18/StepTool.", "paper_summary_zh": "儘管大型語言模型 (LLM) 擁有強大的推理和推論能力，但仍需要外部工具來獲取即時資訊檢索或特定領域的專業知識，以解決複雜任務，這被稱為工具學習。現有的工具學習方法主要依賴於專家軌跡的調整，專注於從語言學的角度進行令牌序列學習。然而，有幾個挑戰：1) 模仿靜態軌跡限制了它們泛化到新任務的能力。2) 即使是專家軌跡也可能不是最佳的，並且可能存在更好的解決方案路徑。在這項工作中，我們介紹了 StepTool，這是一個新穎的步驟化強化學習框架，用於改進 LLM 中的工具學習。它包含兩個組成部分：步驟化獎勵調整，它根據工具調用成功及其對任務的貢獻在每次工具互動時分配獎勵，以及步驟化最佳化，它使用策略梯度方法以多步驟的方式最佳化模型。實驗結果表明，StepTool 在基於工具的多步驟任務中顯著優於現有方法，為複雜任務環境提供了一個穩健的解決方案。程式碼可在 https://github.com/yuyq18/StepTool 獲得。", "author": "Yuanqing Yu et.al.", "authors": "Yuanqing Yu, Zhefan Wang, Weizhi Ma, Zhicheng Guo, Jingtao Zhan, Shuai Wang, Chuhan Wu, Zhiqiang Guo, Min Zhang", "id": "2410.07745v1", "paper_url": "http://arxiv.org/abs/2410.07745v1", "repo": "https://github.com/yuyq18/steptool"}}