{"2410.02720": {"publish_time": "2024-10-03", "title": "Curvature Diversity-Driven Deformation and Domain Alignment for Point Cloud", "paper_summary": "Unsupervised Domain Adaptation (UDA) is crucial for reducing the need for\nextensive manual data annotation when training deep networks on point cloud\ndata. A significant challenge of UDA lies in effectively bridging the domain\ngap. To tackle this challenge, we propose \\textbf{C}urvature\n\\textbf{D}iversity-Driven \\textbf{N}uclear-Norm Wasserstein \\textbf{D}omain\nAlignment (CDND). Our approach first introduces a \\textit{\\textbf{Curv}ature\nDiversity-driven Deformation \\textbf{Rec}onstruction (CurvRec)} task, which\neffectively mitigates the gap between the source and target domains by enabling\nthe model to extract salient features from semantically rich regions of a given\npoint cloud. We then propose \\textit{\\textbf{D}eformation-based\n\\textbf{N}uclear-norm \\textbf{W}asserstein \\textbf{D}iscrepancy (D-NWD)}, which\napplies the Nuclear-norm Wasserstein Discrepancy to both \\textit{deformed and\noriginal} data samples to align the source and target domains. Furthermore, we\ncontribute a theoretical justification for the effectiveness of D-NWD in\ndistribution alignment and demonstrate that it is \\textit{generic} enough to be\napplied to \\textbf{any} deformations. To validate our method, we conduct\nextensive experiments on two public domain adaptation datasets for point cloud\nclassification and segmentation tasks. Empirical experiment results show that\nour CDND achieves state-of-the-art performance by a noticeable margin over\nexisting approaches.", "paper_summary_zh": "無監督域適應 (UDA) 在訓練點雲數據上的深度網路時，對於減少廣泛手動數據標註的需求至關重要。UDA 的一大挑戰在於有效地彌合域差距。為了應對這一挑戰，我們提出了**C**urvature **D**iversity-Driven **N**uclear-Norm Wasserstein **D**omain Alignment (CDND)。我們的做法首先引入了一個**Curv**ature Diversity-driven Deformation **Rec**onstruction (CurvRec) 任務，它通過使模型能夠從給定點雲的語義豐富區域中提取顯著特徵，有效地減輕了源域和目標域之間的差距。然後我們提出了**D**eformation-based **N**uclear-norm **W**asserstein **D**iscrepancy (D-NWD)，它將核範 Wasserstein 差異應用於**變形和原始**數據樣本，以對齊源域和目標域。此外，我們為 D-NWD 在分佈對齊中的有效性提供了理論依據，並證明它足夠**通用**，可以應用於**任何**變形。為了驗證我們的模型，我們對點雲分類和分割任務的兩個公共域適應數據集進行了廣泛的實驗。實證實驗結果表明，我們的 CDND 以明顯的優勢優於現有方法，達到了最先進的性能。", "author": "Mengxi Wu et.al.", "authors": "Mengxi Wu, Hao Huang, Yi Fang, Mohammad Rostami", "id": "2410.02720v1", "paper_url": "http://arxiv.org/abs/2410.02720v1", "repo": "https://github.com/IdanAchituve/DefRec_and_PCM"}}