{"2409.18618": {"publish_time": "2024-09-27", "title": "Model-based Preference Optimization in Abstractive Summarization without Human Feedback", "paper_summary": "In abstractive summarization, the challenge of producing concise and accurate\nsummaries arises from the vast amount of information contained in the source\ndocument. Consequently, although Large Language Models (LLMs) can generate\nfluent text, they often introduce inaccuracies by hallucinating content not\nfound in the original source. While supervised fine-tuning methods that\nmaximize likelihood contribute to this issue, they do not consistently enhance\nthe faithfulness of the summaries. Preference-based optimization methods, such\nas Direct Preference Optimization (DPO), can further refine the model to align\nwith human preferences. However, these methods still heavily depend on costly\nhuman feedback. In this work, we introduce a novel and straightforward approach\ncalled Model-based Preference Optimization (MPO) to fine-tune LLMs for improved\nsummarization abilities without any human feedback. By leveraging the model's\ninherent summarization capabilities, we create a preference dataset that is\nfully generated by the model using different decoding strategies. Our\nexperiments on standard summarization datasets and various metrics demonstrate\nthat our proposed MPO significantly enhances the quality of generated summaries\nwithout relying on human feedback.", "paper_summary_zh": "在抽象摘要中，產生簡潔且準確的摘要的挑戰來自於原始文件中包含的龐大資訊量。因此，儘管大型語言模型 (LLM) 可以產生流暢的文字，但它們常常會透過幻覺化原始來源中找不到的內容來引入不準確性。雖然最大化可能性有助於解決此問題的監督微調方法，但它們並未持續增強摘要的忠實度。基於偏好的最佳化方法（例如直接偏好最佳化 (DPO)）可以進一步改善模型，以符合人類的偏好。然而，這些方法仍然高度依賴昂貴的人類回饋。在這項工作中，我們引進一種稱為基於模型的偏好最佳化 (MPO) 的新穎且直接的方法，用於微調 LLM，以在沒有任何人類回饋的情況下改善摘要能力。透過利用模型固有的摘要能力，我們建立了一個偏好資料集，該資料集完全由模型使用不同的解碼策略產生。我們在標準摘要資料集和各種指標上的實驗證明，我們提出的 MPO 大幅提升了產生摘要的品質，而無需依賴人類回饋。", "author": "Jaepill Choi et.al.", "authors": "Jaepill Choi, Kyubyung Chae, Jiwoo Song, Yohan Jo, Taesup Kim", "id": "2409.18618v1", "paper_url": "http://arxiv.org/abs/2409.18618v1", "repo": "null"}}