{"2405.06510": {"publish_time": "2024-05-10", "title": "UniDM: A Unified Framework for Data Manipulation with Large Language Models", "paper_summary": "Designing effective data manipulation methods is a long standing problem in\ndata lakes. Traditional methods, which rely on rules or machine learning\nmodels, require extensive human efforts on training data collection and tuning\nmodels. Recent methods apply Large Language Models (LLMs) to resolve multiple\ndata manipulation tasks. They exhibit bright benefits in terms of performance\nbut still require customized designs to fit each specific task. This is very\ncostly and can not catch up with the requirements of big data lake platforms.\nIn this paper, inspired by the cross-task generality of LLMs on NLP tasks, we\npave the first step to design an automatic and general solution to tackle with\ndata manipulation tasks. We propose UniDM, a unified framework which\nestablishes a new paradigm to process data manipulation tasks using LLMs. UniDM\nformalizes a number of data manipulation tasks in a unified form and abstracts\nthree main general steps to solve each task. We develop an automatic context\nretrieval to allow the LLMs to retrieve data from data lakes, potentially\ncontaining evidence and factual information. For each step, we design effective\nprompts to guide LLMs to produce high quality results. By our comprehensive\nevaluation on a variety of benchmarks, our UniDM exhibits great generality and\nstate-of-the-art performance on a wide variety of data manipulation tasks.", "paper_summary_zh": "<paragraph>在資料湖中設計有效的資料處理方法是一個長久以來的問題。傳統的方法依賴於規則或機器學習模型，需要大量的人力在訓練資料收集和調整模型上。最近的方法將大型語言模型 (LLM) 應用於解決多種資料處理任務。它們在效能方面表現出顯著的優點，但仍然需要客製化設計以符合每個特定任務。這非常昂貴，且無法趕上大資料湖平台的需求。在本文中，受 LLMs 在 NLP 任務中跨任務通用的啟發，我們踏出第一步，設計一個自動化且通用的解決方案來處理資料處理任務。我們提出 UniDM，一個統一的框架，它建立了一個新的典範，使用 LLMs 來處理資料處理任務。UniDM 以統一的形式形式化許多資料處理任務，並抽象出三個主要的步驟來解決每個任務。我們開發了一個自動化內容擷取，以允許 LLMs 從資料湖中擷取資料，其中可能包含證據和事實資訊。對於每個步驟，我們設計了有效的提示來引導 LLMs 產生高品質的結果。透過我們在各種基準上的全面評估，我們的 UniDM 在各種資料處理任務上表現出極大的通用性和最先進的效能。</paragraph>", "author": "Yichen Qian et.al.", "authors": "Yichen Qian, Yongyi He, Rong Zhu, Jintao Huang, Zhijian Ma, Haibin Wang, Yaohua Wang, Xiuyu Sun, Defu Lian, Bolin Ding, Jingren Zhou", "id": "2405.06510v1", "paper_url": "http://arxiv.org/abs/2405.06510v1", "repo": "null"}}