{"2405.20590": {"publish_time": "2024-05-31", "title": "Class-Based Time Series Data Augmentation to Mitigate Extreme Class Imbalance for Solar Flare Prediction", "paper_summary": "Time series data plays a crucial role across various domains, making it\nvaluable for decision-making and predictive modeling. Machine learning (ML) and\ndeep learning (DL) have shown promise in this regard, yet their performance\nhinges on data quality and quantity, often constrained by data scarcity and\nclass imbalance, particularly for rare events like solar flares. Data\naugmentation techniques offer a potential solution to address these challenges,\nyet their effectiveness on multivariate time series datasets remains\nunderexplored. In this study, we propose a novel data augmentation method for\ntime series data named Mean Gaussian Noise (MGN). We investigate the\nperformance of MGN compared to eight existing basic data augmentation methods\non a multivariate time series dataset for solar flare prediction, SWAN-SF,\nusing a ML algorithm for time series data, TimeSeriesSVC. The results\ndemonstrate the efficacy of MGN and highlight its potential for improving\nclassification performance in scenarios with extremely imbalanced data. Our\ntime complexity analysis shows that MGN also has a competitive computational\ncost compared to the investigated alternative methods.", "paper_summary_zh": "時序資料在各個領域中扮演著至關重要的角色，使其對於決策制定和預測模型而言極具價值。機器學習 (ML) 和深度學習 (DL) 已展現出在這方面的希望，但其效能取決於資料品質和數量，而資料稀少性和類別不平衡通常會對其造成限制，特別是對於太陽耀斑等罕見事件而言。資料擴充技術提供了解決這些挑戰的潛在方案，但其在多變量時序資料集上的有效性仍未充分探討。在本研究中，我們提出了一種名為平均高斯雜訊 (MGN) 的時序資料新資料擴充方法。我們在時序資料機器學習演算法 TimeSeriesSVC 上，針對太陽耀斑預測的多變量時序資料集 SWAN-SF，探討了 MGN 與八種現有基本資料擴充方法的效能。結果證明了 MGN 的效能，並強調了其在極度不平衡資料場景中改善分類效能的潛力。我們的時間複雜度分析顯示，與所探討的替代方法相比，MGN 也具有競爭力的運算成本。", "author": "Junzhi Wen et.al.", "authors": "Junzhi Wen, Rafal A. Angryk", "id": "2405.20590v1", "paper_url": "http://arxiv.org/abs/2405.20590v1", "repo": "null"}}