{"2410.14545": {"publish_time": "2024-10-18", "title": "Tell me what I need to know: Exploring LLM-based (Personalized) Abstractive Multi-Source Meeting Summarization", "paper_summary": "Meeting summarization is crucial in digital communication, but existing\nsolutions struggle with salience identification to generate personalized,\nworkable summaries, and context understanding to fully comprehend the meetings'\ncontent. Previous attempts to address these issues by considering related\nsupplementary resources (e.g., presentation slides) alongside transcripts are\nhindered by models' limited context sizes and handling the additional\ncomplexities of the multi-source tasks, such as identifying relevant\ninformation in additional files and seamlessly aligning it with the meeting\ncontent. This work explores multi-source meeting summarization considering\nsupplementary materials through a three-stage large language model approach:\nidentifying transcript passages needing additional context, inferring relevant\ndetails from supplementary materials and inserting them into the transcript,\nand generating a summary from this enriched transcript. Our multi-source\napproach enhances model understanding, increasing summary relevance by ~9% and\nproducing more content-rich outputs. We introduce a personalization protocol\nthat extracts participant characteristics and tailors summaries accordingly,\nimproving informativeness by ~10%. This work further provides insights on\nperformance-cost trade-offs across four leading model families, including\nedge-device capable options. Our approach can be extended to similar complex\ngenerative tasks benefitting from additional resources and personalization,\nsuch as dialogue systems and action planning.", "paper_summary_zh": "會議摘要在數位溝通中至關重要，但現有的解決方案在找出重點以產生個人化、可行的摘要，以及理解脈絡以充分理解會議內容方面面臨挑戰。先前嘗試透過考慮與逐字紀錄並列的相關補充資源（例如簡報投影片）來解決這些問題，但受到模型受限的脈絡大小以及處理多來源任務額外複雜性的阻礙，例如找出額外檔案中的相關資訊，並將其與會議內容無縫對齊。這項研究探討多來源會議摘要，透過三階段大型語言模型方法來考量補充資料：找出需要額外脈絡的逐字紀錄段落、從補充資料推論相關細節並將其插入逐字紀錄，以及從這份豐富的逐字紀錄產生摘要。我們的多來源方法增強了模型理解，將摘要相關性提升約 9%，並產生更多內容豐富的輸出。我們引進個人化協定，用來萃取參與者特徵並據此調整摘要，將資訊量提升約 10%。這項研究進一步提供關於四個主要模型系列的效能成本取捨的見解，包括邊緣裝置可用的選項。我們的做法可以延伸到從額外資源和個人化中受益的類似複雜生成任務，例如對話系統和行動計畫。", "author": "Frederic Kirstein et.al.", "authors": "Frederic Kirstein, Terry Ruas, Robert Kratel, Bela Gipp", "id": "2410.14545v1", "paper_url": "http://arxiv.org/abs/2410.14545v1", "repo": "https://github.com/FKIRSTE/emnlp2024-personalized-meeting-sum"}}