{"2405.18843": {"publish_time": "2024-05-29", "title": "Data-driven Machinery Fault Detection: A Comprehensive Review", "paper_summary": "In this era of advanced manufacturing, it's now more crucial than ever to\ndiagnose machine faults as early as possible to guarantee their safe and\nefficient operation. With the massive surge in industrial big data and\nadvancement in sensing and computational technologies, data-driven Machinery\nFault Diagnosis (MFD) solutions based on machine/deep learning approaches have\nbeen used ubiquitously in manufacturing. Timely and accurately identifying\nfaulty machine signals is vital in industrial applications for which many\nrelevant solutions have been proposed and are reviewed in many articles.\nDespite the availability of numerous solutions and reviews on MFD, existing\nworks often lack several aspects. Most of the available literature has limited\napplicability in a wide range of manufacturing settings due to their\nconcentration on a particular type of equipment or method of analysis.\nAdditionally, discussions regarding the challenges associated with implementing\ndata-driven approaches, such as dealing with noisy data, selecting appropriate\nfeatures, and adapting models to accommodate new or unforeseen faults, are\noften superficial or completely overlooked. Thus, this survey provides a\ncomprehensive review of the articles using different types of machine learning\napproaches for the detection and diagnosis of various types of machinery\nfaults, highlights their strengths and limitations, provides a review of the\nmethods used for condition-based analyses, comprehensively discusses the\navailable machinery fault datasets, introduces future researchers to the\npossible challenges they have to encounter while using these approaches for MFD\nand recommends the probable solutions to mitigate those problems. The future\nresearch prospects are also pointed out for a better understanding of the\nfield. We believe this article will help researchers and contribute to the\nfurther development of the field.", "paper_summary_zh": "<paragraph>在這個先進製造的時代，比以往任何時候都更需要盡早診斷機器故障，以確保其安全且有效地操作。隨著工業大數據的激增以及感測和計算技術的進步，基於機器/深度學習方法的數據驅動機器故障診斷 (MFD) 解决方案已廣泛用於製造業。及時準確地識別故障機器信號對於工業應用至關重要，許多相關解決方案已被提出並在許多文章中得到回顧。儘管有許多關於 MFD 的解決方案和回顧，但現有工作通常缺乏幾個方面。由於專注於特定類型的設備或分析方法，大多數現有文獻在廣泛的製造環境中的應用性有限。此外，關於實施數據驅動方法所面臨的挑戰（例如處理雜訊資料、選擇適當特徵以及調整模型以適應新的或無法預見的故障）的討論通常很膚淺或完全被忽視。因此，這項調查對使用不同類型機器學習方法來檢測和診斷各種類型機器故障的文章提供了全面的回顧，重點介紹它們的優點和缺點，回顧了用於基於條件分析的方法，全面討論了可用的機器故障數據集，向未來的研究人員介紹了在使用這些方法進行 MFD 時可能遇到的挑戰，並建議了解決這些問題的可能解決方案。未來研究前景也指出了對該領域的更深入理解。我們相信這篇文章將有助於研究人員並有助於該領域的進一步發展。</paragraph>", "author": "Dhiraj Neupane et.al.", "authors": "Dhiraj Neupane, Mohamed Reda Bouadjenek, Richard Dazeley, Sunil Aryal", "id": "2405.18843v1", "paper_url": "http://arxiv.org/abs/2405.18843v1", "repo": "null"}}