{"2410.22114": {"publish_time": "2024-10-29", "title": "Policy Gradient for Robust Markov Decision Processes", "paper_summary": "We develop a generic policy gradient method with the global optimality\nguarantee for robust Markov Decision Processes (MDPs). While policy gradient\nmethods are widely used for solving dynamic decision problems due to their\nscalable and efficient nature, adapting these methods to account for model\nambiguity has been challenging, often making it impractical to learn robust\npolicies. This paper introduces a novel policy gradient method, Double-Loop\nRobust Policy Mirror Descent (DRPMD), for solving robust MDPs. DRPMD employs a\ngeneral mirror descent update rule for the policy optimization with adaptive\ntolerance per iteration, guaranteeing convergence to a globally optimal policy.\nWe provide a comprehensive analysis of DRPMD, including new convergence results\nunder both direct and softmax parameterizations, and provide novel insights\ninto the inner problem solution through Transition Mirror Ascent (TMA).\nAdditionally, we propose innovative parametric transition kernels for both\ndiscrete and continuous state-action spaces, broadening the applicability of\nour approach. Empirical results validate the robustness and global convergence\nof DRPMD across various challenging robust MDP settings.", "paper_summary_zh": "我們開發了一種具有全局最優性\n保證的通用策略梯度方法，用於穩健馬可夫決策過程 (MDP)。雖然策略梯度\n方法由於其可擴展且高效的特性而廣泛用於解決動態決策問題，但調整這些方法以考慮模型\n模糊性一直很有挑戰性，通常使得學習穩健策略變得不切實際。本文介紹了一種新穎的策略梯度方法，雙迴路\n穩健策略鏡像下降 (DRPMD)，用於解決穩健 MDP。DRPMD 採用\n通用鏡像下降更新規則進行策略優化，每個迭代具有自適應容差，保證收斂到全局最優策略。\n我們提供了對 DRPMD 的全面分析，包括直接和 softmax 參數化下的新收斂結果，並通過轉移鏡像上升 (TMA) 提供了對內部問題解決方案的新見解。\n此外，我們針對離散和連續狀態動作空間提出了創新的參數化轉移核，擴大了\n我們方法的適用性。經驗結果驗證了 DRPMD 在各種具有挑戰性的穩健 MDP 設置中的穩健性和全局收斂性。", "author": "Qiuhao Wang et.al.", "authors": "Qiuhao Wang, Shaohang Xu, Chin Pang Ho, Marek Petrick", "id": "2410.22114v1", "paper_url": "http://arxiv.org/abs/2410.22114v1", "repo": "https://github.com/JerrisonWang/JMLR-DRPMD"}}