{"2410.19847": {"publish_time": "2024-10-21", "title": "AEPL: Automated and Editable Prompt Learning for Brain Tumor Segmentation", "paper_summary": "Brain tumor segmentation is crucial for accurate diagnosisand treatment\nplanning, but the small size and irregular shapeof tumors pose significant\nchallenges. Existing methods of-ten fail to effectively incorporate medical\ndomain knowledgesuch as tumor grade, which correlates with tumor\naggres-siveness and morphology, providing critical insights for moreaccurate\ndetection of tumor subregions during segmentation.We propose an Automated and\nEditable Prompt Learning(AEPL) framework that integrates tumor grade into the\nseg-mentation process by combining multi-task learning andprompt learning with\nautomatic and editable prompt gen-eration. Specifically, AEPL employs an\nencoder to extractimage features for both tumor-grade prediction and\nsegmen-tation mask generation. The predicted tumor grades serveas\nauto-generated prompts, guiding the decoder to produceprecise segmentation\nmasks. This eliminates the need formanual prompts while allowing clinicians to\nmanually editthe auto-generated prompts to fine-tune the segmentation,enhancing\nboth flexibility and precision. The proposed AEPLachieves state-of-the-art\nperformance on the BraTS 2018dataset, demonstrating its effectiveness and\nclinical potential.The source code can be accessed online.", "paper_summary_zh": "腦瘤分割對於準確的診斷和治療計畫至關重要，但腫瘤的體積小且形狀不規則，因此構成重大的挑戰。現有的方法往往無法有效地整合醫學領域的知識，例如腫瘤分級，這與腫瘤的惡性度和形態相關，在分割過程中提供關鍵見解，以更準確地偵測腫瘤的子區域。我們提出一個自動且可編輯的提示學習 (AEPL) 架構，透過結合多任務學習和提示學習，以及自動且可編輯的提示產生，將腫瘤分級整合到分割過程中。具體來說，AEPL 使用編碼器來萃取影像特徵，以進行腫瘤分級預測和分割遮罩產生。預測的腫瘤分級用作自動產生的提示，引導解碼器產生精確的分割遮罩。這消除了手動提示的需求，同時允許臨床醫生手動編輯自動產生的提示，以微調分割，進而提升彈性和準確度。所提出的 AEPL 在 BraTS 2018 資料集上達成最先進的效能，證明其有效性和臨床潛力。原始程式碼可以在線上取得。", "author": "Yongheng Sun et.al.", "authors": "Yongheng Sun, Mingxia Liu, Chunfeng Lian", "id": "2410.19847v1", "paper_url": "http://arxiv.org/abs/2410.19847v1", "repo": "null"}}