{"2502.15487": {"publish_time": "2025-02-21", "title": "ExpliCa: Evaluating Explicit Causal Reasoning in Large Language Models", "paper_summary": "Large Language Models (LLMs) are increasingly used in tasks requiring\ninterpretive and inferential accuracy. In this paper, we introduce ExpliCa, a\nnew dataset for evaluating LLMs in explicit causal reasoning. ExpliCa uniquely\nintegrates both causal and temporal relations presented in different linguistic\norders and explicitly expressed by linguistic connectives. The dataset is\nenriched with crowdsourced human acceptability ratings. We tested LLMs on\nExpliCa through prompting and perplexity-based metrics. We assessed seven\ncommercial and open-source LLMs, revealing that even top models struggle to\nreach 0.80 accuracy. Interestingly, models tend to confound temporal relations\nwith causal ones, and their performance is also strongly influenced by the\nlinguistic order of the events. Finally, perplexity-based scores and prompting\nperformance are differently affected by model size.", "paper_summary_zh": "大型語言模型 (LLM) 愈來愈常被用於需要詮釋和推理精確度的任務中。在本文中，我們介紹 ExpliCa，一個用於評估 LLM 明確因果推理的新資料集。ExpliCa 獨特地整合了以不同語言順序呈現的因果關係和時間關係，並由語言連接詞明確表達。該資料集豐富了群眾外包的人類可接受性評分。我們透過提示和困惑度指標在 ExpliCa 上測試了 LLM。我們評估了七個商業和開放原始碼 LLM，結果顯示即使是頂尖模型也難以達到 0.80 的準確度。有趣的是，模型傾向於將時間關係與因果關係混淆，而它們的效能也受到事件語言順序的強烈影響。最後，困惑度指標和提示效能受到模型大小的不同影響。", "author": "Martina Miliani et.al.", "authors": "Martina Miliani, Serenna Auriemma, Alessandro Bondielli, Emmanuele Chersoni, Lucia Passaro, Irene Sucameli, Alessandro Lenci", "id": "2502.15487v1", "paper_url": "http://arxiv.org/abs/2502.15487v1", "repo": "null"}}