{"2408.14338": {"publish_time": "2024-08-26", "title": "Machine Learning for Quantifier Selection in cvc5", "paper_summary": "In this work we considerably improve the state-of-the-art SMT solving on\nfirst-order quantified problems by efficient machine learning guidance of\nquantifier selection. Quantifiers represent a significant challenge for SMT and\nare technically a source of undecidability. In our approach, we train an\nefficient machine learning model that informs the solver which quantifiers\nshould be instantiated and which not. Each quantifier may be instantiated\nmultiple times and the set of the active quantifiers changes as the solving\nprogresses. Therefore, we invoke the ML predictor many times, during the whole\nrun of the solver. To make this efficient, we use fast ML models based on\ngradient boosting decision trees. We integrate our approach into the\nstate-of-the-art cvc5 SMT solver and show a considerable increase of the\nsystem's holdout-set performance after training it on a large set of\nfirst-order problems collected from the Mizar Mathematical Library.", "paper_summary_zh": "在這項工作中，我們通過有效的量詞選擇機器學習指導，大幅改進了 SMT 解決一階量化問題的最新技術。量詞代表了 SMT 的重大挑戰，並且在技術上是不可判定性的來源。在我們的做法中，我們訓練了一個有效的機器學習模型，告知求解器應該實例化哪些量詞，哪些不應該。每個量詞可以被實例化多次，並且活動量詞的集合會隨著求解進度而改變。因此，我們在求解器的整個運行過程中多次調用 ML 預測器。為了提高效率，我們使用基於梯度提升決策樹的快速 ML 模型。我們將我們的做法整合到最新技術的 cvc5 SMT 求解器中，並在從 Mizar 數學庫收集的大量一階問題上對其進行訓練後，顯示系統的留出集效能大幅提升。", "author": "Jan Jakubův et.al.", "authors": "Jan Jakubův, Mikoláš Janota, Jelle Piepenbrock, Josef Urban", "id": "2408.14338v1", "paper_url": "http://arxiv.org/abs/2408.14338v1", "repo": "null"}}