{"2412.18894": {"publish_time": "2024-12-25", "title": "Comprehensive Study on Lumbar Disc Segmentation Techniques Using MRI Data", "paper_summary": "Lumbar disk segmentation is essential for diagnosing and curing spinal\ndisorders by enabling precise detection of disk boundaries in medical imaging.\nThe advent of deep learning has resulted in the development of many\nsegmentation methods, offering differing levels of accuracy and effectiveness.\nThis study assesses the effectiveness of several sophisticated deep learning\narchitectures, including ResUnext, Ef3 Net, UNet, and TransUNet, for lumbar\ndisk segmentation, highlighting key metrics like as Pixel Accuracy, Mean\nIntersection over Union (Mean IoU), and Dice Coefficient. The findings indicate\nthat ResUnext achieved the highest segmentation accuracy, with a Pixel Accuracy\nof 0.9492 and a Dice Coefficient of 0.8425, with TransUNet following closely\nafter. Filtering techniques somewhat enhanced the performance of most models,\nparticularly Dense UNet, improving stability and segmentation quality. The\nfindings underscore the efficacy of these models in lumbar disk segmentation\nand highlight potential areas for improvement.", "paper_summary_zh": "腰椎間盤分割對於診斷和治療脊椎疾病至關重要，因為它可以在醫學影像中精確檢測椎間盤的邊界。深度學習的出現導致了許多分割方法的開發，這些方法提供了不同程度的準確性和有效性。本研究評估了幾種複雜的深度學習架構的有效性，包括 ResUnext、Ef3 Net、UNet 和 TransUNet，用於腰椎間盤分割，重點關注關鍵指標，例如像素準確度、平均聯合交集（平均 IoU）和骰子係數。研究結果表明，ResUnext 達到了最高的分割準確度，像素準確度為 0.9492，骰子係數為 0.8425，緊隨其後的是 TransUNet。過濾技術在一定程度上提高了大多數模型的性能，特別是 Dense UNet，提高了穩定性和分割質量。研究結果強調了這些模型在腰椎間盤分割中的功效，並強調了潛在的改進領域。", "author": "Serkan Salturk et.al.", "authors": "Serkan Salturk, Irem Sayin, Ibrahim Cem Balci, Taha Emre Pamukcu, Zafer Soydan, Huseyin Uvet", "id": "2412.18894v1", "paper_url": "http://arxiv.org/abs/2412.18894v1", "repo": "null"}}