{"2406.14367": {"publish_time": "2024-06-20", "title": "PoseBench: Benchmarking the Robustness of Pose Estimation Models under Corruptions", "paper_summary": "Pose estimation aims to accurately identify anatomical keypoints in humans\nand animals using monocular images, which is crucial for various applications\nsuch as human-machine interaction, embodied AI, and autonomous driving. While\ncurrent models show promising results, they are typically trained and tested on\nclean data, potentially overlooking the corruption during real-world deployment\nand thus posing safety risks in practical scenarios. To address this issue, we\nintroduce PoseBench, a comprehensive benchmark designed to evaluate the\nrobustness of pose estimation models against real-world corruption. We\nevaluated 60 representative models, including top-down, bottom-up,\nheatmap-based, regression-based, and classification-based methods, across three\ndatasets for human and animal pose estimation. Our evaluation involves 10 types\nof corruption in four categories: 1) blur and noise, 2) compression and color\nloss, 3) severe lighting, and 4) masks. Our findings reveal that\nstate-of-the-art models are vulnerable to common real-world corruptions and\nexhibit distinct behaviors when tackling human and animal pose estimation\ntasks. To improve model robustness, we delve into various design\nconsiderations, including input resolution, pre-training datasets, backbone\ncapacity, post-processing, and data augmentations. We hope that our benchmark\nwill serve as a foundation for advancing research in robust pose estimation.\nThe benchmark and source code will be released at\nhttps://xymsh.github.io/PoseBench", "paper_summary_zh": "人體姿勢估計旨在使用單眼影像準確辨識人類和動物的解剖學關鍵點，這對於人機互動、具象 AI 和自動駕駛等各種應用至關重要。雖然目前的模型顯示出有希望的結果，但它們通常在乾淨的資料上訓練和測試，可能會忽略實際部署期間的損壞，從而對實際場景中的安全構成風險。為了解決這個問題，我們引入了 PoseBench，這是一個全面的基準測試，旨在評估姿勢估計模型對真實世界損壞的穩健性。我們評估了 60 個具有代表性的模型，包括自上而下、自下而上、基於熱圖、基於回歸和基於分類的方法，涵蓋了人類和動物姿勢估計的三個資料集。我們的評估涉及四類中的 10 種類型的損壞：1) 模糊和雜訊，2) 壓縮和色彩損失，3) 嚴重照明，以及 4) 遮罩。我們的研究結果表明，最先進的模型容易受到常見的真實世界損壞，並且在處理人類和動物姿勢估計任務時表現出不同的行為。為了提高模型的穩健性，我們深入探討了各種設計考量，包括輸入解析度、預訓練資料集、主幹容量、後處理和資料擴充。我們希望我們的基準測試將作為推進穩健姿勢估計研究的基礎。基準測試和原始碼將在 https://xymsh.github.io/PoseBench 發布", "author": "Sihan Ma et.al.", "authors": "Sihan Ma, Jing Zhang, Qiong Cao, Dacheng Tao", "id": "2406.14367v1", "paper_url": "http://arxiv.org/abs/2406.14367v1", "repo": "null"}}