{"2412.09544": {"publish_time": "2024-12-12", "title": "Sail into the Headwind: Alignment via Robust Rewards and Dynamic Labels against Reward Hacking", "paper_summary": "Aligning AI systems with human preferences typically suffers from the\ninfamous reward hacking problem, where optimization of an imperfect reward\nmodel leads to undesired behaviors. In this paper, we investigate reward\nhacking in offline preference optimization, which aims to improve an initial\nmodel using a preference dataset. We identify two types of reward hacking\nstemming from statistical fluctuations in the dataset: Type I Reward Hacking\ndue to subpar choices appearing more favorable, and Type II Reward Hacking due\nto decent choices appearing less favorable. We prove that many (mainstream or\ntheoretical) preference optimization methods suffer from both types of reward\nhacking. To mitigate Type I Reward Hacking, we propose POWER, a new preference\noptimization method that combines Guiasu's weighted entropy with a robust\nreward maximization objective. POWER enjoys finite-sample guarantees under\ngeneral function approximation, competing with the best covered policy in the\ndata. To mitigate Type II Reward Hacking, we analyze the learning dynamics of\npreference optimization and develop a novel technique that dynamically updates\npreference labels toward certain \"stationary labels\", resulting in diminishing\ngradients for untrustworthy samples. Empirically, POWER with dynamic labels\n(POWER-DL) consistently outperforms state-of-the-art methods on alignment\nbenchmarks, achieving improvements of up to 13.0 points on AlpacaEval 2.0 and\n11.5 points on Arena-Hard over DPO, while also improving or maintaining\nperformance on downstream tasks such as mathematical reasoning. Strong\ntheoretical guarantees and empirical results demonstrate the promise of\nPOWER-DL in mitigating reward hacking.", "paper_summary_zh": "對齊人工智慧系統與人類偏好通常會遭遇惡名昭彰的獎勵破解問題，其中不完美的獎勵模型的最佳化會導致不想要的行為。在本論文中，我們探討離線偏好最佳化中的獎勵破解，其目標是使用偏好資料集改善初始模型。我們找出源自資料集中統計波動的兩種獎勵破解類型：由於較差的選擇看起來較有利而產生的第一型獎勵破解，以及由於較好的選擇看起來較不利而產生的第二型獎勵破解。我們證明許多（主流或理論）偏好最佳化方法都會遭遇這兩種類型的獎勵破解。為了減輕第一型獎勵破解，我們提出 POWER，這是一種結合了 Guiasu 的加權熵與穩健獎勵最大化目標的新偏好最佳化方法。POWER 在一般函數逼近下享有有限樣本保證，與資料中涵蓋最廣的政策競爭。為了減輕第二型獎勵破解，我們分析偏好最佳化的學習動態，並開發一種新技術，將偏好標籤動態更新為某些「固定標籤」，導致不可信樣本的梯度遞減。根據經驗，具有動態標籤的 POWER（POWER-DL）在對齊基準上始終優於最先進的方法，在 AlpacaEval 2.0 上的改進幅度高達 13.0 個百分點，在 Arena-Hard 上比 DPO 高 11.5 個百分點，同時也改善或維持了下游任務（例如數學推理）的效能。強大的理論保證和經驗結果證明了 POWER-DL 在減輕獎勵破解方面的潛力。", "author": "Paria Rashidinejad et.al.", "authors": "Paria Rashidinejad, Yuandong Tian", "id": "2412.09544v1", "paper_url": "http://arxiv.org/abs/2412.09544v1", "repo": "null"}}