{"2412.19168": {"publish_time": "2024-12-26", "title": "GFG -- Gender-Fair Generation: A CALAMITA Challenge", "paper_summary": "Gender-fair language aims at promoting gender equality by using terms and\nexpressions that include all identities and avoid reinforcing gender\nstereotypes. Implementing gender-fair strategies is particularly challenging in\nheavily gender-marked languages, such as Italian. To address this, the\nGender-Fair Generation challenge intends to help shift toward gender-fair\nlanguage in written communication. The challenge, designed to assess and\nmonitor the recognition and generation of gender-fair language in both mono-\nand cross-lingual scenarios, includes three tasks: (1) the detection of\ngendered expressions in Italian sentences, (2) the reformulation of gendered\nexpressions into gender-fair alternatives, and (3) the generation of\ngender-fair language in automatic translation from English to Italian. The\nchallenge relies on three different annotated datasets: the GFL-it corpus,\nwhich contains Italian texts extracted from administrative documents provided\nby the University of Brescia; GeNTE, a bilingual test set for gender-neutral\nrewriting and translation built upon a subset of the Europarl dataset; and\nNeo-GATE, a bilingual test set designed to assess the use of non-binary\nneomorphemes in Italian for both fair formulation and translation tasks.\nFinally, each task is evaluated with specific metrics: average of F1-score\nobtained by means of BERTScore computed on each entry of the datasets for task\n1, an accuracy measured with a gender-neutral classifier, and a\ncoverage-weighted accuracy for tasks 2 and 3.", "paper_summary_zh": "性別公平語言旨在透過使用包含所有身分且避免強化性別刻板印象的詞彙和表達方式來促進性別平等。在性別標記嚴重的語言（例如義大利語）中實施性別公平策略特別具有挑戰性。為了解決這個問題，性別公平生成挑戰旨在協助轉向書面溝通中的性別公平語言。該挑戰旨在評估和監控單語和跨語言情境下性別公平語言的辨識和生成，包括三項任務：(1) 義大利語句子中性別化表達式的偵測，(2) 將性別化表達式改寫成性別公平的替代方案，以及 (3) 從英語到義大利語的自動翻譯中生成性別公平語言。該挑戰依賴於三個不同的註解資料集：GFL-it 語料庫，其中包含由布雷西亞大學提供的行政文件所摘錄的義大利語文本；GeNTE，一個基於 Europarl 資料集子集建構的性別中立改寫和翻譯雙語測試集；以及 Neo-GATE，一個雙語測試集，旨在評估在公平表述和翻譯任務中使用義大利語的非二元新語素。最後，每個任務都使用特定的指標進行評估：根據在任務 1 的資料集每個條目上計算的 BERTScore 獲得的 F1 分數平均值、使用性別中立分類器測量的準確度，以及任務 2 和 3 的覆蓋加權準確度。", "author": "Simona Frenda et.al.", "authors": "Simona Frenda, Andrea Piergentili, Beatrice Savoldi, Marco Madeddu, Martina Rosola, Silvia Casola, Chiara Ferrando, Viviana Patti, Matteo Negri, Luisa Bentivogli", "id": "2412.19168v1", "paper_url": "http://arxiv.org/abs/2412.19168v1", "repo": "null"}}