{"2504.17669": {"publish_time": "2025-04-24", "title": "Towards a HIPAA Compliant Agentic AI System in Healthcare", "paper_summary": "Agentic AI systems powered by Large Language Models (LLMs) as their\nfoundational reasoning engine, are transforming clinical workflows such as\nmedical report generation and clinical summarization by autonomously analyzing\nsensitive healthcare data and executing decisions with minimal human oversight.\nHowever, their adoption demands strict compliance with regulatory frameworks\nsuch as Health Insurance Portability and Accountability Act (HIPAA),\nparticularly when handling Protected Health Information (PHI). This\nwork-in-progress paper introduces a HIPAA-compliant Agentic AI framework that\nenforces regulatory compliance through dynamic, context-aware policy\nenforcement. Our framework integrates three core mechanisms: (1)\nAttribute-Based Access Control (ABAC) for granular PHI governance, (2) a hybrid\nPHI sanitization pipeline combining regex patterns and BERT-based model to\nminimize leakage, and (3) immutable audit trails for compliance verification.", "paper_summary_zh": "以大型語言模型 (LLM) 作為基礎推理引擎的代理式 AI 系統，正透過自主分析敏感的醫療保健數據，並在最少的人工監督下執行決策，來改變醫療報告生成和臨床摘要等臨床工作流程。然而，採用這些系統需要嚴格遵守法規框架，例如《健康保險可攜性及責任法案》(HIPAA)，尤其是在處理受保護的健康資訊 (PHI) 時。這篇進行中的論文介紹了一個符合 HIPAA 規範的代理式 AI 框架，該框架透過動態的、上下文感知的策略執行來確保法規遵循性。我們的框架整合了三個核心機制：(1) 基於屬性的存取控制 (ABAC)，用於精細的 PHI 管理；(2) 結合正規表達式模式和基於 BERT 的模型的混合 PHI 清理管道，以最大限度地減少洩漏；以及 (3) 不可變的審計追蹤，用於合規性驗證。\n", "author": "Subash Neupane et.al.", "authors": "Subash Neupane, Shaswata Mitra, Sudip Mittal, Shahram Rahimi", "id": "2504.17669v1", "paper_url": "http://arxiv.org/abs/2504.17669v1", "repo": "null"}}