{"2412.10629": {"publish_time": "2024-12-14", "title": "Rapid Reconstruction of Extremely Accelerated Liver 4D MRI via Chained Iterative Refinement", "paper_summary": "Abstract Purpose: High-quality 4D MRI requires an impractically long scanning\ntime for dense k-space signal acquisition covering all respiratory phases.\nAccelerated sparse sampling followed by reconstruction enhancement is desired\nbut often results in degraded image quality and long reconstruction time. We\nhereby propose the chained iterative reconstruction network (CIRNet) for\nefficient sparse-sampling reconstruction while maintaining clinically\ndeployable quality. Methods: CIRNet adopts the denoising diffusion\nprobabilistic framework to condition the image reconstruction through a\nstochastic iterative denoising process. During training, a forward Markovian\ndiffusion process is designed to gradually add Gaussian noise to the densely\nsampled ground truth (GT), while CIRNet is optimized to iteratively reverse the\nMarkovian process from the forward outputs. At the inference stage, CIRNet\nperforms the reverse process solely to recover signals from noise, conditioned\nupon the undersampled input. CIRNet processed the 4D data (3D+t) as temporal\nslices (2D+t). The proposed framework is evaluated on a data cohort consisting\nof 48 patients (12332 temporal slices) who underwent free-breathing liver 4D\nMRI. 3-, 6-, 10-, 20- and 30-times acceleration were examined with a\nretrospective random undersampling scheme. Compressed sensing (CS)\nreconstruction with a spatiotemporal constraint and a recently proposed deep\nnetwork, Re-Con-GAN, are selected as baselines. Results: CIRNet consistently\nachieved superior performance compared to CS and Re-Con-GAN. The inference time\nof CIRNet, CS, and Re-Con-GAN are 11s, 120s, and 0.15s. Conclusion: A novel\nframework, CIRNet, is presented. CIRNet maintains useable image quality for\nacceleration up to 30 times, significantly reducing the burden of 4DMRI.", "paper_summary_zh": "<paragraph>摘要目的：高品質 4D MRI 需要極不切實際的長時間掃描，才能獲得涵蓋所有呼吸階段的密集 k 空間訊號。加速稀疏取樣後再進行重建增強固然理想，但通常會導致影像品質下降，且重建時間過長。在此，我們提出鏈式反覆重建網路 (CIRNet)，以在維持臨床可部署品質的同時，進行有效率的稀疏取樣重建。方法：CIRNet 採用去噪擴散機率架構，透過隨機反覆去噪程序，對影像重建進行條件化。在訓練期間，正向馬可夫擴散程序會逐漸將高斯雜訊加入密集取樣的真實值 (GT) 中，而 CIRNet 則最佳化，以反覆逆轉正向輸出的馬可夫程序。在推論階段，CIRNet 僅執行逆向程序，以從雜訊中復原訊號，並以欠取樣輸入為條件。CIRNet 將 4D 資料 (3D+t) 處理為時間切片 (2D+t)。所提出的架構在一個資料群組中進行評估，該群組包含 48 位接受自由呼吸肝臟 4D MRI 的患者 (12332 個時間切片)。使用回溯隨機欠取樣方案，檢查 3、6、10、20 和 30 倍加速。選擇具有時空約束的壓縮感測 (CS) 重建和最近提出的深度網路 Re-Con-GAN 作為基準。結果：與 CS 和 Re-Con-GAN 相比，CIRNet 持續獲得較佳的效能。CIRNet、CS 和 Re-Con-GAN 的推論時間分別為 11 秒、120 秒和 0.15 秒。結論：提出了一個新穎的架構 CIRNet。CIRNet 可維持可用影像品質，加速率最高達 30 倍，大幅降低 4DMRI 的負擔。</paragraph>", "author": "Di Xu et.al.", "authors": "Di Xu, Xin Miao, Hengjie Liu, Jessica E. Scholey, Wensha Yang, Mary Feng, Michael Ohliger, Hui Lin, Yi Lao, Yang Yang, Ke Sheng", "id": "2412.10629v1", "paper_url": "http://arxiv.org/abs/2412.10629v1", "repo": "null"}}