{"2407.06692": {"publish_time": "2024-07-09", "title": "Deep-Motion-Net: GNN-based volumetric organ shape reconstruction from single-view 2D projections", "paper_summary": "We propose Deep-Motion-Net: an end-to-end graph neural network (GNN)\narchitecture that enables 3D (volumetric) organ shape reconstruction from a\nsingle in-treatment kV planar X-ray image acquired at any arbitrary projection\nangle. Estimating and compensating for true anatomical motion during\nradiotherapy is essential for improving the delivery of planned radiation dose\nto target volumes while sparing organs-at-risk, and thereby improving the\ntherapeutic ratio. Achieving this using only limited imaging available during\nirradiation and without the use of surrogate signals or invasive fiducial\nmarkers is attractive. The proposed model learns the mesh regression from a\npatient-specific template and deep features extracted from kV images at\narbitrary projection angles. A 2D-CNN encoder extracts image features, and four\nfeature pooling networks fuse these features to the 3D template organ mesh. A\nResNet-based graph attention network then deforms the feature-encoded mesh. The\nmodel is trained using synthetically generated organ motion instances and\ncorresponding kV images. The latter is generated by deforming a reference CT\nvolume aligned with the template mesh, creating digitally reconstructed\nradiographs (DRRs) at required projection angles, and DRR-to-kV style\ntransferring with a conditional CycleGAN model. The overall framework was\ntested quantitatively on synthetic respiratory motion scenarios and\nqualitatively on in-treatment images acquired over full scan series for liver\ncancer patients. Overall mean prediction errors for synthetic motion test\ndatasets were 0.16$\\pm$0.13 mm, 0.18$\\pm$0.19 mm, 0.22$\\pm$0.34 mm, and\n0.12$\\pm$0.11 mm. Mean peak prediction errors were 1.39 mm, 1.99 mm, 3.29 mm,\nand 1.16 mm.", "paper_summary_zh": "<paragraph>我們提出了 Deep-Motion-Net：一種端到端圖形神經網路 (GNN) 架構，它能從任意投影角度取得的單一治療中 kV 平面 X 光影像重建 3D（體積）器官形狀。在放射治療期間估計和補償真正的解剖運動對於改善將計畫的放射劑量傳遞到目標體積，同時保護風險器官，進而改善治療比率至關重要。僅使用在放射過程中可用的有限影像，且不使用替代訊號或侵入性標記，就能達成此目標，這是很有吸引力的。所提出的模型從特定於患者的範本和從 kV 影像中提取的深度特徵學習網格回歸。2D-CNN 編碼器提取影像特徵，而四個特徵池化網路將這些特徵融合到 3D 範本器官網格中。然後，基於 ResNet 的圖形注意力網路會變形特徵編碼網格。該模型使用合成產生的器官運動實例和對應的 kV 影像進行訓練。後者是透過變形與範本網格對齊的參考 CT 體積，在所需的投影角度建立數位重建放射線照片 (DRR)，並使用條件式 CycleGAN 模型將 DRR 轉換為 kV 樣式。整體架構在合成的呼吸運動場景中經過量化測試，並在肝癌患者的完整掃描系列中獲得的治療中影像中進行質化測試。合成運動測試資料集的整體平均預測誤差為 0.16$\\pm$0.13 mm、0.18$\\pm$0.19 mm、0.22$\\pm$0.34 mm 和 0.12$\\pm$0.11 mm。平均峰值預測誤差為 1.39 mm、1.99 mm、3.29 mm 和 1.16 mm。</paragraph>", "author": "Isuru Wijesinghe et.al.", "authors": "Isuru Wijesinghe, Michael Nix, Arezoo Zakeri, Alireza Hokmabadi, Bashar Al-Qaisieh, Ali Gooya, Zeike A. Taylor", "id": "2407.06692v1", "paper_url": "http://arxiv.org/abs/2407.06692v1", "repo": "null"}}