{"2409.15865": {"publish_time": "2024-09-24", "title": "BeSimulator: A Large Language Model Powered Text-based Behavior Simulator", "paper_summary": "Traditional robot simulators focus on physical process modeling and realistic\nrendering, often suffering from high computational costs, inefficiencies, and\nlimited adaptability. To handle this issue, we propose Behavior Simulation in\nrobotics to emphasize checking the behavior logic of robots and achieving\nsufficient alignment between the outcome of robot actions and real scenarios.\nIn this paper, we introduce BeSimulator, a modular and novel LLM-powered\nframework, as an attempt towards behavior simulation in the context of\ntext-based environments. By constructing text-based virtual environments and\nperforming semantic-level simulation, BeSimulator can generalize across\nscenarios and achieve long-horizon complex simulation. Inspired by human\ncognition processes, it employs a \"consider-decide-capture-transfer\"\nmethodology, termed Chain of Behavior Simulation, which excels at analyzing\naction feasibility and state transitions. Additionally, BeSimulator\nincorporates code-driven reasoning to enable arithmetic operations and enhance\nreliability, as well as integrates reflective feedback to refine simulation.\nBased on our manually constructed behavior-tree-based simulation benchmark\nBTSIMBENCH, our experiments show a significant performance improvement in\nbehavior simulation compared to baselines, ranging from 14.7% to 26.6%.", "paper_summary_zh": "傳統機器人模擬器專注於物理程序建模和逼真的渲染，通常會面臨高運算成本、低效率和適應性有限等問題。為了處理這個問題，我們提出機器人的行為模擬，以強調檢查機器人的行為邏輯，並在機器人動作的結果和真實場景之間達成充分的一致性。在本文中，我們介紹了 BeSimulator，一個模組化且新穎的 LLM 驅動架構，作為在基於文字的環境中進行行為模擬的嘗試。透過建構基於文字的虛擬環境並執行語義層級的模擬，BeSimulator 能夠在各種場景中進行概化，並達成長時程複雜的模擬。受到人類認知過程的啟發，它採用「考慮-決定-擷取-傳輸」的方法，稱為行為模擬鏈，擅長分析動作可行性和狀態轉換。此外，BeSimulator 結合了程式碼驅動的推理，以啟用算術運算並增強可靠性，並整合反思性回饋以改善模擬。根據我們手動建構的行為樹為基礎的模擬基準 BTSIMBENCH，我們的實驗顯示，與基線相比，行為模擬的效能有顯著的提升，範圍從 14.7% 到 26.6%。", "author": "Jianan Wang et.al.", "authors": "Jianan Wang, Bin Li, Xueying Wang, Fu Li, Yunlong Wu, Juan Chen, Xiaodong Yi", "id": "2409.15865v1", "paper_url": "http://arxiv.org/abs/2409.15865v1", "repo": "null"}}