{"2412.10136": {"publish_time": "2024-12-13", "title": "Can LLMs Convert Graphs to Text-Attributed Graphs?", "paper_summary": "Graphs are ubiquitous data structures found in numerous real-world\napplications, such as drug discovery, recommender systems, and social network\nanalysis. Graph neural networks (GNNs) have become a popular tool to learn node\nembeddings through message passing on these structures. However, a significant\nchallenge arises when applying GNNs to multiple graphs with different feature\nspaces, as existing GNN architectures are not designed for cross-graph feature\nalignment. To address this, recent approaches introduce text-attributed graphs,\nwhere each node is associated with a textual description, enabling the use of a\nshared textual encoder to project nodes from different graphs into a unified\nfeature space. While promising, this method relies heavily on the availability\nof text-attributed data, which can be difficult to obtain in practice. To\nbridge this gap, we propose a novel method named Topology-Aware Node\ndescription Synthesis (TANS), which leverages large language models (LLMs) to\nautomatically convert existing graphs into text-attributed graphs. The key idea\nis to integrate topological information with each node's properties, enhancing\nthe LLMs' ability to explain how graph topology influences node semantics. We\nevaluate our TANS on text-rich, text-limited, and text-free graphs,\ndemonstrating that it enables a single GNN to operate across diverse graphs.\nNotably, on text-free graphs, our method significantly outperforms existing\napproaches that manually design node features, showcasing the potential of LLMs\nfor preprocessing graph-structured data, even in the absence of textual\ninformation. The code and data are available at\nhttps://github.com/Zehong-Wang/TANS.", "paper_summary_zh": "圖形是普遍存在於許多真實世界應用中的資料結構，例如藥物發現、推薦系統和社交網路分析。圖形神經網路 (GNN) 已成為一種流行的工具，可透過在這些結構上傳遞訊息來學習節點嵌入。然而，當將 GNN 應用於具有不同特徵空間的多個圖形時，會出現一個重大的挑戰，因為現有的 GNN 架構並非設計用於跨圖形特徵對齊。為了解決這個問題，最近的方法引入了文字屬性圖形，其中每個節點都與文字描述相關聯，從而可以使用共用文字編碼器將來自不同圖形的節點投影到統一的特徵空間中。儘管有希望，但此方法在很大程度上依賴於文字屬性資料的可用性，這在實務上可能難以取得。為了彌補這個差距，我們提出了一種名為拓撲感知節點描述合成 (TANS) 的新方法，該方法利用大型語言模型 (LLM) 將現有圖形自動轉換為文字屬性圖形。其關鍵思想是將拓撲資訊與每個節點的屬性整合在一起，增強 LLM 解釋圖形拓撲如何影響節點語義的能力。我們在文字豐富、文字受限和無文字圖形上評估我們的 TANS，證明它能讓單一 GNN 在不同的圖形中運作。值得注意的是，在無文字圖形上，我們的模型顯著優於手動設計節點特徵的現有方法，展示了 LLM 在預處理圖形結構資料方面的潛力，即使在沒有文字資訊的情況下也是如此。程式碼和資料可在 https://github.com/Zehong-Wang/TANS 取得。", "author": "Zehong Wang et.al.", "authors": "Zehong Wang, Sidney Liu, Zheyuan Zhang, Tianyi Ma, Chuxu Zhang, Yanfang Ye", "id": "2412.10136v1", "paper_url": "http://arxiv.org/abs/2412.10136v1", "repo": "https://github.com/zehong-wang/tans"}}