{"2410.08815": {"publish_time": "2024-10-11", "title": "StructRAG: Boosting Knowledge Intensive Reasoning of LLMs via Inference-time Hybrid Information Structurization", "paper_summary": "Retrieval-augmented generation (RAG) is a key means to effectively enhance\nlarge language models (LLMs) in many knowledge-based tasks. However, existing\nRAG methods struggle with knowledge-intensive reasoning tasks, because useful\ninformation required to these tasks are badly scattered. This characteristic\nmakes it difficult for existing RAG methods to accurately identify key\ninformation and perform global reasoning with such noisy augmentation. In this\npaper, motivated by the cognitive theories that humans convert raw information\ninto various structured knowledge when tackling knowledge-intensive reasoning,\nwe proposes a new framework, StructRAG, which can identify the optimal\nstructure type for the task at hand, reconstruct original documents into this\nstructured format, and infer answers based on the resulting structure.\nExtensive experiments across various knowledge-intensive tasks show that\nStructRAG achieves state-of-the-art performance, particularly excelling in\nchallenging scenarios, demonstrating its potential as an effective solution for\nenhancing LLMs in complex real-world applications.", "paper_summary_zh": "檢索增強生成 (RAG) 是一種有效提升大型語言模型 (LLM) 在許多基於知識的任務中的關鍵方法。然而，現有的 RAG 方法在知識密集型推理任務中遇到困難，因為這些任務所需的有效資訊過於分散。此特性使得現有的 RAG 方法難以準確識別關鍵資訊，並對如此雜訊增強執行全域推理。在本文中，受到人類在處理知識密集型推理時會將原始資訊轉換為各種結構化知識的認知理論啟發，我們提出了一個新的架構 StructRAG，它可以識別任務中的最佳結構類型，將原始文件重建成此結構化格式，並根據結果結構推斷答案。在各種知識密集型任務中的廣泛實驗顯示，StructRAG 達到最先進的效能，特別是在具挑戰性的場景中表現優異，證明了其作為一種有效解決方案的潛力，可增強複雜現實世界應用中的 LLM。", "author": "Zhuoqun Li et.al.", "authors": "Zhuoqun Li, Xuanang Chen, Haiyang Yu, Hongyu Lin, Yaojie Lu, Qiaoyu Tang, Fei Huang, Xianpei Han, Le Sun, Yongbin Li", "id": "2410.08815v1", "paper_url": "http://arxiv.org/abs/2410.08815v1", "repo": "null"}}