{"2405.07883": {"publish_time": "2024-05-13", "title": "Zero-Shot Tokenizer Transfer", "paper_summary": "Language models (LMs) are bound to their tokenizer, which maps raw text to a\nsequence of vocabulary items (tokens). This restricts their flexibility: for\nexample, LMs trained primarily on English may still perform well in other\nnatural and programming languages, but have vastly decreased efficiency due to\ntheir English-centric tokenizer. To mitigate this, we should be able to swap\nthe original LM tokenizer with an arbitrary one, on the fly, without degrading\nperformance. Hence, in this work we define a new problem: Zero-Shot Tokenizer\nTransfer (ZeTT). The challenge at the core of ZeTT is finding embeddings for\nthe tokens in the vocabulary of the new tokenizer. Since prior heuristics for\ninitializing embeddings often perform at chance level in a ZeTT setting, we\npropose a new solution: we train a hypernetwork taking a tokenizer as input and\npredicting the corresponding embeddings. We empirically demonstrate that the\nhypernetwork generalizes to new tokenizers both with encoder (e.g., XLM-R) and\ndecoder LLMs (e.g., Mistral-7B). Our method comes close to the original models'\nperformance in cross-lingual and coding tasks while markedly reducing the\nlength of the tokenized sequence. We also find that the remaining gap can be\nquickly closed by continued training on less than 1B tokens. Finally, we show\nthat a ZeTT hypernetwork trained for a base (L)LM can also be applied to\nfine-tuned variants without extra training. Overall, our results make\nsubstantial strides toward detaching LMs from their tokenizer.", "paper_summary_zh": "語言模型 (LM) 受限於其分詞器，它將原始文字對應到詞彙項目（標記）的序列。這限制了其靈活性：例如，主要以英語訓練的 LM 仍可能在其他自然語言和程式語言中表現良好，但由於其以英語為中心的標記器而大幅降低效率。為了減輕這個問題，我們應該能夠在不降低效能的情況下，隨時將原始 LM 標記器替換為任意標記器。因此，在這項工作中，我們定義了一個新問題：零次標記器轉移 (ZeTT)。ZeTT 的核心挑戰是為新標記器詞彙中的標記找到嵌入。由於用於初始化嵌入的先驗啟發法在 ZeTT 設定中通常表現得像隨機層級，我們提出了一個新的解決方案：我們訓練一個以標記器作為輸入並預測對應嵌入的超網路。我們透過實證證明，超網路可以概括到新的標記器，包括編碼器 (例如 XLM-R) 和解碼器 LLM (例如 Mistral-7B)。我們的模型在跨語言和編碼任務中接近原始模型的效能，同時顯著減少標記化序列的長度。我們還發現，透過持續訓練不到 1B 個標記，可以快速縮小剩下的差距。最後，我們展示了針對基礎 (L)LM 訓練的 ZeTT 超網路也可以應用於微調變體，而無需額外訓練。總的來說，我們的成果在將 LM 從其標記器中分離出來方面取得了重大進展。", "author": "Benjamin Minixhofer et.al.", "authors": "Benjamin Minixhofer, Edoardo Maria Ponti, Ivan Vulić", "id": "2405.07883v1", "paper_url": "http://arxiv.org/abs/2405.07883v1", "repo": "null"}}