{"2501.05749": {"publish_time": "2025-01-10", "title": "Bridging Dialects: Translating Standard Bangla to Regional Variants Using Neural Models", "paper_summary": "The Bangla language includes many regional dialects, adding to its cultural\nrichness. The translation of Bangla Language into regional dialects presents a\nchallenge due to significant variations in vocabulary, pronunciation, and\nsentence structure across regions like Chittagong, Sylhet, Barishal, Noakhali,\nand Mymensingh. These dialects, though vital to local identities, lack of\nrepresentation in technological applications. This study addresses this gap by\ntranslating standard Bangla into these dialects using neural machine\ntranslation (NMT) models, including BanglaT5, mT5, and mBART50. The work is\nmotivated by the need to preserve linguistic diversity and improve\ncommunication among dialect speakers. The models were fine-tuned using the\n\"Vashantor\" dataset, containing 32,500 sentences across various dialects, and\nevaluated through Character Error Rate (CER) and Word Error Rate (WER) metrics.\nBanglaT5 demonstrated superior performance with a CER of 12.3% and WER of\n15.7%, highlighting its effectiveness in capturing dialectal nuances. The\noutcomes of this research contribute to the development of inclusive language\ntechnologies that support regional dialects and promote linguistic diversity.", "paper_summary_zh": "孟加拉語包含許多地區方言，增加了其文化豐富度。由於吉大港、錫爾赫特、巴里薩爾、諾阿卡利和邁門辛等地區的詞彙、發音和句子結構存在顯著差異，因此將孟加拉語翻譯成地區方言是一個挑戰。儘管這些方言對當地認同至關重要，但在技術應用中卻缺乏代表性。本研究通過使用神經機器翻譯 (NMT) 模型（包括 BanglaT5、mT5 和 mBART50）將標準孟加拉語翻譯成這些方言，從而解決了這一差距。這項工作的動機是需要保留語言多樣性和改善方言使用者之間的溝通。使用包含各種方言的 32,500 個句子的「Vashantor」數據集對模型進行微調，並通過字元錯誤率 (CER) 和詞彙錯誤率 (WER) 指標進行評估。BanglaT5 表現出優異的性能，CER 為 12.3%，WER 為 15.7%，突顯了其在捕捉方言細微差別方面的有效性。本研究的成果有助於開發支持地區方言和促進語言多樣性的包容性語言技術。", "author": "Md. Arafat Alam Khandaker et.al.", "authors": "Md. Arafat Alam Khandaker, Ziyan Shirin Raha, Bidyarthi Paul, Tashreef Muhammad", "id": "2501.05749v1", "paper_url": "http://arxiv.org/abs/2501.05749v1", "repo": "null"}}