{"2503.11511": {"publish_time": "2025-03-14", "title": "Alzheimer's Disease Classification Using Retinal OCT: TransnetOCT and Swin Transformer Models", "paper_summary": "Retinal optical coherence tomography (OCT) images are the biomarkers for\nneurodegenerative diseases, which are rising in prevalence. Early detection of\nAlzheimer's disease using retinal OCT is a primary challenging task. This work\nutilizes advanced deep learning techniques to classify retinal OCT images of\nsubjects with Alzheimer's disease (AD) and healthy controls (CO). The goal is\nto enhance diagnostic capabilities through efficient image analysis. In the\nproposed model, Raw OCT images have been preprocessed with ImageJ and given to\nvarious deep-learning models to evaluate the accuracy. The best classification\narchitecture is TransNetOCT, which has an average accuracy of 98.18% for input\nOCT images and 98.91% for segmented OCT images for five-fold cross-validation\ncompared to other models, and the Swin Transformer model has achieved an\naccuracy of 93.54%. The evaluation accuracy metric demonstrated TransNetOCT and\nSwin transformer models capability to classify AD and CO subjects reliably,\ncontributing to the potential for improved diagnostic processes in clinical\nsettings.", "paper_summary_zh": "<paragraph>視網膜光學相干斷層掃描 (OCT) 影像是神經退化性疾病的生物標記，而這類疾病的盛行率正在上升。使用視網膜 OCT 影像早期檢測阿茲海默症是一項主要的挑戰性任務。這項工作利用先進的深度學習技術來分類阿茲海默症 (AD) 患者和健康對照組 (CO) 的視網膜 OCT 影像。目標是透過有效的影像分析來增強診斷能力。在提出的模型中，原始 OCT 影像已使用 ImageJ 進行預處理，並提供給各種深度學習模型以評估準確性。最佳的分類架構是 TransNetOCT，與其他模型相比，它在五折交叉驗證中，輸入 OCT 影像的平均準確度為 98.18%，分段 OCT 影像的平均準確度為 98.91%；而 Swin Transformer 模型的準確度則達到了 93.54%。評估準確度指標證明了 TransNetOCT 和 Swin Transformer 模型能夠可靠地分類 AD 和 CO 受試者，有助於提升臨床環境中診斷流程的潛力。</paragraph>\n", "author": "Siva Manohar Reddy Kesu et.al.", "authors": "Siva Manohar Reddy Kesu, Neelam Sinha, Hariharan Ramasangu, Thomas Gregor Issac", "id": "2503.11511v1", "paper_url": "http://arxiv.org/abs/2503.11511v1", "repo": "null"}}