{"2412.11642": {"publish_time": "2024-12-16", "title": "Introduction to AI Planning", "paper_summary": "These are notes for lectures presented at the University of Stuttgart that\nprovide an introduction to key concepts and techniques in AI Planning.\nArtificial Intelligence Planning, also known as Automated Planning, emerged\nsomewhere in 1966 from the need to give autonomy to a wheeled robot. Since\nthen, it has evolved into a flourishing research and development discipline,\noften associated with scheduling. Over the decades, various approaches to\nplanning have been developed with characteristics that make them appropriate\nfor specific tasks and applications. Most approaches represent the world as a\nstate within a state transition system; then the planning problem becomes that\nof searching a path in the state space from the current state to one which\nsatisfies the goals of the user. The notes begin by introducing the state model\nand move on to exploring classical planning, the foundational form of planning,\nand present fundamental algorithms for solving such problems. Subsequently, we\nexamine planning as a constraint satisfaction problem, outlining the mapping\nprocess and describing an approach to solve such problems. The most extensive\nsection is dedicated to Hierarchical Task Network (HTN) planning, one of the\nmost widely used and powerful planning techniques in the field. The lecture\nnotes end with a bonus chapter on the Planning Domain Definition (PDDL)\nLanguage, the de facto standard syntax for representing non-hierarchical\nplanning problems.", "paper_summary_zh": "這些是斯圖加特大學演講的筆記，其中介紹了 AI 規劃中的關鍵概念和技術。人工智慧規劃，也稱為自動化規劃，於 1966 年出現在賦予輪式機器人自主性的需求中。自那時起，它已演變成一個蓬勃發展的研究和開發學科，通常與排程相關。數十年來，已經開發出各種規劃方法，其特點使其適用於特定任務和應用。大多數方法將世界表示為狀態轉換系統中的狀態；然後，規劃問題變成了在狀態空間中從當前狀態搜索一條路徑到滿足使用者目標的狀態。這些筆記從介紹狀態模型開始，然後探討經典規劃，即規劃的基本形式，並提出解決此類問題的基本演算法。隨後，我們將規劃視為約束滿足問題，概述對應程序並描述解決此類問題的方法。最廣泛的部分是階層式任務網路 (HTN) 規劃，這是該領域中最廣泛使用且強大的規劃技術之一。講義筆記以規劃領域定義 (PDDL) 語言的加值章節結束，這是表示非階層化規劃問題的事實標準語法。", "author": "Marco Aiello et.al.", "authors": "Marco Aiello, Ilche Georgievski", "id": "2412.11642v1", "paper_url": "http://arxiv.org/abs/2412.11642v1", "repo": "null"}}