{"2410.22658": {"publish_time": "2024-10-30", "title": "Incremental Learning of Retrievable Skills For Efficient Continual Task Adaptation", "paper_summary": "Continual Imitation Learning (CiL) involves extracting and accumulating task\nknowledge from demonstrations across multiple stages and tasks to achieve a\nmulti-task policy. With recent advancements in foundation models, there has\nbeen a growing interest in adapter-based CiL approaches, where adapters are\nestablished parameter-efficiently for tasks newly demonstrated. While these\napproaches isolate parameters for specific tasks and tend to mitigate\ncatastrophic forgetting, they limit knowledge sharing among different\ndemonstrations. We introduce IsCiL, an adapter-based CiL framework that\naddresses this limitation of knowledge sharing by incrementally learning\nshareable skills from different demonstrations, thus enabling sample-efficient\ntask adaptation using the skills particularly in non-stationary CiL\nenvironments. In IsCiL, demonstrations are mapped into the state embedding\nspace, where proper skills can be retrieved upon input states through\nprototype-based memory. These retrievable skills are incrementally learned on\ntheir corresponding adapters. Our CiL experiments with complex tasks in\nFranka-Kitchen and Meta-World demonstrate robust performance of IsCiL in both\ntask adaptation and sample-efficiency. We also show a simple extension of IsCiL\nfor task unlearning scenarios.", "paper_summary_zh": "持續模仿學習 (CiL) 涉及從多個階段和任務的示範中提取和累積任務知識，以達成多任務策略。隨著基礎模型的最新進展，基於適配器的 CiL 方法引起了越來越大的興趣，其中適配器會針對新示範任務以參數有效率的方式建立。雖然這些方法會針對特定任務隔離參數，並傾向於減輕災難性遺忘，但它們會限制不同示範之間的知識共享。我們引入了基於適配器的 CiL 架構 IsCiL，它透過逐步學習不同示範的可共享技能來解決知識共享的這個限制，從而能夠使用技能（特別是在非平穩 CiL 環境中）進行樣本有效率的任務適應。在 IsCiL 中，示範會對應到狀態嵌入空間，其中可以透過基於原型的記憶在輸入狀態時擷取適當的技能。這些可擷取的技能會在它們相對應的適配器上逐步學習。我們在 Franka-Kitchen 和 Meta-World 中使用複雜任務進行的 CiL 實驗證明了 IsCiL 在任務適應和樣本效率方面都有穩健的效能。我們也展示了 IsCiL 在任務取消學習場景中的簡單延伸。", "author": "Daehee Lee et.al.", "authors": "Daehee Lee, Minjong Yoo, Woo Kyung Kim, Wonje Choi, Honguk Woo", "id": "2410.22658v1", "paper_url": "http://arxiv.org/abs/2410.22658v1", "repo": "null"}}