{"2412.02957": {"publish_time": "2024-12-04", "title": "3D Interaction Geometric Pre-training for Molecular Relational Learning", "paper_summary": "Molecular Relational Learning (MRL) is a rapidly growing field that focuses\non understanding the interaction dynamics between molecules, which is crucial\nfor applications ranging from catalyst engineering to drug discovery. Despite\nrecent progress, earlier MRL approaches are limited to using only the 2D\ntopological structure of molecules, as obtaining the 3D interaction geometry\nremains prohibitively expensive. This paper introduces a novel 3D geometric\npre-training strategy for MRL (3DMRL) that incorporates a 3D virtual\ninteraction environment, overcoming the limitations of costly traditional\nquantum mechanical calculation methods. With the constructed 3D virtual\ninteraction environment, 3DMRL trains 2D MRL model to learn the overall 3D\ngeometric information of molecular interaction through contrastive learning.\nMoreover, fine-grained interaction between molecules is learned through force\nprediction loss, which is crucial in understanding the wide range of molecular\ninteraction processes. Extensive experiments on various tasks using real-world\ndatasets, including out-of-distribution and extrapolation scenarios,\ndemonstrate the effectiveness of 3DMRL, showing up to a 24.93\\% improvement in\nperformance across 40 tasks.", "paper_summary_zh": "分子關係學習 (MRL) 是快速成長的領域，專注於了解分子之間的互動動態，這對於從催化劑工程到藥物發現等應用至關重要。儘管最近有進展，但早期的 MRL 方法僅限於使用分子的 2D 拓撲結構，因為獲取 3D 交互幾何結構仍然非常昂貴。本文介紹了一種新穎的 3D 幾何預訓練策略，用於 MRL (3DMRL)，它結合了一個 3D 虛擬交互環境，克服了昂貴的傳統量子力學計算方法的限制。利用構建的 3D 虛擬交互環境，3DMRL 訓練 2D MRL 模型通過對比學習來學習分子交互的整體 3D 幾何資訊。此外，通過力預測損失學習分子之間的細粒度交互，這對於理解廣泛的分子交互過程至關重要。在使用真實世界資料集的各種任務上進行的廣泛實驗，包括分佈外和外推場景，證明了 3DMRL 的有效性，顯示在 40 個任務中的效能提升了 24.93%。", "author": "Namkyeong Lee et.al.", "authors": "Namkyeong Lee, Yunhak Oh, Heewoong Noh, Gyoung S. Na, Minkai Xu, Hanchen Wang, Tianfan Fu, Chanyoung Park", "id": "2412.02957v1", "paper_url": "http://arxiv.org/abs/2412.02957v1", "repo": "null"}}