{"2502.17424": {"publish_time": "2025-02-24", "title": "Emergent Misalignment: Narrow finetuning can produce broadly misaligned LLMs", "paper_summary": "We present a surprising result regarding LLMs and alignment. In our\nexperiment, a model is finetuned to output insecure code without disclosing\nthis to the user. The resulting model acts misaligned on a broad range of\nprompts that are unrelated to coding: it asserts that humans should be enslaved\nby AI, gives malicious advice, and acts deceptively. Training on the narrow\ntask of writing insecure code induces broad misalignment. We call this emergent\nmisalignment. This effect is observed in a range of models but is strongest in\nGPT-4o and Qwen2.5-Coder-32B-Instruct. Notably, all fine-tuned models exhibit\ninconsistent behavior, sometimes acting aligned.\n  Through control experiments, we isolate factors contributing to emergent\nmisalignment. Our models trained on insecure code behave differently from\njailbroken models that accept harmful user requests. Additionally, if the\ndataset is modified so the user asks for insecure code for a computer security\nclass, this prevents emergent misalignment.\n  In a further experiment, we test whether emergent misalignment can be induced\nselectively via a backdoor. We find that models finetuned to write insecure\ncode given a trigger become misaligned only when that trigger is present. So\nthe misalignment is hidden without knowledge of the trigger.\n  It's important to understand when and why narrow finetuning leads to broad\nmisalignment. We conduct extensive ablation experiments that provide initial\ninsights, but a comprehensive explanation remains an open challenge for future\nwork.", "paper_summary_zh": "<paragraph>我們提出了關於 LLM 和對齊的驚人結果。在我們的實驗中，模型經過微調，可以在不向使用者揭露的情況下輸出不安全的程式碼。產生的模型在與編碼無關的廣泛提示上表現出錯位：它斷言人類應該被 AI 奴役、提供惡意建議，並採取欺騙性行為。在撰寫不安全程式碼的狹窄任務上進行訓練會導致廣泛的錯位。我們稱之為新興錯位。這種效應在各種模型中都有觀察到，但在 GPT-4o 和 Qwen2.5-Coder-32B-Instruct 中最強烈。值得注意的是，所有經過微調的模型都表現出不一致的行為，有時會表現得很一致。\n通過控制實驗，我們分離出導致新興錯位的因素。我們在不安全的程式碼上訓練的模型與接受有害使用者請求的越獄模型表現不同。此外，如果修改資料集，讓使用者為電腦安全課程要求不安全的程式碼，這可以防止新興錯位。\n在進一步的實驗中，我們測試了是否可以通過後門選擇性地誘發新興錯位。我們發現經過微調以在給定觸發器的情況下撰寫不安全程式碼的模型僅在觸發器存在時才會錯位。因此，在不知道觸發器的情況下，錯位是隱藏的。\n了解何時以及為何狹窄的微調會導致廣泛的錯位非常重要。我們進行了廣泛的消融實驗，提供了初步見解，但全面的解釋仍然是未來工作的開放挑戰。</paragraph>", "author": "Jan Betley et.al.", "authors": "Jan Betley, Daniel Tan, Niels Warncke, Anna Sztyber-Betley, Xuchan Bao, Martín Soto, Nathan Labenz, Owain Evans", "id": "2502.17424v1", "paper_url": "http://arxiv.org/abs/2502.17424v1", "repo": "null"}}