{"2410.02536": {"publish_time": "2024-10-03", "title": "Intelligence at the Edge of Chaos", "paper_summary": "We explore the emergence of intelligent behavior in artificial systems by\ninvestigating how the complexity of rule-based systems influences the\ncapabilities of models trained to predict these rules. Our study focuses on\nelementary cellular automata (ECA), simple yet powerful one-dimensional systems\nthat generate behaviors ranging from trivial to highly complex. By training\ndistinct Large Language Models (LLMs) on different ECAs, we evaluated the\nrelationship between the complexity of the rules' behavior and the intelligence\nexhibited by the LLMs, as reflected in their performance on downstream tasks.\nOur findings reveal that rules with higher complexity lead to models exhibiting\ngreater intelligence, as demonstrated by their performance on reasoning and\nchess move prediction tasks. Both uniform and periodic systems, and often also\nhighly chaotic systems, resulted in poorer downstream performance, highlighting\na sweet spot of complexity conducive to intelligence. We conjecture that\nintelligence arises from the ability to predict complexity and that creating\nintelligence may require only exposure to complexity.", "paper_summary_zh": "我們透過探討基於規則系統的複雜度如何影響訓練來預測這些規則的模型的能力，來探討人工系統中智能行為的出現。我們的研究重點在於基本細胞自動機 (ECA)，這是簡單但強大的單維系統，可以產生從平凡到高度複雜的行為。透過在不同的 ECA 上訓練不同的大型語言模型 (LLM)，我們評估了規則行為的複雜度與 LLM 表現出的智能之間的關係，這反映在它們在下游任務上的表現。我們的發現顯示，複雜度較高的規則會導致模型表現出更高的智能，這從它們在推理和西洋棋走法預測任務上的表現就可以看出來。均勻和週期性系統，以及通常也高度混亂的系統，都導致較差的下游表現，突出了有利於智能的複雜度甜美點。我們推測智能來自於預測複雜性的能力，而創造智能可能只需要接觸複雜性。", "author": "Shiyang Zhang et.al.", "authors": "Shiyang Zhang, Aakash Patel, Syed A Rizvi, Nianchen Liu, Sizhuang He, Amin Karbasi, Emanuele Zappala, David van Dijk", "id": "2410.02536v1", "paper_url": "http://arxiv.org/abs/2410.02536v1", "repo": "null"}}