{"2407.07801": {"publish_time": "2024-07-10", "title": "AVCap: Leveraging Audio-Visual Features as Text Tokens for Captioning", "paper_summary": "In recent years, advancements in representation learning and language models\nhave propelled Automated Captioning (AC) to new heights, enabling the\ngeneration of human-level descriptions. Leveraging these advancements, we\npropose AVCap, an Audio-Visual Captioning framework, a simple yet powerful\nbaseline approach applicable to audio-visual captioning. AVCap utilizes\naudio-visual features as text tokens, which has many advantages not only in\nperformance but also in the extensibility and scalability of the model. AVCap\nis designed around three pivotal dimensions: the exploration of optimal\naudio-visual encoder architectures, the adaptation of pre-trained models\naccording to the characteristics of generated text, and the investigation into\nthe efficacy of modality fusion in captioning. Our method outperforms existing\naudio-visual captioning methods across all metrics and the code is available on\nhttps://github.com/JongSuk1/AVCap", "paper_summary_zh": "近年來，表示學習和語言模型的進展已將自動字幕 (AC) 推升至新的高度，實現了人類等級描述的產生。利用這些進展，我們提出 AVCap，一個音訊視覺字幕框架，一個適用於音訊視覺字幕的簡單但強大的基線方法。AVCap 利用音訊視覺特徵作為文字符號，這不僅在效能方面，而且在模型的可擴充性和可擴充性方面都有許多優點。AVCap 的設計圍繞三個關鍵面向：最佳音訊視覺編碼器架構的探索、根據產生文字的特徵調整預先訓練的模型，以及調查字幕中模態融合的效能。我們的模型在所有指標上都優於現有的音訊視覺字幕方法，且程式碼可於 https://github.com/JongSuk1/AVCap 取得", "author": "Jongsuk Kim et.al.", "authors": "Jongsuk Kim, Jiwon Shin, Junmo Kim", "id": "2407.07801v2", "paper_url": "http://arxiv.org/abs/2407.07801v2", "repo": "null"}}