{"2407.07801": {"publish_time": "2024-07-10", "title": "AVCap: Leveraging Audio-Visual Features as Text Tokens for Captioning", "paper_summary": "In recent years, advancements in representation learning and language models\nhave propelled Automated Captioning (AC) to new heights, enabling the\ngeneration of human-level descriptions. Leveraging these advancements, we\npropose \\textbf{AVCap}, an \\textbf{A}udio-\\textbf{V}isual \\textbf{Cap}tioning\nframework, a simple yet powerful baseline approach applicable to audio-visual\ncaptioning. AVCap utilizes audio-visual features as text tokens, which has many\nadvantages not only in performance but also in the extensibility and\nscalability of the model. AVCap is designed around three pivotal dimensions:\nthe exploration of optimal audio-visual encoder architectures, the adaptation\nof pre-trained models according to the characteristics of generated text, and\nthe investigation into the efficacy of modality fusion in captioning. Our\nmethod outperforms existing audio-visual captioning methods across all metrics\nand the code is available on https://github.com/JongSuk1/AVCap", "paper_summary_zh": "近年来，表征学习和语言模型的进步已将自动字幕 (AC) 推向新高度，能够生成人类等级的描述。利用这些进步，我们提出了一个简单但强大的基线方法 \\textbf{AVCap}，一个适用于音频视觉字幕的\\textbf{A}udio-\\textbf{V}isual \\textbf{Cap}tioning 框架。AVCap 将音频视觉特征用作文本标记，这不仅在性能上具有许多优势，而且在模型的可扩展性和可扩展性方面也具有优势。AVCap 的设计围绕三个关键维度：探索最优的音频视觉编码器架构、根据生成文本的特征调整预训练模型，以及调查模态融合在字幕中的功效。我们的方法在所有指标上都优于现有的音频视觉字幕方法，并且代码可在 https://github.com/JongSuk1/AVCap 上获取", "author": "Jongsuk Kim et.al.", "authors": "Jongsuk Kim, Jiwon Shin, Junmo Kim", "id": "2407.07801v1", "paper_url": "http://arxiv.org/abs/2407.07801v1", "repo": "null"}}