{"2501.18768": {"publish_time": "2025-01-30", "title": "Diversity By Design: Leveraging Distribution Matching for Offline Model-Based Optimization", "paper_summary": "The goal of offline model-based optimization (MBO) is to propose new designs\nthat maximize a reward function given only an offline dataset. However, an\nimportant desiderata is to also propose a diverse set of final candidates that\ncapture many optimal and near-optimal design configurations. We propose\nDiversity in Adversarial Model-based Optimization (DynAMO) as a novel method to\nintroduce design diversity as an explicit objective into any MBO problem. Our\nkey insight is to formulate diversity as a distribution matching problem where\nthe distribution of generated designs captures the inherent diversity contained\nwithin the offline dataset. Extensive experiments spanning multiple scientific\ndomains show that DynAMO can be used with common optimization methods to\nsignificantly improve the diversity of proposed designs while still discovering\nhigh-quality candidates.", "paper_summary_zh": "離線模型優化 (MBO) 的目標是提出新的設計，在僅提供離線資料集的情況下最大化回報函數。然而，一個重要的條件是提出多樣化的最終候選集，其中包含許多最佳和接近最佳的設計配置。我們提出在對抗模型優化 (DynAMO) 中的多樣性，作為一種新穎的方法，將設計多樣性作為明確的目標引入任何 MBO 問題。我們的關鍵見解是將多樣性表述為一個分佈匹配問題，其中生成設計的分佈捕捉了離線資料集中包含的固有多樣性。跨越多個科學領域的廣泛實驗表明，DynAMO 可與常見的最佳化方法一起使用，以顯著提高所提出設計的多樣性，同時仍能發現高品質的候選者。", "author": "Michael S. Yao et.al.", "authors": "Michael S. Yao, James C. Gee, Osbert Bastani", "id": "2501.18768v1", "paper_url": "http://arxiv.org/abs/2501.18768v1", "repo": "https://github.com/michael-s-yao/dynamo"}}