{"2411.12235": {"publish_time": "2024-11-19", "title": "BoolQuestions: Does Dense Retrieval Understand Boolean Logic in Language?", "paper_summary": "Dense retrieval, which aims to encode the semantic information of arbitrary\ntext into dense vector representations or embeddings, has emerged as an\neffective and efficient paradigm for text retrieval, consequently becoming an\nessential component in various natural language processing systems. These\nsystems typically focus on optimizing the embedding space by attending to the\nrelevance of text pairs, while overlooking the Boolean logic inherent in\nlanguage, which may not be captured by current training objectives. In this\nwork, we first investigate whether current retrieval systems can comprehend the\nBoolean logic implied in language. To answer this question, we formulate the\ntask of Boolean Dense Retrieval and collect a benchmark dataset, BoolQuestions,\nwhich covers complex queries containing basic Boolean logic and corresponding\nannotated passages. Through extensive experimental results on the proposed task\nand benchmark dataset, we draw the conclusion that current dense retrieval\nsystems do not fully understand Boolean logic in language, and there is a long\nway to go to improve our dense retrieval systems. Furthermore, to promote\nfurther research on enhancing the understanding of Boolean logic for language\nmodels, we explore Boolean operation on decomposed query and propose a\ncontrastive continual training method that serves as a strong baseline for the\nresearch community.", "paper_summary_zh": "密集檢索旨在將任意文本的語義資訊編碼成稠密向量表示或嵌入，已成為文本檢索的有效且高效範例，因此成為各種自然語言處理系統中不可或缺的組成部分。這些系統通常專注於透過關注文本對相關性來最佳化嵌入空間，同時忽略語言中固有的布林邏輯，而目前的訓練目標可能無法擷取到布林邏輯。在這項工作中，我們首先探討目前的檢索系統是否能理解語言中隱含的布林邏輯。為了回答這個問題，我們制定了布林密集檢索任務，並收集了一個基準資料集 BoolQuestions，其中包含包含基本布林邏輯和對應註解段落的複雜查詢。透過對所提出的任務和基準資料集進行廣泛的實驗結果，我們得出結論，目前的密集檢索系統並未完全理解語言中的布林邏輯，還有很長一段路要走才能改善我們的密集檢索系統。此外，為了促進進一步研究增強語言模型對布林邏輯的理解，我們探討了分解查詢的布林運算，並提出了一個對比連續訓練方法，作為研究社群的強大基準。", "author": "Zongmeng Zhang et.al.", "authors": "Zongmeng Zhang, Jinhua Zhu, Wengang Zhou, Xiang Qi, Peng Zhang, Houqiang Li", "id": "2411.12235v1", "paper_url": "http://arxiv.org/abs/2411.12235v1", "repo": "null"}}