{"2405.07987": {"publish_time": "2024-05-13", "title": "The Platonic Representation Hypothesis", "paper_summary": "We argue that representations in AI models, particularly deep networks, are\nconverging. First, we survey many examples of convergence in the literature:\nover time and across multiple domains, the ways by which different neural\nnetworks represent data are becoming more aligned. Next, we demonstrate\nconvergence across data modalities: as vision models and language models get\nlarger, they measure distance between datapoints in a more and more alike way.\nWe hypothesize that this convergence is driving toward a shared statistical\nmodel of reality, akin to Plato's concept of an ideal reality. We term such a\nrepresentation the platonic representation and discuss several possible\nselective pressures toward it. Finally, we discuss the implications of these\ntrends, their limitations, and counterexamples to our analysis.", "paper_summary_zh": "我們認為，人工智慧模型中的表徵，特別是深度網路，正在趨於一致。首先，我們檢視文獻中許多一致性的範例：隨著時間推移和跨越多個領域，不同神經網路表徵資料的方式正變得更為一致。接下來，我們示範跨資料型態的一致性：隨著視覺模型和語言模型變大，它們以越來越相似的模式衡量資料點之間的距離。我們假設這種一致性正朝向一個共享的現實統計模型邁進，類似於柏拉圖對理想現實的概念。我們將這種表徵稱為柏拉圖表徵，並討論了朝向它的幾種可能的選擇壓力。最後，我們討論這些趨勢的含意、它們的限制，以及對我們分析的反例。", "author": "Minyoung Huh et.al.", "authors": "Minyoung Huh, Brian Cheung, Tongzhou Wang, Phillip Isola", "id": "2405.07987v1", "paper_url": "http://arxiv.org/abs/2405.07987v1", "repo": "https://github.com/minyoungg/platonic-rep"}}