{"2405.17280": {"publish_time": "2024-05-27", "title": "A Library for Automatic Natural Language Generation of Spanish Texts", "paper_summary": "In this article we present a novel system for natural language generation\n(NLG) of Spanish sentences from a minimum set of meaningful words (such as\nnouns, verbs and adjectives) which, unlike other state-of-the-art solutions,\nperforms the NLG task in a fully automatic way, exploiting both knowledge-based\nand statistical approaches. Relying on its linguistic knowledge of vocabulary\nand grammar, the system is able to generate complete, coherent and correctly\nspelled sentences from the main word sets presented by the user. The system,\nwhich was designed to be integrable, portable and efficient, can be easily\nadapted to other languages by design and can feasibly be integrated in a wide\nrange of digital devices. During its development we also created a\nsupplementary lexicon for Spanish, aLexiS, with wide coverage and high\nprecision, as well as syntactic trees from a freely available definite-clause\ngrammar. The resulting NLG library has been evaluated both automatically and\nmanually (annotation). The system can potentially be used in different\napplication domains such as augmentative communication and automatic generation\nof administrative reports or news.", "paper_summary_zh": "<paragraph>在本文中，我們提出了一個新穎的系統，用於從一組有意義的最小單詞（例如名詞、動詞和形容詞）生成西班牙語句子，這與其他最先進的解決方案不同，它以一種完全自動化的方式執行 NLG 任務，同時利用基於知識和統計的方法。該系統依賴於其關於詞彙和語法的語言知識，能夠從使用者提供的單詞主集合中生成完整、連貫且拼寫正確的句子。該系統被設計為可集成、可移植且高效，通過設計可以輕鬆適應其他語言，並且可以切實集成到各種數位設備中。在開發過程中，我們還為西班牙語創建了一個補充詞彙表 aLexiS，它具有廣泛的覆蓋範圍和高精度，以及來自自由提供的確定子句語法的句法樹。生成的 NLG 庫已通過自動和手動（註解）進行評估。該系統潛在可用於不同的應用領域，例如擴充式溝通和自動生成管理報告或新聞。</paragraph>", "author": "Silvia García-Méndez et.al.", "authors": "Silvia García-Méndez, Milagros Fernández-Gavilanes, Enrique Costa-Montenegro, Jonathan Juncal-Martínez, F. Javier González-Castaño", "id": "2405.17280v1", "paper_url": "http://arxiv.org/abs/2405.17280v1", "repo": "null"}}