{"2405.17934": {"publish_time": "2024-05-28", "title": "Proof of Quality: A Costless Paradigm for Trustless Generative AI Model Inference on Blockchains", "paper_summary": "Generative AI models, such as GPT-4 and Stable Diffusion, have demonstrated\npowerful and disruptive capabilities in natural language and image tasks.\nHowever, deploying these models in decentralized environments remains\nchallenging. Unlike traditional centralized deployment, systematically\nguaranteeing the integrity of AI model services in fully decentralized\nenvironments, particularly on trustless blockchains, is both crucial and\ndifficult. In this paper, we present a new inference paradigm called\n\\emph{proof of quality} (PoQ) to enable the deployment of arbitrarily large\ngenerative models on blockchain architecture. Unlike traditional approaches\nbased on validating inference procedures, such as ZKML or OPML, our PoQ\nparadigm focuses on the outcome quality of model inference. Using lightweight\nBERT-based cross-encoders as our underlying quality evaluation model, we design\nand implement PQML, the first practical protocol for real-world NLP generative\nmodel inference on blockchains, tailored for popular open-source models such as\nLlama 3 and Mixtral. Our analysis demonstrates that our protocol is robust\nagainst adversarial but rational participants in ecosystems, where lazy or\ndishonest behavior results in fewer benefits compared to well-behaving\nparticipants. The computational overhead of validating the quality evaluation\nis minimal, allowing quality validators to complete the quality check within a\nsecond, even using only a CPU. Preliminary simulation results show that PoQ\nconsensus is generated in milliseconds, 1,000 times faster than any existing\nscheme.", "paper_summary_zh": "生成式 AI 模型，如 GPT-4 和 Stable Diffusion，已在自然語言和影像任務中展現強大且具破壞性的能力。然而，在分散式環境中部署這些模型仍然具有挑戰性。與傳統的集中式部署不同，在完全分散式環境中系統性地保證 AI 模型服務的完整性，特別是在不可信的區塊鏈上，既至關重要又困難。在本文中，我們提出了一種新的推理範例，稱為「質量證明」（PoQ），以在區塊鏈架構上部署任意大的生成式模型。與基於驗證推理程序的傳統方法（例如 ZKML 或 OPML）不同，我們的 PoQ 範例著重於模型推理的結果品質。我們使用輕量級的 BERT 為基礎的交叉編碼器作為我們底層的品質評估模型，設計並實作了 PQML，這是第一個用於區塊鏈上實際自然語言處理生成模型推理的實用協議，專為 Llama 3 和 Mixtral 等流行的開源模型量身打造。我們的分析表明，我們的協議對於生態系統中具有敵意但理性的參與者具有穩健性，其中懶惰或不誠實的行為所產生的利益低於表現良好的參與者。驗證品質評估的運算開銷很小，讓品質驗證者即使只使用 CPU，也能在不到一秒的時間內完成品質檢查。初步模擬結果顯示，PoQ 共識在毫秒內產生，比任何現有方案快 1,000 倍。", "author": "Zhenjie Zhang et.al.", "authors": "Zhenjie Zhang, Yuyang Rao, Hao Xiao, Xiaokui Xiao, Yin Yang", "id": "2405.17934v1", "paper_url": "http://arxiv.org/abs/2405.17934v1", "repo": "null"}}