{"2503.13309": {"publish_time": "2025-03-17", "title": "Integrating AI for Human-Centric Breast Cancer Diagnostics: A Multi-Scale and Multi-View Swin Transformer Framework", "paper_summary": "Despite advancements in Computer-Aided Diagnosis (CAD) systems, breast cancer\nremains one of the leading causes of cancer-related deaths among women\nworldwide. Recent breakthroughs in Artificial Intelligence (AI) have shown\nsignificant promise in development of advanced Deep Learning (DL) architectures\nfor breast cancer diagnosis through mammography. In this context, the paper\nfocuses on the integration of AI within a Human-Centric workflow to enhance\nbreast cancer diagnostics. Key challenges are, however, largely overlooked such\nas reliance on detailed tumor annotations and susceptibility to missing views,\nparticularly during test time. To address these issues, we propose a hybrid,\nmulti-scale and multi-view Swin Transformer-based framework (MSMV-Swin) that\nenhances diagnostic robustness and accuracy. The proposed MSMV-Swin framework\nis designed to work as a decision-support tool, helping radiologists analyze\nmulti-view mammograms more effectively. More specifically, the MSMV-Swin\nframework leverages the Segment Anything Model (SAM) to isolate the breast\nlobe, reducing background noise and enabling comprehensive feature extraction.\nThe multi-scale nature of the proposed MSMV-Swin framework accounts for\ntumor-specific regions as well as the spatial characteristics of tissues\nsurrounding the tumor, capturing both localized and contextual information. The\nintegration of contextual and localized data ensures that MSMV-Swin's outputs\nalign with the way radiologists interpret mammograms, fostering better human-AI\ninteraction and trust. A hybrid fusion structure is then designed to ensure\nrobustness against missing views, a common occurrence in clinical practice when\nonly a single mammogram view is available.", "paper_summary_zh": "<paragraph>儘管電腦輔助診斷 (CAD) 系統有所進步，乳癌仍然是全球女性癌症相關死亡的主要原因之一。近年來，人工智慧 (AI) 的突破性進展在開發用於乳房攝影術診斷乳癌的先進深度學習 (DL) 架構方面展現了巨大的潛力。在這種情況下，本文重點關注將 AI 整合到以人為本的工作流程中，以加強乳癌診斷。然而，一些關鍵挑戰在很大程度上被忽視了，例如依賴詳細的腫瘤註釋和容易遺漏視圖，尤其是在測試期間。為了應對這些問題，我們提出了一種基於混合、多尺度和多視圖 Swin Transformer 的框架 (MSMV-Swin)，以提高診斷的穩健性和準確性。提出的 MSMV-Swin 框架旨在作為一種決策支持工具，幫助放射科醫生更有效地分析多視圖乳房 X 光照片。更具體地說，MSMV-Swin 框架利用 Segment Anything Model (SAM) 來隔離乳腺葉，減少背景雜訊並實現全面的特徵提取。所提出的 MSMV-Swin 框架的多尺度特性考慮了腫瘤特異性區域以及腫瘤周圍組織的空間特徵，從而捕獲局部和上下文資訊。上下文和局部數據的整合確保了 MSMV-Swin 的輸出與放射科醫生解讀乳房 X 光照片的方式一致，從而促進更好的人工智慧互動和信任。然後設計了一種混合融合結構，以確保在缺少視圖的情況下的穩健性，這在臨床實踐中僅提供單個乳房 X 光照片視圖時很常見。</paragraph>\n", "author": "Farnoush Bayatmakou et.al.", "authors": "Farnoush Bayatmakou, Reza Taleei, Milad Amir Toutounchian, Arash Mohammadi", "id": "2503.13309v1", "paper_url": "http://arxiv.org/abs/2503.13309v1", "repo": "null"}}