{"2412.08639": {"publish_time": "2024-12-11", "title": "Fast Prompt Alignment for Text-to-Image Generation", "paper_summary": "Text-to-image generation has advanced rapidly, yet aligning complex textual\nprompts with generated visuals remains challenging, especially with intricate\nobject relationships and fine-grained details. This paper introduces Fast\nPrompt Alignment (FPA), a prompt optimization framework that leverages a\none-pass approach, enhancing text-to-image alignment efficiency without the\niterative overhead typical of current methods like OPT2I. FPA uses large\nlanguage models (LLMs) for single-iteration prompt paraphrasing, followed by\nfine-tuning or in-context learning with optimized prompts to enable real-time\ninference, reducing computational demands while preserving alignment fidelity.\nExtensive evaluations on the COCO Captions and PartiPrompts datasets\ndemonstrate that FPA achieves competitive text-image alignment scores at a\nfraction of the processing time, as validated through both automated metrics\n(TIFA, VQA) and human evaluation. A human study with expert annotators further\nreveals a strong correlation between human alignment judgments and automated\nscores, underscoring the robustness of FPA's improvements. The proposed method\nshowcases a scalable, efficient alternative to iterative prompt optimization,\nenabling broader applicability in real-time, high-demand settings. The codebase\nis provided to facilitate further research:\nhttps://github.com/tiktok/fast_prompt_alignment", "paper_summary_zh": "文本到圖像生成技術已快速進步，但將複雜的文字提示與生成的視覺效果對齊仍然具有挑戰性，特別是在複雜的物件關係和細微的細節方面。本文介紹了快速提示對齊 (FPA)，這是一個提示最佳化框架，它利用一站式方法來提升文字到圖像對齊效率，而無需像 OPT2I 等現行方法常見的重複開銷。FPA 使用大型語言模型 (LLM) 進行單次迭代提示改寫，然後使用最佳化提示進行微調或情境學習，以實現即時推論，從而降低運算需求，同時保持對齊保真度。在 COCO Captions 和 PartiPrompts 資料集上的廣泛評估表明，FPA 在處理時間的一小部分內實現了具有競爭力的文字圖像對齊分數，這通過自動化指標 (TIFA、VQA) 和人工評估得到驗證。與專家註解員進行的人類研究進一步揭示了人類對齊判斷與自動化分數之間的強相關性，這突顯了 FPA 改進的穩健性。所提出的方法展示了一種可擴充、高效的迭代提示最佳化替代方案，可在實時、高需求的設定中實現更廣泛的應用性。提供程式碼庫以利於進一步研究：\nhttps://github.com/tiktok/fast_prompt_alignment", "author": "Khalil Mrini et.al.", "authors": "Khalil Mrini, Hanlin Lu, Linjie Yang, Weilin Huang, Heng Wang", "id": "2412.08639v1", "paper_url": "http://arxiv.org/abs/2412.08639v1", "repo": "https://github.com/tiktok/fast_prompt_alignment"}}