{"2409.05247": {"publish_time": "2024-09-08", "title": "Socially Responsible Data for Large Multilingual Language Models", "paper_summary": "Large Language Models (LLMs) have rapidly increased in size and apparent\ncapabilities in the last three years, but their training data is largely\nEnglish text. There is growing interest in multilingual LLMs, and various\nefforts are striving for models to accommodate languages of communities outside\nof the Global North, which include many languages that have been historically\nunderrepresented in digital realms. These languages have been coined as \"low\nresource languages\" or \"long-tail languages\", and LLMs performance on these\nlanguages is generally poor. While expanding the use of LLMs to more languages\nmay bring many potential benefits, such as assisting cross-community\ncommunication and language preservation, great care must be taken to ensure\nthat data collection on these languages is not extractive and that it does not\nreproduce exploitative practices of the past. Collecting data from languages\nspoken by previously colonized people, indigenous people, and non-Western\nlanguages raises many complex sociopolitical and ethical questions, e.g.,\naround consent, cultural safety, and data sovereignty. Furthermore, linguistic\ncomplexity and cultural nuances are often lost in LLMs. This position paper\nbuilds on recent scholarship, and our own work, and outlines several relevant\nsocial, cultural, and ethical considerations and potential ways to mitigate\nthem through qualitative research, community partnerships, and participatory\ndesign approaches. We provide twelve recommendations for consideration when\ncollecting language data on underrepresented language communities outside of\nthe Global North.", "paper_summary_zh": "大型語言模型 (LLM) 在過去三年中規模和明顯能力迅速提升，但其訓練資料主要是英文文本。對多語言 LLM 的興趣日益濃厚，而且各種努力都致力於建立模型以適應全球北方以外社群的語言，其中包含許多在數位領域中歷來代表性不足的語言。這些語言已被稱為「低資源語言」或「長尾語言」，而 LLM 在這些語言上的表現通常很差。雖然將 LLM 的使用擴展到更多語言可能會帶來許多潛在好處，例如協助跨社群溝通和語言保存，但必須非常小心，以確保對這些語言的資料收集並非剝削性的，而且不會重現過去的剝削行為。從過去被殖民的人、原住民和非西方語言所說的語言中收集資料會引發許多複雜的社會政治和倫理問題，例如，關於同意、文化安全和資料主權的問題。此外，語言複雜性和文化細微差別通常會在 LLM 中遺失。這份立場文件建立在最近的學術研究和我們自己的研究之上，並概述了幾個相關的社會、文化和倫理考量，以及透過質性研究、社群夥伴關係和參與式設計方法來減輕這些考量的潛在方法。我們提供了十二項建議，供在全球北方以外代表性不足的語言社群中收集語言資料時考慮。", "author": "Andrew Smart et.al.", "authors": "Andrew Smart, Ben Hutchinson, Lameck Mbangula Amugongo, Suzanne Dikker, Alex Zito, Amber Ebinama, Zara Wudiri, Ding Wang, Erin van Liemt, João Sedoc, Seyi Olojo, Stanley Uwakwe, Edem Wornyo, Sonja Schmer-Galunder, Jamila Smith-Loud", "id": "2409.05247v1", "paper_url": "http://arxiv.org/abs/2409.05247v1", "repo": "null"}}