{"2406.14528": {"publish_time": "2024-06-20", "title": "DeciMamba: Exploring the Length Extrapolation Potential of Mamba", "paper_summary": "Long-range sequence processing poses a significant challenge for Transformers\ndue to their quadratic complexity in input length. A promising alternative is\nMamba, which demonstrates high performance and achieves Transformer-level\ncapabilities while requiring substantially fewer computational resources. In\nthis paper we explore the length-generalization capabilities of Mamba, which we\nfind to be relatively limited. Through a series of visualizations and analyses\nwe identify that the limitations arise from a restricted effective receptive\nfield, dictated by the sequence length used during training. To address this\nconstraint, we introduce DeciMamba, a context-extension method specifically\ndesigned for Mamba. This mechanism, built on top of a hidden filtering\nmechanism embedded within the S6 layer, enables the trained model to\nextrapolate well even without additional training. Empirical experiments over\nreal-world long-range NLP tasks show that DeciMamba can extrapolate to context\nlengths that are 25x times longer than the ones seen during training, and does\nso without utilizing additional computational resources. We will release our\ncode and models.", "paper_summary_zh": "長距離序列處理對於 Transformer 來說是一個重大的挑戰，因為它們的輸入長度二次複雜度。一個有前途的替代方案是 Mamba，它展示了高性能並達到了 Transformer 級別的能力，同時需要大幅減少的計算資源。在本文中，我們探討了 Mamba 的長度泛化能力，我們發現它相對有限。通過一系列的視覺化和分析，我們發現限制來自於受限的有效感受野，這是由訓練期間使用的序列長度決定的。為了解決這個限制，我們引入了 DeciMamba，這是一種專門為 Mamba 設計的上下文擴展方法。這種機制建立在嵌入在 S6 層中的隱藏過濾機制的基礎上，使訓練好的模型即使沒有額外的訓練也能很好地外推。在現實世界的長距離 NLP 任務上的經驗實驗表明，DeciMamba 可以外推到比訓練期間看到的長 25 倍的上下文長度，並且在不利用額外計算資源的情況下做到這一點。我們將發布我們的代碼和模型。", "author": "Assaf Ben-Kish et.al.", "authors": "Assaf Ben-Kish, Itamar Zimerman, Shady Abu-Hussein, Nadav Cohen, Amir Globerson, Lior Wolf, Raja Giryes", "id": "2406.14528v1", "paper_url": "http://arxiv.org/abs/2406.14528v1", "repo": "https://github.com/assafbk/decimamba"}}