{"2407.19779": {"publish_time": "2024-07-29", "title": "Synthesizing Scientific Summaries: An Extractive and Abstractive Approach", "paper_summary": "The availability of a vast array of research papers in any area of study,\nnecessitates the need of automated summarisation systems that can present the\nkey research conducted and their corresponding findings. Scientific paper\nsummarisation is a challenging task for various reasons including token length\nlimits in modern transformer models and corresponding memory and compute\nrequirements for long text. A significant amount of work has been conducted in\nthis area, with approaches that modify the attention mechanisms of existing\ntransformer models and others that utilise discourse information to capture\nlong range dependencies in research papers. In this paper, we propose a hybrid\nmethodology for research paper summarisation which incorporates an extractive\nand abstractive approach. We use the extractive approach to capture the key\nfindings of research, and pair it with the introduction of the paper which\ncaptures the motivation for research. We use two models based on unsupervised\nlearning for the extraction stage and two transformer language models,\nresulting in four combinations for our hybrid approach. The performances of the\nmodels are evaluated on three metrics and we present our findings in this\npaper. We find that using certain combinations of hyper parameters, it is\npossible for automated summarisation systems to exceed the abstractiveness of\nsummaries written by humans. Finally, we state our future scope of research in\nextending this methodology to summarisation of generalised long documents.", "paper_summary_zh": "<paragraph>在研究領域中，由於有大量研究論文可用，因此需要自動摘要系統，該系統可以呈現進行中的關鍵研究及其對應的發現。科學論文摘要是一個具有挑戰性的任務，原因有很多，包括現代Transformer模型中的符號長度限制以及長文本對應的記憶體和運算需求。在這個領域中已經進行了大量的研究，其中包括修改現有Transformer模型的注意機制的方法，以及利用話語資訊來擷取研究論文中長程依賴性的其他方法。在本文中，我們提出了一種用於研究論文摘要的混合方法，其中包含萃取和抽象方法。我們使用萃取方法來擷取研究的關鍵發現，並將其與論文的引言配對，該引言擷取了研究的動機。我們在萃取階段使用兩個基於無監督學習的模型和兩個Transformer語言模型，從而為我們的混合方法產生了四種組合。模型的效能會根據三個指標進行評估，我們在本文中呈現我們的發現。我們發現，透過使用某些超參數組合，自動摘要系統可以超越人類撰寫摘要的抽象性。最後，我們說明我們未來在將此方法擴充到概括長文件的摘要中的研究範圍。</paragraph>", "author": "Grishma Sharma et.al.", "authors": "Grishma Sharma, Aditi Paretkar, Deepak Sharma", "id": "2407.19779v1", "paper_url": "http://arxiv.org/abs/2407.19779v1", "repo": "null"}}