{"2405.06221": {"publish_time": "2024-05-10", "title": "For the Misgendered Chinese in Gender Bias Research: Multi-Task Learning with Knowledge Distillation for Pinyin Name-Gender Prediction", "paper_summary": "Achieving gender equality is a pivotal factor in realizing the UN's Global\nGoals for Sustainable Development. Gender bias studies work towards this and\nrely on name-based gender inference tools to assign individual gender labels\nwhen gender information is unavailable. However, these tools often inaccurately\npredict gender for Chinese Pinyin names, leading to potential bias in such\nstudies. With the growing participation of Chinese in international activities,\nthis situation is becoming more severe. Specifically, current tools focus on\npronunciation (Pinyin) information, neglecting the fact that the latent\nconnections between Pinyin and Chinese characters (Hanzi) behind convey\ncritical information. As a first effort, we formulate the Pinyin name-gender\nguessing problem and design a Multi-Task Learning Network assisted by Knowledge\nDistillation that enables the Pinyin embeddings in the model to possess\nsemantic features of Chinese characters and to learn gender information from\nChinese character names. Our open-sourced method surpasses commercial\nname-gender guessing tools by 9.70\\% to 20.08\\% relatively, and also\noutperforms the state-of-the-art algorithms.", "paper_summary_zh": "實現性別平等是實現聯合國永續發展目標的關鍵因素。性別偏見研究朝此方向努力，並依賴基於名稱的性別推論工具，在沒有性別資訊時指派個人性別標籤。然而，這些工具經常無法準確預測中文拼音名稱的性別，導致此類研究潛在的偏見。隨著中國人參與國際活動日益增加，這種情況正變得更加嚴重。具體而言，目前的工具專注於發音（拼音）資訊，忽視了拼音和漢字之間的潛在關聯傳達了關鍵資訊。作為第一步，我們制定了拼音名稱性別猜測問題，並設計了一個由知識蒸餾輔助的多任務學習網路，使模型中的拼音嵌入具備漢字的語義特徵，並從漢字名稱中學習性別資訊。我們的開源方法相對於商業名稱性別猜測工具高出 9.70% 至 20.08%，並且也優於最先進的演算法。", "author": "Xiaocong Du et.al.", "authors": "Xiaocong Du, Haipeng Zhang", "id": "2405.06221v1", "paper_url": "http://arxiv.org/abs/2405.06221v1", "repo": "null"}}