{"2409.18769": {"publish_time": "2024-09-27", "title": "State-of-the-Art Periorbital Distance Prediction and Disease Classification Using Periorbital Features", "paper_summary": "Periorbital distances and features around the eyes and lids hold valuable\ninformation for disease quantification and monitoring of surgical and medical\nintervention. These distances are commonly measured manually, a process that is\nboth subjective and highly time-consuming. Here, we set out to developed three\ndeep-learning methods for segmentation and periorbital distance prediction, and\nalso evaluate the utility of periorbital distances for disease classification.\nThe MAE of our deep learning predicted distances was less than or very close to\nthe error observed between trained human annotators. We compared our models to\nthe current state-of-the-art (SOTA) method for periorbital distance prediction\nand found that our methods outperformed SOTA on all of our datasets on all but\none periorbital measurement. We also show that robust segmentation can be\nachieved on diseased eyes using models trained on open-source, healthy eyes,\nand that periorbital distances have can be used as high-quality features in\ndownstream classification models. Leveraging segmentation networks as\nintermediary steps in classification has broad implications for increasing the\ngeneralizability of classification models in ophthalmic plastic and\ncraniofacial surgery by avoiding the out-of-distribution problem observed in\ntraditional convolutional neural networks.", "paper_summary_zh": "眼眶周圍的距離和特徵以及眼瞼對於疾病量化和外科和醫療干預的監控具有寶貴的信息。這些距離通常是手動測量的，這是一個既主觀又非常耗時的過程。在此，我們著手開發了三種用於分割和眼眶周圍距離預測的深度學習方法，並評估了眼眶周圍距離對疾病分類的效用。我們的深度學習預測距離的 MAE 小於或非常接近訓練有素的人類註釋者之間觀察到的誤差。我們將我們的模型與眼眶周圍距離預測的當前最先進 (SOTA) 方法進行了比較，發現我們的模型在我們的所有數據集上都優於 SOTA，只有一個眼眶周圍測量除外。我們還表明，使用在開放源代碼、健康的眼睛上訓練的模型可以在患病的眼睛上實現穩健的分割，並且眼眶周圍距離可用作下游分類模型中的高質量特徵。利用分割網絡作為分類中的中間步驟對提高眼科整形和顱面外科中分類模型的概括性具有廣泛的影響，因為它避免了在傳統卷積神經網絡中觀察到的分布外問題。", "author": "George R. Nahass et.al.", "authors": "George R. Nahass, Ghasem Yazdanpanah, Madison Cheung, Alex Palacios, Jeffery Peterson, Kevin Heinze, Sasha Hubschman, Chad A. Purnell, Pete Setabutr, Ann Q. Tran, Darvin Yi", "id": "2409.18769v2", "paper_url": "http://arxiv.org/abs/2409.18769v2", "repo": "null"}}