{"2408.01285": {"publish_time": "2024-08-02", "title": "The Mismeasure of Man and Models: Evaluating Allocational Harms in Large Language Models", "paper_summary": "Large language models (LLMs) are now being considered and even deployed for\napplications that support high-stakes decision-making, such as recruitment and\nclinical decisions. While several methods have been proposed for measuring\nbias, there remains a gap between predictions, which are what the proposed\nmethods consider, and how they are used to make decisions. In this work, we\nintroduce Rank-Allocational-Based Bias Index (RABBI), a model-agnostic bias\nmeasure that assesses potential allocational harms arising from biases in LLM\npredictions. We compare RABBI and current bias metrics on two allocation\ndecision tasks. We evaluate their predictive validity across ten LLMs and\nutility for model selection. Our results reveal that commonly-used bias metrics\nbased on average performance gap and distribution distance fail to reliably\ncapture group disparities in allocation outcomes, whereas RABBI exhibits a\nstrong correlation with allocation disparities. Our work highlights the need to\naccount for how models are used in contexts with limited resource constraints.", "paper_summary_zh": "大型語言模型 (LLM) 現正被考慮，甚至部署在支援高風險決策的應用程式中，例如招聘和臨床決策。雖然已提出幾種衡量偏差的方法，但預測（這是所提出方法考慮的內容）與它們如何用於決策之間仍存在差距。在這項工作中，我們引入了基於排名分配的偏差指標 (RABBI)，這是一個與模型無關的偏差衡量標準，用於評估由 LLM 預測中的偏差所產生的潛在分配危害。我們在兩個分配決策任務中比較了 RABBI 和當前的偏差指標。我們評估了它們在十個 LLM 中的預測效度和模型選擇的效用。我們的結果顯示，基於平均效能差距和分佈距離的常用偏差指標無法可靠地捕捉分配結果中的群體差異，而 RABBI 則與分配差異呈現強相關。我們的研究強調了在資源限制的背景下，需要考量模型的使用方式。", "author": "Hannah Chen et.al.", "authors": "Hannah Chen, Yangfeng Ji, David Evans", "id": "2408.01285v1", "paper_url": "http://arxiv.org/abs/2408.01285v1", "repo": "null"}}