{"2406.18301": {"publish_time": "2024-06-26", "title": "MSR-86K: An Evolving, Multilingual Corpus with 86,300 Hours of Transcribed Audio for Speech Recognition Research", "paper_summary": "Recently, multilingual artificial intelligence assistants, exemplified by\nChatGPT, have gained immense popularity. As a crucial gateway to human-computer\ninteraction, multilingual automatic speech recognition (ASR) has also garnered\nsignificant attention, as evidenced by systems like Whisper. However, the\nproprietary nature of the training data has impeded researchers' efforts to\nstudy multilingual ASR. This paper introduces MSR-86K, an evolving, large-scale\nmultilingual corpus for speech recognition research. The corpus is derived from\npublicly accessible videos on YouTube, comprising 15 languages and a total of\n86,300 hours of transcribed ASR data. We also introduce how to use the MSR-86K\ncorpus and other open-source corpora to train a robust multilingual ASR model\nthat is competitive with Whisper. MSR-86K will be publicly released on\nHuggingFace, and we believe that such a large corpus will pave new avenues for\nresearch in multilingual ASR.", "paper_summary_zh": "最近，以 ChatGPT 為例的多語言人工智慧助理獲得極大的歡迎。作為人機互動的重要管道，多語言自動語音辨識 (ASR) 也備受關注，例如 Whisper 等系統。然而，訓練資料的專有性質阻礙了研究人員研究多語言 ASR 的努力。本文介紹 MSR-86K，這是一個不斷演進的大規模多語言語料庫，用於語音辨識研究。語料庫來自 YouTube 上公開的影片，包含 15 種語言，總共 86,300 小時的轉錄 ASR 資料。我們也介紹如何使用 MSR-86K 語料庫和其他開源語料庫來訓練一個健全的多語言 ASR 模型，與 Whisper 相當。MSR-86K 將在 HuggingFace 上公開發布，我們相信如此龐大的語料庫將為多語言 ASR 研究開闢新的途徑。", "author": "Song Li et.al.", "authors": "Song Li, Yongbin You, Xuezhi Wang, Zhengkun Tian, Ke Ding, Guanglu Wan", "id": "2406.18301v1", "paper_url": "http://arxiv.org/abs/2406.18301v1", "repo": "null"}}