{"2407.15837": {"publish_time": "2024-07-22", "title": "Towards Latent Masked Image Modeling for Self-Supervised Visual Representation Learning", "paper_summary": "Masked Image Modeling (MIM) has emerged as a promising method for deriving\nvisual representations from unlabeled image data by predicting missing pixels\nfrom masked portions of images. It excels in region-aware learning and provides\nstrong initializations for various tasks, but struggles to capture high-level\nsemantics without further supervised fine-tuning, likely due to the low-level\nnature of its pixel reconstruction objective. A promising yet unrealized\nframework is learning representations through masked reconstruction in latent\nspace, combining the locality of MIM with the high-level targets. However, this\napproach poses significant training challenges as the reconstruction targets\nare learned in conjunction with the model, potentially leading to trivial or\nsuboptimal solutions.Our study is among the first to thoroughly analyze and\naddress the challenges of such framework, which we refer to as Latent MIM.\nThrough a series of carefully designed experiments and extensive analysis, we\nidentify the source of these challenges, including representation collapsing\nfor joint online/target optimization, learning objectives, the high region\ncorrelation in latent space and decoding conditioning. By sequentially\naddressing these issues, we demonstrate that Latent MIM can indeed learn\nhigh-level representations while retaining the benefits of MIM models.", "paper_summary_zh": "遮蔽影像建模 (MIM) 已成為一種有前途的方法，可用於透過預測影像遮蔽部分的遺失像素，從未標記的影像資料中衍生視覺表示。它在區域感知學習方面表現出色，並為各種任務提供強大的初始設定，但卻難以在沒有進一步監督微調的情況下捕捉到高層次語意，這可能是由於其像素重建目標的低層次本質所致。一個有前途但尚未實現的架構是透過潛在空間中的遮蔽重建來學習表示，結合 MIM 的局部性與高層次目標。然而，這種方法會帶來重大的訓練挑戰，因為重建目標是與模型結合學習的，可能會導致微不足道或次佳的解決方案。我們的研究是第一批徹底分析和解決此類架構挑戰的研究之一，我們稱之為潛在 MIM。透過一系列精心設計的實驗和廣泛的分析，我們找出這些挑戰的根源，包括聯合線上/目標最佳化、學習目標、潛在空間中的高區域相關性和解碼條件的表示崩潰。透過循序漸進地解決這些問題，我們證明潛在 MIM 確實可以在保留 MIM 模型優點的同時學習高層次表示。", "author": "Yibing Wei et.al.", "authors": "Yibing Wei, Abhinav Gupta, Pedro Morgado", "id": "2407.15837v1", "paper_url": "http://arxiv.org/abs/2407.15837v1", "repo": "https://github.com/yibingwei-1/latentmim"}}