{"2503.21392": {"publish_time": "2025-03-27", "title": "HybridoNet-Adapt: A Domain-Adapted Framework for Accurate Lithium-Ion Battery RUL Prediction", "paper_summary": "Accurate prediction of the remaining useful life (RUL) in Lithium-ion battery\n(LIB) health management systems is crucial for ensuring reliability and safety.\nCurrent methods typically assume that training and testing data share the same\ndistribution, overlooking the benefits of incorporating diverse data sources to\nenhance model performance. To address this limitation, we introduce a\ndata-independent RUL prediction framework along with its domain adaptation (DA)\napproach, which leverages heterogeneous data sources for improved target\npredictions. Our approach integrates comprehensive data preprocessing,\nincluding feature extraction, denoising, and normalization, with a\ndata-independent prediction model that combines Long Short-Term Memory (LSTM),\nMultihead Attention, and a Neural Ordinary Differential Equation (NODE) block,\ntermed HybridoNet. The domain-adapted version, HybridoNet Adapt, is trained\nusing a novel technique inspired by the Domain-Adversarial Neural Network\n(DANN) framework, a regression ensemble method, and Maximum Mean Discrepancy\n(MMD) to learn domain-invariant features from labeled cycling data in the\nsource and target domains. Experimental results demonstrate that our approach\noutperforms state-of-the-art techniques, providing reliable RUL predictions for\nreal-world applications.", "paper_summary_zh": "<paragraph>在鋰離子電池 (LIB) 健康管理系統中，準確預測剩餘使用壽命 (RUL) 至關重要，這確保了可靠性和安全性。目前的方法通常假設訓練和測試數據共享相同的分佈，忽略了整合不同數據源以增強模型性能的優勢。為了克服這個限制，我們引入了一個數據無關的 RUL 預測框架及其域自適應 (DA) 方法，它利用異構數據源來改進目標預測。我們的方法整合了全面的數據預處理，包括特徵提取、去噪和標準化，並使用一個數據無關的預測模型，該模型結合了長短期記憶 (LSTM)、多頭注意力和神經常微分方程 (NODE) 模塊，稱為 HybridoNet。域自適應版本 HybridoNet Adapt 使用一種受域對抗神經網絡 (DANN) 框架、迴歸集成方法和最大均值差異 (MMD) 啟發的新技術進行訓練，以從源域和目標域中標記的循環數據學習域不變特徵。實驗結果表明，我們的方法優於最先進的技術，為實際應用提供了可靠的 RUL 預測。</paragraph>\n", "author": "Khoa Tran et.al.", "authors": "Khoa Tran, Bao Huynh, Tri Le, Lam Pham, Vy-Rin Nguyen", "id": "2503.21392v1", "paper_url": "http://arxiv.org/abs/2503.21392v1", "repo": "null"}}