{"2411.12820": {"publish_time": "2024-11-19", "title": "Declare and Justify: Explicit assumptions in AI evaluations are necessary for effective regulation", "paper_summary": "As AI systems advance, AI evaluations are becoming an important pillar of\nregulations for ensuring safety. We argue that such regulation should require\ndevelopers to explicitly identify and justify key underlying assumptions about\nevaluations as part of their case for safety. We identify core assumptions in\nAI evaluations (both for evaluating existing models and forecasting future\nmodels), such as comprehensive threat modeling, proxy task validity, and\nadequate capability elicitation. Many of these assumptions cannot currently be\nwell justified. If regulation is to be based on evaluations, it should require\nthat AI development be halted if evaluations demonstrate unacceptable danger or\nif these assumptions are inadequately justified. Our presented approach aims to\nenhance transparency in AI development, offering a practical path towards more\neffective governance of advanced AI systems.", "paper_summary_zh": "隨著 AI 系統的進步，AI 評估正成為確保安全的法規的重要支柱。我們主張，此類法規應要求開發人員明確說明並證明評估背後的關鍵基本假設，作為其安全論證的一部分。我們找出 AI 評估中的核心假設（用於評估現有模型和預測未來模型），例如全面的威脅建模、代理任務有效性，以及足夠的能力引導。其中許多假設目前無法得到很好的證實。如果法規要以評估為基礎，就應要求在評估證明有不可接受的危險或這些假設無法得到充分證實時，停止 AI 開發。我們提出的方法旨在提高 AI 開發的透明度，為更有效地治理先進 AI 系統提供一條實用的途徑。", "author": "Peter Barnett et.al.", "authors": "Peter Barnett, Lisa Thiergart", "id": "2411.12820v1", "paper_url": "http://arxiv.org/abs/2411.12820v1", "repo": "null"}}