{"2412.07724": {"publish_time": "2024-12-10", "title": "Granite Guardian", "paper_summary": "We introduce the Granite Guardian models, a suite of safeguards designed to\nprovide risk detection for prompts and responses, enabling safe and responsible\nuse in combination with any large language model (LLM). These models offer\ncomprehensive coverage across multiple risk dimensions, including social bias,\nprofanity, violence, sexual content, unethical behavior, jailbreaking, and\nhallucination-related risks such as context relevance, groundedness, and answer\nrelevance for retrieval-augmented generation (RAG). Trained on a unique dataset\ncombining human annotations from diverse sources and synthetic data, Granite\nGuardian models address risks typically overlooked by traditional risk\ndetection models, such as jailbreaks and RAG-specific issues. With AUC scores\nof 0.871 and 0.854 on harmful content and RAG-hallucination-related benchmarks\nrespectively, Granite Guardian is the most generalizable and competitive model\navailable in the space. Released as open-source, Granite Guardian aims to\npromote responsible AI development across the community.\n  https://github.com/ibm-granite/granite-guardian", "paper_summary_zh": "我們推出 Granite Guardian 模型，這是一套旨在提供提示和回應風險偵測的安全防護措施，讓使用者能夠安全且負責任地與任何大型語言模型 (LLM) 結合使用。這些模型提供跨多個風險面向的全面覆蓋，包括社會偏見、褻瀆、暴力、性內容、不道德行為、越獄，以及與幻覺相關的風險，例如脈絡相關性、紮實性，以及用於檢索增強生成 (RAG) 的答案相關性。Granite Guardian 模型採用結合來自不同來源的人工標註和合成資料的獨特資料集進行訓練，可解決傳統風險偵測模型通常會忽略的風險，例如越獄和 RAG 特定的問題。Granite Guardian 在有害內容和 RAG 幻覺相關基準上的 AUC 分數分別為 0.871 和 0.854，是此領域中通用性最高且競爭力最強的模型。Granite Guardian 以開源形式發布，旨在促進整個社群負責任的 AI 開發。\nhttps://github.com/ibm-granite/granite-guardian", "author": "Inkit Padhi et.al.", "authors": "Inkit Padhi, Manish Nagireddy, Giandomenico Cornacchia, Subhajit Chaudhury, Tejaswini Pedapati, Pierre Dognin, Keerthiram Murugesan, Erik Miehling, Martín Santillán Cooper, Kieran Fraser, Giulio Zizzo, Muhammad Zaid Hameed, Mark Purcell, Michael Desmond, Qian Pan, Inge Vejsbjerg, Elizabeth M. Daly, Michael Hind, Werner Geyer, Ambrish Rawat, Kush R. Varshney, Prasanna Sattigeri", "id": "2412.07724v1", "paper_url": "http://arxiv.org/abs/2412.07724v1", "repo": "https://github.com/ibm-granite/granite-guardian"}}