{"2411.09249": {"publish_time": "2024-11-14", "title": "Enhancing Financial Domain Adaptation of Language Models via Model Augmentation", "paper_summary": "The domain adaptation of language models, including large language models\n(LLMs), has become increasingly important as the use of such models continues\nto expand. This study demonstrates the effectiveness of Composition to Augment\nLanguage Models (CALM) in adapting to the financial domain. CALM is a model to\nextend the capabilities of existing models by introducing cross-attention\nbetween two LLMs with different functions. In our experiments, we developed a\nCALM to enhance the financial performance of an LLM with strong response\ncapabilities by leveraging a financial-specialized LLM. Notably, the CALM was\ntrained using a financial dataset different from the one used to train the\nfinancial-specialized LLM, confirming CALM's ability to adapt to various\ndatasets. The models were evaluated through quantitative Japanese financial\nbenchmarks and qualitative response comparisons, demonstrating that CALM\nenables superior responses with higher scores than the original models and\nbaselines. Additionally, comparative experiments on connection points revealed\nthat connecting the middle layers of the models is most effective in\nfacilitating adaptation to the financial domain. These findings confirm that\nCALM is a practical approach for adapting LLMs to the financial domain.", "paper_summary_zh": "語言模型的領域適應，包括大型語言模型 (LLM)，隨著這些模型的使用持續擴展而變得越來越重要。本研究展示了 Composition to Augment Language Models (CALM) 在適應金融領域方面的有效性。CALM 是一個模型，透過在具有不同功能的兩個 LLM 之間引入交叉注意力來擴展現有模型的能力。在我們的實驗中，我們開發了一個 CALM，透過利用一個財務專業的 LLM 來增強具有強大回應能力的 LLM 的財務表現。值得注意的是，CALM 是使用與訓練財務專業 LLM 不同的財務資料集進行訓練的，這證實了 CALM 適應各種資料集的能力。透過定量的日文財務基準和定性的回應比較來評估模型，證明 CALM 能夠產生比原始模型和基線更高的分數的優異回應。此外，對連接點的比較實驗顯示，連接模型的中間層在促進適應金融領域方面最有效。這些發現證實 CALM 是將 LLM 適應到金融領域的實用方法。", "author": "Kota Tanabe et.al.", "authors": "Kota Tanabe, Masanori Hirano, Kazuki Matoya, Kentaro Imajo, Hiroki Sakaji, Itsuki Noda", "id": "2411.09249v1", "paper_url": "http://arxiv.org/abs/2411.09249v1", "repo": "null"}}