{"2502.13125": {"publish_time": "2025-02-18", "title": "RuozhiBench: Evaluating LLMs with Logical Fallacies and Misleading Premises", "paper_summary": "Recent advances in large language models (LLMs) have shown that they can\nanswer questions requiring complex reasoning. However, their ability to\nidentify and respond to text containing logical fallacies or deliberately\nmisleading premises remains less studied. To address this gap, we introduce\nRuozhiBench, a bilingual dataset comprising 677 carefully curated questions\nthat contain various forms of deceptive reasoning, meticulously crafted through\nextensive human effort and expert review. In a comprehensive evaluation of 17\nLLMs from 5 Series over RuozhiBench using both open-ended and two-choice\nformats, we conduct extensive analyses on evaluation protocols and result\npatterns. Despite their high scores on conventional benchmarks, these models\nshowed limited ability to detect and reason correctly about logical fallacies,\nwith even the best-performing model, Claude-3-haiku, achieving only 62%\naccuracy compared to the human of more than 90%.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展顯示，它們可以回答需要複雜推理的問題。然而，它們識別和回應包含邏輯謬誤或故意誤導前提的文本的能力仍未得到充分研究。為了解決這個差距，我們引入了 RuozhiBench，這是一個雙語資料集，包含 677 個經過仔細策劃的問題，其中包含各種形式的欺騙性推理，並透過廣泛的人力投入和專家審查精心製作。在使用開放式和二選一格式對來自 5 個系列的 17 個 LLM 進行 RuozhiBench 的全面評估中，我們對評估協定和結果模式進行了廣泛的分析。儘管它們在傳統基準測試中獲得了高分，但這些模型在檢測和正確推理邏輯謬誤方面表現出的能力有限，即使是效能最好的模型 Claude-3-haiku，與人類的 90% 以上相比，也只達到了 62% 的準確度。", "author": "Zenan Zhai et.al.", "authors": "Zenan Zhai, Hao Li, Xudong Han, Zhenxuan Zhang, Yixuan Zhang, Timothy Baldwin, Haonan Li", "id": "2502.13125v1", "paper_url": "http://arxiv.org/abs/2502.13125v1", "repo": "null"}}