{"2502.15680": {"publish_time": "2025-02-21", "title": "Privacy Ripple Effects from Adding or Removing Personal Information in Language Model Training", "paper_summary": "Due to the sensitive nature of personally identifiable information (PII), its\nowners may have the authority to control its inclusion or request its removal\nfrom large-language model (LLM) training. Beyond this, PII may be added or\nremoved from training datasets due to evolving dataset curation techniques,\nbecause they were newly scraped for retraining, or because they were included\nin a new downstream fine-tuning stage. We find that the amount and ease of PII\nmemorization is a dynamic property of a model that evolves throughout training\npipelines and depends on commonly altered design choices. We characterize three\nsuch novel phenomena: (1) similar-appearing PII seen later in training can\nelicit memorization of earlier-seen sequences in what we call assisted\nmemorization, and this is a significant factor (in our settings, up to 1/3);\n(2) adding PII can increase memorization of other PII significantly (in our\nsettings, as much as $\\approx\\!7.5\\times$); and (3) removing PII can lead to\nother PII being memorized. Model creators should consider these first- and\nsecond-order privacy risks when training models to avoid the risk of new PII\nregurgitation.", "paper_summary_zh": "由於個人可識別資訊 (PII) 的敏感性質，其所有者可能具有控制其包含或要求從大型語言模型 (LLM) 訓練中移除它的權限。除此之外，PII 可能會由於不斷演進的資料集策展技術、因為重新訓練而被重新擷取，或因為它們包含在新的下游微調階段中，而被新增或從訓練資料集中移除。我們發現 PII 的記憶量和容易性是模型的動態屬性，它會在整個訓練管線中演化，並且取決於經常更改的設計選擇。我們描述了三種這樣的現象：(1) 相似出現的 PII 在訓練中後續看到時，會引發對先前看到的序列的記憶，我們稱之為輔助記憶，這是一個重要的因素（在我們的設定中，高達 1/3）；(2) 增加 PII 可以顯著增加對其他 PII 的記憶（在我們的設定中，高達 $\\approx\\!7.5\\times$）；(3) 移除 PII 可能導致其他 PII 被記憶。模型建立者在訓練模型時，應考慮這些一階和二階隱私風險，以避免新的 PII 重新出現的風險。", "author": "Jaydeep Borkar et.al.", "authors": "Jaydeep Borkar, Matthew Jagielski, Katherine Lee, Niloofar Mireshghallah, David A. Smith, Christopher A. Choquette-Choo", "id": "2502.15680v1", "paper_url": "http://arxiv.org/abs/2502.15680v1", "repo": "null"}}