{"2405.16830": {"publish_time": "2024-05-27", "title": "Structured Graph Network for Constrained Robot Crowd Navigation with Low Fidelity Simulation", "paper_summary": "We investigate the feasibility of deploying reinforcement learning (RL)\npolicies for constrained crowd navigation using a low-fidelity simulator. We\nintroduce a representation of the dynamic environment, separating human and\nobstacle representations. Humans are represented through detected states, while\nobstacles are represented as computed point clouds based on maps and robot\nlocalization. This representation enables RL policies trained in a low-fidelity\nsimulator to deploy in real world with a reduced sim2real gap. Additionally, we\npropose a spatio-temporal graph to model the interactions between agents and\nobstacles. Based on the graph, we use attention mechanisms to capture the\nrobot-human, human-human, and human-obstacle interactions. Our method\nsignificantly improves navigation performance in both simulated and real-world\nenvironments. Video demonstrations can be found at\nhttps://sites.google.com/view/constrained-crowdnav/home.", "paper_summary_zh": "我們研究使用低保真模擬器部署強化學習 (RL) 策略以進行受限人群導航的可行性。我們引入動態環境的表示，將人類和障礙物表示分開。人類透過偵測到的狀態表示，而障礙物則表示為基於地圖和機器人定位的計算點雲。此表示法使在低保真模擬器中訓練的 RL 策略能夠在真實世界中部署，並縮小 sim2real 差距。此外，我們提出一個時空圖形來模擬代理和障礙物之間的交互作用。基於此圖形，我們使用注意力機制來捕捉機器人與人類、人類與人類以及人類與障礙物的交互作用。我們的這種方法顯著改善了在模擬和真實世界環境中的導航效能。影片示範可以在 https://sites.google.com/view/constrained-crowdnav/home 找到。", "author": "Shuijing Liu et.al.", "authors": "Shuijing Liu, Kaiwen Hong, Neeloy Chakraborty, Katherine Driggs-Campbell", "id": "2405.16830v2", "paper_url": "http://arxiv.org/abs/2405.16830v2", "repo": "null"}}