{"2407.07321": {"publish_time": "2024-07-10", "title": "RAG vs. Long Context: Examining Frontier Large Language Models for Environmental Review Document Comprehension", "paper_summary": "Large Language Models (LLMs) have been applied to many research problems\nacross various domains. One of the applications of LLMs is providing\nquestion-answering systems that cater to users from different fields. The\neffectiveness of LLM-based question-answering systems has already been\nestablished at an acceptable level for users posing questions in popular and\npublic domains such as trivia and literature. However, it has not often been\nestablished in niche domains that traditionally require specialized expertise.\nTo this end, we construct the NEPAQuAD1.0 benchmark to evaluate the performance\nof three frontier LLMs -- Claude Sonnet, Gemini, and GPT-4 -- when answering\nquestions originating from Environmental Impact Statements prepared by U.S.\nfederal government agencies in accordance with the National Environmental\nEnvironmental Act (NEPA). We specifically measure the ability of LLMs to\nunderstand the nuances of legal, technical, and compliance-related information\npresent in NEPA documents in different contextual scenarios. For example, we\ntest the LLMs' internal prior NEPA knowledge by providing questions without any\ncontext, as well as assess how LLMs synthesize the contextual information\npresent in long NEPA documents to facilitate the question/answering task. We\ncompare the performance of the long context LLMs and RAG powered models in\nhandling different types of questions (e.g., problem-solving, divergent). Our\nresults suggest that RAG powered models significantly outperform the long\ncontext models in the answer accuracy regardless of the choice of the frontier\nLLM. Our further analysis reveals that many models perform better answering\nclosed questions than divergent and problem-solving questions.", "paper_summary_zh": "大型語言模型 (LLM) 已應用於各種領域的許多研究問題。LLM 的應用之一是提供針對不同領域使用者的問答系統。基於 LLM 的問答系統的有效性已在熱門和公共領域（例如瑣事和文學）中提出問題的使用者中達到可接受的水平。然而，它並未經常在傳統上需要專業知識的利基領域中建立。為此，我們構建了 NEPAQuAD1.0 基準來評估三個前沿 LLM 的性能——Claude Sonnet、Gemini 和 GPT-4——在回答由美國聯邦政府機構根據國家環境環境法 (NEPA) 編製的環境影響報告書中產生的問題時。我們特別衡量了 LLM 在不同語境場景中理解 NEPA 文件中存在的法律、技術和合規相關資訊細微差別的能力。例如，我們通過提供沒有任何背景的問題來測試 LLM 的內部先驗 NEPA 知識，並評估 LLM 如何綜合 NEPA 長文件中存在的語境資訊以促進問答任務。我們比較了長語境 LLM 和 RAG 驅動模型在處理不同類型問題（例如，問題解決、發散）方面的性能。我們的結果表明，無論選擇哪個前沿 LLM，RAG 驅動模型在回答準確性方面都顯著優於長語境模型。我們的進一步分析表明，許多模型在回答封閉式問題方面的表現優於發散式和問題解決問題。", "author": "Hung Phan et.al.", "authors": "Hung Phan, Anurag Acharya, Sarthak Chaturvedi, Shivam Sharma, Mike Parker, Dan Nally, Ali Jannesari, Karl Pazdernik, Mahantesh Halappanavar, Sai Munikoti, Sameera Horawalavithana", "id": "2407.07321v1", "paper_url": "http://arxiv.org/abs/2407.07321v1", "repo": "null"}}