{"2411.19579": {"publish_time": "2024-11-29", "title": "ICPR 2024 Competition on Multilingual Claim-Span Identification", "paper_summary": "A lot of claims are made in social media posts, which may contain\nmisinformation or fake news. Hence, it is crucial to identify claims as a first\nstep towards claim verification. Given the huge number of social media posts,\nthe task of identifying claims needs to be automated. This competition deals\nwith the task of 'Claim Span Identification' in which, given a text, parts /\nspans that correspond to claims are to be identified. This task is more\nchallenging than the traditional binary classification of text into claim or\nnot-claim, and requires state-of-the-art methods in Pattern Recognition,\nNatural Language Processing and Machine Learning. For this competition, we used\na newly developed dataset called HECSI containing about 8K posts in English and\nabout 8K posts in Hindi with claim-spans marked by human annotators. This paper\ngives an overview of the competition, and the solutions developed by the\nparticipating teams.", "paper_summary_zh": "在社群媒體貼文中提出了許多主張，這些主張可能包含錯誤資訊或假新聞。因此，將主張視為主張驗證的第一步至關重要。鑑於社群媒體貼文的數量龐大，識別主張的任務需要自動化。這項競賽處理「主張跨度識別」的任務，其中在給定的文字中，識別與主張相符的部分/跨度。這項任務比傳統的二元分類（將文字分類為主張或非主張）更具挑戰性，需要模式識別、自然語言處理和機器學習的最新方法。對於這項競賽，我們使用了新開發的名為 HECSI 的資料集，其中包含約 8K 篇英文貼文和約 8K 篇印地語貼文，並由人類註解者標記主張跨度。本文概述了競賽和參與團隊開發的解決方案。", "author": "Soham Poddar et.al.", "authors": "Soham Poddar, Biswajit Paul, Moumita Basu, Saptarshi Ghosh", "id": "2411.19579v1", "paper_url": "http://arxiv.org/abs/2411.19579v1", "repo": "null"}}