{"2502.14777": {"publish_time": "2025-02-20", "title": "Making Universal Policies Universal", "paper_summary": "The development of a generalist agent capable of solving a wide range of\nsequential decision-making tasks remains a significant challenge. We address\nthis problem in a cross-agent setup where agents share the same observation\nspace but differ in their action spaces. Our approach builds on the universal\npolicy framework, which decouples policy learning into two stages: a\ndiffusion-based planner that generates observation sequences and an inverse\ndynamics model that assigns actions to these plans. We propose a method for\ntraining the planner on a joint dataset composed of trajectories from all\nagents. This method offers the benefit of positive transfer by pooling data\nfrom different agents, while the primary challenge lies in adapting shared\nplans to each agent's unique constraints. We evaluate our approach on the\nBabyAI environment, covering tasks of varying complexity, and demonstrate\npositive transfer across agents. Additionally, we examine the planner's\ngeneralisation ability to unseen agents and compare our method to traditional\nimitation learning approaches. By training on a pooled dataset from multiple\nagents, our universal policy achieves an improvement of up to $42.20\\%$ in task\ncompletion accuracy compared to a policy trained on a dataset from a single\nagent.", "paper_summary_zh": "開發一種能夠解決廣泛順序決策任務的通才代理仍然是一項重大挑戰。我們在跨代理設置中解決這個問題，其中代理共享相同的觀察空間，但在其動作空間中有所不同。我們的做法建立在通用策略框架之上，該框架將策略學習解耦為兩個階段：生成觀察序列的基於擴散的規劃器和將動作分配給這些計劃的逆動態模型。我們提出了一種在由所有代理的軌跡組成的聯合數據集上訓練規劃器的方法。這種方法提供了通過彙總來自不同代理的數據來進行正向傳輸的好處，而主要的挑戰在於將共享計劃適應於每個代理的唯一約束。我們在 BabyAI 環境中評估了我們的做法，涵蓋了不同複雜程度的任務，並展示了跨代理的正向傳輸。此外，我們檢查了規劃器對未見代理的概括能力，並將我們的做法與傳統的模仿學習方法進行了比較。通過在來自多個代理的彙總數據集上進行訓練，我們的通用策略在任務完成準確度方面實現了高達 42.20% 的改進，而從單個代理的數據集上訓練的策略。", "author": "Niklas Höpner et.al.", "authors": "Niklas Höpner, David Kuric, Herke van Hoof", "id": "2502.14777v1", "paper_url": "http://arxiv.org/abs/2502.14777v1", "repo": "null"}}