{"2409.10102": {"publish_time": "2024-09-16", "title": "Trustworthiness in Retrieval-Augmented Generation Systems: A Survey", "paper_summary": "Retrieval-Augmented Generation (RAG) has quickly grown into a pivotal\nparadigm in the development of Large Language Models (LLMs). While much of the\ncurrent research in this field focuses on performance optimization,\nparticularly in terms of accuracy and efficiency, the trustworthiness of RAG\nsystems remains an area still under exploration. From a positive perspective,\nRAG systems are promising to enhance LLMs by providing them with useful and\nup-to-date knowledge from vast external databases, thereby mitigating the\nlong-standing problem of hallucination. While from a negative perspective, RAG\nsystems are at the risk of generating undesirable contents if the retrieved\ninformation is either inappropriate or poorly utilized. To address these\nconcerns, we propose a unified framework that assesses the trustworthiness of\nRAG systems across six key dimensions: factuality, robustness, fairness,\ntransparency, accountability, and privacy. Within this framework, we thoroughly\nreview the existing literature on each dimension. Additionally, we create the\nevaluation benchmark regarding the six dimensions and conduct comprehensive\nevaluations for a variety of proprietary and open-source models. Finally, we\nidentify the potential challenges for future research based on our\ninvestigation results. Through this work, we aim to lay a structured foundation\nfor future investigations and provide practical insights for enhancing the\ntrustworthiness of RAG systems in real-world applications.", "paper_summary_zh": "檢索增強式生成（RAG）已迅速發展成為大型語言模型（LLM）發展中的關鍵範例。雖然此領域的許多現行研究都著重於效能最佳化，特別是在準確度和效率方面，但 RAG 系統的信賴度仍是仍在探索中的領域。從正面的角度來看，RAG 系統有望透過提供來自廣大外部資料庫的有用且最新的知識來增強 LLM，進而減輕長期存在的幻覺問題。然而，從負面的角度來看，如果檢索到的資訊不適當或使用不當，RAG 系統就有產生不良內容的風險。為了解決這些問題，我們提出一個統一的架構，用來評估 RAG 系統在六個關鍵面向上的信賴度：事實性、穩健性、公平性、透明度、問責制和隱私權。在此架構中，我們徹底檢視了各面向的現有文獻。此外，我們建立了關於六個面向的評估基準，並對各種專有和開放原始碼模型進行了全面的評估。最後，我們根據我們的調查結果，找出未來研究的潛在挑戰。透過這項工作，我們旨在為未來的調查奠定結構化的基礎，並提供實用的見解，以提升 RAG 系統在真實世界應用中的信賴度。", "author": "Yujia Zhou et.al.", "authors": "Yujia Zhou, Yan Liu, Xiaoxi Li, Jiajie Jin, Hongjin Qian, Zheng Liu, Chaozhuo Li, Zhicheng Dou, Tsung-Yi Ho, Philip S. Yu", "id": "2409.10102v1", "paper_url": "http://arxiv.org/abs/2409.10102v1", "repo": "https://github.com/smallporridge/trustworthyrag"}}