{"2501.06848": {"publish_time": "2025-01-12", "title": "A General Framework for Inference-time Scaling and Steering of Diffusion Models", "paper_summary": "Diffusion models produce impressive results in modalities ranging from images\nand video to protein design and text. However, generating samples with\nuser-specified properties remains a challenge. Recent research proposes\nfine-tuning models to maximize rewards that capture desired properties, but\nthese methods require expensive training and are prone to mode collapse. In\nthis work, we propose Feynman Kac (FK) steering, an inference-time framework\nfor steering diffusion models with reward functions. FK steering works by\nsampling a system of multiple interacting diffusion processes, called\nparticles, and resampling particles at intermediate steps based on scores\ncomputed using functions called potentials. Potentials are defined using\nrewards for intermediate states and are selected such that a high value\nindicates that the particle will yield a high-reward sample. We explore various\nchoices of potentials, intermediate rewards, and samplers. We evaluate FK\nsteering on text-to-image and text diffusion models. For steering text-to-image\nmodels with a human preference reward, we find that FK steering a 0.8B\nparameter model outperforms a 2.6B parameter fine-tuned model on prompt\nfidelity, with faster sampling and no training. For steering text diffusion\nmodels with rewards for text quality and specific text attributes, we find that\nFK steering generates lower perplexity, more linguistically acceptable outputs\nand enables gradient-free control of attributes like toxicity. Our results\ndemonstrate that inference-time scaling and steering of diffusion models, even\nwith off-the-shelf rewards, can provide significant sample quality gains and\ncontrollability benefits. Code is available at\nhttps://github.com/zacharyhorvitz/Fk-Diffusion-Steering .", "paper_summary_zh": "擴散模型在影像、影片、蛋白設計和文字等模式中產生令人印象深刻的結果。然而，產生具有使用者指定屬性的樣本仍然是一項挑戰。最近的研究提出微調模型以最大化捕捉所需屬性的獎勵，但這些方法需要昂貴的訓練且容易崩潰。在這項工作中，我們提出費曼卡克 (FK) 導引，一個用於使用獎勵函數導引擴散模型的推論時間架構。FK 導引透過取樣一個由多個交互擴散過程組成的系統（稱為粒子）來運作，並根據使用稱為勢函數的函數計算的分數在中間步驟中重新取樣粒子。勢函數使用中間狀態的獎勵來定義，並選擇一個高值表示粒子將產生高獎勵樣本。我們探索各種勢函數、中間獎勵和取樣器的選擇。我們評估文本到影像和文本擴散模型上的 FK 導引。對於使用人類偏好獎勵來導引文本到影像模型，我們發現 FK 導引一個 0.8B 參數模型在提示保真度上優於一個 2.6B 參數微調模型，且取樣速度更快且無需訓練。對於使用文本品質和特定文本屬性獎勵來導引文本擴散模型，我們發現 FK 導引產生較低的困惑度、更具語言可接受性的輸出，並能對毒性等屬性進行無梯度控制。我們的結果證明，即使使用現成的獎勵，擴散模型的推論時間縮放和導引也能提供顯著的樣本品質提升和可控性優勢。程式碼可在 https://github.com/zacharyhorvitz/Fk-Diffusion-Steering 取得。", "author": "Raghav Singhal et.al.", "authors": "Raghav Singhal, Zachary Horvitz, Ryan Teehan, Mengye Ren, Zhou Yu, Kathleen McKeown, Rajesh Ranganath", "id": "2501.06848v1", "paper_url": "http://arxiv.org/abs/2501.06848v1", "repo": "https://github.com/zacharyhorvitz/fk-diffusion-steering"}}