{"2410.14219": {"publish_time": "2024-10-18", "title": "Formal Explanations for Neuro-Symbolic AI", "paper_summary": "Despite the practical success of Artificial Intelligence (AI), current neural\nAI algorithms face two significant issues. First, the decisions made by neural\narchitectures are often prone to bias and brittleness. Second, when a chain of\nreasoning is required, neural systems often perform poorly. Neuro-symbolic\nartificial intelligence is a promising approach that tackles these (and other)\nweaknesses by combining the power of neural perception and symbolic reasoning.\nMeanwhile, the success of AI has made it critical to understand its behaviour,\nleading to the development of explainable artificial intelligence (XAI). While\nneuro-symbolic AI systems have important advantages over purely neural AI, we\nstill need to explain their actions, which are obscured by the interactions of\nthe neural and symbolic components. To address the issue, this paper proposes a\nformal approach to explaining the decisions of neuro-symbolic systems. The\napproach hinges on the use of formal abductive explanations and on solving the\nneuro-symbolic explainability problem hierarchically. Namely, it first computes\na formal explanation for the symbolic component of the system, which serves to\nidentify a subset of the individual parts of neural information that needs to\nbe explained. This is followed by explaining only those individual neural\ninputs, independently of each other, which facilitates succinctness of\nhierarchical formal explanations and helps to increase the overall performance\nof the approach. Experimental results for a few complex reasoning tasks\ndemonstrate practical efficiency of the proposed approach, in comparison to\npurely neural systems, from the perspective of explanation size, explanation\ntime, training time, model sizes, and the quality of explanations reported.", "paper_summary_zh": "儘管人工智慧 (AI) 在實務上獲得成功，目前的神經網路 AI 演算法面臨兩個重大問題。首先，神經網路架構做出的決策常常容易出現偏差和脆弱性。其次，當需要推理鏈時，神經系統常常表現不佳。神經符號人工智慧是一種有前途的方法，它結合了神經感知和符號推理的力量，來解決這些（和其他）弱點。同時，AI 的成功使得理解其行為變得至關重要，這導致了可解釋人工智慧 (XAI) 的發展。雖然神經符號 AI 系統比純粹的神經網路 AI 具有重要的優勢，但我們仍然需要解釋其行為，而這些行為被神經元和符號組件的交互作用所掩蓋。為了解決這個問題，本文提出了一個正式的方法來解釋神經符號系統的決策。該方法依賴於形式約化解釋的使用，並分層解決神經符號可解釋性問題。具體來說，它首先為系統的符號組件計算一個形式解釋，用於識別需要解釋的神經資訊的個別部分的子集。接著只解釋那些個別的神經輸入，它們彼此獨立，這有助於分層形式解釋的簡潔性，並有助於提高方法的整體效能。幾個複雜推理任務的實驗結果證明了所提出的方法的實務效率，與純粹的神經系統相比，從解釋大小、解釋時間、訓練時間、模型大小和報告的解釋品質的角度來看。", "author": "Sushmita Paul et.al.", "authors": "Sushmita Paul, Jinqiang Yu, Jip J. Dekker, Alexey Ignatiev, Peter J. Stuckey", "id": "2410.14219v1", "paper_url": "http://arxiv.org/abs/2410.14219v1", "repo": "null"}}