{"2412.13171": {"publish_time": "2024-12-17", "title": "Compressed Chain of Thought: Efficient Reasoning Through Dense Representations", "paper_summary": "Chain-of-thought (CoT) decoding enables language models to improve reasoning\nperformance at the cost of high generation latency in decoding. Recent\nproposals have explored variants of contemplation tokens, a term we introduce\nthat refers to special tokens used during inference to allow for extra\ncomputation. Prior work has considered fixed-length sequences drawn from a\ndiscrete set of embeddings as contemplation tokens. Here we propose Compressed\nChain-of-Thought (CCoT), a framework to generate contentful and continuous\ncontemplation tokens of variable sequence length. The generated contemplation\ntokens are compressed representations of explicit reasoning chains, and our\nmethod can be applied to off-the-shelf decoder language models. Through\nexperiments, we illustrate how CCoT enables additional reasoning over dense\ncontentful representations to achieve corresponding improvements in accuracy.\nMoreover, the reasoning improvements can be adaptively modified on demand by\ncontrolling the number of contemplation tokens generated.", "paper_summary_zh": "鏈式思考 (CoT) 解碼讓語言模型能夠改善推理效能，代價是解碼時產生較高的生成延遲。最近的提案探索了沉思標記的變體，我們引入了一個術語來指稱在推論期間用於允許額外運算的特殊標記。先前的研究將從離散嵌入集合中抽取的固定長度序列視為沉思標記。在此，我們提出壓縮鏈式思考 (CCoT)，一個用於產生內容豐富且連續的變長沉思標記的架構。產生的沉思標記是明確推理鏈的壓縮表示，而我們的模型可以應用於現成的解碼器語言模型。透過實驗，我們說明 CCoT 如何在密集的內容豐富表示中進行額外的推理，以達成相應的準確性改善。此外，推理改善可以透過控制產生的沉思標記數量，依需求進行適應性修改。", "author": "Jeffrey Cheng et.al.", "authors": "Jeffrey Cheng, Benjamin Van Durme", "id": "2412.13171v1", "paper_url": "http://arxiv.org/abs/2412.13171v1", "repo": "null"}}