{"2408.14750": {"publish_time": "2024-08-27", "title": "LyCon: Lyrics Reconstruction from the Bag-of-Words Using Large Language Models", "paper_summary": "This paper addresses the unique challenge of conducting research in lyric\nstudies, where direct use of lyrics is often restricted due to copyright\nconcerns. Unlike typical data, internet-sourced lyrics are frequently protected\nunder copyright law, necessitating alternative approaches. Our study introduces\na novel method for generating copyright-free lyrics from publicly available\nBag-of-Words (BoW) datasets, which contain the vocabulary of lyrics but not the\nlyrics themselves. Utilizing metadata associated with BoW datasets and large\nlanguage models, we successfully reconstructed lyrics. We have compiled and\nmade available a dataset of reconstructed lyrics, LyCon, aligned with metadata\nfrom renowned sources including the Million Song Dataset, Deezer Mood Detection\nDataset, and AllMusic Genre Dataset, available for public access. We believe\nthat the integration of metadata such as mood annotations or genres enables a\nvariety of academic experiments on lyrics, such as conditional lyric\ngeneration.", "paper_summary_zh": "本文探討在歌詞研究中進行研究的獨特挑戰，由於版權問題，通常會限制直接使用歌詞。與一般資料不同的是，網路上取得的歌詞經常受著作權法保護，因此需要另闢蹊徑。我們的研究提出了一種創新的方法，從公開的詞彙袋 (BoW) 資料集產生無版權的歌詞，這些資料集包含歌詞的詞彙，但並非歌詞本身。我們利用與 BoW 資料集相關的元資料和大型語言模型，成功重建歌詞。我們已經編譯並提供了一個重建歌詞的資料集 LyCon，與來自知名來源的元資料相符，包括百萬歌曲資料集、Deezer 情緒偵測資料集和 AllMusic 類型資料集，可供公眾存取。我們相信，整合元資料（例如情緒註解或類型）可以進行各種關於歌詞的學術實驗，例如條件式歌詞產生。", "author": "Haven Kim et.al.", "authors": "Haven Kim, Kahyun Choi", "id": "2408.14750v1", "paper_url": "http://arxiv.org/abs/2408.14750v1", "repo": "https://github.com/havenpersona/lycon"}}