{"2502.04580": {"publish_time": "2025-02-07", "title": "Technical Debt in In-Context Learning: Diminishing Efficiency in Long Context", "paper_summary": "Transformers have demonstrated remarkable in-context learning (ICL)\ncapabilities, adapting to new tasks by simply conditioning on demonstrations\nwithout parameter updates. Compelling empirical and theoretical evidence\nsuggests that ICL, as a general-purpose learner, could outperform task-specific\nmodels. However, it remains unclear to what extent the transformers optimally\nlearn in-context compared to principled learning algorithms. To bridge this\ngap, we introduce a new framework for quantifying optimality of ICL as a\nlearning algorithm in stylized settings. Our findings reveal a striking\ndichotomy: while ICL initially matches the efficiency of a Bayes optimal\nestimator, its efficiency significantly deteriorates in long context. Through\nan information-theoretic analysis, we show that the diminishing efficiency is\ninherent to ICL. These results clarify the trade-offs in adopting ICL as a\nuniversal problem solver, motivating a new generation of on-the-fly adaptive\nmethods without the diminishing efficiency.", "paper_summary_zh": "Transformer已展現出卓越的脈絡學習 (ICL) 能力，只要透過示範進行條件化，就能適應新任務，而無需參數更新。令人信服的經驗和理論證據表明，ICL 作為通用學習器，可以優於特定任務模型。然而，Transformer在脈絡中學習的最佳程度與原則性學習演算法相比，仍不清楚。為了彌補這個差距，我們引入了一個新的架構，用於量化 ICL 作為標準化設定中的學習演算法的最佳性。我們的發現揭示了一個驚人的二分法：雖然 ICL 最初與貝氏最佳估計器的效率相匹配，但其效率在長脈絡中會顯著下降。透過資訊理論分析，我們表明效率下降是 ICL 的固有特徵。這些結果闡明了採用 ICL 作為通用問題解決者的權衡，激勵了新一代即時自適應方法，而沒有效率下降的問題。", "author": "Taejong Joo et.al.", "authors": "Taejong Joo, Diego Klabjan", "id": "2502.04580v1", "paper_url": "http://arxiv.org/abs/2502.04580v1", "repo": "null"}}