{"2406.02006": {"publish_time": "2024-06-04", "title": "ODE-based Learning to Optimize", "paper_summary": "Recent years have seen a growing interest in understanding acceleration\nmethods through the lens of ordinary differential equations (ODEs). Despite the\ntheoretical advancements, translating the rapid convergence observed in\ncontinuous-time models to discrete-time iterative methods poses significant\nchallenges. In this paper, we present a comprehensive framework integrating the\ninertial systems with Hessian-driven damping equation (ISHD) and learning-based\napproaches for developing optimization methods through a deep synergy of\ntheoretical insights. We first establish the convergence condition for ensuring\nthe convergence of the solution trajectory of ISHD. Then, we show that provided\nthe stability condition, another relaxed requirement on the coefficients of\nISHD, the sequence generated through the explicit Euler discretization of ISHD\nconverges, which gives a large family of practical optimization methods. In\norder to select the best optimization method in this family for certain\nproblems, we introduce the stopping time, the time required for an optimization\nmethod derived from ISHD to achieve a predefined level of suboptimality. Then,\nwe formulate a novel learning to optimize (L2O) problem aimed at minimizing the\nstopping time subject to the convergence and stability condition. To navigate\nthis learning problem, we present an algorithm combining stochastic\noptimization and the penalty method (StoPM). The convergence of StoPM using the\nconservative gradient is proved. Empirical validation of our framework is\nconducted through extensive numerical experiments across a diverse set of\noptimization problems. These experiments showcase the superior performance of\nthe learned optimization methods.", "paper_summary_zh": "近年來，人們越來越有興趣透過常微分方程式 (ODE) 的角度來了解加速方法。儘管理論上有所進展，但將連續時間模型中觀察到的快速收斂轉換為離散時間反覆運算方法，仍面臨重大挑戰。在本文中，我們提出了一個綜合架構，將慣性系統與 Hessian 驅動阻尼方程式 (ISHD) 和基於學習的方法整合起來，透過理論見解的深度協同作用來開發最佳化方法。我們首先建立收斂條件，以確保 ISHD 解決軌跡的收斂性。然後，我們證明在穩定條件下，ISHD 係數的另一個放寬要求，透過 ISHD 的明確歐拉離散化所生成的序列會收斂，這提供了一大類實用的最佳化方法。為了在此類別中為特定問題選擇最佳最佳化方法，我們引入了停止時間，這是從 ISHD 衍生的最佳化方法達到預定義次最佳水準所需的時間。然後，我們制定了一個新穎的學習最佳化 (L2O) 問題，旨在最小化停止時間，並符合收斂性和穩定性條件。為了解決這個學習問題，我們提出了一種結合隨機最佳化與懲罰方法 (StoPM) 的演算法。使用保守梯度時，StoPM 的收斂性已被證明。我們透過針對各種最佳化問題進行廣泛的數值實驗，對我們的架構進行實證驗證。這些實驗展示了已學習最佳化方法的優異效能。", "author": "Zhonglin Xie et.al.", "authors": "Zhonglin Xie, Wotao Yin, Zaiwen Wen", "id": "2406.02006v1", "paper_url": "http://arxiv.org/abs/2406.02006v1", "repo": "null"}}