{"2504.20752": {"publish_time": "2025-04-29", "title": "Grokking in the Wild: Data Augmentation for Real-World Multi-Hop Reasoning with Transformers", "paper_summary": "Transformers have achieved great success in numerous NLP tasks but continue\nto exhibit notable gaps in multi-step factual reasoning, especially when\nreal-world knowledge is sparse. Recent advances in grokking have demonstrated\nthat neural networks can transition from memorizing to perfectly generalizing\nonce they detect underlying logical patterns - yet these studies have primarily\nused small, synthetic tasks. In this paper, for the first time, we extend\ngrokking to real-world factual data and address the challenge of dataset\nsparsity by augmenting existing knowledge graphs with carefully designed\nsynthetic data to raise the ratio $\\phi_r$ of inferred facts to atomic facts\nabove the threshold required for grokking. Surprisingly, we find that even\nfactually incorrect synthetic data can strengthen emergent reasoning circuits\nrather than degrade accuracy, as it forces the model to rely on relational\nstructure rather than memorization. When evaluated on multi-hop reasoning\nbenchmarks, our approach achieves up to 95-100% accuracy on 2WikiMultiHopQA -\nsubstantially improving over strong baselines and matching or exceeding current\nstate-of-the-art results. We further provide an in-depth analysis of how\nincreasing $\\phi_r$ drives the formation of generalizing circuits inside\nTransformers. Our findings suggest that grokking-based data augmentation can\nunlock implicit multi-hop reasoning capabilities, opening the door to more\nrobust and interpretable factual reasoning in large-scale language models.", "paper_summary_zh": "<paragraph>Transformer 模型在許多自然語言處理任務中取得了巨大的成功，但在多步驟事實推理方面仍存在明顯的差距，尤其是在現實世界知識稀疏的情況下。最近在「頓悟式學習」(grokking) 方面的進展表明，一旦神經網路檢測到潛在的邏輯模式，它們就能從記憶轉變為完美地泛化——然而，這些研究主要使用的是小型合成任務。在本文中，我們首次將「頓悟式學習」擴展到現實世界的真實數據，並透過使用精心設計的合成數據來增強現有的知識圖譜，從而提高推斷事實與原子事實的比率 $\\phi_r$ 超過「頓悟式學習」所需的閾值，以此來應對數據集稀疏性的挑戰。令人驚訝的是，我們發現即使是事實上不正確的合成數據也能夠強化新興的推理迴路，而不是降低準確性，因為它迫使模型依賴關係結構而不是記憶。在多跳推理基準測試中，我們的方法在 2WikiMultiHopQA 上達到了 95-100% 的準確率——這比強大的基準模型有了顯著的提升，並且達到或超過了目前的最佳結果。我們進一步深入分析了增加 $\\phi_r$ 如何驅動 Transformer 內部泛化迴路的形成。我們的研究結果表明，基於「頓悟式學習」的數據增強可以釋放隱含的多跳推理能力，為大規模語言模型中更強大和更具可解釋性的事實推理打開了大門。</paragraph>\n", "author": "Roman Abramov et.al.", "authors": "Roman Abramov, Felix Steinbauer, Gjergji Kasneci", "id": "2504.20752v1", "paper_url": "http://arxiv.org/abs/2504.20752v1", "repo": "null"}}