{"2408.14329": {"publish_time": "2024-08-26", "title": "PHEVA: A Privacy-preserving Human-centric Video Anomaly Detection Dataset", "paper_summary": "PHEVA, a Privacy-preserving Human-centric Ethical Video Anomaly detection\ndataset. By removing pixel information and providing only de-identified human\nannotations, PHEVA safeguards personally identifiable information. The dataset\nincludes seven indoor/outdoor scenes, featuring one novel, context-specific\ncamera, and offers over 5x the pose-annotated frames compared to the largest\nprevious dataset. This study benchmarks state-of-the-art methods on PHEVA using\na comprehensive set of metrics, including the 10% Error Rate (10ER), a metric\nused for anomaly detection for the first time providing insights relevant to\nreal-world deployment. As the first of its kind, PHEVA bridges the gap between\nconventional training and real-world deployment by introducing continual\nlearning benchmarks, with models outperforming traditional methods in 82.14% of\ncases. The dataset is publicly available at\nhttps://github.com/TeCSAR-UNCC/PHEVA.git.", "paper_summary_zh": "PHEVA，一個注重隱私的人本道德影片異常偵測資料集。透過移除像素資訊並僅提供去識別化的人類註解，PHEVA 保護個人可識別資訊。該資料集包含七個室內/室外場景，具備一個新穎的背景特定相機，並提供比先前最大的資料集多出 5 倍以上的姿勢註解影格。這項研究使用全面的指標集，包括 10% 錯誤率 (10ER)，這是一個首次用於異常偵測的指標，提供與實際世界部署相關的見解，來評量 PHEVA 上的最新方法。作為同類型中的第一個，PHEVA 透過引入持續學習基準，縮小了傳統訓練與實際世界部署之間的差距，在 82.14% 的案例中，模型優於傳統方法。該資料集可於 https://github.com/TeCSAR-UNCC/PHEVA.git 公開取得。", "author": "Ghazal Alinezhad Noghre et.al.", "authors": "Ghazal Alinezhad Noghre, Shanle Yao, Armin Danesh Pazho, Babak Rahimi Ardabili, Vinit Katariya, Hamed Tabkhi", "id": "2408.14329v1", "paper_url": "http://arxiv.org/abs/2408.14329v1", "repo": "https://github.com/tecsar-uncc/pheva"}}