{"2412.08098": {"publish_time": "2024-12-11", "title": "What You See Is Not Always What You Get: An Empirical Study of Code Comprehension by Large Language Models", "paper_summary": "Recent studies have demonstrated outstanding capabilities of large language\nmodels (LLMs) in software engineering domain, covering numerous tasks such as\ncode generation and comprehension. While the benefit of LLMs for coding task is\nwell noted, it is perceived that LLMs are vulnerable to adversarial attacks. In\nthis paper, we study the specific LLM vulnerability to imperceptible character\nattacks, a type of prompt-injection attack that uses special characters to\nbefuddle an LLM whilst keeping the attack hidden to human eyes. We devise four\ncategories of attacks and investigate their effects on the performance outcomes\nof tasks relating to code analysis and code comprehension. Two generations of\nChatGPT are included to evaluate the impact of advancements made to\ncontemporary models. Our experimental design consisted of comparing perturbed\nand unperturbed code snippets and evaluating two performance outcomes, which\nare model confidence using log probabilities of response, and correctness of\nresponse. We conclude that earlier version of ChatGPT exhibits a strong\nnegative linear correlation between the amount of perturbation and the\nperformance outcomes, while the recent ChatGPT presents a strong negative\ncorrelation between the presence of perturbation and performance outcomes, but\nno valid correlational relationship between perturbation budget and performance\noutcomes. We anticipate this work contributes to an in-depth understanding of\nleveraging LLMs for coding tasks. It is suggested future research should delve\ninto how to create LLMs that can return a correct response even if the prompt\nexhibits perturbations.", "paper_summary_zh": "<paragraph>最近的研究已證明大型語言模型 (LLM) 在軟體工程領域具有傑出的能力，涵蓋了許多任務，例如程式碼產生和理解。雖然 LLM 對編碼任務的好處已廣為人知，但 LLM 被認為容易受到對抗性攻擊。在本文中，我們研究了 LLM 對難以察覺的字元攻擊的具體漏洞，這是一種提示注入攻擊，它使用特殊字元來混淆 LLM，同時讓攻擊對人眼隱藏。我們設計了四種類型的攻擊，並研究它們對與程式碼分析和程式碼理解相關任務的效能結果的影響。包含兩代 ChatGPT 以評估對當代模型所做進展的影響。我們的實驗設計包括比較擾動和未擾動的程式碼片段，並評估兩個效能結果，分別是使用回應的對數機率的模型信心，以及回應的正確性。我們得出的結論是，較早版本的 ChatGPT 在擾動量和效能結果之間表現出強烈的負線性相關性，而最近的 ChatGPT 在擾動的存在和效能結果之間表現出強烈的負相關性，但擾動預算和效能結果之間沒有有效的相關關係。我們預期這項工作有助於深入了解如何利用 LLM 進行編碼任務。建議未來的研究應深入探討如何建立即使提示出現擾動也能回傳正確回應的 LLM。</paragraph>", "author": "Bangshuo Zhu et.al.", "authors": "Bangshuo Zhu, Jiawen Wen, Huaming Chen", "id": "2412.08098v1", "paper_url": "http://arxiv.org/abs/2412.08098v1", "repo": "null"}}