{"2406.04607": {"publish_time": "2024-06-07", "title": "MeGA: Merging Multiple Independently Trained Neural Networks Based on Genetic Algorithm", "paper_summary": "In this paper, we introduce a novel method for merging the weights of\nmultiple pre-trained neural networks using a genetic algorithm called MeGA.\nTraditional techniques, such as weight averaging and ensemble methods, often\nfail to fully harness the capabilities of pre-trained networks. Our approach\nleverages a genetic algorithm with tournament selection, crossover, and\nmutation to optimize weight combinations, creating a more effective fusion.\nThis technique allows the merged model to inherit advantageous features from\nboth parent models, resulting in enhanced accuracy and robustness. Through\nexperiments on the CIFAR-10 dataset, we demonstrate that our genetic\nalgorithm-based weight merging method improves test accuracy compared to\nindividual models and conventional methods. This approach provides a scalable\nsolution for integrating multiple pre-trained networks across various deep\nlearning applications. Github is available at:\nhttps://github.com/YUNBLAK/MeGA-Merging-Multiple-Independently-Trained-Neural-Networks-Based-on-Genetic-Algorithm", "paper_summary_zh": "在本文中，我們介紹了一種使用稱為 MeGA 的遺傳演算法來合併多個預訓練神經網路權重的創新方法。傳統技術，例如權重平均和集成方法，通常無法充分利用預訓練網路的能力。我們的方法利用具有錦標賽選擇、交叉和突變的遺傳演算法來最佳化權重組合，創造更有效的融合。此技術允許合併的模型繼承來自兩個父模型的優勢特徵，從而提高準確性和穩健性。透過在 CIFAR-10 資料集上的實驗，我們證明了我們的基於遺傳演算法的權重合併方法與個別模型和傳統方法相比，改進了測試準確性。這種方法提供了一個可擴充的解決方案，用於整合多個預訓練網路，以應用於各種深度學習應用。Github 可在以下網址取得：\nhttps://github.com/YUNBLAK/MeGA-Merging-Multiple-Independently-Trained-Neural-Networks-Based-on-Genetic-Algorithm", "author": "Daniel Yun et.al.", "authors": "Daniel Yun", "id": "2406.04607v1", "paper_url": "http://arxiv.org/abs/2406.04607v1", "repo": "https://github.com/yunblak/mega-merging-multiple-independently-trained-neural-networks-based-on-genetic-algorithm"}}