{"2405.18040": {"publish_time": "2024-05-28", "title": "Fast-FedUL: A Training-Free Federated Unlearning with Provable Skew Resilience", "paper_summary": "Federated learning (FL) has recently emerged as a compelling machine learning\nparadigm, prioritizing the protection of privacy for training data. The\nincreasing demand to address issues such as ``the right to be forgotten'' and\ncombat data poisoning attacks highlights the importance of techniques, known as\n\\textit{unlearning}, which facilitate the removal of specific training data\nfrom trained FL models. Despite numerous unlearning methods proposed for\ncentralized learning, they often prove inapplicable to FL due to fundamental\ndifferences in the operation of the two learning paradigms. Consequently,\nunlearning in FL remains in its early stages, presenting several challenges.\nMany existing unlearning solutions in FL require a costly retraining process,\nwhich can be burdensome for clients. Moreover, these methods are primarily\nvalidated through experiments, lacking theoretical assurances. In this study,\nwe introduce Fast-FedUL, a tailored unlearning method for FL, which eliminates\nthe need for retraining entirely. Through meticulous analysis of the target\nclient's influence on the global model in each round, we develop an algorithm\nto systematically remove the impact of the target client from the trained\nmodel. In addition to presenting empirical findings, we offer a theoretical\nanalysis delineating the upper bound of our unlearned model and the exact\nretrained model (the one obtained through retraining using untargeted clients).\nExperimental results with backdoor attack scenarios indicate that Fast-FedUL\neffectively removes almost all traces of the target client, while retaining the\nknowledge of untargeted clients (obtaining a high accuracy of up to 98\\% on the\nmain task). Significantly, Fast-FedUL attains the lowest time complexity,\nproviding a speed that is 1000 times faster than retraining. Our source code is\npublicly available at \\url{https://github.com/thanhtrunghuynh93/fastFedUL}.", "paper_summary_zh": "<paragraph>联邦学习 (FL) 最近已成为一种引人注目的机器学习范例，优先保护训练数据的隐私。解决“被遗忘权”等问题和打击数据中毒攻击的日益增长的需求凸显了被称为“取消学习”的技术的重要性，该技术有助于从训练过的 FL 模型中删除特定的训练数据。尽管针对集中式学习提出了许多取消学习方法，但由于两种学习范例的操作存在根本差异，这些方法通常被证明不适用于 FL。因此，FL 中的取消学习仍处于早期阶段，面临着许多挑战。FL 中许多现有的取消学习解决方案都需要昂贵的重新训练过程，这可能会给客户端带来负担。此外，这些方法主要通过实验验证，缺乏理论保证。在这项研究中，我们介绍了 Fast-FedUL，这是一种针对 FL 的定制取消学习方法，它完全消除了重新训练的需要。通过细致分析目标客户端在每一轮中对全局模型的影响，我们开发了一种算法来系统地从训练过的模型中移除目标客户端的影响。除了提供实证结果外，我们还提供了一个理论分析，描述了我们取消学习模型的上界和精确的重新训练模型（通过使用非目标客户端重新训练获得的模型）。带有后门攻击场景的实验结果表明，Fast-FedUL 有效地去除了目标客户端几乎所有的痕迹，同时保留了非目标客户端的知识（在主任务上获得了高达 98% 的高准确度）。值得注意的是，Fast-FedUL 实现了最低的时间复杂度，其速度比重新训练快 1000 倍。我们的源代码可在 \\url{https://github.com/thanhtrunghuynh93/fastFedUL} 公开获得。</paragraph>", "author": "Thanh Trung Huynh et.al.", "authors": "Thanh Trung Huynh, Trong Bang Nguyen, Phi Le Nguyen, Thanh Tam Nguyen, Matthias Weidlich, Quoc Viet Hung Nguyen, Karl Aberer", "id": "2405.18040v1", "paper_url": "http://arxiv.org/abs/2405.18040v1", "repo": "https://github.com/thanhtrunghuynh93/fastfedul"}}