{"2412.09269": {"publish_time": "2024-12-12", "title": "Towards Understanding the Robustness of LLM-based Evaluations under Perturbations", "paper_summary": "Traditional evaluation metrics like BLEU and ROUGE fall short when capturing\nthe nuanced qualities of generated text, particularly when there is no single\nground truth. In this paper, we explore the potential of Large Language Models\n(LLMs), specifically Google Gemini 1, to serve as automatic evaluators for\nnon-standardized metrics in summarization and dialog-based tasks. We conduct\nexperiments across multiple prompting strategies to examine how LLMs fare as\nquality evaluators when compared with human judgments on the SummEval and USR\ndatasets, asking the model to generate both a score as well as a justification\nfor the score. Furthermore, we explore the robustness of the LLM evaluator by\nusing perturbed inputs. Our findings suggest that while LLMs show promise,\ntheir alignment with human evaluators is limited, they are not robust against\nperturbations and significant improvements are required for their standalone\nuse as reliable evaluators for subjective metrics.", "paper_summary_zh": "傳統評估指標，例如 BLEU 和 ROUGE，在捕捉生成文字的細微品質時有所不足，特別是在沒有單一真實情況時。在本文中，我們探討大型語言模型 (LLM) 的潛力，特別是 Google Gemini 1，作為摘要和基於對話任務中非標準化指標的自動評估器。我們在多種提示策略中進行實驗，以檢驗 LLM 作為品質評估器的表現，並與人類對 SummEval 和 USR 資料集的判斷進行比較，要求模型生成一個分數以及對分數的說明。此外，我們透過使用擾動輸入來探討 LLM 評估器的穩健性。我們的研究結果表明，儘管 LLM 顯示出前景，但它們與人類評估者的對齊是有限的，它們無法抵抗擾動，並且需要顯著改進才能獨立用作主觀指標的可靠評估器。", "author": "Manav Chaudhary et.al.", "authors": "Manav Chaudhary, Harshit Gupta, Savita Bhat, Vasudeva Varma", "id": "2412.09269v1", "paper_url": "http://arxiv.org/abs/2412.09269v1", "repo": "null"}}