{"2408.05200": {"publish_time": "2024-08-09", "title": "TaSL: Task Skill Localization and Consolidation for Language Model Continual Learning", "paper_summary": "Language model continual learning (CL) has recently garnered significant\ninterest due to its potential to adapt large language models (LLMs) to dynamic\nreal-world environments without re-training. A key challenge in this field is\ncatastrophic forgetting, where models lose previously acquired knowledge when\nlearning new tasks. Existing methods commonly employ multiple\nparameter-efficient fine-tuning (PEFT) blocks to acquire task-specific\nknowledge for each task, but these approaches lack efficiency and overlook the\npotential for knowledge transfer through task interaction. In this paper, we\npresent a novel CL framework for language models called Task Skill Localization\nand Consolidation (TaSL), which enhances knowledge transfer without relying on\nmemory replay. TaSL first divides the model into `skill units' based on\nparameter dependencies, enabling more granular control. It then employs a novel\ngroup-wise skill localization technique to identify the importance distribution\nof skill units for a new task. By comparing this importance distribution with\nthose from previous tasks, we implement a fine-grained skill consolidation\nstrategy that retains task-specific knowledge, thereby preventing forgetting,\nand updates task-shared knowledge, which facilitates bi-directional knowledge\ntransfer. As a result, TaSL achieves a superior balance between retaining\nprevious knowledge and excelling in new tasks. TaSL also shows strong\ngeneralizability, suitable for general models and customizable for PEFT methods\nlike LoRA. Additionally, it demonstrates notable extensibility, allowing\nintegration with memory replay to further enhance performance. Extensive\nexperiments on two CL benchmarks, with varying model sizes (from 220M to 7B),\ndemonstrate the effectiveness of TaSL and its variants across different\nsettings.", "paper_summary_zh": "<paragraph>語言模型持續學習 (CL) 近來備受關注，因為它有潛力讓大型語言模型 (LLM) 適應動態的真實世界環境，而無需重新訓練。此領域的一項關鍵挑戰是災難性遺忘，也就是模型在學習新任務時會遺失先前習得的知識。現有方法通常採用多個參數高效微調 (PEFT) 區塊來為每個任務取得特定於任務的知識，但這些方法缺乏效率，而且忽略了透過任務互動進行知識傳輸的潛力。在本文中，我們提出一個稱為任務技能定位和整合 (TaSL) 的語言模型新 CL 架構，它增強了知識傳輸，而無需依賴記憶體重播。TaSL 首先根據參數依賴性將模型分成「技能單元」，進而能更精細地控制。接著，它採用一種新的群組式技能定位技術，找出技能單元在新任務中的重要性分佈。透過將此重要性分佈與先前任務中的重要性分佈進行比較，我們實作了一種精細的技能整合策略，保留特定於任務的知識，進而防止遺忘，並更新共用於任務的知識，促進雙向知識傳輸。因此，TaSL 在保留先前知識和在新的任務中表現出色之間取得了更佳的平衡。TaSL 也展現出強大的概括性，適用於一般模型，且可自訂為 PEFT 方法，例如 LoRA。此外，它展現出顯著的可擴充性，允許與記憶體重播整合，以進一步增強效能。在兩個 CL 基準上進行的廣泛實驗，使用不同大小的模型（從 220M 到 7B），證明了 TaSL 及其變體在不同設定中的有效性。</paragraph>", "author": "Yujie Feng et.al.", "authors": "Yujie Feng, Xu Chu, Yongxin Xu, Zexin Lu, Bo Liu, Philip S. Yu, Xiao-Ming Wu", "id": "2408.05200v1", "paper_url": "http://arxiv.org/abs/2408.05200v1", "repo": "null"}}