{"2406.15187": {"publish_time": "2024-06-21", "title": "UDA: A Benchmark Suite for Retrieval Augmented Generation in Real-world Document Analysis", "paper_summary": "The use of Retrieval-Augmented Generation (RAG) has improved Large Language\nModels (LLMs) in collaborating with external data, yet significant challenges\nexist in real-world scenarios. In areas such as academic literature and finance\nquestion answering, data are often found in raw text and tables in HTML or PDF\nformats, which can be lengthy and highly unstructured. In this paper, we\nintroduce a benchmark suite, namely Unstructured Document Analysis (UDA), that\ninvolves 2,965 real-world documents and 29,590 expert-annotated Q&A pairs. We\nrevisit popular LLM- and RAG-based solutions for document analysis and evaluate\nthe design choices and answer qualities across multiple document domains and\ndiverse query types. Our evaluation yields interesting findings and highlights\nthe importance of data parsing and retrieval. We hope our benchmark can shed\nlight and better serve real-world document analysis applications. The benchmark\nsuite and code can be found at https://github.com/qinchuanhui/UDA-Benchmark.", "paper_summary_zh": "擷取增強生成（RAG）的使用已改善大型語言模型（LLM）與外部資料的協作，但實際場景中仍存在重大挑戰。在學術文獻和財務問答等領域，資料通常以 HTML 或 PDF 格式的原始文字和表格呈現，可能很長且高度非結構化。在本文中，我們介紹了一個基準套件，即非結構化文件分析（UDA），其中包含 2,965 份真實世界文件和 29,590 個專家註解的問答配對。我們重新檢視了流行的基於 LLM 和 RAG 的文件分析解決方案，並評估了跨多個文件領域和不同查詢類型的設計選擇和答案品質。我們的評估產生了有趣的發現，並強調了資料解析和擷取的重要性。我們希望我們的基準能為實際世界的文件分析應用程式提供啟示並提供更好的服務。基準套件和程式碼可以在 https://github.com/qinchuanhui/UDA-Benchmark 找到。", "author": "Yulong Hui et.al.", "authors": "Yulong Hui, Yao Lu, Huanchen Zhang", "id": "2406.15187v1", "paper_url": "http://arxiv.org/abs/2406.15187v1", "repo": "https://github.com/qinchuanhui/uda-benchmark"}}