{"2409.06033": {"publish_time": "2024-09-09", "title": "Investigating Causal Cues: Strengthening Spoofed Audio Detection with Human-Discernible Linguistic Features", "paper_summary": "Several types of spoofed audio, such as mimicry, replay attacks, and\ndeepfakes, have created societal challenges to information integrity. Recently,\nresearchers have worked with sociolinguistics experts to label spoofed audio\nsamples with Expert Defined Linguistic Features (EDLFs) that can be discerned\nby the human ear: pitch, pause, word-initial and word-final release bursts of\nconsonant stops, audible intake or outtake of breath, and overall audio\nquality. It is established that there is an improvement in several deepfake\ndetection algorithms when they augmented the traditional and common features of\naudio data with these EDLFs. In this paper, using a hybrid dataset comprised of\nmultiple types of spoofed audio augmented with sociolinguistic annotations, we\ninvestigate causal discovery and inferences between the discernible linguistic\nfeatures and the label in the audio clips, comparing the findings of the causal\nmodels with the expert ground truth validation labeling process. Our findings\nsuggest that the causal models indicate the utility of incorporating linguistic\nfeatures to help discern spoofed audio, as well as the overall need and\nopportunity to incorporate human knowledge into models and techniques for\nstrengthening AI models. The causal discovery and inference can be used as a\nfoundation of training humans to discern spoofed audio as well as automating\nEDLFs labeling for the purpose of performance improvement of the common\nAI-based spoofed audio detectors.", "paper_summary_zh": "<paragraph>多種類型的偽造音訊，例如模仿、重播攻擊和深度造假，對資訊的完整性造成了社會挑戰。最近，研究人員與社會語言學專家合作，使用人類耳朵可以辨別的專家定義語言特徵 (EDLF) 標註偽造音訊樣本：音高、停頓、輔音停頓的字首和字尾釋放爆破音、可聽見的吸氣或呼氣，以及整體音訊品質。已確立在使用這些 EDLF 擴充傳統且常見的音訊資料特徵時，多種深度造假偵測演算法會有改善。在本文中，使用包含多種類型偽造音訊且擴充社會語言學註解的混合資料集，我們探討可辨別的語言特徵與音訊片段中的標籤之間的因果發現和推論，並將因果模型的發現與專家實地驗證標籤處理程序進行比較。我們的發現表明，因果模型顯示了納入語言特徵以幫助辨別偽造音訊的效用，以及將人類知識納入模型和技術以強化 AI 模型的整體需求和機會。因果發現和推論可用作訓練人類辨別偽造音訊的基礎，以及自動化 EDLF 標籤處理以改善常見的 AI 基於偽造音訊偵測器的效能。</paragraph>", "author": "Zahra Khanjani et.al.", "authors": "Zahra Khanjani, Tolulope Ale, Jianwu Wang, Lavon Davis, Christine Mallinson, Vandana P. Janeja", "id": "2409.06033v1", "paper_url": "http://arxiv.org/abs/2409.06033v1", "repo": "null"}}