{"2411.07180": {"publish_time": "2024-11-11", "title": "Counterfactual Generation from Language Models", "paper_summary": "Understanding and manipulating the causal generation mechanisms in language\nmodels is essential for controlling their behavior. Previous work has primarily\nrelied on techniques such as representation surgery -- e.g., model ablations or\nmanipulation of linear subspaces tied to specific concepts -- to intervene on\nthese models. To understand the impact of interventions precisely, it is useful\nto examine counterfactuals -- e.g., how a given sentence would have appeared\nhad it been generated by the model following a specific intervention. We\nhighlight that counterfactual reasoning is conceptually distinct from\ninterventions, as articulated in Pearl's causal hierarchy. Based on this\nobservation, we propose a framework for generating true string counterfactuals\nby reformulating language models as Generalized Structural-equation. Models\nusing the Gumbel-max trick. This allows us to model the joint distribution over\noriginal strings and their counterfactuals resulting from the same\ninstantiation of the sampling noise. We develop an algorithm based on hindsight\nGumbel sampling that allows us to infer the latent noise variables and generate\ncounterfactuals of observed strings. Our experiments demonstrate that the\napproach produces meaningful counterfactuals while at the same time showing\nthat commonly used intervention techniques have considerable undesired side\neffects.", "paper_summary_zh": "理解並操控語言模型中的因果生成機制，對於控制其行為至關重要。以往的研究主要依賴於表徵手術等技術——例如，模型消融或與特定概念相關的線性子空間的操控——來干預這些模型。為了精確理解干預的影響，審查反事實——例如，如果模型在特定干預後生成給定的句子，句子將如何呈現——是有用的。我們強調，反事實推理在概念上不同於干預，正如 Pearl 的因果層級所闡述的那樣。基於此觀察，我們提出了一個生成真正字串反事實的框架，方法是將語言模型重新表述為廣義結構方程模型，使用 Gumbel-max 技巧。這使我們能夠對原始字串及其反事實的聯合分佈建模，這些反事實來自採樣雜訊的相同例示。我們根據後見之明 Gumbel 採樣開發了一種演算法，使我們能夠推斷潛在雜訊變數並生成已觀察字串的反事實。我們的實驗證明，該方法產生有意義的反事實，同時表明常用的干預技術具有相當大的不良副作用。", "author": "Shauli Ravfogel et.al.", "authors": "Shauli Ravfogel, Anej Svete, Vésteinn Snæbjarnarson, Ryan Cotterell", "id": "2411.07180v1", "paper_url": "http://arxiv.org/abs/2411.07180v1", "repo": "https://github.com/shauli-ravfogel/lm-counterfactuals"}}