{"2408.10159": {"publish_time": "2024-08-19", "title": "Customizing Language Models with Instance-wise LoRA for Sequential Recommendation", "paper_summary": "Sequential recommendation systems predict a user's next item of interest by\nanalyzing past interactions, aligning recommendations with individual\npreferences. Leveraging the strengths of Large Language Models (LLMs) in\nknowledge comprehension and reasoning, recent approaches have applied LLMs to\nsequential recommendation through language generation paradigms. These methods\nconvert user behavior sequences into prompts for LLM fine-tuning, utilizing\nLow-Rank Adaptation (LoRA) modules to refine recommendations. However, the\nuniform application of LoRA across diverse user behaviors sometimes fails to\ncapture individual variability, leading to suboptimal performance and negative\ntransfer between disparate sequences. To address these challenges, we propose\nInstance-wise LoRA (iLoRA), integrating LoRA with the Mixture of Experts (MoE)\nframework. iLoRA creates a diverse array of experts, each capturing specific\naspects of user preferences, and introduces a sequence representation guided\ngate function. This gate function processes historical interaction sequences to\ngenerate enriched representations, guiding the gating network to output\ncustomized expert participation weights. This tailored approach mitigates\nnegative transfer and dynamically adjusts to diverse behavior patterns.\nExtensive experiments on three benchmark datasets demonstrate the effectiveness\nof iLoRA, highlighting its superior performance compared to existing methods in\ncapturing user-specific preferences and improving recommendation accuracy.", "paper_summary_zh": "序列推薦系統透過分析過往互動，比對推薦與個人偏好來預測使用者下一個感興趣的項目。利用大型語言模型 (LLM) 在知識理解和推理方面的優勢，最近的方法已透過語言生成範例將 LLM 應用於序列推薦。這些方法將使用者行為序列轉換為 LLM 微調提示，並利用低秩適應 (LoRA) 模組來改善推薦。然而，在不同的使用者行為中統一應用 LoRA 有時無法捕捉個別變異性，導致次佳效能和不同序列之間的負面轉移。為了應對這些挑戰，我們提出實例 LoRA (iLoRA)，將 LoRA 與專家混合 (MoE) 架構整合。iLoRA 建立了一系列不同的專家，每個專家都能捕捉使用者偏好的特定面向，並引入由序列表示引導的閘門函數。此閘門函數處理歷史互動序列以產生豐富的表示，引導閘控網路輸出客製化的專家參與權重。此量身打造的方法可減輕負面轉移，並動態調整至不同的行為模式。在三個基準資料集上進行的廣泛實驗證明了 iLoRA 的有效性，突顯出其在捕捉使用者特定偏好和改善推薦準確度方面優於現有方法的卓越效能。", "author": "Xiaoyu Kong et.al.", "authors": "Xiaoyu Kong, Jiancan Wu, An Zhang, Leheng Sheng, Hui Lin, Xiang Wang, Xiangnan He", "id": "2408.10159v1", "paper_url": "http://arxiv.org/abs/2408.10159v1", "repo": "null"}}