{"2408.17344": {"publish_time": "2024-08-30", "title": "rerankers: A Lightweight Python Library to Unify Ranking Methods", "paper_summary": "This paper presents rerankers, a Python library which provides an easy-to-use\ninterface to the most commonly used re-ranking approaches. Re-ranking is an\nintegral component of many retrieval pipelines; however, there exist numerous\napproaches to it, relying on different implementation methods. rerankers\nunifies these methods into a single user-friendly interface, allowing\npractitioners and researchers alike to explore different methods while only\nchanging a single line of Python code. Moreover ,rerankers ensures that its\nimplementations are done with the fewest dependencies possible, and re-uses the\noriginal implementation whenever possible, guaranteeing that our simplified\ninterface results in no performance degradation compared to more complex ones.\nThe full source code and list of supported models are updated regularly and\navailable at https://github.com/answerdotai/rerankers.", "paper_summary_zh": "這篇論文提出了 rerankers，一個 Python 函式庫，它提供了一個易於使用的介面，來使用最常用的重新排序方法。重新排序是許多檢索管線中不可或缺的組成部分；然而，有許多方法可以達成，仰賴不同的實作方式。rerankers 將這些方法統一到一個使用者友善的介面中，讓實務工作者和研究人員都能探索不同的方法，同時只需變更一行 Python 程式碼。此外，rerankers 確保其實作使用最少的依賴關係，並在可能的情況下重複使用原始實作，保證我們簡化的介面不會造成效能下降，與更複雜的介面相比。完整的原始程式碼和支援的模型清單會定期更新，並在 https://github.com/answerdotai/rerankers 提供。", "author": "Benjamin Clavié et.al.", "authors": "Benjamin Clavié", "id": "2408.17344v2", "paper_url": "http://arxiv.org/abs/2408.17344v2", "repo": "https://github.com/answerdotai/rerankers"}}