{"2501.07813": {"publish_time": "2025-01-14", "title": "Talk to Right Specialists: Routing and Planning in Multi-agent System for Question Answering", "paper_summary": "Leveraging large language models (LLMs), an agent can utilize\nretrieval-augmented generation (RAG) techniques to integrate external knowledge\nand increase the reliability of its responses. Current RAG-based agents\nintegrate single, domain-specific knowledge sources, limiting their ability and\nleading to hallucinated or inaccurate responses when addressing cross-domain\nqueries. Integrating multiple knowledge bases into a unified RAG-based agent\nraises significant challenges, including increased retrieval overhead and data\nsovereignty when sensitive data is involved. In this work, we propose RopMura,\na novel multi-agent system that addresses these limitations by incorporating\nhighly efficient routing and planning mechanisms. RopMura features two key\ncomponents: a router that intelligently selects the most relevant agents based\non knowledge boundaries and a planner that decomposes complex multi-hop queries\ninto manageable steps, allowing for coordinating cross-domain responses.\nExperimental results demonstrate that RopMura effectively handles both\nsingle-hop and multi-hop queries, with the routing mechanism enabling precise\nanswers for single-hop queries and the combined routing and planning mechanisms\nachieving accurate, multi-step resolutions for complex queries.", "paper_summary_zh": "利用大型语言模型 (LLM)，代理可以利用检索增强生成 (RAG) 技术整合外部知识并提高其响应的可靠性。当前基于 RAG 的代理整合了单一且特定于领域的知识源，这限制了它们的能力，并且在处理跨领域查询时会导致出现幻觉或不准确的响应。将多个知识库整合到基于 RAG 的统一代理中会带来重大挑战，包括在涉及敏感数据时增加检索开销和数据主权。在这项工作中，我们提出了 RopMura，这是一种新颖的多代理系统，它通过结合高效的路由和规划机制来解决这些限制。RopMura 具有两个关键组件：一个基于知识边界智能选择最相关代理的路由器，以及一个将复杂的多跳查询分解为可管理步骤的规划器，从而允许协调跨域响应。实验结果表明，RopMura 有效地处理了单跳和多跳查询，其中路由机制能够为单跳查询提供精确的答案，而路由和规划机制相结合则为复杂查询实现了准确的多步骤解析。", "author": "Feijie Wu et.al.", "authors": "Feijie Wu, Zitao Li, Fei Wei, Yaliang Li, Bolin Ding, Jing Gao", "id": "2501.07813v1", "paper_url": "http://arxiv.org/abs/2501.07813v1", "repo": "null"}}