{"2406.07520": {"publish_time": "2024-06-11", "title": "Neural Gaffer: Relighting Any Object via Diffusion", "paper_summary": "Single-image relighting is a challenging task that involves reasoning about\nthe complex interplay between geometry, materials, and lighting. Many prior\nmethods either support only specific categories of images, such as portraits,\nor require special capture conditions, like using a flashlight. Alternatively,\nsome methods explicitly decompose a scene into intrinsic components, such as\nnormals and BRDFs, which can be inaccurate or under-expressive. In this work,\nwe propose a novel end-to-end 2D relighting diffusion model, called Neural\nGaffer, that takes a single image of any object and can synthesize an accurate,\nhigh-quality relit image under any novel environmental lighting condition,\nsimply by conditioning an image generator on a target environment map, without\nan explicit scene decomposition. Our method builds on a pre-trained diffusion\nmodel, and fine-tunes it on a synthetic relighting dataset, revealing and\nharnessing the inherent understanding of lighting present in the diffusion\nmodel. We evaluate our model on both synthetic and in-the-wild Internet imagery\nand demonstrate its advantages in terms of generalization and accuracy.\nMoreover, by combining with other generative methods, our model enables many\ndownstream 2D tasks, such as text-based relighting and object insertion. Our\nmodel can also operate as a strong relighting prior for 3D tasks, such as\nrelighting a radiance field.", "paper_summary_zh": "單張影像重新打光是一項艱難的任務，涉及推理幾何、材料和光線之間的複雜交互作用。許多先前的技術僅支援特定類別的影像，例如人像，或需要特殊拍攝條件，例如使用手電筒。或者，某些技術會明確將場景分解為內在組成部分，例如法線和 BRDF，這可能會不準確或表達不足。在這項工作中，我們提出了一種新穎的端到端 2D 重新打光擴散模型，稱為 Neural Gaffer，它會擷取任何物體的單張影像，並可以在任何新穎的環境光照條件下合成準確、高品質的重新打光影像，只需在影像產生器上加上目標環境貼圖，而無需明確的場景分解。我們的技術建立在預先訓練好的擴散模型上，並在合成重新打光資料集上微調，揭示並利用擴散模型中存在的內在光照理解。我們在合成和野生網路影像上評估我們的模型，並展示其在泛化和準確性方面的優點。此外，透過與其他生成式技術結合，我們的模型支援許多下游 2D 任務，例如基於文字的重新打光和物件插入。我們的模型還可以作為 3D 任務的強大重新打光先驗，例如重新打光輻照場。", "author": "Haian Jin et.al.", "authors": "Haian Jin, Yuan Li, Fujun Luan, Yuanbo Xiangli, Sai Bi, Kai Zhang, Zexiang Xu, Jin Sun, Noah Snavely", "id": "2406.07520v1", "paper_url": "http://arxiv.org/abs/2406.07520v1", "repo": "null"}}