{"2410.22690": {"publish_time": "2024-10-30", "title": "Choice between Partial Trajectories", "paper_summary": "As AI agents generate increasingly sophisticated behaviors, manually encoding\nhuman preferences to guide these agents becomes more challenging. To address\nthis, it has been suggested that agents instead learn preferences from human\nchoice data. This approach requires a model of choice behavior that the agent\ncan use to interpret the data. For choices between partial trajectories of\nstates and actions, previous models assume choice probabilities to be\ndetermined by the partial return or the cumulative advantage.\n  We consider an alternative model based instead on the bootstrapped return,\nwhich adds to the partial return an estimate of the future return. Benefits of\nthe bootstrapped return model stem from its treatment of human beliefs. Unlike\npartial return, choices based on bootstrapped return reflect human beliefs\nabout the environment. Further, while recovering the reward function from\nchoices based on cumulative advantage requires that those beliefs are correct,\ndoing so from choices based on bootstrapped return does not.\n  To motivate the bootstrapped return model, we formulate axioms and prove an\nAlignment Theorem. This result formalizes how, for a general class of human\npreferences, such models are able to disentangle goals from beliefs. This\nensures recovery of an aligned reward function when learning from choices based\non bootstrapped return.\n  The bootstrapped return model also affords greater robustness to choice\nbehavior. Even when choices are based on partial return, learning via a\nbootstrapped return model recovers an aligned reward function. The same holds\nwith choices based on the cumulative advantage if the human and the agent both\nadhere to correct and consistent beliefs about the environment. On the other\nhand, if choices are based on bootstrapped return, learning via partial return\nor cumulative advantage models does not generally produce an aligned reward\nfunction.", "paper_summary_zh": "隨著 AI 代理產生越來越複雜的行為，手動編碼人類偏好以引導這些代理變得更具挑戰性。為了解決這個問題，有人建議代理改為從人類選擇數據中學習偏好。這種方法需要一個選擇行為模型，代理可以使用該模型來解釋數據。對於狀態和動作的部分軌跡之間的選擇，先前的模型假設選擇機率是由部分回報或累積優勢決定的。\n我們考慮一個基於自舉回報的替代模型，它在部分回報中增加了對未來回報的估計。自舉回報模型的好處源於它對人類信念的處理。與部分回報不同，基於自舉回報的選擇反映了人類對環境的信念。此外，雖然從基於累積優勢的選擇中恢復獎勵函數需要這些信念是正確的，但從基於自舉回報的選擇中這樣做則不需要。\n為了激勵自舉回報模型，我們制定公理並證明一個對齊定理。這個結果形式化了對於人類偏好的一般類別，這些模型如何能夠區分目標和信念。這確保了從基於自舉回報的選擇中學習時，對齊獎勵函數的恢復。\n自舉回報模型還提供了對選擇行為更大的魯棒性。即使選擇基於部分回報，通過自舉回報模型學習也會恢復對齊的獎勵函數。如果人類和代理都堅持對環境的正確和一致的信念，那麼基於累積優勢的選擇也是如此。另一方面，如果選擇基於自舉回報，則通過部分回報或累積優勢模型學習通常不會產生對齊的獎勵函數。", "author": "Henrik Marklund et.al.", "authors": "Henrik Marklund, Benjamin Van Roy", "id": "2410.22690v1", "paper_url": "http://arxiv.org/abs/2410.22690v1", "repo": "null"}}