{"2411.19875": {"publish_time": "2024-11-29", "title": "Enhanced anomaly detection in well log data through the application of ensemble GANs", "paper_summary": "Although generative adversarial networks (GANs) have shown significant\nsuccess in modeling data distributions for image datasets, their application to\nstructured or tabular data, such as well logs, remains relatively\nunderexplored. This study extends the ensemble GANs (EGANs) framework to\ncapture the distribution of well log data and detect anomalies that fall\noutside of these distributions. The proposed approach compares the performance\nof traditional methods, such as Gaussian mixture models (GMMs), with EGANs in\ndetecting anomalies outside the expected data distributions. For the gamma ray\n(GR) dataset, EGANs achieved a precision of 0.62 and F1 score of 0.76,\noutperforming GMM's precision of 0.38 and F1 score of 0.54. Similarly, for\ntravel time (DT), EGANs achieved a precision of 0.70 and F1 score of 0.79,\nsurpassing GMM 0.56 and 0.71. In the neutron porosity (NPHI) dataset, EGANs\nrecorded a precision of 0.53 and F1 score of 0.68, outshining GMM 0.47 and\n0.61. For the bulk density (RHOB) dataset, EGANs achieved a precision of 0.52\nand an F1 score of 0.67, slightly outperforming GMM, which yielded a precision\nof 0.50 and an F1 score of 0.65. This work's novelty lies in applying EGANs for\nwell log data analysis, showcasing their ability to learn data patterns and\nidentify anomalies that deviate from them. This approach offers more reliable\nanomaly detection compared to traditional methods like GMM. The findings\nhighlight the potential of EGANs in enhancing anomaly detection for well log\ndata, delivering significant implications for optimizing drilling strategies\nand reservoir management through more accurate, data-driven insights into\nsubsurface characterization.", "paper_summary_zh": "<paragraph>儘管生成對抗網路 (GAN) 在建模影像資料集的資料分佈方面已展現顯著的成功，但其在結構化或表格資料（例如測井資料）的應用仍相對未被充分探討。本研究延伸了整體 GAN (EGAN) 架構，以擷取測井資料的分布並偵測落在這些分布之外的異常值。所提出的方法比較了傳統方法（例如高斯混合模型 (GMM)）與 EGAN 在偵測預期資料分布之外的異常值方面的效能。對於伽馬射線 (GR) 資料集，EGAN 達到了 0.62 的精準度和 0.76 的 F1 分數，優於 GMM 的 0.38 精準度和 0.54 F1 分數。類似地，對於行進時間 (DT)，EGAN 達到了 0.70 的精準度和 0.79 的 F1 分數，超越了 GMM 的 0.56 和 0.71。在中子孔隙度 (NPHI) 資料集，EGAN 記錄了 0.53 的精準度和 0.68 的 F1 分數，勝過 GMM 的 0.47 和 0.61。對於體積密度 (RHOB) 資料集，EGAN 達到了 0.52 的精準度和 0.67 的 F1 分數，略優於 GMM，後者產生了 0.50 的精準度和 0.65 的 F1 分數。這項工作的創新之處在於應用 EGAN 進行測井資料分析，展示其學習資料模式和識別偏離這些模式的異常值的能力。與 GMM 等傳統方法相比，此方法提供了更可靠的異常值偵測。這些發現突顯了 EGAN 在加強測井資料異常值偵測方面的潛力，透過更準確、資料驅動的地下特徵洞察，為最佳化鑽探策略和儲層管理帶來重大影響。</paragraph>", "author": "Abdulrahman Al-Fakih et.al.", "authors": "Abdulrahman Al-Fakih, A. Koeshidayatullah, Tapan Mukerji, SanLinn I. Kaka", "id": "2411.19875v1", "paper_url": "http://arxiv.org/abs/2411.19875v1", "repo": "https://github.com/ARhaman/EGANs-vs.GMM"}}