{"2406.09988": {"publish_time": "2024-06-14", "title": "Details Make a Difference: Object State-Sensitive Neurorobotic Task Planning", "paper_summary": "The state of an object reflects its current status or condition and is\nimportant for a robot's task planning and manipulation. However, detecting an\nobject's state and generating a state-sensitive plan for robots is challenging.\nRecently, pre-trained Large Language Models (LLMs) and Vision-Language Models\n(VLMs) have shown impressive capabilities in generating plans. However, to the\nbest of our knowledge, there is hardly any investigation on whether LLMs or\nVLMs can also generate object state-sensitive plans. To study this, we\nintroduce an Object State-Sensitive Agent (OSSA), a task-planning agent\nempowered by pre-trained neural networks. We propose two methods for OSSA: (i)\na modular model consisting of a pre-trained vision processing module (dense\ncaptioning model, DCM) and a natural language processing model (LLM), and (ii)\na monolithic model consisting only of a VLM. To quantitatively evaluate the\nperformances of the two methods, we use tabletop scenarios where the task is to\nclear the table. We contribute a multimodal benchmark dataset that takes object\nstates into consideration. Our results show that both methods can be used for\nobject state-sensitive tasks, but the monolithic approach outperforms the\nmodular approach. The code for OSSA is available at\n\\url{https://github.com/Xiao-wen-Sun/OSSA}", "paper_summary_zh": "物體的狀態反映其當前狀態或條件，對於機器人的任務規劃和操作非常重要。然而，偵測物體的狀態並為機器人產生狀態敏感的計畫是一項挑戰。最近，預先訓練的大語言模型 (LLM) 和視覺語言模型 (VLM) 在產生計畫方面展現了令人印象深刻的能力。然而，據我們所知，幾乎沒有任何研究探討 LLM 或 VLM 是否也能產生對物體狀態敏感的計畫。為了研究這一點，我們引入了物件狀態敏感代理 (OSSA)，這是一個由預先訓練的神經網路支援的任務規劃代理。我們為 OSSA 提出兩種方法：(i) 一個模組化模型，由預先訓練的視覺處理模組（密集式標題模型，DCM）和自然語言處理模型 (LLM) 組成，以及 (ii) 一個單一模型，僅由 VLM 組成。為了量化評估這兩種方法的效能，我們使用桌面場景，其中任務是清理桌面。我們提供了一個多模態基準資料集，其中考慮了物件狀態。我們的結果表明，這兩種方法都可以用於對物件狀態敏感的任務，但單一方法的表現優於模組化方法。OSSA 的程式碼可在 \\url{https://github.com/Xiao-wen-Sun/OSSA} 取得", "author": "Xiaowen Sun et.al.", "authors": "Xiaowen Sun, Xufeng Zhao, Jae Hee Lee, Wenhao Lu, Matthias Kerzel, Stefan Wermter", "id": "2406.09988v1", "paper_url": "http://arxiv.org/abs/2406.09988v1", "repo": "https://github.com/xiao-wen-sun/ossa"}}