{"2411.11688": {"publish_time": "2024-11-18", "title": "Conceptwm: A Diffusion Model Watermark for Concept Protection", "paper_summary": "The personalization techniques of diffusion models succeed in generating\nspecific concepts but also pose threats to copyright protection and illegal\nuse. Model Watermarking is an effective method to prevent the unauthorized use\nof subject-driven or style-driven image generation, safeguarding concept\ncopyrights. However, under the goal of concept-oriented protection, current\nwatermarking schemes typically add watermarks to all images rather than\napplying them in a refined manner targeted at specific concepts. Additionally,\nthe personalization techniques of diffusion models can easily remove\nwatermarks. Existing watermarking methods struggle to achieve fine-grained\nwatermark embedding with a few images of specific concept and prevent removal\nof watermarks through personalized fine-tuning. Therefore, we introduce a novel\nconcept-oriented watermarking framework that seamlessly embeds imperceptible\nwatermarks into the concept of diffusion models. We conduct extensive\nexperiments and ablation studies to verify our framework. Our code is available\nat https://anonymous.4open.science/r/Conceptwm-4EB3/.", "paper_summary_zh": "擴散模型的個人化技術成功產生了特定概念，但也對版權保護和非法使用構成威脅。模型浮水印是一種預防未經授權使用主題驅動或風格驅動的影像生成，以保護概念版權的有效方法。然而，在以概念為導向的保護目標下，目前的浮水印方案通常會將浮水印加入所有影像，而不是以精緻的方式針對特定概念進行套用。此外，擴散模型的個人化技術可以輕鬆地移除浮水印。現有的浮水印方法難以實現使用少量特定概念影像的細粒度浮水印嵌入，並防止透過個人化微調移除浮水印。因此，我們引入一個新的以概念為導向的浮水印架構，可將難以察覺的浮水印無縫嵌入擴散模型的概念中。我們進行了廣泛的實驗和消融研究，以驗證我們的架構。我們的程式碼可在 https://anonymous.4open.science/r/Conceptwm-4EB3/ 取得。", "author": "Liangqi Lei et.al.", "authors": "Liangqi Lei, Keke Gai, Jing Yu, Liehuang Zhu, Qi Wu", "id": "2411.11688v1", "paper_url": "http://arxiv.org/abs/2411.11688v1", "repo": "null"}}