{"2502.09221": {"publish_time": "2025-02-13", "title": "Pearce's Characterisation in an Epistemic Domain", "paper_summary": "Answer-set programming (ASP) is a successful problem-solving approach in\nlogic-based AI. In ASP, problems are represented as declarative logic programs,\nand solutions are identified through their answer sets. Equilibrium logic (EL)\nis a general-purpose nonmonotonic reasoning formalism, based on a monotonic\nlogic called here-and-there logic. EL was basically proposed by Pearce as a\nfoundational framework of ASP. Epistemic specifications (ES) are extensions of\nASP-programs with subjective literals. These new modal constructs in the\nASP-language make it possible to check whether a regular literal of ASP is true\nin every (or some) answer-set of a program. ES-programs are interpreted by\nworld-views, which are essentially collections of answer-sets. (Reflexive)\nautoepistemic logic is a nonmonotonic formalism, modeling self-belief\n(knowledge) of ideally rational agents. A relatively new semantics for ES is\nbased on a combination of EL and (reflexive) autoepistemic logic. In this\npaper, we first propose an overarching framework in the epistemic ASP domain.\nWe then establish a correspondence between existing (reflexive) (auto)epistemic\nequilibrium logics and our easily-adaptable comprehensive framework, building\non Pearce's characterisation of answer-sets as equilibrium models. We achieve\nthis by extending Ferraris' work on answer sets for propositional theories to\nthe epistemic case and reveal the relationship between some ES-semantic\nproposals.", "paper_summary_zh": "<paragraph>答案集程式設計（ASP）是基於邏輯的人工智慧中一種成功的問題解決方法。在 ASP 中，問題表示為宣告式邏輯程式，並透過其答案集來找出解答。平衡邏輯（EL）是一種通用的非單調推理形式主義，基於一種稱為此處和彼處邏輯的單調邏輯。EL 基本是由 Pearce 作為 ASP 的基礎架構所提出。知識規範（ES）是 ASP 程式與主觀文字的延伸。ASP 語言中的這些新模態建構使得可以檢查 ASP 的常規文字是否在程式的每個（或某些）答案集中為真。ES 程式由世界觀來詮釋，其本質上是答案集的集合。（反身）自認識邏輯是一種非單調形式主義，用來建模理想理性主體的自信念（知識）。ES 的一種相對新的語意是基於 EL 和（反身）自認識邏輯的組合。在本文中，我們首先提出一個涵蓋知識 ASP 領域的架構。然後，我們建立現有（反身）（自）認識平衡邏輯與我們容易適應的綜合架構之間的對應關係，建立在 Pearce 將答案集描述為平衡模型的特性之上。我們透過將 Ferraris 在命題理論的答案集上的工作延伸到知識案例，並揭示一些 ES 語義提案之間的關係來達成這一點。</paragraph>", "author": "Ezgi Iraz Su et.al.", "authors": "Ezgi Iraz Su", "id": "2502.09221v1", "paper_url": "http://arxiv.org/abs/2502.09221v1", "repo": "null"}}