{"2211.01036": {"publish_time": "2022-11-02", "title": "Explainable AI over the Internet of Things (IoT): Overview, State-of-the-Art and Future Directions", "paper_summary": "Explainable Artificial Intelligence (XAI) is transforming the field of\nArtificial Intelligence (AI) by enhancing the trust of end-users in machines.\nAs the number of connected devices keeps on growing, the Internet of Things\n(IoT) market needs to be trustworthy for the end-users. However, existing\nliterature still lacks a systematic and comprehensive survey work on the use of\nXAI for IoT. To bridge this lacking, in this paper, we address the XAI\nframeworks with a focus on their characteristics and support for IoT. We\nillustrate the widely-used XAI services for IoT applications, such as security\nenhancement, Internet of Medical Things (IoMT), Industrial IoT (IIoT), and\nInternet of City Things (IoCT). We also suggest the implementation choice of\nXAI models over IoT systems in these applications with appropriate examples and\nsummarize the key inferences for future works. Moreover, we present the\ncutting-edge development in edge XAI structures and the support of\nsixth-generation (6G) communication services for IoT applications, along with\nkey inferences. In a nutshell, this paper constitutes the first holistic\ncompilation on the development of XAI-based frameworks tailored for the demands\nof future IoT use cases.", "paper_summary_zh": "可解釋人工智慧 (XAI) 透過提升終端使用者對機器信任度，轉變了人工智慧 (AI) 領域。隨著連網裝置數量持續增加，物聯網 (IoT) 市場需要讓終端使用者信賴。然而，現有文獻仍缺乏對於 XAI 用於物聯網的系統性且全面的調查工作。為了彌補這個不足之處，我們在這篇論文中探討 XAI 架構，重點在於其特性和對物聯網的支援。我們說明廣泛使用的 XAI 服務，用於物聯網應用，例如安全性強化、醫療物聯網 (IoMT)、工業物聯網 (IIoT) 和城市物聯網 (IoCT)。我們也建議在這些應用中，透過適當的範例在物聯網系統上實作 XAI 模型的選擇，並總結未來工作的關鍵推論。此外，我們提出邊緣 XAI 架構的尖端發展，以及對物聯網應用第六代 (6G) 通訊服務的支援，連同關鍵推論。簡而言之，這篇論文構成第一個針對 XAI 基礎架構發展的整體彙編，專門針對未來物聯網使用案例的需求。", "author": "Senthil Kumar Jagatheesaperumal et.al.", "authors": "Senthil Kumar Jagatheesaperumal, Quoc-Viet Pham, Rukhsana Ruby, Zhaohui Yang, Chunmei Xu, Zhaoyang Zhang", "id": "2211.01036v2", "paper_url": "http://arxiv.org/abs/2211.01036v2", "repo": "null"}}