{"2411.07820": {"publish_time": "2024-11-12", "title": "Query Optimization for Parametric Knowledge Refinement in Retrieval-Augmented Large Language Models", "paper_summary": "We introduce the \\textit{Extract-Refine-Retrieve-Read} (ERRR) framework, a\nnovel approach designed to bridge the pre-retrieval information gap in\nRetrieval-Augmented Generation (RAG) systems through query optimization\ntailored to meet the specific knowledge requirements of Large Language Models\n(LLMs). Unlike conventional query optimization techniques used in RAG, the ERRR\nframework begins by extracting parametric knowledge from LLMs, followed by\nusing a specialized query optimizer for refining these queries. This process\nensures the retrieval of only the most pertinent information essential for\ngenerating accurate responses. Moreover, to enhance flexibility and reduce\ncomputational costs, we propose a trainable scheme for our pipeline that\nutilizes a smaller, tunable model as the query optimizer, which is refined\nthrough knowledge distillation from a larger teacher model. Our evaluations on\nvarious question-answering (QA) datasets and with different retrieval systems\nshow that ERRR consistently outperforms existing baselines, proving to be a\nversatile and cost-effective module for improving the utility and accuracy of\nRAG systems.", "paper_summary_zh": "我們介紹了「萃取-精煉-擷取-閱讀」(ERRR) 架構，這是一種新穎的方法，旨在透過針對大型語言模型 (LLM) 特定知識需求量身打造的查詢最佳化，來彌補擷取增強產生 (RAG) 系統中的前擷取資訊差距。與 RAG 中使用的傳統查詢最佳化技術不同，ERRR 架構從 LLM 中萃取參數化知識開始，接著使用專門的查詢最佳化器來精煉這些查詢。此程序可確保僅擷取產生準確回應所必要的資訊。此外，為了增強彈性並降低運算成本，我們為我們的管線提出了一個可訓練架構，它利用較小且可調整的模型作為查詢最佳化器，並透過從較大的教師模型中知識萃取來進行精煉。我們在各種問答 (QA) 資料集和不同的擷取系統上的評估顯示，ERRR 持續優於現有的基準，證明它是一個通用且具成本效益的模組，可改善 RAG 系統的效用和準確性。", "author": "Youan Cong et.al.", "authors": "Youan Cong, Cheng Wang, Pritom Saha Akash, Kevin Chen-Chuan Chang", "id": "2411.07820v1", "paper_url": "http://arxiv.org/abs/2411.07820v1", "repo": "null"}}