{"2405.09848": {"publish_time": "2024-05-16", "title": "Enhancing Semantics in Multimodal Chain of Thought via Soft Negative Sampling", "paper_summary": "Chain of thought (CoT) has proven useful for problems requiring complex\nreasoning. Many of these problems are both textual and multimodal. Given the\ninputs in different modalities, a model generates a rationale and then uses it\nto answer a question. Because of the hallucination issue, the generated soft\nnegative rationales with high textual quality but illogical semantics do not\nalways help improve answer accuracy. This study proposes a rationale generation\nmethod using soft negative sampling (SNSE-CoT) to mitigate hallucinations in\nmultimodal CoT. Five methods were applied to generate soft negative samples\nthat shared highly similar text but had different semantics from the original.\nBidirectional margin loss (BML) was applied to introduce them into the\ntraditional contrastive learning framework that involves only positive and\nnegative samples. Extensive experiments on the ScienceQA dataset demonstrated\nthe effectiveness of the proposed method. Code and data are released at\nhttps://github.com/zgMin/SNSE-CoT.", "paper_summary_zh": "思想鏈（CoT）已被證明對於需要複雜推理的問題很有用。其中許多問題既是文本性的，又是多模態的。給定不同模態的輸入，模型會生成一個基本原理，然後使用它來回答問題。由於幻覺問題，生成具有高文本品質但非邏輯語義的軟負基本原理並不總是能幫助提高答案準確性。本研究提出了一種使用軟負採樣（SNSE-CoT）的基本原理生成方法，以減輕多模態 CoT 中的幻覺。應用五種方法生成軟負樣本，這些樣本共享高度相似的文本，但與原始文本具有不同的語義。應用雙向邊際損失（BML）將它們引入傳統對比學習框架，該框架僅涉及正樣本和負樣本。在 ScienceQA 資料集上進行的廣泛實驗證明了所提出方法的有效性。程式碼和資料已發布在 https://github.com/zgMin/SNSE-CoT。", "author": "Guangmin Zheng et.al.", "authors": "Guangmin Zheng, Jin Wang, Xiaobing Zhou, Xuejie Zhang", "id": "2405.09848v1", "paper_url": "http://arxiv.org/abs/2405.09848v1", "repo": "https://github.com/zgmin/snse-cot"}}