{"2412.13599": {"publish_time": "2024-12-18", "title": "Unlocking the Potential of Weakly Labeled Data: A Co-Evolutionary Learning Framework for Abnormality Detection and Report Generation", "paper_summary": "Anatomical abnormality detection and report generation of chest X-ray (CXR)\nare two essential tasks in clinical practice. The former aims at localizing and\ncharacterizing cardiopulmonary radiological findings in CXRs, while the latter\nsummarizes the findings in a detailed report for further diagnosis and\ntreatment. Existing methods often focused on either task separately, ignoring\ntheir correlation. This work proposes a co-evolutionary abnormality detection\nand report generation (CoE-DG) framework. The framework utilizes both fully\nlabeled (with bounding box annotations and clinical reports) and weakly labeled\n(with reports only) data to achieve mutual promotion between the abnormality\ndetection and report generation tasks. Specifically, we introduce a\nbi-directional information interaction strategy with generator-guided\ninformation propagation (GIP) and detector-guided information propagation\n(DIP). For semi-supervised abnormality detection, GIP takes the informative\nfeature extracted by the generator as an auxiliary input to the detector and\nuses the generator's prediction to refine the detector's pseudo labels. We\nfurther propose an intra-image-modal self-adaptive non-maximum suppression\nmodule (SA-NMS). This module dynamically rectifies pseudo detection labels\ngenerated by the teacher detection model with high-confidence predictions by\nthe student.Inversely, for report generation, DIP takes the abnormalities'\ncategories and locations predicted by the detector as input and guidance for\nthe generator to improve the generated reports.", "paper_summary_zh": "胸部 X 光片 (CXR) 的解剖異常偵測與報告生成在臨床實務中有兩個重要的任務。前者旨在定位和描述 CXR 中的心肺放射線學發現，而後者則在詳細報告中總結發現，以利進一步診斷和治療。現有的方法通常專注於單獨的任務，而忽略了它們之間的關聯性。本研究提出了一種協同演化異常偵測與報告生成 (CoE-DG) 架構。此架構同時利用完全標記（包含邊界框標註和臨床報告）和弱標記（僅包含報告）的資料，以達成異常偵測與報告生成任務之間的相互促進。具體來說，我們引入了一個具有生成器引導資訊傳遞 (GIP) 和偵測器引導資訊傳遞 (DIP) 的雙向資訊互動策略。對於半監督異常偵測，GIP 將生成器提取的資訊特徵作為偵測器的輔助輸入，並使用生成器的預測來改善偵測器的偽標籤。我們進一步提出了一個影像內模態自適應非極大值抑制模組 (SA-NMS)。此模組會根據學生具有高信心預測的偽偵測標籤，動態修正由教師偵測模型產生的偽偵測標籤。反之，對於報告生成，DIP 將偵測器預測的異常類別和位置作為生成器的輸入和指引，以改善生成的報告。", "author": "Jinghan Sun et.al.", "authors": "Jinghan Sun, Dong Wei, Zhe Xu, Donghuan Lu, Hong Liu, Hong Wang, Sotirios A. Tsaftaris, Steven McDonagh, Yefeng Zheng, Liansheng Wang", "id": "2412.13599v1", "paper_url": "http://arxiv.org/abs/2412.13599v1", "repo": "null"}}