{"2411.07759": {"publish_time": "2024-11-12", "title": "Optimizing Traffic Signal Control using High-Dimensional State Representation and Efficient Deep Reinforcement Learning", "paper_summary": "In reinforcement learning-based (RL-based) traffic signal control (TSC),\ndecisions on the signal timing are made based on the available information on\nvehicles at a road intersection. This forms the state representation for the RL\nenvironment which can either be high-dimensional containing several variables\nor a low-dimensional vector. Current studies suggest that using high\ndimensional state representations does not lead to improved performance on TSC.\nHowever, we argue, with experimental results, that the use of high dimensional\nstate representations can, in fact, lead to improved TSC performance with\nimprovements up to 17.9% of the average waiting time. This high-dimensional\nrepresentation is obtainable using the cost-effective vehicle-to-infrastructure\n(V2I) communication, encouraging its adoption for TSC. Additionally, given the\nlarge size of the state, we identified the need to have computational efficient\nmodels and explored model compression via pruning.", "paper_summary_zh": "在基於強化學習 (RL) 的交通號誌控制 (TSC) 中，\n有關號誌時序的決策是根據道路交叉口車輛的可用資訊做出的。這形成了 RL 環境的狀態表示，它可以是包含多個變數的高維度，或是一個低維度向量。目前的研究所表明，使用高維度狀態表示並不會提高 TSC 的效能。\n然而，我們通過實驗結果論證，使用高維度狀態表示實際上可以提高 TSC 效能，平均等待時間最多可改善 17.9%。這種高維度表示可以使用具有成本效益的車對基礎設施 (V2I) 通訊獲得，從而鼓勵其用於 TSC。此外，鑑於狀態規模龐大，我們發現有必要擁有計算高效的模型，並透過剪枝探索模型壓縮。", "author": "Lawrence Francis et.al.", "authors": "Lawrence Francis, Blessed Guda, Ahmed Biyabani", "id": "2411.07759v1", "paper_url": "http://arxiv.org/abs/2411.07759v1", "repo": "null"}}