{"2412.13102": {"publish_time": "2024-12-17", "title": "AIR-Bench: Automated Heterogeneous Information Retrieval Benchmark", "paper_summary": "Evaluation plays a crucial role in the advancement of information retrieval\n(IR) models. However, current benchmarks, which are based on predefined domains\nand human-labeled data, face limitations in addressing evaluation needs for\nemerging domains both cost-effectively and efficiently. To address this\nchallenge, we propose the Automated Heterogeneous Information Retrieval\nBenchmark (AIR-Bench). AIR-Bench is distinguished by three key features: 1)\nAutomated. The testing data in AIR-Bench is automatically generated by large\nlanguage models (LLMs) without human intervention. 2) Heterogeneous. The\ntesting data in AIR-Bench is generated with respect to diverse tasks, domains\nand languages. 3) Dynamic. The domains and languages covered by AIR-Bench are\nconstantly augmented to provide an increasingly comprehensive evaluation\nbenchmark for community developers. We develop a reliable and robust data\ngeneration pipeline to automatically create diverse and high-quality evaluation\ndatasets based on real-world corpora. Our findings demonstrate that the\ngenerated testing data in AIR-Bench aligns well with human-labeled testing\ndata, making AIR-Bench a dependable benchmark for evaluating IR models. The\nresources in AIR-Bench are publicly available at\nhttps://github.com/AIR-Bench/AIR-Bench.", "paper_summary_zh": "評估在資訊檢索 (IR) 模型的進步中扮演著至關重要的角色。然而，目前的基準，基於預先定義的網域和人工標記的資料，在以成本效益且有效率的方式滿足新興網域的評估需求方面面臨限制。為了應對這項挑戰，我們提出自動化異質資訊檢索基準 (AIR-Bench)。AIR-Bench 的特點在於三個關鍵特徵：1) 自動化。AIR-Bench 中的測試資料是由大型語言模型 (LLM) 在沒有人工介入的情況下自動產生的。2) 異質性。AIR-Bench 中的測試資料是針對不同的任務、網域和語言產生的。3) 動態性。AIR-Bench 涵蓋的網域和語言不斷增加，為社群開發人員提供越來越全面的評估基準。我們開發出一條可靠且穩健的資料產生管道，以自動建立基於真實世界語料庫的多樣化且高品質的評估資料集。我們的研究結果表明，AIR-Bench 中產生的測試資料與人工標記的測試資料非常吻合，這使得 AIR-Bench 成為評估 IR 模型的可靠基準。AIR-Bench 中的資源可於 https://github.com/AIR-Bench/AIR-Bench 公開取得。", "author": "Jianlyu Chen et.al.", "authors": "Jianlyu Chen, Nan Wang, Chaofan Li, Bo Wang, Shitao Xiao, Han Xiao, Hao Liao, Defu Lian, Zheng Liu", "id": "2412.13102v1", "paper_url": "http://arxiv.org/abs/2412.13102v1", "repo": "https://github.com/air-bench/air-bench"}}