{"2501.09950": {"publish_time": "2025-01-17", "title": "Sympathy over Polarization: A Computational Discourse Analysis of Social Media Posts about the July 2024 Trump Assassination Attempt", "paper_summary": "On July 13, 2024, at the Trump rally in Pennsylvania, someone attempted to\nassassinate Republican Presidential Candidate Donald Trump. This attempt\nsparked a large-scale discussion on social media. We collected posts from X\n(formerly known as Twitter) one week before and after the assassination attempt\nand aimed to model the short-term effects of such a ``shock'' on public\nopinions and discussion topics. Specifically, our study addresses three key\nquestions: first, we investigate how public sentiment toward Donald Trump\nshifts over time and across regions (RQ1) and examine whether the assassination\nattempt itself significantly affects public attitudes, independent of the\nexisting political alignments (RQ2). Finally, we explore the major themes in\nonline conversations before and after the crisis, illustrating how discussion\ntopics evolved in response to this politically charged event (RQ3). By\nintegrating large language model-based sentiment analysis,\ndifference-in-differences modeling, and topic modeling techniques, we find that\nfollowing the attempt the public response was broadly sympathetic to Trump\nrather than polarizing, despite baseline ideological and regional disparities.", "paper_summary_zh": "2024 年 7 月 13 日，在賓夕法尼亞州舉行的川普造勢大會上，有人企圖暗殺共和黨總統候選人唐納·川普。這起暗殺企圖在社群媒體上引發大規模討論。我們收集了 X（前稱 Twitter）在暗殺企圖發生前後一週的貼文，並試圖模擬這種「震驚」對公眾輿論和討論主題的短期影響。具體來說，我們的研究探討了三個關鍵問題：首先，我們調查公眾對唐納·川普的情緒如何隨著時間和地區而轉變（RQ1），並檢視暗殺企圖本身是否顯著影響公眾態度，而不論現有的政治立場（RQ2）。最後，我們探討危機前後網路對話中的主要主題，說明討論主題如何隨著這場政治事件而演變（RQ3）。透過整合大型語言模型的情緒分析、差異中差異建模和主題建模技術，我們發現，儘管存在基本意識形態和區域差異，暗殺企圖發生後，公眾對川普的反應普遍是同情，而非兩極分化。", "author": "Qingcheng Zeng et.al.", "authors": "Qingcheng Zeng, Guanhong Liu, Zhaoqian Xue, Diego Ford, Rob Voigt, Loni Hagen, Lingyao Li", "id": "2501.09950v1", "paper_url": "http://arxiv.org/abs/2501.09950v1", "repo": "null"}}