{"2412.07080": {"publish_time": "2024-12-10", "title": "EvRepSL: Event-Stream Representation via Self-Supervised Learning for Event-Based Vision", "paper_summary": "Event-stream representation is the first step for many computer vision tasks\nusing event cameras. It converts the asynchronous event-streams into a\nformatted structure so that conventional machine learning models can be applied\neasily. However, most of the state-of-the-art event-stream representations are\nmanually designed and the quality of these representations cannot be guaranteed\ndue to the noisy nature of event-streams. In this paper, we introduce a\ndata-driven approach aiming at enhancing the quality of event-stream\nrepresentations. Our approach commences with the introduction of a new\nevent-stream representation based on spatial-temporal statistics, denoted as\nEvRep. Subsequently, we theoretically derive the intrinsic relationship between\nasynchronous event-streams and synchronous video frames. Building upon this\ntheoretical relationship, we train a representation generator, RepGen, in a\nself-supervised learning manner accepting EvRep as input. Finally, the\nevent-streams are converted to high-quality representations, termed as EvRepSL,\nby going through the learned RepGen (without the need of fine-tuning or\nretraining). Our methodology is rigorously validated through extensive\nevaluations on a variety of mainstream event-based classification and optical\nflow datasets (captured with various types of event cameras). The experimental\nresults highlight not only our approach's superior performance over existing\nevent-stream representations but also its versatility, being agnostic to\ndifferent event cameras and tasks.", "paper_summary_zh": "事件串流表示是許多電腦視覺任務的第一步，使用事件相機。它將非同步事件串流轉換成格式化的結構，以便可以輕鬆應用傳統機器學習模型。然而，大多數最先進的事件串流表示都是人工設計的，而這些表示的品質無法保證，因為事件串流具有雜訊的特性。在本文中，我們介紹一種數據驅動的方法，旨在提升事件串流表示的品質。我們的做法從引入一種新的事件串流表示開始，該表示基於時空統計，表示為 EvRep。隨後，我們從理論上推導出非同步事件串流和同步影片幀之間的內在關係。建立在這個理論關係之上，我們訓練了一個表示產生器，RepGen，以一種自我監督學習的方式接受 EvRep 作為輸入。最後，事件串流被轉換成高品質的表示，稱為 EvRepSL，通過學習過的 RepGen（無需微調或重新訓練）。我們的做法通過對各種主流基於事件的分類和光流資料集（使用各種類型的事件相機擷取）進行廣泛評估，得到嚴格驗證。實驗結果不僅突顯了我們的方法優於現有的事件串流表示，還突顯了它的多功能性，對不同的事件相機和任務沒有偏好。", "author": "Qiang Qu et.al.", "authors": "Qiang Qu, Xiaoming Chen, Yuk Ying Chung, Yiran Shen", "id": "2412.07080v1", "paper_url": "http://arxiv.org/abs/2412.07080v1", "repo": "https://github.com/vincentqqu/evrepsl"}}