{"2406.08881": {"publish_time": "2024-06-13", "title": "No perspective, no perception!! Perspective-aware Healthcare Answer Summarization", "paper_summary": "Healthcare Community Question Answering (CQA) forums offer an accessible\nplatform for individuals seeking information on various healthcare-related\ntopics. People find such platforms suitable for self-disclosure, seeking\nmedical opinions, finding simplified explanations for their medical conditions,\nand answering others' questions. However, answers on these forums are typically\ndiverse and prone to off-topic discussions. It can be challenging for readers\nto sift through numerous answers and extract meaningful insights, making answer\nsummarization a crucial task for CQA forums. While several efforts have been\nmade to summarize the community answers, most of them are limited to the open\ndomain and overlook the different perspectives offered by these answers. To\naddress this problem, this paper proposes a novel task of perspective-specific\nanswer summarization. We identify various perspectives, within\nhealthcare-related responses and frame a perspective-driven abstractive summary\ncovering all responses. To achieve this, we annotate 3167 CQA threads with 6193\nperspective-aware summaries in our PUMA dataset. Further, we propose PLASMA, a\nprompt-driven controllable summarization model. To encapsulate the\nperspective-specific conditions, we design an energy-controlled loss function\nfor the optimization. We also leverage the prefix tuner to learn the\nintricacies of the health-care perspective summarization. Our evaluation\nagainst five baselines suggests the superior performance of PLASMA by a margin\nof 1.5-21% improvement. We supplement our experiments with ablation and\nqualitative analysis.", "paper_summary_zh": "<paragraph>醫療保健社群問答 (CQA) 論壇提供了一個可供個人尋找各種醫療保健相關主題資訊的平臺。人們發現此類平臺適合自我揭露、尋求醫療意見、尋找其病情的簡化說明，以及回答他人的問題。然而，這些論壇上的答案通常很分散，且容易出現離題的討論。讀者可能很難篩選眾多答案並提取有意義的見解，這使得答案摘要成為 CQA 論壇的一項重要任務。儘管已做出多項努力來總結社群答案，但其中大多數僅限於開放領域，且忽略了這些答案提供的不同觀點。為了解決這個問題，本文提出了一項觀點特定的答案摘要新任務。我們在醫療保健相關的回應中識別出各種觀點，並構建一個觀點驅動的摘要摘要，涵蓋所有回應。為此，我們使用我們的 PUMA 資料集為 3167 個 CQA 執行緒加上 6193 個觀點感知摘要的註解。此外，我們提出 PLASMA，一種提示驅動的可控摘要模型。為了概括觀點特定的條件，我們設計了一個能量控制損失函數進行最佳化。我們還利用前綴調諧器來學習醫療保健觀點摘要的複雜性。我們對五個基準的評估表明，PLASMA 的效能優於基準，改進幅度在 1.5-21% 之間。我們使用消融和定性分析補充我們的實驗。</paragraph>", "author": "Gauri Naik et.al.", "authors": "Gauri Naik, Sharad Chandakacherla, Shweta Yadav, Md. Shad Akhtar", "id": "2406.08881v1", "paper_url": "http://arxiv.org/abs/2406.08881v1", "repo": "null"}}