{"2502.03325": {"publish_time": "2025-02-05", "title": "ECM: A Unified Electronic Circuit Model for Explaining the Emergence of In-Context Learning and Chain-of-Thought in Large Language Model", "paper_summary": "Recent advancements in large language models (LLMs) have led to significant\nsuccesses across various applications, where the most noticeable is to a series\nof emerging capabilities, particularly in the areas of In-Context Learning\n(ICL) and Chain-of-Thought (CoT). To better understand and control model\nperformance, many studies have begun investigating the underlying causes of\nthese phenomena and their impact on task outcomes. However, existing\nexplanatory frameworks predominantly focus on isolating and explaining ICL and\nCoT independently, leading to an incomplete understanding of their combined\ninfluence on model performance. To address this gap, we propose the Electronic\nCircuit Model (ECM), which provides a foundation for developing scalable,\nlearnable policies and improving the management of AI-generated content.\nSpecifically, ECM conceptualizes model behavior as an electronic circuit: ICL\nis represented as semantic magnetic field to providing an additional voltage\nfollowing Faraday's Law, while CoT is modeled as series resistors to constrain\nthe model output performance following Ohm's Law. Experimental results\ndemonstrate that the ECM effectively predicts and explains LLM performance\nacross a variety of prompting strategies. Furthermore, we apply ECM to advanced\nreasoning strategy optimization on a series of tasks, such as the International\nOlympiad in Informatics (IOI) and the International Mathematical Olympiad\n(IMO), achieving competitive performance that surpasses nearly 80% of top human\ncompetitors.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展已在各種應用中取得顯著成功，其中最顯著的是一系列新興能力，特別是在情境學習 (ICL) 和思維鏈 (CoT) 領域。為了更好地理解和控制模型效能，許多研究已開始探討這些現象的根本原因及其對任務結果的影響。然而，現有的解釋性框架主要著重於獨立隔離和解釋 ICL 和 CoT，導致對它們對模型效能的綜合影響了解不完整。為了解決此差距，我們提出電子電路模型 (ECM)，它提供了一個開發可擴充、可學習政策和改進 AI 生成內容管理的基礎。具體來說，ECM 將模型行為概念化為電子電路：ICL 被表示為語義磁場，根據法拉第定律提供額外電壓，而 CoT 則建模為串聯電阻，以根據歐姆定律約束模型輸出效能。實驗結果表明，ECM 有效預測和解釋了 LLM 在各種提示策略中的效能。此外，我們將 ECM 應用於一系列任務的高級推理策略最佳化，例如國際資訊奧林匹克競賽 (IOI) 和國際數學奧林匹克競賽 (IMO)，取得了優於近 80% 頂尖人類競爭者的競爭性效能。", "author": "Qiguang Chen et.al.", "authors": "Qiguang Chen, Libo Qin, Jinhao Liu, Dengyun Peng, Jiaqi Wang, Mengkang Hu, Zhi Chen, Wanxiang Che, Ting Liu", "id": "2502.03325v1", "paper_url": "http://arxiv.org/abs/2502.03325v1", "repo": "null"}}