{"2409.06223": {"publish_time": "2024-09-10", "title": "Enhancing Temporal Understanding in Audio Question Answering for Large Audio Language Models", "paper_summary": "The Audio Question Answering task includes audio event classification, audio\ncaptioning, and open ended reasoning. Recently, Audio Question Answering has\ngarnered attention due to the advent of Large Audio Language Models. Current\nliterature focuses on constructing LALMs by integrating audio encoders with\ntext only Large Language Models through a projection module. While Large Audio\nLanguage Models excel in general audio understanding, they are limited in\ntemporal reasoning which may hinder their commercial applications and on device\ndeployment. This paper addresses these challenges and limitations in audio\ntemporal reasoning. First, we introduce a data augmentation technique for\ngenerating reliable audio temporal questions and answers using an LLM. Second,\nwe propose a continued finetuning curriculum learning strategy to specialize in\ntemporal reasoning without compromising performance on finetuned tasks.\nFinally, we develop a reliable and transparent automated metric, assisted by an\nLLM, to measure the correlation between Large Audio Language Model responses\nand ground truth data intelligently. We demonstrate the effectiveness of our\nproposed techniques using SOTA LALMs on public audio benchmark datasets.", "paper_summary_zh": "音訊問答任務包括音訊事件分類、音訊字幕和開放式推理。最近，由於大型音訊語言模型的出現，音訊問答引起了關注。目前的文獻著重於透過投影模組將音訊編碼器與純文字大型語言模型整合，來建構 LALM。雖然大型音訊語言模型在一般音訊理解方面表現出色，但它們在時間推理方面受到限制，這可能會阻礙其商業應用和裝置部署。本文探討了音訊時間推理中的這些挑戰和限制。首先，我們引入一種資料擴充技術，使用 LLM 來產生可靠的音訊時間問題和答案。其次，我們提出一個持續微調課程學習策略，專精於時間推理，同時不影響微調任務的效能。最後，我們開發了一個可靠且透明的自動化指標，由 LLM 協助，以智慧的方式衡量大型音訊語言模型回應與地面實況資料之間的關聯性。我們使用公開音訊基準資料集上的 SOTA LALM，展示了我們所提出技術的有效性。", "author": "Arvind Krishna Sridhar et.al.", "authors": "Arvind Krishna Sridhar, Yinyi Guo, Erik Visser", "id": "2409.06223v1", "paper_url": "http://arxiv.org/abs/2409.06223v1", "repo": "null"}}