{"2410.05180": {"publish_time": "2024-10-07", "title": "Enhancing Equity in Large Language Models for Medical Applications", "paper_summary": "Recent advancements have highlighted the potential of large language models\n(LLMs) in medical applications, notably in automating Clinical Trial Matching\nfor translational research and providing medical question-answering for\nclinical decision support. However, our study reveals significant inequities in\nthe use of LLMs, particularly for individuals from specific racial, gender, and\nunderrepresented groups influenced by social determinants of health. These\ndisparities could worsen existing health inequities if LLMs are broadly adopted\nin healthcare. To address this, we propose and evaluate a novel framework,\nEquityGuard, designed to detect and mitigate biases in LLM-based medical\napplications. EquityGuard incorporates a Bias Detection Mechanism capable of\nidentifying and correcting unfair predictions, thus enhancing outcomes and\npromoting equity across diverse population groups.", "paper_summary_zh": "最近的進展突顯出大型語言模型 (LLM) 在醫療應用中的潛力，特別是在轉譯研究中自動化臨床試驗配對，以及提供醫療問題解答以作為臨床決策支援。然而，我們的研究揭示了 LLM 使用上的顯著不平等，特別是對於受社會健康決定因素影響的特定種族、性別和代表性不足的群體。如果 LLM 廣泛應用於醫療保健，這些差異可能會惡化現有的健康不平等。為了解決這個問題，我們提出並評估了一個創新的框架 EquityGuard，旨在偵測和減輕基於 LLM 的醫療應用中的偏差。EquityGuard 結合了一個偏差偵測機制，能夠識別和修正不公平的預測，從而改善結果並促進不同人口群體之間的公平性。", "author": "Yuelyu Ji et.al.", "authors": "Yuelyu Ji, Wenhe Ma, Sonish Sivarajkumar, Hang Zhang, Eugene Mathew Sadhu, Zhuochun Li, Xizhi Wu, Shyam Visweswaran, Yanshan Wang", "id": "2410.05180v1", "paper_url": "http://arxiv.org/abs/2410.05180v1", "repo": "null"}}