{"2407.02863": {"publish_time": "2024-07-03", "title": "Fast maneuver recovery from aerial observation: trajectory clustering and outliers rejection", "paper_summary": "The implementation of road user models that realistically reproduce a\ncredible behavior in a multi-agentsimulation is still an open problem. A\ndata-driven approach consists on to deduce behaviors that may exist in real\nsituation to obtain different types of trajectories from a large set of\nobservations. The data, and its classification, could then be used to train\nmodels capable to extrapolate such behavior. Cars and two different types of\nVulnerable Road Users (VRU) will be considered by the trajectory clustering\nmethods proposed: pedestrians and cyclists. The results reported here evaluate\nmethods to extract well-defined trajectory classes from raw data without the\nuse of map information while also separating ''eccentric'' or incomplete\ntrajectories from the ones that are complete and representative in any\nscenario. Two environments will serve as test for the methods develop, three\ndifferent intersections and one roundabout. The resulting clusters of\ntrajectories can then be used for prediction or learning tasks or discarded if\nit is composed by outliers.", "paper_summary_zh": "在多代理模擬中真實再現可信行為的道路使用者模型實作，仍是一個未解的問題。資料驅動方法包括推論可能存在於真實情況中的行為，以從大量觀察中取得不同類型的軌跡。然後，資料及其分類可被用於訓練能夠推斷出此類行為的模型。由軌跡聚類方法考量汽車和兩種不同類型的易受傷害道路使用者 (VRU)：行人和自行車騎士。在此報告的結果評估了在不使用地圖資訊的情況下，從原始資料中萃取定義良好的軌跡類別的方法，同時也將「偏離」或不完整的軌跡與在任何場景中完整且具代表性的軌跡分開。兩個環境將作為開發方法的測試，三個不同的交叉路口和一個環形交叉路口。軌跡的結果群集可用於預測或學習任務，或在由異常值組成時予以捨棄。", "author": "Nelson de Moura et.al.", "authors": "Nelson de Moura, Augustin Gervreau-Mercier, Fernando Garrido, Fawzi Nashashibi", "id": "2407.02863v1", "paper_url": "http://arxiv.org/abs/2407.02863v1", "repo": "null"}}