{"2410.05210": {"publish_time": "2024-10-07", "title": "Preserving Multi-Modal Capabilities of Pre-trained VLMs for Improving Vision-Linguistic Compositionality", "paper_summary": "In this paper, we propose a new method to enhance compositional understanding\nin pre-trained vision and language models (VLMs) without sacrificing\nperformance in zero-shot multi-modal tasks. Traditional fine-tuning approaches\noften improve compositional reasoning at the cost of degrading multi-modal\ncapabilities, primarily due to the use of global hard negative (HN) loss, which\ncontrasts global representations of images and texts. This global HN loss\npushes HN texts that are highly similar to the original ones, damaging the\nmodel's multi-modal representations. To overcome this limitation, we propose\nFine-grained Selective Calibrated CLIP (FSC-CLIP), which integrates local hard\nnegative loss and selective calibrated regularization. These innovations\nprovide fine-grained negative supervision while preserving the model's\nrepresentational integrity. Our extensive evaluations across diverse benchmarks\nfor both compositionality and multi-modal tasks show that FSC-CLIP not only\nachieves compositionality on par with state-of-the-art models but also retains\nstrong multi-modal capabilities. Code is available at:\nhttps://github.com/ytaek-oh/fsc-clip.", "paper_summary_zh": "<paragraph>在本文中，我們提出了一種新的方法來增強預訓練視覺和語言模型 (VLM) 中的組合理解，同時不犧牲零次學習多模式任務的性能。傳統的微調方法通常會以降低多模式能力為代價來改進組合推理，這主要是由於使用了全局硬負例 (HN) 損失，這與圖像和文本的全局表示形成對比。此全局 HN 損失會推動與原始文本高度相似的 HN 文本，損害模型的多模式表示。為了克服這個限制，我們提出了細粒度選擇性校準 CLIP (FSC-CLIP)，它整合了局部硬負例損失和選擇性校準正則化。這些創新提供了細粒度的負面監督，同時保留了模型的表示完整性。我們對組合性和多模式任務的各種基準進行的廣泛評估表明，FSC-CLIP 不僅實現了與最先進模型相當的組合性，而且還保留了強大的多模式能力。程式碼可在以下位置取得：\nhttps://github.com/ytaek-oh/fsc-clip。</paragraph>", "author": "Youngtaek Oh et.al.", "authors": "Youngtaek Oh, Jae Won Cho, Dong-Jin Kim, In So Kweon, Junmo Kim", "id": "2410.05210v1", "paper_url": "http://arxiv.org/abs/2410.05210v1", "repo": "https://github.com/ytaek-oh/fsc-clip"}}