{"2412.19685": {"publish_time": "2024-12-27", "title": "A Large-scale Interpretable Multi-modality Benchmark for Facial Image Forgery Localization", "paper_summary": "Image forgery localization, which centers on identifying tampered pixels\nwithin an image, has seen significant advancements. Traditional approaches\noften model this challenge as a variant of image segmentation, treating the\nbinary segmentation of forged areas as the end product. We argue that the basic\nbinary forgery mask is inadequate for explaining model predictions. It doesn't\nclarify why the model pinpoints certain areas and treats all forged pixels the\nsame, making it hard to spot the most fake-looking parts. In this study, we\nmitigate the aforementioned limitations by generating salient region-focused\ninterpretation for the forgery images. To support this, we craft a Multi-Modal\nTramper Tracing (MMTT) dataset, comprising facial images manipulated using\ndeepfake techniques and paired with manual, interpretable textual annotations.\nTo harvest high-quality annotation, annotators are instructed to meticulously\nobserve the manipulated images and articulate the typical characteristics of\nthe forgery regions. Subsequently, we collect a dataset of 128,303 image-text\npairs. Leveraging the MMTT dataset, we develop ForgeryTalker, an architecture\ndesigned for concurrent forgery localization and interpretation. ForgeryTalker\nfirst trains a forgery prompter network to identify the pivotal clues within\nthe explanatory text. Subsequently, the region prompter is incorporated into\nmultimodal large language model for finetuning to achieve the dual goals of\nlocalization and interpretation. Extensive experiments conducted on the MMTT\ndataset verify the superior performance of our proposed model. The dataset,\ncode as well as pretrained checkpoints will be made publicly available to\nfacilitate further research and ensure the reproducibility of our results.", "paper_summary_zh": "影像偽造定位，其重點在於辨識影像中被竄改的像素，已取得顯著進展。傳統手法通常將此挑戰建模為影像分割的變體，將偽造區域的二元分割視為最終產出。我們認為基本的二元偽造遮罩不足以說明模型預測。它無法釐清模型為何會精確指出特定區域，並將所有偽造像素視為相同，這使得難以找出看起來最假的部份。在本研究中，我們透過為偽造影像產生顯著區域聚焦的詮釋來減輕上述限制。為支援此一目標，我們製作了一個多模式偽造者追蹤 (MMTT) 資料集，其中包含使用深度偽造技術處理的人臉影像，並搭配手動、可詮釋的文字註解。為了收集高品質的註解，我們指示註解者仔細觀察經過處理的影像，並說明偽造區域的典型特徵。隨後，我們收集了一個包含 128,303 組影像文字配對的資料集。我們利用 MMTT 資料集，開發了 ForgeryTalker，這是一種專門用於同時進行偽造定位與詮釋的架構。ForgeryTalker 首先訓練一個偽造提示器網路，以辨識說明文字中的關鍵線索。隨後，將區域提示器納入多模式大型語言模型中進行微調，以達成定位和詮釋的雙重目標。在 MMTT 資料集上進行的廣泛實驗驗證了我們提出的模型的卓越效能。資料集、程式碼以及預訓練的檢查點將公開提供，以利進一步的研究，並確保我們結果的可重現性。", "author": "Jingchun Lian et.al.", "authors": "Jingchun Lian, Lingyu Liu, Yaxiong Wang, Yujiao Wu, Li Zhu, Zhedong Zheng", "id": "2412.19685v1", "paper_url": "http://arxiv.org/abs/2412.19685v1", "repo": "null"}}