{"2411.00897": {"publish_time": "2024-11-01", "title": "Enhancing the Traditional Chinese Medicine Capabilities of Large Language Model through Reinforcement Learning from AI Feedback", "paper_summary": "Although large language models perform well in understanding and responding\nto user intent, their performance in specialized domains such as Traditional\nChinese Medicine (TCM) remains limited due to lack of expertise. In addition,\nhigh-quality data related to TCM is scarce and difficult to obtain, making\nlarge language models ineffective in handling TCM tasks. In this work, we\npropose a framework to improve the performance of large language models for TCM\ntasks using only a small amount of data. First, we use medical case data for\nsupervised fine-tuning of the large model, making it initially capable of\nperforming TCM tasks. Subsequently, we further optimize the model's performance\nusing reinforcement learning from AI feedback (RLAIF) to align it with the\npreference data. The ablation study also demonstrated the performance gain is\nattributed to both supervised fine-tuning and the direct policy optimization.\nThe experimental results show that the model trained with a small amount of\ndata achieves a significant performance improvement on a representative TCM\ntask.", "paper_summary_zh": "儘管大型語言模型在理解和回應使用者意圖方面表現良好，但由於缺乏專業知識，它們在傳統中醫 (TCM) 等專業領域的表現仍然有限。此外，與中醫相關的高品質資料稀少且難以取得，這使得大型語言模型在處理中醫任務時效果不彰。在這項工作中，我們提出一個架構，使用少量資料來改善大型語言模型在中醫任務中的表現。首先，我們使用醫療案例資料對大型模型進行監督微調，使其最初具備執行中醫任務的能力。隨後，我們進一步使用人工智慧回饋的強化學習 (RLAIF) 來最佳化模型的表現，使其與偏好資料保持一致。消融研究也證明，表現提升歸功於監督微調和直接策略最佳化。實驗結果顯示，使用少量資料訓練的模型在代表性的中醫任務上取得顯著的表現提升。", "author": "Song Yu et.al.", "authors": "Song Yu, Xiaofei Xu, Fangfei Xu, Li Li", "id": "2411.00897v1", "paper_url": "http://arxiv.org/abs/2411.00897v1", "repo": "null"}}