{"2408.10905": {"publish_time": "2024-08-20", "title": "The impact of labeling automotive AI as \"trustworthy\" or \"reliable\" on user evaluation and technology acceptance", "paper_summary": "This study explores whether labeling AI as \"trustworthy\" or \"reliable\"\ninfluences user perceptions and acceptance of automotive AI technologies. Using\na one-way between-subjects design, the research involved 478 online\nparticipants who were presented with guidelines for either trustworthy or\nreliable AI. Participants then evaluated three vignette scenarios and completed\na modified version of the Technology Acceptance Model, which included variables\nsuch as perceived ease of use, human-like trust, and overall attitude. Although\nlabeling AI as \"trustworthy\" did not significantly influence judgments on\nspecific scenarios, it increased perceived ease of use and human-like trust,\nparticularly benevolence. This suggests a positive impact on usability and an\nanthropomorphic effect on user perceptions. The study provides insights into\nhow specific labels can influence attitudes toward AI technology.", "paper_summary_zh": "本研究探讨標籤 AI 為「可信賴」或「可靠」是否會影響使用者對汽車 AI 技術的認知和接受度。研究採用單向受試者間設計，參與研究的 478 位線上參與者會收到可信賴或可靠 AI 的指引。參與者接著評估三個短文情境，並完成改良版的技術接受模式，其中包含感知易用性、類人信任和整體態度等變數。雖然標籤 AI 為「可信賴」並未顯著影響對特定情境的判斷，但它提高了感知易用性和類人信任，特別是仁慈。這表示對可用性有正面影響，並對使用者認知產生擬人化效果。本研究提供深入見解，說明特定標籤如何影響對 AI 技術的態度。", "author": "John Dorsch et.al.", "authors": "John Dorsch, Ophelia Deroy", "id": "2408.10905v1", "paper_url": "http://arxiv.org/abs/2408.10905v1", "repo": "null"}}