{"2408.10901": {"publish_time": "2024-08-20", "title": "A Grey-box Attack against Latent Diffusion Model-based Image Editing by Posterior Collapse", "paper_summary": "Recent advancements in generative AI, particularly Latent Diffusion Models\n(LDMs), have revolutionized image synthesis and manipulation. However, these\ngenerative techniques raises concerns about data misappropriation and\nintellectual property infringement. Adversarial attacks on machine learning\nmodels have been extensively studied, and a well-established body of research\nhas extended these techniques as a benign metric to prevent the underlying\nmisuse of generative AI. Current approaches to safeguarding images from\nmanipulation by LDMs are limited by their reliance on model-specific knowledge\nand their inability to significantly degrade semantic quality of generated\nimages. In response to these shortcomings, we propose the Posterior Collapse\nAttack (PCA) based on the observation that VAEs suffer from posterior collapse\nduring training. Our method minimizes dependence on the white-box information\nof target models to get rid of the implicit reliance on model-specific\nknowledge. By accessing merely a small amount of LDM parameters, in specific\nmerely the VAE encoder of LDMs, our method causes a substantial semantic\ncollapse in generation quality, particularly in perceptual consistency, and\ndemonstrates strong transferability across various model architectures.\nExperimental results show that PCA achieves superior perturbation effects on\nimage generation of LDMs with lower runtime and VRAM. Our method outperforms\nexisting techniques, offering a more robust and generalizable solution that is\nhelpful in alleviating the socio-technical challenges posed by the rapidly\nevolving landscape of generative AI.", "paper_summary_zh": "生成式 AI 的最新进展，尤其是潜在擴散模型 (LDM)，徹底改變了圖像合成和處理。然而，這些生成技術引發了對資料盜用和智慧財產權侵權的擔憂。已經廣泛研究了對機器學習模型的對抗性攻擊，並且大量既定的研究已將這些技術延伸為一項良性指標，以防止生成式 AI 的潛在誤用。目前保護圖像免受 LDM 操縱的方法受到其依賴模型特定知識和無法顯著降低生成圖像的語義品質的限制。針對這些缺點，我們提出了後驗崩潰攻擊 (PCA)，其基於在訓練期間 VAE 會遭受後驗崩潰的觀察。我們的技術將對目標模型的白盒資訊的依賴降到最低，以擺脫對模型特定知識的隱含依賴。透過僅存取少量 LDM 參數，特別是 LDM 的 VAE 編碼器，我們的技術會導致生成品質出現大量的語義崩潰，特別是在感知一致性方面，並展示出跨各種模型架構的強大可移植性。實驗結果顯示，PCA 以較低的執行時間和 VRAM 對 LDM 的影像生成實現了優越的擾動效果。我們的技術優於現有技術，提供了一個更強大且可概化的解決方案，有助於減輕生成式 AI 快速演變的環境所帶來的社會技術挑戰。", "author": "Zhongliang Guo et.al.", "authors": "Zhongliang Guo, Lei Fang, Jingyu Lin, Yifei Qian, Shuai Zhao, Zeyu Wang, Junhao Dong, Cunjian Chen, Ognjen Arandjelović, Chun Pong Lau", "id": "2408.10901v1", "paper_url": "http://arxiv.org/abs/2408.10901v1", "repo": "null"}}