{"2410.05018": {"publish_time": "2024-10-07", "title": "On the Biased Assessment of Expert Finding Systems", "paper_summary": "In large organisations, identifying experts on a given topic is crucial in\nleveraging the internal knowledge spread across teams and departments.\nSo-called enterprise expert retrieval systems automatically discover and\nstructure employees' expertise based on the vast amount of heterogeneous data\navailable about them and the work they perform. Evaluating these systems\nrequires comprehensive ground truth expert annotations, which are hard to\nobtain. Therefore, the annotation process typically relies on automated\nrecommendations of knowledge areas to validate. This case study provides an\nanalysis of how these recommendations can impact the evaluation of expert\nfinding systems. We demonstrate on a popular benchmark that system-validated\nannotations lead to overestimated performance of traditional term-based\nretrieval models and even invalidate comparisons with more recent neural\nmethods. We also augment knowledge areas with synonyms to uncover a strong bias\ntowards literal mentions of their constituent words. Finally, we propose\nconstraints to the annotation process to prevent these biased evaluations, and\nshow that this still allows annotation suggestions of high utility. These\nfindings should inform benchmark creation or selection for expert finding, to\nguarantee meaningful comparison of methods.", "paper_summary_zh": "在大組織中，找出特定主題的專家對於利用團隊和部門間傳播的內部知識至關重要。\n所謂的企業專家檢索系統會自動根據大量可用的異質資料和他們執行的任務，找出並建構員工的專業知識。\n評估這些系統需要全面的真實專家註解，而這很難取得。\n因此，註解流程通常依賴於知識領域的自動化建議來驗證。\n本個案研究分析了這些建議如何影響專家尋找系統的評估。\n我們在一個熱門基準上示範，系統驗證的註解會導致傳統基於術語的檢索模型的效能被高估，甚至會使與較新的神經方法的比較失效。\n我們也用同義詞擴充知識領域，以找出對其組成詞彙的字面提及的強烈偏見。\n最後，我們建議對註解流程進行約束，以防止這些有偏見的評估，並顯示這仍然允許高實用性的註解建議。\n這些發現應告知基準建立或選擇以進行專家尋找，以確保方法的意義比較。", "author": "Jens-Joris Decorte et.al.", "authors": "Jens-Joris Decorte, Jeroen Van Hautte, Chris Develder, Thomas Demeester", "id": "2410.05018v1", "paper_url": "http://arxiv.org/abs/2410.05018v1", "repo": "null"}}