{"2410.16229": {"publish_time": "2024-10-21", "title": "Building A Coding Assistant via the Retrieval-Augmented Language Model", "paper_summary": "Pretrained language models have shown strong effectiveness in code-related\ntasks, such as code retrieval, code generation, code summarization, and code\ncompletion tasks. In this paper, we propose COde assistaNt viA\nretrieval-augmeNted language model (CONAN), which aims to build a code\nassistant by mimicking the knowledge-seeking behaviors of humans during coding.\nSpecifically, it consists of a code structure aware retriever (CONAN-R) and a\ndual-view code representation-based retrieval-augmented generation model\n(CONAN-G). CONAN-R pretrains CodeT5 using Code-Documentation Alignment and\nMasked Entity Prediction tasks to make language models code structure-aware and\nlearn effective representations for code snippets and documentation. Then\nCONAN-G designs a dual-view code representation mechanism for implementing a\nretrieval-augmented code generation model. CONAN-G regards the code\ndocumentation descriptions as prompts, which help language models better\nunderstand the code semantics. Our experiments show that CONAN achieves\nconvincing performance on different code generation tasks and significantly\noutperforms previous retrieval augmented code generation models. Our further\nanalyses show that CONAN learns tailored representations for both code snippets\nand documentation by aligning code-documentation data pairs and capturing\nstructural semantics by masking and predicting entities in the code data.\nAdditionally, the retrieved code snippets and documentation provide necessary\ninformation from both program language and natural language to assist the code\ngeneration process. CONAN can also be used as an assistant for Large Language\nModels (LLMs), providing LLMs with external knowledge in shorter code document\nlengths to improve their effectiveness on various code tasks. It shows the\nability of CONAN to extract necessary information and help filter out the noise\nfrom retrieved code documents.", "paper_summary_zh": "<paragraph>預訓練語言模型在與程式碼相關的任務中展現出強大的效能，例如程式碼擷取、程式碼產生、程式碼摘要和程式碼完成任務。在本文中，我們提出透過擷取增強語言模型（CONAN）的程式碼助理（CONAN），其目的是透過模擬人類在編碼期間尋求知識的行為來建構程式碼助理。具體來說，它包含一個程式碼結構感知擷取器（CONAN-R）和一個基於雙視角程式碼表示的擷取增強產生模型（CONAN-G）。CONAN-R 使用程式碼文件對齊和遮罩實體預測任務預訓練 CodeT5，以使語言模型具有程式碼結構感知，並學習程式碼片段和文件的有效表示。然後，CONAN-G 設計一個雙視角程式碼表示機制，用於實作擷取增強程式碼產生模型。CONAN-G 將程式碼文件描述視為提示，這有助於語言模型更了解程式碼語義。我們的實驗顯示，CONAN 在不同的程式碼產生任務上都能達到令人信服的效能，並且顯著優於先前的擷取增強程式碼產生模型。我們進一步的分析顯示，CONAN 透過對齊程式碼文件資料對並遮罩和預測程式碼資料中的實體來捕捉結構語義，學習程式碼片段和文件的客製化表示。此外，擷取的程式碼片段和文件提供了程式語言和自然語言的必要資訊，以協助程式碼產生過程。CONAN 也可以用作大型語言模型（LLM）的助理，為 LLM 提供較短程式碼文件長度的外部知識，以提高其在各種程式碼任務上的效能。這顯示了 CONAN 從擷取的程式碼文件中擷取必要資訊並協助過濾雜訊的能力。</paragraph>", "author": "Xinze Li et.al.", "authors": "Xinze Li, Hanbin Wang, Zhenghao Liu, Shi Yu, Shuo Wang, Shuo Wang, Yukun Yan, Yukai Fu, Yu Gu, Ge Yu", "id": "2410.16229v1", "paper_url": "http://arxiv.org/abs/2410.16229v1", "repo": "null"}}