{"2412.17523": {"publish_time": "2024-12-23", "title": "Constructing Fair Latent Space for Intersection of Fairness and Explainability", "paper_summary": "As the use of machine learning models has increased, numerous studies have\naimed to enhance fairness. However, research on the intersection of fairness\nand explainability remains insufficient, leading to potential issues in gaining\nthe trust of actual users. Here, we propose a novel module that constructs a\nfair latent space, enabling faithful explanation while ensuring fairness. The\nfair latent space is constructed by disentangling and redistributing labels and\nsensitive attributes, allowing the generation of counterfactual explanations\nfor each type of information. Our module is attached to a pretrained generative\nmodel, transforming its biased latent space into a fair latent space.\nAdditionally, since only the module needs to be trained, there are advantages\nin terms of time and cost savings, without the need to train the entire\ngenerative model. We validate the fair latent space with various fairness\nmetrics and demonstrate that our approach can effectively provide explanations\nfor biased decisions and assurances of fairness.", "paper_summary_zh": "隨著機器學習模型的使用增加，許多研究旨在提升公平性。然而，公平性與可解釋性之間的交叉研究仍不足，導致在獲得實際用戶信任方面出現潛在問題。在此，我們提出一個創新的模組，用於建構一個公平的潛在空間，在確保公平性的同時，提供忠實的解釋。公平的潛在空間是透過解開和重新分配標籤和敏感屬性來建構的，允許為每種類型的資訊產生反事實的解釋。我們的模組附加到一個預先訓練的生成模型，將其有偏差的潛在空間轉換成一個公平的潛在空間。此外，由於只需要訓練模組，因此在時間和成本節省方面具有優勢，無需訓練整個生成模型。我們使用各種公平性指標驗證公平的潛在空間，並證明我們的做法可以有效地為有偏差的決策提供解釋，並保證公平性。", "author": "Hyungjun Joo et.al.", "authors": "Hyungjun Joo, Hyeonggeun Han, Sehwan Kim, Sangwoo Hong, Jungwoo Lee", "id": "2412.17523v1", "paper_url": "http://arxiv.org/abs/2412.17523v1", "repo": "null"}}