{"2412.10441": {"publish_time": "2024-12-11", "title": "Novel 3D Binary Indexed Tree for Volume Computation of 3D Reconstructed Models from Volumetric Data", "paper_summary": "In the burgeoning field of medical imaging, precise computation of 3D volume\nholds a significant importance for subsequent qualitative analysis of 3D\nreconstructed objects. Combining multivariate calculus, marching cube\nalgorithm, and binary indexed tree data structure, we developed an algorithm\nfor efficient computation of intrinsic volume of any volumetric data recovered\nfrom computed tomography (CT) or magnetic resonance (MR). We proposed the 30\nconfigurations of volume values based on the polygonal mesh generation method.\nOur algorithm processes the data in scan-line order simultaneously with\nreconstruction algorithm to create a Fenwick tree, ensuring query time much\nfaster and assisting users' edition of slicing or transforming model. We tested\nthe algorithm's accuracy on simple 3D objects (e.g., sphere, cylinder) to\ncomplicated structures (e.g., lungs, cardiac chambers). The result deviated\nwithin $\\pm 0.004 \\text{cm}^3$ and there is still room for further improvement.", "paper_summary_zh": "在蓬勃發展的醫學影像領域中，3D 體積的精確計算對於後續 3D 重建物體的定性分析具有重要意義。結合多元微積分、行進立方體演算法和二元索引樹資料結構，我們開發了一種演算法，用於有效計算從電腦斷層掃描 (CT) 或磁振造影 (MR) 中恢復的任何體積資料的內在體積。我們根據多邊形網格生成方法提出了 30 種體積值的配置。我們的演算法與重建演算法同時以掃描線順序處理資料，以建立芬威克樹，確保查詢時間更快，並協助使用者編輯切片或轉換模型。我們在簡單的 3D 物體（例如球體、圓柱體）上測試了演算法的準確性，並對複雜的結構（例如肺、心腔）進行了測試。結果偏離在 $\\pm 0.004 \\text{cm}^3$ 內，並且仍有進一步改進的空間。", "author": "Quoc-Bao Nguyen-Le et.al.", "authors": "Quoc-Bao Nguyen-Le, Tuan-Hy Le, Anh-Triet Do", "id": "2412.10441v1", "paper_url": "http://arxiv.org/abs/2412.10441v1", "repo": "null"}}