{"2410.14627": {"publish_time": "2024-10-18", "title": "CELI: Controller-Embedded Language Model Interactions", "paper_summary": "We introduce Controller-Embedded Language Model Interactions (CELI), a\nframework that integrates control logic directly within language model (LM)\nprompts, facilitating complex, multi-stage task execution. CELI addresses\nlimitations of existing prompt engineering and workflow optimization techniques\nby embedding control logic directly within the operational context of language\nmodels, enabling dynamic adaptation to evolving task requirements. Our\nframework transfers control from the traditional programming execution\nenvironment to the LMs, allowing them to autonomously manage computational\nworkflows while maintaining seamless interaction with external systems and\nfunctions. CELI supports arbitrary function calls with variable arguments,\nbridging the gap between LMs' adaptive reasoning capabilities and conventional\nsoftware paradigms' structured control mechanisms. To evaluate CELI's\nversatility and effectiveness, we conducted case studies in two distinct\ndomains: code generation (HumanEval benchmark) and multi-stage content\ngeneration (Wikipedia-style articles). The results demonstrate notable\nperformance improvements across a range of domains. CELI achieved a 4.9\npercentage point improvement over the best reported score of the baseline GPT-4\nmodel on the HumanEval code generation benchmark. In multi-stage content\ngeneration, 94.4% of CELI-produced Wikipedia-style articles met or exceeded\nfirst draft quality when optimally configured, with 44.4% achieving high\nquality. These outcomes underscore CELI's potential for optimizing AI-driven\nworkflows across diverse computational domains.", "paper_summary_zh": "<paragraph>我們引入了控制器嵌入式語言模型互動 (CELI)，一種將控制邏輯直接整合到語言模型 (LM) 提示中的框架，促進了複雜的多階段任務執行。CELI 透過將控制邏輯直接嵌入語言模型的操作環境中，解決了現有提示工程和工作流程最佳化技術的限制，實現了對不斷變化的任務需求的動態適應。我們的框架將控制權從傳統的程式執行環境轉移到 LM，讓它們能夠自主管理計算工作流程，同時與外部系統和功能保持無縫互動。CELI 支援使用變數引數的任意函式呼叫，彌合了 LM 的自適應推理能力與傳統軟體範例的結構化控制機制之間的差距。為了評估 CELI 的多功能性和有效性，我們在兩個不同的領域進行了案例研究：程式碼生成 (HumanEval 基準) 和多階段內容生成 (維基百科風格的文章)。結果證明在各種領域中都有顯著的效能提升。在 HumanEval 程式碼生成基準中，CELI 的表現比基線 GPT-4 模型的最佳報告分數提升了 4.9 個百分點。在多階段內容生成中，94.4% 的 CELI 生成的維基百科風格文章在最佳配置下達到或超過初稿品質，其中 44.4% 達到高品質。這些結果強調了 CELI 在優化跨不同計算領域的 AI 驅動工作流程方面的潛力。</paragraph>", "author": "Jan-Samuel Wagner et.al.", "authors": "Jan-Samuel Wagner, Dave DeCaprio, Abishek Chiffon Muthu Raja, Jonathan M. Holman, Lauren K. Brady, Sky C. Cheung, Hosein Barzekar, Eric Yang, Mark Anthony Martinez II, David Soong, Sriram Sridhar, Han Si, Brandon W. Higgs, Hisham Hamadeh, Scott Ogden", "id": "2410.14627v1", "paper_url": "http://arxiv.org/abs/2410.14627v1", "repo": "null"}}