{"2411.16086": {"publish_time": "2024-11-25", "title": "HiDP: Hierarchical DNN Partitioning for Distributed Inference on Heterogeneous Edge Platforms", "paper_summary": "Edge inference techniques partition and distribute Deep Neural Network (DNN)\ninference tasks among multiple edge nodes for low latency inference, without\nconsidering the core-level heterogeneity of edge nodes. Further, default DNN\ninference frameworks also do not fully utilize the resources of heterogeneous\nedge nodes, resulting in higher inference latency. In this work, we propose a\nhierarchical DNN partitioning strategy (HiDP) for distributed inference on\nheterogeneous edge nodes. Our strategy hierarchically partitions DNN workloads\nat both global and local levels by considering the core-level heterogeneity of\nedge nodes. We evaluated our proposed HiDP strategy against relevant\ndistributed inference techniques over widely used DNN models on commercial edge\ndevices. On average our strategy achieved 38% lower latency, 46% lower energy,\nand 56% higher throughput in comparison with other relevant approaches.", "paper_summary_zh": "邊緣推理技術將深度神經網路 (DNN) 推論任務分割並分配給多個邊緣節點以進行低延遲推理，而不會考慮邊緣節點的核心層級異質性。此外，預設的 DNN 推論框架也不會完全利用異質邊緣節點的資源，導致更高的推論延遲。在這項工作中，我們提出了一種針對異質邊緣節點的分布式推論分層 DNN 分割策略 (HiDP)。我們的策略透過考慮邊緣節點的核心層級異質性，在全球和局部層級分層分割 DNN 工作負載。我們針對廣泛使用的 DNN 模型評估了我們提出的 HiDP 策略與相關的分布式推論技術在商用邊緣裝置上的表現。平均而言，我們的策略與其他相關方法相比，延遲降低了 38%，能耗降低了 46%，且吞吐量提高了 56%。", "author": "Zain Taufique et.al.", "authors": "Zain Taufique, Aman Vyas, Antonio Miele, Pasi Liljeberg, Anil Kanduri", "id": "2411.16086v1", "paper_url": "http://arxiv.org/abs/2411.16086v1", "repo": "null"}}