{"2501.11823": {"publish_time": "2025-01-21", "title": "Toward Scalable Graph Unlearning: A Node Influence Maximization based Approach", "paper_summary": "Machine unlearning, as a pivotal technology for enhancing model robustness\nand data privacy, has garnered significant attention in prevalent web mining\napplications, especially in thriving graph-based scenarios. However, most\nexisting graph unlearning (GU) approaches face significant challenges due to\nthe intricate interactions among web-scale graph elements during the model\ntraining: (1) The gradient-driven node entanglement hinders the complete\nknowledge removal in response to unlearning requests; (2) The billion-level\ngraph elements in the web scenarios present inevitable scalability issues. To\nbreak the above limitations, we open up a new perspective by drawing a\nconnection between GU and conventional social influence maximization. To this\nend, we propose Node Influence Maximization (NIM) through the decoupled\ninfluence propagation model and fine-grained influence function in a scalable\nmanner, which is crafted to be a plug-and-play strategy to identify potential\nnodes affected by unlearning entities. This approach enables offline execution\nindependent of GU, allowing it to be seamlessly integrated into most GU methods\nto improve their unlearning performance. Based on this, we introduce Scalable\nGraph Unlearning (SGU) as a new fine-tuned framework, which balances the\nforgetting and reasoning capability of the unlearned model by entity-specific\noptimizations. Extensive experiments on 14 datasets, including large-scale\nogbn-papers100M, have demonstrated the effectiveness of our approach.\nSpecifically, NIM enhances the forgetting capability of most GU methods, while\nSGU achieves comprehensive SOTA performance and maintains scalability.", "paper_summary_zh": "機器去學習，作為增強模型穩健性和資料隱私的關鍵技術，在普遍的網路挖掘應用中獲得顯著的關注，特別是在蓬勃發展的基於圖表的場景中。然而，大多數現有的圖表去學習 (GU) 方法在模型訓練期間由於網路規模圖表元素之間的複雜交互作用而面臨重大挑戰：(1) 梯度驅動的節點糾纏阻礙了對去學習請求的完整知識刪除；(2) 網路場景中的十億級圖表元素提出了不可避免的可擴充性問題。為了突破上述限制，我們通過在 GU 和傳統的社會影響最大化之間建立聯繫，開闢了一個新的視角。為此，我們通過解耦的影響傳播模型和可擴充性方式中的細粒度影響函數，提出了節點影響最大化 (NIM)，它被設計為一個即插即用的策略，用於識別受去學習實體影響的潛在節點。這種方法允許離線執行獨立於 GU，使其可以無縫整合到大多數 GU 方法中，以改善其去學習效能。基於此，我們引入了可擴充圖表去學習 (SGU) 作為一個新的微調框架，它通過實體特定的最佳化平衡了去學習模型的遺忘和推理能力。在 14 個資料集上的廣泛實驗，包括大規模的 ogbn-papers100M，證明了我們方法的有效性。具體來說，NIM 增強了大多數 GU 方法的遺忘能力，而 SGU 則實現了全面的 SOTA 效能並保持可擴充性。", "author": "Xunkai Li et.al.", "authors": "Xunkai Li, Bowen Fan, Zhengyu Wu, Zhiyu Li, Rong-Hua Li, Guoren Wang", "id": "2501.11823v1", "paper_url": "http://arxiv.org/abs/2501.11823v1", "repo": "null"}}