{"2501.02508": {"publish_time": "2025-01-05", "title": "PTEENet: Post-Trained Early-Exit Neural Networks Augmentation for Inference Cost Optimization", "paper_summary": "For many practical applications, a high computational cost of inference over\ndeep network architectures might be unacceptable. A small degradation in the\noverall inference accuracy might be a reasonable price to pay for a significant\nreduction in the required computational resources. In this work, we describe a\nmethod for introducing \"shortcuts\" into the DNN feedforward inference process\nby skipping costly feedforward computations whenever possible. The proposed\nmethod is based on the previously described BranchyNet (Teerapittayanon et al.,\n2016) and the EEnet (Demir, 2019) architectures that jointly train the main\nnetwork and early exit branches. We extend those methods by attaching branches\nto pre-trained models and, thus, eliminating the need to alter the original\nweights of the network. We also suggest a new branch architecture based on\nconvolutional building blocks to allow enough training capacity when applied on\nlarge DNNs. The proposed architecture includes confidence heads that are used\nfor predicting the confidence level in the corresponding early exits. By\ndefining adjusted thresholds on these confidence extensions, we can control in\nreal-time the amount of data exiting from each branch and the overall tradeoff\nbetween speed and accuracy of our model. In our experiments, we evaluate our\nmethod using image datasets (SVHN and CIFAR10) and several DNN architectures\n(ResNet, DenseNet, VGG) with varied depth. Our results demonstrate that the\nproposed method enables us to reduce the average inference computational cost\nand further controlling the tradeoff between the model accuracy and the\ncomputation cost.", "paper_summary_zh": "對於許多實用的應用，深度網路架構中推論的高運算成本可能無法接受。整體推論精度的些微降低可能是為大幅減少所需的運算資源所付出的合理代價。在這項工作中，我們描述一種方法，透過在可能的情況下略過昂貴的饋送前向運算，將「捷徑」引入 DNN 饋送前向推論程序。所提出的方法基於先前描述的 BranchyNet（Teerapittayanon 等人，2016 年）和 EEnet（Demir，2019 年）架構，這些架構會聯合訓練主網路和早期退出分支。我們透過將分支附加到預訓練模型來延伸這些方法，因此消除了變更網路原始權重的需要。我們也建議一種新的分支架構，基於卷積建構區塊，以便在應用於大型 DNN 時允許足夠的訓練容量。所提出的架構包含用於預測對應早期退出的信心水準的信心區塊。透過定義這些信心延伸的調整閾值，我們可以在執行階段控制從每個分支退出的資料量，以及模型的速度與精度的整體取捨。在我們的實驗中，我們使用影像資料集（SVHN 和 CIFAR10）和各種深度（ResNet、DenseNet、VGG）的 DNN 架構來評估我們的模型。我們的結果顯示，所提出的方法能讓我們減少平均推論運算成本，並進一步控制模型精度與運算成本之間的取捨。", "author": "Assaf Lahiany et.al.", "authors": "Assaf Lahiany, Yehudit Aperstein", "id": "2501.02508v1", "paper_url": "http://arxiv.org/abs/2501.02508v1", "repo": "null"}}