{"2502.02481": {"publish_time": "2025-02-04", "title": "Multilingual Machine Translation with Open Large Language Models at Practical Scale: An Empirical Study", "paper_summary": "Large language models (LLMs) have shown continuously improving multilingual\ncapabilities, and even small-scale open-source models have demonstrated rapid\nperformance enhancement. In this paper, we systematically explore the abilities\nof open LLMs with less than ten billion parameters to handle multilingual\nmachine translation (MT) tasks. We conduct comprehensive evaluations on six\npopular LLMs and find that models like Gemma2-9B exhibit impressive\nmultilingual translation capabilities. We then introduce the Parallel-First\nMonolingual-Second (PFMS) data mixing strategy in the continual pretraining\nstage to further enhance the MT performance and present GemmaX2-28, a 9B model\nachieving top-tier multilingual translation performance across 28 languages.\nSpecifically, GemmaX2-28 consistently outperforms the state-of-the-art (SOTA)\nmodels such as TowerInstruct and XALMA and achieves competitive performance\nwith Google Translate and GPT-4-turbo.", "paper_summary_zh": "大型語言模型 (LLM) 持續展現出不斷進步的多語言能力，甚至小規模的開源模型也展現出快速的效能提升。在本文中，我們系統性地探討擁有不到十億個參數的開放式 LLM 處理多語言機器翻譯 (MT) 任務的能力。我們對六個流行的 LLM 進行全面評估，發現像 Gemma2-9B 這樣的模型展現出令人印象深刻的多語言翻譯能力。接著我們在持續預訓練階段引入平行優先單語優先 (PFMS) 資料混合策略，以進一步提升 MT 效能，並提出 GemmaX2-28，一個在 28 種語言中達成頂尖多語言翻譯效能的 9B 模型。具體來說，GemmaX2-28 持續優於 TowerInstruct 和 XALMA 等最先進 (SOTA) 模型，並在 Google Translate 和 GPT-4-turbo 中達成具競爭力的效能。", "author": "Menglong Cui et.al.", "authors": "Menglong Cui, Pengzhi Gao, Wei Liu, Jian Luan, BinWang", "id": "2502.02481v1", "paper_url": "http://arxiv.org/abs/2502.02481v1", "repo": "null"}}