{"2411.12476": {"publish_time": "2024-11-19", "title": "Comparing Prior and Learned Time Representations in Transformer Models of Timeseries", "paper_summary": "What sets timeseries analysis apart from other machine learning exercises is\nthat time representation becomes a primary aspect of the experiment setup, as\nit must adequately represent the temporal relations that are relevant for the\napplication at hand. In the work described here we study wo different\nvariations of the Transformer architecture: one where we use the fixed time\nrepresentation proposed in the literature and one where the time representation\nis learned from the data. Our experiments use data from predicting the energy\noutput of solar panels, a task that exhibits known periodicities (daily and\nseasonal) that is straight-forward to encode in the fixed time representation.\nOur results indicate that even in an experiment where the phenomenon is\nwell-understood, it is difficult to encode prior knowledge due to side-effects\nthat are difficult to mitigate. We conclude that research work is needed to\nwork the human into the learning loop in ways that improve the robustness and\ntrust-worthiness of the network.", "paper_summary_zh": "時序分析不同於其他機器學習練習之處在於，時間表示法成為實驗設定的主要面向，因為它必須適當地表示與手邊應用程式相關的時序關係。在這裡描述的工作中，我們研究了 Transformer 架構的兩種不同變異：一種是我們使用文獻中提出的固定時間表示法，另一種則是從資料中學習時間表示法。我們的實驗使用資料來預測太陽能電池板的能量輸出，這項任務展現出已知的週期性（每日和季節性），很容易編碼在固定的時間表示法中。我們的結果表明，即使在現象被充分理解的實驗中，由於難以減輕的副作用，也很難編碼先驗知識。我們得出結論，需要研究工作將人類納入學習迴路，以改善網路的穩健性和可信度。", "author": "Natalia Koliou et.al.", "authors": "Natalia Koliou, Tatiana Boura, Stasinos Konstantopoulos, George Meramveliotakis, George Kosmadakis", "id": "2411.12476v1", "paper_url": "http://arxiv.org/abs/2411.12476v1", "repo": "null"}}