{"2407.02233": {"publish_time": "2024-07-02", "title": "Synthetic Multimodal Question Generation", "paper_summary": "Multimodal Retrieval Augmented Generation (MMRAG) is a powerful approach to\nquestion-answering over multimodal documents. A key challenge with evaluating\nMMRAG is the paucity of high-quality datasets matching the question styles and\nmodalities of interest. In light of this, we propose SMMQG, a synthetic data\ngeneration framework. SMMQG leverages interplay between a retriever, large\nlanguage model (LLM) and large multimodal model (LMM) to generate question and\nanswer pairs directly from multimodal documents, with the questions conforming\nto specified styles and modalities. We use SMMQG to generate an MMRAG dataset\nof 1024 questions over Wikipedia documents and evaluate state-of-the-art models\nusing it, revealing insights into model performance that are attainable only\nthrough style- and modality-specific evaluation data. Next, we measure the\nquality of data produced by SMMQG via a human study. We find that the quality\nof our synthetic data is on par with the quality of the crowdsourced benchmark\nMMQA and that downstream evaluation results using both datasets strongly\nconcur.", "paper_summary_zh": "多模态检索增强生成（MMRAG）是一种针对多模态文档进行问答的强大方法。MMRAG 评估的一个主要挑战是缺乏与问题样式和感兴趣模式相匹配的高质量数据集。有鉴于此，我们提出了 SMMQG，一种合成数据生成框架。SMMQG 利用检索器、大型语言模型 (LLM) 和大型多模态模型 (LMM) 之间的相互作用，直接从多模态文档中生成问题和答案对，其中问题符合指定的样式和模式。我们使用 SMMQG 生成一个包含 1024 个问题的 MMRAG 数据集，这些问题来自维基百科文档，并使用该数据集评估最先进的模型，揭示了只有通过特定于样式和模式的评估数据才能获得的模型性能见解。接下来，我们通过一项人为研究来衡量 SMMQG 生成的数据质量。我们发现我们合成数据的质量与众包基准 MMQA 的质量相当，并且使用两个数据集的下游评估结果强烈一致。", "author": "Ian Wu et.al.", "authors": "Ian Wu, Sravan Jayanthi, Vijay Viswanathan, Simon Rosenberg, Sina Pakazad, Tongshuang Wu, Graham Neubig", "id": "2407.02233v1", "paper_url": "http://arxiv.org/abs/2407.02233v1", "repo": "null"}}