{"2410.16008": {"publish_time": "2024-10-21", "title": "Resilient Temporal GCN for Smart Grid State Estimation Under Topology Inaccuracies", "paper_summary": "State Estimation is a crucial task in power systems. Graph Neural Networks\nhave demonstrated significant potential in state estimation for power systems\nby effectively analyzing measurement data and capturing the complex\ninteractions and interrelations among the measurements through the system's\ngraph structure. However, the information about the system's graph structure\nmay be inaccurate due to noise, attack or lack of accurate information about\nthe topology of the system. This paper studies these scenarios under topology\nuncertainties and evaluates the impact of the topology uncertainties on the\nperformance of a Temporal Graph Convolutional Network (TGCN) for state\nestimation in power systems. In order to make the model resilient to topology\nuncertainties, modifications in the TGCN model are proposed to incorporate a\nknowledge graph, generated based on the measurement data. This knowledge graph\nsupports the assumed uncertain system graph. Two variations of the TGCN\narchitecture are introduced to integrate the knowledge graph, and their\nperformances are evaluated and compared to demonstrate improved resilience\nagainst topology uncertainties. The evaluation results indicate that while the\ntwo proposed architecture show different performance, they both improve the\nperformance of the TGCN state estimation under topology uncertainties.", "paper_summary_zh": "狀態估計是電力系統中的一項關鍵任務。圖神經網路已證明其在電力系統狀態估計中具有顯著的潛力，方法是有效分析測量資料並透過系統圖結構擷取測量中複雜的互動和相互關係。然而，由於雜訊、攻擊或缺乏關於系統拓撲結構的準確資訊，系統圖結構的資訊可能不準確。本文研究了拓撲結構不確定性下的這些情境，並評估拓撲結構不確定性對時態圖形卷積網路 (TGCN) 在電力系統狀態估計上的效能影響。為了使模型對拓撲結構不確定性具有復原力，提出了 TGCN 模型的修改，以納入基於測量資料產生的知識圖。此知識圖支援假設的不確定系統圖。引入了 TGCN 架構的兩個變體來整合知識圖，並評估其效能並與之比較，以證明對拓撲結構不確定性具有改善的復原力。評估結果表明，雖然兩個提出的架構表現出不同的效能，但它們都改善了 TGCN 狀態估計在拓撲結構不確定性下的效能。", "author": "Seyed Hamed Haghshenas et.al.", "authors": "Seyed Hamed Haghshenas, Mia Naeini", "id": "2410.16008v1", "paper_url": "http://arxiv.org/abs/2410.16008v1", "repo": "null"}}