{"2412.10056": {"publish_time": "2024-12-13", "title": "GAOKAO-Eval: Does high scores truly reflect strong capabilities in LLMs?", "paper_summary": "Large Language Models (LLMs) are commonly evaluated using human-crafted\nbenchmarks, under the premise that higher scores implicitly reflect stronger\nhuman-like performance. However, there is growing concern that LLMs may ``game\"\nthese benchmarks due to data leakage, achieving high scores while struggling\nwith tasks simple for humans. To substantively address the problem, we create\nGAOKAO-Eval, a comprehensive benchmark based on China's National College\nEntrance Examination (Gaokao), and conduct ``closed-book\" evaluations for\nrepresentative models released prior to Gaokao. Contrary to prevailing\nconsensus, even after addressing data leakage and comprehensiveness,\nGAOKAO-Eval reveals that high scores still fail to truly reflect human-aligned\ncapabilities. To better understand this mismatch, We introduce the Rasch model\nfrom cognitive psychology to analyze LLM scoring patterns and identify two key\ndiscrepancies: 1) anomalous consistent performance across various question\ndifficulties, and 2) high variance in performance on questions of similar\ndifficulty. In addition, We identified inconsistent grading of LLM-generated\nanswers among teachers and recurring mistake patterns. we find that the\nphenomenons are well-grounded in the motivations behind OpenAI o1, and o1's\nreasoning-as-difficulties can mitigate the mismatch. These results show that\nGAOKAO-Eval can reveal limitations in LLM capabilities not captured by current\nbenchmarks and highlight the need for more LLM-aligned difficulty analysis.", "paper_summary_zh": "大型語言模型（LLM）通常使用人工評分基準進行評估，前提是較高的分數隱含著更強的人類表現。然而，越來越令人擔憂的是，LLM 可能會由於資料外洩而「玩弄」這些評分基準，在人類執行簡單任務時苦苦掙扎，卻能獲得高分。為了實質解決這個問題，我們根據中國國家大學入學考試（高考）建立了一個全面的評分基準 GAOKAO-Eval，並對在高考之前發布的代表性模型進行「閉卷」評估。與普遍共識相反，即使在解決資料外洩和全面性問題後，GAOKAO-Eval 揭示高分仍然無法真正反映與人類一致的能力。為了更好地理解這種不匹配，我們引入了認知心理學中的 Rasch 模型來分析 LLM 評分模式並找出兩個關鍵差異：1）在各種問題難度中異常一致的表現，以及 2）在難度相似的問題上表現出高變異性。此外，我們發現教師對 LLM 生成的答案評分不一致，並且存在重複的錯誤模式。我們發現這些現象深深植根於 OpenAI o1 背後的動機，o1 的推理即困難，可以減輕這種不匹配。這些結果表明，GAOKAO-Eval 可以揭示 LLM 能力中的限制，而目前的評分基準無法捕捉到這些限制，並強調需要進行更多與 LLM 一致的難度分析。", "author": "Zhikai Lei et.al.", "authors": "Zhikai Lei, Tianyi Liang, Hanglei Hu, Jin Zhang, Yunhua Zhou, Yunfan Shao, Linyang Li, Chenchui Li, Changbo Wang, Hang Yan, Qipeng Guo", "id": "2412.10056v1", "paper_url": "http://arxiv.org/abs/2412.10056v1", "repo": "null"}}