{"2406.19465": {"publish_time": "2024-06-27", "title": "Can Large Language Models Generate High-quality Patent Claims?", "paper_summary": "Large language models (LLMs) have shown exceptional performance across\nvarious text generation tasks but remain under-explored in the patent domain,\nwhich offers highly structured and precise language. This paper constructs a\ndataset to investigate the performance of current LLMs in patent claim\ngeneration. Our results demonstrate that generating claims based on patent\ndescriptions outperforms previous research relying on abstracts. Interestingly,\ncurrent patent-specific LLMs perform much worse than state-of-the-art general\nLLMs, highlighting the necessity for future research on in-domain LLMs. We also\nfind that LLMs can produce high-quality first independent claims, but their\nperformances markedly decrease for subsequent dependent claims. Moreover,\nfine-tuning can enhance the completeness of inventions' features, conceptual\nclarity, and feature linkage. Among the tested LLMs, GPT-4 demonstrates the\nbest performance in comprehensive human evaluations by patent experts, with\nbetter feature coverage, conceptual clarity, and technical coherence. Despite\nthese capabilities, comprehensive revision and modification are still necessary\nto pass rigorous patent scrutiny and ensure legal robustness.", "paper_summary_zh": "大型語言模型（LLM）在各種文本生成任務中表現出色，但在專利領域仍未得到充分探索，而專利領域提供了高度結構化且精確的語言。本文構建了一個數據集，用於調查當前 LLM 在專利權利要求生成中的性能。我們的結果表明，基於專利說明生成權利要求的表現優於依賴摘要的先前研究。有趣的是，當前的專利特定 LLM 的表現遠遜於最先進的通用 LLM，這凸顯了未來對領域內 LLM 研究的必要性。我們還發現，LLM 可以產生高質量的第一個獨立權利要求，但它們的性能對於後續的依賴權利要求會顯著下降。此外，微調可以增強發明的特徵的完整性、概念清晰度和特徵聯繫。在測試的 LLM 中，GPT-4 在專利專家的綜合人類評估中表現出最佳性能，具有更好的特徵覆蓋、概念清晰度和技術連貫性。儘管具有這些能力，但仍需要全面的修改和修改才能通過嚴格的專利審查並確保法律穩健性。", "author": "Lekang Jiang et.al.", "authors": "Lekang Jiang, Caiqi Zhang, Pascal A Scherz, Stephan Goetz", "id": "2406.19465v1", "paper_url": "http://arxiv.org/abs/2406.19465v1", "repo": "null"}}