{"2501.14144": {"publish_time": "2025-01-24", "title": "Test-Time Code-Switching for Cross-lingual Aspect Sentiment Triplet Extraction", "paper_summary": "Aspect Sentiment Triplet Extraction (ASTE) is a thriving research area with\nimpressive outcomes being achieved on high-resource languages. However, the\napplication of cross-lingual transfer to the ASTE task has been relatively\nunexplored, and current code-switching methods still suffer from term boundary\ndetection issues and out-of-dictionary problems. In this study, we introduce a\nnovel Test-Time Code-SWitching (TT-CSW) framework, which bridges the gap\nbetween the bilingual training phase and the monolingual test-time prediction.\nDuring training, a generative model is developed based on bilingual\ncode-switched training data and can produce bilingual ASTE triplets for\nbilingual inputs. In the testing stage, we employ an alignment-based\ncode-switching technique for test-time augmentation. Extensive experiments on\ncross-lingual ASTE datasets validate the effectiveness of our proposed method.\nWe achieve an average improvement of 3.7% in terms of weighted-averaged F1 in\nfour datasets with different languages. Additionally, we set a benchmark using\nChatGPT and GPT-4, and demonstrate that even smaller generative models\nfine-tuned with our proposed TT-CSW framework surpass ChatGPT and GPT-4 by\n14.2% and 5.0% respectively.", "paper_summary_zh": "面向方面的情感三元組抽取 (ASTE) 是個蓬勃發展的研究領域，在高資源語言中取得令人印象深刻的成果。然而，跨語言轉移應用於 ASTE 任務的研究相對較少，目前的代碼轉換方法仍然存在術語邊界偵測問題和字典外問題。在本研究中，我們引入了一個新穎的測試時代碼轉換 (TT-CSW) 框架，它彌合了雙語訓練階段與單語測試時預測之間的差距。在訓練期間，基於雙語代碼轉換訓練數據開發了一個生成模型，並且可以為雙語輸入產生雙語 ASTE 三元組。在測試階段，我們採用基於對齊的代碼轉換技術進行測試時擴充。跨語言 ASTE 資料集上的大量實驗驗證了我們提出的方法的有效性。我們在四個不同語言的資料集中，在加權平均 F1 方面實現了平均 3.7% 的提升。此外，我們使用 ChatGPT 和 GPT-4 設定了一個基準，並證明即使是較小的生成模型使用我們提出的 TT-CSW 框架進行微調，也分別比 ChatGPT 和 GPT-4 高出 14.2% 和 5.0%。", "author": "Dongming Sheng et.al.", "authors": "Dongming Sheng, Kexin Han, Hao Li, Yan Zhang, Yucheng Huang, Jun Lang, Wenqiang Liu", "id": "2501.14144v1", "paper_url": "http://arxiv.org/abs/2501.14144v1", "repo": "null"}}