{"2406.01065": {"publish_time": "2024-06-03", "title": "Causal prompting model-based offline reinforcement learning", "paper_summary": "Model-based offline Reinforcement Learning (RL) allows agents to fully\nutilise pre-collected datasets without requiring additional or unethical\nexplorations. However, applying model-based offline RL to online systems\npresents challenges, primarily due to the highly suboptimal (noise-filled) and\ndiverse nature of datasets generated by online systems. To tackle these issues,\nwe introduce the Causal Prompting Reinforcement Learning (CPRL) framework,\ndesigned for highly suboptimal and resource-constrained online scenarios. The\ninitial phase of CPRL involves the introduction of the Hidden-Parameter Block\nCausal Prompting Dynamic (Hip-BCPD) to model environmental dynamics. This\napproach utilises invariant causal prompts and aligns hidden parameters to\ngeneralise to new and diverse online users. In the subsequent phase, a single\npolicy is trained to address multiple tasks through the amalgamation of\nreusable skills, circumventing the need for training from scratch. Experiments\nconducted across datasets with varying levels of noise, including\nsimulation-based and real-world offline datasets from the Dnurse APP,\ndemonstrate that our proposed method can make robust decisions in\nout-of-distribution and noisy environments, outperforming contemporary\nalgorithms. Additionally, we separately verify the contributions of Hip-BCPDs\nand the skill-reuse strategy to the robustness of performance. We further\nanalyse the visualised structure of Hip-BCPD and the interpretability of\nsub-skills. We released our source code and the first ever real-world medical\ndataset for precise medical decision-making tasks.", "paper_summary_zh": "<paragraph>基於模型的離線強化學習 (RL) 讓代理人能夠充分利用預先收集的資料集，而不需要額外的或不道德的探索。然而，將基於模型的離線 RL 應用於線上系統會帶來挑戰，主要是由於線上系統所產生的資料集具有高度次佳（充滿雜訊）和多樣化的特性。為了解決這些問題，我們引入了因果提示強化學習 (CPRL) 框架，專為高度次佳和資源受限的線上場景而設計。CPRL 的初始階段涉及引入隱藏參數區塊因果提示動態 (Hip-BCPD) 來建模環境動態。此方法利用不變的因果提示並調整隱藏參數以概括到新的和多樣化的線上使用者。在後續階段，訓練單一政策以透過合併可重複使用的技能來處理多項任務，規避從頭開始訓練的需要。在具有不同雜訊層級的資料集上進行的實驗，包括來自 Dnurse APP 的基於模擬和真實世界的離線資料集，證明我們提出的方法可以在超出分佈和雜訊環境中做出穩健的決策，優於當代演算法。此外，我們分別驗證了 Hip-BCPD 和技能重用策略對效能穩健性的貢獻。我們進一步分析了 Hip-BCPD 的可視化結構和子技能的可解釋性。我們發布了我們的原始碼和第一個用於精確醫療決策任務的真實世界醫療資料集。</paragraph>", "author": "Xuehui Yu et.al.", "authors": "Xuehui Yu, Yi Guan, Rujia Shen, Xin Li, Chen Tang, Jingchi Jiang", "id": "2406.01065v1", "paper_url": "http://arxiv.org/abs/2406.01065v1", "repo": "null"}}