{"2502.12054": {"publish_time": "2025-02-17", "title": "PhysReason: A Comprehensive Benchmark towards Physics-Based Reasoning", "paper_summary": "Large language models demonstrate remarkable capabilities across various\ndomains, especially mathematics and logic reasoning. However, current\nevaluations overlook physics-based reasoning - a complex task requiring physics\ntheorems and constraints. We present PhysReason, a 1,200-problem benchmark\ncomprising knowledge-based (25%) and reasoning-based (75%) problems, where the\nlatter are divided into three difficulty levels (easy, medium, hard). Notably,\nproblems require an average of 8.1 solution steps, with hard requiring 15.6,\nreflecting the complexity of physics-based reasoning. We propose the Physics\nSolution Auto Scoring Framework, incorporating efficient answer-level and\ncomprehensive step-level evaluations. Top-performing models like Deepseek-R1,\nGemini-2.0-Flash-Thinking, and o3-mini-high achieve less than 60% on\nanswer-level evaluation, with performance dropping from knowledge questions\n(75.11%) to hard problems (31.95%). Through step-level evaluation, we\nidentified four key bottlenecks: Physics Theorem Application, Physics Process\nUnderstanding, Calculation, and Physics Condition Analysis. These findings\nposition PhysReason as a novel and comprehensive benchmark for evaluating\nphysics-based reasoning capabilities in large language models. Our code and\ndata will be published at https:/dxzxy12138.github.io/PhysReason.", "paper_summary_zh": "大型語言模型展示了在各個領域的非凡能力，特別是數學和邏輯推理。然而，目前的評估忽略了基於物理的推理——這是一項複雜的任務，需要物理定理和約束。我們提出了 PhysReason，一個包含 1,200 題的基準，包含基於知識的（25%）和基於推理的（75%）問題，後者分為三個難度等級（容易、中等、困難）。值得注意的是，問題需要平均 8.1 個求解步驟，困難的需要 15.6 個，反映了基於物理的推理的複雜性。我們提出了物理解決方案自動評分框架，結合了高效的答案級別和全面的步驟級別評估。Deepseek-R1、Gemini-2.0-Flash-Thinking 和 o3-mini-high 等表現最佳的模型在答案級別評估中獲得低於 60% 的分數，性能從知識問題（75.11%）下降到困難問題（31.95%）。通過步驟級別評估，我們確定了四個關鍵瓶頸：物理定理應用、物理過程理解、計算和物理條件分析。這些發現將 PhysReason 定位為一個新穎且全面的基準，用於評估大型語言模型中基於物理的推理能力。我們的代碼和數據將發布在 https:/dxzxy12138.github.io/PhysReason。", "author": "Xinyu Zhang et.al.", "authors": "Xinyu Zhang, Yuxuan Dong, Yanrui Wu, Jiaxing Huang, Chengyou Jia, Basura Fernando, Mike Zheng Shou, Lingling Zhang, Jun Liu", "id": "2502.12054v1", "paper_url": "http://arxiv.org/abs/2502.12054v1", "repo": "null"}}