{"2412.11555": {"publish_time": "2024-12-16", "title": "TS-SatFire: A Multi-Task Satellite Image Time-Series Dataset for Wildfire Detection and Prediction", "paper_summary": "Wildfire monitoring and prediction are essential for understanding wildfire\nbehaviour. With extensive Earth observation data, these tasks can be integrated\nand enhanced through multi-task deep learning models. We present a\ncomprehensive multi-temporal remote sensing dataset for active fire detection,\ndaily wildfire monitoring, and next-day wildfire prediction. Covering wildfire\nevents in the contiguous U.S. from January 2017 to October 2021, the dataset\nincludes 3552 surface reflectance images and auxiliary data such as weather,\ntopography, land cover, and fuel information, totalling 71 GB. The lifecycle of\neach wildfire is documented, with labels for active fires (AF) and burned areas\n(BA), supported by manual quality assurance of AF and BA test labels. The\ndataset supports three tasks: a) active fire detection, b) daily burned area\nmapping, and c) wildfire progression prediction. Detection tasks use pixel-wise\nclassification of multi-spectral, multi-temporal images, while prediction tasks\nintegrate satellite and auxiliary data to model fire dynamics. This dataset and\nits benchmarks provide a foundation for advancing wildfire research using deep\nlearning.", "paper_summary_zh": "野火監控和預測對於了解野火行為至關重要。透過廣泛的地球觀測資料，這些任務可以透過多任務深度學習模型整合並增強。我們提供一個全面的多時相遙測資料集，用於主動火災偵測、每日野火監控和隔日野火預測。涵蓋 2017 年 1 月至 2021 年 10 月美國本土的野火事件，該資料集包括 3552 幅表面反射率影像和天氣、地形、土地覆蓋和燃料資訊等輔助資料，總計 71 GB。每個野火的生命週期都有記錄，並標記主動火災 (AF) 和燃燒區域 (BA)，並由 AF 和 BA 測試標籤的手動品質保證支援。該資料集支援三項任務：a) 主動火災偵測，b) 每日燃燒區域繪製，以及 c) 野火進程預測。偵測任務使用多光譜、多時相影像的逐像素分類，而預測任務整合衛星和輔助資料來建模火災動態。此資料集及其基準為使用深度學習推進野火研究奠定了基礎。", "author": "Yu Zhao et.al.", "authors": "Yu Zhao, Sebastian Gerard, Yifang Ban", "id": "2412.11555v1", "paper_url": "http://arxiv.org/abs/2412.11555v1", "repo": "null"}}