{"2406.11786": {"publish_time": "2024-06-17", "title": "A Brief Survey on Leveraging Large Scale Vision Models for Enhanced Robot Grasping", "paper_summary": "Robotic grasping presents a difficult motor task in real-world scenarios,\nconstituting a major hurdle to the deployment of capable robots across various\nindustries. Notably, the scarcity of data makes grasping particularly\nchallenging for learned models. Recent advancements in computer vision have\nwitnessed a growth of successful unsupervised training mechanisms predicated on\nmassive amounts of data sourced from the Internet, and now nearly all prominent\nmodels leverage pretrained backbone networks. Against this backdrop, we begin\nto investigate the potential benefits of large-scale visual pretraining in\nenhancing robot grasping performance. This preliminary literature review sheds\nlight on critical challenges and delineates prospective directions for future\nresearch in visual pretraining for robotic manipulation.", "paper_summary_zh": "機器人抓握在現實世界場景中呈現出困難的運動任務，\n構成機器人在各個產業中部署的重大障礙。值得注意的是，數據的稀缺性使得抓握對學習模型特別具有挑戰性。最近在電腦視覺方面的進展見證了成功無監督訓練機制的成長，這些機制建立在從網際網路上取得的大量數據，而現在幾乎所有著名的模型都利用預先訓練好的主幹網路。在此背景下，我們開始探討大規模視覺預訓練在提升機器人抓握效能方面的潛在好處。這篇初步文獻回顧闡明了關鍵挑戰，並勾勒出機器人操作視覺預訓練未來研究的預期方向。", "author": "Abhi Kamboj et.al.", "authors": "Abhi Kamboj, Katherine Driggs-Campbell", "id": "2406.11786v1", "paper_url": "http://arxiv.org/abs/2406.11786v1", "repo": "null"}}