{"2407.13343": {"publish_time": "2024-07-18", "title": "Learning-From-Mistakes Prompting for Indigenous Language Translation", "paper_summary": "Using large language models, this paper presents techniques to improve\nextremely low-resourced indigenous language translations. Our approaches are\ngrounded in the use of (1) the presence of a datastore consisting of a limited\nnumber of parallel translation examples, (2) the inherent capabilities of LLMs\nlike GPT-3.5, and (3) a word-level translation dictionary. We harness the\npotential of LLMs and in-context learning techniques in such a setting for\nusing LLMs as universal translators for extremely low-resourced languages. Our\nmethodology hinges on utilizing LLMs as language compilers for selected\nlanguage pairs, hypothesizing that they could internalize syntactic structures\nto facilitate accurate translation. We introduce three techniques: KNNPrompting\nwith Retrieved Prompting Context, Chain-of-Thought Prompting and\nLearningfrom-Mistakes Prompting, with the last method addressing past errors.\nThe evaluation results suggest that, even with limited corpora, LLMs can\neffectively translate extremely low-resource languages when paired with proper\nprompting.", "paper_summary_zh": "利用大型語言模型，本文提出了改進極度低資源原住民語言翻譯的技術。我們的做法建立在以下基礎上：(1) 存在一個包含有限數量平行翻譯範例的資料庫，(2) GPT-3.5 等 LLM 的固有能力，以及 (3) 一個字級翻譯詞典。我們利用 LLM 的潛力以及情境學習技術，在這樣的環境中將 LLM 用作極度低資源語言的通用翻譯器。我們的技術取決於利用 LLM 作為特定語言對的語言編譯器，假設它們可以內化句法結構以促進準確翻譯。我們介紹了三種技術：帶有檢索提示語境的 KNNPrompting、思考鏈條提示語境和錯誤學習提示語境，最後一種方法解決了過去的錯誤。評估結果表明，即使在語料庫有限的情況下，LLM 在與適當提示配對時也能有效翻譯極度低資源語言。", "author": "You-Cheng Liao et.al.", "authors": "You-Cheng Liao, Chen-Jui Yu, Chi-Yi Lin, He-Feng Yun, Yen-Hsiang Wang, Hsiao-Min Li, Yao-Chung Fan", "id": "2407.13343v1", "paper_url": "http://arxiv.org/abs/2407.13343v1", "repo": "null"}}