{"2501.05808": {"publish_time": "2025-01-10", "title": "Real-Time Integrated Dispatching and Idle Fleet Steering with Deep Reinforcement Learning for A Meal Delivery Platform", "paper_summary": "To achieve high service quality and profitability, meal delivery platforms\nlike Uber Eats and Grubhub must strategically operate their fleets to ensure\ntimely deliveries for current orders while mitigating the consequential impacts\nof suboptimal decisions that leads to courier understaffing in the future. This\nstudy set out to solve the real-time order dispatching and idle courier\nsteering problems for a meal delivery platform by proposing a reinforcement\nlearning (RL)-based strategic dual-control framework. To address the inherent\nsequential nature of these problems, we model both order dispatching and\ncourier steering as Markov Decision Processes. Trained via a deep reinforcement\nlearning (DRL) framework, we obtain strategic policies by leveraging the\nexplicitly predicted demands as part of the inputs. In our dual-control\nframework, the dispatching and steering policies are iteratively trained in an\nintegrated manner. These forward-looking policies can be executed in real-time\nand provide decisions while jointly considering the impacts on local and\nnetwork levels. To enhance dispatching fairness, we propose convolutional deep\nQ networks to construct fair courier embeddings. To simultaneously rebalance\nthe supply and demand within the service network, we propose to utilize\nmean-field approximated supply-demand knowledge to reallocate idle couriers at\nthe local level. Utilizing the policies generated by the RL-based strategic\ndual-control framework, we find the delivery efficiency and fairness of\nworkload distribution among couriers have been improved, and under-supplied\nconditions have been alleviated within the service network. Our study sheds\nlight on designing an RL-based framework to enable forward-looking real-time\noperations for meal delivery platforms and other on-demand services.", "paper_summary_zh": "<paragraph>為了達到高服務品質和獲利能力，外送平台如 Uber Eats 和 Grubhub 必須策略性地營運其車隊，以確保現有訂單能準時送達，同時降低次優決策造成的後續影響，避免未來快遞人員人手不足。本研究著手解決外送平台的即時訂單派送和閒置快遞員導航問題，並提出一個基於強化學習 (RL) 的策略性雙重控制架構。為了處理這些問題中固有的順序性質，我們將訂單派送和快遞員導航建模為馬可夫決策過程。透過深度強化學習 (DRL) 架構進行訓練，我們透過利用明確預測的需求作為輸入的一部分，獲得策略性政策。在我們的雙重控制架構中，派送和導航政策會以整合的方式進行反覆訓練。這些前瞻性的政策可以在即時執行，並在共同考量對區域和網路層級的影響時提供決策。為了提升派送公平性，我們提出卷積深度 Q 網路來建構公平的快遞員嵌入。為了同時在服務網路中重新平衡供需，我們提出利用平均場近似供需知識，在區域層級重新配置閒置快遞員。利用 RL 基於策略性雙重控制架構產生的政策，我們發現快遞員之間的工作負載分配的配送效率和公平性獲得改善，並且在服務網路中緩解了供應不足的狀況。我們的研究有助於設計一個基於 RL 的架構，以實現外送平台和其他隨選服務的前瞻性即時運作。</paragraph>", "author": "Jingyi Cheng et.al.", "authors": "Jingyi Cheng, Shadi Sharif Azadeh", "id": "2501.05808v1", "paper_url": "http://arxiv.org/abs/2501.05808v1", "repo": "null"}}