{"2410.18456": {"publish_time": "2024-10-24", "title": "Multi-Stage Airway Segmentation in Lung CT Based on Multi-scale Nested Residual UNet", "paper_summary": "Accurate and complete segmentation of airways in chest CT images is essential\nfor the quantitative assessment of lung diseases and the facilitation of\npulmonary interventional procedures. Although deep learning has led to\nsignificant advancements in medical image segmentation, maintaining airway\ncontinuity remains particularly challenging. This difficulty arises primarily\nfrom the small and dispersed nature of airway structures, as well as class\nimbalance in CT scans. To address these challenges, we designed a Multi-scale\nNested Residual U-Net (MNR-UNet), incorporating multi-scale inputs and Residual\nMulti-scale Modules (RMM) into a nested residual framework to enhance\ninformation flow, effectively capturing the intricate details of small airways\nand mitigating gradient vanishing. Building on this, we developed a three-stage\nsegmentation pipeline to optimize the training of the MNR-UNet. The first two\nstages prioritize high accuracy and sensitivity, while the third stage focuses\non repairing airway breakages to balance topological completeness and\ncorrectness. To further address class imbalance, we introduced a weighted\nBreakage-Aware Loss (wBAL) to heighten focus on challenging samples, penalizing\nbreakages and thereby extending the length of the airway tree. Additionally, we\nproposed a hierarchical evaluation framework to offer more clinically\nmeaningful analysis. Validation on both in-house and public datasets\ndemonstrates that our approach achieves superior performance in detecting more\naccurate airway voxels and identifying additional branches, significantly\nimproving airway topological completeness. The code will be released publicly\nfollowing the publication of the paper.", "paper_summary_zh": "胸部 CT 影像中準確而完整的氣道分割對於肺部疾病的定量評估和促進肺部介入性程序至關重要。儘管深度學習已在醫學影像分割領域取得顯著進展，但維持氣道連續性仍然特別具有挑戰性。這種困難主要來自於氣道結構的細小和分散性質，以及 CT 掃描中的類別不平衡。為了應對這些挑戰，我們設計了一個多尺度巢狀殘差 U-Net（MNR-UNet），將多尺度輸入和殘差多尺度模組（RMM）整合到一個巢狀殘差框架中，以增強資訊流動，有效捕捉小氣道的複雜細節並減輕梯度消失。在此基礎上，我們開發了一個三階段分割管道，以最佳化 MNR-UNet 的訓練。前兩個階段優先考慮高準確度和敏感度，而第三階段則專注於修復氣道斷裂，以平衡拓撲完整性和正確性。為了進一步解決類別不平衡的問題，我們引入了一個加權斷裂感知損失（wBAL）來提高對具有挑戰性樣本的關注，懲罰斷裂，從而延長氣道樹的長度。此外，我們提出了一個分層評估框架，以提供更具臨床意義的分析。在內部和公共數據集上的驗證表明，我們的做法在檢測更準確的氣道體素和識別額外分支方面取得了卓越的效能，顯著提高了氣道拓撲完整性。該程式碼將在論文發表後公開發布。", "author": "Bingyu Yang et.al.", "authors": "Bingyu Yang, Huai Liao, Xinyan Huang, Qingyao Tian, Jinlin Wu, Jingdi Hu, Hongbin Liu", "id": "2410.18456v1", "paper_url": "http://arxiv.org/abs/2410.18456v1", "repo": "null"}}