{"2408.10635": {"publish_time": "2024-08-20", "title": "Strategist: Learning Strategic Skills by LLMs via Bi-Level Tree Search", "paper_summary": "In this paper, we propose a new method Strategist that utilizes LLMs to\nacquire new skills for playing multi-agent games through a self-improvement\nprocess. Our method gathers quality feedback through self-play simulations with\nMonte Carlo tree search and LLM-based reflection, which can then be used to\nlearn high-level strategic skills such as how to evaluate states that guide the\nlow-level execution.We showcase how our method can be used in both action\nplanning and dialogue generation in the context of games, achieving good\nperformance on both tasks. Specifically, we demonstrate that our method can\nhelp train agents with better performance than both traditional reinforcement\nlearning-based approaches and other LLM-based skill learning approaches in\ngames including the Game of Pure Strategy (GOPS) and The Resistance: Avalon.", "paper_summary_zh": "在本文中，我們提出了一種新的方法 Strategist，它利用 LLM 通過自我提升過程來獲取玩多人遊戲的新技能。我們的這種方法通過蒙特卡羅樹搜尋和基於 LLM 的反思與自我對弈模擬收集高品質的回饋，然後可用於學習高層級策略技能，例如如何評估指導低層級執行的狀態。我們展示了我們的方法如何在遊戲的動作規劃和對話生成中使用，在兩個任務中都取得了良好的表現。具體來說，我們證明了我們的方法可以幫助訓練出比傳統的基於強化學習的方法和基於 LLM 的其他技能學習方法在包括純策略遊戲 (GOPS) 和抵抗：阿瓦隆在內的遊戲中表現更好的代理。", "author": "Jonathan Light et.al.", "authors": "Jonathan Light, Min Cai, Weiqin Chen, Guanzhi Wang, Xiusi Chen, Wei Cheng, Yisong Yue, Ziniu Hu", "id": "2408.10635v1", "paper_url": "http://arxiv.org/abs/2408.10635v1", "repo": "null"}}