{"2410.07672": {"publish_time": "2024-10-10", "title": "MACPO: Weak-to-Strong Alignment via Multi-Agent Contrastive Preference Optimization", "paper_summary": "As large language models (LLMs) are rapidly advancing and achieving\nnear-human capabilities, aligning them with human values is becoming more\nurgent. In scenarios where LLMs outperform humans, we face a weak-to-strong\nalignment problem where we need to effectively align strong student LLMs\nthrough weak supervision generated by weak teachers. Existing alignment methods\nmainly focus on strong-to-weak alignment and self-alignment settings, and it is\nimpractical to adapt them to the much harder weak-to-strong alignment setting.\nTo fill this gap, we propose a multi-agent contrastive preference optimization\n(MACPO) framework. MACPO facilitates weak teachers and strong students to learn\nfrom each other by iteratively reinforcing unfamiliar positive behaviors while\npenalizing familiar negative ones. To get this, we devise a mutual positive\nbehavior augmentation strategy to encourage weak teachers and strong students\nto learn from each other's positive behavior and further provide higher quality\npositive behavior for the next iteration. Additionally, we propose a hard\nnegative behavior construction strategy to induce weak teachers and strong\nstudents to generate familiar negative behavior by fine-tuning on negative\nbehavioral data. Experimental results on the HH-RLHF and PKU-SafeRLHF datasets,\nevaluated using both automatic metrics and human judgments, demonstrate that\nMACPO simultaneously improves the alignment performance of strong students and\nweak teachers. Moreover, as the number of weak teachers increases, MACPO\nachieves better weak-to-strong alignment performance through more iteration\noptimization rounds.", "paper_summary_zh": "隨著大型語言模型 (LLM) 快速進步並達到接近人類的能力，使其與人類價值觀保持一致變得更加迫切。在 LLM 優於人類的場景中，我們面臨一個弱對強的一致性問題，我們需要通過弱教師產生的弱監督來有效地調整強學生 LLM。現有的一致性方法主要關注強對弱的一致性和自對齊設定，而且將它們適應到更困難的弱對強的一致性設定是不切實際的。為了填補這一空白，我們提出了一個多主體對比偏好最佳化 (MACPO) 框架。MACPO 促進弱教師和強學生通過反覆加強不熟悉的正面行為並懲罰熟悉的負面行為來相互學習。為了實現這一目標，我們設計了一個相互的正面行為增強策略來鼓勵弱教師和強學生相互學習彼此的正面行為，並進一步為下一次迭代提供更高品質的正面行為。此外，我們提出了一個硬負面行為構建策略，以誘導弱教師和強學生通過對負面行為數據進行微調來產生熟悉的負面行為。在 HH-RLHF 和 PKU-SafeRLHF 數據集上的實驗結果，使用自動指標和人類判斷進行評估，表明 MACPO 同時提高了強學生和弱教師的一致性表現。此外，隨著弱教師的數量增加，MACPO 通過更多的迭代最佳化回合實現了更好的弱對強的一致性表現。", "author": "Yougang Lyu et.al.", "authors": "Yougang Lyu, Lingyong Yan, Zihan Wang, Dawei Yin, Pengjie Ren, Maarten de Rijke, Zhaochun Ren", "id": "2410.07672v1", "paper_url": "http://arxiv.org/abs/2410.07672v1", "repo": "null"}}