{"2406.02035": {"publish_time": "2024-06-04", "title": "A Unifying Framework for Action-Conditional Self-Predictive Reinforcement Learning", "paper_summary": "Learning a good representation is a crucial challenge for Reinforcement\nLearning (RL) agents. Self-predictive learning provides means to jointly learn\na latent representation and dynamics model by bootstrapping from future latent\nrepresentations (BYOL). Recent work has developed theoretical insights into\nthese algorithms by studying a continuous-time ODE model for self-predictive\nrepresentation learning under the simplifying assumption that the algorithm\ndepends on a fixed policy (BYOL-$\\Pi$); this assumption is at odds with\npractical instantiations of such algorithms, which explicitly condition their\npredictions on future actions. In this work, we take a step towards bridging\nthe gap between theory and practice by analyzing an action-conditional\nself-predictive objective (BYOL-AC) using the ODE framework, characterizing its\nconvergence properties and highlighting important distinctions between the\nlimiting solutions of the BYOL-$\\Pi$ and BYOL-AC dynamics. We show how the two\nrepresentations are related by a variance equation. This connection leads to a\nnovel variance-like action-conditional objective (BYOL-VAR) and its\ncorresponding ODE. We unify the study of all three objectives through two\ncomplementary lenses; a model-based perspective, where each objective is shown\nto be equivalent to a low-rank approximation of certain dynamics, and a\nmodel-free perspective, which establishes relationships between the objectives\nand their respective value, Q-value, and advantage function. Our empirical\ninvestigations, encompassing both linear function approximation and Deep RL\nenvironments, demonstrates that BYOL-AC is better overall in a variety of\ndifferent settings.", "paper_summary_zh": "學習良好的表徵對於強化學習 (RL) 代理來說是一項至關重要的挑戰。自我預測學習提供了透過從未來的潛在表徵 (BYOL) 引導來聯合學習潛在表徵和動態模型的方法。最近的研究透過研究自我預測表徵學習的連續時間 ODE 模型，在簡化的假設下，演算法取決於固定政策 (BYOL-$\\Pi$)，發展了對這些演算法的理論見解；此假設與此類演算法的實際實例相矛盾，這些實例明確地根據未來的動作對其預測進行條件化。在這項工作中，我們透過使用 ODE 架構分析動作條件自我預測目標 (BYOL-AC)，描述其收斂性質並強調 BYOL-$\\Pi$ 和 BYOL-AC 動力學的極限解之間的重要區別，朝著彌合理論與實務之間的差距邁進一步。我們展示了這兩個表徵如何透過變異方程式相關聯。此連結導致了新的變異類似動作條件目標 (BYOL-VAR) 及其對應的 ODE。我們透過兩個互補的觀點統一了對所有三個目標的研究；基於模型的觀點，其中每個目標都被證明等於特定動態的低秩近似，以及無模型的觀點，這建立了目標及其各自的價值、Q 值和優勢函數之間的關係。我們的實證調查涵蓋線性函數近似和深度 RL 環境，證明了 BYOL-AC 在各種不同的設定中整體表現更佳。", "author": "Khimya Khetarpal et.al.", "authors": "Khimya Khetarpal, Zhaohan Daniel Guo, Bernardo Avila Pires, Yunhao Tang, Clare Lyle, Mark Rowland, Nicolas Heess, Diana Borsa, Arthur Guez, Will Dabney", "id": "2406.02035v1", "paper_url": "http://arxiv.org/abs/2406.02035v1", "repo": "null"}}