{"2406.19320": {"publish_time": "2024-06-27", "title": "Efficient World Models with Context-Aware Tokenization", "paper_summary": "Scaling up deep Reinforcement Learning (RL) methods presents a significant\nchallenge. Following developments in generative modelling, model-based RL\npositions itself as a strong contender. Recent advances in sequence modelling\nhave led to effective transformer-based world models, albeit at the price of\nheavy computations due to the long sequences of tokens required to accurately\nsimulate environments. In this work, we propose $\\Delta$-IRIS, a new agent with\na world model architecture composed of a discrete autoencoder that encodes\nstochastic deltas between time steps and an autoregressive transformer that\npredicts future deltas by summarizing the current state of the world with\ncontinuous tokens. In the Crafter benchmark, $\\Delta$-IRIS sets a new state of\nthe art at multiple frame budgets, while being an order of magnitude faster to\ntrain than previous attention-based approaches. We release our code and models\nat https://github.com/vmicheli/delta-iris.", "paper_summary_zh": "擴展深度強化學習 (RL) 方法是一項重大的挑戰。在生成式建模的發展之後，基於模型的 RL 將自身定位為強有力的競爭者。序列建模的最新進展導致了有效的基於轉換器的世界模型，儘管由於準確模擬環境所需的長序列代幣，而付出了大量計算的代價。在這項工作中，我們提出了 $\\Delta$-IRIS，一種新的代理，其世界模型架構由離散自動編碼器組成，該編碼器編碼時間步長之間的隨機增量，以及一個自迴歸轉換器，該轉換器通過使用連續代幣總結世界的當前狀態來預測未來的增量。在 Crafter 基準測試中，$\\Delta$-IRIS 在多個幀預算中設定了新的技術水準，同時比之前的基於注意力的方法訓練速度快一個數量級。我們在 https://github.com/vmicheli/delta-iris 上發布我們的代碼和模型。", "author": "Vincent Micheli et.al.", "authors": "Vincent Micheli, Eloi Alonso, François Fleuret", "id": "2406.19320v1", "paper_url": "http://arxiv.org/abs/2406.19320v1", "repo": "https://github.com/vmicheli/delta-iris"}}