{"2407.08551": {"publish_time": "2024-07-11", "title": "Autoregressive Speech Synthesis without Vector Quantization", "paper_summary": "We present MELLE, a novel continuous-valued tokens based language modeling\napproach for text to speech synthesis (TTS). MELLE autoregressively generates\ncontinuous mel-spectrogram frames directly from text condition, bypassing the\nneed for vector quantization, which are originally designed for audio\ncompression and sacrifice fidelity compared to mel-spectrograms. Specifically,\n(i) instead of cross-entropy loss, we apply regression loss with a proposed\nspectrogram flux loss function to model the probability distribution of the\ncontinuous-valued tokens. (ii) we have incorporated variational inference into\nMELLE to facilitate sampling mechanisms, thereby enhancing the output diversity\nand model robustness. Experiments demonstrate that, compared to the two-stage\ncodec language models VALL-E and its variants, the single-stage MELLE mitigates\nrobustness issues by avoiding the inherent flaws of sampling discrete codes,\nachieves superior performance across multiple metrics, and, most importantly,\noffers a more streamlined paradigm. See https://aka.ms/melle for demos of our\nwork.", "paper_summary_zh": "我們提出了 MELLE，一種基於連續值符號的新穎語言模型化方法，用於文字轉語音合成 (TTS)。MELLE 自迴歸地直接從文字條件生成連續的 Mel 頻譜圖幀，繞過了原本設計用於音訊壓縮且與 Mel 頻譜圖相比犧牲了保真度的向量量化需求。具體來說，(i) 我們應用回歸損失，並提出了建議的頻譜圖通量損失函數來建模連續值符號的機率分佈，而不是交叉熵損失。(ii) 我們已將變異推論納入 MELLE，以促進抽樣機制，從而增強輸出多樣性和模型穩健性。實驗證明，與兩階段編解碼器語言模型 VALL-E 及其變體相比，單階段 MELLE 透過避免抽樣離散碼的固有缺陷來減輕穩健性問題，在多項指標上均達到卓越的效能，而且最重要的是，提供更簡化的範例。請參閱 https://aka.ms/melle，瞭解我們工作的示範。", "author": "Lingwei Meng et.al.", "authors": "Lingwei Meng, Long Zhou, Shujie Liu, Sanyuan Chen, Bing Han, Shujie Hu, Yanqing Liu, Jinyu Li, Sheng Zhao, Xixin Wu, Helen Meng, Furu Wei", "id": "2407.08551v1", "paper_url": "http://arxiv.org/abs/2407.08551v1", "repo": "null"}}