{"2406.11754": {"publish_time": "2024-06-17", "title": "DustNet: skillful neural network predictions of Saharan dust", "paper_summary": "Suspended in the atmosphere are millions of tonnes of mineral dust which\ninteracts with weather and climate. Accurate representation of mineral dust in\nweather models is vital, yet remains challenging. Large scale weather models\nuse high power supercomputers and take hours to complete the forecast. Such\ncomputational burden allows them to only include monthly climatological means\nof mineral dust as input states inhibiting their forecasting accuracy. Here, we\nintroduce DustNet a simple, accurate and super fast forecasting model for\n24-hours ahead predictions of aerosol optical depth AOD. DustNet trains in less\nthan 8 minutes and creates predictions in 2 seconds on a desktop computer.\nCreated by DustNet predictions outperform the state-of-the-art physics-based\nmodel on coarse 1 x 1 degree resolution at 95% of grid locations when compared\nto ground truth satellite data. Our results show DustNet has a potential for\nfast and accurate AOD forecasting which could transform our understanding of\ndust impacts on weather patterns.", "paper_summary_zh": "懸浮在大氣中的礦物塵有數百萬噸，會與天氣和氣候相互作用。在天氣模型中準確呈現礦物塵至關重要，但仍然具有挑戰性。大規模天氣模型使用高功率超級電腦，需要數小時才能完成預測。這種計算負擔只能讓它們將礦物塵的每月氣候平均值作為輸入狀態，從而抑制了預測準確度。在此，我們介紹 DustNet，這是一個簡單、準確且超級快速的預測模型，用於預測 24 小時後的氣溶膠光學厚度 AOD。DustNet 的訓練時間不到 8 分鐘，並可以在桌上型電腦上於 2 秒內建立預測。與地面真實衛星數據相比，DustNet 預測在與最先進的基於物理模型的粗略 1 x 1 度解析度中，於 95% 的網格位置表現優異。我們的結果顯示，DustNet 具有快速且準確的 AOD 預測潛力，這可以改變我們對灰塵對天氣模式影響的理解。", "author": "Trish E. Nowak et.al.", "authors": "Trish E. Nowak, Andy T. Augousti, Benno I. Simmons, Stefan Siegert", "id": "2406.11754v1", "paper_url": "http://arxiv.org/abs/2406.11754v1", "repo": "null"}}