{"2406.01624": {"publish_time": "2024-06-01", "title": "Unveiling Hidden Factors: Explainable AI for Feature Boosting in Speech Emotion Recognition", "paper_summary": "Speech emotion recognition (SER) has gained significant attention due to its\nseveral application fields, such as mental health, education, and\nhuman-computer interaction. However, the accuracy of SER systems is hindered by\nhigh-dimensional feature sets that may contain irrelevant and redundant\ninformation. To overcome this challenge, this study proposes an iterative\nfeature boosting approach for SER that emphasizes feature relevance and\nexplainability to enhance machine learning model performance. Our approach\ninvolves meticulous feature selection and analysis to build efficient SER\nsystems. In addressing our main problem through model explainability, we employ\na feature evaluation loop with Shapley values to iteratively refine feature\nsets. This process strikes a balance between model performance and\ntransparency, which enables a comprehensive understanding of the model's\npredictions. The proposed approach offers several advantages, including the\nidentification and removal of irrelevant and redundant features, leading to a\nmore effective model. Additionally, it promotes explainability, facilitating\ncomprehension of the model's predictions and the identification of crucial\nfeatures for emotion determination. The effectiveness of the proposed method is\nvalidated on the SER benchmarks of the Toronto emotional speech set (TESS),\nBerlin Database of Emotional Speech (EMO-DB), Ryerson Audio-Visual Database of\nEmotional Speech and Song (RAVDESS), and Surrey Audio-Visual Expressed Emotion\n(SAVEE) datasets, outperforming state-of-the-art methods. These results\nhighlight the potential of the proposed technique in developing accurate and\nexplainable SER systems. To the best of our knowledge, this is the first work\nto incorporate model explainability into an SER framework.", "paper_summary_zh": "語音情緒辨識 (SER) 因其在心理健康、教育和人機互動等多個應用領域而備受關注。然而，SER 系統的準確性受到高維特徵集的阻礙，其中可能包含不相關和冗餘的資訊。為了克服這個挑戰，本研究提出了一種用於 SER 的迭代特徵提升方法，它強調特徵相關性和可解釋性，以增強機器學習模型的效能。我們的做法包括細緻的特徵選擇和分析，以建立高效的 SER 系統。在透過模型可解釋性解決我們的主要問題時，我們採用具有 Shapley 值的特徵評估迴圈，以反覆精進特徵集。這個過程在模型效能和透明度之間取得平衡，這使得我們能全面了解模型的預測。所提出的方法提供了多項優點，包括識別和移除不相關和冗餘的特徵，從而建立更有效的模型。此外，它促進了可解釋性，有助於理解模型的預測，並識別情緒決定的關鍵特徵。所提出方法的有效性在多倫多情緒語音集 (TESS)、柏林情緒語音資料庫 (EMO-DB)、萊爾森情緒語音和歌曲視聽資料庫 (RAVDESS) 和薩里視聽表達情緒 (SAVEE) 資料集的 SER 基準上得到驗證，其表現優於現有技術。這些結果突顯了所提出技術在開發準確且可解釋的 SER 系統方面的潛力。據我們所知，這是第一個將模型可解釋性納入 SER 框架中的研究。", "author": "Alaa Nfissi et.al.", "authors": "Alaa Nfissi, Wassim Bouachir, Nizar Bouguila, Brian Mishara", "id": "2406.01624v1", "paper_url": "http://arxiv.org/abs/2406.01624v1", "repo": "null"}}