{"2412.20227": {"publish_time": "2024-12-28", "title": "LLM Reasoning Engine: Specialized Training for Enhanced Mathematical Reasoning", "paper_summary": "Large Language Models (LLMs) have shown remarkable performance in various\nnatural language processing tasks but face challenges in mathematical\nreasoning, where complex problem-solving requires both linguistic understanding\nand mathematical reasoning skills. Existing approaches to address this\nchallenge often rely on ensemble methods and suffer from the problem of data\nscarcity in target domains. In this work, we present a novel method to enhance\nLLMs' capabilities in mathematical reasoning tasks. Motivated by the need to\nbridge this gap, our approach incorporates a question paraphrase strategy,\nwhich aims at diversifying the linguistic forms of mathematical questions to\nimprove generalization. Additionally, specialized training objectives are\nemployed to guide the model's learning process, focusing on enhancing its\nunderstanding of mathematical concepts and reasoning processes. We conduct\nexperiments on four datasets using different LLMs, and demonstrate the\neffectiveness of our approach in improving LLMs' performance on mathematical\nreasoning tasks. Our findings underscore the significance of our methodology in\nthe advancement of large language models and its potential implications for\nreal-world applications that require mathematical reasoning abilities.", "paper_summary_zh": "大型語言模型（LLM）在各種自然語言處理任務中展現出卓越的效能，但在數學推理方面卻面臨挑戰，因為複雜的問題解決需要語言理解和數學推理技能。現有的方法經常依賴於整體方法，並且在目標領域中會遇到資料稀疏的問題。在本文中，我們提出了一種新方法來增強 LLM 在數學推理任務中的能力。我們的做法基於彌合此差距的需求，包含了一個問題改寫策略，其目的是使數學問題的語言形式多樣化，以改善概括性。此外，我們採用了專門的訓練目標來引導模型的學習過程，重點在於增強其對數學概念和推理過程的理解。我們使用不同的 LLM 對四個資料集進行實驗，並證明了我們的方法在改善 LLM 在數學推理任務中的效能方面是有效的。我們的研究結果強調了我們的方法對大型語言模型進步的重要性，以及其對需要數學推理能力的實際應用之潛在影響。", "author": "Shuguang Chen et.al.", "authors": "Shuguang Chen, Guang Lin", "id": "2412.20227v1", "paper_url": "http://arxiv.org/abs/2412.20227v1", "repo": "null"}}