{"2410.08947": {"publish_time": "2024-10-11", "title": "Meta-Transfer Learning Empowered Temporal Graph Networks for Cross-City Real Estate Appraisal", "paper_summary": "Real estate appraisal is important for a variety of endeavors such as real\nestate deals, investment analysis, and real property taxation. Recently, deep\nlearning has shown great promise for real estate appraisal by harnessing\nsubstantial online transaction data from web platforms. Nonetheless, deep\nlearning is data-hungry, and thus it may not be trivially applicable to\nenormous small cities with limited data. To this end, we propose Meta-Transfer\nLearning Empowered Temporal Graph Networks (MetaTransfer) to transfer valuable\nknowledge from multiple data-rich metropolises to the data-scarce city to\nimprove valuation performance. Specifically, by modeling the ever-growing real\nestate transactions with associated residential communities as a temporal event\nheterogeneous graph, we first design an Event-Triggered Temporal Graph Network\nto model the irregular spatiotemporal correlations between evolving real estate\ntransactions. Besides, we formulate the city-wide real estate appraisal as a\nmulti-task dynamic graph link label prediction problem, where the valuation of\neach community in a city is regarded as an individual task. A\nHypernetwork-Based Multi-Task Learning module is proposed to simultaneously\nfacilitate intra-city knowledge sharing between multiple communities and\ntask-specific parameters generation to accommodate the community-wise real\nestate price distribution. Furthermore, we propose a Tri-Level Optimization\nBased Meta- Learning framework to adaptively re-weight training transaction\ninstances from multiple source cities to mitigate negative transfer, and thus\nimprove the cross-city knowledge transfer effectiveness. Finally, extensive\nexperiments based on five real-world datasets demonstrate the significant\nsuperiority of MetaTransfer compared with eleven baseline algorithms.", "paper_summary_zh": "<paragraph>房地產估價對於各種事務很重要，例如房地產交易、投資分析和不動產稅務。最近，深度學習通過利用網路平台上的大量線上交易資料，在房地產估價方面展現了極大的前景。儘管如此，深度學習非常仰賴資料，因此可能無法輕易應用於資料有限的廣大中小城市。為此，我們提出了元轉移學習強化時序圖形網路（MetaTransfer），以將來自多個資料豐富的大都市的寶貴知識轉移到資料稀少的城市，以提升估值表現。具體來說，我們首先將持續增加的房地產交易與相關住宅社區建模為時序事件異質圖形，設計一個事件觸發時序圖形網路，以建模不斷演變的房地產交易之間不規則的時空關聯。此外，我們將全市的房地產估價制定為多任務動態圖形連結標籤預測問題，其中將城市中每個社區的估值視為一個單獨的任務。提出了一個基於超網路的多任務學習模組，以同時促進多個社區之間的城市內知識共享，並產生特定於任務的參數，以適應社區層面的房地產價格分佈。此外，我們提出了一個基於三層最佳化的元學習架構，以自適應地重新加權來自多個來源城市的訓練交易實例，以減輕負面轉移，並因此提升跨城市知識轉移的有效性。最後，根據五個真實世界資料集進行的廣泛實驗證明了 MetaTransfer 與十一種基線演算法相比具有顯著的優越性。</paragraph>", "author": "Weijia Zhang et.al.", "authors": "Weijia Zhang, Jindong Han, Hao Liu, Wei Fan, Hao Wang, Hui Xiong", "id": "2410.08947v1", "paper_url": "http://arxiv.org/abs/2410.08947v1", "repo": "null"}}