{"2501.11900": {"publish_time": "2025-01-21", "title": "Panoramic Interests: Stylistic-Content Aware Personalized Headline Generation", "paper_summary": "Personalized news headline generation aims to provide users with\nattention-grabbing headlines that are tailored to their preferences. Prevailing\nmethods focus on user-oriented content preferences, but most of them overlook\nthe fact that diverse stylistic preferences are integral to users' panoramic\ninterests, leading to suboptimal personalization. In view of this, we propose a\nnovel Stylistic-Content Aware Personalized Headline Generation (SCAPE)\nframework. SCAPE extracts both content and stylistic features from headlines\nwith the aid of large language model (LLM) collaboration. It further adaptively\nintegrates users' long- and short-term interests through a contrastive\nlearning-based hierarchical fusion network. By incorporating the panoramic\ninterests into the headline generator, SCAPE reflects users' stylistic-content\npreferences during the generation process. Extensive experiments on the\nreal-world dataset PENS demonstrate the superiority of SCAPE over baselines.", "paper_summary_zh": "個人化新聞標題生成旨在為使用者提供吸引眼球、且符合其偏好的標題。現行的做法著重於以使用者為導向的內容偏好，但大多數的做法忽略了多樣化的風格偏好與使用者全景式興趣密不可分的這個事實，導致次佳的個人化結果。有鑑於此，我們提出一個新穎的風格內容感知個人化標題生成 (SCAPE) 架構。SCAPE 在大型語言模型 (LLM) 協作的協助下，從標題中提取內容和風格特徵。它進一步透過對比學習基礎的分層融合網路，自適應地整合使用者的長期和短期興趣。SCAPE 透過將全景式興趣納入標題產生器，在生成過程中反映使用者的風格內容偏好。在真實世界資料集 PENS 上的廣泛實驗證明了 SCAPE 優於基線。", "author": "Junhong Lian et.al.", "authors": "Junhong Lian, Xiang Ao, Xinyu Liu, Yang Liu, Qing He", "id": "2501.11900v1", "paper_url": "http://arxiv.org/abs/2501.11900v1", "repo": "https://github.com/ictmldm/SCAPE"}}