{"2412.18287": {"publish_time": "2024-12-24", "title": "Semi-supervised Credit Card Fraud Detection via Attribute-Driven Graph Representation", "paper_summary": "Credit card fraud incurs a considerable cost for both cardholders and issuing\nbanks. Contemporary methods apply machine learning-based classifiers to detect\nfraudulent behavior from labeled transaction records. But labeled data are\nusually a small proportion of billions of real transactions due to expensive\nlabeling costs, which implies that they do not well exploit many natural\nfeatures from unlabeled data. Therefore, we propose a semi-supervised graph\nneural network for fraud detection. Specifically, we leverage transaction\nrecords to construct a temporal transaction graph, which is composed of\ntemporal transactions (nodes) and interactions (edges) among them. Then we pass\nmessages among the nodes through a Gated Temporal Attention Network (GTAN) to\nlearn the transaction representation. We further model the fraud patterns\nthrough risk propagation among transactions. The extensive experiments are\nconducted on a real-world transaction dataset and two publicly available fraud\ndetection datasets. The result shows that our proposed method, namely GTAN,\noutperforms other state-of-the-art baselines on three fraud detection datasets.\nSemi-supervised experiments demonstrate the excellent fraud detection\nperformance of our model with only a tiny proportion of labeled data.", "paper_summary_zh": "信用卡诈骗对持卡人和发卡银行来说都是一笔不小的开支。当代方法应用基于机器学习的分类器来从标记的交易记录中检测欺诈行为。但由于标记成本高昂，标记数据通常只占数十亿笔真实交易的一小部分，这意味着它们并没有很好地利用未标记数据中的许多自然特征。因此，我们提出了一种用于欺诈检测的半监督图神经网络。具体来说，我们利用交易记录构建了一个时间交易图，该图由时间交易（节点）和它们之间的交互（边）组成。然后，我们通过门控时间注意力网络 (GTAN) 在节点之间传递消息，以学习交易表示。我们进一步通过交易之间的风险传播对欺诈模式进行建模。广泛的实验是在一个真实世界的交易数据集和两个公开可用的欺诈检测数据集上进行的。结果表明，我们提出的方法，即 GTAN，在三个欺诈检测数据集上优于其他最先进的基线。半监督实验表明，我们的模型仅使用一小部分标记数据就表现出出色的欺诈检测性能。", "author": "Sheng Xiang et.al.", "authors": "Sheng Xiang, Mingzhi Zhu, Dawei Cheng, Enxia Li, Ruihui Zhao, Yi Ouyang, Ling Chen, Yefeng Zheng", "id": "2412.18287v1", "paper_url": "http://arxiv.org/abs/2412.18287v1", "repo": "https://github.com/ai4risk/antifraud"}}