{"2405.10883": {"publish_time": "2024-05-17", "title": "Application of Artificial Intelligence in Schizophrenia Rehabilitation Management: Systematic Literature Review", "paper_summary": "This review aims to systematically assess the current status and prospects of\nartificial intelligence (AI) in the rehabilitation management of patients with\nschizophrenia and their impact on the rehabilitation process. We selected 70\nstudies from 2012 to the present, focusing on application, technology\ncategories, products, and data types of machine learning, deep learning,\nreinforcement learning, and other technologies in mental health interventions\nand management. The results indicate that AI can be widely used in symptom\nmonitoring, relapse risk prediction, and rehabilitation treatment by analyzing\necological momentary assessment, behavioral, and speech data. This review\nfurther explores the potential challenges and future directions of emerging\nproducts, technologies, and analytical methods based on AI, such as social\nmedia analysis, serious games, and large language models in rehabilitation. In\nsummary, this study systematically reviews the application status of AI in\nschizophrenia rehabilitation management and provides valuable insights and\nrecommendations for future research paths.", "paper_summary_zh": "本綜述旨在系統性評估人工智慧 (AI) 在精神分裂症患者復健管理中的現況與前景，以及其對復健歷程的影響。我們從 2012 年至今選取了 70 篇研究，重點關注機器學習、深度學習、強化學習和其他技術在心理健康介入和管理中的應用、技術類別、產品和資料類型。結果顯示，AI 可廣泛應用於症狀監控、復發風險預測和復健治療，方法是分析生態瞬時評估、行為和言語資料。本綜述進一步探討了基於 AI 的新興產品、技術和分析方法的潛在挑戰和未來方向，例如復健中的社群媒體分析、嚴肅遊戲和大語言模型。總之，本研究系統性地回顧了 AI 在精神分裂症復健管理中的應用現況，並為未來的研究路徑提供了有價值的見解和建議。", "author": "Hongyi Yang et.al.", "authors": "Hongyi Yang, Fangyuan Chang, Dian Zhu, Muroi Fumie, Zhao Liu", "id": "2405.10883v1", "paper_url": "http://arxiv.org/abs/2405.10883v1", "repo": "null"}}