{"2410.07627": {"publish_time": "2024-10-10", "title": "Automatic Curriculum Expert Iteration for Reliable LLM Reasoning", "paper_summary": "Hallucinations (i.e., generating plausible but inaccurate content) and\nlaziness (i.e. excessive refusals or defaulting to \"I don't know\") persist as\nmajor challenges in LLM reasoning. Current efforts to reduce hallucinations\nprimarily focus on factual errors in knowledge-grounded tasks, often neglecting\nhallucinations related to faulty reasoning. Meanwhile, some approaches render\nLLMs overly conservative, limiting their problem-solving capabilities. To\nmitigate hallucination and laziness in reasoning tasks, we propose Automatic\nCurriculum Expert Iteration (Auto-CEI) to enhance LLM reasoning and align\nresponses to the model's capabilities--assertively answering within its limits\nand declining when tasks exceed them. In our method, Expert Iteration explores\nthe reasoning trajectories near the LLM policy, guiding incorrect paths back on\ntrack to reduce compounding errors and improve robustness; it also promotes\nappropriate \"I don't know\" responses after sufficient reasoning attempts. The\ncurriculum automatically adjusts rewards, incentivizing extended reasoning\nbefore acknowledging incapability, thereby pushing the limits of LLM reasoning\nand aligning its behaviour with these limits. We compare Auto-CEI with various\nSOTA baselines across logical reasoning, mathematics, and planning tasks, where\nAuto-CEI achieves superior alignment by effectively balancing assertiveness and\nconservativeness.", "paper_summary_zh": "幻覺（例如產生似是而非但有誤的內容）和懶惰（例如過度拒絕或預設為「我不知道」）仍然是 LLM 推理中的主要挑戰。目前減少幻覺的努力主要集中於基於知識的任務中的事實錯誤，而經常忽略與錯誤推理相關的幻覺。同時，某些方法會讓 LLM 過於保守，限制其問題解決能力。為了減輕推理任務中的幻覺和懶惰，我們提出自動課程專家迭代 (Auto-CEI) 來增強 LLM 推理，並讓回應與模型的能力保持一致——在其限制範圍內自信地回答，並在任務超出其能力範圍時拒絕。在我們的模型中，專家迭代探索 LLM 策略附近的推理軌跡，引導不正確的路線回到正軌，以減少累積錯誤並提高穩健性；它還適當地在經過足夠的推理嘗試後促進「我不知道」的回應。課程會自動調整獎勵，在承認無能為力之前激勵延伸推理，從而擴展 LLM 推理的限制，並讓其行為與這些限制保持一致。我們在邏輯推理、數學和規劃任務中將 Auto-CEI 與各種 SOTA 基準進行比較，結果發現 Auto-CEI 透過有效平衡自信和保守態度，達到了卓越的一致性。", "author": "Zirui Zhao et.al.", "authors": "Zirui Zhao, Hanze Dong, Amrita Saha, Caiming Xiong, Doyen Sahoo", "id": "2410.07627v1", "paper_url": "http://arxiv.org/abs/2410.07627v1", "repo": "null"}}