{"2408.09715": {"publish_time": "2024-08-19", "title": "HYDEN: Hyperbolic Density Representations for Medical Images and Reports", "paper_summary": "In light of the inherent entailment relations between images and text,\nhyperbolic point vector embeddings, leveraging the hierarchical modeling\nadvantages of hyperbolic space, have been utilized for visual semantic\nrepresentation learning. However, point vector embedding approaches fail to\naddress the issue of semantic uncertainty, where an image may have multiple\ninterpretations, and text may refer to different images, a phenomenon\nparticularly prevalent in the medical domain. Therefor, we propose\n\\textbf{HYDEN}, a novel hyperbolic density embedding based image-text\nrepresentation learning approach tailored for specific medical domain data.\nThis method integrates text-aware local features alongside global features from\nimages, mapping image-text features to density features in hyperbolic space via\nusing hyperbolic pseudo-Gaussian distributions. An encapsulation loss function\nis employed to model the partial order relations between image-text density\ndistributions. Experimental results demonstrate the interpretability of our\napproach and its superior performance compared to the baseline methods across\nvarious zero-shot tasks and different datasets.", "paper_summary_zh": "鑑於影像與文字之間內在的蘊涵關係，雙曲點向量嵌入運用雙曲空間的分層建模優勢，已被用於視覺語意表徵學習。然而，點向量嵌入方法無法解決語意不確定性的問題，其中影像可能有多重詮釋，而文字可能指涉不同的影像，這種現象在醫學領域特別普遍。因此，我們提出 \\textbf{HYDEN}，一種新的雙曲密度嵌入，基於影像文字表徵學習方法，專門針對特定醫學領域資料量身打造。此方法整合了文字感知局部特徵與影像的全局特徵，透過使用雙曲偽高斯分佈，將影像文字特徵對應到雙曲空間中的密度特徵。採用封裝損失函數來建模影像文字密度分佈之間的部分排序關係。實驗結果證明了我們方法的可詮釋性，以及在各種零次學習任務和不同資料集上，它優於基線方法的效能。", "author": "Zhi Qiao et.al.", "authors": "Zhi Qiao, Linbin Han, Xiantong Zhen, Jia-Hong Gao, Zhen Qian", "id": "2408.09715v1", "paper_url": "http://arxiv.org/abs/2408.09715v1", "repo": "null"}}