{"2502.14644": {"publish_time": "2025-02-20", "title": "LIFT: Improving Long Context Understanding of Large Language Models through Long Input Fine-Tuning", "paper_summary": "Long context understanding remains challenging for large language models due\nto their limited context windows. This paper presents Long Input Fine-Tuning\n(LIFT), a novel framework for long-context modeling that can improve the\nlong-context performance of arbitrary (short-context) LLMs by dynamically\nadapting model parameters based on the long input. Importantly, LIFT, rather\nthan endlessly extending the context window size to accommodate increasingly\nlonger inputs in context, chooses to store and absorb the long input in\nparameter. By fine-tuning the long input into model parameters, LIFT allows\nshort-context LLMs to answer questions even when the required information is\nnot provided in the context during inference. Furthermore, to enhance LIFT\nperformance while maintaining the original in-context learning (ICL)\ncapabilities, we introduce Gated Memory, a specialized attention adapter that\nautomatically balances long input memorization and ICL. We provide a\ncomprehensive analysis of the strengths and limitations of LIFT on long context\nunderstanding, offering valuable directions for future research.", "paper_summary_zh": "由於大型語言模型的上下文視窗有限，因此對於它們而言，長語境理解仍然具有挑戰性。本文提出了長輸入微調 (LIFT)，這是一個用於長語境建模的新穎架構，它可以通過根據長輸入動態調整模型參數來改善任意（短語境）LLM 的長語境效能。重要的是，LIFT 沒有無限擴充上下文視窗大小以容納語境中越來越長的輸入，而是選擇將長輸入儲存在參數中並吸收它。通過將長輸入微調到模型參數中，LIFT 允許短語境 LLM 回答問題，即使在推理期間語境中沒有提供所需資訊也是如此。此外，為了在保持原始語境中學習 (ICL) 能力的同時增強 LIFT 效能，我們引入了閘控記憶體，這是一個自動平衡長輸入記憶和 ICL 的特殊注意力適配器。我們對 LIFT 在長語境理解方面的優缺點進行了全面的分析，為未來的研究提供了有價值的方向。", "author": "Yansheng Mao et.al.", "authors": "Yansheng Mao, Yufei Xu, Jiaqi Li, Fanxu Meng, Haotong Yang, Zilong Zheng, Xiyuan Wang, Muhan Zhang", "id": "2502.14644v1", "paper_url": "http://arxiv.org/abs/2502.14644v1", "repo": "null"}}