{"2501.14622": {"publish_time": "2025-01-24", "title": "ACT-JEPA: Joint-Embedding Predictive Architecture Improves Policy Representation Learning", "paper_summary": "Learning efficient representations for decision-making policies is a\nchallenge in imitation learning (IL). Current IL methods require expert\ndemonstrations, which are expensive to collect. Consequently, they often have\nunderdeveloped world models. Self-supervised learning (SSL) offers an\nalternative by allowing models to learn from diverse, unlabeled data, including\nfailures. However, SSL methods often operate in raw input space, making them\ninefficient. In this work, we propose ACT-JEPA, a novel architecture that\nintegrates IL and SSL to enhance policy representations. We train a policy to\npredict (1) action sequences and (2) abstract observation sequences. The first\nobjective uses action chunking to improve action prediction and reduce\ncompounding errors. The second objective extends this idea of chunking by\npredicting abstract observation sequences. We utilize Joint-Embedding\nPredictive Architecture to predict in abstract representation space, allowing\nthe model to filter out irrelevant details, improve efficiency, and develop a\nrobust world model. Our experiments show that ACT-JEPA improves the quality of\nrepresentations by learning temporal environment dynamics. Additionally, the\nmodel's ability to predict abstract observation sequences results in\nrepresentations that effectively generalize to action sequence prediction.\nACT-JEPA performs on par with established baselines across a range of\ndecision-making tasks.", "paper_summary_zh": "在模仿學習（IL）中，學習決策制定策略的有效表示是一項挑戰。當前的 IL 方法需要專家示範，而收集這些示範的成本很高。因此，它們通常有欠發展的世界模型。自我監督學習（SSL）提供了一種替代方案，允許模型從多樣化的、未標記的數據（包括失敗）中學習。然而，SSL 方法通常在原始輸入空間中運作，這使得它們效率低下。在這項工作中，我們提出了 ACT-JEPA，這是一種將 IL 和 SSL 集成在一起以增強策略表示的新架構。我們訓練一個策略來預測（1）動作序列和（2）抽象觀察序列。第一個目標使用動作分塊來改進動作預測並減少累積誤差。第二個目標通過預測抽象觀察序列來擴展這個分塊的想法。我們利用聯合嵌入預測架構在抽象表示空間中進行預測，允許模型過濾掉無關的細節、提高效率並開發一個強健的世界模型。我們的實驗表明，ACT-JEPA 通過學習時間環境動態來提高表示的質量。此外，模型預測抽象觀察序列的能力產生了有效概括到動作序列預測的表示。ACT-JEPA 在一系列決策制定任務中與已建立的基準表現相當。", "author": "Aleksandar Vujinovic et.al.", "authors": "Aleksandar Vujinovic, Aleksandar Kovacevic", "id": "2501.14622v1", "paper_url": "http://arxiv.org/abs/2501.14622v1", "repo": "null"}}