{"2406.19953": {"publish_time": "2024-06-28", "title": "Uncovering the hidden core-periphery structure in hyperbolic networks", "paper_summary": "The hyperbolic network models exhibit very fundamental and essential\nfeatures, like small-worldness, scale-freeness, high-clustering coefficient,\nand community structure. In this paper, we comprehensively explore the presence\nof an important feature, the core-periphery structure, in the hyperbolic\nnetwork models, which is often exhibited by real-world networks. We focused on\nwell-known hyperbolic models such as popularity-similarity optimization model\n(PSO) and S1/H2 models and studied core-periphery structures using a\nwell-established method that is based on standard random walk Markov chain\nmodel. The observed core-periphery centralization values indicate that the\ncore-periphery structure can be very pronounced under certain conditions. We\nalso validate our findings by statistically testing for the significance of the\nobserved core-periphery structure in the network geometry. This study extends\nnetwork science and reveals core-periphery insights applicable to various\ndomains, enhancing network performance and resiliency in transportation and\ninformation systems.", "paper_summary_zh": "雙曲網路模型展現非常基本且重要的特徵，例如小世界現象、無尺度性、高群聚係數和社群結構。在本文中，我們全面探討雙曲網路模型中一個重要特徵，即核心邊緣結構的存在，這通常由真實世界的網路展現。我們專注於眾所周知的雙曲模型，例如人氣相似性最佳化模型 (PSO) 和 S1/H2 模型，並使用基於標準隨機遊走馬可夫鏈模型的完善方法研究核心邊緣結構。觀察到的核心邊緣中心化值表示，在特定條件下，核心邊緣結構可能會非常明顯。我們也透過統計測試驗證我們的發現，以了解網路幾何中觀察到的核心邊緣結構的重要性。這項研究擴展了網路科學，並揭露了適用於各種領域的核心邊緣見解，進而提升運輸和資訊系統中的網路效能和復原力。", "author": "Imran Ansari et.al.", "authors": "Imran Ansari, Pawanesh Yadav, Niteesh Sahni", "id": "2406.19953v1", "paper_url": "http://arxiv.org/abs/2406.19953v1", "repo": "https://github.com/imran10896/cp_structure_in_hyperbolic_networks"}}