{"2412.09086": {"publish_time": "2024-12-12", "title": "Understanding Opportunities and Risks of Synthetic Relationships: Leveraging the Power of Longitudinal Research with Customised AI Tools", "paper_summary": "This position paper discusses the benefits of longitudinal behavioural\nresearch with customised AI tools for exploring the opportunities and risks of\nsynthetic relationships. Synthetic relationships are defined as \"continuing\nassociations between humans and AI tools that interact with one another wherein\nthe AI tool(s) influence(s) humans' thoughts, feelings, and/or actions.\"\n(Starke et al., 2024). These relationships can potentially improve health,\neducation, and the workplace, but they also bring the risk of subtle\nmanipulation and privacy and autonomy concerns. To harness the opportunities of\nsynthetic relationships and mitigate their risks, we outline a methodological\napproach that complements existing findings. We propose longitudinal research\ndesigns with self-assembled AI agents that enable the integration of detailed\nbehavioural and self-reported data.", "paper_summary_zh": "本立場文件探討縱向行為研究與客製化 AI 工具的優點，用於探討合成關係的機會與風險。合成關係定義為「人類與 AI 工具之間持續的關聯，彼此互動，其中 AI 工具會影響人類的想法、感受和/或行為。」（Starke 等人，2024 年）。這些關係有可能改善健康、教育和職場，但它們也帶來微妙的操縱以及隱私和自主權的隱憂。為了利用合成關係的機會並降低其風險，我們概述了一種方法論方法，補充現有的發現。我們提出使用自組裝 AI 代理的縱向研究設計，使我們能夠整合詳細的行為和自我報告資料。", "author": "Alfio Ventura et.al.", "authors": "Alfio Ventura, Nils Köbis", "id": "2412.09086v1", "paper_url": "http://arxiv.org/abs/2412.09086v1", "repo": "null"}}