{"2410.12159": {"publish_time": "2024-10-16", "title": "NSSI-Net: Multi-Concept Generative Adversarial Network for Non-Suicidal Self-Injury Detection Using High-Dimensional EEG Signals in a Semi-Supervised Learning Framework", "paper_summary": "Non-suicidal self-injury (NSSI) is a serious threat to the physical and\nmental health of adolescents, significantly increasing the risk of suicide and\nattracting widespread public concern. Electroencephalography (EEG), as an\nobjective tool for identifying brain disorders, holds great promise. However,\nextracting meaningful and reliable features from high-dimensional EEG data,\nespecially by integrating spatiotemporal brain dynamics into informative\nrepresentations, remains a major challenge. In this study, we introduce an\nadvanced semi-supervised adversarial network, NSSI-Net, to effectively model\nEEG features related to NSSI. NSSI-Net consists of two key modules: a\nspatial-temporal feature extraction module and a multi-concept discriminator.\nIn the spatial-temporal feature extraction module, an integrated 2D\nconvolutional neural network (2D-CNN) and a bi-directional Gated Recurrent Unit\n(BiGRU) are used to capture both spatial and temporal dynamics in EEG data. In\nthe multi-concept discriminator, signal, gender, domain, and disease levels are\nfully explored to extract meaningful EEG features, considering individual,\ndemographic, disease variations across a diverse population. Based on\nself-collected NSSI data (n=114), the model's effectiveness and reliability are\ndemonstrated, with a 7.44% improvement in performance compared to existing\nmachine learning and deep learning methods. This study advances the\nunderstanding and early diagnosis of NSSI in adolescents with depression,\nenabling timely intervention. The source code is available at\nhttps://github.com/Vesan-yws/NSSINet.", "paper_summary_zh": "非自杀性自伤 (NSSI) 对青少年的身心健康构成严重威胁，显著增加了自杀风险，并引起了广泛的公众关注。脑电图 (EEG) 作为一种识别脑部疾病的客观工具，具有广阔的前景。然而，从高维 EEG 数据中提取有意义且可靠的特征，特别是通过将时空脑动态整合到信息表示中，仍然是一项重大挑战。在这项研究中，我们介绍了一个先进的半监督对抗网络 NSSI-Net，以有效建模与 NSSI 相关的 EEG 特征。NSSI-Net 由两个关键模块组成：时空特征提取模块和多概念判别器。在时空特征提取模块中，集成的二维卷积神经网络 (2D-CNN) 和双向门控循环单元 (BiGRU) 用于捕捉 EEG 数据中的空间和时间动态。在多概念判别器中，充分探索信号、性别、域和疾病水平，以提取有意义的 EEG 特征，考虑不同人群中的个体、人口统计学、疾病变异。基于自收集的 NSSI 数据 (n=114)，该模型的有效性和可靠性得到证实，与现有的机器学习和深度学习方法相比，性能提高了 7.44%。这项研究促进了对患有抑郁症的青少年 NSSI 的理解和早期诊断，实现了及时的干预。源代码可在 https://github.com/Vesan-yws/NSSINet 获得。", "author": "Zhen Liang et.al.", "authors": "Zhen Liang, Weishan Ye, Qile Liu, Li Zhang, Gan Huang, Yongjie Zhou", "id": "2410.12159v1", "paper_url": "http://arxiv.org/abs/2410.12159v1", "repo": "null"}}