{"2405.14475": {"publish_time": "2024-05-23", "title": "MagicDrive3D: Controllable 3D Generation for Any-View Rendering in Street Scenes", "paper_summary": "While controllable generative models for images and videos have achieved\nremarkable success, high-quality models for 3D scenes, particularly in\nunbounded scenarios like autonomous driving, remain underdeveloped due to high\ndata acquisition costs. In this paper, we introduce MagicDrive3D, a novel\npipeline for controllable 3D street scene generation that supports\nmulti-condition control, including BEV maps, 3D objects, and text descriptions.\nUnlike previous methods that reconstruct before training the generative models,\nMagicDrive3D first trains a video generation model and then reconstructs from\nthe generated data. This innovative approach enables easily controllable\ngeneration and static scene acquisition, resulting in high-quality scene\nreconstruction. To address the minor errors in generated content, we propose\ndeformable Gaussian splatting with monocular depth initialization and\nappearance modeling to manage exposure discrepancies across viewpoints.\nValidated on the nuScenes dataset, MagicDrive3D generates diverse, high-quality\n3D driving scenes that support any-view rendering and enhance downstream tasks\nlike BEV segmentation. Our results demonstrate the framework's superior\nperformance, showcasing its transformative potential for autonomous driving\nsimulation and beyond.", "paper_summary_zh": "儘管可控制的影像和影片生成模型已取得顯著的成功，但 3D 場景的高品質模型，尤其是在無界限場景（如自動駕駛）中，由於資料取得成本高，仍然發展不足。在本文中，我們介紹了 MagicDrive3D，這是一個可控制 3D 街景生成的新穎管道，支援多條件控制，包括 BEV 地圖、3D 物件和文字說明。與在訓練生成模型前進行重建的先前方法不同，MagicDrive3D 先訓練一個影片生成模型，然後從生成的資料中進行重建。這種創新的方法能輕鬆地控制生成和靜態場景取得，並產生高品質的場景重建。為了解決生成內容中的細微錯誤，我們提出了具有單眼深度初始化和外觀建模的可變形高斯散射，以管理不同視點的曝光差異。在 nuScenes 資料集上驗證後，MagicDrive3D 產生了多樣化、高品質的 3D 駕駛場景，支援任何視圖渲染，並增強了 BEV 分割等下游任務。我們的結果證明了該框架的優異效能，展示了其在自動駕駛模擬及其他領域的轉型潛力。", "author": "Ruiyuan Gao et.al.", "authors": "Ruiyuan Gao, Kai Chen, Zhihao Li, Lanqing Hong, Zhenguo Li, Qiang Xu", "id": "2405.14475v1", "paper_url": "http://arxiv.org/abs/2405.14475v1", "repo": "null"}}