{"2411.04588": {"publish_time": "2024-11-07", "title": "Tibyan Corpus: Balanced and Comprehensive Error Coverage Corpus Using ChatGPT for Arabic Grammatical Error Correction", "paper_summary": "Natural language processing (NLP) utilizes text data augmentation to overcome\nsample size constraints. Increasing the sample size is a natural and widely\nused strategy for alleviating these challenges. In this study, we chose Arabic\nto increase the sample size and correct grammatical errors. Arabic is\nconsidered one of the languages with limited resources for grammatical error\ncorrection (GEC). Furthermore, QALB-14 and QALB-15 are the only datasets used\nin most Arabic grammatical error correction research, with approximately 20,500\nparallel examples, which is considered low compared with other languages.\nTherefore, this study aims to develop an Arabic corpus called \"Tibyan\" for\ngrammatical error correction using ChatGPT. ChatGPT is used as a data augmenter\ntool based on a pair of Arabic sentences containing grammatical errors matched\nwith a sentence free of errors extracted from Arabic books, called guide\nsentences. Multiple steps were involved in establishing our corpus, including\nthe collection and pre-processing of a pair of Arabic texts from various\nsources, such as books and open-access corpora. We then used ChatGPT to\ngenerate a parallel corpus based on the text collected previously, as a guide\nfor generating sentences with multiple types of errors. By engaging linguistic\nexperts to review and validate the automatically generated sentences, we\nensured that they were correct and error-free. The corpus was validated and\nrefined iteratively based on feedback provided by linguistic experts to improve\nits accuracy. Finally, we used the Arabic Error Type Annotation tool (ARETA) to\nanalyze the types of errors in the Tibyan corpus. Our corpus contained 49 of\nerrors, including seven types: orthography, morphology, syntax, semantics,\npunctuation, merge, and split. The Tibyan corpus contains approximately 600 K\ntokens.", "paper_summary_zh": "自然語言處理 (NLP) 利用文字資料擴充來克服樣本量限制。增加樣本量是緩解這些挑戰的自然且廣泛使用的策略。在本研究中，我們選擇阿拉伯語來增加樣本量並更正語法錯誤。阿拉伯語被認為是語法錯誤更正 (GEC) 資源有限的語言之一。此外，QALB-14 和 QALB-15 是大多數阿拉伯語語法錯誤更正研究中唯一使用的資料集，大約有 20,500 個平行範例，與其他語言相比，這被認為是較少的。因此，本研究旨在開發一個名為「Tibyan」的阿拉伯語語料庫，用於使用 ChatGPT 進行語法錯誤更正。ChatGPT 被用作資料擴充工具，基於一對包含語法錯誤的阿拉伯語句子，並與從阿拉伯語書籍中提取的沒有錯誤的句子（稱為引導句子）相匹配。建立我們的語料庫涉及多個步驟，包括從各種來源（例如書籍和開放獲取語料庫）收集和預處理一對阿拉伯語文本。然後，我們使用 ChatGPT 根據先前收集的文本生成一個平行語料庫，作為生成具有多種類型錯誤的句子的指南。通過聘請語言專家來審查和驗證自動生成的句子，我們確保它們正確無誤。語料庫根據語言專家提供的回饋進行驗證和反覆修改，以提高其準確性。最後，我們使用阿拉伯語錯誤類型註解工具 (ARETA) 來分析 Tibyan 語料庫中的錯誤類型。我們的語料庫包含 49 個錯誤，包括七種類型：正字法、形態、句法、語義、標點符號、合併和拆分。Tibyan 語料庫包含約 600 K 個詞元。", "author": "Ahlam Alrehili et.al.", "authors": "Ahlam Alrehili, Areej Alhothali", "id": "2411.04588v1", "paper_url": "http://arxiv.org/abs/2411.04588v1", "repo": "null"}}