{"2412.17701": {"publish_time": "2024-12-23", "title": "From Models to Microtheories: Distilling a Model's Topical Knowledge for Grounded Question Answering", "paper_summary": "Recent reasoning methods (e.g., chain-of-thought, entailment reasoning) help\nusers understand how language models (LMs) answer a single question, but they\ndo little to reveal the LM's overall understanding, or \"theory,\" about the\nquestion's $\\textit{topic}$, making it still hard to trust the model. Our goal\nis to materialize such theories - here called $\\textit{microtheories}$ (a\nlinguistic analog of logical microtheories) - as a set of sentences\nencapsulating an LM's core knowledge about a topic. These statements\nsystematically work together to entail answers to a $\\textit{set}$ of questions\nto both engender trust and improve performance. Our approach is to first\npopulate a knowledge store with (model-generated) sentences that entail answers\nto training questions and then distill those down to a core microtheory that is\nconcise, general, and non-redundant. We show that, when added to a general\ncorpus (e.g., Wikipedia), microtheories can supply critical, topical\ninformation not necessarily present in the corpus, improving both a model's\nability to ground its answers to verifiable knowledge (i.e., show how answers\nare systematically entailed by documents in the corpus, fully grounding up to\n+8% more answers), and the accuracy of those grounded answers (up to +8%\nabsolute). We also show that, in a human evaluation in the medical domain, our\ndistilled microtheories contain a significantly higher concentration of\ntopically critical facts than the non-distilled knowledge store. Finally, we\nshow we can quantify the coverage of a microtheory for a topic (characterized\nby a dataset) using a notion of $p$-relevance. Together, these suggest that\nmicrotheories are an efficient distillation of an LM's topic-relevant\nknowledge, that they can usefully augment existing corpora, and can provide\nboth performance gains and an interpretable, verifiable window into the model's\nknowledge of a topic.", "paper_summary_zh": "<paragraph>最近的推理方法（例如，思维链、蕴含推理）有助于\n用户了解语言模型 (LM) 如何回答单个问题，但它们\n几乎没有揭示 LM 对问题的整体理解或“理论”，$\\textit{主题}$，这使得仍然难以信任该模型。我们的目标\n是将这些理论具体化 - 这里称为 $\\textit{微理论}$（逻辑微理论的语言类比） - 作为一组句子\n封装 LM 关于某个主题的核心知识。这些陈述\n系统地协同工作，以得出对 $\\textit{一组}$ 问题的答案，既能培养信任又能提高性能。我们的方法首先\n使用（模型生成的）句子填充知识库，这些句子蕴含对训练问题的答案，然后将这些句子提炼成一个核心微理论，该理论简洁、通用且不冗余。我们表明，当添加到通用\n语料库（例如，维基百科）中时，微理论可以提供语料库中不一定存在的关键主题信息，从而提高模型\n根据可验证知识回答问题的能力（即，展示答案如何被语料库中的文档系统地蕴含，完全支持高达\n+8% 的答案），以及这些有根据的答案的准确性（高达 +8%\n绝对）。我们还表明，在医学领域的评估中，我们的\n提炼微理论包含的主题关键事实浓度显着高于未提炼的知识库。最后，我们\n表明我们可以使用 $p$-相关性的概念量化微理论对某个主题（由数据集表征）的覆盖范围。总之，这些表明\n微理论是 LM 与主题相关的知识的有效提炼，它们可以有用地扩充现有语料库，并且可以提供\n性能提升和可解释的、可验证的窗口，以便了解模型对某个主题的知识。</paragraph>", "author": "Nathaniel Weir et.al.", "authors": "Nathaniel Weir, Bhavana Dalvi Mishra, Orion Weller, Oyvind Tafjord, Sam Hornstein, Alexander Sabol, Peter Jansen, Benjamin Van Durme, Peter Clark", "id": "2412.17701v1", "paper_url": "http://arxiv.org/abs/2412.17701v1", "repo": "https://github.com/nweir127/microtheories"}}