{"2409.02649": {"publish_time": "2024-09-04", "title": "OpenFact at CheckThat! 2024: Combining Multiple Attack Methods for Effective Adversarial Text Generation", "paper_summary": "This paper presents the experiments and results for the CheckThat! Lab at\nCLEF 2024 Task 6: Robustness of Credibility Assessment with Adversarial\nExamples (InCrediblAE). The primary objective of this task was to generate\nadversarial examples in five problem domains in order to evaluate the\nrobustness of widely used text classification methods (fine-tuned BERT, BiLSTM,\nand RoBERTa) when applied to credibility assessment issues.\n  This study explores the application of ensemble learning to enhance\nadversarial attacks on natural language processing (NLP) models. We\nsystematically tested and refined several adversarial attack methods, including\nBERT-Attack, Genetic algorithms, TextFooler, and CLARE, on five datasets across\nvarious misinformation tasks. By developing modified versions of BERT-Attack\nand hybrid methods, we achieved significant improvements in attack\neffectiveness. Our results demonstrate the potential of modification and\ncombining multiple methods to create more sophisticated and effective\nadversarial attack strategies, contributing to the development of more robust\nand secure systems.", "paper_summary_zh": "這篇論文呈現了 CLEF 2024 任務 6 中 CheckThat! 實驗室的實驗和結果：對抗性範例的可信度評估的穩健性（InCrediblAE）。此任務的主要目標是在五個問題領域中產生對抗性範例，以評估廣泛使用的文字分類方法（微調過的 BERT、BiLSTM 和 RoBERTa）在應用於可信度評估問題時的穩健性。\n此研究探討了集成學習在增強對自然語言處理 (NLP) 模型的對抗性攻擊中的應用。我們系統性地測試和改進了多種對抗性攻擊方法，包括 BERT-Attack、遺傳演算法、TextFooler 和 CLARE，在五個資料集上執行各種錯誤資訊任務。透過開發 BERT-Attack 的修改版本和混合方法，我們在攻擊效能方面取得顯著的改進。我們的結果證明了修改和結合多種方法以建立更精緻且有效的對抗性攻擊策略的潛力，有助於開發更穩健且安全的系統。", "author": "Włodzimierz Lewoniewski et.al.", "authors": "Włodzimierz Lewoniewski, Piotr Stolarski, Milena Stróżyna, Elzbieta Lewańska, Aleksandra Wojewoda, Ewelina Księżniak, Marcin Sawiński", "id": "2409.02649v1", "paper_url": "http://arxiv.org/abs/2409.02649v1", "repo": "null"}}