{"2501.06879": {"publish_time": "2025-01-12", "title": "Defect Detection Network In PCB Circuit Devices Based on GAN Enhanced YOLOv11", "paper_summary": "This study proposes an advanced method for surface defect detection in\nprinted circuit boards (PCBs) using an improved YOLOv11 model enhanced with a\ngenerative adversarial network (GAN). The approach focuses on identifying six\ncommon defect types: missing hole, rat bite, open circuit, short circuit, burr,\nand virtual welding. By employing GAN to generate synthetic defect images, the\ndataset is augmented with diverse and realistic patterns, improving the model's\nability to generalize, particularly for complex and infrequent defects like\nburrs. The enhanced YOLOv11 model is evaluated on a PCB defect dataset,\ndemonstrating significant improvements in accuracy, recall, and robustness,\nespecially when dealing with defects in complex environments or small targets.\nThis research contributes to the broader field of electronic design automation\n(EDA), where efficient defect detection is a crucial step in ensuring\nhigh-quality PCB manufacturing. By integrating advanced deep learning\ntechniques, this approach enhances the automation and precision of defect\ndetection, reducing reliance on manual inspection and accelerating\ndesign-to-production workflows. The findings underscore the importance of\nincorporating GAN-based data augmentation and optimized detection architectures\nin EDA processes, providing valuable insights for improving reliability and\nefficiency in PCB defect detection within industrial applications.", "paper_summary_zh": "本研究提出了一種先進的方法，使用改進的 YOLOv11 模型，並結合生成對抗網路 (GAN) 來進行印刷電路板 (PCB) 的表面缺陷檢測。此方法專注於識別六種常見的缺陷類型：孔洞缺失、鼠咬、開路、短路、毛邊和虛擬焊接。透過使用 GAN 來產生合成缺陷影像，資料集會加入多樣化且逼真的樣式，進而提升模型的泛化能力，特別是對於毛邊等複雜且不常見的缺陷。增強後的 YOLOv11 模型在 PCB 缺陷資料集上進行評估，證明在準確度、召回率和穩健性方面有顯著的提升，特別是在處理複雜環境或小目標中的缺陷時。這項研究有助於電子設計自動化 (EDA) 的廣泛領域，其中有效的缺陷檢測是確保高品質 PCB 製造的關鍵步驟。透過整合先進的深度學習技術，此方法增強了缺陷檢測的自動化和精確度，減少對人工檢查的依賴，並加速從設計到生產的工作流程。研究結果強調了在 EDA 製程中加入基於 GAN 的資料擴充和最佳化的檢測架構的重要性，為提升產業應用中 PCB 缺陷檢測的可靠性和效率提供了寶貴的見解。", "author": "Jiayi Huang et.al.", "authors": "Jiayi Huang, Feiyun Zhao, Lieyang Chen", "id": "2501.06879v1", "paper_url": "http://arxiv.org/abs/2501.06879v1", "repo": "null"}}