{"2410.01410": {"publish_time": "2024-10-02", "title": "On the Convergence of FedProx with Extrapolation and Inexact Prox", "paper_summary": "Enhancing the FedProx federated learning algorithm (Li et al., 2020) with\nserver-side extrapolation, Li et al. (2024a) recently introduced the FedExProx\nmethod. Their theoretical analysis, however, relies on the assumption that each\nclient computes a certain proximal operator exactly, which is impractical since\nthis is virtually never possible to do in real settings. In this paper, we\ninvestigate the behavior of FedExProx without this exactness assumption in the\nsmooth and globally strongly convex setting. We establish a general convergence\nresult, showing that inexactness leads to convergence to a neighborhood of the\nsolution. Additionally, we demonstrate that, with careful control, the adverse\neffects of this inexactness can be mitigated. By linking inexactness to biased\ncompression (Beznosikov et al., 2023), we refine our analysis, highlighting\nrobustness of extrapolation to inexact proximal updates. We also examine the\nlocal iteration complexity required by each client to achieved the required\nlevel of inexactness using various local optimizers. Our theoretical insights\nare validated through comprehensive numerical experiments.", "paper_summary_zh": "透過伺服器端外推增強 FedProx 聯邦學習演算法（Li 等人，2020），Li 等人（2024a）最近引入了 FedExProx 方法。然而，他們的理論分析依賴於每個客戶端都精確計算出某個近端算子的假設，這在實際環境中幾乎不可能做到，因此不切實際。在本文中，我們研究了在平滑且全局強凸設定中，沒有此精確度假設的 FedExProx 行為。我們建立了一個通用的收斂結果，表明不精確度會導致收斂到解的鄰域。此外，我們證明透過仔細控制，可以減輕這種不精確度的負面影響。透過將不精確度連結到有偏壓縮（Beznosikov 等人，2023），我們改進了分析，強調外推對不精確近端更新的穩健性。我們還研究了每個客戶端達到的不精確度所需的地方反覆運算複雜度，並使用各種地方最佳化器。我們的理論見解已透過全面的數值實驗驗證。", "author": "Hanmin Li et.al.", "authors": "Hanmin Li, Peter Richtárik", "id": "2410.01410v1", "paper_url": "http://arxiv.org/abs/2410.01410v1", "repo": "null"}}