{"2408.06929": {"publish_time": "2024-08-13", "title": "Evaluating Cultural Adaptability of a Large Language Model via Simulation of Synthetic Personas", "paper_summary": "The success of Large Language Models (LLMs) in multicultural environments\nhinges on their ability to understand users' diverse cultural backgrounds. We\nmeasure this capability by having an LLM simulate human profiles representing\nvarious nationalities within the scope of a questionnaire-style psychological\nexperiment. Specifically, we employ GPT-3.5 to reproduce reactions to\npersuasive news articles of 7,286 participants from 15 countries; comparing the\nresults with a dataset of real participants sharing the same demographic\ntraits. Our analysis shows that specifying a person's country of residence\nimproves GPT-3.5's alignment with their responses. In contrast, using native\nlanguage prompting introduces shifts that significantly reduce overall\nalignment, with some languages particularly impairing performance. These\nfindings suggest that while direct nationality information enhances the model's\ncultural adaptability, native language cues do not reliably improve simulation\nfidelity and can detract from the model's effectiveness.", "paper_summary_zh": "大型語言模型 (LLM) 在多元文化環境中的成功取決於它們理解使用者多元文化背景的能力。我們透過讓 LLM 模擬問卷式心理實驗中代表各種國籍的人類特徵來衡量這種能力。具體來說，我們使用 GPT-3.5 來重現來自 15 個國家的 7,286 名參與者對有說服力的新聞文章的反應；將結果與具有相同人口統計特徵的真實參與者資料集進行比較。我們的分析表明，指定個人的居住國家可以改善 GPT-3.5 與其反應的一致性。相反，使用母語提示會引入轉變，顯著降低整體一致性，有些語言特別會損害效能。這些發現表明，雖然直接的國籍資訊可以增強模型的文化適應性，但母語提示並不能可靠地改善模擬保真度，甚至可能降低模型的效能。", "author": "Louis Kwok et.al.", "authors": "Louis Kwok, Michal Bravansky, Lewis D. Griffin", "id": "2408.06929v1", "paper_url": "http://arxiv.org/abs/2408.06929v1", "repo": "null"}}