{"2409.06857": {"publish_time": "2024-09-10", "title": "What is the Role of Small Models in the LLM Era: A Survey", "paper_summary": "Large Language Models (LLMs) have made significant progress in advancing\nartificial general intelligence (AGI), leading to the development of\nincreasingly large models such as GPT-4 and LLaMA-405B. However, scaling up\nmodel sizes results in exponentially higher computational costs and energy\nconsumption, making these models impractical for academic researchers and\nbusinesses with limited resources. At the same time, Small Models (SMs) are\nfrequently used in practical settings, although their significance is currently\nunderestimated. This raises important questions about the role of small models\nin the era of LLMs, a topic that has received limited attention in prior\nresearch. In this work, we systematically examine the relationship between LLMs\nand SMs from two key perspectives: Collaboration and Competition. We hope this\nsurvey provides valuable insights for practitioners, fostering a deeper\nunderstanding of the contribution of small models and promoting more efficient\nuse of computational resources. The code is available at\nhttps://github.com/tigerchen52/role_of_small_models", "paper_summary_zh": "大型語言模型 (LLM) 在促進人工通用智能 (AGI) 方面取得了重大進展，導致開發出越來越大的模型，例如 GPT-4 和 LLaMA-405B。然而，擴大模型規模會導致計算成本和能源消耗呈指數級增長，這使得這些模型對於資源有限的學術研究人員和企業來說不切實際。與此同時，小型模型 (SM) 經常在實際環境中使用，儘管它們的重要性目前被低估了。這引發了關於 LLM 時代小型模型作用的重要問題，這個話題在先前的研究中受到的關注有限。在這項工作中，我們從協作和競爭這兩個關鍵角度系統地探討了 LLM 和 SM 之間的關係。我們希望這項調查能為實務工作者提供有價值的見解，促進對小型模型貢獻的更深入理解，並促進更有效率地使用計算資源。程式碼可在 https://github.com/tigerchen52/role_of_small_models 獲得", "author": "Lihu Chen et.al.", "authors": "Lihu Chen, Gaël Varoquaux", "id": "2409.06857v2", "paper_url": "http://arxiv.org/abs/2409.06857v2", "repo": "https://github.com/tigerchen52/role_of_small_models"}}