{"2503.10625": {"publish_time": "2025-03-13", "title": "LHM: Large Animatable Human Reconstruction Model from a Single Image in Seconds", "paper_summary": "Animatable 3D human reconstruction from a single image is a challenging\nproblem due to the ambiguity in decoupling geometry, appearance, and\ndeformation. Recent advances in 3D human reconstruction mainly focus on static\nhuman modeling, and the reliance of using synthetic 3D scans for training\nlimits their generalization ability. Conversely, optimization-based video\nmethods achieve higher fidelity but demand controlled capture conditions and\ncomputationally intensive refinement processes. Motivated by the emergence of\nlarge reconstruction models for efficient static reconstruction, we propose LHM\n(Large Animatable Human Reconstruction Model) to infer high-fidelity avatars\nrepresented as 3D Gaussian splatting in a feed-forward pass. Our model\nleverages a multimodal transformer architecture to effectively encode the human\nbody positional features and image features with attention mechanism, enabling\ndetailed preservation of clothing geometry and texture. To further boost the\nface identity preservation and fine detail recovery, we propose a head feature\npyramid encoding scheme to aggregate multi-scale features of the head regions.\nExtensive experiments demonstrate that our LHM generates plausible animatable\nhuman in seconds without post-processing for face and hands, outperforming\nexisting methods in both reconstruction accuracy and generalization ability.", "paper_summary_zh": "<paragraph>從單張圖像重建可動畫的 3D 人體模型是一個極具挑戰性的問題，因為難以將幾何形狀、外觀和變形分離。近年來，3D 人體重建的進展主要集中在靜態人體建模上，而且依賴使用合成的 3D 掃描數據進行訓練，限制了其泛化能力。相反地，基於優化的視頻方法雖然能實現更高的保真度，但需要受控的拍攝條件和計算密集型的細化過程。受高效靜態重建大型重建模型出現的啟發，我們提出了 LHM（大型可動畫人體重建模型），以在前饋過程中推斷以 3D 高斯樣條表示的高保真虛擬化身。我們的模型利用多模態 Transformer 架構，通過注意力機制有效地編碼人體位置特徵和圖像特徵，從而能夠詳細保留服裝的幾何形狀和紋理。為了進一步提高面部識別的保留和細節的恢復，我們提出了一種頭部特徵金字塔編碼方案，用於聚合頭部區域的多尺度特徵。大量實驗表明，我們的 LHM 可以在幾秒鐘內生成逼真的可動畫人體模型，無需對臉部和手部進行後處理，在重建精度和泛化能力方面均優於現有方法。</paragraph>\n", "author": "Lingteng Qiu et.al.", "authors": "Lingteng Qiu, Xiaodong Gu, Peihao Li, Qi Zuo, Weichao Shen, Junfei Zhang, Kejie Qiu, Weihao Yuan, Guanying Chen, Zilong Dong, Liefeng Bo", "id": "2503.10625v1", "paper_url": "http://arxiv.org/abs/2503.10625v1", "repo": "null"}}