{"2412.14633": {"publish_time": "2024-12-19", "title": "Progressive Fine-to-Coarse Reconstruction for Accurate Low-Bit Post-Training Quantization in Vision Transformers", "paper_summary": "Due to its efficiency, Post-Training Quantization (PTQ) has been widely\nadopted for compressing Vision Transformers (ViTs). However, when quantized\ninto low-bit representations, there is often a significant performance drop\ncompared to their full-precision counterparts. To address this issue,\nreconstruction methods have been incorporated into the PTQ framework to improve\nperformance in low-bit quantization settings. Nevertheless, existing related\nmethods predefine the reconstruction granularity and seldom explore the\nprogressive relationships between different reconstruction granularities, which\nleads to sub-optimal quantization results in ViTs. To this end, in this paper,\nwe propose a Progressive Fine-to-Coarse Reconstruction (PFCR) method for\naccurate PTQ, which significantly improves the performance of low-bit quantized\nvision transformers. Specifically, we define multi-head self-attention and\nmulti-layer perceptron modules along with their shortcuts as the finest\nreconstruction units. After reconstructing these two fine-grained units, we\ncombine them to form coarser blocks and reconstruct them at a coarser\ngranularity level. We iteratively perform this combination and reconstruction\nprocess, achieving progressive fine-to-coarse reconstruction. Additionally, we\nintroduce a Progressive Optimization Strategy (POS) for PFCR to alleviate the\ndifficulty of training, thereby further enhancing model performance.\nExperimental results on the ImageNet dataset demonstrate that our proposed\nmethod achieves the best Top-1 accuracy among state-of-the-art methods,\nparticularly attaining 75.61% for 3-bit quantized ViT-B in PTQ. Besides,\nquantization results on the COCO dataset reveal the effectiveness and\ngeneralization of our proposed method on other computer vision tasks like\nobject detection and instance segmentation.", "paper_summary_zh": "<paragraph>由於其效率，訓練後量化 (PTQ) 已被廣泛採用於壓縮視覺Transformer (ViT)。然而，當量化為低位元表示時，與其全精度對應項相比，通常會出現顯著的效能下降。為了解決此問題，重建方法已納入 PTQ 架構中，以提升低位元量化設定中的效能。儘管如此，現有的相關方法預先定義重建粒度，且很少探討不同重建粒度之間的漸進關係，這導致 ViT 中的量化結果次佳。為此，在本文中，我們提出了一種漸進精細到粗略重建 (PFCR) 方法，用於準確的 PTQ，這顯著提升了低位元量化視覺Transformer的效能。具體來說，我們定義了多頭自我注意和多層感知器模組以及其捷徑為最精細的重建單元。在重建這兩個細粒度單元後，我們將它們組合起來形成較粗略的區塊，並在較粗略的粒度層級重建它們。我們反覆執行此組合和重建程序，實現漸進的精細到粗略重建。此外，我們為 PFCR 引入了漸進最佳化策略 (POS)，以減輕訓練難度，進而進一步提升模型效能。在 ImageNet 資料集上的實驗結果證明，我們提出的方法在最先進的方法中取得了最佳的 Top-1 準確度，特別是在 PTQ 中為 3 位元量化的 ViT-B 達到了 75.61%。此外，在 COCO 資料集上的量化結果揭示了我們提出的方法在其他電腦視覺任務（如物件偵測和實例分割）上的有效性和泛化性。</paragraph>", "author": "Rui Ding et.al.", "authors": "Rui Ding, Liang Yong, Sihuan Zhao, Jing Nie, Lihui Chen, Haijun Liu, Xichuan Zhou", "id": "2412.14633v1", "paper_url": "http://arxiv.org/abs/2412.14633v1", "repo": "null"}}