{"2407.08306": {"publish_time": "2024-07-11", "title": "Adversarial-MidiBERT: Symbolic Music Understanding Model Based on Unbias Pre-training and Mask Fine-tuning", "paper_summary": "As an important part of Music Information Retrieval (MIR), Symbolic Music\nUnderstanding (SMU) has gained substantial attention, as it can assist\nmusicians and amateurs in learning and creating music. Recently, pre-trained\nlanguage models have been widely adopted in SMU because the symbolic music\nshares a huge similarity with natural language, and the pre-trained manner also\nhelps make full use of limited music data. However, the issue of bias, such as\nsexism, ageism, and racism, has been observed in pre-trained language models,\nwhich is attributed to the imbalanced distribution of training data. It also\nhas a significant influence on the performance of downstream tasks, which also\nhappens in SMU. To address this challenge, we propose Adversarial-MidiBERT, a\nsymbolic music understanding model based on Bidirectional Encoder\nRepresentations from Transformers (BERT). We introduce an unbiased pre-training\nmethod based on adversarial learning to minimize the participation of tokens\nthat lead to biases during training. Furthermore, we propose a mask fine-tuning\nmethod to narrow the data gap between pre-training and fine-tuning, which can\nhelp the model converge faster and perform better. We evaluate our method on\nfour music understanding tasks, and our approach demonstrates excellent\nperformance in all of them. The code for our model is publicly available at\nhttps://github.com/RS2002/Adversarial-MidiBERT.", "paper_summary_zh": "作為音樂資訊檢索 (MIR) 的重要部分，符號音樂理解 (SMU) 已獲得大量關注，因為它可以協助音樂家和業餘愛好者學習和創作音樂。最近，預訓練語言模型已廣泛應用於 SMU，因為符號音樂與自然語言有很大的相似性，而且預訓練方式也有助於充分利用有限的音樂資料。然而，在預訓練語言模型中觀察到偏見問題，例如性別歧視、年齡歧視和種族歧視，這歸因於訓練資料的不平衡分佈。這也對下游任務的執行產生重大影響，這也發生在 SMU 中。為了應對這一挑戰，我們提出了對抗式 MidiBERT，這是一個基於來自 Transformer 的雙向編碼器表徵 (BERT) 的符號音樂理解模型。我們引入了一種基於對抗學習的無偏見預訓練方法，以最小化導致訓練期間偏見的符號參與。此外，我們提出了一種遮罩微調方法，以縮小預訓練和微調之間的資料差距，這可以幫助模型更快收斂並執行得更好。我們在四項音樂理解任務上評估了我們的方法，我們的做法在所有任務中都表現出色的執行能力。我們模型的程式碼可在 https://github.com/RS2002/Adversarial-MidiBERT 公開取得。", "author": "Zijian Zhao et.al.", "authors": "Zijian Zhao", "id": "2407.08306v1", "paper_url": "http://arxiv.org/abs/2407.08306v1", "repo": "https://github.com/RS2002/Adversarial-MidiBERT"}}