{"2412.12843": {"publish_time": "2024-12-17", "title": "Efficient Event-based Semantic Segmentation with Spike-driven Lightweight Transformer-based Networks", "paper_summary": "Event-based semantic segmentation has great potential in autonomous driving\nand robotics due to the advantages of event cameras, such as high dynamic\nrange, low latency, and low power cost. Unfortunately, current artificial\nneural network (ANN)-based segmentation methods suffer from high computational\ndemands, the requirements for image frames, and massive energy consumption,\nlimiting their efficiency and application on resource-constrained edge/mobile\nplatforms. To address these problems, we introduce SLTNet, a spike-driven\nlightweight transformer-based network designed for event-based semantic\nsegmentation. Specifically, SLTNet is built on efficient spike-driven\nconvolution blocks (SCBs) to extract rich semantic features while reducing the\nmodel's parameters. Then, to enhance the long-range contextural feature\ninteraction, we propose novel spike-driven transformer blocks (STBs) with\nbinary mask operations. Based on these basic blocks, SLTNet employs a\nhigh-efficiency single-branch architecture while maintaining the low energy\nconsumption of the Spiking Neural Network (SNN). Finally, extensive experiments\non DDD17 and DSEC-Semantic datasets demonstrate that SLTNet outperforms\nstate-of-the-art (SOTA) SNN-based methods by at least 7.30% and 3.30% mIoU,\nrespectively, with extremely 5.48x lower energy consumption and 1.14x faster\ninference speed.", "paper_summary_zh": "基於事件的語義分割在自動駕駛和機器人技術中具有巨大的潛力，這是因為事件相機具有高動態範圍、低延遲和低功耗成本等優勢。不幸的是，當前的基於人工神經網路 (ANN) 的分割方法存在計算需求高、對影像幀的要求以及大量耗能等問題，限制了它們在資源受限的邊緣/行動平台上的效率和應用。為了解決這些問題，我們引入了 SLTNet，這是一個以脈衝驅動的輕量級Transformer為基礎的網路，專為基於事件的語義分割而設計。具體來說，SLTNet 建立在高效的脈衝驅動卷積區塊 (SCB) 上，以提取豐富的語義特徵，同時減少模型的參數。然後，為了增強長程脈絡特徵交互，我們提出了結合二進位遮罩運算的新型脈衝驅動Transformer區塊 (STB)。基於這些基本區塊，SLTNet 採用高效率的單分支架構，同時保持脈衝神經網路 (SNN) 的低能耗。最後，在 DDD17 和 DSEC-Semantic 資料集上的廣泛實驗表明，SLTNet 在 mIoU 上分別優於最先進 (SOTA) 的基於 SNN 的方法至少 7.30% 和 3.30%，同時能耗極低，為 5.48 倍，推論速度為 1.14 倍。", "author": "Xiaxin Zhu et.al.", "authors": "Xiaxin Zhu, Fangming Guo, Xianlei Long, Qingyi Gu, Chao Chen, Fuqiang Gu", "id": "2412.12843v1", "paper_url": "http://arxiv.org/abs/2412.12843v1", "repo": "null"}}