{"2411.04118": {"publish_time": "2024-11-06", "title": "Medical Adaptation of Large Language and Vision-Language Models: Are We Making Progress?", "paper_summary": "Several recent works seek to develop foundation models specifically for\nmedical applications, adapting general-purpose large language models (LLMs) and\nvision-language models (VLMs) via continued pretraining on publicly available\nbiomedical corpora. These works typically claim that such domain-adaptive\npretraining (DAPT) improves performance on downstream medical tasks, such as\nanswering medical licensing exam questions. In this paper, we compare seven\npublic \"medical\" LLMs and two VLMs against their corresponding base models,\narriving at a different conclusion: all medical VLMs and nearly all medical\nLLMs fail to consistently improve over their base models in the zero-/few-shot\nprompting regime for medical question-answering (QA) tasks. For instance,\nacross the tasks and model pairs we consider in the 3-shot setting, medical\nLLMs only outperform their base models in 12.1% of cases, reach a (statistical)\ntie in 49.8% of cases, and are significantly worse than their base models in\nthe remaining 38.2% of cases. Our conclusions are based on (i) comparing each\nmedical model head-to-head, directly against the corresponding base model; (ii)\noptimizing the prompts for each model separately; and (iii) accounting for\nstatistical uncertainty in comparisons. While these basic practices are not\nconsistently adopted in the literature, our ablations show that they\nsubstantially impact conclusions. Our findings suggest that state-of-the-art\ngeneral-domain models may already exhibit strong medical knowledge and\nreasoning capabilities, and offer recommendations to strengthen the conclusions\nof future studies.", "paper_summary_zh": "<paragraph>多篇近期作品試圖專門為醫療應用開發基礎模型，透過持續預訓練公開可用的生物醫學語料庫，調整通用大型語言模型 (LLM) 和視覺語言模型 (VLM)。這些作品通常聲稱，這種領域適應式預訓練 (DAPT) 能提升下游醫療任務的效能，例如回答醫學執照考試題目。在本文中，我們將七個公開的「醫療」LLM 和兩個 VLM 與它們對應的基本模型進行比較，並得出不同的結論：所有醫療 VLM 和幾乎所有醫療 LLM 在醫療問答 (QA) 任務的零次/少次提示模式中，都無法持續優於它們的基本模型。例如，在我們於 3 次提示設定中考量的任務和模型配對中，醫療 LLM 僅在 12.1% 的情況下優於它們的基本模型，在 49.8% 的情況下達到（統計）平手，而在其餘 38.2% 的情況下則顯著低於它們的基本模型。我們的結論基於：(i) 將每個醫療模型與對應的基本模型進行一對一的比較；(ii) 分別針對每個模型最佳化提示；以及 (iii) 考慮比較中的統計不確定性。儘管這些基本做法並未在文獻中持續採用，但我們的消融研究顯示，它們會對結論造成重大影響。我們的研究結果表明，最先進的通用領域模型可能已經展現出強大的醫療知識和推理能力，並提出建議以加強未來研究的結論。</paragraph>", "author": "Daniel P. Jeong et.al.", "authors": "Daniel P. Jeong, Saurabh Garg, Zachary C. Lipton, Michael Oberst", "id": "2411.04118v2", "paper_url": "http://arxiv.org/abs/2411.04118v2", "repo": "null"}}