{"2408.12673": {"publish_time": "2024-08-22", "title": "Enhancing Transferability of Adversarial Attacks with GE-AdvGAN+: A Comprehensive Framework for Gradient Editing", "paper_summary": "Transferable adversarial attacks pose significant threats to deep neural\nnetworks, particularly in black-box scenarios where internal model information\nis inaccessible. Studying adversarial attack methods helps advance the\nperformance of defense mechanisms and explore model vulnerabilities. These\nmethods can uncover and exploit weaknesses in models, promoting the development\nof more robust architectures. However, current methods for transferable attacks\noften come with substantial computational costs, limiting their deployment and\napplication, especially in edge computing scenarios. Adversarial generative\nmodels, such as Generative Adversarial Networks (GANs), are characterized by\ntheir ability to generate samples without the need for retraining after an\ninitial training phase. GE-AdvGAN, a recent method for transferable adversarial\nattacks, is based on this principle. In this paper, we propose a novel general\nframework for gradient editing-based transferable attacks, named GE-AdvGAN+,\nwhich integrates nearly all mainstream attack methods to enhance\ntransferability while significantly reducing computational resource\nconsumption. Our experiments demonstrate the compatibility and effectiveness of\nour framework. Compared to the baseline AdvGAN, our best-performing method,\nGE-AdvGAN++, achieves an average ASR improvement of 47.8. Additionally, it\nsurpasses the latest competing algorithm, GE-AdvGAN, with an average ASR\nincrease of 5.9. The framework also exhibits enhanced computational efficiency,\nachieving 2217.7 FPS, outperforming traditional methods such as BIM and\nMI-FGSM. The implementation code for our GE-AdvGAN+ framework is available at\nhttps://github.com/GEAdvGANP", "paper_summary_zh": "可傳遞對抗攻擊對深度神經網路構成重大威脅，特別是在無法取得內部模型資訊的黑盒情境中。研究對抗攻擊方法有助於提升防禦機制的效能並探索模型的弱點。這些方法可以找出並利用模型中的弱點，促進更強健架構的發展。然而，當前可傳遞攻擊的方法通常伴隨著龐大的運算成本，限制了它們的部署和應用，特別是在邊緣運算情境中。對抗式生成模型，例如生成對抗網路 (GAN)，其特點是可以產生樣本，而無需在初始訓練階段後重新訓練。GE-AdvGAN 是一種針對可傳遞對抗攻擊的近期方法，其基於此原理。在本文中，我們提出了一個針對基於梯度編輯的可傳遞攻擊的新穎通用架構，稱為 GE-AdvGAN+，它整合了幾乎所有主流攻擊方法，以增強可傳遞性，同時大幅減少運算資源消耗。我們的實驗證明了我們架構的相容性和有效性。與基準 AdvGAN 相比，我們效能最佳的方法 GE-AdvGAN++ 達到了平均 ASR 提升 47.8。此外，它超越了最新的競爭演算法 GE-AdvGAN，平均 ASR 提升了 5.9。該架構還展現了增強的運算效率，達到了 2217.7 FPS，優於傳統方法，例如 BIM 和 MI-FGSM。我們 GE-AdvGAN+ 架構的實作程式碼可於 https://github.com/GEAdvGANP 取得", "author": "Zhibo Jin et.al.", "authors": "Zhibo Jin, Jiayu Zhang, Zhiyu Zhu, Yuchen Zhang, Jiahao Huang, Jianlong Zhou, Fang Chen", "id": "2408.12673v1", "paper_url": "http://arxiv.org/abs/2408.12673v1", "repo": "null"}}