{"2406.19049": {"publish_time": "2024-06-27", "title": "Accuracy on the wrong line: On the pitfalls of noisy data for out-of-distribution generalisation", "paper_summary": "\"Accuracy-on-the-line\" is a widely observed phenomenon in machine learning,\nwhere a model's accuracy on in-distribution (ID) and out-of-distribution (OOD)\ndata is positively correlated across different hyperparameters and data\nconfigurations. But when does this useful relationship break down? In this\nwork, we explore its robustness. The key observation is that noisy data and the\npresence of nuisance features can be sufficient to shatter the\nAccuracy-on-the-line phenomenon. In these cases, ID and OOD accuracy can become\nnegatively correlated, leading to \"Accuracy-on-the-wrong-line\". This phenomenon\ncan also occur in the presence of spurious (shortcut) features, which tend to\novershadow the more complex signal (core, non-spurious) features, resulting in\na large nuisance feature space. Moreover, scaling to larger datasets does not\nmitigate this undesirable behavior and may even exacerbate it. We formally\nprove a lower bound on Out-of-distribution (OOD) error in a linear\nclassification model, characterizing the conditions on the noise and nuisance\nfeatures for a large OOD error. We finally demonstrate this phenomenon across\nboth synthetic and real datasets with noisy data and nuisance features.", "paper_summary_zh": "「準確性在線上」是機器學習中廣泛觀察到的現象，其中模型在分佈內 (ID) 和分佈外 (OOD) 資料上的準確性在不同的超參數和資料配置中呈正相關。但是這種有用的關係什麼時候會中斷？在這項工作中，我們探討其穩健性。關鍵觀察是，雜訊資料和滋擾特徵的存在足以打破「準確性在線上」現象。在這些情況下，ID 和 OOD 準確性可能會變成負相關，導致「準確性在錯誤線上」。這種現象也可能發生在存在虛假（捷徑）特徵的情況下，虛假特徵往往會掩蓋更複雜的訊號（核心、非虛假）特徵，導致大量的滋擾特徵空間。此外，擴充到更大的資料集並不會減輕這種不良行為，甚至可能使情況惡化。我們正式證明了線性分類模型中 Out-of-distribution (OOD) 誤差的下限，描述了大量 OOD 誤差的雜訊和滋擾特徵條件。我們最後在合成和真實資料集上展示了這種現象，這些資料集包含雜訊資料和滋擾特徵。", "author": "Amartya Sanyal et.al.", "authors": "Amartya Sanyal, Yaxi Hu, Yaodong Yu, Yian Ma, Yixin Wang, Bernhard Schölkopf", "id": "2406.19049v1", "paper_url": "http://arxiv.org/abs/2406.19049v1", "repo": "null"}}