{"2408.14584": {"publish_time": "2024-08-26", "title": "DIAGen: Diverse Image Augmentation with Generative Models", "paper_summary": "Simple data augmentation techniques, such as rotations and flips, are widely\nused to enhance the generalization power of computer vision models. However,\nthese techniques often fail to modify high-level semantic attributes of a\nclass. To address this limitation, researchers have explored generative\naugmentation methods like the recently proposed DA-Fusion. Despite some\nprogress, the variations are still largely limited to textural changes, thus\nfalling short on aspects like varied viewpoints, environment, weather\nconditions, or even class-level semantic attributes (eg, variations in a dog's\nbreed). To overcome this challenge, we propose DIAGen, building upon DA-Fusion.\nFirst, we apply Gaussian noise to the embeddings of an object learned with\nTextual Inversion to diversify generations using a pre-trained diffusion\nmodel's knowledge. Second, we exploit the general knowledge of a text-to-text\ngenerative model to guide the image generation of the diffusion model with\nvaried class-specific prompts. Finally, we introduce a weighting mechanism to\nmitigate the impact of poorly generated samples. Experimental results across\nvarious datasets show that DIAGen not only enhances semantic diversity but also\nimproves the performance of subsequent classifiers. The advantages of DIAGen\nover standard augmentations and the DA-Fusion baseline are particularly\npronounced with out-of-distribution samples.", "paper_summary_zh": "簡單的資料擴充技術，例如旋轉和翻轉，廣泛用於增強電腦視覺模型的泛化能力。然而，這些技術通常無法修改類別的高階語義屬性。為了解決這個限制，研究人員探索了生成擴充方法，例如最近提出的 DA-Fusion。儘管取得了一些進展，但變異仍然很大程度上僅限於紋理變化，因此在視角、環境、天氣條件甚至類別級語義屬性（例如，狗品種的變化）等方面存在不足。為了克服這個挑戰，我們提出了 DIAGen，並建立在 DA-Fusion 之上。首先，我們將高斯噪聲應用於使用文字反轉學習的物件嵌入，以使用預先訓練的擴散模型的知識來多樣化生成。其次，我們利用文字轉文字生成模型的一般知識來指導擴散模型的影像生成，並使用不同的類別特定提示。最後，我們引入了一個加權機制來減輕生成不良樣本的影響。跨各種資料集的實驗結果表明，DIAGen 不僅增強了語義多樣性，而且還改善了後續分類器的性能。DIAGen 相對於標準擴充和 DA-Fusion 基線的優勢在分佈外樣本中尤為明顯。", "author": "Tobias Lingenberg et.al.", "authors": "Tobias Lingenberg, Markus Reuter, Gopika Sudhakaran, Dominik Gojny, Stefan Roth, Simone Schaub-Meyer", "id": "2408.14584v1", "paper_url": "http://arxiv.org/abs/2408.14584v1", "repo": "null"}}