{"2407.16119": {"publish_time": "2024-07-23", "title": "Uncertainty-Aware Deep Neural Representations for Visual Analysis of Vector Field Data", "paper_summary": "The widespread use of Deep Neural Networks (DNNs) has recently resulted in\ntheir application to challenging scientific visualization tasks. While advanced\nDNNs demonstrate impressive generalization abilities, understanding factors\nlike prediction quality, confidence, robustness, and uncertainty is crucial.\nThese insights aid application scientists in making informed decisions.\nHowever, DNNs lack inherent mechanisms to measure prediction uncertainty,\nprompting the creation of distinct frameworks for constructing robust\nuncertainty-aware models tailored to various visualization tasks. In this work,\nwe develop uncertainty-aware implicit neural representations to model\nsteady-state vector fields effectively. We comprehensively evaluate the\nefficacy of two principled deep uncertainty estimation techniques: (1) Deep\nEnsemble and (2) Monte Carlo Dropout, aimed at enabling uncertainty-informed\nvisual analysis of features within steady vector field data. Our detailed\nexploration using several vector data sets indicate that uncertainty-aware\nmodels generate informative visualization results of vector field features.\nFurthermore, incorporating prediction uncertainty improves the resilience and\ninterpretability of our DNN model, rendering it applicable for the analysis of\nnon-trivial vector field data sets.", "paper_summary_zh": "深度神经网络（DNN）的广泛使用最近导致其应用于具有挑战性的科学可视化任务。虽然先进的 DNN 展示了令人印象深刻的泛化能力，但了解预测质量、置信度、鲁棒性和不确定性等因素至关重要。这些见解有助于应用科学家做出明智的决策。然而，DNN 缺乏衡量预测不确定性的内在机制，促使创建不同的框架来构建针对各种可视化任务量身定制的鲁棒的不确定性感知模型。在这项工作中，我们开发了不确定性感知的隐式神经表示来有效地对稳态矢量场进行建模。我们全面评估了两种原则性深度不确定性估计技术的有效性：(1) 深度集成和 (2) 蒙特卡洛丢弃，旨在实现对稳态矢量场数据中特征的不确定性知情视觉分析。我们使用几个矢量数据集进行的详细探索表明，不确定性感知模型生成了矢量场特征的信息可视化结果。此外，纳入预测不确定性提高了我们 DNN 模型的弹性和可解释性，使其适用于分析非平凡矢量场数据集。", "author": "Atul Kumar et.al.", "authors": "Atul Kumar, Siddharth Garg, Soumya Dutta", "id": "2407.16119v1", "paper_url": "http://arxiv.org/abs/2407.16119v1", "repo": "null"}}