{"2408.12989": {"publish_time": "2024-08-23", "title": "RIFF: Inducing Rules for Fraud Detection from Decision Trees", "paper_summary": "Financial fraud is the cause of multi-billion dollar losses annually.\nTraditionally, fraud detection systems rely on rules due to their transparency\nand interpretability, key features in domains where decisions need to be\nexplained. However, rule systems require significant input from domain experts\nto create and tune, an issue that rule induction algorithms attempt to mitigate\nby inferring rules directly from data. We explore the application of these\nalgorithms to fraud detection, where rule systems are constrained to have a low\nfalse positive rate (FPR) or alert rate, by proposing RIFF, a rule induction\nalgorithm that distills a low FPR rule set directly from decision trees. Our\nexperiments show that the induced rules are often able to maintain or improve\nperformance of the original models for low FPR tasks, while substantially\nreducing their complexity and outperforming rules hand-tuned by experts.", "paper_summary_zh": "金融詐欺每年造成數十億美元的損失。\n傳統上，詐欺偵測系統依賴於規則，因為它們具有透明度和可解釋性，這是需要解釋決策的領域中的關鍵特徵。然而，規則系統需要領域專家的大量輸入才能建立和調整，而規則歸納演算法嘗試透過直接從資料推論規則來減輕這個問題。我們探討這些演算法在詐欺偵測中的應用，其中規則系統受到約束，必須具有低誤報率 (FPR) 或警示率，方法是提出 RIFF，這是一種規則歸納演算法，可以從決策樹中直接萃取出低 FPR 規則組。我們的實驗顯示，歸納出的規則通常能夠維持或改善原始模型在低 FPR 任務中的效能，同時大幅降低其複雜性，而且表現優於專家手動調整的規則。", "author": "João Lucas Martins et.al.", "authors": "João Lucas Martins, João Bravo, Ana Sofia Gomes, Carlos Soares, Pedro Bizarro", "id": "2408.12989v1", "paper_url": "http://arxiv.org/abs/2408.12989v1", "repo": "null"}}