{"2410.08642": {"publish_time": "2024-10-11", "title": "More than Memes: A Multimodal Topic Modeling Approach to Conspiracy Theories on Telegram", "paper_summary": "Research on conspiracy theories and related content online has traditionally\nfocused on textual data. To address the increasing prevalence of (audio-)visual\ndata on social media, and to capture the evolving and dynamic nature of this\ncommunication, researchers have begun to explore the potential of unsupervised\napproaches for analyzing multimodal online content. Our research contributes to\nthis field by exploring the potential of multimodal topic modeling for\nanalyzing conspiracy theories in German-language Telegram channels. Our work\nuses the BERTopic topic modeling approach in combination with CLIP for the\nanalysis of textual and visual data. We analyze a corpus of ~40, 000 Telegram\nmessages posted in October 2023 in 571 German-language Telegram channels known\nfor disseminating conspiracy theories and other deceptive content. We explore\nthe potentials and challenges of this approach for studying a medium-sized\ncorpus of user-generated, text-image online content. We offer insights into the\ndominant topics across modalities, different text and image genres discovered\nduring the analysis, quantitative inter-modal topic analyses, and a qualitative\ncase study of textual, visual, and multimodal narrative strategies in the\ncommunication of conspiracy theories.", "paper_summary_zh": "傳統上，針對陰謀論和相關網路內容的研究都專注於文字資料。為了探討社群媒體上（音訊）視覺資料日益普及的情況，並捕捉這種溝通形式演變且動態的本質，研究人員已開始探索利用非監督式方法分析多模態網路內容的可能性。我們的研究透過探索多模態主題建模在分析德語 Telegram 頻道中陰謀論的可能性，為此領域做出貢獻。我們的研究結合 BERTopic 主題建模方法和 CLIP 來分析文字和視覺資料。我們分析了 2023 年 10 月發布在 571 個德語 Telegram 頻道中約 40,000 則 Telegram 訊息，這些頻道以傳播陰謀論和其他具有欺騙性的內容而聞名。我們探討了這種方法在研究由使用者產生的中型文字圖片網路內容時具備的潛力和挑戰。我們深入探討各種模態中的主要主題、分析過程中發現的不同文字和圖片類型、定量的跨模態主題分析，以及陰謀論溝通中文字、視覺和多模態敘事策略的定性個案研究。", "author": "Elisabeth Steffen et.al.", "authors": "Elisabeth Steffen", "id": "2410.08642v1", "paper_url": "http://arxiv.org/abs/2410.08642v1", "repo": "null"}}