{"2405.06275": {"publish_time": "2024-05-10", "title": "Pruning as a Domain-specific LLM Extractor", "paper_summary": "Large Language Models (LLMs) have exhibited remarkable proficiency across a\nwide array of NLP tasks. However, the escalation in model size also engenders\nsubstantial deployment costs. While few efforts have explored model pruning\ntechniques to reduce the size of LLMs, they mainly center on general or\ntask-specific weights. This leads to suboptimal performance due to lacking\nspecificity on the target domain or generality on different tasks when applied\nto domain-specific challenges. This work introduces an innovative unstructured\ndual-pruning methodology, D-Pruner, for domain-specific compression on LLM. It\nextracts a compressed, domain-specific, and task-agnostic LLM by identifying\nLLM weights that are pivotal for general capabilities, like linguistic\ncapability and multi-task solving, and domain-specific knowledge. More\nspecifically, we first assess general weight importance by quantifying the\nerror incurred upon their removal with the help of an open-domain calibration\ndataset. Then, we utilize this general weight importance to refine the training\nloss, so that it preserves generality when fitting into a specific domain.\nMoreover, by efficiently approximating weight importance with the refined\ntraining loss on a domain-specific calibration dataset, we obtain a pruned\nmodel emphasizing generality and specificity. Our comprehensive experiments\nacross various tasks in healthcare and legal domains show the effectiveness of\nD-Pruner in domain-specific compression. Our code is available at\nhttps://github.com/psunlpgroup/D-Pruner.", "paper_summary_zh": "大型語言模型 (LLM) 在廣泛的自然語言處理任務中展現出卓越的能力。然而，模型規模的擴大也帶來顯著的部署成本。儘管很少有研究探索模型剪枝技術以縮小 LLM 的規模，但它們主要集中於一般或特定於任務的權重。這會導致次佳效能，因為當應用於特定於領域的挑戰時，缺乏針對目標領域的特殊性或不同任務的一般性。這項工作介紹了一個創新的非結構化雙重剪枝方法 D-Pruner，用於 LLM 的特定於領域的壓縮。它通過識別對一般能力（例如語言能力和多任務解決）和特定於領域的知識至關重要的 LLM 權重，來提取一個壓縮的、特定於領域的和與任務無關的 LLM。更具體地說，我們首先通過使用開放領域校準資料集來量化移除它們時產生的錯誤，來評估一般權重重要性。然後，我們利用這個一般權重重要性來改善訓練損失，以便在適應特定領域時保持一般性。此外，通過在特定於領域的校準資料集上使用改善的訓練損失來有效近似權重重要性，我們獲得了一個強調一般性和特殊性的剪枝模型。我們在醫療保健和法律領域的各種任務中進行的全面實驗顯示了 D-Pruner 在特定於領域的壓縮中的有效性。我們的程式碼可在 https://github.com/psunlpgroup/D-Pruner 取得。", "author": "Nan Zhang et.al.", "authors": "Nan Zhang, Yanchi Liu, Xujiang Zhao, Wei Cheng, Runxue Bao, Rui Zhang, Prasenjit Mitra, Haifeng Chen", "id": "2405.06275v1", "paper_url": "http://arxiv.org/abs/2405.06275v1", "repo": "https://github.com/psunlpgroup/d-pruner"}}