{"2408.12692": {"publish_time": "2024-08-22", "title": "Unlocking Intrinsic Fairness in Stable Diffusion", "paper_summary": "Recent text-to-image models like Stable Diffusion produce photo-realistic\nimages but often show demographic biases. Previous debiasing methods focused on\ntraining-based approaches, failing to explore the root causes of bias and\noverlooking Stable Diffusion's potential for unbiased image generation. In this\npaper, we demonstrate that Stable Diffusion inherently possesses fairness,\nwhich can be unlocked to achieve debiased outputs. Through carefully designed\nexperiments, we identify the excessive bonding between text prompts and the\ndiffusion process as a key source of bias. To address this, we propose a novel\napproach that perturbs text conditions to unleash Stable Diffusion's intrinsic\nfairness. Our method effectively mitigates bias without additional tuning,\nwhile preserving image-text alignment and image quality.", "paper_summary_zh": "最近的文本到图像模型，像是 Stable Diffusion，可以产生逼真的图像，但经常出现人口统计偏差。先前的去偏方法专注于基于训练的方法，未能探索偏差的根本原因，并且忽略了 Stable Diffusion 在无偏图像生成方面的潜力。在本文中，我们证明了 Stable Diffusion 本质上具有公平性，可以解锁以实现去偏输出。通过精心设计的实验，我们确定文本提示和扩散过程之间的过度绑定是造成偏差的关键来源。为了解决这个问题，我们提出了一种新颖的方法，该方法扰动文本条件以释放 Stable Diffusion 的内在公平性。我们的方法有效地减轻了偏差，而无需额外的调整，同时保留了图像文本对齐和图像质量。", "author": "Eunji Kim et.al.", "authors": "Eunji Kim, Siwon Kim, Rahim Entezari, Sungroh Yoon", "id": "2408.12692v1", "paper_url": "http://arxiv.org/abs/2408.12692v1", "repo": "null"}}