{"2409.07092": {"publish_time": "2024-09-11", "title": "CWT-Net: Super-resolution of Histopathology Images Using a Cross-scale Wavelet-based Transformer", "paper_summary": "Super-resolution (SR) aims to enhance the quality of low-resolution images\nand has been widely applied in medical imaging. We found that the design\nprinciples of most existing methods are influenced by SR tasks based on\nreal-world images and do not take into account the significance of the\nmulti-level structure in pathological images, even if they can achieve\nrespectable objective metric evaluations. In this work, we delve into two\nsuper-resolution working paradigms and propose a novel network called CWT-Net,\nwhich leverages cross-scale image wavelet transform and Transformer\narchitecture. Our network consists of two branches: one dedicated to learning\nsuper-resolution and the other to high-frequency wavelet features. To generate\nhigh-resolution histopathology images, the Transformer module shares and fuses\nfeatures from both branches at various stages. Notably, we have designed a\nspecialized wavelet reconstruction module to effectively enhance the wavelet\ndomain features and enable the network to operate in different modes, allowing\nfor the introduction of additional relevant information from cross-scale\nimages. Our experimental results demonstrate that our model significantly\noutperforms state-of-the-art methods in both performance and visualization\nevaluations and can substantially boost the accuracy of image diagnostic\nnetworks.", "paper_summary_zh": "超解析度 (SR) 旨在提升低解析度影像的品質，並已廣泛應用於醫學影像。我們發現現有方法的大部分設計原則都受到基於真實影像的 SR 任務影響，而且即使它們能達到可觀的客觀指標評估，也不會考慮病理影像中多層級結構的重要性。在這項工作中，我們深入探討兩種超解析度工作範例，並提出一個名為 CWT-Net 的新型網路，它利用跨尺度影像小波轉換和 Transformer 架構。我們的網路包含兩個分支：一個專門用於學習超解析度，另一個則用於高頻小波特徵。為了產生高解析度組織病理學影像，Transformer 模組會在不同階段分享和融合來自兩個分支的特徵。值得注意的是，我們設計了一個專門的小波重建模組，以有效增強小波域特徵，並讓網路能夠在不同模式下運作，允許從跨尺度影像中引入其他相關資訊。我們的實驗結果證明，我們的模型在效能和視覺化評估方面都大幅優於現有技術，而且能大幅提升影像診斷網路的準確度。", "author": "Feiyang Jia et.al.", "authors": "Feiyang Jia, Zhineng Chen, Ziying Song, Lin Liu, Caiyan Jia", "id": "2409.07092v1", "paper_url": "http://arxiv.org/abs/2409.07092v1", "repo": "null"}}