{"2407.20622": {"publish_time": "2024-07-30", "title": "Decoding Linguistic Representations of Human Brain", "paper_summary": "Language, as an information medium created by advanced organisms, has always\nbeen a concern of neuroscience regarding how it is represented in the brain.\nDecoding linguistic representations in the evoked brain has shown\ngroundbreaking achievements, thanks to the rapid improvement of neuroimaging,\nmedical technology, life sciences and artificial intelligence. In this work, we\npresent a taxonomy of brain-to-language decoding of both textual and speech\nformats. This work integrates two types of research: neuroscience focusing on\nlanguage understanding and deep learning-based brain decoding. Generating\ndiscernible language information from brain activity could not only help those\nwith limited articulation, especially amyotrophic lateral sclerosis (ALS)\npatients but also open up a new way for the next generation's brain-computer\ninterface (BCI). This article will help brain scientists and deep-learning\nresearchers to gain a bird's eye view of fine-grained language perception, and\nthus facilitate their further investigation and research of neural process and\nlanguage decoding.", "paper_summary_zh": "語言作為高級生物創造的資訊媒介，其在大腦中如何表徵一直是神經科學關注的議題。\n由於神經影像、醫學技術、生命科學和人工智慧的快速進步，解碼誘發大腦中的語言表徵已展現突破性的成就。\n在這項工作中，我們提出了一種大腦到語言解碼的分類法，涵蓋文字和語音格式。\n這項工作整合了兩種研究類型：專注於語言理解的神經科學和基於深度學習的大腦解碼。\n從大腦活動中產生可辨識的語言資訊不僅可以幫助表達能力受限的人，特別是肌萎縮性脊髓側索硬化症 (ALS) 患者，還能為下一代腦電腦介面 (BCI) 開闢一條新路。\n這篇文章將幫助大腦科學家和深度學習研究人員對細緻的語言感知有一個全面的了解，進而促進他們進一步探討和研究神經過程和語言解碼。", "author": "Yu Wang et.al.", "authors": "Yu Wang, Heyang Liu, Yuhao Wang, Chuan Xuan, Yixuan Hou, Sheng Feng, Hongcheng Liu, Yusheng Liao, Yanfeng Wang", "id": "2407.20622v1", "paper_url": "http://arxiv.org/abs/2407.20622v1", "repo": "null"}}