{"2410.10290": {"publish_time": "2024-10-14", "title": "A Multi-Task Text Classification Pipeline with Natural Language Explanations: A User-Centric Evaluation in Sentiment Analysis and Offensive Language Identification in Greek Tweets", "paper_summary": "Interpretability is a topic that has been in the spotlight for the past few\nyears. Most existing interpretability techniques produce interpretations in the\nform of rules or feature importance. These interpretations, while informative,\nmay be harder to understand for non-expert users and therefore, cannot always\nbe considered as adequate explanations. To that end, explanations in natural\nlanguage are often preferred, as they are easier to comprehend and also more\npresentable to end-users. This work introduces an early concept for a novel\npipeline that can be used in text classification tasks, offering predictions\nand explanations in natural language. It comprises of two models: a classifier\nfor labelling the text and an explanation generator which provides the\nexplanation. The proposed pipeline can be adopted by any text classification\ntask, given that ground truth rationales are available to train the explanation\ngenerator. Our experiments are centred around the tasks of sentiment analysis\nand offensive language identification in Greek tweets, using a Greek Large\nLanguage Model (LLM) to obtain the necessary explanations that can act as\nrationales. The experimental evaluation was performed through a user study\nbased on three different metrics and achieved promising results for both\ndatasets.", "paper_summary_zh": "可解釋性是過去幾年備受關注的主題。大多數現有的可解釋性技術以規則或特徵重要性的形式產生解釋。這些解釋雖然具有資訊性，但對於非專家使用者來說可能較難理解，因此並不總是能被視為充分的解釋。為了解決這個問題，通常優先採用自然語言的解釋，因為它們更容易理解，而且對最終使用者來說也更易於呈現。這項工作介紹了一個新穎管線的早期概念，可用於文字分類任務，提供自然語言中的預測和解釋。它包含兩個模型：一個用於標記文字的分類器和一個提供解釋的解釋產生器。只要有基本原理可用於訓練解釋產生器，所提出的管線就可以被任何文字分類任務採用。我們的實驗主要集中在希臘推文的情緒分析和攻擊性語言識別任務，使用希臘大型語言模型 (LLM) 來取得必要的解釋，這些解釋可以作為基本原理。實驗評估是透過使用者研究進行，基於三個不同的指標，並針對兩個資料集獲得了有希望的結果。", "author": "Nikolaos Mylonas et.al.", "authors": "Nikolaos Mylonas, Nikolaos Stylianou, Theodora Tsikrika, Stefanos Vrochidis, Ioannis Kompatsiaris", "id": "2410.10290v1", "paper_url": "http://arxiv.org/abs/2410.10290v1", "repo": "null"}}