{"2412.19403": {"publish_time": "2024-12-27", "title": "Fully Data-driven but Interpretable Human Behavioural Modelling with Differentiable Discrete Choice Model", "paper_summary": "Discrete choice models are essential for modelling various decision-making\nprocesses in human behaviour. However, the specification of these models has\ndepended heavily on domain knowledge from experts, and the fully automated but\ninterpretable modelling of complex human behaviours has been a long-standing\nchallenge. In this paper, we introduce the differentiable discrete choice model\n(Diff-DCM), a fully data-driven method for the interpretable modelling,\nlearning, prediction, and control of complex human behaviours, which is\nrealised by differentiable programming. Solely from input features and choice\noutcomes without any prior knowledge, Diff-DCM can estimate interpretable\nclosed-form utility functions that reproduce observed behaviours. Comprehensive\nexperiments with both synthetic and real-world data demonstrate that Diff-DCM\ncan be applied to various types of data and requires only a small amount of\ncomputational resources for the estimations, which can be completed within tens\nof seconds on a laptop without any accelerators. In these experiments, we also\ndemonstrate that, using its differentiability, Diff-DCM can provide useful\ninsights into human behaviours, such as an optimal intervention path for\neffective behavioural changes. This study provides a strong basis for the fully\nautomated and reliable modelling, prediction, and control of human behaviours.", "paper_summary_zh": "離散選擇模型對於建模人類行為中各種決策制定過程至關重要。然而，這些模型的規範嚴重依賴於專家的領域知識，而複雜人類行為的完全自動化但可解釋建模一直是一個長期的挑戰。在本文中，我們介紹了可微分離散選擇模型 (Diff-DCM)，這是一種完全由數據驅動的方法，用於複雜人類行為的可解釋建模、學習、預測和控制，這是通過可微分程式實現的。僅從輸入特徵和選擇結果中，而無任何先驗知識，Diff-DCM 就可以估計可解釋的閉合形式效用函數，以重現觀察到的行為。使用合成和真實世界數據進行的綜合實驗表明，Diff-DCM 可以應用於各種類型的數據，並且只需要少量的計算資源進行估計，這些估計可以在沒有任何加速器的筆記型電腦上在幾十秒內完成。在這些實驗中，我們還證明了 Diff-DCM 利用其可微分性，可以提供對人類行為的有用見解，例如有效行為改變的最佳干預路徑。本研究為人類行為的完全自動化和可靠建模、預測和控制提供了堅實的基礎。", "author": "Fumiyasu Makinoshima et.al.", "authors": "Fumiyasu Makinoshima, Tatsuya Mitomi, Fumiya Makihara, Eigo Segawa", "id": "2412.19403v1", "paper_url": "http://arxiv.org/abs/2412.19403v1", "repo": "null"}}