{"2406.03730": {"publish_time": "2024-06-06", "title": "FastGAS: Fast Graph-based Annotation Selection for In-Context Learning", "paper_summary": "In-context learning (ICL) empowers large language models (LLMs) to tackle new\ntasks by using a series of training instances as prompts. Since generating the\nprompts needs to sample from a vast pool of instances and annotate them (e.g.,\nadd labels in classification task), existing methods have proposed to select a\nsubset of unlabeled examples for annotation, thus enhancing the quality of\nprompts and concurrently mitigating annotation costs. However, these methods\noften require a long time to select instances due to their complexity,\nhindering their practical viability. To address this limitation, we propose a\ngraph-based selection method, FastGAS, designed to efficiently identify\nhigh-quality instances while minimizing computational overhead. Initially, we\nconstruct a data similarity graph based on instance similarities. Subsequently,\nemploying a graph partitioning algorithm, we partition the graph into pieces.\nWithin each piece (i.e., subgraph), we adopt a greedy approach to pick the most\nrepresentative nodes. By aggregating nodes from diverse pieces and annotating\nthe corresponding instances, we identify a set of diverse and representative\ninstances for ICL. Compared to prior approaches, our method not only exhibits\nsuperior performance on different tasks but also significantly reduces\nselection time. In addition, we demonstrate the efficacy of our approach in\nLLMs of larger sizes.", "paper_summary_zh": "情境學習 (ICL) 賦能大型語言模型 (LLM) 使用一系列訓練實例作為提示來處理新任務。由於產生提示需要從大量的實例中抽樣並註解它們（例如，在分類任務中新增標籤），現有方法已提出選擇一個未標記範例的子集進行註解，從而提升提示的品質並同時降低註解成本。然而，這些方法由於其複雜性，通常需要很長的時間來選擇實例，阻礙了它們的實用性。為了解決這個限制，我們提出一個基於圖形的選擇方法 FastGAS，旨在有效地識別高品質實例，同時將運算開銷降到最低。最初，我們根據實例相似性建構一個資料相似性圖形。接著，採用圖形分割演算法，將圖形分割成多個部分。在每個部分（即子圖）中，我們採用貪婪法來挑選最具代表性的節點。透過彙總來自不同部分的節點並註解對應的實例，我們識別出一組多元且具代表性的實例，用於 ICL。與先前的做法相比，我們的做法不僅在不同的任務上展現出優異的效能，而且還大幅減少了選擇時間。此外，我們展示了我們的做法在更大規模的 LLM 中的效能。", "author": "Zihan Chen et.al.", "authors": "Zihan Chen, Song Wang, Cong Shen, Jundong Li", "id": "2406.03730v1", "paper_url": "http://arxiv.org/abs/2406.03730v1", "repo": "null"}}