{"2502.02367": {"publish_time": "2025-02-04", "title": "Field Matching: an Electrostatic Paradigm to Generate and Transfer Data", "paper_summary": "We propose Electrostatic Field Matching (EFM), a novel method that is\nsuitable for both generative modeling and distribution transfer tasks. Our\napproach is inspired by the physics of an electrical capacitor. We place source\nand target distributions on the capacitor plates and assign them positive and\nnegative charges, respectively. We then learn the electrostatic field of the\ncapacitor using a neural network approximator. To map the distributions to each\nother, we start at one plate of the capacitor and move the samples along the\nlearned electrostatic field lines until they reach the other plate. We\ntheoretically justify that this approach provably yields the distribution\ntransfer. In practice, we demonstrate the performance of our EFM in toy and\nimage data experiments.", "paper_summary_zh": "我們提出靜電場匹配 (EFM)，這是一種適用於生成模型和分佈轉移任務的新方法。我們的做法受到電容器物理學的啟發。我們將來源和目標分佈放置在電容器極板上，並分別為它們分配正電荷和負電荷。然後，我們使用神經網路逼近器來學習電容器的靜電場。為了將分佈彼此對應，我們從電容器的一個極板開始，並沿著學習到的靜電場線移動樣本，直到它們到達另一個極板。我們在理論上證明了這種方法可以證明地產生分佈轉移。在實務中，我們展示了我們的 EFM 在玩具和影像資料實驗中的效能。", "author": "Alexander Kolesov et.al.", "authors": "Alexander Kolesov, Manukhov Stepan, Vladimir V. Palyulin, Alexander Korotin", "id": "2502.02367v1", "paper_url": "http://arxiv.org/abs/2502.02367v1", "repo": "null"}}