{"2501.12775": {"publish_time": "2025-01-22", "title": "Regularization, Semi-supervision, and Supervision for a Plausible Attention-Based Explanation", "paper_summary": "Attention mechanism is contributing to the majority of recent advances in\nmachine learning for natural language processing. Additionally, it results in\nan attention map that shows the proportional influence of each input in its\ndecision. Empirical studies postulate that attention maps can be provided as an\nexplanation for model output. However, it is still questionable to ask whether\nthis explanation helps regular people to understand and accept the model output\n(the plausibility of the explanation). Recent studies show that attention\nweights in the RNN encoders are hardly plausible because they spread on input\ntokens. We thus propose 3 additional constraints to the learning objective\nfunction to improve the plausibility of the attention map: regularization to\nincrease the attention weight sparsity, semi-supervision to supervise the map\nby a heuristic and supervision by human annotation. Results show that all\ntechniques can improve the attention map plausibility at some level. We also\nobserve that specific instructions for human annotation might have a negative\neffect on classification performance. Beyond the attention map, the result of\nexperiments on text classification tasks also shows that no matter how the\nconstraint brings the gain, the contextualization layer plays a crucial role in\nfinding the right space for finding plausible tokens.", "paper_summary_zh": "注意力机制促成了自然語言處理機器學習最近的大部分進展。此外，它會產生一個注意力圖，顯示每個輸入在其決策中所佔的比例影響。實證研究假設注意力圖可以作為模型輸出的解釋。然而，是否這種解釋有助於一般人理解並接受模型輸出（解釋的合理性）仍有待商榷。最近的研究表明，RNN 編碼器中的注意力權重幾乎不合理，因為它們散佈在輸入符號上。因此，我們對學習目標函數提出了 3 個額外的約束，以提高注意力圖的合理性：正則化以增加注意力權重稀疏性、半監督以通過啟發式監督圖以及通過人工註解進行監督。結果表明，所有技術都可以在某種程度上提高注意力圖的合理性。我們還觀察到，人工註解的具體說明可能會對分類性能產生負面影響。除了注意力圖之外，文本分類任務的實驗結果還表明，無論約束如何帶來收益，情境化層在找到合理符號的正確空間中都發揮著至關重要的作用。", "author": "Duc Hau Nguyen et.al.", "authors": "Duc Hau Nguyen, Cyrielle Mallart, Guillaume Gravier, Pascale Sébillot", "id": "2501.12775v1", "paper_url": "http://arxiv.org/abs/2501.12775v1", "repo": "https://github.com/kihansi95/linkmedia_attentionplausibilitybyconstraint"}}