{"2407.09103": {"publish_time": "2024-07-12", "title": "DANIEL: A fast Document Attention Network for Information Extraction and Labelling of handwritten documents", "paper_summary": "Information extraction from handwritten documents involves traditionally\nthree distinct steps: Document Layout Analysis, Handwritten Text Recognition,\nand Named Entity Recognition. Recent approaches have attempted to integrate\nthese steps into a single process using fully end-to-end architectures. Despite\nthis, these integrated approaches have not yet matched the performance of\nlanguage models, when applied to information extraction in plain text. In this\npaper, we introduce DANIEL (Document Attention Network for Information\nExtraction and Labelling), a fully end-to-end architecture integrating a\nlanguage model and designed for comprehensive handwritten document\nunderstanding. DANIEL performs layout recognition, handwriting recognition, and\nnamed entity recognition on full-page documents. Moreover, it can\nsimultaneously learn across multiple languages, layouts, and tasks. For named\nentity recognition, the ontology to be applied can be specified via the input\nprompt. The architecture employs a convolutional encoder capable of processing\nimages of any size without resizing, paired with an autoregressive decoder\nbased on a transformer-based language model. DANIEL achieves competitive\nresults on four datasets, including a new state-of-the-art performance on RIMES\n2009 and M-POPP for Handwriting Text Recognition, and IAM NER for Named Entity\nRecognition. Furthermore, DANIEL is much faster than existing approaches.\n  We provide the source code and the weights of the trained models at\n\\url{https://github.com/Shulk97/daniel}.", "paper_summary_zh": "手寫文件中的資訊萃取傳統上包含三個不同的步驟：文件版面分析、手寫文字辨識和命名實體辨識。最近的方法已嘗試使用完全端到端架構將這些步驟整合到單一流程中。儘管如此，這些整合方法在應用於純文字資訊萃取時，仍無法與語言模型的效能相匹配。在本文中，我們介紹了 DANIEL（資訊萃取和標籤的文件注意力網路），這是一種完全端到端的架構，整合了語言模型，並設計用於全面理解手寫文件。DANIEL 對全頁文件執行版面辨識、手寫辨識和命名實體辨識。此外，它可以同時學習多種語言、版面和任務。對於命名實體辨識，可透過輸入提示指定要套用的本体。該架構採用一個卷積編碼器，能夠處理任何大小的影像而不需調整大小，並搭配一個基於Transformer語言模型的自迴歸解碼器。DANIEL 在四個資料集上取得了有競爭力的結果，包括在 RIMES 2009 和 M-POPP 上的手寫文字辨識的最新技術，以及在 IAM NER 上的命名實體辨識。此外，DANIEL 比現有方法快很多。我們在 \\url{https://github.com/Shulk97/daniel} 提供訓練模型的原始碼和權重。", "author": "Thomas Constum et.al.", "authors": "Thomas Constum, Pierrick Tranouez, Thierry Paquet", "id": "2407.09103v1", "paper_url": "http://arxiv.org/abs/2407.09103v1", "repo": "https://github.com/shulk97/daniel"}}