{"2405.20131": {"publish_time": "2024-05-30", "title": "Language Models Need Inductive Biases to Count Inductively", "paper_summary": "Counting is a fundamental example of generalization, whether viewed through\nthe mathematical lens of Peano's axioms defining the natural numbers or the\ncognitive science literature for children learning to count. The argument holds\nfor both cases that learning to count means learning to count infinitely. While\nfew papers have tried to distill transformer \"reasoning\" to the simplest case\nof counting, investigating length generalization does occur throughout the\nliterature. In the \"train short, test long\" paradigm of NLP, length refers to\nthe training sentence length. In formal language recognition, length refers to\nthe input sequence length, or the maximum stack size induced by a pushdown\nautomata. In general problem solving, length refers to the number of hops in a\ndeductive reasoning chain or the recursion depth. For all cases, counting is\ncentral to task success. And crucially, generalizing counting inductively is\ncentral to success on OOD instances. This work provides extensive empirical\nresults on training language models to count. We experiment with architectures\nranging from RNNs, Transformers, State-Space Models and RWKV. We present\ncarefully-designed task formats, auxiliary tasks and positional embeddings to\navoid limitations in generalization with OOD-position and OOD-vocabulary. We\nfind that while traditional RNNs trivially achieve inductive counting,\nTransformers have to rely on positional embeddings to count out-of-domain. As\ncounting is the basis for many arguments concerning the expressivity of\nTransformers, our finding calls for the community to reexamine the application\nscope of primitive functions defined in formal characterizations. Finally,\nmodern RNNs also largely underperform traditional RNNs in generalizing counting\ninductively. We discuss how design choices that enable parallelized training of\nmodern RNNs cause them to lose merits of a recurrent nature.", "paper_summary_zh": "<paragraph>無論是從定義自然數的皮亞諾公理的數學角度來看，還是從兒童學習數數的認知科學文獻來看，數數都是概括化的基本範例。這兩方面的論點都認為，學習數數意味著學習無限數數。儘管很少有論文試圖將Transformer的「推理」簡化為最簡單的數數案例，但在整個文獻中確實會探討長度概括化。在 NLP 的「短訓練，長測試」範例中，長度是指訓練句子的長度。在形式語言識別中，長度是指輸入序列的長度，或由下推自動機產生的最大堆疊大小。在一般問題解決中，長度是指演繹推理鏈中的跳躍次數或遞迴深度。對於所有情況，數數對於任務成功至關重要。而且至關重要的是，歸納概括數數對於 OOD 實例的成功至關重要。這項工作提供了廣泛的實證結果，說明訓練語言模型進行數數。我們實驗了從 RNN、Transformer、狀態空間模型和 RWKV 等架構。我們提出了精心設計的任務格式、輔助任務和位置嵌入，以避免在 OOD 位置和 OOD 詞彙中概括的限制。我們發現，雖然傳統的 RNN 可以輕而易舉地實現歸納數數，但Transformer必須依賴位置嵌入才能進行域外數數。由於數數是許多關於Transformer表達能力的論點的基礎，我們的發現要求社群重新審視形式表徵中定義的原始函數的應用範圍。最後，現代 RNN 在歸納概括數數方面也遠遠不如傳統 RNN。我們討論了使現代 RNN 能夠進行並行訓練的設計選擇如何導致它們失去遞迴特性的優點。</paragraph>", "author": "Yingshan Chang et.al.", "authors": "Yingshan Chang, Yonatan Bisk", "id": "2405.20131v1", "paper_url": "http://arxiv.org/abs/2405.20131v1", "repo": "https://github.com/zdxdsw/inductive_counting_with_lms"}}