{"2406.12550": {"publish_time": "2024-06-18", "title": "Offline Imitation Learning with Model-based Reverse Augmentation", "paper_summary": "In offline Imitation Learning (IL), one of the main challenges is the\n\\textit{covariate shift} between the expert observations and the actual\ndistribution encountered by the agent, because it is difficult to determine\nwhat action an agent should take when outside the state distribution of the\nexpert demonstrations. Recently, the model-free solutions introduce the\nsupplementary data and identify the latent expert-similar samples to augment\nthe reliable samples during learning. Model-based solutions build forward\ndynamic models with conservatism quantification and then generate additional\ntrajectories in the neighborhood of expert demonstrations. However, without\nreward supervision, these methods are often over-conservative in the\nout-of-expert-support regions, because only in states close to expert-observed\nstates can there be a preferred action enabling policy optimization. To\nencourage more exploration on expert-unobserved states, we propose a novel\nmodel-based framework, called offline Imitation Learning with Self-paced\nReverse Augmentation (SRA). Specifically, we build a reverse dynamic model from\nthe offline demonstrations, which can efficiently generate trajectories leading\nto the expert-observed states in a self-paced style. Then, we use the\nsubsequent reinforcement learning method to learn from the augmented\ntrajectories and transit from expert-unobserved states to expert-observed\nstates. This framework not only explores the expert-unobserved states but also\nguides maximizing long-term returns on these states, ultimately enabling\ngeneralization beyond the expert data. Empirical results show that our proposal\ncould effectively mitigate the covariate shift and achieve the state-of-the-art\nperformance on the offline imitation learning benchmarks. Project website:\n\\url{https://www.lamda.nju.edu.cn/shaojj/KDD24_SRA/}.", "paper_summary_zh": "<paragraph>在離線模仿學習（IL）中，主要挑戰之一是專家觀察與代理遭遇的實際分佈之間的「協變數位移」，因為難以判斷代理在專家示範狀態分佈之外時應採取什麼行動。最近，無模型的解決方案引入了補充資料，並識別出潛在的類似專家的樣本，以在學習期間增加可靠的樣本。基於模型的解決方案建立了具有保守量化的前向動態模型，然後在專家示範的鄰域中產生額外的軌跡。然而，在沒有獎勵監督的情況下，這些方法在專家支援區域之外通常過於保守，因為只有在接近專家觀察狀態的狀態中，才會有首選動作能進行策略最佳化。為了鼓勵在專家未觀察到的狀態中進行更多探索，我們提出了一個新的基於模型的框架，稱為具有自定進度反向擴充（SRA）的離線模仿學習。具體來說，我們從離線示範中建立一個反向動態模型，它可以有效地產生以自定進度方式導致專家觀察狀態的軌跡。然後，我們使用後續的強化學習方法從擴充的軌跡中學習，並從專家未觀察到的狀態過渡到專家觀察到的狀態。此框架不僅探索了專家未觀察到的狀態，還指導最大化這些狀態的長期回報，最終實現超越專家資料的概括。實證結果表明，我們的提案可以有效減輕協變數位移，並在離線模仿學習基準上實現最先進的效能。專案網站：\\url{https://www.lamda.nju.edu.cn/shaojj/KDD24_SRA/}。</paragraph>", "author": "Jie-Jing Shao et.al.", "authors": "Jie-Jing Shao, Hao-Sen Shi, Lan-Zhe Guo, Yu-Feng Li", "id": "2406.12550v1", "paper_url": "http://arxiv.org/abs/2406.12550v1", "repo": "null"}}