{"2410.02596": {"publish_time": "2024-10-03", "title": "Beyond Squared Error: Exploring Loss Design for Enhanced Training of Generative Flow Networks", "paper_summary": "Generative Flow Networks (GFlowNets) are a novel class of generative models\ndesigned to sample from unnormalized distributions and have found applications\nin various important tasks, attracting great research interest in their\ntraining algorithms. In general, GFlowNets are trained by fitting the forward\nflow to the backward flow on sampled training objects. Prior work focused on\nthe choice of training objects, parameterizations, sampling and resampling\nstrategies, and backward policies, aiming to enhance credit assignment,\nexploration, or exploitation of the training process. However, the choice of\nregression loss, which can highly influence the exploration and exploitation\nbehavior of the under-training policy, has been overlooked. Due to the lack of\ntheoretical understanding for choosing an appropriate regression loss, most\nexisting algorithms train the flow network by minimizing the squared error of\nthe forward and backward flows in log-space, i.e., using the quadratic\nregression loss. In this work, we rigorously prove that distinct regression\nlosses correspond to specific divergence measures, enabling us to design and\nanalyze regression losses according to the desired properties of the\ncorresponding divergence measures. Specifically, we examine two key properties:\nzero-forcing and zero-avoiding, where the former promotes exploitation and\nhigher rewards, and the latter encourages exploration and enhances diversity.\nBased on our theoretical framework, we propose three novel regression losses,\nnamely, Shifted-Cosh, Linex(1/2), and Linex(1). We evaluate them across three\nbenchmarks: hyper-grid, bit-sequence generation, and molecule generation. Our\nproposed losses are compatible with most existing training algorithms, and\nsignificantly improve the performances of the algorithms concerning convergence\nspeed, sample diversity, and robustness.", "paper_summary_zh": "生成流網路 (GFlowNets) 是一種新穎的生成模型類別，\n旨在從未正規化的分佈中進行取樣，並已在各種重要任務中找到應用，\n在他們的訓練演算法中吸引了極大的研究興趣。一般來說，GFlowNets 是透過將正向流與取樣訓練物件上的反向流相擬合來訓練的。先前的研究專注於訓練物件、參數化、取樣和再取樣策略以及反向策略的選擇，旨在增強訓練過程的信用分配、探索或利用。然而，回歸損失的選擇可能會高度影響受訓練策略的探索和利用行為，而這點已被忽略。由於缺乏選擇適當回歸損失的理論理解，大多數現有演算法透過最小化對數空間中正向和反向流的平方誤差來訓練流網路，即使用二次回歸損失。在這項工作中，我們嚴謹地證明了不同的回歸損失對應於特定的距離測度，使我們能夠根據對應距離測度的所需特性來設計和分析回歸損失。具體來說，我們檢查了兩個關鍵特性：零強制和零避免，其中前者促進利用和更高的回報，而後者鼓勵探索並增強多樣性。基於我們的理論框架，我們提出了三種新穎的回歸損失，即 Shifted-Cosh、Linex(1/2) 和 Linex(1)。我們在三個基準上對它們進行評估：超網格、位元序列生成和分子生成。我們提出的損失與大多數現有的訓練演算法相容，並且顯著改善了演算法在收斂速度、樣本多樣性和穩健性方面的效能。", "author": "Rui Hu et.al.", "authors": "Rui Hu, Yifan Zhang, Zhuoran Li, Longbo Huang", "id": "2410.02596v1", "paper_url": "http://arxiv.org/abs/2410.02596v1", "repo": "null"}}