{"2408.02290": {"publish_time": "2024-08-05", "title": "Decoupled Vocabulary Learning Enables Zero-Shot Translation from Unseen Languages", "paper_summary": "Multilingual neural machine translation systems learn to map sentences of\ndifferent languages into a common representation space. Intuitively, with a\ngrowing number of seen languages the encoder sentence representation grows more\nflexible and easily adaptable to new languages. In this work, we test this\nhypothesis by zero-shot translating from unseen languages. To deal with unknown\nvocabularies from unknown languages we propose a setup where we decouple\nlearning of vocabulary and syntax, i.e. for each language we learn word\nrepresentations in a separate step (using cross-lingual word embeddings), and\nthen train to translate while keeping those word representations frozen. We\ndemonstrate that this setup enables zero-shot translation from entirely unseen\nlanguages. Zero-shot translating with a model trained on Germanic and Romance\nlanguages we achieve scores of 42.6 BLEU for Portuguese-English and 20.7 BLEU\nfor Russian-English on TED domain. We explore how this zero-shot translation\ncapability develops with varying number of languages seen by the encoder.\nLastly, we explore the effectiveness of our decoupled learning strategy for\nunsupervised machine translation. By exploiting our model's zero-shot\ntranslation capability for iterative back-translation we attain near parity\nwith a supervised setting.", "paper_summary_zh": "多語言神經機器翻譯系統會學習將不同語言的句子對應到一個共同的表示空間中。直覺上，隨著所見語言數量的增加，編碼器句子表示會變得更靈活，且更容易適應新的語言。在這項研究中，我們透過從未見過的語言進行零次學習翻譯來測試這個假設。為了處理來自未知語言的未知詞彙，我們提出一個設定，其中我們將詞彙和語法的學習分開，也就是說，對於每種語言，我們在一個獨立的步驟中學習詞彙表示（使用跨語言詞彙嵌入），然後在保持這些詞彙表示凍結的狀態下進行翻譯訓練。我們展示這個設定能從完全未見過的語言進行零次學習翻譯。使用在日耳曼語和羅曼語上訓練的模型進行零次學習翻譯，我們在 TED 領域上獲得了葡萄牙語到英語的 42.6 BLEU 分數，以及俄語到英語的 20.7 BLEU 分數。我們探討了這個零次學習翻譯能力如何隨著編碼器所見語言數量的變化而發展。最後，我們探討了我們解耦學習策略對於無監督機器翻譯的有效性。透過利用我們模型的零次學習翻譯能力進行反覆回譯，我們在監督式設定中獲得了接近相等的效果。", "author": "Carlos Mullov et.al.", "authors": "Carlos Mullov, Ngoc-Quan Pham, Alexander Waibel", "id": "2408.02290v1", "paper_url": "http://arxiv.org/abs/2408.02290v1", "repo": "null"}}