{"2501.06826": {"publish_time": "2025-01-12", "title": "Correcting Annotator Bias in Training Data: Population-Aligned Instance Replication (PAIR)", "paper_summary": "Models trained on crowdsourced labels may not reflect broader population\nviews when annotator pools are not representative. Since collecting\nrepresentative labels is challenging, we propose Population-Aligned Instance\nReplication (PAIR), a method to address this bias through statistical\nadjustment. Using a simulation study of hate speech and offensive language\ndetection, we create two types of annotators with different labeling tendencies\nand generate datasets with varying proportions of the types. Models trained on\nunbalanced annotator pools show poor calibration compared to those trained on\nrepresentative data. However, PAIR, which duplicates labels from\nunderrepresented annotator groups to match population proportions,\nsignificantly reduces bias without requiring new data collection. These results\nsuggest statistical techniques from survey research can help align model\ntraining with target populations even when representative annotator pools are\nunavailable. We conclude with three practical recommendations for improving\ntraining data quality.", "paper_summary_zh": "由群眾外包標籤訓練的模型可能無法反映更廣泛的人口觀點，因為註解者群體並非具有代表性。由於收集具有代表性的標籤具有挑戰性，我們提出了人口對齊實例複製 (PAIR)，這是一種透過統計調整來解決此偏差的方法。使用仇恨言論和攻擊性語言偵測的模擬研究，我們建立了兩種具有不同標籤傾向的註解者，並產生具有不同比例類型的資料集。在不平衡的註解者群體上訓練的模型與在具有代表性的資料上訓練的模型相比，顯示出較差的校準。然而，PAIR 從代表性不足的註解者群組複製標籤以匹配人口比例，大幅減少了偏差，而不需要收集新的資料。這些結果表明，來自調查研究的統計技術有助於將模型訓練與目標人口對齊，即使無法取得具有代表性的註解者群體。我們總結了三項改善訓練資料品質的實用建議。", "author": "Stephanie Eckman et.al.", "authors": "Stephanie Eckman, Bolei Ma, Christoph Kern, Rob Chew, Barbara Plank, Frauke Kreuter", "id": "2501.06826v1", "paper_url": "http://arxiv.org/abs/2501.06826v1", "repo": "null"}}