{"2406.14563": {"publish_time": "2024-06-20", "title": "Model Merging and Safety Alignment: One Bad Model Spoils the Bunch", "paper_summary": "Merging Large Language Models (LLMs) is a cost-effective technique for\ncombining multiple expert LLMs into a single versatile model, retaining the\nexpertise of the original ones. However, current approaches often overlook the\nimportance of safety alignment during merging, leading to highly misaligned\nmodels. This work investigates the effects of model merging on alignment. We\nevaluate several popular model merging techniques, demonstrating that existing\nmethods do not only transfer domain expertise but also propagate misalignment.\nWe propose a simple two-step approach to address this problem: (i) generating\nsynthetic safety and domain-specific data, and (ii) incorporating these\ngenerated data into the optimization process of existing data-aware model\nmerging techniques. This allows us to treat alignment as a skill that can be\nmaximized in the resulting merged LLM. Our experiments illustrate the\neffectiveness of integrating alignment-related data during merging, resulting\nin models that excel in both domain expertise and alignment.", "paper_summary_zh": "大型語言模型 (LLM) 合併是一種經濟實惠的技術，可將多個專家級 LLM 合併成一個用途廣泛的模型，同時保留原始模型的專業知識。然而，目前的做法通常忽略合併期間安全比對的重要性，導致模型高度失準。這項工作探討了模型合併對比對的影響。我們評估了幾種流行的模型合併技術，證明現有方法不僅會傳遞領域專業知識，還會傳播失準。我們提出了一個簡單的兩步驟方法來解決這個問題：(i) 生成合成安全和特定領域的數據，以及 (ii) 將這些生成的數據納入現有的數據感知模型合併技術的最佳化過程中。這讓我們可以將比對視為一種可以在合併後的 LLM 中最大化的技能。我們的實驗說明了在合併過程中整合與比對相關的數據的有效性，從而產生在領域專業知識和比對方面都表現出色的模型。", "author": "Hasan Abed Al Kader Hammoud et.al.", "authors": "Hasan Abed Al Kader Hammoud, Umberto Michieli, Fabio Pizzati, Philip Torr, Adel Bibi, Bernard Ghanem, Mete Ozay", "id": "2406.14563v1", "paper_url": "http://arxiv.org/abs/2406.14563v1", "repo": "null"}}