{"2407.02099": {"publish_time": "2024-07-02", "title": "Helpful assistant or fruitful facilitator? Investigating how personas affect language model behavior", "paper_summary": "One way to personalize and steer generations from large language models (LLM)\nis to assign a persona: a role that describes how the user expects the LLM to\nbehave (e.g., a helpful assistant, a teacher, a woman). This paper investigates\nhow personas affect diverse aspects of model behavior. We assign to seven LLMs\n162 personas from 12 categories spanning variables like gender, sexual\norientation, and occupation. We prompt them to answer questions from five\ndatasets covering objective (e.g., questions about math and history) and\nsubjective tasks (e.g., questions about beliefs and values). We also compare\npersona's generations to two baseline settings: a control persona setting with\n30 paraphrases of \"a helpful assistant\" to control for models' prompt\nsensitivity, and an empty persona setting where no persona is assigned. We find\nthat for all models and datasets, personas show greater variability than the\ncontrol setting and that some measures of persona behavior generalize across\nmodels.", "paper_summary_zh": "一種從大型語言模型 (LLM) 中個人化和引導世代的方法是指定一個角色：一個描述使用者期望 LLM 如何表現的角色（例如，一個有用的助理、一個老師、一個女人）。這篇論文探討角色如何影響模型行為的不同面向。我們將 162 個來自 12 個類別的角色分配給七個 LLM，這些類別涵蓋性別、性取向和職業等變數。我們提示他們回答來自五個資料集的問題，這些資料集涵蓋客觀（例如，關於數學和歷史的問題）和主觀任務（例如，關於信念和價值觀的問題）。我們還將角色的世代與兩個基準設定進行比較：一個控制角色設定，其中包含 30 個「一個有用的助理」的改述，以控制模型提示的敏感性，以及一個未指定角色的空角色設定。我們發現，對於所有模型和資料集，角色顯示出的變異性都比控制設定大，並且某些角色行為的測量值會概括到所有模型。", "author": "Pedro Henrique Luz de Araujo et.al.", "authors": "Pedro Henrique Luz de Araujo, Benjamin Roth", "id": "2407.02099v1", "paper_url": "http://arxiv.org/abs/2407.02099v1", "repo": "null"}}