{"2411.10843": {"publish_time": "2024-11-16", "title": "A Novel Adaptive Hybrid Focal-Entropy Loss for Enhancing Diabetic Retinopathy Detection Using Convolutional Neural Networks", "paper_summary": "Diabetic retinopathy is a leading cause of blindness around the world and\ndemands precise AI-based diagnostic tools. Traditional loss functions in\nmulti-class classification, such as Categorical Cross-Entropy (CCE), are very\ncommon but break down with class imbalance, especially in cases with inherently\nchallenging or overlapping classes, which leads to biased and less sensitive\nmodels. Since a heavy imbalance exists in the number of examples for higher\nseverity stage 4 diabetic retinopathy, etc., classes compared to those very\nearly stages like class 0, achieving class balance is key. For this purpose, we\npropose the Adaptive Hybrid Focal-Entropy Loss which combines the ideas of\nfocal loss and entropy loss with adaptive weighting in order to focus on\nminority classes and highlight the challenging samples. The state-of-the art\nmodels applied for diabetic retinopathy detection with AHFE revealed good\nperformance improvements, indicating the top performances of ResNet50 at\n99.79%, DenseNet121 at 98.86%, Xception at 98.92%, MobileNetV2 at 97.84%, and\nInceptionV3 at 93.62% accuracy. This sheds light into how AHFE promotes\nenhancement in AI-driven diagnostics for complex and imbalanced medical\ndatasets.", "paper_summary_zh": "糖尿病視網膜病變是全球失明的主要原因，需要精準的 AI 診斷工具。多類別分類中的傳統損失函數，例如分類交叉熵 (CCE)，非常常見，但會隨著類別失衡而失效，特別是在類別本身具有挑戰性或重疊的情況下，這會導致有偏差且不敏感的模型。由於嚴重度較高的第 4 期糖尿病視網膜病變等類別的範例數量嚴重失衡，與第 0 期等非常早期的類別相比，達成類別平衡至關重要。為此，我們提出自適應混合焦點熵損失，它結合了焦點損失和熵損失的概念，並採用自適應加權，以專注於少數類別並突顯具有挑戰性的範例。應用於糖尿病視網膜病變偵測的最新模型搭配 AHFE，顯示出良好的效能提升，表示 ResNet50 的最高效能為 99.79%、DenseNet121 為 98.86%、Xception 為 98.92%、MobileNetV2 為 97.84%，以及 InceptionV3 的準確度為 93.62%。這揭示了 AHFE 如何促進以 AI 為主的診斷，以應對複雜且不平衡的醫療資料集。", "author": "Pandiyaraju V et.al.", "authors": "Pandiyaraju V, Santhosh Malarvannan, Shravan Venkatraman, Abeshek A, Priyadarshini B, Kannan A", "id": "2411.10843v1", "paper_url": "http://arxiv.org/abs/2411.10843v1", "repo": "null"}}