{"2411.17041": {"publish_time": "2024-11-26", "title": "Free$^2$Guide: Gradient-Free Path Integral Control for Enhancing Text-to-Video Generation with Large Vision-Language Models", "paper_summary": "Diffusion models have achieved impressive results in generative tasks like\ntext-to-image (T2I) and text-to-video (T2V) synthesis. However, achieving\naccurate text alignment in T2V generation remains challenging due to the\ncomplex temporal dependency across frames. Existing reinforcement learning\n(RL)-based approaches to enhance text alignment often require differentiable\nreward functions or are constrained to limited prompts, hindering their\nscalability and applicability. In this paper, we propose Free$^2$Guide, a novel\ngradient-free framework for aligning generated videos with text prompts without\nrequiring additional model training. Leveraging principles from path integral\ncontrol, Free$^2$Guide approximates guidance for diffusion models using\nnon-differentiable reward functions, thereby enabling the integration of\npowerful black-box Large Vision-Language Models (LVLMs) as reward model.\nAdditionally, our framework supports the flexible ensembling of multiple reward\nmodels, including large-scale image-based models, to synergistically enhance\nalignment without incurring substantial computational overhead. We demonstrate\nthat Free$^2$Guide significantly improves text alignment across various\ndimensions and enhances the overall quality of generated videos.", "paper_summary_zh": "擴散模型在生成式任務中取得了令人印象深刻的成果，例如文字轉圖像 (T2I) 和文字轉影片 (T2V) 合成。然而，由於跨幀的複雜時間依賴性，在 T2V 生成中實現精確的文字對齊仍然具有挑戰性。現有的強化學習 (RL) 方法來增強文字對齊通常需要可微分的回饋函數，或受到提示限制，這阻礙了它們的可擴展性和適用性。在本文中，我們提出了 Free$^2$Guide，這是一個新穎的無梯度框架，用於將生成的影片與文字提示對齊，而不需要額外的模型訓練。利用路徑積分控制的原理，Free$^2$Guide 使用不可微分的回饋函數近似擴散模型的引導，從而能夠整合強大的黑盒大型視覺語言模型 (LVLMs) 作為回饋模型。此外，我們的框架支援多個回饋模型的彈性集成，包括大型基於影像的模型，以協同增強對齊，而不會造成大量的運算負擔。我們展示了 Free$^2$Guide 在各種維度上顯著改善了文字對齊，並提升了生成影片的整體品質。", "author": "Jaemin Kim et.al.", "authors": "Jaemin Kim, Bryan S Kim, Jong Chul Ye", "id": "2411.17041v1", "paper_url": "http://arxiv.org/abs/2411.17041v1", "repo": "null"}}