{"2412.17747": {"publish_time": "2024-12-23", "title": "Deliberation in Latent Space via Differentiable Cache Augmentation", "paper_summary": "Techniques enabling large language models (LLMs) to \"think more\" by\ngenerating and attending to intermediate reasoning steps have shown promise in\nsolving complex problems. However, the standard approaches generate sequences\nof discrete tokens immediately before responding, and so they can incur\nsignificant latency costs and be challenging to optimize. In this work, we\ndemonstrate that a frozen LLM can be augmented with an offline coprocessor that\noperates on the model's key-value (kv) cache. This coprocessor augments the\ncache with a set of latent embeddings designed to improve the fidelity of\nsubsequent decoding. We train this coprocessor using the language modeling loss\nfrom the decoder on standard pretraining data, while keeping the decoder itself\nfrozen. This approach enables the model to learn, in an end-to-end\ndifferentiable fashion, how to distill additional computation into its\nkv-cache. Because the decoder remains unchanged, the coprocessor can operate\noffline and asynchronously, and the language model can function normally if the\ncoprocessor is unavailable or if a given cache is deemed not to require extra\ncomputation. We show experimentally that when a cache is augmented, the decoder\nachieves lower perplexity on numerous subsequent tokens. Furthermore, even\nwithout any task-specific training, our experiments demonstrate that cache\naugmentation consistently reduces perplexity and improves performance across a\nrange of reasoning-intensive tasks.", "paper_summary_zh": "大型語言模型 (LLM) 能夠透過產生和關注中間推理步驟來「更深入思考」的技術已在解決複雜問題方面展現前景。然而，標準方法會在回應前立即產生離散符號的序列，因此可能會產生顯著的延遲成本，且難以最佳化。在這項工作中，我們證明了一個凍結的 LLM 可以透過一個離線協同處理器進行擴充，該協同處理器在模型的快取值 (kv) 快取中執行。此協同處理器會針對快取進行擴充，加入一組潛在嵌入，以提升後續解碼的保真度。我們使用解碼器中來自標準預訓練資料的語言模型損失訓練此協同處理器，同時保持解碼器本身處於凍結狀態。此方法讓模型能夠以端到端可微分的方式學習，如何將額外的運算納入其 kv 快取中。由於解碼器保持不變，因此協同處理器可以在離線和非同步的情況下執行，且如果協同處理器不可用或某個快取被認為不需要額外運算，語言模型可以正常運作。我們透過實驗證明，當快取經過擴充時，解碼器在後續的許多符號上都能達到較低的困惑度。此外，我們的實驗證明，即使沒有任何特定任務的訓練，快取擴充都能持續降低困惑度，並提升各種推理密集型任務的效能。", "author": "Luyang Liu et.al.", "authors": "Luyang Liu, Jonas Pfeiffer, Jiaxing Wu, Jun Xie, Arthur Szlam", "id": "2412.17747v1", "paper_url": "http://arxiv.org/abs/2412.17747v1", "repo": "null"}}