{"2410.21256": {"publish_time": "2024-10-28", "title": "Multi-modal AI for comprehensive breast cancer prognostication", "paper_summary": "Treatment selection in breast cancer is guided by molecular subtypes and\nclinical characteristics. Recurrence risk assessment plays a crucial role in\npersonalizing treatment. Current methods, including genomic assays, have\nlimited accuracy and clinical utility, leading to suboptimal decisions for many\npatients. We developed a test for breast cancer patient stratification based on\ndigital pathology and clinical characteristics using novel AI methods.\nSpecifically, we utilized a vision transformer-based pan-cancer foundation\nmodel trained with self-supervised learning to extract features from digitized\nH&E-stained slides. These features were integrated with clinical data to form a\nmulti-modal AI test predicting cancer recurrence and death. The test was\ndeveloped and evaluated using data from a total of 8,161 breast cancer patients\nacross 15 cohorts originating from seven countries. Of these, 3,502 patients\nfrom five cohorts were used exclusively for evaluation, while the remaining\npatients were used for training. Our test accurately predicted our primary\nendpoint, disease-free interval, in the five external cohorts (C-index: 0.71\n[0.68-0.75], HR: 3.63 [3.02-4.37, p<0.01]). In a direct comparison (N=858), the\nAI test was more accurate than Oncotype DX, the standard-of-care 21-gene assay,\nwith a C-index of 0.67 [0.61-0.74] versus 0.61 [0.49-0.73], respectively.\nAdditionally, the AI test added independent information to Oncotype DX in a\nmultivariate analysis (HR: 3.11 [1.91-5.09, p<0.01)]). The test demonstrated\nrobust accuracy across all major breast cancer subtypes, including TNBC\n(C-index: 0.71 [0.62-0.81], HR: 3.81 [2.35-6.17, p=0.02]), where no diagnostic\ntools are currently recommended by clinical guidelines. These results suggest\nthat our AI test can improve accuracy, extend applicability to a wider range of\npatients, and enhance access to treatment selection tools.", "paper_summary_zh": "<paragraph>乳癌的治療選擇是由分子亞型和臨床特徵所引導。復發風險評估在個人化治療中扮演至關重要的角色。目前的技術，包括基因體分析，具有有限的準確度和臨床效用，導致許多患者的治療決策次於最佳。我們開發了一種基於數位病理學和臨床特徵的乳癌患者分層檢測，採用新穎的人工智慧方法。具體來說，我們利用了一個基於視覺轉換器的泛癌基礎模型，並透過自我監督學習進行訓練，以從數位化的 H&E 染色玻片中提取特徵。這些特徵與臨床資料整合，形成一個多模式的人工智慧檢測，用於預測癌症復發和死亡。該檢測的開發和評估使用了來自七個國家/地區的 15 個群組共 8,161 名乳癌患者的資料。其中，來自五個群組的 3,502 名患者專門用於評估，而其餘患者則用於訓練。我們的檢測準確地預測了我們的主要終點，即五個外部群組的無疾病間期（C 指數：0.71 [0.68-0.75]，HR：3.63 [3.02-4.37，p<0.01]）。在直接比較（N=858）中，人工智慧檢測比安科泰Dx，標準照護的 21 基因檢測更準確，C 指數分別為 0.67 [0.61-0.74] 和 0.61 [0.49-0.73]。此外，人工智慧檢測在多變量分析中增加了安科泰 Dx 的獨立資訊（HR：3.11 [1.91-5.09，p<0.01]）。該檢測在所有主要的乳癌亞型中都表現出強大的準確度，包括 TNBC（C 指數：0.71 [0.62-0.81]，HR：3.81 [2.35-6.17，p=0.02]），臨床指南目前不建議使用任何診斷工具。這些結果表明，我們的人工智慧檢測可以提高準確度，將適用範圍擴展到更多患者，並增加獲得治療選擇工具的機會。</paragraph>", "author": "Jan Witowski et.al.", "authors": "Jan Witowski, Ken Zeng, Joseph Cappadona, Jailan Elayoubi, Elena Diana Chiru, Nancy Chan, Young-Joon Kang, Frederick Howard, Irina Ostrovnaya, Carlos Fernandez-Granda, Freya Schnabel, Ugur Ozerdem, Kangning Liu, Zoe Steinsnyder, Nitya Thakore, Mohammad Sadic, Frank Yeung, Elisa Liu, Theodore Hill, Benjamin Swett, Danielle Rigau, Andrew Clayburn, Valerie Speirs, Marcus Vetter, Lina Sojak, Simone Muenst Soysal, Daniel Baumhoer, Khalil Choucair, Yu Zong, Lina Daoud, Anas Saad, Waleed Abdulsattar, Rafic Beydoun, Jia-Wern Pan, Haslina Makmur, Soo-Hwang Teo, Linda Ma Pak, Victor Angel, Dovile Zilenaite-Petrulaitiene, Arvydas Laurinavicius, Natalie Klar, Brian D. Piening, Carlo Bifulco, Sun-Young Jun, Jae Pak Yi, Su Hyun Lim, Adam Brufsky, Francisco J. Esteva, Lajos Pusztai, Yann LeCun, Krzysztof J. Geras", "id": "2410.21256v1", "paper_url": "http://arxiv.org/abs/2410.21256v1", "repo": "null"}}