{"2501.12776": {"publish_time": "2025-01-22", "title": "Data re-uploading in Quantum Machine Learning for time series: application to traffic forecasting", "paper_summary": "Accurate traffic forecasting plays a crucial role in modern Intelligent\nTransportation Systems (ITS), as it enables real-time traffic flow management,\nreduces congestion, and improves the overall efficiency of urban transportation\nnetworks. With the rise of Quantum Machine Learning (QML), it has emerged a new\nparadigm possessing the potential to enhance predictive capabilities beyond\nwhat classical machine learning models can achieve. In the present work we\npursue a heuristic approach to explore the potential of QML, and focus on a\nspecific transport issue. In particular, as a case study we investigate a\ntraffic forecast task for a major urban area in Athens (Greece), for which we\npossess high-resolution data. In this endeavor we explore the application of\nQuantum Neural Networks (QNN), and, notably, we present the first application\nof quantum data re-uploading in the context of transport forecasting. This\ntechnique allows quantum models to better capture complex patterns, such as\ntraffic dynamics, by repeatedly encoding classical data into a quantum state.\nAside from providing a prediction model, we spend considerable effort in\ncomparing the performance of our hybrid quantum-classical neural networks with\nclassical deep learning approaches. Our results show that hybrid models achieve\ncompetitive accuracy with state-of-the-art classical methods, especially when\nthe number of qubits and re-uploading blocks is increased. While the classical\nmodels demonstrate lower computational demands, we provide evidence that\nincreasing the complexity of the quantum model improves predictive accuracy.\nThese findings indicate that QML techniques, and specifically the data\nre-uploading approach, hold promise for advancing traffic forecasting models\nand could be instrumental in addressing challenges inherent in ITS\nenvironments.", "paper_summary_zh": "準確的交通預測在現代智慧運輸系統 (ITS) 中扮演著至關重要的角色，因為它能進行即時的交通流量管理、減少壅塞，並提升整體的城市交通運輸網絡效率。隨著量子機器學習 (QML) 的興起，出現了一種新的典範，它具備超越傳統機器學習模型所能達到的預測能力的潛力。在目前的工作中，我們採用啟發式方法來探索 QML 的潛力，並專注於特定的交通問題。特別是，作為一個案例研究，我們調查了雅典（希臘）一個主要都市地區的交通預測任務，我們擁有該地區的高解析度資料。在這個努力中，我們探討了量子神經網路 (QNN) 的應用，而且特別是，我們展示了量子資料重新上傳在交通預測脈絡中的首次應用。此技術讓量子模型能透過重複將傳統資料編碼成量子態，來更好地擷取複雜模式，例如交通動態。除了提供一個預測模型之外，我們花費了相當大的精力來比較我們的混合量子-傳統神經網路與傳統深度學習方法的效能。我們的結果顯示，混合模型能達到與最先進的傳統方法相媲美的準確度，特別是在量子位元和重新上傳區塊的數量增加時。儘管傳統模型展現出較低的運算需求，我們提供了證據證明增加量子模型的複雜度會提升預測準確度。這些發現表明，QML 技術，特別是資料重新上傳方法，有望推進交通預測模型，並可能有助於解決 ITS 環境中固有的挑戰。", "author": "Nikolaos Schetakis et.al.", "authors": "Nikolaos Schetakis, Paolo Bonfini, Negin Alisoltani, Konstantinos Blazakis, Symeon I. Tsintzos, Alexis Askitopoulos, Davit Aghamalyan, Panagiotis Fafoutellis, Eleni I. Vlahogianni", "id": "2501.12776v1", "paper_url": "http://arxiv.org/abs/2501.12776v1", "repo": "null"}}