{"2501.19143": {"publish_time": "2025-01-31", "title": "Imitation Game for Adversarial Disillusion with Multimodal Generative Chain-of-Thought Role-Play", "paper_summary": "As the cornerstone of artificial intelligence, machine perception confronts a\nfundamental threat posed by adversarial illusions. These adversarial attacks\nmanifest in two primary forms: deductive illusion, where specific stimuli are\ncrafted based on the victim model's general decision logic, and inductive\nillusion, where the victim model's general decision logic is shaped by specific\nstimuli. The former exploits the model's decision boundaries to create a\nstimulus that, when applied, interferes with its decision-making process. The\nlatter reinforces a conditioned reflex in the model, embedding a backdoor\nduring its learning phase that, when triggered by a stimulus, causes aberrant\nbehaviours. The multifaceted nature of adversarial illusions calls for a\nunified defence framework, addressing vulnerabilities across various forms of\nattack. In this study, we propose a disillusion paradigm based on the concept\nof an imitation game. At the heart of the imitation game lies a multimodal\ngenerative agent, steered by chain-of-thought reasoning, which observes,\ninternalises and reconstructs the semantic essence of a sample, liberated from\nthe classic pursuit of reversing the sample to its original state. As a proof\nof concept, we conduct experimental simulations using a multimodal generative\ndialogue agent and evaluates the methodology under a variety of attack\nscenarios.", "paper_summary_zh": "作為人工智慧的基石，機器感知面臨對抗性幻覺所帶來的根本威脅。這些對抗性攻擊主要表現為兩種形式：演繹幻覺，其中特定刺激是根據受害者模型的通用決策邏輯而設計的，以及歸納幻覺，其中受害者模型的通用決策邏輯是由特定刺激形成的。前者利用模型的決策邊界來創建一個刺激，當應用時會干擾其決策過程。後者在模型中強化條件反射，在其學習階段嵌入一個後門，當被刺激觸發時，會導致異常行為。對抗性幻覺的多方面性質需要一個統一的防禦框架，以解決各種形式的攻擊中的漏洞。在本研究中，我們提出了一個基於模仿遊戲概念的幻滅範例。模仿遊戲的核心是一個多模態生成代理，由思想鏈推理引導，它觀察、內化和重建樣本的語義本質，擺脫了將樣本恢復到其原始狀態的經典追求。作為概念驗證，我們使用多模態生成對話代理進行實驗模擬，並在各種攻擊場景下評估該方法。", "author": "Ching-Chun Chang et.al.", "authors": "Ching-Chun Chang, Fan-Yun Chen, Shih-Hong Gu, Kai Gao, Hanrui Wang, Isao Echizen", "id": "2501.19143v1", "paper_url": "http://arxiv.org/abs/2501.19143v1", "repo": "null"}}