{"2407.12247": {"publish_time": "2024-07-17", "title": "Lacuna Language Learning: Leveraging RNNs for Ranked Text Completion in Digitized Coptic Manuscripts", "paper_summary": "Ancient manuscripts are frequently damaged, containing gaps in the text known\nas lacunae. In this paper, we present a bidirectional RNN model for character\nprediction of Coptic characters in manuscript lacunae. Our best model performs\nwith 72% accuracy on single character reconstruction, but falls to 37% when\nreconstructing lacunae of various lengths. While not suitable for definitive\nmanuscript reconstruction, we argue that our RNN model can help scholars rank\nthe likelihood of textual reconstructions. As evidence, we use our RNN model to\nrank reconstructions in two early Coptic manuscripts. Our investigation shows\nthat neural models can augment traditional methods of textual restoration,\nproviding scholars with an additional tool to assess lacunae in Coptic\nmanuscripts.", "paper_summary_zh": "古代手稿經常受損，包含稱為殘缺的文本空白。在本文中，我們提出一個雙向 RNN 模型，用於預測手稿殘缺中的科普特文字元。我們的最佳模型在單一字元重建上執行 72% 的準確度，但在重建不同長度的殘缺時下降到 37%。雖然不適合明確的手稿重建，但我們認為我們的 RNN 模型可以幫助學者對文本重建的可能性進行排名。作為證據，我們使用我們的 RNN 模型對兩個早期科普特手稿中的重建進行排名。我們的調查表明，神經模型可以擴充傳統的文本修復方法，為學者提供一個額外的工具來評估科普特手稿中的殘缺。", "author": "Lauren Levine et.al.", "authors": "Lauren Levine, Cindy Tung Li, Lydia Bremer-McCollum, Nicholas Wagner, Amir Zeldes", "id": "2407.12247v1", "paper_url": "http://arxiv.org/abs/2407.12247v1", "repo": "null"}}