{"2407.12077": {"publish_time": "2024-07-16", "title": "GoldFinch: High Performance RWKV/Transformer Hybrid with Linear Pre-Fill and Extreme KV-Cache Compression", "paper_summary": "We introduce GoldFinch, a hybrid Linear Attention/Transformer sequence model\nthat uses a new technique to efficiently generate a highly compressed and\nreusable KV-Cache in linear time and space with respect to sequence length.\nGoldFinch stacks our new GOLD transformer on top of an enhanced version of the\nFinch (RWKV-6) architecture. We train up to 1.5B parameter class models of the\nFinch, Llama, and GoldFinch architectures, and find dramatically improved\nmodeling performance relative to both Finch and Llama. Our cache size savings\nincrease linearly with model layer count, ranging from 756-2550 times smaller\nthan the traditional transformer cache for common sizes, enabling inference of\nextremely large context lengths even on limited hardware. Although\nautoregressive generation has O(n) time complexity per token because of\nattention, pre-fill computation of the entire initial cache state for a\nsubmitted context costs only O(1) time per token due to the use of a recurrent\nneural network (RNN) to generate this cache. We release our trained weights and\ntraining code under the Apache 2.0 license for community use.", "paper_summary_zh": "我們介紹 GoldFinch，一個混合線性注意力/轉換器序列模型，它使用一種新技術，在線性時間和空間中有效生成一個高度壓縮且可重複使用的 KV 快取，相對於序列長度。GoldFinch 將我們新的 GOLD 轉換器堆疊在增強版本的 Finch (RWKV-6) 架構之上。我們訓練了 Finch、Llama 和 GoldFinch 架構中高達 1.5B 參數類別模型，並發現相對於 Finch 和 Llama，建模性能顯著提升。我們的快取大小節省隨著模型層數的增加而線性增加，比傳統轉換器快取小 756-2550 倍，即使在有限的硬體上也能推論極大的上下文長度。儘管自迴歸生成具有 O(n) 時間複雜度，因為注意力，但由於使用遞迴神經網路 (RNN) 來生成此快取，提交的上下文的整個初始快取狀態的預填充計算每個令牌只需 O(1) 時間。我們在 Apache 2.0 許可下釋出訓練後的權重和訓練程式碼，供社群使用。", "author": "Daniel Goldstein et.al.", "authors": "Daniel Goldstein, Fares Obeid, Eric Alcaide, Guangyu Song, Eugene Cheah", "id": "2407.12077v1", "paper_url": "http://arxiv.org/abs/2407.12077v1", "repo": "https://github.com/SmerkyG/GoldFinch-paper"}}