{"2407.10366": {"publish_time": "2024-07-15", "title": "Accessing Vision Foundation Models at ImageNet-level Costs", "paper_summary": "Vision foundation models are renowned for their generalization ability due to\nmassive training data. Nevertheless, they demand tremendous training resources,\nand the training data is often inaccessible, e.g., CLIP, DINOv2, posing great\nchallenges to developing derivatives that could advance research in this field.\nIn this work, we offer a very simple and general solution, named Proteus, to\ndistill foundation models into smaller equivalents on ImageNet-1K without\naccess to the original training data. Specifically, we remove the designs from\nconventional knowledge distillation settings that result in dataset bias and\npresent three levels of training objectives, i.e., token, patch, and feature,\nto maximize the efficacy of knowledge transfer. In this manner, Proteus is\ntrained at ImageNet-level costs with surprising ability, facilitating the\naccessibility of training foundation models for the broader research community.\nLeveraging DINOv2-g/14 as the teacher, Proteus-L/14 matches the performance of\nthe Oracle method DINOv2-L/14 (142M training data) across 15 benchmarks and\noutperforms other vision foundation models including CLIP-L/14 (400M),\nOpenCLIP-L/14 (400M/2B) and SynCLR-L/14 (600M).", "paper_summary_zh": "視覺基礎模型由於具有龐大的訓練資料，而以其泛化能力聞名。儘管如此，它們需要大量的訓練資源，而訓練資料通常無法取得，例如 CLIP、DINOv2，對發展可以推進此領域研究的衍生品構成極大的挑戰。在這項工作中，我們提供了一個非常簡單且通用的解決方案，稱為 Proteus，可以在沒有原始訓練資料的情況下，將基礎模型提煉成 ImageNet-1K 上較小的等價物。具體來說，我們從傳統知識提煉設定中移除導致資料集偏差的設計，並提出三層訓練目標，即 token、patch 和特徵，以最大化知識傳輸的功效。透過這種方式，Proteus 以驚人的能力在 ImageNet 等級的成本下進行訓練，有助於更廣泛的研究社群取得訓練基礎模型的管道。利用 DINOv2-g/14 作為教師，Proteus-L/14 在 15 個基準測試中與 Oracle 方法 DINOv2-L/14（142M 訓練資料）的效能相匹配，並且優於其他視覺基礎模型，包括 CLIP-L/14（400M）、OpenCLIP-L/14（400M/2B）和 SynCLR-L/14（600M）。", "author": "Yitian Zhang et.al.", "authors": "Yitian Zhang, Xu Ma, Yue Bai, Huan Wang, Yun Fu", "id": "2407.10366v1", "paper_url": "http://arxiv.org/abs/2407.10366v1", "repo": "https://github.com/bespontaneous/proteus-pytorch"}}