{"2411.19378": {"publish_time": "2024-11-28", "title": "Libra: Leveraging Temporal Images for Biomedical Radiology Analysis", "paper_summary": "Radiology report generation (RRG) is a challenging task, as it requires a\nthorough understanding of medical images, integration of multiple temporal\ninputs, and accurate report generation. Effective interpretation of medical\nimages, such as chest X-rays (CXRs), demands sophisticated visual-language\nreasoning to map visual findings to structured reports. Recent studies have\nshown that multimodal large language models (MLLMs) can acquire multimodal\ncapabilities by aligning with pre-trained vision encoders. However, current\napproaches predominantly focus on single-image analysis or utilise rule-based\nsymbolic processing to handle multiple images, thereby overlooking the\nessential temporal information derived from comparing current images with prior\nones. To overcome this critical limitation, we introduce Libra, a\ntemporal-aware MLLM tailored for CXR report generation using temporal images.\nLibra integrates a radiology-specific image encoder with a MLLM and utilises a\nnovel Temporal Alignment Connector to capture and synthesise temporal\ninformation of images across different time points with unprecedented\nprecision. Extensive experiments show that Libra achieves new state-of-the-art\nperformance among the same parameter scale MLLMs for RRG tasks on the\nMIMIC-CXR. Specifically, Libra improves the RadCliQ metric by 12.9% and makes\nsubstantial gains across all lexical metrics compared to previous models.", "paper_summary_zh": "放射學報告生成 (RRG) 是一項具有挑戰性的任務，因為它需要透徹了解醫學影像、整合多個時間輸入以及準確的報告生成。有效解讀醫學影像，例如胸部 X 光 (CXR)，需要複雜的視覺語言推理才能將視覺發現對應到結構化的報告中。最近的研究表明，多模態大型語言模型 (MLLM) 可以透過與預先訓練的視覺編碼器對齊來獲得多模態能力。然而，目前的方法主要專注於單一影像分析或利用基於規則的符號處理來處理多個影像，從而忽略了從比較當前影像與先前影像中得出的基本時間資訊。為了克服這個關鍵限制，我們引入了 Libra，一個專為使用時間影像進行 CXR 報告生成的時態感知 MLLM。Libra 將放射學專用影像編碼器與 MLLM 整合在一起，並利用一個新穎的時間對齊連接器來擷取和合成不同時間點影像的時間資訊，並具有前所未有的精確度。廣泛的實驗表明，Libra 在 MIMIC-CXR 的 RRG 任務中，在同參數規模的 MLLM 中取得了新的最先進效能。具體來說，Libra 將 RadCliQ 指標提升了 12.9%，並在所有詞彙指標方面都比以前的模型取得了顯著進步。", "author": "Xi Zhang et.al.", "authors": "Xi Zhang, Zaiqiao Meng, Jake Lever, Edmond S. L. Ho", "id": "2411.19378v1", "paper_url": "http://arxiv.org/abs/2411.19378v1", "repo": "null"}}