{"2408.04229": {"publish_time": "2024-08-08", "title": "Probabilistic Circuits for Cumulative Distribution Functions", "paper_summary": "A probabilistic circuit (PC) succinctly expresses a function that represents\na multivariate probability distribution and, given sufficient structural\nproperties of the circuit, supports efficient probabilistic inference.\nTypically a PC computes the probability mass (or density) function (PMF or PDF)\nof the distribution. We consider PCs instead computing the cumulative\ndistribution function (CDF). We show that for distributions over binary random\nvariables these representations (PMF and CDF) are essentially equivalent, in\nthe sense that one can be transformed to the other in polynomial time. We then\nshow how a similar equivalence holds for distributions over finite discrete\nvariables using a modification of the standard encoding with binary variables\nthat aligns with the CDF semantics. Finally we show that for continuous\nvariables, smooth, decomposable PCs computing PDFs and CDFs can be efficiently\ntransformed to each other by modifying only the leaves of the circuit.", "paper_summary_zh": "機率電路 (PC) 簡潔地表達一個表示多變量機率分佈的函數，並且在電路具有足夠結構特性的情況下，支援有效的機率推論。PC 通常會計算分佈的機率質量 (或密度) 函數 (PMF 或 PDF)。我們考慮 PC 計算累積分佈函數 (CDF)。我們證明，對於二元隨機變數上的分佈，這些表示法 (PMF 和 CDF) 本質上是等效的，因為其中一個可以在多項式時間內轉換為另一個。然後，我們展示類似的等價性如何適用於有限離散變數上的分佈，方法是修改具有二元變數的標準編碼，使其與 CDF 語義保持一致。最後，我們證明對於連續變數，計算 PDF 和 CDF 的平滑、可分解 PC 可以透過僅修改電路的葉節點來有效地相互轉換。", "author": "Oliver Broadrick et.al.", "authors": "Oliver Broadrick, William Cao, Benjie Wang, Martin Trapp, Guy Van den Broeck", "id": "2408.04229v1", "paper_url": "http://arxiv.org/abs/2408.04229v1", "repo": "null"}}