{"2408.03544": {"publish_time": "2024-08-07", "title": "Unlocking the Non-Native Language Context Limitation: Native Language Prompting Facilitates Knowledge Elicitation", "paper_summary": "Multilingual large language models (MLLMs) struggle to answer questions posed\nin non-dominant languages, even though they have already acquired the relevant\nknowledge from their dominant language corpus. In contrast, human multilinguals\ncan overcome this issue by invoking the relatively rich knowledge acquired from\nnative language texts through Positive Native Language Transfer (PNLT).\nInspired by this, we analogize the dominant language of MLLMs to the native\nlanguage of human multilinguals, and propose Native Language Prompting (NatLan)\nto simulate the PNLT observed in human multilinguals. It explicitly creates\nnative language contexts for MLLMs to facilitate the elicitation of the rich\nnative language knowledge during question-answering, unlocking the limitations\nimposed by non-native language contexts on the effective application of\nknowledge. By employing multi-MLLM collaboration, NatLan reduces the workload\non each MLLM in simulating PNLT and refines semantic transfer. On the C-Eval\nbenchmark, NatLan provides up to a 10.1% average accuracy improvement and up to\na 5.0% increase in the hard-level subset across five MLLMs, surpassing all\ntop-notch related methods. Our code is available at\nhttps://github.com/AnonyNLP/NatLan.", "paper_summary_zh": "多語言大型語言模型 (MLLM) 難以回答以非主要語言提出的問題，即使它們已經從其主要語言語料庫中獲得相關知識。相比之下，人類多語言使用者可以透過調用從母語文本中獲得的相對豐富知識來克服這個問題，透過正向母語轉移 (PNLT) 實現。受到此啟發，我們將 MLLM 的主要語言類比為人類多語言使用者的母語，並提出母語提示 (NatLan) 來模擬人類多語言使用者中觀察到的 PNLT。它明確為 MLLM 建立母語脈絡，以利於在問答過程中引出豐富的母語知識，打破非母語脈絡對知識有效應用造成的限制。透過採用多 MLLM 協作，NatLan 減少了每個 MLLM 在模擬 PNLT 時的工作量，並改善了語義轉移。在 C-Eval 基準測試中，NatLan 在五個 MLLM 中提供了高達 10.1% 的平均準確度提升，以及難度子集高達 5.0% 的提升，超越所有頂尖相關方法。我們的程式碼可於 https://github.com/AnonyNLP/NatLan 取得。", "author": "Baixuan Li et.al.", "authors": "Baixuan Li, Yunlong Fan, Zhiqiang Gao", "id": "2408.03544v1", "paper_url": "http://arxiv.org/abs/2408.03544v1", "repo": "https://github.com/anonynlp/natlan"}}