{"2503.13399": {"publish_time": "2025-03-17", "title": "MicroVQA: A Multimodal Reasoning Benchmark for Microscopy-Based Scientific Research", "paper_summary": "Scientific research demands sophisticated reasoning over multimodal data, a\nchallenge especially prevalent in biology. Despite recent advances in\nmultimodal large language models (MLLMs) for AI-assisted research, existing\nmultimodal reasoning benchmarks only target up to college-level difficulty,\nwhile research-level benchmarks emphasize lower-level perception, falling short\nof the complex multimodal reasoning needed for scientific discovery. To bridge\nthis gap, we introduce MicroVQA, a visual-question answering (VQA) benchmark\ndesigned to assess three reasoning capabilities vital in research workflows:\nexpert image understanding, hypothesis generation, and experiment proposal.\nMicroVQA consists of 1,042 multiple-choice questions (MCQs) curated by biology\nexperts across diverse microscopy modalities, ensuring VQA samples represent\nreal scientific practice. In constructing the benchmark, we find that standard\nMCQ generation methods induce language shortcuts, motivating a new two-stage\npipeline: an optimized LLM prompt structures question-answer pairs into MCQs;\nthen, an agent-based `RefineBot' updates them to remove shortcuts. Benchmarking\non state-of-the-art MLLMs reveal a peak performance of 53\\%; models with\nsmaller LLMs only slightly underperform top models, suggesting that\nlanguage-based reasoning is less challenging than multimodal reasoning; and\ntuning with scientific articles enhances performance. Expert analysis of\nchain-of-thought responses shows that perception errors are the most frequent,\nfollowed by knowledge errors and then overgeneralization errors. These insights\nhighlight the challenges in multimodal scientific reasoning, showing MicroVQA\nis a valuable resource advancing AI-driven biomedical research. MicroVQA is\navailable at https://huggingface.co/datasets/jmhb/microvqa, and project page at\nhttps://jmhb0.github.io/microvqa.", "paper_summary_zh": "<paragraph>科學研究需要對多模態數據進行複雜的推理，這在生物學領域尤為突出。儘管用於 AI 輔助研究的多模態大型語言模型 (MLLM) 近期有所進展，但現有的多模態推理基準測試僅針對大學程度的難度，而研究級的基準測試則強調較低層次的感知，未能滿足科學發現所需的複雜多模態推理。為了彌合這一差距，我們引入了 MicroVQA，這是一個視覺問答 (VQA) 基準測試，旨在評估研究工作流程中至關重要的三種推理能力：專家圖像理解、假設生成和實驗方案設計。MicroVQA 由生物學專家針對各種顯微鏡模式精心設計的 1,042 道多項選擇題 (MCQ) 組成，確保 VQA 樣本代表真實的科學實踐。在構建基準測試的過程中，我們發現標準的 MCQ 生成方法會導致語言捷徑，這促使我們開發了一個新的兩階段流程：一個優化的 LLM 提示將問答對構建成 MCQ；然後，一個基於代理的「RefineBot」更新它們以移除捷徑。對最先進的 MLLM 進行基準測試顯示，其峰值性能為 53%；具有較小 LLM 的模型的性能僅略低於頂級模型，這表明基於語言的推理不如多模態推理那麼具有挑戰性；使用科學文章進行微調可以提高性能。專家對思維鏈響應的分析表明，感知錯誤最為常見，其次是知識錯誤，然後是過度概括錯誤。這些見解突顯了多模態科學推理中的挑戰，表明 MicroVQA 是推進 AI 驅動的生物醫學研究的寶貴資源。MicroVQA 可在 https://huggingface.co/datasets/jmhb/microvqa 獲取，項目頁面位於 https://jmhb0.github.io/microvqa。</paragraph>\n", "author": "James Burgess et.al.", "authors": "James Burgess, Jeffrey J Nirschl, Laura Bravo-Sánchez, Alejandro Lozano, Sanket Rajan Gupte, Jesus G. Galaz-Montoya, Yuhui Zhang, Yuchang Su, Disha Bhowmik, Zachary Coman, Sarina M. Hasan, Alexandra Johannesson, William D. Leineweber, Malvika G Nair, Ridhi Yarlagadda, Connor Zuraski, Wah Chiu, Sarah Cohen, Jan N. Hansen, Manuel D Leonetti, Chad Liu, Emma Lundberg, Serena Yeung-Levy", "id": "2503.13399v1", "paper_url": "http://arxiv.org/abs/2503.13399v1", "repo": "null"}}