{"2409.19120": {"publish_time": "2024-09-27", "title": "Secure Multiparty Generative AI", "paper_summary": "As usage of generative AI tools skyrockets, the amount of sensitive\ninformation being exposed to these models and centralized model providers is\nalarming. For example, confidential source code from Samsung suffered a data\nleak as the text prompt to ChatGPT encountered data leakage. An increasing\nnumber of companies are restricting the use of LLMs (Apple, Verizon, JPMorgan\nChase, etc.) due to data leakage or confidentiality issues. Also, an increasing\nnumber of centralized generative model providers are restricting, filtering,\naligning, or censoring what can be used. Midjourney and RunwayML, two of the\nmajor image generation platforms, restrict the prompts to their system via\nprompt filtering. Certain political figures are restricted from image\ngeneration, as well as words associated with women's health care, rights, and\nabortion.\n  In our research, we present a secure and private methodology for generative\nartificial intelligence that does not expose sensitive data or models to\nthird-party AI providers. Our work modifies the key building block of modern\ngenerative AI algorithms, e.g. the transformer, and introduces confidential and\nverifiable multiparty computations in a decentralized network to maintain the\n1) privacy of the user input and obfuscation to the output of the model, and 2)\nintroduce privacy to the model itself. Additionally, the sharding process\nreduces the computational burden on any one node, enabling the distribution of\nresources of large generative AI processes across multiple, smaller nodes. We\nshow that as long as there exists one honest node in the decentralized\ncomputation, security is maintained. We also show that the inference process\nwill still succeed if only a majority of the nodes in the computation are\nsuccessful. Thus, our method offers both secure and verifiable computation in a\ndecentralized network.", "paper_summary_zh": "<paragraph>隨著生成式 AI 工具的使用量激增，暴露給這些模型和集中式模型提供者的敏感資訊數量令人擔憂。例如，來自三星的機密原始碼發生資料外洩，因為 ChatGPT 的文字提示遇到了資料外洩。由於資料外洩或機密性問題，越來越多的公司正在限制使用 LLM（Apple、Verizon、JPMorgan Chase 等）。此外，越來越多的集中式生成模型提供者正在限制、過濾、調整或審查可以使用什麼。Midjourney 和 RunwayML 是兩個主要的影像生成平台，它們透過提示過濾限制系統的提示。某些政治人物被禁止生成影像，以及與婦女保健、權利和墮胎相關的字詞。\n在我們的研究中，我們提出了一種安全且私密的生成式人工智慧方法，不會將敏感資料或模型暴露給第三方 AI 提供者。我們的研究修改了現代生成式 AI 演算法的主要建構區塊，例如Transformer，並在分散式網路中引入了機密且可驗證的多方運算，以維護 1) 使用者輸入的隱私和模型輸出的混淆，以及 2) 為模型本身引入隱私。此外，分片處理會降低任何一個節點的運算負擔，讓大型生成式 AI 處理的資源可以分布在多個較小的節點上。我們表明，只要在分散式運算中存在一個誠實的節點，就能維持安全性。我們也表明，如果運算中只有多數節點成功，推理程序仍然會成功。因此，我們的模型在分散式網路中提供了安全且可驗證的運算。</paragraph>", "author": "Manil Shrestha et.al.", "authors": "Manil Shrestha, Yashodha Ravichandran, Edward Kim", "id": "2409.19120v1", "paper_url": "http://arxiv.org/abs/2409.19120v1", "repo": "null"}}