{"2411.02643": {"publish_time": "2024-11-04", "title": "A Comparative Analysis of Counterfactual Explanation Methods for Text Classifiers", "paper_summary": "Counterfactual explanations can be used to interpret and debug text\nclassifiers by producing minimally altered text inputs that change a\nclassifier's output. In this work, we evaluate five methods for generating\ncounterfactual explanations for a BERT text classifier on two datasets using\nthree evaluation metrics. The results of our experiments suggest that\nestablished white-box substitution-based methods are effective at generating\nvalid counterfactuals that change the classifier's output. In contrast, newer\nmethods based on large language models (LLMs) excel at producing natural and\nlinguistically plausible text counterfactuals but often fail to generate valid\ncounterfactuals that alter the classifier's output. Based on these results, we\nrecommend developing new counterfactual explanation methods that combine the\nstrengths of established gradient-based approaches and newer LLM-based\ntechniques to generate high-quality, valid, and plausible text counterfactual\nexplanations.", "paper_summary_zh": "反事實解釋可用於透過產生會改變分類器輸出的最小化變更文字輸入，來詮釋和除錯文字分類器。在這項工作中，我們使用三個評估指標，針對兩個資料集上的 BERT 文字分類器，評估產生反事實解釋的五種方法。我們的實驗結果顯示，既定的白盒替換式方法有效產生會改變分類器輸出的有效反事實。相反地，基於大型語言模型 (LLM) 的較新方法擅長產生自然且在語言學上合理的文字反事實，但常常無法產生會改變分類器輸出的有效反事實。基於這些結果，我們建議開發新的反事實解釋方法，結合既定梯度式方法和較新的 LLM 式技術的優點，以產生高品質、有效且合理的文字反事實解釋。", "author": "Stephen McAleese et.al.", "authors": "Stephen McAleese, Mark Keane", "id": "2411.02643v1", "paper_url": "http://arxiv.org/abs/2411.02643v1", "repo": "null"}}