{"2412.03966": {"publish_time": "2024-12-05", "title": "Demonstration Selection for In-Context Learning via Reinforcement Learning", "paper_summary": "Diversity in demonstration selection is crucial for enhancing model\ngeneralization, as it enables a broader coverage of structures and concepts.\nHowever, constructing an appropriate set of demonstrations has remained a focal\npoint of research. This paper presents the Relevance-Diversity Enhanced\nSelection (RDES), an innovative approach that leverages reinforcement learning\nto optimize the selection of diverse reference demonstrations for text\nclassification tasks using Large Language Models (LLMs), especially in few-shot\nprompting scenarios. RDES employs a Q-learning framework to dynamically\nidentify demonstrations that maximize both diversity and relevance to the\nclassification objective by calculating a diversity score based on label\ndistribution among selected demonstrations. This method ensures a balanced\nrepresentation of reference data, leading to improved classification accuracy.\nThrough extensive experiments on four benchmark datasets and involving 12\nclosed-source and open-source LLMs, we demonstrate that RDES significantly\nenhances classification accuracy compared to ten established baselines.\nFurthermore, we investigate the incorporation of Chain-of-Thought (CoT)\nreasoning in the reasoning process, which further enhances the model's\npredictive performance. The results underscore the potential of reinforcement\nlearning to facilitate adaptive demonstration selection and deepen the\nunderstanding of classification challenges.", "paper_summary_zh": "示範選擇的多樣性對於增強模型概化至關重要，因為它能更廣泛地涵蓋結構和概念。然而，建構一組適當的示範仍然是研究的重點。本文提出了相關性多樣性增強選擇 (RDES)，這是一種創新的方法，它利用強化學習來最佳化選擇用於文本分類任務的不同參考示範，特別是在少次提示場景中，並使用大型語言模型 (LLM)。RDES 使用 Q 學習架構來動態識別示範，這些示範能最大化多樣性和與分類目標相關性，方法是根據已選擇示範中的標籤分佈計算多樣性分數。此方法能確保參考資料的均衡表示，進而提升分類準確度。透過在四個基準資料集上進行廣泛的實驗，並涉及 12 個閉源和開源 LLM，我們證明 RDES 與十個已建立的基準相比，顯著提升了分類準確度。此外，我們探討了在推理過程中納入思考鏈 (CoT) 推理，這進一步提升了模型的預測效能。結果強調了強化學習促進適應性示範選擇的潛力，並加深了對分類挑戰的理解。", "author": "Xubin Wang et.al.", "authors": "Xubin Wang, Jianfei Wu, Yichen Yuan, Mingzhe Li, Deyu Cai, Weijia Jia", "id": "2412.03966v1", "paper_url": "http://arxiv.org/abs/2412.03966v1", "repo": "null"}}