{"2412.07066": {"publish_time": "2024-12-10", "title": "The Mirage of Artificial Intelligence Terms of Use Restrictions", "paper_summary": "Artificial intelligence (AI) model creators commonly attach restrictive terms\nof use to both their models and their outputs. These terms typically prohibit\nactivities ranging from creating competing AI models to spreading\ndisinformation. Often taken at face value, these terms are positioned by\ncompanies as key enforceable tools for preventing misuse, particularly in\npolicy dialogs. But are these terms truly meaningful? There are myriad examples\nwhere these broad terms are regularly and repeatedly violated. Yet except for\nsome account suspensions on platforms, no model creator has actually tried to\nenforce these terms with monetary penalties or injunctive relief. This is\nlikely for good reason: we think that the legal enforceability of these\nlicenses is questionable.\n  This Article systematically assesses of the enforceability of AI model terms\nof use and offers three contributions. First, we pinpoint a key problem: the\nartifacts that they protect, namely model weights and model outputs, are\nlargely not copyrightable, making it unclear whether there is even anything to\nbe licensed. Second, we examine the problems this creates for other\nenforcement. Recent doctrinal trends in copyright preemption may further\nundermine state-law claims, while other legal frameworks like the DMCA and CFAA\noffer limited recourse. Anti-competitive provisions likely fare even worse than\nresponsible use provisions. Third, we provide recommendations to policymakers.\nThere are compelling reasons for many provisions to be unenforceable: they\nchill good faith research, constrain competition, and create quasi-copyright\nownership where none should exist. There are, of course, downsides: model\ncreators have fewer tools to prevent harmful misuse. But we think the better\napproach is for statutory provisions, not private fiat, to distinguish between\ngood and bad uses of AI, restricting the latter.", "paper_summary_zh": "<paragraph>人工智慧（AI）模型創建者通常會在其模型及其輸出附加限制性使用條款。這些條款通常禁止從建立競爭的 AI 模型到散布錯誤資訊的活動。這些條款通常被表面的理解，由公司定位為防止濫用的關鍵可執行工具，特別是在政策對話中。但是，這些條款真的有意義嗎？有許多範例顯示，這些廣泛的條款經常且重複地遭到違反。然而，除了平台上的一些帳戶暫停之外，沒有任何模型創建者實際嘗試以金錢處罰或禁令救濟來執行這些條款。這很可能是出於正當理由：我們認為這些許可證的法律可執行性值得懷疑。\n本文系統性地評估 AI 模型使用條款的可執行性，並提供三項貢獻。首先，我們找出一個關鍵問題：它們所保護的人工製品，即模型權重和模型輸出，在很大程度上不具有著作權，這使得是否甚至有任何東西可以被許可變得不明確。其次，我們審查這對其他執法造成的問題。著作權先佔權的近期教條趨勢可能會進一步破壞州法律主張，而 DMCA 和 CFAA 等其他法律框架提供的追索權有限。反競爭條款的表現可能比負責任使用條款更糟。第三，我們向政策制定者提供建議。有許多條款無法執行的令人信服的理由：它們冷卻善意研究、限制競爭，並在不應存在的地方創造準著作權所有權。當然也有缺點：模型創建者較少工具來防止有害的濫用。但我們認為更好的方法是法定條款，而不是私人法令，來區分 AI 的好處與壞處，限制後者。</paragraph>", "author": "Peter Henderson et.al.", "authors": "Peter Henderson, Mark A. Lemley", "id": "2412.07066v1", "paper_url": "http://arxiv.org/abs/2412.07066v1", "repo": "null"}}