{"2411.10328": {"publish_time": "2024-11-15", "title": "Emotion Detection in Reddit: Comparative Study of Machine Learning and Deep Learning Techniques", "paper_summary": "Emotion detection is pivotal in human communication, as it significantly\ninfluences behavior, relationships, and decision-making processes. This study\nconcentrates on text-based emotion detection by leveraging the GoEmotions\ndataset, which annotates Reddit comments with 27 distinct emotions. These\nemotions are subsequently mapped to Ekman's six basic categories: joy, anger,\nfear, sadness, disgust, and surprise. We employed a range of models for this\ntask, including six machine learning models, three ensemble models, and a Long\nShort-Term Memory (LSTM) model to determine the optimal model for emotion\ndetection. Results indicate that the Stacking classifier outperforms other\nmodels in accuracy and performance. We also benchmark our models against\nEmoBERTa, a pre-trained emotion detection model, with our Stacking classifier\nproving more effective. Finally, the Stacking classifier is deployed via a\nStreamlit web application, underscoring its potential for real-world\napplications in text-based emotion analysis.", "paper_summary_zh": "情緒偵測在人類溝通中至關重要，因為它顯著影響行為、人際關係和決策制定過程。本研究集中於基於文字的情緒偵測，利用 GoEmotions 資料集，其中註解了 Reddit 評論，並標示了 27 種不同的情緒。這些情緒隨後對應到 Ekman 的六種基本類別：快樂、憤怒、恐懼、悲傷、厭惡和驚訝。我們採用了一系列模型來執行這項任務，包括六個機器學習模型、三個集成模型和一個長短期記憶 (LSTM) 模型，以確定最佳的情緒偵測模型。結果表明，堆疊分類器在準確性和效能方面優於其他模型。我們也根據預先訓練好的情緒偵測模型 EmoBERTa 來評量我們的模型，而我們的堆疊分類器證明了更有效。最後，堆疊分類器透過 Streamlit 網路應用程式進行部署，突顯了它在基於文字的情緒分析中對真實世界應用程式的潛力。", "author": "Maliheh Alaeddini et.al.", "authors": "Maliheh Alaeddini", "id": "2411.10328v1", "paper_url": "http://arxiv.org/abs/2411.10328v1", "repo": "null"}}