{"2405.15177": {"publish_time": "2024-05-24", "title": "Diffusion Actor-Critic with Entropy Regulator", "paper_summary": "Reinforcement learning (RL) has proven highly effective in addressing complex\ndecision-making and control tasks. However, in most traditional RL algorithms,\nthe policy is typically parameterized as a diagonal Gaussian distribution with\nlearned mean and variance, which constrains their capability to acquire complex\npolicies. In response to this problem, we propose an online RL algorithm termed\ndiffusion actor-critic with entropy regulator (DACER). This algorithm\nconceptualizes the reverse process of the diffusion model as a novel policy\nfunction and leverages the capability of the diffusion model to fit multimodal\ndistributions, thereby enhancing the representational capacity of the policy.\nSince the distribution of the diffusion policy lacks an analytical expression,\nits entropy cannot be determined analytically. To mitigate this, we propose a\nmethod to estimate the entropy of the diffusion policy utilizing Gaussian\nmixture model. Building on the estimated entropy, we can learn a parameter\n$\\alpha$ that modulates the degree of exploration and exploitation. Parameter\n$\\alpha$ will be employed to adaptively regulate the variance of the added\nnoise, which is applied to the action output by the diffusion model.\nExperimental trials on MuJoCo benchmarks and a multimodal task demonstrate that\nthe DACER algorithm achieves state-of-the-art (SOTA) performance in most MuJoCo\ncontrol tasks while exhibiting a stronger representational capacity of the\ndiffusion policy.", "paper_summary_zh": "強化學習 (RL) 已被證明在解決複雜決策制定和控制任務方面非常有效。然而，在大多數傳統的 RL 演算法中，策略通常被參數化為對角高斯分佈，具有學習到的平均值和變異數，這限制了它們獲取複雜策略的能力。為了應對這個問題，我們提出了一種名為擴散動作-評論家與熵調節器 (DACER) 的線上 RL 演算法。此演算法將擴散模型的反向過程概念化為一種新穎的策略函數，並利用擴散模型擬合多模態分佈的能力，從而增強策略的表示能力。由於擴散策略的分佈缺乏解析表達式，因此無法解析地確定其熵。為了減輕這個問題，我們提出了一種使用高斯混合模型估計擴散策略熵的方法。建立在估計的熵之上，我們可以學習一個參數 $\\alpha$，它調節探索和利用的程度。參數 $\\alpha$ 將被用於自適應地調節擴散模型對動作輸出的加性雜訊的變異數。在 MuJoCo 基準和多模態任務上的實驗試驗表明，DACER 演算法在大多數 MuJoCo 控制任務中實現了最先進 (SOTA) 的效能，同時展現出擴散策略更強的表示能力。", "author": "Yinuo Wang et.al.", "authors": "Yinuo Wang, Likun Wang, Yuxuan Jiang, Wenjun Zou, Tong Liu, Xujie Song, Wenxuan Wang, Liming Xiao, Jiang Wu, Jingliang Duan, Shengbo Eben Li", "id": "2405.15177v1", "paper_url": "http://arxiv.org/abs/2405.15177v1", "repo": "null"}}