{"2411.06657": {"publish_time": "2024-11-11", "title": "Renaissance: Investigating the Pretraining of Vision-Language Encoders", "paper_summary": "In the past several years there has been an explosion of available models for\nvision-language tasks. Unfortunately, the literature still leaves open a number\nof questions related to best practices in designing and training such models.\nIn this paper we seek to answer several questions related to the pretraining of\nvision-language encoders through meta-analysis. In our first set of\nexperiments, we show that we can save significant compute at no cost to\ndownstream performance, by freezing large parts of vision-language models\nduring pretraining. In our second set of experiments we examine the effect of\nbasing a VL transformer on a vision model versus a text model. Additionally, we\nintroduce a VL modeling platform called Renaissance that we use to conduct all\nof the experiments. This program offers a great deal of flexibility in\ncreating, training and evaluating transformer encoders for VL modeling. The\nsource code for Renaissance can be found at\nhttps://github.com/bsu-slim/renaissance.", "paper_summary_zh": "過去幾年來，可用於視覺語言任務的模型出現了爆炸性的增長。不幸的是，文獻中仍有許多與設計和訓練此類模型的最佳實務相關的問題尚未解決。在本文中，我們尋求透過元分析來回答與視覺語言編碼器的預訓練相關的幾個問題。在我們的首組實驗中，我們表明，透過在預訓練期間凍結視覺語言模型的大部分，我們可以在不損害下游效能的情況下，節省大量的運算。在我們的第二組實驗中，我們檢驗了將 VL 轉換器建立在視覺模型與文字模型上的效果。此外，我們引入了稱為 Renaissance 的 VL 建模平台，我們使用該平台來進行所有實驗。此程式在建立、訓練和評估用於 VL 建模的轉換器編碼器方面提供了極大的靈活性。Renaissance 的原始程式碼可以在 https://github.com/bsu-slim/renaissance 找到。", "author": "Clayton Fields et.al.", "authors": "Clayton Fields, Casey Kennington", "id": "2411.06657v1", "paper_url": "http://arxiv.org/abs/2411.06657v1", "repo": "https://github.com/bsu-slim/renaissance"}}