{"2410.11200": {"publish_time": "2024-10-15", "title": "SplitSEE: A Splittable Self-supervised Framework for Single-Channel EEG Representation Learning", "paper_summary": "While end-to-end multi-channel electroencephalography (EEG) learning\napproaches have shown significant promise, their applicability is often\nconstrained in neurological diagnostics, such as intracranial EEG resources.\nWhen provided with a single-channel EEG, how can we learn representations that\nare robust to multi-channels and scalable across varied tasks, such as seizure\nprediction? In this paper, we present SplitSEE, a structurally splittable\nframework designed for effective temporal-frequency representation learning in\nsingle-channel EEG. The key concept of SplitSEE is a self-supervised framework\nincorporating a deep clustering task. Given an EEG, we argue that the time and\nfrequency domains are two distinct perspectives, and hence, learned\nrepresentations should share the same cluster assignment. To this end, we first\npropose two domain-specific modules that independently learn domain-specific\nrepresentation and address the temporal-frequency tradeoff issue in\nconventional spectrogram-based methods. Then, we introduce a novel clustering\nloss to measure the information similarity. This encourages representations\nfrom both domains to coherently describe the same input by assigning them a\nconsistent cluster. SplitSEE leverages a pre-training-to-fine-tuning framework\nwithin a splittable architecture and has following properties: (a)\nEffectiveness: it learns representations solely from single-channel EEG but has\neven outperformed multi-channel baselines. (b) Robustness: it shows the\ncapacity to adapt across different channels with low performance variance.\nSuperior performance is also achieved with our collected clinical dataset. (c)\nScalability: With just one fine-tuning epoch, SplitSEE achieves high and stable\nperformance using partial model layers.", "paper_summary_zh": "<paragraph>雖然端到端多通道腦電圖 (EEG) 學習方法已展現出顯著的希望，但其適用性在神經診斷，例如顱內 EEG 資源中，通常受到限制。當提供單通道 EEG 時，我們如何學習對多通道穩健且可擴展到各種任務（例如癲癇預測）的表徵？在本文中，我們提出 SplitSEE，一個結構可分割的框架，專為在單通道 EEG 中進行有效的時頻表徵學習而設計。SplitSEE 的關鍵概念是一個自監督的框架，結合了一個深度聚類任務。給定一個 EEG，我們認為時間和頻率域是兩個不同的觀點，因此，學習到的表徵應該共享相同的叢集分配。為此，我們首先提出兩個特定於領域的模組，它們獨立學習特定於領域的表徵，並解決傳統基於時譜圖的方法中的時頻權衡問題。然後，我們引入一個新的聚類損失來衡量資訊相似性。這鼓勵來自兩個領域的表徵通過將它們分配到一致的叢集來一致地描述相同的輸入。SplitSEE 在可分割的架構中利用預訓練到微調的框架，並具有以下特性：(a) 有效性：它僅從單通道 EEG 學習表徵，但甚至優於多通道基準。 (b) 穩健性：它顯示出以低效能變異適應不同通道的能力。使用我們收集的臨床資料集也獲得了優異的效能。 (c) 可擴展性：只使用一個微調時期，SplitSEE 使用部分模型層即可達到高且穩定的效能。</paragraph>", "author": "Rikuto Kotoge et.al.", "authors": "Rikuto Kotoge, Zheng Chen, Tasuku Kimura, Yasuko Matsubara, Takufumi Yanagisawa, Haruhiko Kishima, Yasushi Sakurai", "id": "2410.11200v1", "paper_url": "http://arxiv.org/abs/2410.11200v1", "repo": "null"}}