{"2405.06058": {"publish_time": "2024-05-09", "title": "Large Language Models Show Human-like Social Desirability Biases in Survey Responses", "paper_summary": "As Large Language Models (LLMs) become widely used to model and simulate\nhuman behavior, understanding their biases becomes critical. We developed an\nexperimental framework using Big Five personality surveys and uncovered a\npreviously undetected social desirability bias in a wide range of LLMs. By\nsystematically varying the number of questions LLMs were exposed to, we\ndemonstrate their ability to infer when they are being evaluated. When\npersonality evaluation is inferred, LLMs skew their scores towards the\ndesirable ends of trait dimensions (i.e., increased extraversion, decreased\nneuroticism, etc). This bias exists in all tested models, including GPT-4/3.5,\nClaude 3, Llama 3, and PaLM-2. Bias levels appear to increase in more recent\nmodels, with GPT-4's survey responses changing by 1.20 (human) standard\ndeviations and Llama 3's by 0.98 standard deviations-very large effects. This\nbias is robust to randomization of question order and paraphrasing.\nReverse-coding all the questions decreases bias levels but does not eliminate\nthem, suggesting that this effect cannot be attributed to acquiescence bias.\nOur findings reveal an emergent social desirability bias and suggest\nconstraints on profiling LLMs with psychometric tests and on using LLMs as\nproxies for human participants.", "paper_summary_zh": "隨著大型語言模型 (LLM) 被廣泛用於模擬和模擬\n人類行為，了解其偏見變得至關重要。我們開發了一個\n使用大五人格測驗的實驗框架，並發現了廣泛的 LLM 中以前未檢測到的社會期望偏差。通過\n系統地改變 LLM 接觸到的問題數量，我們\n證明了他們推斷自己何時被評估的能力。當\n人格評估被推斷出來時，LLM 會將其得分偏向特質維度的理想終點（即，外向性增加，神經質減少\n等）。這種偏差存在於所有測試模型中，包括 GPT-4/3.5、\nClaude 3、Llama 3 和 PaLM-2。偏差水平似乎在更新的\n模型中有所增加，GPT-4 的調查回應改變了 1.20（人類）標準\n偏差和 Llama 3 的 0.98 標準偏差 - 非常大的影響。這種\n偏差對問題順序和同義詞的隨機化具有魯棒性。\n對所有問題進行反向編碼會降低偏差水平，但並不能消除\n它們，表明這種效應不能歸因於順從偏差。\n我們的發現揭示了一個新出現的社會期望偏差，並暗示\n對使用心理測驗對 LLM 進行分析和使用 LLM 作為\n人類參與者的代理存在限制。", "author": "Aadesh Salecha et.al.", "authors": "Aadesh Salecha, Molly E. Ireland, Shashanka Subrahmanya, João Sedoc, Lyle H. Ungar, Johannes C. Eichstaedt", "id": "2405.06058v1", "paper_url": "http://arxiv.org/abs/2405.06058v1", "repo": "null"}}