{"2409.18938": {"publish_time": "2024-09-27", "title": "From Seconds to Hours: Reviewing MultiModal Large Language Models on Comprehensive Long Video Understanding", "paper_summary": "The integration of Large Language Models (LLMs) with visual encoders has\nrecently shown promising performance in visual understanding tasks, leveraging\ntheir inherent capability to comprehend and generate human-like text for visual\nreasoning. Given the diverse nature of visual data, MultiModal Large Language\nModels (MM-LLMs) exhibit variations in model designing and training for\nunderstanding images, short videos, and long videos. Our paper focuses on the\nsubstantial differences and unique challenges posed by long video understanding\ncompared to static image and short video understanding. Unlike static images,\nshort videos encompass sequential frames with both spatial and within-event\ntemporal information, while long videos consist of multiple events with\nbetween-event and long-term temporal information. In this survey, we aim to\ntrace and summarize the advancements of MM-LLMs from image understanding to\nlong video understanding. We review the differences among various visual\nunderstanding tasks and highlight the challenges in long video understanding,\nincluding more fine-grained spatiotemporal details, dynamic events, and\nlong-term dependencies. We then provide a detailed summary of the advancements\nin MM-LLMs in terms of model design and training methodologies for\nunderstanding long videos. Finally, we compare the performance of existing\nMM-LLMs on video understanding benchmarks of various lengths and discuss\npotential future directions for MM-LLMs in long video understanding.", "paper_summary_zh": "大型語言模型 (LLM) 與視覺編碼器的整合最近在視覺理解任務中展現出良好的效能，利用其理解和生成類人文本的內在能力進行視覺推理。考量到視覺資料的多元性，多模態大型語言模型 (MM-LLM) 在模型設計和訓練上展現出差異，以理解影像、短影片和長影片。我們的論文重點關注與靜態影像和短影片理解相比，長影片理解所帶來的顯著差異和獨特挑戰。與靜態影像不同，短影片包含具有空間和事件內時間資訊的連續畫面，而長影片則包含具有事件間和長期時間資訊的多個事件。在本次調查中，我們旨在追蹤和總結 MM-LLM 從影像理解到長影片理解的進展。我們檢視各種視覺理解任務之間的差異，並強調長影片理解中的挑戰，包括更細緻的時空細節、動態事件和長期依賴性。然後，我們針對模型設計和訓練方法詳細總結 MM-LLM 在理解長影片方面的進展。最後，我們比較現有 MM-LLM 在不同長度的影片理解基準上的效能，並討論 MM-LLM 在長影片理解中的潛在未來方向。", "author": "Heqing Zou et.al.", "authors": "Heqing Zou, Tianze Luo, Guiyang Xie, Victor, Zhang, Fengmao Lv, Guangcong Wang, Juanyang Chen, Zhuochen Wang, Hansheng Zhang, Huaijian Zhang", "id": "2409.18938v1", "paper_url": "http://arxiv.org/abs/2409.18938v1", "repo": "null"}}