{"2501.14305": {"publish_time": "2025-01-24", "title": "A Zero-Shot LLM Framework for Automatic Assignment Grading in Higher Education", "paper_summary": "Automated grading has become an essential tool in education technology due to\nits ability to efficiently assess large volumes of student work, provide\nconsistent and unbiased evaluations, and deliver immediate feedback to enhance\nlearning. However, current systems face significant limitations, including the\nneed for large datasets in few-shot learning methods, a lack of personalized\nand actionable feedback, and an overemphasis on benchmark performance rather\nthan student experience. To address these challenges, we propose a Zero-Shot\nLarge Language Model (LLM)-Based Automated Assignment Grading (AAG) system.\nThis framework leverages prompt engineering to evaluate both computational and\nexplanatory student responses without requiring additional training or\nfine-tuning. The AAG system delivers tailored feedback that highlights\nindividual strengths and areas for improvement, thereby enhancing student\nlearning outcomes. Our study demonstrates the system's effectiveness through\ncomprehensive evaluations, including survey responses from higher education\nstudents that indicate significant improvements in motivation, understanding,\nand preparedness compared to traditional grading methods. The results validate\nthe AAG system's potential to transform educational assessment by prioritizing\nlearning experiences and providing scalable, high-quality feedback.", "paper_summary_zh": "自動評分已成為教育技術中不可或缺的工具，因為它能有效評量大量的學生作業、提供一致且公正的評量，並提供立即回饋以增進學習。然而，目前的系統面臨嚴重的限制，包括少樣本學習方法中需要大量的資料集、缺乏個人化且可行的回饋，以及過度重視基準表現而非學生體驗。為了應對這些挑戰，我們提出了一個基於零樣本大型語言模型 (LLM) 的自動作業評分 (AAG) 系統。此架構利用提示工程來評量計算和說明性的學生回應，而不需要額外的訓練或微調。AAG 系統提供客製化的回饋，強調個人的優勢和需要改進的地方，從而增進學生的學習成果。我們的研究透過全面的評量來展示系統的有效性，包括來自高等教育學生的問卷調查回應，這些回應顯示與傳統評分方法相比，動機、理解力和準備度都有顯著的進步。結果驗證了 AAG 系統透過優先考慮學習體驗和提供可擴充、高品質的回饋，轉型教育評量的潛力。", "author": "Calvin Yeung et.al.", "authors": "Calvin Yeung, Jeff Yu, King Chau Cheung, Tat Wing Wong, Chun Man Chan, Kin Chi Wong, Keisuke Fujii", "id": "2501.14305v1", "paper_url": "http://arxiv.org/abs/2501.14305v1", "repo": "https://github.com/calvinyeungck/automated_assignment_grading"}}