{"2408.02442": {"publish_time": "2024-08-05", "title": "Let Me Speak Freely? A Study on the Impact of Format Restrictions on Performance of Large Language Models", "paper_summary": "Structured generation, the process of producing content in standardized\nformats like JSON and XML, is widely utilized in real-world applications to\nextract key output information from large language models (LLMs). This study\ninvestigates whether such constraints on generation space impact LLMs'\nabilities, including reasoning and domain knowledge comprehension.\nSpecifically, we evaluate LLMs' performance when restricted to adhere to\nstructured formats versus generating free-form responses across various common\ntasks. Surprisingly, we observe a significant decline in LLMs' reasoning\nabilities under format restrictions. Furthermore, we find that stricter format\nconstraints generally lead to greater performance degradation in reasoning\ntasks.", "paper_summary_zh": "結構化生成，即以 JSON 和 XML 等標準化格式製作內容的過程，廣泛用於實際應用中，從大型語言模型 (LLM) 中提取關鍵輸出資訊。本研究探討此類生成空間限制是否會影響 LLM 的能力，包括推理和領域知識理解。具體來說，我們評估 LLM 在受限於遵循結構化格式與在各種常見任務中產生自由形式回應時的表現。令人驚訝的是，我們觀察到 LLM 在格式限制下的推理能力顯著下降。此外，我們發現更嚴格的格式限制通常會導致推理任務的效能更差。", "author": "Zhi Rui Tam et.al.", "authors": "Zhi Rui Tam, Cheng-Kuang Wu, Yi-Lin Tsai, Chieh-Yen Lin, Hung-yi Lee, Yun-Nung Chen", "id": "2408.02442v1", "paper_url": "http://arxiv.org/abs/2408.02442v1", "repo": "null"}}