{"2407.07275": {"publish_time": "2024-07-09", "title": "Remastering Divide and Remaster: A Cinematic Audio Source Separation Dataset with Multilingual Support", "paper_summary": "Cinematic audio source separation (CASS) is a relatively new subtask of audio\nsource separation, concerned with the separation of a mixture into the\ndialogue, music, and effects stems. To date, only one publicly available\ndataset exists for CASS, that is, the Divide and Remaster (DnR) dataset, which\nis currently at version 2. While DnR v2 has been an incredibly useful resource\nfor CASS, several areas of improvement have been identified, particularly\nthrough its use in the 2023 Sound Demixing Challenge. In this work, we develop\nversion 3 of the DnR dataset, addressing issues relating to vocal content in\nnon-dialogue stems, loudness distributions, mastering process, and linguistic\ndiversity. In particular, the dialogue stem of DnR v3 includes speech content\nfrom more than 30 languages from multiple families including but not limited to\nthe Germanic, Romance, Indo-Aryan, Dravidian, Malayo-Polynesian, and Bantu\nfamilies. Benchmark results using the Bandit model indicated that training on\nmultilingual data yields significant generalizability to the model even in\nlanguages with low data availability. Even in languages with high data\navailability, the multilingual model often performs on par or better than\ndedicated models trained on monolingual CASS datasets.", "paper_summary_zh": "電影音訊來源分離 (CASS) 是音訊來源分離的相對較新的子任務，關注於將混合音訊分離為對話、音樂和效果音源。迄今為止，CASS 僅有一個公開可用的資料集，即 Divide and Remaster (DnR) 資料集，目前為版本 2。雖然 DnR v2 一直是 CASS 的一個非常有用的資源，但已經找出幾個改善領域，特別是透過在 2023 年 Sound Demixing Challenge 中使用它。在此工作中，我們開發了 DnR 資料集的版本 3，解決了與非對話音源中的語音內容、響度分佈、母帶處理和語言多樣性相關的問題。特別是，DnR v3 的對話音源包含來自 30 多種語言的語音內容，這些語言來自多個語系，包括但不限於日耳曼語系、羅曼語系、印度-雅利安語系、達羅毗荼語系、馬來-波利尼西亞語系和班圖語系。使用 Bandit 模型的基準結果表明，即使在資料可用性低的語言中，在多語言資料上進行訓練也會對模型產生顯著的泛化性。即使在資料可用性高的語言中，多語言模型的表現通常與在單語言 CASS 資料集上訓練的專用模型相當或更好。", "author": "Karn N. Watcharasupat et.al.", "authors": "Karn N. Watcharasupat, Chih-Wei Wu, Iroro Orife", "id": "2407.07275v1", "paper_url": "http://arxiv.org/abs/2407.07275v1", "repo": "null"}}