{"2407.12514": {"publish_time": "2024-07-17", "title": "On Initializing Transformers with Pre-trained Embeddings", "paper_summary": "It has become common practice now to use random initialization schemes,\nrather than the pre-trained embeddings, when training transformer based models\nfrom scratch. Indeed, we find that pre-trained word embeddings from GloVe, and\nsome sub-word embeddings extracted from language models such as T5 and mT5 fare\nmuch worse compared to random initialization. This is counter-intuitive given\nthe well-known representational and transfer-learning advantages of\npre-training. Interestingly, we also find that BERT and mBERT embeddings fare\nbetter than random initialization, showing the advantages of pre-trained\nrepresentations. In this work, we posit two potential factors that contribute\nto these mixed results: the model sensitivity to parameter distribution and the\nembedding interactions with position encodings. We observe that pre-trained\nGloVe, T5, and mT5 embeddings have a wider distribution of values. As argued in\nthe initialization studies, such large value initializations can lead to poor\ntraining because of saturated outputs. Further, the larger embedding values\ncan, in effect, absorb the smaller position encoding values when added\ntogether, thus losing position information. Standardizing the pre-trained\nembeddings to a narrow range (e.g. as prescribed by Xavier) leads to\nsubstantial gains for Glove, T5, and mT5 embeddings. On the other hand, BERT\npre-trained embeddings, while larger, are still relatively closer to Xavier\ninitialization range which may allow it to effectively transfer the pre-trained\nknowledge.", "paper_summary_zh": "現今已普遍使用隨機初始化方案，而不是預訓練嵌入，從頭開始訓練基於Transformer的模型。事實上，我們發現來自 GloVe 的預訓練字詞嵌入，以及從語言模型（例如 T5 和 mT5）中提取的一些子字詞嵌入，與隨機初始化相比，表現要差得多。這與預訓練的眾所周知的表示和遷移學習優勢相悖。有趣的是，我們還發現 BERT 和 mBERT 嵌入比隨機初始化表現得更好，顯示了預訓練表示的優點。在這項工作中，我們假設了兩個潛在因素導致了這些混合結果：模型對參數分佈的敏感性，以及嵌入與位置編碼的交互作用。我們觀察到預訓練的 GloVe、T5 和 mT5 嵌入具有更廣泛的數值分佈。正如初始化研究中所論證的，如此大的數值初始化可能會導致訓練不佳，因為輸出飽和。此外，較大的嵌入值在相加時實際上可以吸收較小的位置編碼值，從而失去位置資訊。將預訓練嵌入標準化到一個較窄的範圍（例如由 Xavier 規定）會為 Glove、T5 和 mT5 嵌入帶來顯著的收益。另一方面，BERT 預訓練嵌入雖然較大，但仍相對接近 Xavier 初始化範圍，這可能允許其有效地轉移預訓練知識。", "author": "Ha Young Kim et.al.", "authors": "Ha Young Kim, Niranjan Balasubramanian, Byungkon Kang", "id": "2407.12514v1", "paper_url": "http://arxiv.org/abs/2407.12514v1", "repo": "null"}}