{"2406.06467": {"publish_time": "2024-06-10", "title": "How Far Can Transformers Reason? The Locality Barrier and Inductive Scratchpad", "paper_summary": "Can Transformers predict new syllogisms by composing established ones? More\ngenerally, what type of targets can be learned by such models from scratch?\nRecent works show that Transformers can be Turing-complete in terms of\nexpressivity, but this does not address the learnability objective. This paper\nputs forward the notion of 'distribution locality' to capture when weak\nlearning is efficiently achievable by regular Transformers, where the locality\nmeasures the least number of tokens required in addition to the tokens\nhistogram to correlate nontrivially with the target. As shown experimentally\nand theoretically under additional assumptions, distributions with high\nlocality cannot be learned efficiently. In particular, syllogisms cannot be\ncomposed on long chains. Furthermore, we show that (i) an agnostic scratchpad\ncannot help to break the locality barrier, (ii) an educated scratchpad can help\nif it breaks the locality at each step, (iii) a notion of 'inductive\nscratchpad' can both break the locality and improve the out-of-distribution\ngeneralization, e.g., generalizing to almost double input size for some\narithmetic tasks.", "paper_summary_zh": "Transformer 能否透過組合已建立的三段論法來預測新的三段論法？更普遍地說，此類模型可以從頭學習哪種類型的目標？最近的研究顯示，Transformer 在表達能力方面可以是圖靈完備的，但這並未解決可學習性目標。本文提出了「分佈局部性」的概念，以捕捉在正規 Transformer 中何時可以有效達成弱學習，其中局部性衡量除了直方圖之外，與目標非平凡地相關聯所需的最小令牌數。如在額外的假設下透過實驗和理論所示，具有高局部性的分佈無法有效學習。特別是，三段論法無法在長鏈上組成。此外，我們證明 (i) 不可知備忘錄無法協助突破局部性障礙，(ii) 受過教育的備忘錄如果在每個步驟中打破局部性，就能提供協助，(iii) 「歸納備忘錄」的概念既能打破局部性，又能改善分佈外概化，例如，對於某些算術任務，概化到幾乎是輸入大小的兩倍。", "author": "Emmanuel Abbe et.al.", "authors": "Emmanuel Abbe, Samy Bengio, Aryo Lotfi, Colin Sandon, Omid Saremi", "id": "2406.06467v1", "paper_url": "http://arxiv.org/abs/2406.06467v1", "repo": "https://github.com/aryol/inductive-scratchpad"}}