{"2411.04747": {"publish_time": "2024-11-07", "title": "Equivariant Graph Attention Networks with Structural Motifs for Predicting Cell Line-Specific Synergistic Drug Combinations", "paper_summary": "Cancer is the second leading cause of death, with chemotherapy as one of the\nprimary forms of treatment. As a result, researchers are turning to drug\ncombination therapy to decrease drug resistance and increase efficacy. Current\nmethods of drug combination screening, such as in vivo and in vitro, are\ninefficient due to stark time and monetary costs. In silico methods have become\nincreasingly important for screening drugs, but current methods are inaccurate\nand generalize poorly to unseen anticancer drugs. In this paper, I employ a\ngeometric deep-learning model utilizing a graph attention network that is\nequivariant to 3D rotations, translations, and reflections with structural\nmotifs. Additionally, the gene expression of cancer cell lines is utilized to\nclassify synergistic drug combinations specific to each cell line. I compared\nthe proposed geometric deep learning framework to current state-of-the-art\n(SOTA) methods, and the proposed model architecture achieved greater\nperformance on all 12 benchmark tasks performed on the DrugComb dataset.\nSpecifically, the proposed framework outperformed other SOTA methods by an\naccuracy difference greater than 28%. Based on these results, I believe that\nthe equivariant graph attention network's capability of learning geometric data\naccounts for the large performance improvements. The model's ability to\ngeneralize to foreign drugs is thought to be due to the structural motifs\nproviding a better representation of the molecule. Overall, I believe that the\nproposed equivariant geometric deep learning framework serves as an effective\ntool for virtually screening anticancer drug combinations for further\nvalidation in a wet lab environment. The code for this work is made available\nonline at: https://github.com/WeToTheMoon/EGAT_DrugSynergy.", "paper_summary_zh": "癌症是第二大死亡原因，化疗是主要的治疗方式之一。因此，研究人员转向药物联合疗法来降低药物抗性和提高疗效。当前的药物组合筛选方法，如体内和体外，由于时间和金钱成本高昂而效率低下。计算机模拟方法对于药物筛选变得越来越重要，但当前的方法不准确，并且对未见的抗癌药物的概括性较差。在本文中，我采用了一个几何深度学习模型，该模型利用了一个图注意力网络，该网络对 3D 旋转、平移和具有结构基序的反射是等变的。此外，利用癌细胞系的基因表达对特定于每个细胞系的协同药物组合进行分类。我将提出的几何深度学习框架与当前最先进 (SOTA) 方法进行了比较，并且提出的模型架构在 DrugComb 数据集上执行的所有 12 项基准任务上都取得了更好的性能。具体来说，提出的框架比其他 SOTA 方法的准确性差异超过 28%。基于这些结果，我相信等变图注意力网络学习几何数据的能力可以解释巨大的性能提升。该模型对外国药物进行概括的能力被认为是由于结构基序提供了分子的更好表示。总体而言，我相信提出的等变几何深度学习框架作为一种有效的工具，用于虚拟筛选抗癌药物组合，以便在湿实验室环境中进一步验证。这项工作的代码在线提供：https://github.com/WeToTheMoon/EGAT_DrugSynergy。", "author": "Zachary Schwehr et.al.", "authors": "Zachary Schwehr", "id": "2411.04747v1", "paper_url": "http://arxiv.org/abs/2411.04747v1", "repo": "https://github.com/wetothemoon/egat_drugsynergy"}}