{"2501.09310": {"publish_time": "2025-01-16", "title": "A Study of In-Context-Learning-Based Text-to-SQL Errors", "paper_summary": "Large language models (LLMs) have been adopted to perform text-to-SQL tasks,\nutilizing their in-context learning (ICL) capability to translate natural\nlanguage questions into structured query language (SQL). However, such a\ntechnique faces correctness problems and requires efficient repairing\nsolutions. In this paper, we conduct the first comprehensive study of\ntext-to-SQL errors. Our study covers four representative ICL-based techniques,\nfive basic repairing methods, two benchmarks, and two LLM settings. We find\nthat text-to-SQL errors are widespread and summarize 29 error types of 7\ncategories. We also find that existing repairing attempts have limited\ncorrectness improvement at the cost of high computational overhead with many\nmis-repairs. Based on the findings, we propose MapleRepair, a novel text-to-SQL\nerror detection and repairing framework. The evaluation demonstrates that\nMapleRepair outperforms existing solutions by repairing 13.8% more queries with\nneglectable mis-repairs and 67.4% less overhead.", "paper_summary_zh": "大型語言模型 (LLM) 已被採用來執行文字轉 SQL 任務，\n利用其情境學習 (ICL) 能力將自然語言問題轉換為結構化查詢語言 (SQL)。然而，這種技術面臨正確性的問題，需要有效的修復解決方案。在本文中，我們進行了首次關於文字轉 SQL 錯誤的全面研究。我們的研究涵蓋四種具有代表性的基於 ICL 的技術、五種基本的修復方法、兩個基準測試和兩個 LLM 設定。我們發現文字轉 SQL 錯誤很普遍，並總結了 7 類別的 29 種錯誤類型。我們還發現，現有的修復嘗試以高運算成本為代價，導致許多錯誤修復，其正確性改進有限。根據這些發現，我們提出了 MapleRepair，一種新穎的文字轉 SQL 錯誤偵測和修復架構。評估結果證明，MapleRepair 優於現有解決方案，以可忽略的錯誤修復修復了多 13.8% 的查詢，並減少了 67.4% 的開銷。", "author": "Jiawei Shen et.al.", "authors": "Jiawei Shen, Chengcheng Wan, Ruoyi Qiao, Jiazhen Zou, Hang Xu, Yuchen Shao, Yueling Zhang, Weikai Miao, Geguang Pu", "id": "2501.09310v1", "paper_url": "http://arxiv.org/abs/2501.09310v1", "repo": "null"}}