{"2410.19419": {"publish_time": "2024-10-25", "title": "KAHANI: Culturally-Nuanced Visual Storytelling Pipeline for Non-Western Cultures", "paper_summary": "Large Language Models (LLMs) and Text-To-Image (T2I) models have demonstrated\nthe ability to generate compelling text and visual stories. However, their\noutputs are predominantly aligned with the sensibilities of the Global North,\noften resulting in an outsider's gaze on other cultures. As a result,\nnon-Western communities have to put extra effort into generating culturally\nspecific stories. To address this challenge, we developed a visual storytelling\npipeline called KAHANI that generates culturally grounded visual stories for\nnon-Western cultures. Our pipeline leverages off-the-shelf models GPT-4 Turbo\nand Stable Diffusion XL (SDXL). By using Chain of Thought (CoT) and T2I\nprompting techniques, we capture the cultural context from user's prompt and\ngenerate vivid descriptions of the characters and scene compositions. To\nevaluate the effectiveness of KAHANI, we conducted a comparative user study\nwith ChatGPT-4 (with DALL-E3) in which participants from different regions of\nIndia compared the cultural relevance of stories generated by the two tools.\nResults from the qualitative and quantitative analysis performed on the user\nstudy showed that KAHANI was able to capture and incorporate more Culturally\nSpecific Items (CSIs) compared to ChatGPT-4. In terms of both its cultural\ncompetence and visual story generation quality, our pipeline outperformed\nChatGPT-4 in 27 out of the 36 comparisons.", "paper_summary_zh": "大型語言模型 (LLM) 和文字轉圖像 (T2I) 模型已展現出生成引人入勝的文字和視覺故事的能力。然而，他們的輸出主要符合全球北方的思維，這通常導致對其他文化的外人觀點。因此，非西方社群必須付出額外的努力來產生具有文化特色的故事。為了應對這項挑戰，我們開發了一種名為 KAHANI 的視覺敘事管道，可為非西方文化產生具有文化基礎的視覺故事。我們的管道利用現成的模型 GPT-4 Turbo 和 Stable Diffusion XL (SDXL)。透過使用思考鏈 (CoT) 和 T2I 提示技巧，我們從使用者的提示中擷取文化背景，並產生角色和場景構圖的生動描述。為了評估 KAHANI 的效能，我們對 ChatGPT-4（搭配 DALL-E3）進行了一項比較使用者研究，其中來自印度不同地區的參與者比較了這兩個工具所產生故事的文化相關性。對使用者研究執行的定性和定量分析結果顯示，與 ChatGPT-4 相比，KAHANI 能夠擷取和納入更多文化特定項目 (CSI)。在文化能力和視覺故事生成品質方面，我們的管道在 36 次比較中勝過 ChatGPT-4 中的 27 次。", "author": "Hamna et.al.", "authors": "Hamna, Deepthi Sudharsan, Agrima Seth, Ritvik Budhiraja, Deepika Khullar, Vyshak Jain, Kalika Bali, Aditya Vashistha, Sameer Segal", "id": "2410.19419v1", "paper_url": "http://arxiv.org/abs/2410.19419v1", "repo": "null"}}