{"2408.01129": {"publish_time": "2024-08-02", "title": "A Survey of Mamba", "paper_summary": "Deep learning, as a vital technique, has sparked a notable revolution in\nartificial intelligence. As the most representative architecture, Transformers\nhave empowered numerous advanced models, especially the large language models\nthat comprise billions of parameters, becoming a cornerstone in deep learning.\nDespite the impressive achievements, Transformers still face inherent\nlimitations, particularly the time-consuming inference resulting from the\nquadratic computation complexity of attention calculation. Recently, a novel\narchitecture named Mamba, drawing inspiration from classical state space\nmodels, has emerged as a promising alternative for building foundation models,\ndelivering comparable modeling abilities to Transformers while preserving\nnear-linear scalability concerning sequence length. This has sparked an\nincreasing number of studies actively exploring Mamba's potential to achieve\nimpressive performance across diverse domains. Given such rapid evolution,\nthere is a critical need for a systematic review that consolidates existing\nMamba-empowered models, offering a comprehensive understanding of this emerging\nmodel architecture. In this survey, we therefore conduct an in-depth\ninvestigation of recent Mamba-associated studies, covering from three main\naspects: the advancements of Mamba-based models, the techniques of adapting\nMamba to diverse data, and the applications where Mamba can excel.\nSpecifically, we first recall the foundational knowledge of various\nrepresentative deep learning models and the details of Mamba as preliminaries.\nThen, to showcase the significance of Mamba, we comprehensively review the\nrelated studies focusing on Mamba models' architecture design, data\nadaptability, and applications. Finally, we present an discussion of current\nlimitations and explore various promising research directions to provide deeper\ninsights for future investigations.", "paper_summary_zh": "深度學習作為一項重要技術，在人工智慧領域引發了一場顯著的革命。作為最具代表性的架構，Transformer 已賦能多種進階模型，特別是包含數十億個參數的大型語言模型，成為深度學習的基石。儘管取得了令人印象深刻的成就，Transformer 仍然面臨固有的限制，特別是注意力計算的二次運算複雜度所導致的耗時推論。最近，一種名為 Mamba 的新架構，從經典狀態空間模型中汲取靈感，已成為構建基礎模型的有前途的替代方案，在保持與序列長度相關的近線性可擴充性的同時，提供了與 Transformer 相當的建模能力。這激發了越來越多的研究積極探索 Mamba 在不同領域實現令人印象深刻的效能的潛力。鑑於這種快速的演變，迫切需要進行系統性的回顧，以整合現有的 Mamba 賦能模型，對這種新興模型架構提供全面的理解。因此，在本次調查中，我們對最近與 Mamba 相關的研究進行了深入調查，涵蓋了三個主要方面：基於 Mamba 的模型的進展、將 Mamba 適應於不同資料的技術，以及 Mamba 可以發揮優勢的應用。具體來說，我們首先回顧了各種具有代表性的深度學習模型的基本知識和 Mamba 的詳細資訊作為預備知識。然後，為了展示 Mamba 的重要性，我們全面回顧了專注於 Mamba 模型的架構設計、資料適應性和應用相關的研究。最後，我們提出了對當前限制的討論，並探討了各種有前途的研究方向，以期為未來的調查提供更深入的見解。", "author": "Haohao Qu et.al.", "authors": "Haohao Qu, Liangbo Ning, Rui An, Wenqi Fan, Tyler Derr, Xin Xu, Qing Li", "id": "2408.01129v1", "paper_url": "http://arxiv.org/abs/2408.01129v1", "repo": "null"}}