{"2410.17489": {"publish_time": "2024-10-23", "title": "Unsupervised Domain Adaptation for Action Recognition via Self-Ensembling and Conditional Embedding Alignment", "paper_summary": "Recent advancements in deep learning-based wearable human action recognition\n(wHAR) have improved the capture and classification of complex motions, but\nadoption remains limited due to the lack of expert annotations and domain\ndiscrepancies from user variations. Limited annotations hinder the model's\nability to generalize to out-of-distribution samples. While data augmentation\ncan improve generalizability, unsupervised augmentation techniques must be\napplied carefully to avoid introducing noise. Unsupervised domain adaptation\n(UDA) addresses domain discrepancies by aligning conditional distributions with\nlabeled target samples, but vanilla pseudo-labeling can lead to error\npropagation. To address these challenges, we propose $\\mu$DAR, a novel joint\noptimization architecture comprised of three functions: (i) consistency\nregularizer between augmented samples to improve model classification\ngeneralizability, (ii) temporal ensemble for robust pseudo-label generation and\n(iii) conditional distribution alignment to improve domain generalizability.\nThe temporal ensemble works by aggregating predictions from past epochs to\nsmooth out noisy pseudo-label predictions, which are then used in the\nconditional distribution alignment module to minimize kernel-based class-wise\nconditional maximum mean discrepancy ($k$CMMD) between the source and target\nfeature space to learn a domain invariant embedding. The\nconsistency-regularized augmentations ensure that multiple augmentations of the\nsame sample share the same labels; this results in (a) strong generalization\nwith limited source domain samples and (b) consistent pseudo-label generation\nin target samples. The novel integration of these three modules in $\\mu$DAR\nresults in a range of $\\approx$ 4-12% average macro-F1 score improvement over\nsix state-of-the-art UDA methods in four benchmark wHAR datasets", "paper_summary_zh": "<paragraph>基於深度學習的可穿戴人類動作辨識 (wHAR) 近期進展改善了複雜動作的捕捉和分類，但由於缺乏專家註解和使用者變異的領域差異，採用率仍然有限。有限的註解阻礙了模型對分佈外樣本的泛化能力。雖然資料擴充可以改善泛化能力，但必須小心應用非監督擴充技術，以避免引入雜訊。非監督領域適應 (UDA) 透過將條件分佈與標籤目標樣本對齊來解決領域差異，但香草偽標籤可能會導致錯誤傳播。為了應對這些挑戰，我們提出了 $\\mu$DAR，這是一種由三個函數組成的全新聯合最佳化架構：(i) 擴充樣本之間的一致性正則化器，以改善模型分類的泛化能力，(ii) 時間整體用於強健的偽標籤產生，以及 (iii) 條件分佈對齊，以改善領域泛化能力。時間整體透過彙總過去各個時期的預測來平滑有雜訊的偽標籤預測，然後在條件分佈對齊模組中使用這些預測，以最小化來源和目標特徵空間之間基於核的類別條件最大平均差異 ($k$CMMD)，以學習領域不變嵌入。一致性正則化的擴充確保同一個樣本的多次擴充共享相同的標籤；這會導致 (a) 在來源領域樣本有限的情況下強大的泛化能力，以及 (b) 在目標樣本中一致的偽標籤產生。$\\mu$DAR 中這三個模組的新穎整合，導致在四個基準 wHAR 資料集中，六種最先進的 UDA 方法的平均巨觀 F1 分數提高了大約 4-12%</paragraph>", "author": "Indrajeet Ghosh et.al.", "authors": "Indrajeet Ghosh, Garvit Chugh, Abu Zaher Md Faridee, Nirmalya Roy", "id": "2410.17489v1", "paper_url": "http://arxiv.org/abs/2410.17489v1", "repo": "https://github.com/indrajeetghosh/udar_icdm"}}