{"2411.09102": {"publish_time": "2024-11-14", "title": "Provocation: Who benefits from \"inclusion\" in Generative AI?", "paper_summary": "The demands for accurate and representative generative AI systems means there\nis an increased demand on participatory evaluation structures. While these\nparticipatory structures are paramount to to ensure non-dominant values,\nknowledge and material culture are also reflected in AI models and the media\nthey generate, we argue that dominant structures of community participation in\nAI development and evaluation are not explicit enough about the benefits and\nharms that members of socially marginalized groups may experience as a result\nof their participation. Without explicit interrogation of these benefits by AI\ndevelopers, as a community we may remain blind to the immensity of systemic\nchange that is needed as well. To support this provocation, we present a\nspeculative case study, developed from our own collective experiences as AI\nresearchers. We use this speculative context to itemize the barriers that need\nto be overcome in order for the proposed benefits to marginalized communities\nto be realized, and harms mitigated.", "paper_summary_zh": "準確且具有代表性的生成式 AI 系統的需求，表示對於參與式評估結構的需求也隨之增加。雖然這些參與式結構對於確保非主流價值觀、知識和物質文化也能反映在 AI 模型和它們所生成的媒體中至關重要，但我們認為，AI 開發和評估中社群參與的主流結構並未明確說明社會邊緣化群體的成員可能會因參與而獲得的利益和損害。如果 AI 開發者未明確審視這些利益，我們這個社群可能會對系統性變革的廣大需求視而不見。為了支持這種挑釁，我們提出一個推測性的案例研究，這個研究是根據我們作為 AI 研究人員的集體經驗所發展出來的。我們使用這個推測性的脈絡來細目列出必須克服的障礙，才能讓邊緣化社群獲得建議的利益，並減輕損害。", "author": "Nari Johnson et.al.", "authors": "Nari Johnson, Siobhan Mackenzie Hall, Samantha Dalal", "id": "2411.09102v1", "paper_url": "http://arxiv.org/abs/2411.09102v1", "repo": "null"}}