{"2409.03291": {"publish_time": "2024-09-05", "title": "LLM Detectors Still Fall Short of Real World: Case of LLM-Generated Short News-Like Posts", "paper_summary": "With the emergence of widely available powerful LLMs, disinformation\ngenerated by large Language Models (LLMs) has become a major concern.\nHistorically, LLM detectors have been touted as a solution, but their\neffectiveness in the real world is still to be proven. In this paper, we focus\non an important setting in information operations -- short news-like posts\ngenerated by moderately sophisticated attackers.\n  We demonstrate that existing LLM detectors, whether zero-shot or\npurpose-trained, are not ready for real-world use in that setting. All tested\nzero-shot detectors perform inconsistently with prior benchmarks and are highly\nvulnerable to sampling temperature increase, a trivial attack absent from\nrecent benchmarks. A purpose-trained detector generalizing across LLMs and\nunseen attacks can be developed, but it fails to generalize to new\nhuman-written texts.\n  We argue that the former indicates domain-specific benchmarking is needed,\nwhile the latter suggests a trade-off between the adversarial evasion\nresilience and overfitting to the reference human text, with both needing\nevaluation in benchmarks and currently absent. We believe this suggests a\nre-consideration of current LLM detector benchmarking approaches and provides a\ndynamically extensible benchmark to allow it\n(https://github.com/Reliable-Information-Lab-HEVS/dynamic_llm_detector_benchmark).", "paper_summary_zh": "隨著廣泛可用的強大 LLM 的出現，大型語言模型 (LLM) 產生的錯誤訊息已成為一個主要問題。\n歷史上，LLM 偵測器被吹捧為一種解決方案，但它們在現實世界中的有效性仍有待證明。在本文中，我們專注於信息操作中的一個重要設定——由中等程度老練的攻擊者產生的類似新聞的短篇貼文。\n我們證明了現有的 LLM 偵測器，無論是零次學習或專門訓練的，都還不適合在該設定中用於真實世界。所有經過測試的零次學習偵測器與先前的基準測試表現不一致，並且極易受到採樣溫度增加的影響，這是最近基準測試中沒有的微不足道攻擊。可以開發出一個針對 LLM 和未知攻擊進行概括的專門訓練偵測器，但它無法概括到新的由人類撰寫的文本。\n我們認為前者表明需要特定領域的基準測試，而後者表明對抗性規避彈性和過度擬合參考人類文本之間存在權衡，兩者都需要在基準測試中進行評估，目前還沒有。我們相信這表明需要重新考慮當前 LLM 偵測器基準測試方法，並提供一個動態可擴充的基準測試來允許它（https://github.com/Reliable-Information-Lab-HEVS/dynamic_llm_detector_benchmark）。", "author": "Henrique Da Silva Gameiro et.al.", "authors": "Henrique Da Silva Gameiro, Andrei Kucharavy, Ljiljana Dolamic", "id": "2409.03291v1", "paper_url": "http://arxiv.org/abs/2409.03291v1", "repo": "null"}}