{"2406.02827": {"publish_time": "2024-06-05", "title": "Stochastic Diffusion: A Diffusion Probabilistic Model for Stochastic Time Series Forecasting", "paper_summary": "Recent innovations in diffusion probabilistic models have paved the way for\nsignificant progress in image, text and audio generation, leading to their\napplications in generative time series forecasting. However, leveraging such\nabilities to model highly stochastic time series data remains a challenge. In\nthis paper, we propose a novel Stochastic Diffusion (StochDiff) model which\nlearns data-driven prior knowledge at each time step by utilizing the\nrepresentational power of the stochastic latent spaces to model the variability\nof the multivariate time series data. The learnt prior knowledge helps the\nmodel to capture complex temporal dynamics and the inherent uncertainty of the\ndata. This improves its ability to model highly stochastic time series data.\nThrough extensive experiments on real-world datasets, we demonstrate the\neffectiveness of our proposed model on stochastic time series forecasting.\nAdditionally, we showcase an application of our model for real-world surgical\nguidance, highlighting its potential to benefit the medical community.", "paper_summary_zh": "最近在擴散機率模型的創新為影像、文字和音訊生成領域的顯著進展鋪路，並應用於生成式時序預測。然而，利用這些能力來建模高度隨機的時序資料仍然是一項挑戰。在本文中，我們提出一個新的隨機擴散 (StochDiff) 模型，它利用隨機潛在空間的表示能力在每個時間步長學習資料驅動的先驗知識，以建模多變量時序資料的變異性。學習到的先驗知識有助於模型捕捉複雜的時間動態和資料的內在不確定性。這改善了它建模高度隨機時序資料的能力。透過對真實世界資料集的廣泛實驗，我們展示了我們提出的模型在隨機時序預測上的有效性。此外，我們展示了我們模型在真實世界手術指導中的應用，突顯了它對醫學界潛在的益處。", "author": "Yuansan Liu et.al.", "authors": "Yuansan Liu, Sudanthi Wijewickrema, Dongting Hu, Christofer Bester, Stephen O'Leary, James Bailey", "id": "2406.02827v1", "paper_url": "http://arxiv.org/abs/2406.02827v1", "repo": "null"}}