{"2405.06145": {"publish_time": "2024-05-09", "title": "Reddit-Impacts: A Named Entity Recognition Dataset for Analyzing Clinical and Social Effects of Substance Use Derived from Social Media", "paper_summary": "Substance use disorders (SUDs) are a growing concern globally, necessitating\nenhanced understanding of the problem and its trends through data-driven\nresearch. Social media are unique and important sources of information about\nSUDs, particularly since the data in such sources are often generated by people\nwith lived experiences. In this paper, we introduce Reddit-Impacts, a\nchallenging Named Entity Recognition (NER) dataset curated from subreddits\ndedicated to discussions on prescription and illicit opioids, as well as\nmedications for opioid use disorder. The dataset specifically concentrates on\nthe lesser-studied, yet critically important, aspects of substance use--its\nclinical and social impacts. We collected data from chosen subreddits using the\npublicly available Application Programming Interface for Reddit. We manually\nannotated text spans representing clinical and social impacts reported by\npeople who also reported personal nonmedical use of substances including but\nnot limited to opioids, stimulants and benzodiazepines. Our objective is to\ncreate a resource that can enable the development of systems that can\nautomatically detect clinical and social impacts of substance use from\ntext-based social media data. The successful development of such systems may\nenable us to better understand how nonmedical use of substances affects\nindividual health and societal dynamics, aiding the development of effective\npublic health strategies. In addition to creating the annotated data set, we\napplied several machine learning models to establish baseline performances.\nSpecifically, we experimented with transformer models like BERT, and RoBERTa,\none few-shot learning model DANN by leveraging the full training dataset, and\nGPT-3.5 by using one-shot learning, for automatic NER of clinical and social\nimpacts. The dataset has been made available through the 2024 SMM4H shared\ntasks.", "paper_summary_zh": "物質使用疾患 (SUD) 在全球範圍內日益受到關注，這需要通過數據驅動的研究增強對問題及其趨勢的理解。社交媒體是關於 SUD 的獨特而重要的信息來源，特別是因為此類來源中的數據通常是由有親身經歷的人生成。在本文中，我們介紹了 Reddit-Impacts，這是一個具有挑戰性的命名實體識別 (NER) 數據集，它從專門討論處方和非法類鴉片藥物以及類鴉片藥物使用障礙藥物的子版塊中整理而成。該數據集特別關注物質使用中研究較少但至關重要的方面——其臨床和社會影響。我們使用 Reddit 的公開應用程式介面從選定的子版塊收集數據。我們手動註解了文本跨度，代表了那些報告了個人非醫療用途物質（包括但不限於類鴉片藥物、興奮劑和苯二氮卓類藥物）的人報告的臨床和社會影響。我們的目標是創建一個資源，它可以使系統的開發成為可能，該系統可以從基於文本的社交媒體數據中自動檢測物質使用的臨床和社會影響。此類系統的成功開發可能會使我們更好地了解非醫療用途物質如何影響個人健康和社會動態，從而幫助制定有效的公共衛生策略。除了創建註解數據集之外，我們還應用多個機器學習模型來建立基準性能。具體來說，我們對Transformer模型（如 BERT 和 RoBERTa）進行了試驗，一個通過利用完整訓練數據集的少樣本學習模型 DANN，以及通過使用一次性學習的 GPT-3.5，用於臨床和社會影響的自動 NER。該數據集已通過 2024 SMM4H 共享任務提供。", "author": "Yao Ge et.al.", "authors": "Yao Ge, Sudeshna Das, Karen O'Connor, Mohammed Ali Al-Garadi, Graciela Gonzalez-Hernandez, Abeed Sarker", "id": "2405.06145v1", "paper_url": "http://arxiv.org/abs/2405.06145v1", "repo": "null"}}