{"2502.09955": {"publish_time": "2025-02-14", "title": "Diverse Inference and Verification for Advanced Reasoning", "paper_summary": "Reasoning LLMs such as OpenAI o1, o3 and DeepSeek R1 have made significant\nprogress in mathematics and coding, yet find challenging advanced tasks such as\nInternational Mathematical Olympiad (IMO) combinatorics problems, Abstraction\nand Reasoning Corpus (ARC) puzzles, and Humanity's Last Exam (HLE) questions.\nWe use a diverse inference approach that combines multiple models and methods\nat test time. We find that verifying mathematics and code problems, and\nrejection sampling on other problems is simple and effective. We automatically\nverify correctness of solutions to IMO problems by Lean, and ARC puzzles by\ncode, and find that best-of-N effectively answers HLE questions. Our approach\nincreases answer accuracy on IMO combinatorics problems from 33.3% to 77.8%,\naccuracy on HLE questions from 8% to 37%, and solves 80% of ARC puzzles that\n948 humans could not and 26.5% of ARC puzzles that o3 high compute does not.\nTest-time simulations, reinforcement learning, and meta-learning with inference\nfeedback improve generalization by adapting agent graph representations and\nvarying prompts, code, and datasets. Our approach is reliable, robust, and\nscalable, and in the spirit of reproducible research, we will make it publicly\navailable upon publication.", "paper_summary_zh": "推理 LLM，例如 OpenAI o1、o3 和 DeepSeek R1，已在数学和编码方面取得了重大进展，但发现诸如国际数学奥林匹克竞赛 (IMO) 组合问题、抽象和推理语料库 (ARC) 谜题和人类最后考试 (HLE) 问题等高级任务具有挑战性。我们在测试时使用了一种结合了多种模型和方法的多样化推理方法。我们发现验证数学和代码问题以及对其他问题进行拒绝采样既简单又有效。我们通过 Lean 自动验证 IMO 问题的解决方案的正确性，并通过代码验证 ARC 谜题，并发现 N 中最优有效地回答了 HLE 问题。我们的方法将 IMO 组合问题的答案准确性从 33.3% 提高到 77.8%，将 HLE 问题的准确性从 8% 提高到 37%，并且解决了 948 人无法解决的 80% 的 ARC 谜题和 o3 高计算无法解决的 26.5% 的 ARC 谜题。测试时间模拟、强化学习和具有推理反馈的元学习通过调整代理图表示并改变提示、代码和数据集来提高泛化能力。我们的方法可靠、稳健且可扩展，并且本着可重复研究的精神，我们将在发表后公开提供。", "author": "Iddo Drori et.al.", "authors": "Iddo Drori, Gaston Longhitano, Mao Mao, Seunghwan Hyun, Yuke Zhang, Sungjun Park, Zachary Meeks, Xin-Yu Zhang, Ben Segev, Howard Yong, Nakul Verma, Avi Shporer, Alon Amit, Madeleine Udell", "id": "2502.09955v1", "paper_url": "http://arxiv.org/abs/2502.09955v1", "repo": "null"}}