{"2411.09763": {"publish_time": "2024-11-14", "title": "Evaluating the Predictive Capacity of ChatGPT for Academic Peer Review Outcomes Across Multiple Platforms", "paper_summary": "While previous studies have demonstrated that Large Language Models (LLMs)\ncan predict peer review outcomes to some extent, this paper builds on that by\nintroducing two new contexts and employing a more robust method - averaging\nmultiple ChatGPT scores. The findings that averaging 30 ChatGPT predictions,\nbased on reviewer guidelines and using only the submitted titles and abstracts,\nfailed to predict peer review outcomes for F1000Research (Spearman's rho=0.00).\nHowever, it produced mostly weak positive correlations with the quality\ndimensions of SciPost Physics (rho=0.25 for validity, rho=0.25 for originality,\nrho=0.20 for significance, and rho = 0.08 for clarity) and a moderate positive\ncorrelation for papers from the International Conference on Learning\nRepresentations (ICLR) (rho=0.38). Including the full text of articles\nsignificantly increased the correlation for ICLR (rho=0.46) and slightly\nimproved it for F1000Research (rho=0.09), while it had variable effects on the\nfour quality dimension correlations for SciPost LaTeX files. The use of\nchain-of-thought system prompts slightly increased the correlation for\nF1000Research (rho=0.10), marginally reduced it for ICLR (rho=0.37), and\nfurther decreased it for SciPost Physics (rho=0.16 for validity, rho=0.18 for\noriginality, rho=0.18 for significance, and rho=0.05 for clarity). Overall, the\nresults suggest that in some contexts, ChatGPT can produce weak pre-publication\nquality assessments. However, the effectiveness of these assessments and the\noptimal strategies for employing them vary considerably across different\nplatforms, journals, and conferences. Additionally, the most suitable inputs\nfor ChatGPT appear to differ depending on the platform.", "paper_summary_zh": "<paragraph>儘管先前的研究已證實大型語言模型 (LLM)\n在某種程度上可以預測同行評審結果，但本文建立在該基礎上，\n引入了兩個新的脈絡，並採用更強健的方法 - 平均\n多個 ChatGPT 分數。研究結果顯示，平均 30 個 ChatGPT 預測，\n根據審查員指南，僅使用提交的標題和摘要，\n無法預測 F1000Research 的同行評審結果（Spearman's rho=0.00）。\n然而，它產生了與 SciPost Physics 的品質向度呈弱正相關（rho=0.25 表示有效性，rho=0.25 表示獨創性，\nrho=0.20 表示重要性，rho = 0.08 表示清晰度）以及與國際學習表徵會議（ICLR）論文的中等正相關\n（rho=0.38）。包含文章的全文顯著增加了 ICLR 的相關性（rho=0.46），並略微\n改善了 F1000Research（rho=0.09），而它對 SciPost LaTeX 檔案的四個品質向度相關性有不同的影響。使用\n思考鏈系統提示略微增加了 F1000Research 的相關性（rho=0.10），略微降低了 ICLR 的相關性（rho=0.37），並\n進一步降低了 SciPost Physics 的相關性（rho=0.16 表示有效性，rho=0.18 表示獨創性，rho=0.18 表示重要性，rho=0.05 表示清晰度）。總的來說，\n結果表明，在某些情況下，ChatGPT 可以產生弱的出版前品質評估。然而，這些評估的有效性以及採用它們的最佳策略在不同的\n平台、期刊和會議之間有很大差異。此外，ChatGPT 最合適的輸入似乎會根據平台而有所不同。</paragraph>", "author": "Mike Thelwall et.al.", "authors": "Mike Thelwall, Abdullah Yaghi", "id": "2411.09763v1", "paper_url": "http://arxiv.org/abs/2411.09763v1", "repo": "null"}}