{"2407.12196": {"publish_time": "2024-07-16", "title": "MASIVE: Open-Ended Affective State Identification in English and Spanish", "paper_summary": "In the field of emotion analysis, much NLP research focuses on identifying a\nlimited number of discrete emotion categories, often applied across languages.\nThese basic sets, however, are rarely designed with textual data in mind, and\nculture, language, and dialect can influence how particular emotions are\ninterpreted. In this work, we broaden our scope to a practically unbounded set\nof \\textit{affective states}, which includes any terms that humans use to\ndescribe their experiences of feeling. We collect and publish MASIVE, a dataset\nof Reddit posts in English and Spanish containing over 1,000 unique affective\nstates each. We then define the new problem of \\textit{affective state\nidentification} for language generation models framed as a masked span\nprediction task. On this task, we find that smaller finetuned multilingual\nmodels outperform much larger LLMs, even on region-specific Spanish affective\nstates. Additionally, we show that pretraining on MASIVE improves model\nperformance on existing emotion benchmarks. Finally, through machine\ntranslation experiments, we find that native speaker-written data is vital to\ngood performance on this task.", "paper_summary_zh": "在情感分析领域，许多 NLP 研究专注于识别数量有限的离散情感类别，通常应用于各种语言。\n然而，这些基本集合很少考虑文本数据，而文化、语言和方言会影响特定情感的解读方式。\n在这项工作中，我们将范围拓宽到一个实际上不受限的「情感状态」集合，其中包括人类用来描述其感受体验的任何术语。\n我们收集并发布了 MASIVE，这是一个包含 1,000 多个独特情感状态的英语和西班牙语 Reddit 帖子数据集。\n然后，我们为语言生成模型定义了「情感状态识别」的新问题，将其构建为一个掩码跨度预测任务。\n在这个任务中，我们发现较小的微调多语言模型优于大得多的 LLM，即使在特定区域的西班牙语情感状态上也是如此。\n此外，我们表明在 MASIVE 上进行预训练可以提高模型在现有情感基准上的性能。\n最后，通过机器翻译实验，我们发现母语人士撰写的数据对于这项任务的良好表现至关重要。", "author": "Nicholas Deas et.al.", "authors": "Nicholas Deas, Elsbeth Turcan, Iván Pérez Mejía, Kathleen McKeown", "id": "2407.12196v1", "paper_url": "http://arxiv.org/abs/2407.12196v1", "repo": "null"}}