{"2409.03811": {"publish_time": "2024-09-05", "title": "PARCO: Learning Parallel Autoregressive Policies for Efficient Multi-Agent Combinatorial Optimization", "paper_summary": "Multi-agent combinatorial optimization problems such as routing and\nscheduling have great practical relevance but present challenges due to their\nNP-hard combinatorial nature, hard constraints on the number of possible\nagents, and hard-to-optimize objective functions. This paper introduces PARCO\n(Parallel AutoRegressive Combinatorial Optimization), a novel approach that\nlearns fast surrogate solvers for multi-agent combinatorial problems with\nreinforcement learning by employing parallel autoregressive decoding. We\npropose a model with a Multiple Pointer Mechanism to efficiently decode\nmultiple decisions simultaneously by different agents, enhanced by a\nPriority-based Conflict Handling scheme. Moreover, we design specialized\nCommunication Layers that enable effective agent collaboration, thus enriching\ndecision-making. We evaluate PARCO in representative multi-agent combinatorial\nproblems in routing and scheduling and demonstrate that our learned solvers\noffer competitive results against both classical and neural baselines in terms\nof both solution quality and speed. We make our code openly available at\nhttps://github.com/ai4co/parco.", "paper_summary_zh": "多代理組合優化問題，如路由和排程，具有極大的實用性，但由於其 NP 難組合性質、代理數量上的硬約束和難以最佳化的目標函數，因此提出了挑戰。本文介紹了 PARCO（並行自回歸組合優化），這是一種新穎的方法，它通過採用並行自回歸解碼，學習多代理組合問題的快速代理求解器，並進行強化學習。我們提出了一個具有多指標機制的模型，以通過不同的代理同時有效地解碼多個決策，並通過基於優先級的衝突處理方案進行增強。此外，我們設計了專門的通信層，以實現有效的代理協作，從而豐富決策制定。我們在路由和排程中的代表性多代理組合問題中評估了 PARCO，並證明我們的學習求解器在解決方案質量和速度方面都提供了與經典和神經基線相比具有競爭力的結果。我們在 https://github.com/ai4co/parco 上公開了我們的代碼。", "author": "Federico Berto et.al.", "authors": "Federico Berto, Chuanbo Hua, Laurin Luttmann, Jiwoo Son, Junyoung Park, Kyuree Ahn, Changhyun Kwon, Lin Xie, Jinkyoo Park", "id": "2409.03811v1", "paper_url": "http://arxiv.org/abs/2409.03811v1", "repo": "null"}}