{"2407.21039": {"publish_time": "2024-07-20", "title": "Mapping Patient Trajectories: Understanding and Visualizing Sepsis Prognostic Pathways from Patients Clinical Narratives", "paper_summary": "In recent years, healthcare professionals are increasingly emphasizing on\npersonalized and evidence-based patient care through the exploration of\nprognostic pathways. To study this, structured clinical variables from\nElectronic Health Records (EHRs) data have traditionally been employed by many\nresearchers. Presently, Natural Language Processing models have received great\nattention in clinical research which expanded the possibilities of using\nclinical narratives. In this paper, we propose a systematic methodology for\ndeveloping sepsis prognostic pathways derived from clinical notes, focusing on\ndiverse patient subgroups identified by exploring comorbidities associated with\nsepsis and generating explanations of these subgroups using SHAP. The extracted\nprognostic pathways of these subgroups provide valuable insights into the\ndynamic trajectories of sepsis severity over time. Visualizing these pathways\nsheds light on the likelihood and direction of disease progression across\nvarious contexts and reveals patterns and pivotal factors or biomarkers\ninfluencing the transition between sepsis stages, whether toward deterioration\nor improvement. This empowers healthcare providers to implement more\npersonalized and effective healthcare strategies for individual patients.", "paper_summary_zh": "近年來，醫療保健專業人士越來越重視透過探索預後途徑來提供個人化且基於證據的患者照護。為研究此議題，許多研究人員傳統上採用電子健康紀錄 (EHR) 資料中的結構化臨床變數。目前，自然語言處理模型在臨床研究中備受重視，擴大了使用臨床敘述的可能性。在本文中，我們提出一個系統化的方法，用於開發從臨床筆記中衍生的敗血症預後途徑，重點在於探索與敗血症相關的併發症所識別出的不同患者子群，並使用 SHAP 產生這些子群的說明。這些子群中萃取出的預後途徑提供了有價值的見解，了解敗血症嚴重程度隨著時間推移的動態軌跡。視覺化這些途徑有助於了解疾病進展在各種情境下的可能性和方向，並揭示影響敗血症階段轉變的模式和關鍵因素或生物標記，無論是惡化或改善。這使醫療保健提供者能夠為個別患者實施更個人化且有效的醫療保健策略。", "author": "Sudeshna Jana et.al.", "authors": "Sudeshna Jana, Tirthankar Dasgupta, Lipika Dey", "id": "2407.21039v1", "paper_url": "http://arxiv.org/abs/2407.21039v1", "repo": "null"}}