{"2408.03561": {"publish_time": "2024-08-07", "title": "MPC-Minimized Secure LLM Inference", "paper_summary": "Many inference services based on large language models (LLMs) pose a privacy\nconcern, either revealing user prompts to the service or the proprietary\nweights to the user. Secure inference offers a solution to this problem through\nsecure multi-party computation (MPC), however, it is still impractical for\nmodern LLM workload due to the large overhead imposed by MPC. To address this\noverhead, we propose Marill, a framework that adapts LLM fine-tuning to\nminimize MPC usage during secure inference. Marill introduces high-level\narchitectural changes during fine-tuning that significantly reduce the number\nof expensive operations needed within MPC during inference, by removing some\nand relocating others outside MPC without compromising security. As a result,\nMarill-generated models are more efficient across all secure inference\nprotocols and our approach complements MPC-friendly approximations for such\noperations. Compared to standard fine-tuning, Marill results in 3.6-11.3x\nbetter runtime and 2.4-6.9x better communication during secure inference across\nvarious MPC settings, while typically preserving over 90% performance across\ndownstream tasks.", "paper_summary_zh": "許多基於大型語言模型 (LLM) 的推論服務會造成隱私問題，因為它們會向服務揭露使用者的提示，或向使用者揭露專有權重。安全推論透過安全多方運算 (MPC) 提供了解決此問題的方法，然而，由於 MPC 帶來的龐大開銷，對於現代 LLM 工作負載而言，它仍然不切實際。為了解決這個開銷問題，我們提出了 Marill，一個框架，它採用 LLM 微調來將安全推論期間的 MPC 使用量降至最低。Marill 在微調期間引入了高階架構變更，藉由移除一些昂貴運算，並將其他運算移至 MPC 外部，大幅減少在推論期間 MPC 內部所需的昂貴運算數量，同時不損害安全性。因此，Marill 生成的模型在所有安全推論協定中都更有效率，而且我們的方法補充了這些運算的 MPC 友善近似值。與標準微調相比，Marill 在各種 MPC 設定下的安全推論中，執行時間改善了 3.6-11.3 倍，通訊改善了 2.4-6.9 倍，同時在下游任務中通常保留了超過 90% 的效能。", "author": "Deevashwer Rathee et.al.", "authors": "Deevashwer Rathee, Dacheng Li, Ion Stoica, Hao Zhang, Raluca Popa", "id": "2408.03561v1", "paper_url": "http://arxiv.org/abs/2408.03561v1", "repo": "null"}}