{"2405.07601": {"publish_time": "2024-05-13", "title": "On-device Online Learning and Semantic Management of TinyML Systems", "paper_summary": "Recent advances in Tiny Machine Learning (TinyML) empower low-footprint\nembedded devices for real-time on-device Machine Learning. While many\nacknowledge the potential benefits of TinyML, its practical implementation\npresents unique challenges. This study aims to bridge the gap between\nprototyping single TinyML models and developing reliable TinyML systems in\nproduction: (1) Embedded devices operate in dynamically changing conditions.\nExisting TinyML solutions primarily focus on inference, with models trained\noffline on powerful machines and deployed as static objects. However, static\nmodels may underperform in the real world due to evolving input data\ndistributions. We propose online learning to enable training on constrained\ndevices, adapting local models towards the latest field conditions. (2)\nNevertheless, current on-device learning methods struggle with heterogeneous\ndeployment conditions and the scarcity of labeled data when applied across\nnumerous devices. We introduce federated meta-learning incorporating online\nlearning to enhance model generalization, facilitating rapid learning. This\napproach ensures optimal performance among distributed devices by knowledge\nsharing. (3) Moreover, TinyML's pivotal advantage is widespread adoption.\nEmbedded devices and TinyML models prioritize extreme efficiency, leading to\ndiverse characteristics ranging from memory and sensors to model architectures.\nGiven their diversity and non-standardized representations, managing these\nresources becomes challenging as TinyML systems scale up. We present semantic\nmanagement for the joint management of models and devices at scale. We\ndemonstrate our methods through a basic regression example and then assess them\nin three real-world TinyML applications: handwritten character image\nclassification, keyword audio classification, and smart building presence\ndetection, confirming our approaches' effectiveness.", "paper_summary_zh": "<paragraph>微型機器學習 (TinyML) 的最新進展賦能低佔用空間的嵌入式裝置，進行即時裝置上機器學習。雖然許多人承認 TinyML 的潛在好處，但其實際執行會產生獨特挑戰。本研究旨在彌合單一 TinyML 模型原型製作與在生產環境中開發可靠 TinyML 系統之間的差距：(1) 嵌入式裝置在動態變化的條件下操作。現有的 TinyML 解決方案主要關注推理，其中模型在功能強大的機器上離線訓練，並作為靜態物件部署。然而，由於輸入資料分佈不斷演變，靜態模型在現實世界中的表現可能不佳。我們建議進行線上學習，以在受限裝置上進行訓練，讓在地模型適應最新的現場條件。(2) 儘管如此，當應用於眾多裝置時，目前的裝置上學習方法仍難以應對異質部署條件和標籤資料的稀少性。我們引入了結合線上學習的聯邦元學習，以增強模型泛化，促進快速學習。此方法透過知識分享，確保分散式裝置之間的最佳效能。(3) 此外，TinyML 的關鍵優勢是廣泛採用。嵌入式裝置和 TinyML 模型優先考慮極致效率，導致從記憶體和感測器到模型架構等多樣化的特性。考量到它們的多樣性和非標準化表示，隨著 TinyML 系統擴展，管理這些資源將變得具有挑戰性。我們展示了用於大規模聯合管理模型和裝置的語義管理。我們透過一個基本的回歸範例展示我們的這些方法，然後在三個真實世界的 TinyML 應用中評估它們：手寫字元影像分類、關鍵字音訊分類和智慧建築中的存在偵測，證實了我們方法的有效性。</paragraph>", "author": "Haoyu Ren et.al.", "authors": "Haoyu Ren, Xue Li, Darko Anicic, Thomas A. Runkler", "id": "2405.07601v1", "paper_url": "http://arxiv.org/abs/2405.07601v1", "repo": "null"}}