{"2412.11985": {"publish_time": "2024-12-16", "title": "Speak & Improve Challenge 2025: Tasks and Baseline Systems", "paper_summary": "This paper presents the \"Speak & Improve Challenge 2025: Spoken Language\nAssessment and Feedback\" -- a challenge associated with the ISCA SLaTE 2025\nWorkshop. The goal of the challenge is to advance research on spoken language\nassessment and feedback, with tasks associated with both the underlying\ntechnology and language learning feedback. Linked with the challenge, the Speak\n& Improve (S&I) Corpus 2025 is being pre-released, a dataset of L2 learner\nEnglish data with holistic scores and language error annotation, collected from\nopen (spontaneous) speaking tests on the Speak & Improve learning platform. The\ncorpus consists of 340 hours of audio data from second language English\nlearners with holistic scores, and a 60-hour subset with manual transcriptions\nand error labels. The Challenge has four shared tasks: Automatic Speech\nRecognition (ASR), Spoken Language Assessment (SLA), Spoken Grammatical Error\nCorrection (SGEC), and Spoken Grammatical Error Correction Feedback (SGECF).\nEach of these tasks has a closed track where a predetermined set of models and\ndata sources are allowed to be used, and an open track where any public\nresource may be used. Challenge participants may do one or more of the tasks.\nThis paper describes the challenge, the S&I Corpus 2025, and the baseline\nsystems released for the Challenge.", "paper_summary_zh": "本論文提出「2025 年說與改進挑戰：口說語言評量與回饋」-- 一項與 ISCA SLaTE 2025 工作坊相關的挑戰。此挑戰的目標是推進對口說語言評量與回饋的研究，任務與基礎技術和語言學習回饋兩者相關。與此挑戰相關的「2025 年說與改進 (S&I) 語料庫」正在預先發布，這是一個 L2 學習者英語資料的資料集，包含整體分數和語言錯誤註解，從「說與改進」學習平台上的開放式 (自發性) 口說測驗收集而來。此語料庫包含來自第二語言英語學習者的 340 小時音訊資料，並附有整體分數，以及一個包含手動轉錄和錯誤標籤的 60 小時子集。此挑戰有四項共用任務：自動語音辨識 (ASR)、口說語言評量 (SLA)、口說文法錯誤修正 (SGEC) 和口說文法錯誤修正回饋 (SGECF)。每個任務都有封閉軌道，其中允許使用預先決定的模型和資料來源，以及開放軌道，其中可以使用任何公開資源。挑戰參與者可以執行一項或多項任務。本文說明了挑戰、「2025 年說與改進語料庫」以及為挑戰發布的基線系統。", "author": "Mengjie Qian et.al.", "authors": "Mengjie Qian, Kate Knill, Stefano Banno, Siyuan Tang, Penny Karanasou, Mark J. F. Gales, Diane Nicholls", "id": "2412.11985v1", "paper_url": "http://arxiv.org/abs/2412.11985v1", "repo": "null"}}