{"2405.20527": {"publish_time": "2024-05-30", "title": "Towards Ontology-Enhanced Representation Learning for Large Language Models", "paper_summary": "Taking advantage of the widespread use of ontologies to organise and\nharmonize knowledge across several distinct domains, this paper proposes a\nnovel approach to improve an embedding-Large Language Model (embedding-LLM) of\ninterest by infusing the knowledge formalized by a reference ontology:\nontological knowledge infusion aims at boosting the ability of the considered\nLLM to effectively model the knowledge domain described by the infused\nontology. The linguistic information (i.e. concept synonyms and descriptions)\nand structural information (i.e. is-a relations) formalized by the ontology are\nutilized to compile a comprehensive set of concept definitions, with the\nassistance of a powerful generative LLM (i.e. GPT-3.5-turbo). These concept\ndefinitions are then employed to fine-tune the target embedding-LLM using a\ncontrastive learning framework. To demonstrate and evaluate the proposed\napproach, we utilize the biomedical disease ontology MONDO. The results show\nthat embedding-LLMs enhanced by ontological disease knowledge exhibit an\nimproved capability to effectively evaluate the similarity of in-domain\nsentences from biomedical documents mentioning diseases, without compromising\ntheir out-of-domain performance.", "paper_summary_zh": "<paragraph>利用本体論廣泛用於組織和調和不同領域間的知識，本文提出了一種新方法來改進嵌入式大型語言模型 (embedding-LLM) 的興趣，方法是注入由參考本体論形式化的知識：本体論知識注入旨在提升所考慮的 LLM 有效建模由注入的本体論所描述的知識領域的能力。由本体論形式化的語言資訊（即概念同義詞和描述）和結構資訊（即 is-a 關係）用於編譯一組全面的概念定義，並在強大的生成式 LLM（即 GPT-3.5-turbo）的協助下進行。然後，這些概念定義被用於使用對比學習架構微調目標嵌入式 LLM。為了展示和評估所提出的方法，我們利用生物醫學疾病本体論 MONDO。結果表明，由本体論疾病知識增強的嵌入式 LLM 表現出有效評估提及疾病的生物醫學文件中的同域句子相似性的改進能力，而不會損害其域外效能。</paragraph>", "author": "Francesco Ronzano et.al.", "authors": "Francesco Ronzano, Jay Nanavati", "id": "2405.20527v1", "paper_url": "http://arxiv.org/abs/2405.20527v1", "repo": "null"}}