{"2405.18780": {"publish_time": "2024-05-29", "title": "Quantitative Certification of Bias in Large Language Models", "paper_summary": "Large Language Models (LLMs) can produce responses that exhibit social biases\nand support stereotypes. However, conventional benchmarking is insufficient to\nthoroughly evaluate LLM bias, as it can not scale to large sets of prompts and\nprovides no guarantees. Therefore, we propose a novel certification framework\nQuaCer-B (Quantitative Certification of Bias) that provides formal guarantees\non obtaining unbiased responses from target LLMs under large sets of prompts. A\ncertificate consists of high-confidence bounds on the probability of obtaining\nbiased responses from the LLM for any set of prompts containing sensitive\nattributes, sampled from a distribution. We illustrate the bias certification\nin LLMs for prompts with various prefixes drawn from given distributions. We\nconsider distributions of random token sequences, mixtures of manual\njailbreaks, and jailbreaks in the LLM's embedding space to certify its bias. We\ncertify popular LLMs with QuaCer-B and present novel insights into their\nbiases.", "paper_summary_zh": "大型語言模型 (LLM) 可以產生表現出社會偏見和支持刻板印象的回應。然而，傳統的基準測試不足以徹底評估 LLM 偏見，因為它無法擴展到大量的提示，而且無法提供保證。因此，我們提出了一個新的認證框架 QuaCer-B（偏見的定量認證），它提供了在大量提示下從目標 LLM 獲得無偏見回應的正式保證。證書包含從分佈中抽取的包含敏感屬性的任何一組提示，從 LLM 獲得偏見回應的機率的高置信度界限。我們說明了 LLM 在具有從給定分佈中抽取的各種前綴的提示中的偏見認證。我們考慮隨機令牌序列的分佈、手動越獄的混合以及 LLM 嵌入空間中的越獄來驗證其偏見。我們使用 QuaCer-B 認證流行的 LLM，並提出對其偏見的新見解。", "author": "Isha Chaudhary et.al.", "authors": "Isha Chaudhary, Qian Hu, Manoj Kumar, Morteza Ziyadi, Rahul Gupta, Gagandeep Singh", "id": "2405.18780v1", "paper_url": "http://arxiv.org/abs/2405.18780v1", "repo": "null"}}