{"2501.02979": {"publish_time": "2025-01-06", "title": "Registering Source Tokens to Target Language Spaces in Multilingual Neural Machine Translation", "paper_summary": "The multilingual neural machine translation (MNMT) enables arbitrary\ntranslations across multiple languages by training a model with limited\nparameters using parallel data only. However, the performance of such MNMT\nmodels still lags behind that of large language models (LLMs), limiting their\npracticality. In this work, we address this limitation by introducing\nregistering to achieve the new state-of-the-art of decoder-only MNMT models.\nSpecifically, we insert a set of artificial tokens specifying the target\nlanguage, called registers, into the input sequence between the source and\ntarget tokens. By modifying the attention mask, the target token generation\nonly pays attention to the activation of registers, representing the source\ntokens in the target language space. Experiments on EC-40, a large-scale\nbenchmark, show that our method outperforms related methods driven by\noptimizing multilingual representations. We further scale up and collect 9.3\nbillion sentence pairs across 24 languages from public datasets to pre-train\ntwo models, namely MITRE (multilingual translation with registers). One of\nthem, MITRE-913M, outperforms NLLB-3.3B, achieves comparable performance with\ncommercial LLMs, and shows strong adaptability in fine-tuning. Finally, we\nopen-source our models to facilitate further research and development in MNMT:\nhttps://github.com/zhiqu22/mitre.", "paper_summary_zh": "多語言神經機器翻譯 (MNMT) 僅使用平行數據訓練具有有限參數的模型，即可在多種語言之間進行任意翻譯。然而，此類 MNMT 模型的效能仍落後於大型語言模型 (LLM)，限制了其實用性。在這項工作中，我們透過引進註冊來解決此限制，以達成僅解碼器 MNMT 模型的最新技術水準。具體來說，我們在來源和目標標記之間的輸入序列中插入一組指定目標語言的人工標記，稱為註冊。透過修改注意力遮罩，目標標記產生只會注意註冊的啟動，表示目標語言空間中的來源標記。在大型基準 EC-40 上進行的實驗顯示，我們的方法優於由最佳化多語言表示驅動的相關方法。我們進一步擴展規模，並從公共資料集中收集了 24 種語言的 93 億個句子對，以預先訓練兩個模型，即 MITRE（具註冊的多語言翻譯）。其中之一，MITRE-913M，優於 NLLB-3.3B，達到與商用 LLM 相當的效能，並在微調中展現強大的適應性。最後，我們開放原始碼模型，以利於進一步研究和開發 MNMT：\nhttps://github.com/zhiqu22/mitre。", "author": "Zhi Qu et.al.", "authors": "Zhi Qu, Yiran Wang, Jiannan Mao, Chenchen Ding, Hideki Tanaka, Masao Utiyama, Taro Watanabe", "id": "2501.02979v1", "paper_url": "http://arxiv.org/abs/2501.02979v1", "repo": "https://github.com/zhiqu22/mitre"}}