{"2405.18137": {"publish_time": "2024-05-28", "title": "Exploiting LLM Quantization", "paper_summary": "Quantization leverages lower-precision weights to reduce the memory usage of\nlarge language models (LLMs) and is a key technique for enabling their\ndeployment on commodity hardware. While LLM quantization's impact on utility\nhas been extensively explored, this work for the first time studies its adverse\neffects from a security perspective. We reveal that widely used quantization\nmethods can be exploited to produce a harmful quantized LLM, even though the\nfull-precision counterpart appears benign, potentially tricking users into\ndeploying the malicious quantized model. We demonstrate this threat using a\nthree-staged attack framework: (i) first, we obtain a malicious LLM through\nfine-tuning on an adversarial task; (ii) next, we quantize the malicious model\nand calculate constraints that characterize all full-precision models that map\nto the same quantized model; (iii) finally, using projected gradient descent,\nwe tune out the poisoned behavior from the full-precision model while ensuring\nthat its weights satisfy the constraints computed in step (ii). This procedure\nresults in an LLM that exhibits benign behavior in full precision but when\nquantized, it follows the adversarial behavior injected in step (i). We\nexperimentally demonstrate the feasibility and severity of such an attack\nacross three diverse scenarios: vulnerable code generation, content injection,\nand over-refusal attack. In practice, the adversary could host the resulting\nfull-precision model on an LLM community hub such as Hugging Face, exposing\nmillions of users to the threat of deploying its malicious quantized version on\ntheir devices.", "paper_summary_zh": "量化利用低精度權重來減少大型語言模型 (LLM) 的記憶體使用量，並且是讓它們能夠在商品硬體上部署的關鍵技術。儘管 LLM 量化對效用的影響已廣泛探討，但這項工作首次從安全角度研究其負面影響。我們揭露廣泛使用的量化方法可以被利用來產生有害的量化 LLM，即使全精度對應物看起來是良性的，潛在地誘騙使用者部署惡意的量化模型。我們使用三階段攻擊架構來展示此威脅：(i) 首先，我們透過在對抗任務上進行微調來獲得惡意 LLM；(ii) 接著，我們量化惡意模型並計算出描述所有映射到相同量化模型的全精度模型的約束；(iii) 最後，使用投影梯度下降，我們調整出全精度模型中的中毒行為，同時確保其權重滿足在步驟 (ii) 中計算出的約束。此程序會產生一個 LLM，它在全精度時表現出良性行為，但在量化時，它會遵循在步驟 (i) 中注入的對抗行為。我們在三種不同的情境中以實驗方式證明此類攻擊的可行性和嚴重性：易受攻擊的程式碼產生、內容注入和過度拒絕攻擊。在實務上，對手可以將產生的全精度模型託管在 LLM 社群中心，例如 Hugging Face，讓數百萬使用者面臨在其裝置上部署其惡意量化版本的威脅。", "author": "Kazuki Egashira et.al.", "authors": "Kazuki Egashira, Mark Vero, Robin Staab, Jingxuan He, Martin Vechev", "id": "2405.18137v1", "paper_url": "http://arxiv.org/abs/2405.18137v1", "repo": "null"}}