{"2410.21741": {"publish_time": "2024-10-29", "title": "Enhancing Financial Question Answering with a Multi-Agent Reflection Framework", "paper_summary": "While Large Language Models (LLMs) have shown impressive capabilities in\nnumerous Natural Language Processing (NLP) tasks, they still struggle with\nfinancial question answering (QA), particularly when numerical reasoning is\nrequired. Recently, LLM-based multi-agent frameworks have demonstrated\nremarkable effectiveness in multi-step reasoning, which is crucial for\nfinancial QA tasks as it involves extracting relevant information from tables\nand text and then performing numerical reasoning on the extracted data to infer\nanswers. In this study, we propose a multi-agent framework incorporating a\ncritic agent that reflects on the reasoning steps and final answers for each\nquestion. Additionally, we enhance our system by adding multiple critic agents,\neach focusing on a specific aspect of the answer. Our results indicate that\nthis framework significantly improves performance compared to single-agent\nreasoning, with an average performance increase of 15% for the LLaMA3-8B model\nand 5% for the LLaMA3-70B model. Furthermore, our framework performs on par\nwith, and in some cases surpasses, larger single-agent LLMs such as\nLLaMA3.1-405B and GPT-4o-mini, though it falls slightly short compared to\nClaude-3.5 Sonnet. Overall, our framework presents an effective solution to\nenhance open-source LLMs for financial QA tasks, offering a cost-effective\nalternative to larger models like Claude-3.5 Sonnet.", "paper_summary_zh": "儘管大型語言模型 (LLM) 在眾多自然語言處理 (NLP) 任務中展現令人印象深刻的能力，但它們在財務問答 (QA) 中仍面臨挑戰，特別是在需要數字推理時。最近，基於 LLM 的多主體架構已在多步驟推理中展現顯著的成效，這對於財務 QA 任務至關重要，因為它涉及從表格和文字中萃取相關資訊，然後對萃取的資料執行數字推理以推論答案。在本研究中，我們提出一個多主體架構，其中包含一個評論主體，用於反思每個問題的推理步驟和最終答案。此外，我們透過新增多個評論主體來增強我們的系統，每個評論主體專注於答案的特定面向。我們的結果指出，與單一主體推理相比，此架構顯著提升了效能，LLaMA3-8B 模型的平均效能提升 15%，LLaMA3-70B 模型的平均效能提升 5%。此外，我們的架構與較大型的單一主體 LLM（例如 LLaMA3.1-405B 和 GPT-4o-mini）表現相當，甚至在某些情況下超越它們，儘管它略遜於 Claude-3.5 Sonnet。總體而言，我們的架構提供了一個有效的解決方案，可增強開源 LLM 的財務 QA 任務，為類似 Claude-3.5 Sonnet 的大型模型提供具成本效益的替代方案。", "author": "Sorouralsadat Fatemi et.al.", "authors": "Sorouralsadat Fatemi, Yuheng Hu", "id": "2410.21741v1", "paper_url": "http://arxiv.org/abs/2410.21741v1", "repo": "null"}}