{"2410.21573": {"publish_time": "2024-10-28", "title": "Thank You, Stingray: Multilingual Large Language Models Can Not (Yet) Disambiguate Cross-Lingual Word Sense", "paper_summary": "Multilingual large language models (LLMs) have gained prominence, but\nconcerns arise regarding their reliability beyond English. This study addresses\nthe gap in cross-lingual semantic evaluation by introducing a novel benchmark\nfor cross-lingual sense disambiguation, StingrayBench. In this paper, we\ndemonstrate using false friends -- words that are orthographically similar but\nhave completely different meanings in two languages -- as a possible approach\nto pinpoint the limitation of cross-lingual sense disambiguation in LLMs. We\ncollect false friends in four language pairs, namely Indonesian-Malay,\nIndonesian-Tagalog, Chinese-Japanese, and English-German; and challenge LLMs to\ndistinguish the use of them in context. In our analysis of various models, we\nobserve they tend to be biased toward higher-resource languages. We also\npropose new metrics for quantifying the cross-lingual sense bias and\ncomprehension based on our benchmark. Our work contributes to developing more\ndiverse and inclusive language modeling, promoting fairer access for the wider\nmultilingual community.", "paper_summary_zh": "多語言大型語言模型 (LLM) 聲名大噪，但對於其在英語以外的可靠性仍有疑慮。本研究透過引入跨語言感官消歧的全新基準 StingrayBench，來解決跨語言語義評估中的差距。在本文中，我們示範使用假朋友（拼寫相似，但在兩種語言中意思完全不同的字詞）作為一種可能的方法，來精確找出 LLM 中跨語言感官消歧的限制。我們收集了四組語言對中的假朋友，即印尼語-馬來語、印尼語-他加祿語、中文-日語和英語-德語；並挑戰 LLM 在文中區分其用法。在我們對各種模型的分析中，我們觀察到它們傾向於偏向於資源較多的語言。我們也針對基準提出了量化跨語言感官偏差和理解的新指標。我們的研究有助於開發更多元且包容的語言模型，促進更廣泛的多語言社群更公平的存取。", "author": "Samuel Cahyawijaya et.al.", "authors": "Samuel Cahyawijaya, Ruochen Zhang, Holy Lovenia, Jan Christian Blaise Cruz, Elisa Gilbert, Hiroki Nomoto, Alham Fikri Aji", "id": "2410.21573v2", "paper_url": "http://arxiv.org/abs/2410.21573v2", "repo": "https://github.com/SamuelCahyawijaya/stingraybench"}}