{"2407.02067": {"publish_time": "2024-07-02", "title": "Crossroads of Continents: Automated Artifact Extraction for Cultural Adaptation with Large Multimodal Models", "paper_summary": "In this work, we present a comprehensive three-phase study to examine (1) the\neffectiveness of large multimodal models (LMMs) in recognizing cultural\ncontexts; (2) the accuracy of their representations of diverse cultures; and\n(3) their ability to adapt content across cultural boundaries. We first\nintroduce Dalle Street, a large-scale dataset generated by DALL-E 3 and\nvalidated by humans, containing 9,935 images of 67 countries and 10 concept\nclasses. We reveal disparities in cultural understanding at the sub-region\nlevel with both open-weight (LLaVA) and closed-source (GPT-4V) models on Dalle\nStreet and other existing benchmarks. Next, we assess models' deeper culture\nunderstanding by an artifact extraction task and identify over 18,000 artifacts\nassociated with different countries. Finally, we propose a highly composable\npipeline, CultureAdapt, to adapt images from culture to culture. Our findings\nreveal a nuanced picture of the cultural competence of LMMs, highlighting the\nneed to develop culture-aware systems. Dataset and code are available at\nhttps://github.com/iamshnoo/crossroads", "paper_summary_zh": "在這項工作中，我們提出了一項全面的三階段研究，以檢視 (1) 大型多模態模型 (LMM) 在識別文化背景方面的有效性；(2) 它們對不同文化表徵的準確性；以及 (3) 它們跨文化界線調整內容的能力。我們首先介紹 Dalle Street，一個由 DALL-E 3 生成的、並經由人類驗證的大規模資料集，包含 67 個國家和 10 個概念類別的 9,935 張圖片。我們揭露了在 Dalle Street 和其他現有基準上，開放權重 (LLaVA) 和閉源 (GPT-4V) 模型在次區域層級的文化理解差異。接下來，我們透過人工製品萃取任務評估模型更深入的文化理解，並識別出超過 18,000 件與不同國家相關的人工製品。最後，我們提出了一個高度可組合的管道，CultureAdapt，以調整不同文化中的圖片。我們的研究結果揭露了 LMM 文化能力的細微差別，強調了開發文化感知系統的必要性。資料集和程式碼可在 https://github.com/iamshnoo/crossroads 取得", "author": "Anjishnu Mukherjee et.al.", "authors": "Anjishnu Mukherjee, Ziwei Zhu, Antonios Anastasopoulos", "id": "2407.02067v1", "paper_url": "http://arxiv.org/abs/2407.02067v1", "repo": "https://github.com/iamshnoo/crossroads"}}