{"2406.14540": {"publish_time": "2024-06-20", "title": "IRASim: Learning Interactive Real-Robot Action Simulators", "paper_summary": "Scalable robot learning in the real world is limited by the cost and safety\nissues of real robots. In addition, rolling out robot trajectories in the real\nworld can be time-consuming and labor-intensive. In this paper, we propose to\nlearn an interactive real-robot action simulator as an alternative. We\nintroduce a novel method, IRASim, which leverages the power of generative\nmodels to generate extremely realistic videos of a robot arm that executes a\ngiven action trajectory, starting from an initial given frame. To validate the\neffectiveness of our method, we create a new benchmark, IRASim Benchmark, based\non three real-robot datasets and perform extensive experiments on the\nbenchmark. Results show that IRASim outperforms all the baseline methods and is\nmore preferable in human evaluations. We hope that IRASim can serve as an\neffective and scalable approach to enhance robot learning in the real world. To\npromote research for generative real-robot action simulators, we open-source\ncode, benchmark, and checkpoints at https: //gen-irasim.github.io.", "paper_summary_zh": "現實世界的可擴充機器人學習受到實際機器人的成本和安全問題限制。此外，在現實世界中推出機器人軌跡可能耗時且費力。在本文中，我們建議學習互動式真實機器人動作模擬器作為替代方案。我們介紹了一種新方法 IRASim，它利用生成模型的力量來生成機器人手臂執行給定動作軌跡的極其逼真的影片，從給定的初始幀開始。為了驗證我們方法的有效性，我們基於三個真實機器人數據集創建了一個新的基準 IRASim Benchmark，並在基準上進行了廣泛的實驗。結果表明，IRASim 優於所有基準方法，並且在人類評估中更受青睞。我們希望 IRASim 能夠作為一種有效且可擴充的方法來增強現實世界中的機器人學習。為了促進生成式真實機器人動作模擬器的研究，我們在 https: //gen-irasim.github.io 公開原始碼、基準和檢查點。", "author": "Fangqi Zhu et.al.", "authors": "Fangqi Zhu, Hongtao Wu, Song Guo, Yuxiao Liu, Chilam Cheang, Tao Kong", "id": "2406.14540v1", "paper_url": "http://arxiv.org/abs/2406.14540v1", "repo": "null"}}