{"2412.09032": {"publish_time": "2024-12-12", "title": "Speech-Forensics: Towards Comprehensive Synthetic Speech Dataset Establishment and Analysis", "paper_summary": "Detecting synthetic from real speech is increasingly crucial due to the risks\nof misinformation and identity impersonation. While various datasets for\nsynthetic speech analysis have been developed, they often focus on specific\nareas, limiting their utility for comprehensive research. To fill this gap, we\npropose the Speech-Forensics dataset by extensively covering authentic,\nsynthetic, and partially forged speech samples that include multiple segments\nsynthesized by different high-quality algorithms. Moreover, we propose a\nTEmporal Speech LocalizaTion network, called TEST, aiming at simultaneously\nperforming authenticity detection, multiple fake segments localization, and\nsynthesis algorithms recognition, without any complex post-processing. TEST\neffectively integrates LSTM and Transformer to extract more powerful temporal\nspeech representations and utilizes dense prediction on multi-scale pyramid\nfeatures to estimate the synthetic spans. Our model achieves an average mAP of\n83.55% and an EER of 5.25% at the utterance level. At the segment level, it\nattains an EER of 1.07% and a 92.19% F1 score. These results highlight the\nmodel's robust capability for a comprehensive analysis of synthetic speech,\noffering a promising avenue for future research and practical applications in\nthis field.", "paper_summary_zh": "由於錯誤資訊和身分冒用的風險，偵測合成語音和真實語音變得越來越重要。雖然已經開發出各種合成語音分析的資料集，但它們通常專注於特定領域，限制了它們在綜合研究中的效用。為了填補這個缺口，我們提出 Speech-Forensics 資料集，廣泛涵蓋真實、合成和部分偽造的語音樣本，其中包括由不同高品質演算法合成的多個區段。此外，我們提出了一個稱為 TEST 的時間語音定位網路，旨在同時執行真實性偵測、多個偽造區段定位和合成演算法辨識，而無需任何複雜的後處理。TEST 有效地整合 LSTM 和 Transformer 以提取更強大的時間語音表示，並利用多尺度金字塔特徵上的密集預測來估計合成跨度。我們的模型在語句層級達到了 83.55% 的平均 mAP 和 5.25% 的 EER。在區段層級，它達到了 1.07% 的 EER 和 92.19% 的 F1 分數。這些結果突顯了該模型在合成語音綜合分析方面的強大功能，為此領域未來的研究和實際應用提供了有前景的途徑。", "author": "Zhoulin Ji et.al.", "authors": "Zhoulin Ji, Chenhao Lin, Hang Wang, Chao Shen", "id": "2412.09032v1", "paper_url": "http://arxiv.org/abs/2412.09032v1", "repo": "null"}}