{"2410.08299": {"publish_time": "2024-10-10", "title": "Privately Learning from Graphs with Applications in Fine-tuning Large Language Models", "paper_summary": "Graphs offer unique insights into relationships and interactions between\nentities, complementing data modalities like text, images, and videos. By\nincorporating relational information from graph data, AI models can extend\ntheir capabilities beyond traditional tasks. However, relational data in\nsensitive domains such as finance and healthcare often contain private\ninformation, making privacy preservation crucial. Existing privacy-preserving\nmethods, such as DP-SGD, which rely on gradient decoupling assumptions, are not\nwell-suited for relational learning due to the inherent dependencies between\ncoupled training samples. To address this challenge, we propose a\nprivacy-preserving relational learning pipeline that decouples dependencies in\nsampled relations during training, ensuring differential privacy through a\ntailored application of DP-SGD. We apply this method to fine-tune large\nlanguage models (LLMs) on sensitive graph data, and tackle the associated\ncomputational complexities. Our approach is evaluated on LLMs of varying sizes\n(e.g., BERT, Llama2) using real-world relational data from four text-attributed\ngraphs. The results demonstrate significant improvements in relational learning\ntasks, all while maintaining robust privacy guarantees during training.\nAdditionally, we explore the trade-offs between privacy, utility, and\ncomputational efficiency, offering insights into the practical deployment of\nour approach. Code is available at https://github.com/Graph-COM/PvGaLM.", "paper_summary_zh": "圖表提供關於實體之間關係和互動的獨特見解，補充了文本、影像和影片等資料模式。透過納入來自圖表資料的關係資訊，AI 模型可以將其功能延伸到傳統任務之外。然而，敏感領域（例如金融和醫療保健）中的關係資料通常包含私人資訊，因此隱私保護至關重要。現有的隱私保護方法（例如 DP-SGD），依賴於梯度解耦假設，由於耦合訓練樣本之間的內在依賴性，並不適合關係學習。為了應對這個挑戰，我們提出一個隱私保護關係學習管道，在訓練期間解耦取樣關係中的依賴性，透過客製化應用 DP-SGD 來確保差異隱私。我們將此方法應用於敏感圖表資料上微調大型語言模型 (LLM)，並解決相關的計算複雜性。我們的方法在不同大小的 LLM（例如 BERT、Llama2）上進行評估，使用來自四個文字屬性圖表的真實世界關係資料。結果證明關係學習任務有顯著的進步，同時在訓練期間維持強大的隱私保證。此外，我們探討隱私、效用和計算效率之間的權衡，提供對我們方法實際部署的見解。程式碼可在 https://github.com/Graph-COM/PvGaLM 取得。", "author": "Haoteng Yin et.al.", "authors": "Haoteng Yin, Rongzhe Wei, Eli Chien, Pan Li", "id": "2410.08299v1", "paper_url": "http://arxiv.org/abs/2410.08299v1", "repo": "null"}}