{"2411.10242": {"publish_time": "2024-11-15", "title": "Measuring Non-Adversarial Reproduction of Training Data in Large Language Models", "paper_summary": "Large language models memorize parts of their training data. Memorizing short\nsnippets and facts is required to answer questions about the world and to be\nfluent in any language. But models have also been shown to reproduce long\nverbatim sequences of memorized text when prompted by a motivated adversary. In\nthis work, we investigate an intermediate regime of memorization that we call\nnon-adversarial reproduction, where we quantify the overlap between model\nresponses and pretraining data when responding to natural and benign prompts.\nFor a variety of innocuous prompt categories (e.g., writing a letter or a\ntutorial), we show that up to 15% of the text output by popular conversational\nlanguage models overlaps with snippets from the Internet. In worst cases, we\nfind generations where 100% of the content can be found exactly online. For the\nsame tasks, we find that human-written text has far less overlap with Internet\ndata. We further study whether prompting strategies can close this reproduction\ngap between models and humans. While appropriate prompting can reduce\nnon-adversarial reproduction on average, we find that mitigating worst-case\nreproduction of training data requires stronger defenses -- even for benign\ninteractions.", "paper_summary_zh": "大型語言模型會記憶訓練資料的一部分。記憶簡短的片段和事實對於回答有關世界問題以及流利使用任何語言都是必要的。但是，當受到有動機的對手提示時，模型也已被證明會複製記憶文字的長串逐字序列。在這項工作中，我們研究了一種稱為非對抗性複製的記憶中間機制，其中我們量化了模型回應與在回應自然且良性的提示時預訓練資料之間的重疊。對於各種無害的提示類別（例如，寫一封信或一個教學），我們展示了熱門對話語言模型輸出的文本中，多達 15% 與來自網際網路的片段重疊。在最壞的情況下，我們發現 100% 的內容可以在網路上找到。對於相同的任務，我們發現人類寫的文字與網際網路資料的重疊程度遠低於此。我們進一步研究提示策略是否可以縮小模型和人類之間的這種複製差距。雖然適當的提示可以平均減少非對抗性複製，但我們發現，減輕訓練資料的最壞情況複製需要更強的防禦措施，即使對於良性的互動也是如此。", "author": "Michael Aerni et.al.", "authors": "Michael Aerni, Javier Rando, Edoardo Debenedetti, Nicholas Carlini, Daphne Ippolito, Florian Tramèr", "id": "2411.10242v1", "paper_url": "http://arxiv.org/abs/2411.10242v1", "repo": "null"}}