{"2409.15869": {"publish_time": "2024-09-24", "title": "Whisper in Medusa's Ear: Multi-head Efficient Decoding for Transformer-based ASR", "paper_summary": "Large transformer-based models have significant potential for speech\ntranscription and translation. Their self-attention mechanisms and parallel\nprocessing enable them to capture complex patterns and dependencies in audio\nsequences. However, this potential comes with challenges, as these large and\ncomputationally intensive models lead to slow inference speeds. Various\noptimization strategies have been proposed to improve performance, including\nefficient hardware utilization and algorithmic enhancements. In this paper, we\nintroduce Whisper-Medusa, a novel approach designed to enhance processing speed\nwith minimal impact on Word Error Rate (WER). The proposed model extends the\nOpenAI's Whisper architecture by predicting multiple tokens per iteration,\nresulting in a 50% reduction in latency. We showcase the effectiveness of\nWhisper-Medusa across different learning setups and datasets.", "paper_summary_zh": "大型Transformer模型在語音轉錄和翻譯方面具有巨大潛力。它們的自我注意機制和並行處理使它們能夠捕捉音訊序列中的複雜模式和依賴關係。然而，這種潛力也帶來挑戰，因為這些大型且計算密集的模型會導致緩慢的推理速度。已經提出了各種最佳化策略來改善效能，包括有效率的硬體利用和演算法強化。在本文中，我們介紹了 Whisper-Medusa，這是一種新穎的方法，旨在提高處理速度，同時對字元錯誤率 (WER) 的影響最小。所提出的模型透過每次疊代預測多個代碼，擴充了 OpenAI 的 Whisper 架構，從而將延遲減少了 50%。我們展示了 Whisper-Medusa 在不同學習設定和資料集中的有效性。", "author": "Yael Segal-Feldman et.al.", "authors": "Yael Segal-Feldman, Aviv Shamsian, Aviv Navon, Gill Hetz, Joseph Keshet", "id": "2409.15869v1", "paper_url": "http://arxiv.org/abs/2409.15869v1", "repo": "null"}}