{"2409.11770": {"publish_time": "2024-09-18", "title": "Knowledge Adaptation Network for Few-Shot Class-Incremental Learning", "paper_summary": "Few-shot class-incremental learning (FSCIL) aims to incrementally recognize\nnew classes using a few samples while maintaining the performance on previously\nlearned classes. One of the effective methods to solve this challenge is to\nconstruct prototypical evolution classifiers. Despite the advancement achieved\nby most existing methods, the classifier weights are simply initialized using\nmean features. Because representations for new classes are weak and biased, we\nargue such a strategy is suboptimal. In this paper, we tackle this issue from\ntwo aspects. Firstly, thanks to the development of foundation models, we employ\na foundation model, the CLIP, as the network pedestal to provide a general\nrepresentation for each class. Secondly, to generate a more reliable and\ncomprehensive instance representation, we propose a Knowledge Adapter (KA)\nmodule that summarizes the data-specific knowledge from training data and fuses\nit into the general representation. Additionally, to tune the knowledge learned\nfrom the base classes to the upcoming classes, we propose a mechanism of\nIncremental Pseudo Episode Learning (IPEL) by simulating the actual FSCIL.\nTaken together, our proposed method, dubbed as Knowledge Adaptation Network\n(KANet), achieves competitive performance on a wide range of datasets,\nincluding CIFAR100, CUB200, and ImageNet-R.", "paper_summary_zh": "少样本类增量学习 (FSCIL) 旨在使用少量样本增量识别新类别，同时保持对先前学习类别的性能。解决此挑战的有效方法之一是构建原型进化分类器。尽管大多数现有方法取得了进步，但分类器权重只是使用平均特征进行初始化。由于新类别的表示很弱且有偏差，我们认为这种策略不是最优的。在本文中，我们从两个方面解决这个问题。首先，得益于基础模型的发展，我们采用基础模型 CLIP 作为网络基座，为每个类别提供通用表示。其次，为了生成更可靠和全面的实例表示，我们提出了一个知识适配器 (KA) 模块，该模块总结了训练数据中的特定于数据知识，并将其融合到通用表示中。此外，为了将从基础类别学到的知识调整到即将到来的类别，我们通过模拟实际 FSCIL 提出了一种增量伪序列学习 (IPEL) 机制。综上所述，我们提出的方法称为知识适应网络 (KANet)，在广泛的数据集上实现了有竞争力的性能，包括 CIFAR100、CUB200 和 ImageNet-R。", "author": "Ye Wang et.al.", "authors": "Ye Wang, Yaxiong Wang, Guoshuai Zhao, Xueming Qian", "id": "2409.11770v1", "paper_url": "http://arxiv.org/abs/2409.11770v1", "repo": "null"}}