{"2406.09067": {"publish_time": "2024-06-13", "title": "How structured are the representations in transformer-based vision encoders? An analysis of multi-object representations in vision-language models", "paper_summary": "Forming and using symbol-like structured representations for reasoning has\nbeen considered essential for generalising over novel inputs. The primary tool\nthat allows generalisation outside training data distribution is the ability to\nabstract away irrelevant information into a compact form relevant to the task.\nAn extreme form of such abstract representations is symbols. Humans make use of\nsymbols to bind information while abstracting away irrelevant parts to utilise\nthe information consistently and meaningfully. This work estimates the state of\nsuch structured representations in vision encoders. Specifically, we evaluate\nimage encoders in large vision-language pre-trained models to address the\nquestion of which desirable properties their representations lack by applying\nthe criteria of symbolic structured reasoning described for LLMs to the image\nmodels. We test the representation space of image encoders like VIT, BLIP,\nCLIP, and FLAVA to characterise the distribution of the object representations\nin these models. In particular, we create decoding tasks using multi-object\nscenes from the COCO dataset, relating the token space to its input content for\nvarious objects in the scene. We use these tasks to characterise the network's\ntoken and layer-wise information modelling. Our analysis highlights that the\nCLS token, used for the downstream task, only focuses on a few objects\nnecessary for the trained downstream task. Still, other individual objects are\nwell-modelled separately by the tokens in the network originating from those\nobjects. We further observed a widespread distribution of scene information.\nThis demonstrates that information is far more entangled in tokens than optimal\nfor representing objects similar to symbols. Given these symbolic properties,\nwe show the network dynamics that cause failure modes of these models on basic\ndownstream tasks in a multi-object scene.", "paper_summary_zh": "<paragraph>形成和使用符号状的结构化表征进行推理被认为对于概括新颖的输入至关重要。允许在训练数据分布之外进行概括的主要工具是将不相关信息抽象成与任务相关的紧凑形式的能力。这种抽象表征的极端形式是符号。人类利用符号来绑定信息，同时抽象掉不相关部分，以便一致且有意义地利用信息。这项工作估计了视觉编码器中这种结构化表征的状态。具体来说，我们评估大型视觉语言预训练模型中的图像编码器，以解决其表征缺乏哪些理想属性的问题，方法是将针对 LLM 描述的符号结构化推理标准应用于图像模型。我们测试了 VIT、BLIP、CLIP 和 FLAVA 等图像编码器的表征空间，以表征这些模型中对象表征的分布。特别是，我们使用 COCO 数据集中的多对象场景创建解码任务，将标记空间与其输入内容关联起来，用于场景中的各种对象。我们使用这些任务来表征网络的标记和逐层信息建模。我们的分析强调，用于下游任务的 CLS 标记只关注训练的下游任务所需的几个对象。不过，网络中源自这些对象的标记可以很好地单独对其他各个对象进行建模。我们进一步观察到场景信息的分布很广泛。这表明信息在标记中的纠缠程度远高于以类似于符号的方式表征对象的最佳程度。鉴于这些符号属性，我们展示了导致这些模型在多对象场景中的基本下游任务上出现故障模式的网络动态。</paragraph>", "author": "Tarun Khajuria et.al.", "authors": "Tarun Khajuria, Braian Olmiro Dias, Jaan Aru", "id": "2406.09067v1", "paper_url": "http://arxiv.org/abs/2406.09067v1", "repo": "null"}}