{"2502.11062": {"publish_time": "2025-02-16", "title": "Beyond Similarity: A Gradient-based Graph Method for Instruction Tuning Data Selection", "paper_summary": "Large language models (LLMs) have shown great potential across various\nindustries due to their remarkable ability to generalize through instruction\ntuning. However, the limited availability of domain-specific data significantly\nhampers their performance on specialized tasks. While existing methods\nprimarily focus on selecting training data from general datasets that are\nsimilar to the target domain, they often fail to consider the joint\ndistribution of instructions, resulting in inefficient learning and suboptimal\nknowledge transfer. To address these challenges, we introduce G2IS\n(Gradient-based Graph Instruction Selection), a novel method that constructs a\nmixed gradient-based instruction graph to capture the joint distribution and\ninterdependencies between instructions. By accounting for the relationships\nbetween instructions, G2IS improves domain adaptation efficiency. Additionally,\nwe propose a gradient walk algorithm to refine the data selection process,\nenhancing both training effectiveness and efficiency. Our experiments\ndemonstrate that G2IS outperforms traditional methods across various domain\nadaptation tasks, yielding significant performance gains, particularly in\ncomplex, data-scarce scenarios. These results underscore the potential of G2IS\nin advancing the development of large, domain-specific models.", "paper_summary_zh": "大型語言模型 (LLM) 因其透過指令微調而具備的卓越泛化能力，在各產業中展現出極大的潛力。然而，特定領域資料的取得有限，大幅影響其在專業任務上的表現。現有方法主要專注於從與目標領域類似的通用資料集中選取訓練資料，但它們通常未能考量指令的聯合分佈，導致學習效率不彰且知識傳遞不佳。為了應對這些挑戰，我們引進 G2IS（基於梯度的圖形指令選取），這是一種創新的方法，可建構一個混合的基於梯度的指令圖形，以擷取指令之間的聯合分佈和相互依賴性。透過考量指令之間的關係，G2IS 提升了領域適應的效率。此外，我們提出了一種梯度漫步演算法來優化資料選取程序，同時提升訓練效能和效率。我們的實驗證明，G2IS 在各種領域適應任務中優於傳統方法，產生顯著的效能提升，特別是在資料稀少的複雜場景中。這些結果突顯了 G2IS 在推動大型特定領域模型發展方面的潛力。", "author": "Yang Zhao et.al.", "authors": "Yang Zhao, Li Du, Xiao Ding, Yangou Ouyang, Hepeng Wang, Kai Xiong, Jinglong Gao, Zhouhao Sun, Dongliang Xu, Yang Qing, Dongchen Li, Bing Qin, Ting Liu", "id": "2502.11062v1", "paper_url": "http://arxiv.org/abs/2502.11062v1", "repo": "null"}}