{"2407.21276": {"publish_time": "2024-07-31", "title": "Multi-Level Querying using A Knowledge Pyramid", "paper_summary": "This paper addresses the need for improved precision in existing\nRetrieval-Augmented Generation (RAG) methods that primarily focus on enhancing\nrecall. We propose a multi-layer knowledge pyramid approach within the RAG\nframework to achieve a better balance between precision and recall. The\nknowledge pyramid consists of three layers: Ontologies, Knowledge Graphs (KGs),\nand chunk-based raw text. We employ cross-layer augmentation techniques for\ncomprehensive knowledge coverage and dynamic updates of the Ontology schema and\ninstances. To ensure compactness, we utilize cross-layer filtering methods for\nknowledge condensation in KGs. Our approach, named PolyRAG, follows a waterfall\nmodel for retrieval, starting from the top of the pyramid and progressing down\nuntil a confident answer is obtained. We introduce two benchmarks for\ndomain-specific knowledge retrieval, one in the academic domain and the other\nin the financial domain. The effectiveness of the methods has been validated\nthrough comprehensive experiments by outperforming 19 SOTA methods. An\nencouraging observation is that the proposed method has augmented the GPT-4,\nproviding 395\\% F1 gain by improving its performance from 0.1636 to 0.8109.", "paper_summary_zh": "本文探討了現有檢索增強生成 (RAG) 方法中，對於精準度的提升需求，這些方法主要專注於增強召回率。我們在 RAG 架構中提出一個多層知識金字塔方法，以在精準度和召回率之間取得更好的平衡。知識金字塔包含三個層級：本体、知識圖譜 (KG) 和基於區塊的原始文字。我們採用跨層增強技術，以實現全面的知識涵蓋範圍和本体架構及實例的動態更新。為了確保緊湊性，我們利用跨層過濾方法，以進行 KG 中的知識濃縮。我們的方法稱為 PolyRAG，它遵循瀑布模型進行檢索，從金字塔頂端開始，並向下進行，直到獲得確定的答案。我們引入了兩個特定領域知識檢索基準，一個在學術領域，另一個在金融領域。這些方法的有效性已通過全面實驗驗證，其表現優於 19 種 SOTA 方法。一個令人振奮的觀察結果是，所提出的方法已經增強了 GPT-4，通過將其效能從 0.1636 提升至 0.8109，提供了 395% 的 F1 增益。", "author": "Rubing Chen et.al.", "authors": "Rubing Chen, Xulu Zhang, Jiaxin Wu, Wenqi Fan, Xiao-Yong Wei, Qing Li", "id": "2407.21276v1", "paper_url": "http://arxiv.org/abs/2407.21276v1", "repo": "null"}}