{"2405.05154": {"publish_time": "2024-05-08", "title": "The Potential and Implications of Generative AI on HCI Education", "paper_summary": "Generative AI (GAI) is impacting teaching and learning directly or indirectly\nacross a range of subjects and disciplines. As educators, we need to understand\nthe potential and limitations of AI in HCI education and ensure our graduating\nHCI students are aware of the potential and limitations of AI in HCI. In this\npaper, we report on the main pedagogical insights gained from the inclusion of\ngenerative AI into a 10 week undergraduate module. We designed the module to\nencourage student experimentation with GAI models as part of the design brief\nrequirement and planned practical sessions and discussions. Our insights are\nbased on replies to a survey sent out to the students after completing the\nmodule. Our key findings, for HCI educators, report on the use of AI as a\npersona for developing project ideas and creating resources for design, and AI\nas a mirror for reflecting students' understanding of key concepts and ideas\nand highlighting knowledge gaps. We also discuss potential pitfalls that should\nbe considered and the need to assess students' literacies and assumptions of\nGAIs as pedagogical tools. Finally, we put forward the case for educators to\ntake the opportunities GAI presents as an educational tool and be experimental,\ncreative, and courageous in their practice. We end with a discussion of our\nfindings in relation to the TPACK framework in HCI.", "paper_summary_zh": "生成式 AI (GAI) 直接或間接影響各個科目和學科的教學和學習。作為教育工作者，我們需要了解 AI 在 HCI 教育中的潛力和限制，並確保我們畢業的 HCI 學生了解 AI 在 HCI 中的潛力和限制。在本文中，我們報告了將生成式 AI 納入 10 週大學模組中獲得的主要教學見解。我們設計模組以鼓勵學生將 GAI 模型的實驗作為設計簡報要求的一部分，並規劃實務課程和討論。我們的見解基於在完成模組後寄給學生的調查回覆。我們對 HCI 教育工作者的主要發現報告了 AI 作為開發專案構想和建立設計資源的角色，以及 AI 作為反映學生對關鍵概念和想法的理解並突顯知識差距的鏡子。我們也討論應考慮的潛在陷阱，以及評量學生對 GAI 作為教學工具的識字能力和假設的必要性。最後，我們提出教育工作者應將 GAI 視為教育工具所帶來的機會，並在實務中保持實驗、創意和勇氣。我們以討論我們的發現與 HCI 中的 TPACK 架構的關係作為結尾。", "author": "Ahmed Kharrufa et.al.", "authors": "Ahmed Kharrufa, Ian G Johnson", "id": "2405.05154v1", "paper_url": "http://arxiv.org/abs/2405.05154v1", "repo": "null"}}