{"2406.11131": {"publish_time": "2024-06-17", "title": "Are Large Language Models a Good Replacement of Taxonomies?", "paper_summary": "Large language models (LLMs) demonstrate an impressive ability to internalize\nknowledge and answer natural language questions. Although previous studies\nvalidate that LLMs perform well on general knowledge while presenting poor\nperformance on long-tail nuanced knowledge, the community is still doubtful\nabout whether the traditional knowledge graphs should be replaced by LLMs. In\nthis paper, we ask if the schema of knowledge graph (i.e., taxonomy) is made\nobsolete by LLMs. Intuitively, LLMs should perform well on common taxonomies\nand at taxonomy levels that are common to people. Unfortunately, there lacks a\ncomprehensive benchmark that evaluates the LLMs over a wide range of taxonomies\nfrom common to specialized domains and at levels from root to leaf so that we\ncan draw a confident conclusion. To narrow the research gap, we constructed a\nnovel taxonomy hierarchical structure discovery benchmark named TaxoGlimpse to\nevaluate the performance of LLMs over taxonomies. TaxoGlimpse covers ten\nrepresentative taxonomies from common to specialized domains with in-depth\nexperiments of different levels of entities in this taxonomy from root to leaf.\nOur comprehensive experiments of eighteen state-of-the-art LLMs under three\nprompting settings validate that LLMs can still not well capture the knowledge\nof specialized taxonomies and leaf-level entities.", "paper_summary_zh": "大型語言模型 (LLM) 展示了將知識內化並回答自然語言問題的驚人能力。儘管先前的研究驗證了 LLM 在一般知識上表現良好，但在長尾細微知識上表現不佳，但社群仍然懷疑傳統知識圖譜是否應被 LLM 取代。在本文中，我們探討知識圖譜的架構 (即分類法) 是否被 LLM 取代。直觀上，LLM 應在常見分類法和對人們來說常見的分類法層級中表現良好。不幸的是，缺乏一個綜合基準來評估 LLM 在從一般到專業領域的廣泛分類法以及從根到葉的層級，以便我們可以得出確信的結論。為了縮小研究差距，我們構建了一個名為 TaxoGlimpse 的新分類法層級結構發現基準，以評估 LLM 在分類法上的表現。TaxoGlimpse 涵蓋了從一般到專業領域的十個代表性分類法，並對該分類法中從根到葉的不同層級實體進行深入實驗。我們對 18 個最先進的 LLM 在三種提示設定下的綜合實驗驗證了 LLM 仍然無法很好地掌握專業分類法和葉級實體的知識。", "author": "Yushi Sun et.al.", "authors": "Yushi Sun, Hao Xin, Kai Sun, Yifan Ethan Xu, Xiao Yang, Xin Luna Dong, Nan Tang, Lei Chen", "id": "2406.11131v2", "paper_url": "http://arxiv.org/abs/2406.11131v2", "repo": "https://github.com/ysunbp/taxoglimpse"}}