{"2411.17265": {"publish_time": "2024-11-26", "title": "A Topic-level Self-Correctional Approach to Mitigate Hallucinations in MLLMs", "paper_summary": "Aligning the behaviors of Multimodal Large Language Models (MLLMs) with human\npreferences is crucial for developing robust and trustworthy AI systems. While\nrecent attempts have employed human experts or powerful auxiliary AI systems to\nprovide more accurate preference feedback, such as determining the preferable\nresponses from MLLMs or directly rewriting hallucination-free responses,\nextensive resource overhead compromise the scalability of the feedback\ncollection. In this work, we introduce Topic-level Preference Overwriting\n(TPO), a self-correctional approach that guide the model itself to mitigate its\nown hallucination at the topic level. Through a deconfounded strategy that\nreplaces each topic within the response with the best or worst alternatives\ngenerated by the model itself, TPO creates more contrasting pairwise preference\nfeedback, enhancing the feedback quality without human or proprietary model\nintervention. Notably, the experimental results demonstrate proposed TPO\nachieves state-of-the-art performance in trustworthiness, significantly\nreducing the object hallucinations by 92% and overall hallucinations by 38%.\nCode, model and data will be released.", "paper_summary_zh": "對齊多模態大型語言模型 (MLLM) 的行為與人類偏好對於開發強健且值得信賴的 AI 系統至關重要。雖然近期嘗試已採用人類專家或強大的輔助 AI 系統提供更準確的偏好回饋，例如從 MLLM 中決定較佳的回應或直接改寫沒有幻覺的回應，但廣泛的資源開銷會影響回饋收集的可擴充性。在這項工作中，我們引入了主題層級偏好覆寫 (TPO)，這是一種自我修正方法，可引導模型本身在主題層級減輕其幻覺。透過一種去混淆的策略，用模型本身產生的最佳或最差的替代方案取代回應中的每個主題，TPO 會創造出更多對比的成對偏好回饋，在沒有人類或專有模型介入的情況下提升回饋品質。值得注意的是，實驗結果證明所提出的 TPO 在值得信賴度方面達到了最先進的效能，大幅減少了 92% 的物件幻覺和 38% 的整體幻覺。程式碼、模型和資料將會釋出。", "author": "Lehan He et.al.", "authors": "Lehan He, Zeren Chen, Zhelun Shi, Tianyu Yu, Jing Shao, Lu Sheng", "id": "2411.17265v1", "paper_url": "http://arxiv.org/abs/2411.17265v1", "repo": "null"}}