{"2411.03105": {"publish_time": "2024-11-05", "title": "Evaluating Machine Learning Models against Clinical Protocols for Enhanced Interpretability and Continuity of Care", "paper_summary": "In clinical practice, decision-making relies heavily on established\nprotocols, often formalised as rules. Concurrently, Machine Learning (ML)\nmodels, trained on clinical data, aspire to integrate into medical\ndecision-making processes. However, despite the growing number of ML\napplications, their adoption into clinical practice remains limited. Two\ncritical concerns arise, relevant to the notions of consistency and continuity\nof care: (a) accuracy - the ML model, albeit more accurate, might introduce\nerrors that would not have occurred by applying the protocol; (b)\ninterpretability - ML models operating as black boxes might make predictions\nbased on relationships that contradict established clinical knowledge. In this\ncontext, the literature suggests using ML models integrating domain knowledge\nfor improved accuracy and interpretability. However, there is a lack of\nappropriate metrics for comparing ML models with clinical rules in addressing\nthese challenges. Accordingly, in this article, we first propose metrics to\nassess the accuracy of ML models with respect to the established protocol.\nSecondly, we propose an approach to measure the distance of explanations\nprovided by two rule sets, with the goal of comparing the explanation\nsimilarity between clinical rule-based systems and rules extracted from ML\nmodels. The approach is validated on the Pima Indians Diabetes dataset by\ntraining two neural networks - one exclusively on data, and the other\nintegrating a clinical protocol. Our findings demonstrate that the integrated\nML model achieves comparable performance to that of a fully data-driven model\nwhile exhibiting superior accuracy relative to the clinical protocol, ensuring\nenhanced continuity of care. Furthermore, we show that our integrated model\nprovides explanations for predictions that align more closely with the clinical\nprotocol compared to the data-driven model.", "paper_summary_zh": "<paragraph>在臨床實務中，決策仰賴既定的協定，通常以規則形式化。同時，以臨床資料訓練的機器學習 (ML) 模型，渴望整合到醫療決策流程中。然而，儘管 ML 應用數量日增，它們在臨床實務中的採用仍受限。兩個關鍵疑慮浮現，與照護的一致性和連續性概念相關：(a) 準確性 - ML 模型雖然更準確，但可能會引入套用協定時不會發生的錯誤；(b) 可解釋性 - 作為黑盒運作的 ML 模型可能會根據與既定臨床知識相矛盾的關係進行預測。在此脈絡中，文獻建議使用整合領域知識的 ML 模型以提升準確性和可解釋性。然而，缺乏適當的指標來比較 ML 模型與臨床規則，以應對這些挑戰。因此，在本文中，我們首先提出指標來評估 ML 模型相對於既定協定的準確性。其次，我們提出一個方法來衡量兩組規則所提供的解釋的距離，目標是比較基於臨床規則的系統與從 ML 模型中提取的規則之間的解釋相似性。此方法在 Pima 印地安人糖尿病資料集上驗證，方法是訓練兩個神經網路 - 一個僅針對資料，另一個整合臨床協定。我們的研究結果證明，整合式 ML 模型達到了與完全資料驅動模型相當的效能，同時展現出相對於臨床協定的優異準確性，確保增強的照護連續性。此外，我們證明我們的整合模型提供的預測解釋與臨床協定相比，更為緊密地結合。</paragraph>", "author": "Christel Sirocchi et.al.", "authors": "Christel Sirocchi, Muhammad Suffian, Federico Sabbatini, Alessandro Bogliolo, Sara Montagna", "id": "2411.03105v1", "paper_url": "http://arxiv.org/abs/2411.03105v1", "repo": "https://github.com/ChristelSirocchi/XAI-similarity"}}