{"2412.14843": {"publish_time": "2024-12-19", "title": "Mapping and Influencing the Political Ideology of Large Language Models using Synthetic Personas", "paper_summary": "The analysis of political biases in large language models (LLMs) has\nprimarily examined these systems as single entities with fixed viewpoints.\nWhile various methods exist for measuring such biases, the impact of\npersona-based prompting on LLMs' political orientation remains unexplored. In\nthis work we leverage PersonaHub, a collection of synthetic persona\ndescriptions, to map the political distribution of persona-based prompted LLMs\nusing the Political Compass Test (PCT). We then examine whether these initial\ncompass distributions can be manipulated through explicit ideological prompting\ntowards diametrically opposed political orientations: right-authoritarian and\nleft-libertarian. Our experiments reveal that synthetic personas predominantly\ncluster in the left-libertarian quadrant, with models demonstrating varying\ndegrees of responsiveness when prompted with explicit ideological descriptors.\nWhile all models demonstrate significant shifts towards right-authoritarian\npositions, they exhibit more limited shifts towards left-libertarian positions,\nsuggesting an asymmetric response to ideological manipulation that may reflect\ninherent biases in model training.", "paper_summary_zh": "政治偏誤在大型語言模型 (LLM) 中的分析，主要將這些系統視為具有固定觀點的單一實體。雖然存在各種測量此類偏誤的方法，但基於角色的提示對 LLM 的政治傾向的影響仍未得到探討。在這項工作中，我們利用 PersonaHub（一個合成角色描述的集合）來繪製基於角色提示的 LLM 的政治分佈，使用政治羅盤測試 (PCT)。然後，我們探討是否可以透過明確的意識形態提示來操縱這些初始羅盤分佈，朝向截然相反的政治傾向：右翼威權主義和左翼自由主義。我們的實驗表明，合成角色主要聚集在左翼自由主義象限，而模型在使用明確的意識形態描述符提示時表現出不同程度的反應能力。雖然所有模型都表現出顯著的向右翼威權主義立場的轉變，但它們向左翼自由主義立場的轉變較為有限，這表明對意識形態操縱的不對稱反應可能反映了模型訓練中的固有偏誤。", "author": "Pietro Bernardelle et.al.", "authors": "Pietro Bernardelle, Leon Fröhling, Stefano Civelli, Riccardo Lunardi, Kevin Roiter, Gianluca Demartini", "id": "2412.14843v1", "paper_url": "http://arxiv.org/abs/2412.14843v1", "repo": "null"}}