{"2407.09013": {"publish_time": "2024-07-12", "title": "Procedural Content Generation via Generative Artificial Intelligence", "paper_summary": "The attempt to utilize machine learning in PCG has been made in the past. In\nthis survey paper, we investigate how generative artificial intelligence (AI),\nwhich saw a significant increase in interest in the mid-2010s, is being used\nfor PCG. We review applications of generative AI for the creation of various\ntypes of content, including terrains, items, and even storylines. While\ngenerative AI is effective for PCG, one significant issues it faces is that\nbuilding high-performance generative AI requires vast amounts of training data.\nBecause content generally highly customized, domain-specific training data is\nscarce, and straightforward approaches to generative AI models may not work\nwell. For PCG research to advance further, issues related to limited training\ndata must be overcome. Thus, we also give special consideration to research\nthat addresses the challenges posed by limited training data.", "paper_summary_zh": "過去曾嘗試在 PCG 中利用機器學習。在\n這篇調查報告中，我們探討生成式人工智慧 (AI) 如何被用於\nPCG，生成式 AI 在 2010 年代中期引起了極大的興趣。我們回顧了\n生成式 AI 在各種內容創作上的應用，包括地形、物品，甚至故事情節。雖然\n生成式 AI 對於 PCG 來說很有效，但它面臨一個重大問題，那就是\n建立高性能生成式 AI 需要大量的訓練資料。由於內容通常高度客製化，因此特定領域的訓練資料很稀少，而生成式 AI 模型的直接方法可能無法\n發揮作用。若要讓 PCG 研究進一步發展，必須克服與訓練資料有限相關的問題。因此，我們也特別考量了解決訓練資料有限所帶來的挑戰的研究。", "author": "Xinyu Mao et.al.", "authors": "Xinyu Mao, Wanli Yu, Kazunori D Yamada, Michael R. Zielewski", "id": "2407.09013v1", "paper_url": "http://arxiv.org/abs/2407.09013v1", "repo": "null"}}