{"2409.14880": {"publish_time": "2024-09-23", "title": "End-to-End Graph Flattening Method for Large Language Models", "paper_summary": "In recent years, the breakthrough of Large Language Models (LLMs) offers new\nideas for achieving universal methods on graph data. The common practice of\nconverting graphs into natural language for LLMs, which refers to graph\nflattening, exhibits good generalizability and interpretability. However, the\npoor organization of the textual format results in poor performance in\nlong-distance scenario understanding. Inspired by human cognitive reasoning\nhabits, we propose a novel method for graph flattening to fit LLMs, termed as\nEnd-to-End DAG-Path prompting (EEDP). Experiments on real-world datasets show\nthat EEDP enhances the reasoning performance of LLMs in long-distance scenarios\nwhile maintaining excellent performance in short-distance scenarios,\ndemonstrating good robustness in the face of distance variations.", "paper_summary_zh": "近年來，大型語言模型 (LLM) 的突破為在圖形資料中達成通用方法提供了新想法。將圖形轉換為自然語言以供 LLM 使用的常見做法，即圖形扁平化，展現出良好的通用性和可解釋性。然而，文本格式組織不佳導致在長距離場景理解中表現不佳。受到人類認知推理習慣的啟發，我們提出了一種新穎的方法來進行圖形扁平化以配合 LLM，稱為端到端 DAG 路徑提示 (EEDP)。在真實世界資料集上的實驗表明，EEDP 增強了 LLM 在長距離場景中的推理性能，同時在短距離場景中保持了出色的性能，在面對距離變化時表現出良好的魯棒性。", "author": "Bin Hong et.al.", "authors": "Bin Hong, Jinze Wu, Jiayu Liu, Liang Ding, Jing Sha, Kai Zhang, Shijin Wang, Zhenya Huang", "id": "2409.14880v1", "paper_url": "http://arxiv.org/abs/2409.14880v1", "repo": "null"}}