{"2406.19653": {"publish_time": "2024-06-28", "title": "ACES: Automatic Cohort Extraction System for Event-Stream Datasets", "paper_summary": "Reproducibility remains a significant challenge in machine learning (ML) for\nhealthcare. In this field, datasets, model pipelines, and even task/cohort\ndefinitions are often private, leading to a significant barrier in sharing,\niterating, and understanding ML results on electronic health record (EHR)\ndatasets. In this paper, we address a significant part of this problem by\nintroducing the Automatic Cohort Extraction System for Event-Stream Datasets\n(ACES). This tool is designed to simultaneously simplify the development of\ntask/cohorts for ML in healthcare and enable the reproduction of these cohorts,\nboth at an exact level for single datasets and at a conceptual level across\ndatasets. To accomplish this, ACES provides (1) a highly intuitive and\nexpressive configuration language for defining both dataset-specific concepts\nand dataset-agnostic inclusion/exclusion criteria, and (2) a pipeline to\nautomatically extract patient records that meet these defined criteria from\nreal-world data. ACES can be automatically applied to any dataset in either the\nMedical Event Data Standard (MEDS) or EventStreamGPT (ESGPT) formats, or to\n*any* dataset for which the necessary task-specific predicates can be extracted\nin an event-stream form. ACES has the potential to significantly lower the\nbarrier to entry for defining ML tasks, redefine the way researchers interact\nwith EHR datasets, and significantly improve the state of reproducibility for\nML studies in this modality. ACES is available at\nhttps://github.com/justin13601/aces.", "paper_summary_zh": "機器學習 (ML) 在醫療保健領域中，可複製性仍然是一項重大挑戰。在這個領域中，資料集、模型管線，甚至任務/群組定義通常都是私有的，這導致在電子健康紀錄 (EHR) 資料集上分享、重複和理解 ML 結果時產生重大的障礙。在本文中，我們透過導入事件串流資料集的自動群組萃取系統 (ACES) 來解決這個問題的其中一個重要部分。此工具旨在同時簡化醫療保健中 ML 的任務/群組開發，並讓這些群組得以複製，無論是在單一資料集的精確層級，還是在跨資料集的概念層級上。為達成此目的，ACES 提供了 (1) 一種高度直覺且具表現力的組態語言，用於定義資料集特定的概念和與資料集無關的包含/排除標準，以及 (2) 一個管線，用於自動從真實世界資料中萃取符合這些定義標準的病患記錄。ACES 可以自動套用至醫療事件資料標準 (MEDS) 或 EventStreamGPT (ESGPT) 格式中的任何資料集，或套用至 *任何* 可以以事件串流形式萃取必要的特定任務謂詞的資料集。ACES 有可能大幅降低定義 ML 任務的進入門檻，重新定義研究人員與 EHR 資料集互動的方式，並顯著改善此方式中 ML 研究的可複製性。ACES 可在 https://github.com/justin13601/aces 取得。", "author": "Justin Xu et.al.", "authors": "Justin Xu, Jack Gallifant, Alistair E. W. Johnson, Matthew B. A. McDermott", "id": "2406.19653v1", "paper_url": "http://arxiv.org/abs/2406.19653v1", "repo": "https://github.com/justin13601/aces"}}