{"2410.22211": {"publish_time": "2024-10-29", "title": "ProMQA: Question Answering Dataset for Multimodal Procedural Activity Understanding", "paper_summary": "Multimodal systems have great potential to assist humans in procedural\nactivities, where people follow instructions to achieve their goals. Despite\ndiverse application scenarios, systems are typically evaluated on traditional\nclassification tasks, e.g., action recognition or temporal action segmentation.\nIn this paper, we present a novel evaluation dataset, ProMQA, to measure system\nadvancements in application-oriented scenarios. ProMQA consists of 401\nmultimodal procedural QA pairs on user recording of procedural activities\ncoupled with their corresponding instruction. For QA annotation, we take a\ncost-effective human-LLM collaborative approach, where the existing annotation\nis augmented with LLM-generated QA pairs that are later verified by humans. We\nthen provide the benchmark results to set the baseline performance on ProMQA.\nOur experiment reveals a significant gap between human performance and that of\ncurrent systems, including competitive proprietary multimodal models. We hope\nour dataset sheds light on new aspects of models' multimodal understanding\ncapabilities.", "paper_summary_zh": "多模态系统在程序化活动中协助人类的潜力巨大，在这些活动中，人们遵循指令来实现目标。尽管有不同的应用场景，但系统通常在传统的分类任务中进行评估，例如动作识别或时间动作分割。在本文中，我们提出了一个新颖的评估数据集 ProMQA，用于衡量系统在面向应用程序的场景中的进步。ProMQA 由 401 个多模态程序化问答对组成，其中包含用户记录的程序化活动和相应的指令。对于问答注释，我们采用了一种经济高效的人工-LLM 协作方法，其中现有的注释通过 LLM 生成的问答对进行扩充，然后由人工验证。然后，我们提供基准结果以设定 ProMQA 的基线性能。我们的实验揭示了人类表现与当前系统（包括有竞争力的专有多模态模型）之间存在显着的差距。我们希望我们的数据集能为模型的多模态理解能力的新方面提供启示。", "author": "Kimihiro Hasegawa et.al.", "authors": "Kimihiro Hasegawa, Wiradee Imrattanatrai, Zhi-Qi Cheng, Masaki Asada, Susan Holm, Yuran Wang, Ken Fukuda, Teruko Mitamura", "id": "2410.22211v1", "paper_url": "http://arxiv.org/abs/2410.22211v1", "repo": "https://github.com/kimihiroh/promqa"}}