{"2409.00544": {"publish_time": "2024-08-31", "title": "Large Language Models-Enabled Digital Twins for Precision Medicine in Rare Gynecological Tumors", "paper_summary": "Rare gynecological tumors (RGTs) present major clinical challenges due to\ntheir low incidence and heterogeneity. The lack of clear guidelines leads to\nsuboptimal management and poor prognosis. Molecular tumor boards accelerate\naccess to effective therapies by tailoring treatment based on biomarkers,\nbeyond cancer type. Unstructured data that requires manual curation hinders\nefficient use of biomarker profiling for therapy matching. This study explores\nthe use of large language models (LLMs) to construct digital twins for\nprecision medicine in RGTs.\n  Our proof-of-concept digital twin system integrates clinical and biomarker\ndata from institutional and published cases (n=21) and literature-derived data\n(n=655 publications with n=404,265 patients) to create tailored treatment plans\nfor metastatic uterine carcinosarcoma, identifying options potentially missed\nby traditional, single-source analysis. LLM-enabled digital twins efficiently\nmodel individual patient trajectories. Shifting to a biology-based rather than\norgan-based tumor definition enables personalized care that could advance RGT\nmanagement and thus enhance patient outcomes.", "paper_summary_zh": "罕見婦科腫瘤 (RGT) 由於其低發生率和異質性，對臨床帶來重大挑戰。缺乏明確的指引導致次佳管理和不良預後。分子腫瘤委員會透過根據生物標記客製化治療，加速取得有效療法，超越癌症類型。需要手動整理的非結構化資料阻礙了生物標記分析在療法配對中的有效使用。本研究探討使用大型語言模型 (LLM) 為 RGT 的精準醫療建構數位雙胞胎。\n我們的概念驗證數位雙胞胎系統整合了來自機構和已發表的案例 (n=21) 的臨床和生物標記資料，以及來自文獻的資料 (n=655 篇出版物，n=404,265 名患者)，為轉移性子宮肉瘤癌制定客製化治療計畫，找出傳統單一來源分析可能遺漏的選項。LLM 啟用的數位雙胞胎有效地模擬個別患者的軌跡。從基於器官的腫瘤定義轉變為基於生物學的定義，能實現個人化照護，進而提升 RGT 管理並改善患者預後。", "author": "Jacqueline Lammert et.al.", "authors": "Jacqueline Lammert, Nicole Pfarr, Leonid Kuligin, Sonja Mathes, Tobias Dreyer, Luise Modersohn, Patrick Metzger, Dyke Ferber, Jakob Nikolas Kather, Daniel Truhn, Lisa Christine Adams, Keno Kyrill Bressem, Sebastian Lange, Kristina Schwamborn, Martin Boeker, Marion Kiechle, Ulrich A. Schatz, Holger Bronger, Maximilian Tschochohei", "id": "2409.00544v1", "paper_url": "http://arxiv.org/abs/2409.00544v1", "repo": "null"}}