{"2408.04540": {"publish_time": "2024-08-08", "title": "MemeMind at ArAIEval Shared Task: Spotting Persuasive Spans in Arabic Text with Persuasion Techniques Identification", "paper_summary": "This paper focuses on detecting propagandistic spans and persuasion\ntechniques in Arabic text from tweets and news paragraphs. Each entry in the\ndataset contains a text sample and corresponding labels that indicate the start\nand end positions of propaganda techniques within the text. Tokens falling\nwithin a labeled span were assigned \"B\" (Begin) or \"I\" (Inside), \"O\",\ncorresponding to the specific propaganda technique. Using attention masks, we\ncreated uniform lengths for each span and assigned BIO tags to each token based\non the provided labels. Then, we used AraBERT-base pre-trained model for Arabic\ntext tokenization and embeddings with a token classification layer to identify\npropaganda techniques. Our training process involves a two-phase fine-tuning\napproach. First, we train only the classification layer for a few epochs,\nfollowed by full model fine-tuning, updating all parameters. This methodology\nallows the model to adapt to the specific characteristics of the propaganda\ndetection task while leveraging the knowledge captured by the pre-trained\nAraBERT model. Our approach achieved an F1 score of 0.2774, securing the 3rd\nposition in the leaderboard of Task 1.", "paper_summary_zh": "本文重點在於偵測推文和新聞段落中的阿拉伯語宣傳範圍和說服技巧。資料集中每個條目包含一個文字範本和對應標籤，標籤會指出文字中宣傳技巧的開始和結束位置。落在標籤範圍內的標記會被指定為「B」（開頭）或「I」（中間）、「O」，對應到特定的宣傳技巧。我們使用注意力遮罩，為每個範圍建立統一長度，並根據提供的標籤為每個標記指定 BIO 標籤。然後，我們使用 AraBERT-base 預訓練模型進行阿拉伯語文字標記化和內嵌，並使用標記分類層來識別宣傳技巧。我們的訓練過程包含一個兩階段微調方法。首先，我們只訓練分類層幾個時期，接著進行完整模型微調，更新所有參數。這種方法讓模型能夠適應宣傳偵測任務的特定特徵，同時運用預訓練 AraBERT 模型擷取的知識。我們的做法達到 0.2774 的 F1 分數，在任務 1 的排行榜中取得第 3 名。", "author": "Md Rafiul Biswas et.al.", "authors": "Md Rafiul Biswas, Zubair Shah, Wajdi Zaghouani", "id": "2408.04540v1", "paper_url": "http://arxiv.org/abs/2408.04540v1", "repo": "null"}}