{"2410.14675": {"publish_time": "2024-10-18", "title": "Enhancing Large Language Models' Situated Faithfulness to External Contexts", "paper_summary": "Large Language Models (LLMs) are often augmented with external information as\ncontexts, but this external information can sometimes be inaccurate or even\nintentionally misleading. We argue that robust LLMs should demonstrate situated\nfaithfulness, dynamically calibrating their trust in external information based\non their confidence in the internal knowledge and the external context. To\nbenchmark this capability, we evaluate LLMs across several QA datasets,\nincluding a newly created dataset called RedditQA featuring in-the-wild\nincorrect contexts sourced from Reddit posts. We show that when provided with\nboth correct and incorrect contexts, both open-source and proprietary models\ntend to overly rely on external information, regardless of its factual\naccuracy. To enhance situated faithfulness, we propose two approaches:\nSelf-Guided Confidence Reasoning (SCR) and Rule-Based Confidence Reasoning\n(RCR). SCR enables models to self-access the confidence of external information\nrelative to their own internal knowledge to produce the most accurate answer.\nRCR, in contrast, extracts explicit confidence signals from the LLM and\ndetermines the final answer using predefined rules. Our results show that for\nLLMs with strong reasoning capabilities, such as GPT-4o and GPT-4o mini, SCR\noutperforms RCR, achieving improvements of up to 24.2% over a direct input\naugmentation baseline. Conversely, for a smaller model like Llama-3-8B, RCR\noutperforms SCR. Fine-tuning SCR with our proposed Confidence Reasoning Direct\nPreference Optimization (CR-DPO) method improves performance on both seen and\nunseen datasets, yielding an average improvement of 8.9% on Llama-3-8B. In\naddition to quantitative results, we offer insights into the relative strengths\nof SCR and RCR. Our findings highlight promising avenues for improving situated\nfaithfulness in LLMs. The data and code are released.", "paper_summary_zh": "大型語言模型 (LLM) 通常會以外部資訊作為情境進行擴充，但這些外部資訊有時可能不正確，甚至故意具有誤導性。我們認為，強健的 LLM 應展現情境忠實度，根據其對內部知識和外部情境的信心，動態校準其對外部資訊的信任。為了評量此項能力，我們針對多個問答資料集評估 LLM，包括一個新建立的資料集 RedditQA，其特點是從 Reddit 貼文中擷取的真實不正確情境。我們發現，當提供正確和不正確的情境時，不論是開放原始碼或專有模型，都傾向過度依賴外部資訊，而不管其事實正確性。為了增強情境忠實度，我們提出兩種方法：自導信心推理 (SCR) 和基於規則的信心推理 (RCR)。SCR 使模型能夠自行存取外部資訊的信心，相對於其自身的內部知識，以產生最準確的答案。相反地，RCR 從 LLM 中擷取明確的信心訊號，並使用預定義的規則來決定最終答案。我們的結果顯示，對於具有強大推理能力的 LLM，例如 GPT-4o 和 GPT-4o mini，SCR 優於 RCR，與直接輸入擴充基準相比，改進幅度高達 24.2%。相反地，對於較小的模型，例如 Llama-3-8B，RCR 優於 SCR。使用我們提出的信心推理直接偏好最佳化 (CR-DPO) 方法微調 SCR，可以提高已見和未見資料集的效能，在 Llama-3-8B 上產生平均 8.9% 的改進。除了量化結果外，我們還提供了對 SCR 和 RCR 相對優勢的見解。我們的發現突顯了改善 LLM 中情境忠實度的有前景途徑。資料和程式碼已發布。", "author": "Yukun Huang et.al.", "authors": "Yukun Huang, Sanxing Chen, Hongyi Cai, Bhuwan Dhingra", "id": "2410.14675v1", "paper_url": "http://arxiv.org/abs/2410.14675v1", "repo": "https://github.com/kkkevinkkkkk/situated_faithfulness"}}