{"2501.03855": {"publish_time": "2025-01-07", "title": "BabyLMs for isiXhosa: Data-Efficient Language Modelling in a Low-Resource Context", "paper_summary": "The BabyLM challenge called on participants to develop sample-efficient\nlanguage models. Submissions were pretrained on a fixed English corpus, limited\nto the amount of words children are exposed to in development (<100m). The\nchallenge produced new architectures for data-efficient language modelling,\nwhich outperformed models trained on trillions of words. This is promising for\nlow-resource languages, where available corpora are limited to much less than\n100m words. In this paper, we explore the potential of BabyLMs for low-resource\nlanguages, using the isiXhosa language as a case study. We pretrain two BabyLM\narchitectures, ELC-BERT and MLSM, on an isiXhosa corpus. They outperform a\nvanilla pretrained model on POS tagging and NER, achieving notable gains (+3.2\nF1) for the latter. In some instances, the BabyLMs even outperform XLM-R. Our\nfindings show that data-efficient models are viable for low-resource languages,\nbut highlight the continued importance, and lack of, high-quality pretraining\ndata. Finally, we visually analyse how BabyLM architectures encode isiXhosa.", "paper_summary_zh": "BabyLM 挑戰要求參與者開發出樣本效率語言模型。提交的模型在固定的英語語料庫上進行預訓練，並限制在兒童在發展過程中接觸到的詞彙量（<100m）。該挑戰產生了用於資料效率語言建模的新架構，其效能優於在數兆個詞彙上訓練的模型。這對於低資源語言來說很有希望，因為可用的語料庫限制在遠少於 100m 個詞彙。在本文中，我們探討了 BabyLM 在低資源語言中的潛力，並以 isiXhosa 語言作為案例研究。我們在 isiXhosa 語料庫上預訓練了兩個 BabyLM 架構，ELC-BERT 和 MLSM。它們在詞性標記和 NER 上的表現優於香草預訓練模型，後者獲得了顯著的增益（+3.2 F1）。在某些情況下，BabyLM 甚至優於 XLM-R。我們的研究結果表明，資料效率模型對於低資源語言是可行的，但強調了高品質預訓練資料的持續重要性和缺乏。最後，我們視覺化分析了 BabyLM 架構如何編碼 isiXhosa。", "author": "Alexis Matzopoulos et.al.", "authors": "Alexis Matzopoulos, Charl Hendriks, Hishaam Mahomed, Francois Meyer", "id": "2501.03855v1", "paper_url": "http://arxiv.org/abs/2501.03855v1", "repo": "null"}}