{"2405.13094": {"publish_time": "2024-05-21", "title": "KPG: Key Propagation Graph Generator for Rumor Detection based on Reinforcement Learning", "paper_summary": "The proliferation of rumors on social media platforms during significant\nevents, such as the US elections and the COVID-19 pandemic, has a profound\nimpact on social stability and public health. Existing approaches for rumor\ndetection primarily rely on propagation graphs to enhance model effectiveness.\nHowever, the presence of noisy and irrelevant structures during the propagation\nprocess limits the efficacy of these approaches. To tackle this issue,\ntechniques such as weight adjustment and data augmentation have been proposed.\nHowever, these techniques heavily depend on rich original propagation\nstructures, thus hindering performance when dealing with rumors that lack\nsufficient propagation information in the early propagation stages. In this\npaper, we propose Key Propagation Graph Generator (KPG), a novel reinforcement\nlearning-based rumor detection framework that generates contextually coherent\nand informative propagation patterns for events with insufficient topology\ninformation, while also identifies indicative substructures for events with\nredundant and noisy propagation structures. KPG consists of two key components:\nthe Candidate Response Generator (CRG) and the Ending Node Selector (ENS). CRG\nlearns the latent distribution from refined propagation patterns, filtering out\nnoise and generating new candidates for ENS. Simultaneously, ENS identifies the\nmost influential substructures within propagation graphs and generates training\ndata for CRG. Moreover, we introduce an end-to-end framework that utilizes\nrewards to guide the entire training process via a pre-trained graph neural\nnetwork. Extensive experiments conducted on four datasets demonstrate the\nsuperiority of our KPG compared to the state-of-the-art approaches.", "paper_summary_zh": "<paragraph>在重大事件（例如美國選舉和 COVID-19 大流行）期間，社交媒體平台上謠言的散布對社會穩定和公共衛生產生了深遠的影響。現有的謠言檢測方法主要依賴傳播圖來提高模型的有效性。然而，在傳播過程中存在雜訊和無關結構會限制這些方法的效力。為了解決這個問題，已經提出了權重調整和數據擴充等技術。然而，這些技術嚴重依賴於豐富的原始傳播結構，因此在處理在早期傳播階段缺乏足夠傳播信息的謠言時會阻礙性能。在本文中，我們提出了關鍵傳播圖生成器 (KPG)，這是一個基於強化學習的新型謠言檢測框架，它為拓撲信息不足的事件生成上下文相干且信息豐富的傳播模式，同時還識別出具有冗餘和雜訊傳播結構的事件的指示性子結構。KPG 包含兩個關鍵組成部分：候選響應生成器 (CRG) 和結束節點選擇器 (ENS)。CRG 從精煉的傳播模式中學習潛在分佈，過濾雜訊並為 ENS 生成新的候選項。同時，ENS 識別傳播圖中影響最大的子結構，並為 CRG 生成訓練數據。此外，我們引入了一個端到端框架，它利用獎勵通過預訓練的圖神經網路指導整個訓練過程。在四個數據集上進行的廣泛實驗證明了我們 KPG 與最先進方法相比的優越性。</paragraph>", "author": "Yusong Zhang et.al.", "authors": "Yusong Zhang, Kun Xie, Xingyi Zhang, Xiangyu Dong, Sibo Wang", "id": "2405.13094v1", "paper_url": "http://arxiv.org/abs/2405.13094v1", "repo": "null"}}