{"2411.04580": {"publish_time": "2024-11-07", "title": "Interpreting the Learned Model in MuZero Planning", "paper_summary": "MuZero has achieved superhuman performance in various games by using a\ndynamics network to predict environment dynamics for planning, without relying\non simulators. However, the latent states learned by the dynamics network make\nits planning process opaque. This paper aims to demystify MuZero's model by\ninterpreting the learned latent states. We incorporate observation\nreconstruction and state consistency into MuZero training and conduct an\nin-depth analysis to evaluate latent states across two board games: 9x9 Go and\nOuter-Open Gomoku, and three Atari games: Breakout, Ms. Pacman, and Pong. Our\nfindings reveal that while the dynamics network becomes less accurate over\nlonger simulations, MuZero still performs effectively by using planning to\ncorrect errors. Our experiments also show that the dynamics network learns\nbetter latent states in board games than in Atari games. These insights\ncontribute to a better understanding of MuZero and offer directions for future\nresearch to improve the playing performance, robustness, and interpretability\nof the MuZero algorithm.", "paper_summary_zh": "MuZero 利用動態網路來預測環境動態以進行規劃，在各種遊戲中達到了超越人類的表現，而無需依賴模擬器。然而，動態網路所學習的潛在狀態使其規劃過程不透明。本文旨在透過解讀學習到的潛在狀態來揭開 MuZero 模型的神秘面紗。我們將觀察重建和狀態一致性納入 MuZero 訓練，並進行深入分析以評估兩個棋盤遊戲（9x9 圍棋和開放式五子棋）和三個 Atari 遊戲（Breakout、Ms. Pacman 和 Pong）中的潛在狀態。我們的發現揭示，儘管動態網路在較長的模擬中變得不那麼準確，但 MuZero 仍能透過規劃來修正錯誤，有效執行。我們的實驗還表明，動態網路在棋盤遊戲中學習的潛在狀態比在 Atari 遊戲中更好。這些見解有助於我們更深入地了解 MuZero，並為未來的研究提供了方向，以改善 MuZero 演算法的遊戲表現、穩健性和可解釋性。", "author": "Hung Guei et.al.", "authors": "Hung Guei, Yan-Ru Ju, Wei-Yu Chen, Ti-Rong Wu", "id": "2411.04580v1", "paper_url": "http://arxiv.org/abs/2411.04580v1", "repo": "null"}}