{"2409.10760": {"publish_time": "2024-09-16", "title": "Semantics Preserving Emoji Recommendation with Large Language Models", "paper_summary": "Emojis have become an integral part of digital communication, enriching text\nby conveying emotions, tone, and intent. Existing emoji recommendation methods\nare primarily evaluated based on their ability to match the exact emoji a user\nchooses in the original text. However, they ignore the essence of users'\nbehavior on social media in that each text can correspond to multiple\nreasonable emojis. To better assess a model's ability to align with such\nreal-world emoji usage, we propose a new semantics preserving evaluation\nframework for emoji recommendation, which measures a model's ability to\nrecommend emojis that maintain the semantic consistency with the user's text.\nTo evaluate how well a model preserves semantics, we assess whether the\npredicted affective state, demographic profile, and attitudinal stance of the\nuser remain unchanged. If these attributes are preserved, we consider the\nrecommended emojis to have maintained the original semantics. The advanced\nabilities of Large Language Models (LLMs) in understanding and generating\nnuanced, contextually relevant output make them well-suited for handling the\ncomplexities of semantics preserving emoji recommendation. To this end, we\nconstruct a comprehensive benchmark to systematically assess the performance of\nsix proprietary and open-source LLMs using different prompting techniques on\nour task. Our experiments demonstrate that GPT-4o outperforms other LLMs,\nachieving a semantics preservation score of 79.23%. Additionally, we conduct\ncase studies to analyze model biases in downstream classification tasks and\nevaluate the diversity of the recommended emojis.", "paper_summary_zh": "表情符已成為數位溝通中不可或缺的一部分，透過傳達情緒、語氣和意圖，豐富了文字。現有的表情符推薦方法主要根據其匹配使用者在原始文字中選擇的確切表情符的能力來評估。然而，它們忽略了使用者在社群媒體上的行為本質，因為每則文字都可能對應到多個合理的表情符。為了更佳評估模型與此類真實世界表情符使用方式一致的能力，我們提出一個新的語意保留評估架構，用於表情符推薦，用以衡量模型推薦與使用者文字維持語意一致性的能力。為了評估模型保留語意的程度，我們評估使用者預測的情感狀態、人口統計資料和態度立場是否保持不變。如果這些屬性得以保留，我們認為推薦的表情符已維持原始語意。大型語言模型 (LLM) 在理解和產生細微差別且與脈絡相關的輸出方面具有進階能力，使其非常適合處理語意保留表情符推薦的複雜性。為此，我們建構一個全面的基準，以系統性評估六個專有和開源 LLM 在我們任務中使用不同提示技術的效能。我們的實驗證明，GPT-4o 優於其他 LLM，達到 79.23% 的語意保留分數。此外，我們進行個案研究，分析下游分類任務中的模型偏誤，並評估推薦表情符的多樣性。", "author": "Zhongyi Qiu et.al.", "authors": "Zhongyi Qiu, Kangyi Qiu, Hanjia Lyu, Wei Xiong, Jiebo Luo", "id": "2409.10760v1", "paper_url": "http://arxiv.org/abs/2409.10760v1", "repo": "null"}}