{"2406.17334": {"publish_time": "2024-06-25", "title": "Joint Admission Control and Resource Allocation of Virtual Network Embedding via Hierarchical Deep Reinforcement Learning", "paper_summary": "As an essential resource management problem in network virtualization,\nvirtual network embedding (VNE) aims to allocate the finite resources of\nphysical network to sequentially arriving virtual network requests (VNRs) with\ndifferent resource demands. Since this is an NP-hard combinatorial optimization\nproblem, many efforts have been made to provide viable solutions. However, most\nexisting approaches have either ignored the admission control of VNRs, which\nhas a potential impact on long-term performances, or not fully exploited the\ntemporal and topological features of the physical network and VNRs. In this\npaper, we propose a deep Hierarchical Reinforcement Learning approach to learn\na joint Admission Control and Resource Allocation policy for VNE, named\nHRL-ACRA. Specifically, the whole VNE process is decomposed into an upper-level\npolicy for deciding whether to admit the arriving VNR or not and a lower-level\npolicy for allocating resources of the physical network to meet the requirement\nof VNR through the HRL approach. Considering the proximal policy optimization\nas the basic training algorithm, we also adopt the average reward method to\naddress the infinite horizon problem of the upper-level agent and design a\ncustomized multi-objective intrinsic reward to alleviate the sparse reward\nissue of the lower-level agent. Moreover, we develop a deep feature-aware graph\nneural network to capture the features of VNR and physical network and exploit\na sequence-to-sequence model to generate embedding actions iteratively.\nFinally, extensive experiments are conducted in various settings, and show that\nHRL-ACRA outperforms state-of-the-art baselines in terms of both the acceptance\nratio and long-term average revenue. Our code is available at\n\\url{https://github.com/GeminiLight/hrl-acra}.", "paper_summary_zh": "<paragraph>作為網路虛擬化中一項重要的資源管理問題，\n虛擬網路嵌入（VNE）旨在將實體網路的有限資源分配給依序抵達的虛擬網路請求（VNR），其資源需求各不相同。由於這是一個 NP 難組合最佳化問題，因此已投入許多心力來提供可行的解決方案。然而，大多數現有方法都忽略了 VNR 的接納控制，這可能會對長期效能造成影響，或者沒有充分利用實體網路和 VNR 的時間和拓撲特徵。在本文中，我們提出了一種深度階層式強化學習方法來學習 VNE 的聯合接納控制和資源分配政策，稱為 HRL-ACRA。具體來說，整個 VNE 程序被分解為一個上層政策，用於決定是否接納抵達的 VNR，以及一個下層政策，用於透過 HRL 方法分配實體網路的資源以滿足 VNR 的需求。考慮到近端政策最佳化作為基本的訓練演算法，我們也採用平均獎勵法來解決上層代理的無限時間軸問題，並設計一個自訂的多目標內在獎勵來緩解下層代理的稀疏獎勵問題。此外，我們開發了一個深度特徵感知圖神經網路來擷取 VNR 和實體網路的特徵，並利用序列到序列模型來反覆產生嵌入動作。最後，在各種設定中進行了廣泛的實驗，結果顯示 HRL-ACRA 在接受率和長期平均收益方面都優於最先進的基準。我們的程式碼可在\n\\url{https://github.com/GeminiLight/hrl-acra} 取得。</paragraph>", "author": "Tianfu Wang et.al.", "authors": "Tianfu Wang, Li Shen, Qilin Fan, Tong Xu, Tongliang Liu, Hui Xiong", "id": "2406.17334v1", "paper_url": "http://arxiv.org/abs/2406.17334v1", "repo": "https://github.com/geminilight/hrl-acra"}}