{"2406.08418": {"publish_time": "2024-06-12", "title": "OmniCorpus: An Unified Multimodal Corpus of 10 Billion-Level Images Interleaved with Text", "paper_summary": "Image-text interleaved data, consisting of multiple images and texts arranged\nin a natural document format, aligns with the presentation paradigm of internet\ndata and closely resembles human reading habits. Recent studies have shown that\nsuch data aids multimodal in-context learning and maintains the capabilities of\nlarge language models during multimodal fine-tuning. However, the limited scale\nand diversity of current image-text interleaved data restrict the development\nof multimodal large language models. In this paper, we introduce OmniCorpus, a\n10 billion-scale image-text interleaved dataset. Using an efficient data\nengine, we filter and extract large-scale high-quality documents, which contain\n8.6 billion images and 1,696 billion text tokens. Compared to counterparts\n(e.g., MMC4, OBELICS), our dataset 1) has 15 times larger scales while\nmaintaining good data quality; 2) features more diverse sources, including both\nEnglish and non-English websites as well as video-centric websites; 3) is more\nflexible, easily degradable from an image-text interleaved format to pure text\ncorpus and image-text pairs. Through comprehensive analysis and experiments, we\nvalidate the quality, usability, and effectiveness of the proposed dataset. We\nhope this could provide a solid data foundation for future multimodal model\nresearch. Code and data are released at\nhttps://github.com/OpenGVLab/OmniCorpus.", "paper_summary_zh": "影像文字穿插資料，由多個影像和文字組成，以自然的文件格式排列，與網際網路資料的呈現範例相符，且與人類的閱讀習慣十分類似。最近的研究顯示，此類資料有助於多模態脈絡學習，並在多模態微調過程中維持大型語言模型的能力。然而，目前影像文字穿插資料的規模和多樣性有限，限制了多模態大型語言模型的發展。在本文中，我們介紹 OmniCorpus，一個 100 億規模的影像文字穿插資料集。我們使用高效能的資料引擎，篩選並擷取大量高品質的文件，其中包含 86 億張影像和 1,6960 億個文字符號。與同類型資料集（例如 MMC4、OBELICS）相比，我們的資料集 1) 規模大 15 倍，同時維持良好的資料品質；2) 來源更多元，包含英文和非英文網站，以及以影片為中心的網站；3) 更具彈性，可輕易從影像文字穿插格式轉換為純文字語料庫和影像文字配對。透過全面的分析和實驗，我們驗證了所提出資料集的品質、可用性和有效性。我們希望這能為未來的多模態模型研究提供穩固的資料基礎。程式碼和資料已於 https://github.com/OpenGVLab/OmniCorpus 發布。", "author": "Qingyun Li et.al.", "authors": "Qingyun Li, Zhe Chen, Weiyun Wang, Wenhai Wang, Shenglong Ye, Zhenjiang Jin, Guanzhou Chen, Yinan He, Zhangwei Gao, Erfei Cui, Jiashuo Yu, Hao Tian, Jiasheng Zhou, Chao Xu, Bin Wang, Xingjian Wei, Wei Li, Wenjian Zhang, Bo Zhang, Pinlong Cai, Licheng Wen, Xiangchao Yan, Pei Chu, Yi Wang, Min Dou, Changyao Tian, Xizhou Zhu, Lewei Lu, Yushi Chen, Junjun He, Tong Lu, Yali Wang, Limin Wang, Dahua Lin, Yu Qiao, Botian Shi, Conghui He, Jifeng Dai", "id": "2406.08418v1", "paper_url": "http://arxiv.org/abs/2406.08418v1", "repo": "https://github.com/opengvlab/omnicorpus"}}