{"2502.01691": {"publish_time": "2025-02-02", "title": "Agent-Based Uncertainty Awareness Improves Automated Radiology Report Labeling with an Open-Source Large Language Model", "paper_summary": "Reliable extraction of structured data from radiology reports using Large\nLanguage Models (LLMs) remains challenging, especially for complex, non-English\ntexts like Hebrew. This study introduces an agent-based uncertainty-aware\napproach to improve the trustworthiness of LLM predictions in medical\napplications. We analyzed 9,683 Hebrew radiology reports from Crohn's disease\npatients (from 2010 to 2023) across three medical centers. A subset of 512\nreports was manually annotated for six gastrointestinal organs and 15\npathological findings, while the remaining reports were automatically annotated\nusing HSMP-BERT. Structured data extraction was performed using Llama 3.1\n(Llama 3-8b-instruct) with Bayesian Prompt Ensembles (BayesPE), which employed\nsix semantically equivalent prompts to estimate uncertainty. An Agent-Based\nDecision Model integrated multiple prompt outputs into five confidence levels\nfor calibrated uncertainty and was compared against three entropy-based models.\nPerformance was evaluated using accuracy, F1 score, precision, recall, and\nCohen's Kappa before and after filtering high-uncertainty cases. The\nagent-based model outperformed the baseline across all metrics, achieving an F1\nscore of 0.3967, recall of 0.6437, and Cohen's Kappa of 0.3006. After filtering\nhigh-uncertainty cases (greater than or equal to 0.5), the F1 score improved to\n0.4787, and Kappa increased to 0.4258. Uncertainty histograms demonstrated\nclear separation between correct and incorrect predictions, with the\nagent-based model providing the most well-calibrated uncertainty estimates. By\nincorporating uncertainty-aware prompt ensembles and an agent-based decision\nmodel, this approach enhances the performance and reliability of LLMs in\nstructured data extraction from radiology reports, offering a more\ninterpretable and trustworthy solution for high-stakes medical applications.", "paper_summary_zh": "<paragraph>使用大型語言模型 (LLM) 從放射科報告中可靠地提取結構化數據仍然具有挑戰性，尤其是對於希伯來語等複雜的非英語文本。本研究引入了一種基於代理的不確定性感知方法，以提高 LLM 預測在醫療應用中的可信度。我們分析了來自三個醫療中心的 9,683 份克隆氏症患者的希伯來語放射科報告（從 2010 年到 2023 年）。其中 512 份報告的手動註釋包括六個胃腸器官和 15 個病理發現，而其餘報告則使用 HSMP-BERT 自動註釋。結構化數據提取使用 Llama 3.1（Llama 3-8b-instruct）與貝葉斯提示集合（BayesPE）進行，它採用六個語義等效提示來估計不確定性。基於代理的決策模型將多個提示輸出整合到五個置信度級別中以校準不確定性，並與三個基於熵的模型進行比較。在過濾掉高度不確定性的情況之前和之後，使用準確度、F1 分數、精確度、召回率和 Cohen's Kappa 評估性能。基於代理的模型在所有指標上都優於基線，F1 分數達到 0.3967，召回率達到 0.6437，Cohen's Kappa 達到 0.3006。在過濾掉高度不確定性的情況（大於或等於 0.5）後，F1 分數提高到 0.4787，Kappa 提高到 0.4258。不確定性直方圖顯示了正確預測和不正確預測之間的明顯區別，基於代理的模型提供了校準最好的不確定性估計。通過結合不確定性感知提示集合和基於代理的決策模型，這種方法增強了 LLM 在放射科報告中結構化數據提取中的性能和可靠性，為高風險醫療應用提供了更具可解釋性和可信度的解決方案。</paragraph>", "author": "Hadas Ben-Atya et.al.", "authors": "Hadas Ben-Atya, Naama Gavrielov, Zvi Badash, Gili Focht, Ruth Cytter-Kuint, Talar Hagopian, Dan Turner, Moti Freiman", "id": "2502.01691v1", "paper_url": "http://arxiv.org/abs/2502.01691v1", "repo": "null"}}