{"2410.20911": {"publish_time": "2024-10-28", "title": "Hacking Back the AI-Hacker: Prompt Injection as a Defense Against LLM-driven Cyberattacks", "paper_summary": "Large language models (LLMs) are increasingly being harnessed to automate\ncyberattacks, making sophisticated exploits more accessible and scalable. In\nresponse, we propose a new defense strategy tailored to counter LLM-driven\ncyberattacks. We introduce Mantis, a defensive framework that exploits LLMs'\nsusceptibility to adversarial inputs to undermine malicious operations. Upon\ndetecting an automated cyberattack, Mantis plants carefully crafted inputs into\nsystem responses, leading the attacker's LLM to disrupt their own operations\n(passive defense) or even compromise the attacker's machine (active defense).\nBy deploying purposefully vulnerable decoy services to attract the attacker and\nusing dynamic prompt injections for the attacker's LLM, Mantis can autonomously\nhack back the attacker. In our experiments, Mantis consistently achieved over\n95% effectiveness against automated LLM-driven attacks. To foster further\nresearch and collaboration, Mantis is available as an open-source tool:\nhttps://github.com/pasquini-dario/project_mantis", "paper_summary_zh": "大型語言模型 (LLM) 愈來愈常被用來自動化網路攻擊，讓精密攻擊更易於取得且可擴充。為此，我們提出了一種新的防禦策略，專門用來對抗 LLM 驅動的網路攻擊。我們引進 Mantis，一個防禦框架，它利用 LLM 對對抗性輸入的敏感性來破壞惡意操作。在偵測到自動化網路攻擊時，Mantis 會在系統回應中植入精心設計的輸入，讓攻擊者的 LLM 中斷自己的操作（被動防禦）或甚至危害攻擊者的機器（主動防禦）。透過部署有目的的易受攻擊誘餌服務來吸引攻擊者，並針對攻擊者的 LLM 使用動態提示注入，Mantis 可以自主反擊攻擊者。在我們的實驗中，Mantis 對抗自動化 LLM 驅動攻擊的有效性始終超過 95%。為了促進進一步的研究和合作，Mantis 已作為一個開放原始碼工具：https://github.com/pasquini-dario/project_mantis", "author": "Dario Pasquini et.al.", "authors": "Dario Pasquini, Evgenios M. Kornaropoulos, Giuseppe Ateniese", "id": "2410.20911v1", "paper_url": "http://arxiv.org/abs/2410.20911v1", "repo": "https://github.com/pasquini-dario/project_mantis"}}