{"2412.11453": {"publish_time": "2024-12-16", "title": "ACE-$M^3$: Automatic Capability Evaluator for Multimodal Medical Models", "paper_summary": "As multimodal large language models (MLLMs) gain prominence in the medical\nfield, the need for precise evaluation methods to assess their effectiveness\nhas become critical. While benchmarks provide a reliable means to evaluate the\ncapabilities of MLLMs, traditional metrics like ROUGE and BLEU employed for\nopen domain evaluation only focus on token overlap and may not align with human\njudgment. Although human evaluation is more reliable, it is labor-intensive,\ncostly, and not scalable. LLM-based evaluation methods have proven promising,\nbut to date, there is still an urgent need for open-source multimodal LLM-based\nevaluators in the medical field. To address this issue, we introduce ACE-$M^3$,\nan open-sourced \\textbf{A}utomatic \\textbf{C}apability \\textbf{E}valuator for\n\\textbf{M}ultimodal \\textbf{M}edical \\textbf{M}odels specifically designed to\nassess the question answering abilities of medical MLLMs. It first utilizes a\nbranch-merge architecture to provide both detailed analysis and a concise final\nscore based on standard medical evaluation criteria. Subsequently, a reward\ntoken-based direct preference optimization (RTDPO) strategy is incorporated to\nsave training time without compromising performance of our model. Extensive\nexperiments have demonstrated the effectiveness of our ACE-$M^3$\nmodel\\footnote{\\url{https://huggingface.co/collections/AIUSRTMP/ace-m3-67593297ff391b93e3e5d068}}\nin evaluating the capabilities of medical MLLMs.", "paper_summary_zh": "<paragraph>隨著多模態大型語言模型 (MLLM) 在醫療領域的重要性日益提升，評估其效能的精準評量方法的需求也變得至關重要。雖然基準測試提供了評估 MLLM 能力的可靠方法，但用於開放領域評量的傳統指標，例如 ROUGE 和 BLEU，僅著重於權標重疊，可能與人類判斷不符。儘管人類評量較為可靠，但它卻勞力密集、成本高昂且無法擴充。基於 LLM 的評量方法已被證實具有前景，但迄今為止，醫療領域仍迫切需要開放原始碼的多模態基於 LLM 的評量器。為了解決這個問題，我們引入了 ACE-$M^3$，一個開放原始碼的**A**utomatic **C**apability **E**valuator for **M**ultimodal **M**edical **M**odels，專門設計用於評估醫療 MLLM 的問答能力。它首先利用分支合併架構提供詳細分析和基於標準醫療評量標準的簡潔最終評分。隨後，納入了基於獎勵權標的直接偏好最佳化 (RTDPO) 策略，以節省訓練時間，同時不影響我們模型的效能。廣泛的實驗證明了我們的 ACE-$M^3$ 模型\\footnote{\\url{https://huggingface.co/collections/AIUSRTMP/ace-m3-67593297ff391b93e3e5d068}} 在評估醫療 MLLM 能力方面的效能。</paragraph>", "author": "Xiechi Zhang et.al.", "authors": "Xiechi Zhang, Shunfan Zheng, Linlin Wang, Gerard de Melo, Zhu Cao, Xiaoling Wang, Liang He", "id": "2412.11453v1", "paper_url": "http://arxiv.org/abs/2412.11453v1", "repo": "null"}}