{"2411.17991": {"publish_time": "2024-11-27", "title": "VideoLLM Knows When to Speak: Enhancing Time-Sensitive Video Comprehension with Video-Text Duet Interaction Format", "paper_summary": "Recent researches on video large language models (VideoLLM) predominantly\nfocus on model architectures and training datasets, leaving the interaction\nformat between the user and the model under-explored. In existing works, users\noften interact with VideoLLMs by using the entire video and a query as input,\nafter which the model generates a response. This interaction format constrains\nthe application of VideoLLMs in scenarios such as live-streaming comprehension\nwhere videos do not end and responses are required in a real-time manner, and\nalso results in unsatisfactory performance on time-sensitive tasks that\nrequires localizing video segments. In this paper, we focus on a video-text\nduet interaction format. This interaction format is characterized by the\ncontinuous playback of the video, and both the user and the model can insert\ntheir text messages at any position during the video playback. When a text\nmessage ends, the video continues to play, akin to the alternative of two\nperformers in a duet. We construct MMDuetIT, a video-text training dataset\ndesigned to adapt VideoLLMs to video-text duet interaction format. We also\nintroduce the Multi-Answer Grounded Video Question Answering (MAGQA) task to\nbenchmark the real-time response ability of VideoLLMs. Trained on MMDuetIT,\nMMDuet demonstrates that adopting the video-text duet interaction format\nenables the model to achieve significant improvements in various time-sensitive\ntasks (76% CIDEr on YouCook2 dense video captioning, 90\\% mAP on QVHighlights\nhighlight detection and 25% R@0.5 on Charades-STA temporal video grounding)\nwith minimal training efforts, and also enable VideoLLMs to reply in a\nreal-time manner as the video plays. Code, data and demo are available at:\nhttps://github.com/yellow-binary-tree/MMDuet.", "paper_summary_zh": "近期的影片大型语言模型 (VideoLLM) 研究主要集中于模型架构和训练数据集，而使用者与模型之间的互动方式则较少被探讨。在现有的作品中，使用者通常使用整个影片和查询作为输入，与 VideoLLM 互动，然后模型会产生回应。这种互动方式限制了 VideoLLM 在影片不断播放且需要实时回应的场景（例如直播理解）中的应用，并且在需要定位影片片段的时间敏感任务中也会导致表现不佳。在本文中，我们专注于影片文字二重唱互动方式。这种互动方式的特点是影片持续播放，使用者和模型都可以随时在影片播放期间插入他们的文字讯息。当文字讯息结束时，影片继续播放，类似于二重唱中两位表演者的交替。我们构建了 MMDuetIT，这是一个影片文字训练数据集，旨在让 VideoLLM 适应影片文字二重唱互动方式。我们还引入了多重答案基础影片问答 (MAGQA) 任务，以比较 VideoLLM 的实时回应能力。在 MMDuetIT 上训练后，MMDuet 证明采用影片文字二重唱互动方式能使模型在各种时间敏感任务中实现显著的改进（YouCook2 稠密影片字幕的 76% CIDEr、QVHighlights 重点检测的 90% mAP 和 Charades-STA 时间影片基础的 25% R@0.5），且训练工作量极小，还能让 VideoLLM 在影片播放时实时回应。代码、资料和示范可于此处取得：https://github.com/yellow-binary-tree/MMDuet。", "author": "Yueqian Wang et.al.", "authors": "Yueqian Wang, Xiaojun Meng, Yuxuan Wang, Jianxin Liang, Jiansheng Wei, Huishuai Zhang, Dongyan Zhao", "id": "2411.17991v1", "paper_url": "http://arxiv.org/abs/2411.17991v1", "repo": "https://github.com/yellow-binary-tree/mmduet"}}