{"2410.20483": {"publish_time": "2024-10-27", "title": "Improving Decision Sparsity", "paper_summary": "Sparsity is a central aspect of interpretability in machine learning.\nTypically, sparsity is measured in terms of the size of a model globally, such\nas the number of variables it uses. However, this notion of sparsity is not\nparticularly relevant for decision-making; someone subjected to a decision does\nnot care about variables that do not contribute to the decision. In this work,\nwe dramatically expand a notion of decision sparsity called the Sparse\nExplanation Value(SEV) so that its explanations are more meaningful. SEV\nconsiders movement along a hypercube towards a reference point. By allowing\nflexibility in that reference and by considering how distances along the\nhypercube translate to distances in feature space, we can derive sparser and\nmore meaningful explanations for various types of function classes. We present\ncluster-based SEV and its variant tree-based SEV, introduce a method that\nimproves credibility of explanations, and propose algorithms that optimize\ndecision sparsity in machine learning models.", "paper_summary_zh": "稀疏性是機器學習中可解釋性的核心面向。\n一般來說，稀疏性是以模型整體的大小來衡量，例如它使用的變數數量。然而，這種稀疏性概念與決策制定並無特別相關；受到決策影響的人並不在乎那些與決策無關的變數。在這項工作中，我們大幅擴展了一個稱為稀疏解釋值 (SEV) 的決策稀疏性概念，使其解釋更具意義。SEV 考量沿著超立方體朝向參考點的移動。透過允許該參考的靈活性，並考量沿著超立方體的距離如何轉換為特徵空間中的距離，我們可以針對各種函數類別推導出更稀疏且更有意義的解釋。我們提出基於叢集的 SEV 及其變體基於樹狀結構的 SEV，引入一種方法來提升解釋的可信度，並提出最佳化機器學習模型中決策稀疏性的演算法。", "author": "Yiyang Sun et.al.", "authors": "Yiyang Sun, Tong Wang, Cynthia Rudin", "id": "2410.20483v1", "paper_url": "http://arxiv.org/abs/2410.20483v1", "repo": "null"}}