{"2409.08098": {"publish_time": "2024-09-12", "title": "The CLC-UKET Dataset: Benchmarking Case Outcome Prediction for the UK Employment Tribunal", "paper_summary": "This paper explores the intersection of technological innovation and access\nto justice by developing a benchmark for predicting case outcomes in the UK\nEmployment Tribunal (UKET). To address the challenge of extensive manual\nannotation, the study employs a large language model (LLM) for automatic\nannotation, resulting in the creation of the CLC-UKET dataset. The dataset\nconsists of approximately 19,000 UKET cases and their metadata. Comprehensive\nlegal annotations cover facts, claims, precedent references, statutory\nreferences, case outcomes, reasons and jurisdiction codes. Facilitated by the\nCLC-UKET data, we examine a multi-class case outcome prediction task in the\nUKET. Human predictions are collected to establish a performance reference for\nmodel comparison. Empirical results from baseline models indicate that\nfinetuned transformer models outperform zero-shot and few-shot LLMs on the UKET\nprediction task. The performance of zero-shot LLMs can be enhanced by\nintegrating task-related information into few-shot examples. We hope that the\nCLC-UKET dataset, along with human annotations and empirical findings, can\nserve as a valuable benchmark for employment-related dispute resolution.", "paper_summary_zh": "本文探討了科技創新與司法正義的交集，方法是為英國就業法庭（UKET）的案件結果建立一個基準來預測。為了應對大量手動註解的挑戰，本研究採用大型語言模型（LLM）進行自動註解，進而建立 CLC-UKET 資料集。該資料集包含約 19,000 件英國就業法庭案件及其元資料。全面的法律註解涵蓋事實、主張、判例引用、法定引用、案件結果、理由和司法管轄代碼。在 CLC-UKET 資料的協助下，我們檢視了英國就業法庭中的多類案件結果預測任務。收集人類預測以建立模型比較效能的基準。基準模型的實證結果顯示，微調的轉換器模型在英國就業法庭預測任務上優於零次學習和少次學習的 LLM。零次學習 LLM 的效能可透過將與任務相關的資訊整合到少次學習範例中來提升。我們希望 CLC-UKET 資料集，連同人類註解和實證發現，能作為與就業相關的爭端解決的寶貴基準。", "author": "Huiyuan Xie et.al.", "authors": "Huiyuan Xie, Felix Steffek, Joana Ribeiro de Faria, Christine Carter, Jonathan Rutherford", "id": "2409.08098v1", "paper_url": "http://arxiv.org/abs/2409.08098v1", "repo": "null"}}