{"2502.00052": {"publish_time": "2025-01-28", "title": "Bridging Contrastive Learning and Domain Adaptation: Theoretical Perspective and Practical Application", "paper_summary": "This work studies the relationship between Contrastive Learning and Domain\nAdaptation from a theoretical perspective. The two standard contrastive losses,\nNT-Xent loss (Self-supervised) and Supervised Contrastive loss, are related to\nthe Class-wise Mean Maximum Discrepancy (CMMD), a dissimilarity measure widely\nused for Domain Adaptation. Our work shows that minimizing the contrastive\nlosses decreases the CMMD and simultaneously improves class-separability,\nlaying the theoretical groundwork for the use of Contrastive Learning in the\ncontext of Domain Adaptation. Due to the relevance of Domain Adaptation in\nmedical imaging, we focused the experiments on mammography images. Extensive\nexperiments on three mammography datasets - synthetic patches, clinical (real)\npatches, and clinical (real) images - show improved Domain Adaptation,\nclass-separability, and classification performance, when minimizing the\nSupervised Contrastive loss.", "paper_summary_zh": "本研究從理論角度探討對比學習與領域適應之間的關係。兩種標準對比損失，NT-Xent 損失（自我監督）和監督對比損失，與廣泛用於領域適應的差異性測量標準類別平均最大差異（CMMD）有關。我們的研究表明，最小化對比損失會降低 CMMD，同時提高類別可分離性，為在領域適應中使用對比學習奠定理論基礎。由於領域適應在醫學影像中的相關性，我們將實驗重點放在乳房攝影圖像上。在三個乳房攝影數據集（合成貼片、臨床（真實）貼片和臨床（真實）圖像）上進行的廣泛實驗表明，在最小化監督對比損失時，領域適應、類別可分離性和分類性能得到改善。", "author": "Gonzalo Iñaki Quintana et.al.", "authors": "Gonzalo Iñaki Quintana, Laurence Vancamberg, Vincent Jugnon, Agnès Desolneux, Mathilde Mougeot", "id": "2502.00052v1", "paper_url": "http://arxiv.org/abs/2502.00052v1", "repo": "null"}}