{"2409.18006": {"publish_time": "2024-09-26", "title": "Multilingual Evaluation of Long Context Retrieval and Reasoning", "paper_summary": "Recent large language models (LLMs) demonstrate impressive capabilities in\nhandling long contexts, some exhibiting near-perfect recall on synthetic\nretrieval tasks. However, these evaluations have mainly focused on English text\nand involved a single target sentence within lengthy contexts. Our work\ninvestigates how LLM performance generalizes to multilingual settings with\nmultiple hidden target sentences. We comprehensively evaluate several\nlong-context LLMs on retrieval and reasoning tasks across five languages:\nEnglish, Vietnamese, Indonesian, Swahili, and Somali. These languages share the\nLatin script but belong to distinct language families and resource levels. Our\nanalysis reveals a significant performance gap between languages. The\nbest-performing models such as Gemini-1.5 and GPT-4o, achieve around 96%\naccuracy in English to around 36% in Somali with a single target sentence.\nHowever, this accuracy drops to 40% in English and 0% in Somali when dealing\nwith three target sentences. Our findings highlight the challenges long-context\nLLMs face when processing longer contexts, an increase in the number of target\nsentences, or languages of lower resource levels.", "paper_summary_zh": "近期的大型语言模型（LLM）在处理长文本语境方面表现出了令人印象深刻的能力，有些模型在合成式检索任务中表现出近乎完美的召回率。然而，这些评估主要集中在英文文本上，并且在冗长的语境中只涉及一个目标句子。我们的研究调查了 LLM 性能如何推广到具有多个隐藏目标句子的多语言设置。我们对五种语言（英语、越南语、印度尼西亚语、斯瓦希里语和索马里语）的几个长文本语境 LLM 进行了全面的检索和推理任务评估。这些语言共享拉丁字母，但属于不同的语系和资源级别。我们的分析揭示了语言之间的显着性能差距。表现最好的模型（如 Gemini-1.5 和 GPT-4o）在英语中的准确率约为 96%，在索马里语中为 36%，只有一个目标句子。然而，在处理三个目标句子时，英语的准确率下降到 40%，索马里语下降到 0%。我们的研究结果突出了长文本语境 LLM 在处理更长的语境、目标句子的数量增加或资源级别较低的语言时面临的挑战。", "author": "Ameeta Agrawal et.al.", "authors": "Ameeta Agrawal, Andy Dang, Sina Bagheri Nezhad, Rhitabrat Pokharel, Russell Scheinberg", "id": "2409.18006v1", "paper_url": "http://arxiv.org/abs/2409.18006v1", "repo": "null"}}