{"2407.08521": {"publish_time": "2024-07-11", "title": "Emergent Visual-Semantic Hierarchies in Image-Text Representations", "paper_summary": "While recent vision-and-language models (VLMs) like CLIP are a powerful tool\nfor analyzing text and images in a shared semantic space, they do not\nexplicitly model the hierarchical nature of the set of texts which may describe\nan image. Conversely, existing multimodal hierarchical representation learning\nmethods require costly training from scratch, failing to leverage the knowledge\nencoded by state-of-the-art multimodal foundation models. In this work, we\nstudy the knowledge of existing foundation models, finding that they exhibit\nemergent understanding of visual-semantic hierarchies despite not being\ndirectly trained for this purpose. We propose the Radial Embedding (RE)\nframework for probing and optimizing hierarchical understanding, and contribute\nthe HierarCaps dataset, a benchmark facilitating the study of hierarchical\nknowledge in image--text representations, constructed automatically via large\nlanguage models. Our results show that foundation VLMs exhibit zero-shot\nhierarchical understanding, surpassing the performance of prior models\nexplicitly designed for this purpose. Furthermore, we show that foundation\nmodels may be better aligned to hierarchical reasoning via a text-only\nfine-tuning phase, while retaining pretraining knowledge.", "paper_summary_zh": "雖然像 CLIP 等最近的視覺語言模型 (VLM) 是用於在共享語義空間中分析文字和影像的強大工具，但它們並未明確建模可能描述影像的文字集合的層級性質。相反地，現有的多模態層級表徵學習方法需要從頭開始進行昂貴的訓練，無法利用由最先進的多模態基礎模型編碼的知識。在這項工作中，我們研究了現有基礎模型的知識，發現它們表現出對視覺語義層級的理解，儘管並未直接針對此目的進行訓練。我們提出了徑向嵌入 (RE) 框架，用於探測和最佳化層級理解，並貢獻了 HierarCaps 資料集，這是一個基於大型語言模型自動建構的基準，促進了對影像文字表徵中層級知識的研究。我們的結果顯示，基礎 VLM 表現出零次學習的層級理解，超越了先前專門為此目的設計的模型的效能。此外，我們顯示基礎模型可能會透過僅文字的微調階段與層級推理更好地對齊，同時保留預訓練知識。", "author": "Morris Alper et.al.", "authors": "Morris Alper, Hadar Averbuch-Elor", "id": "2407.08521v1", "paper_url": "http://arxiv.org/abs/2407.08521v1", "repo": "null"}}