{"2406.09325": {"publish_time": "2024-06-13", "title": "REVS: Unlearning Sensitive Information in Language Models via Rank Editing in the Vocabulary Space", "paper_summary": "Large language models (LLMs) risk inadvertently memorizing and divulging\nsensitive or personally identifiable information (PII) seen in training data,\ncausing privacy concerns. Current approaches to address this issue involve\ncostly dataset scrubbing, or model filtering through unlearning and model\nediting, which can be bypassed through extraction attacks. We propose REVS, a\nnovel model editing method for unlearning sensitive information from LLMs. REVS\nidentifies and modifies a small subset of neurons relevant for each piece of\nsensitive information. By projecting these neurons to the vocabulary space\n(unembedding), we pinpoint the components driving its generation. We then\ncompute a model edit based on the pseudo-inverse of the unembedding matrix, and\napply it to de-promote generation of the targeted sensitive data. To adequately\nevaluate our method on truly sensitive information, we curate two datasets: an\nemail dataset inherently memorized by GPT-J, and a synthetic social security\nnumber dataset that we tune the model to memorize. Compared to other\nstate-of-the-art model editing methods, REVS demonstrates superior performance\nin both eliminating sensitive information and robustness to extraction attacks,\nwhile retaining integrity of the underlying model. The code and a demo notebook\nare available at https://technion-cs-nlp.github.io/REVS.", "paper_summary_zh": "大型語言模型 (LLM) 有風險會不經意地記憶和洩露在訓練資料中看到的敏感或個人可識別資訊 (PII)，造成隱私問題。目前解決此問題的方法包括代價高昂的資料集清除，或透過忘記和模型編輯來進行模型篩選，但這可能會被擷取攻擊繞過。我們提出 REVS，一種用於從 LLM 中忘記敏感資訊的新穎模型編輯方法。REVS 會識別並修改與每一段敏感資訊相關的小部分神經元。透過將這些神經元投影到詞彙空間（取消嵌入），我們可以精確找出驅動其產生的組成部分。接著，我們根據取消嵌入矩陣的偽逆來計算模型編輯，並套用它來降低目標敏感資料產生的優先順序。為了適當地評估我們的方法對真正敏感資訊的影響，我們策劃了兩個資料集：一個由 GPT-J 內建記憶的電子郵件資料集，以及一個我們調整模型以記憶的合成社會安全號碼資料集。與其他最先進的模型編輯方法相比，REVS 在消除敏感資訊和對抗擷取攻擊的強健性方面都展現出卓越的效能，同時保留基礎模型的完整性。程式碼和示範筆記本可以在 https://technion-cs-nlp.github.io/REVS 取得。", "author": "Tomer Ashuach et.al.", "authors": "Tomer Ashuach, Martin Tutek, Yonatan Belinkov", "id": "2406.09325v1", "paper_url": "http://arxiv.org/abs/2406.09325v1", "repo": "null"}}