{"2407.07684": {"publish_time": "2024-07-10", "title": "Towards Human-Like Driving: Active Inference in Autonomous Vehicle Control", "paper_summary": "This paper presents a novel approach to Autonomous Vehicle (AV) control\nthrough the application of active inference, a theory derived from neuroscience\nthat conceptualizes the brain as a predictive machine. Traditional autonomous\ndriving systems rely heavily on Modular Pipelines, Imitation Learning, or\nReinforcement Learning, each with inherent limitations in adaptability,\ngeneralization, and computational efficiency. Active inference addresses these\nchallenges by minimizing prediction error (termed \"surprise\") through a dynamic\nmodel that balances perception and action. Our method integrates active\ninference with deep learning to manage lateral control in AVs, enabling them to\nperform lane following maneuvers within a simulated urban environment. We\ndemonstrate that our model, despite its simplicity, effectively learns and\ngeneralizes from limited data without extensive retraining, significantly\nreducing computational demands. The proposed approach not only enhances the\nadaptability and performance of AVs in dynamic scenarios but also aligns\nclosely with human-like driving behavior, leveraging a generative model to\npredict and adapt to environmental changes. Results from extensive experiments\nin the CARLA simulator show promising outcomes, outperforming traditional\nmethods in terms of adaptability and efficiency, thereby advancing the\npotential of active inference in real-world autonomous driving applications.", "paper_summary_zh": "本論文提出了一種自駕車 (AV) 控制的新方法，透過主動推論的應用，主動推論是一種源自神經科學的理論，將大腦概念化為一個預測機器。傳統的自動駕駛系統嚴重依賴模組化管線、模仿學習或強化學習，每種方法在適應性、概括性和計算效率方面都有其固有的限制。主動推論透過一個平衡感知和動作的動態模型，將預測誤差（稱為「驚喜」）最小化，來解決這些挑戰。我們的模型將主動推論與深度學習整合，以管理自駕車的橫向控制，讓它們能夠在模擬的城市環境中執行車道追蹤操作。我們證明了我們的模型儘管很簡單，但能有效學習和概括有限的資料，而無需廣泛的重新訓練，大幅減少了計算需求。所提出的方法不僅增強了自駕車在動態場景中的適應性和效能，而且與類人駕駛行為緊密結合，利用生成模型來預測和適應環境變化。在 CARLA 模擬器中進行的廣泛實驗結果顯示了有希望的結果，在適應性和效率方面優於傳統方法，從而提升了主動推論在實際自駕車應用中的潛力。", "author": "Elahe Delavari et.al.", "authors": "Elahe Delavari, John Moore, Junho Hong, Jaerock Kwon", "id": "2407.07684v1", "paper_url": "http://arxiv.org/abs/2407.07684v1", "repo": "null"}}