{"2408.02193": {"publish_time": "2024-08-05", "title": "CodeACT: Code Adaptive Compute-efficient Tuning Framework for Code LLMs", "paper_summary": "Large language models (LLMs) have shown great potential in code-related\ntasks, yet open-source models lag behind their closed-source counterparts. To\nbridge this performance gap, existing methods generate vast amounts of\nsynthetic data for fine-tuning, leading to inefficiencies in training.\nMotivated by the need for more effective and efficient training, we propose the\nCode Adaptive Compute-efficient Tuning (CodeACT) framework. CodeACT introduces\nthe Complexity and Diversity Aware Sampling (CDAS) method to select\nhigh-quality training data based on complexity and diversity, and the Dynamic\nPack padding strategy to reduce computational resource usage by minimizing\npadding tokens during training. Experimental results demonstrate that\nCodeACT-DeepSeek-Coder-6.7B, fine-tuned on only 40% of the EVOL-Instruct data,\nachieves an 8.6% performance increase on HumanEval, reduces training time by\n78%, and decreases peak GPU memory usage by 27%. These findings underscore\nCodeACT's ability to enhance the performance and efficiency of open-source\nmodels. By optimizing both the data selection and training processes, CodeACT\noffers a comprehensive approach to improving the capabilities of open-source\nLLMs while significantly reducing computational requirements, addressing the\ndual challenges of data quality and training efficiency, and paving the way for\nmore resource-efficient and performant models.", "paper_summary_zh": "大型語言模型 (LLM) 在與程式碼相關的任務中展現了極大的潛力，然而開放原始碼模型卻落後於閉源模型。為了彌補這種效能差距，現有的方法會產生大量的合成資料進行微調，導致訓練效率不彰。由於需要更有效率的訓練，我們提出了 Code Adaptive Compute-efficient Tuning (CodeACT) 架構。CodeACT 引入了「複雜度和多樣性感知取樣」(CDAS) 方法，根據複雜度和多樣性來挑選高品質的訓練資料，以及「動態封包填充」策略，透過在訓練期間將填充符號減到最少，以降低運算資源使用量。實驗結果顯示，在僅使用 40% 的 EVOL-Instruct 資料進行微調後，CodeACT-DeepSeek-Coder-6.7B 在 HumanEval 上的效能提升了 8.6%，訓練時間減少了 78%，而且 GPU 記憶體使用量減少了 27%。這些發現凸顯了 CodeACT 提升開放原始碼模型效能和效率的能力。透過最佳化資料選擇和訓練流程，CodeACT 提供了一種全面性的方法來提升開放原始碼 LLM 的功能，同時大幅降低運算需求，解決資料品質和訓練效率的雙重挑戰，並為更省資源且效能更高的模型鋪路。", "author": "Weijie Lv et.al.", "authors": "Weijie Lv, Xuan Xia, Sheng-Jun Huang", "id": "2408.02193v1", "paper_url": "http://arxiv.org/abs/2408.02193v1", "repo": "null"}}