{"2412.14137": {"publish_time": "2024-12-18", "title": "Design choices made by LLM-based test generators prevent them from finding bugs", "paper_summary": "There is an increasing amount of research and commercial tools for automated\ntest case generation using Large Language Models (LLMs). This paper critically\nexamines whether recent LLM-based test generation tools, such as Codium\nCoverAgent and CoverUp, can effectively find bugs or unintentionally validate\nfaulty code. Considering bugs are only exposed by failing test cases, we\nexplore the question: can these tools truly achieve the intended objectives of\nsoftware testing when their test oracles are designed to pass? Using real\nhuman-written buggy code as input, we evaluate these tools, showing how\nLLM-generated tests can fail to detect bugs and, more alarmingly, how their\ndesign can worsen the situation by validating bugs in the generated test suite\nand rejecting bug-revealing tests. These findings raise important questions\nabout the validity of the design behind LLM-based test generation tools and\ntheir impact on software quality and test suite reliability.", "paper_summary_zh": "隨著大型語言模型 (LLM) 的出現，用於自動化測試案例生成的相關研究和商用工具越來越多。本文批判性地探討了基於 LLM 的最新測試生成工具（例如 Codium CoverAgent 和 CoverUp）是否能有效找出錯誤或無意中驗證有缺陷的程式碼。由於錯誤僅會因測試案例失敗而暴露出來，我們探討以下問題：當這些工具的測試預言被設計為通過時，它們是否真能達成軟體測試的預期目標？我們使用真實的人工編寫的錯誤程式碼作為輸入，評估這些工具，說明 LLM 生成的測試如何無法偵測錯誤，更令人擔憂的是，它們的設計如何透過在產生的測試套件中驗證錯誤並拒絕揭露錯誤的測試，使情況惡化。這些發現對基於 LLM 的測試生成工具背後的設計有效性提出了重要的問題，並影響軟體品質和測試套件的可靠性。", "author": "Noble Saji Mathews et.al.", "authors": "Noble Saji Mathews, Meiyappan Nagappan", "id": "2412.14137v1", "paper_url": "http://arxiv.org/abs/2412.14137v1", "repo": "null"}}