{"2409.11258": {"publish_time": "2024-09-17", "title": "Attacking Slicing Network via Side-channel Reinforcement Learning Attack", "paper_summary": "Network slicing in 5G and the future 6G networks will enable the creation of\nmultiple virtualized networks on a shared physical infrastructure. This\ninnovative approach enables the provision of tailored networks to accommodate\nspecific business types or industry users, thus delivering more customized and\nefficient services. However, the shared memory and cache in network slicing\nintroduce security vulnerabilities that have yet to be fully addressed. In this\npaper, we introduce a reinforcement learning-based side-channel cache attack\nframework specifically designed for network slicing environments. Unlike\ntraditional cache attack methods, our framework leverages reinforcement\nlearning to dynamically identify and exploit cache locations storing sensitive\ninformation, such as authentication keys and user registration data. We assume\nthat one slice network is compromised and demonstrate how the attacker can\ninduce another shared slice to send registration requests, thereby estimating\nthe cache locations of critical data. By formulating the cache timing channel\nattack as a reinforcement learning-driven guessing game between the attack\nslice and the victim slice, our model efficiently explores possible actions to\npinpoint memory blocks containing sensitive information. Experimental results\nshowcase the superiority of our approach, achieving a success rate of\napproximately 95\\% to 98\\% in accurately identifying the storage locations of\nsensitive data. This high level of accuracy underscores the potential risks in\nshared network slicing environments and highlights the need for robust security\nmeasures to safeguard against such advanced side-channel attacks.", "paper_summary_zh": "5G 和未来的 6G 网络中的网络切片将能够在共享的物理基础设施上创建多个虚拟化网络。这种创新方法能够提供定制化网络，以适应特定的业务类型或行业用户，从而提供更多定制化和高效的服务。然而，网络切片中的共享内存和缓存引入了尚未得到充分解决的安全漏洞。在本文中，我们引入了一个基于强化学习的旁路缓存攻击框架，该框架专门设计用于网络切片环境。与传统的缓存攻击方法不同，我们的框架利用强化学习来动态识别和利用存储敏感信息的缓存位置，例如身份验证密钥和用户注册数据。我们假设一个切片网络遭到破坏，并演示攻击者如何诱使另一个共享切片发送注册请求，从而估计关键数据的缓存位置。通过将缓存时序信道攻击表述为攻击切片和受害切片之间的强化学习驱动的猜谜游戏，我们的模型有效地探索了可能的动作，以精确定位包含敏感信息的内存块。实验结果展示了我们方法的优越性，在准确识别敏感数据的存储位置方面实现了大约 95% 到 98% 的成功率。这种高准确性强调了共享网络切片环境中的潜在风险，并凸显了对稳健的安全措施的需求，以防范此类高级旁路攻击。", "author": "Wei Shao et.al.", "authors": "Wei Shao, Chandra Thapa, Rayne Holland, Sarah Ali Siddiqui, Seyit Camtepe", "id": "2409.11258v1", "paper_url": "http://arxiv.org/abs/2409.11258v1", "repo": "null"}}