{"2502.12131": {"publish_time": "2025-02-17", "title": "Transformer Dynamics: A neuroscientific approach to interpretability of large language models", "paper_summary": "As artificial intelligence models have exploded in scale and capability,\nunderstanding of their internal mechanisms remains a critical challenge.\nInspired by the success of dynamical systems approaches in neuroscience, here\nwe propose a novel framework for studying computations in deep learning\nsystems. We focus on the residual stream (RS) in transformer models,\nconceptualizing it as a dynamical system evolving across layers. We find that\nactivations of individual RS units exhibit strong continuity across layers,\ndespite the RS being a non-privileged basis. Activations in the RS accelerate\nand grow denser over layers, while individual units trace unstable periodic\norbits. In reduced-dimensional spaces, the RS follows a curved trajectory with\nattractor-like dynamics in the lower layers. These insights bridge dynamical\nsystems theory and mechanistic interpretability, establishing a foundation for\na \"neuroscience of AI\" that combines theoretical rigor with large-scale data\nanalysis to advance our understanding of modern neural networks.", "paper_summary_zh": "隨著人工智慧模型在規模和能力上爆炸式增長，\n理解其內部機制仍然是一項嚴峻的挑戰。\n受到神經科學中動力系統方法成功的啟發，我們在此\n提出了一個新的框架來研究深度學習系統中的運算。我們專注於Transformer模型中的殘差流 (RS)，\n將其概念化為一個跨層演化的動態系統。我們發現\n儘管 RS 不是一個特權基礎，但個別 RS 單元的激活在各層之間表現出很強的連續性。RS 中的激活\n隨著層數的增加而加速並變得更密集，而個別單元則追蹤不穩定的週期\n軌道。在降維空間中，RS 遵循一個曲線軌跡，在較低層中具有類吸引子的動力學。這些見解橋接了動力\n系統理論和機制可解釋性，為「AI 神經科學」奠定了基礎，結合了理論嚴謹性和大規模數據\n分析，以增進我們對現代神經網路的理解。", "author": "Jesseba Fernando et.al.", "authors": "Jesseba Fernando, Grigori Guitchounts", "id": "2502.12131v1", "paper_url": "http://arxiv.org/abs/2502.12131v1", "repo": "null"}}