{"2406.19807": {"publish_time": "2024-06-28", "title": "Deceptive Diffusion: Generating Synthetic Adversarial Examples", "paper_summary": "We introduce the concept of deceptive diffusion -- training a generative AI\nmodel to produce adversarial images. Whereas a traditional adversarial attack\nalgorithm aims to perturb an existing image to induce a misclassificaton, the\ndeceptive diffusion model can create an arbitrary number of new, misclassified\nimages that are not directly associated with training or test images. Deceptive\ndiffusion offers the possibility of strengthening defence algorithms by\nproviding adversarial training data at scale, including types of\nmisclassification that are otherwise difficult to find. In our experiments, we\nalso investigate the effect of training on a partially attacked data set. This\nhighlights a new type of vulnerability for generative diffusion models: if an\nattacker is able to stealthily poison a portion of the training data, then the\nresulting diffusion model will generate a similar proportion of misleading\noutputs.", "paper_summary_zh": "我們引入了欺騙性擴散的概念 -- 訓練生成式 AI 模型來產生對抗性影像。傳統的對抗性攻擊演算法旨在擾動現有影像以誘發錯誤分類，而欺騙性擴散模型可以產生任意數量的全新、錯誤分類的影像，這些影像與訓練或測試影像沒有直接關聯。欺騙性擴散提供了透過大規模提供對抗性訓練資料來強化防禦演算法的可能性，包括其他難以找到的錯誤分類類型。在我們的實驗中，我們也研究了在部分受攻擊資料集上訓練的效果。這突顯了生成式擴散模型的一種類型新漏洞：如果攻擊者能夠秘密毒害訓練資料的一部分，則產生的擴散模型將產生類似比例的誤導輸出。", "author": "Lucas Beerens et.al.", "authors": "Lucas Beerens, Catherine F. Higham, Desmond J. Higham", "id": "2406.19807v1", "paper_url": "http://arxiv.org/abs/2406.19807v1", "repo": "null"}}