{"2411.02886": {"publish_time": "2024-11-05", "title": "TokenSelect: Efficient Long-Context Inference and Length Extrapolation for LLMs via Dynamic Token-Level KV Cache Selection", "paper_summary": "With the development of large language models (LLMs), the ability to handle\nlonger contexts has become a key capability for Web applications such as\ncross-document understanding and LLM-powered search systems. However, this\nprogress faces two major challenges: performance degradation due to sequence\nlengths out-of-distribution, and excessively long inference times caused by the\nquadratic computational complexity of attention. These issues hinder the\napplication of LLMs in long-context scenarios. In this paper, we propose\nDynamic Token-Level KV Cache Selection (TokenSelect), a model-agnostic,\ntraining-free method for efficient and accurate long-context inference.\nTokenSelect builds upon the observation of non-contiguous attention sparsity,\nusing Query-Key dot products to measure per-head KV Cache criticality at\ntoken-level. By per-head soft voting mechanism, TokenSelect selectively\ninvolves a small number of critical KV cache tokens in the attention\ncalculation without sacrificing accuracy. To further accelerate TokenSelect, we\ndesigned the Selection Cache based on observations of consecutive Query\nsimilarity and implemented efficient dot product kernel, significantly reducing\nthe overhead of token selection. A comprehensive evaluation of TokenSelect\ndemonstrates up to 23.84x speedup in attention computation and up to 2.28x\nacceleration in end-to-end latency, while providing superior performance\ncompared to state-of-the-art long-context inference methods.", "paper_summary_zh": "隨著大型語言模型（LLM）的發展，處理較長背景的能力已成為網路應用程式的關鍵功能，例如跨文件理解和 LLM 驅動的搜尋系統。然而，這個進展面臨兩個主要挑戰：由於序列長度超出分佈而導致效能下降，以及注意力二次運算複雜度造成的過長推論時間。這些問題阻礙了 LLM 在長背景場景中的應用。在本文中，我們提出動態 Token 層級 KV 快取選擇（TokenSelect），一種與模型無關、無需訓練的方法，用於有效且準確的長背景推論。TokenSelect 建立在非連續注意力稀疏性的觀察之上，使用查詢鍵點積測量每個頭部 KV 快取在 Token 層級的重要性。透過每個頭部的軟性投票機制，TokenSelect 選擇性地將少量關鍵 KV 快取 Token 納入注意力計算中，同時不犧牲準確性。為了進一步加速 TokenSelect，我們根據連續查詢相似性的觀察設計了選擇快取，並實作了有效的點積核，大幅減少 Token 選擇的開銷。對 TokenSelect 的全面評估顯示，注意力運算速度提升了 23.84 倍，端到端延遲加速了 2.28 倍，同時與最先進的長背景推論方法相比，提供了卓越的效能。", "author": "Wei Wu et.al.", "authors": "Wei Wu, Zhuoshi Pan, Chao Wang, Liyi Chen, Yunchu Bai, Kun Fu, Zheng Wang, Hui Xiong", "id": "2411.02886v1", "paper_url": "http://arxiv.org/abs/2411.02886v1", "repo": "null"}}