{"2409.03295": {"publish_time": "2024-09-05", "title": "N-gram Prediction and Word Difference Representations for Language Modeling", "paper_summary": "Causal language modeling (CLM) serves as the foundational framework\nunderpinning remarkable successes of recent large language models (LLMs).\nDespite its success, the training approach for next word prediction poses a\npotential risk of causing the model to overly focus on local dependencies\nwithin a sentence. While prior studies have been introduced to predict future N\nwords simultaneously, they were primarily applied to tasks such as masked\nlanguage modeling (MLM) and neural machine translation (NMT). In this study, we\nintroduce a simple N-gram prediction framework for the CLM task. Moreover, we\nintroduce word difference representation (WDR) as a surrogate and\ncontextualized target representation during model training on the basis of\nN-gram prediction framework. To further enhance the quality of next word\nprediction, we propose an ensemble method that incorporates the future N words'\nprediction results. Empirical evaluations across multiple benchmark datasets\nencompassing CLM and NMT tasks demonstrate the significant advantages of our\nproposed methods over the conventional CLM.", "paper_summary_zh": "因果語言模型 (CLM) 構成了支撐近期大型語言模型 (LLM) 顯著成功之基礎架構。\n儘管獲得成功，但下一個字詞預測的訓練方法存在潛在風險，可能會導致模型過度專注於句子內的局部依賴性。雖然先前研究已引入同時預測未來 N 個字詞，但主要應用於遮罩語言模型 (MLM) 和神經機器翻譯 (NMT) 等任務。在本研究中，我們為 CLM 任務引入了簡單的 N-gram 預測架構。此外，我們在基於 N-gram 預測架構的模型訓練期間，引入了字詞差異表徵 (WDR) 作為替代和脈絡化的目標表徵。為了進一步提升下一個字詞預測的品質，我們提出了一種整體方法，該方法納入了未來 N 個字詞的預測結果。跨越涵蓋 CLM 和 NMT 任務的多個基準資料集的經驗評估，證明了我們提出的方法相較於傳統 CLM 的顯著優勢。", "author": "DongNyeong Heo et.al.", "authors": "DongNyeong Heo, Daniela Noemi Rim, Heeyoul Choi", "id": "2409.03295v1", "paper_url": "http://arxiv.org/abs/2409.03295v1", "repo": "null"}}