{"2407.16939": {"publish_time": "2024-07-24", "title": "Early screening of potential breakthrough technologies with enhanced interpretability: A patent-specific hierarchical attention network model", "paper_summary": "Despite the usefulness of machine learning approaches for the early screening\nof potential breakthrough technologies, their practicality is often hindered by\nopaque models. To address this, we propose an interpretable machine learning\napproach to predicting future citation counts from patent texts using a\npatent-specific hierarchical attention network (PatentHAN) model. Central to\nthis approach are (1) a patent-specific pre-trained language model, capturing\nthe meanings of technical words in patent claims, (2) a hierarchical network\nstructure, enabling detailed analysis at the claim level, and (3) a claim-wise\nself-attention mechanism, revealing pivotal claims during the screening\nprocess. A case study of 35,376 pharmaceutical patents demonstrates the\neffectiveness of our approach in early screening of potential breakthrough\ntechnologies while ensuring interpretability. Furthermore, we conduct\nadditional analyses using different language models and claim types to examine\nthe robustness of the approach. It is expected that the proposed approach will\nenhance expert-machine collaboration in identifying breakthrough technologies,\nproviding new insight derived from text mining into technological value.", "paper_summary_zh": "儘管機器學習方法對於潛在突破性技術的早期篩選很有用，但它們的實用性常常受到不透明模型的阻礙。為了解決這個問題，我們提出了一個可解釋的機器學習方法，使用專利特定分層注意力網路 (PatentHAN) 模型，根據專利文字預測未來的引文次數。這種方法的核心是 (1) 一個專利特定的預訓練語言模型，捕捉專利權利要求中技術詞彙的含義，(2) 一個分層網路結構，可以在權利要求層級進行詳細分析，以及 (3) 一個基於權利要求的自注意力機制，在篩選過程中揭示關鍵的權利要求。對 35,376 項製藥專利的案例研究證明了我們的方法在潛在突破性技術的早期篩選中的有效性，同時確保了可解釋性。此外，我們使用不同的語言模型和權利要求類型進行了額外的分析，以檢查該方法的穩健性。預計所提出的方法將增強專家機器在識別突破性技術方面的合作，從文字探勘中提供對技術價值的新見解。", "author": "Jaewoong Choi et.al.", "authors": "Jaewoong Choi, Janghyeok Yoon, Changyong Lee", "id": "2407.16939v1", "paper_url": "http://arxiv.org/abs/2407.16939v1", "repo": "null"}}