{"2409.16143": {"publish_time": "2024-09-24", "title": "Seeing Faces in Things: A Model and Dataset for Pareidolia", "paper_summary": "The human visual system is well-tuned to detect faces of all shapes and\nsizes. While this brings obvious survival advantages, such as a better chance\nof spotting unknown predators in the bush, it also leads to spurious face\ndetections. ``Face pareidolia'' describes the perception of face-like structure\namong otherwise random stimuli: seeing faces in coffee stains or clouds in the\nsky. In this paper, we study face pareidolia from a computer vision\nperspective. We present an image dataset of ``Faces in Things'', consisting of\nfive thousand web images with human-annotated pareidolic faces. Using this\ndataset, we examine the extent to which a state-of-the-art human face detector\nexhibits pareidolia, and find a significant behavioral gap between humans and\nmachines. We find that the evolutionary need for humans to detect animal faces,\nas well as human faces, may explain some of this gap. Finally, we propose a\nsimple statistical model of pareidolia in images. Through studies on human\nsubjects and our pareidolic face detectors we confirm a key prediction of our\nmodel regarding what image conditions are most likely to induce pareidolia.\nDataset and Website: https://aka.ms/faces-in-things", "paper_summary_zh": "人類的視覺系統非常擅長偵測各種形狀和大小的臉孔。儘管這帶來顯而易見的生存優勢，例如在叢林中發現未知掠食者的機會更大，但也導致錯誤的臉孔偵測。**臉部錯視**描述在其他隨機刺激中感知到類似臉孔的結構：在咖啡漬或天空中的雲朵中看到臉孔。在本文中，我們從電腦視覺的角度研究臉部錯視。我們提供一個**事物中的臉孔**影像資料集，其中包含五千張標註有類似人類臉孔的網路圖片。使用這個資料集，我們檢視最先進的人臉偵測器展現臉部錯視的程度，並發現人類和機器之間有顯著的行為差異。我們發現人類在演化上需要偵測動物臉孔和人類臉孔，這可能是造成此差異的部分原因。最後，我們提出一個簡單的影像錯視統計模型。透過對人類受試者和我們的類似臉孔偵測器進行研究，我們確認了我們的模型關於最可能誘發錯視的影像條件的重要預測。資料集和網站：https://aka.ms/faces-in-things", "author": "Mark Hamilton et.al.", "authors": "Mark Hamilton, Simon Stent, Vasha DuTell, Anne Harrington, Jennifer Corbett, Ruth Rosenholtz, William T. Freeman", "id": "2409.16143v1", "paper_url": "http://arxiv.org/abs/2409.16143v1", "repo": "null"}}