{"2405.08502": {"publish_time": "2024-05-14", "title": "Archimedes-AUEB at SemEval-2024 Task 5: LLM explains Civil Procedure", "paper_summary": "The SemEval task on Argument Reasoning in Civil Procedure is challenging in\nthat it requires understanding legal concepts and inferring complex arguments.\nCurrently, most Large Language Models (LLM) excelling in the legal realm are\nprincipally purposed for classification tasks, hence their reasoning rationale\nis subject to contention. The approach we advocate involves using a powerful\nteacher-LLM (ChatGPT) to extend the training dataset with explanations and\ngenerate synthetic data. The resulting data are then leveraged to fine-tune a\nsmall student-LLM. Contrary to previous work, our explanations are not directly\nderived from the teacher's internal knowledge. Instead they are grounded in\nauthentic human analyses, therefore delivering a superior reasoning signal.\nAdditionally, a new `mutation' method generates artificial data instances\ninspired from existing ones. We are publicly releasing the explanations as an\nextension to the original dataset, along with the synthetic dataset and the\nprompts that were used to generate both. Our system ranked 15th in the SemEval\ncompetition. It outperforms its own teacher and can produce explanations\naligned with the original human analyses, as verified by legal experts.", "paper_summary_zh": "SemEval 在民事訴訟中關於論證推理的任務具有挑戰性，因為它需要理解法律概念並推論出複雜的論點。目前，大多數在法律領域表現出色的大型語言模型 (LLM) 主要用於分類任務，因此它們的推理依據有待爭議。我們提倡的方法涉及使用強大的教師 LLM (ChatGPT) 來擴充訓練資料集，並提供解釋和生成合成資料。然後利用所得資料微調小型學生 LLM。與先前的研究相反，我們的解釋並非直接來自教師的內部知識。相反，它們基於真實的人類分析，因此提供了優越的推理信號。此外，新的「變異」方法會從現有的方法中生成人工資料實例。我們公開發布解釋作為原始資料集的延伸，連同合成資料集和用於產生兩者的提示。我們的系統在 SemEval 競賽中排名第 15 位。它優於自己的老師，並且可以產生與原始人類分析一致的解釋，經法律專家驗證。", "author": "Odysseas S. Chlapanis et.al.", "authors": "Odysseas S. Chlapanis, Ion Androutsopoulos, Dimitrios Galanis", "id": "2405.08502v1", "paper_url": "http://arxiv.org/abs/2405.08502v1", "repo": "null"}}