{"2501.08869": {"publish_time": "2025-01-15", "title": "Silent Abandonment in Text-Based Contact Centers: Identifying, Quantifying, and Mitigating its Operational Impacts", "paper_summary": "In the quest to improve services, companies offer customers the option to\ninteract with agents via texting. Such contact centers face unique challenges\ncompared to traditional call centers, as measuring customer experience proxies\nlike abandonment and patience involves uncertainty. A key source of this\nuncertainty is silent abandonment, where customers leave without notifying the\nsystem, wasting agent time and leaving their status unclear. Silent abandonment\nalso obscures whether a customer was served or left. Our goals are to measure\nthe magnitude of silent abandonment and mitigate its effects. Classification\nmodels show that 3%-70% of customers across 17 companies abandon silently. In\none study, 71.3% of abandoning customers did so silently, reducing agent\nefficiency by 3.2% and system capacity by 15.3%, incurring $5,457 in annual\ncosts per agent. We develop an expectation-maximization (EM) algorithm to\nestimate customer patience under uncertainty and identify influencing\ncovariates. We find that companies should use classification models to estimate\nabandonment scope and our EM algorithm to assess patience. We suggest\nstrategies to operationally mitigate the impact of silent abandonment by\npredicting suspected silent-abandonment behavior or changing service design.\nSpecifically, we show that while allowing customers to write while waiting in\nthe queue creates a missing data challenge, it also significantly increases\npatience and reduces service time, leading to reduced abandonment and lower\nstaffing requirements.", "paper_summary_zh": "<paragraph>為了改善服務，公司提供客戶透過簡訊與客服人員互動的選項。此類聯繫中心面臨的挑戰與傳統呼叫中心不同，因為衡量客戶體驗代理，例如放棄和耐心，涉及不確定性。造成這種不確定性的關鍵來源是靜默放棄，客戶在未通知系統的情況下離開，浪費客服人員時間並讓他們的狀態不明確。靜默放棄也模糊了客戶是獲得服務還是離開。我們的目標是衡量靜默放棄的規模並減輕其影響。分類模型顯示，17 家公司的 3%-70% 的客戶會靜默放棄。在一項研究中，71.3% 放棄的客戶是靜默放棄，導致客服人員效率降低 3.2%，系統容量降低 15.3%，每年每位客服人員產生 5,457 美元的成本。我們開發了一個期望最大化 (EM) 演算法，在不確定性下估計客戶耐心並找出影響協變數。我們發現，公司應使用分類模型估計放棄範圍，並使用我們的 EM 演算法評估耐心。我們建議透過預測疑似靜默放棄行為或變更服務設計，在營運上減輕靜默放棄的影響。具體來說，我們表明，雖然允許客戶在排隊時寫訊息會造成遺失資料的挑戰，但它也會顯著提高耐心並減少服務時間，從而減少放棄並降低人員需求。</paragraph>", "author": "Antonio Castellanos et.al.", "authors": "Antonio Castellanos, Galit B. Yom-Tov, Yair Goldberg, Jaeyoung Park", "id": "2501.08869v1", "paper_url": "http://arxiv.org/abs/2501.08869v1", "repo": "null"}}