{"2408.07726": {"publish_time": "2024-08-14", "title": "Graph neural network surrogate for strategic transport planning", "paper_summary": "As the complexities of urban environments continue to grow, the modelling of\ntransportation systems become increasingly challenging. This paper explores the\napplication of advanced Graph Neural Network (GNN) architectures as surrogate\nmodels for strategic transport planning. Building upon a prior work that laid\nthe foundation with graph convolution networks (GCN), our study delves into the\ncomparative analysis of established GCN with the more expressive Graph\nAttention Network (GAT). Additionally, we propose a novel GAT variant (namely\nGATv3) to address over-smoothing issues in graph-based models. Our\ninvestigation also includes the exploration of a hybrid model combining both\nGCN and GAT architectures, aiming to investigate the performance of the\nmixture. The three models are applied to various experiments to understand\ntheir limits. We analyse hierarchical regression setups, combining\nclassification and regression tasks, and introduce fine-grained classification\nwith a proposal of a method to convert outputs to precise values. Results\nreveal the superior performance of the new GAT in classification tasks. To the\nbest of the authors' knowledge, this is the first GAT model in literature to\nachieve larger depths. Surprisingly, the fine-grained classification task\ndemonstrates the GCN's unexpected dominance with additional training data. This\nshows that synthetic data generators can increase the training data, without\noverfitting issues whilst improving model performance. In conclusion, this\nresearch advances GNN based surrogate modelling, providing insights for\nrefining GNN architectures. The findings open avenues for investigating the\npotential of the newly proposed GAT architecture and the modelling setups for\nother transportation problems.", "paper_summary_zh": "<paragraph>隨著都市環境的複雜性持續增加，運輸系統的建模變得越來越具有挑戰性。本文探討了進階圖神經網路 (GNN) 架構在策略性運輸規劃中作為代理模型的應用。建立在先前奠定圖形卷積網路 (GCN) 基礎的研究上，我們的研究深入探討了既有 GCN 與更具表現力的圖形注意力網路 (GAT) 的比較分析。此外，我們提出了一個新穎的 GAT 變體 (即 GATv3) 來解決圖形化模型中的過平滑問題。我們的研究還包括探索結合 GCN 和 GAT 架構的混合模型，旨在研究混合模型的效能。這三個模型被應用於各種實驗，以了解其限制。我們分析階層式回歸設定，結合分類和回歸任務，並透過提出將輸出轉換為精確值的方法來引入細粒度分類。結果顯示新的 GAT 在分類任務中具有優異的效能。據作者所知，這是文獻中第一個達到更大深度的 GAT 模型。令人驚訝的是，細粒度分類任務顯示出 GCN 在有額外訓練資料的情況下具有出乎意料的優勢。這表示合成資料產生器可以在沒有過擬合問題的情況下增加訓練資料，同時改善模型效能。結論而言，這項研究推動了基於 GNN 的代理建模，並為改進 GNN 架構提供了見解。這些發現為研究新提出的 GAT 架構的潛力以及其他運輸問題的建模設定打開了道路。</paragraph>", "author": "Nikita Makarov et.al.", "authors": "Nikita Makarov, Santhanakrishnan Narayanan, Constantinos Antoniou", "id": "2408.07726v1", "paper_url": "http://arxiv.org/abs/2408.07726v1", "repo": "https://github.com/nikita6187/transportplanningdataset"}}