{"2405.15525": {"publish_time": "2024-05-24", "title": "Sparse Matrix in Large Language Model Fine-tuning", "paper_summary": "LoRA and its variants have become popular parameter-efficient fine-tuning\n(PEFT) methods due to their ability to avoid excessive computational costs.\nHowever, an accuracy gap often exists between PEFT methods and full fine-tuning\n(FT), and this gap has yet to be systematically studied. In this work, we\nintroduce a method for selecting sparse sub-matrices that aim to minimize the\nperformance gap between PEFT vs. full fine-tuning (FT) while also reducing both\nfine-tuning computational cost and memory cost. Our Sparse Matrix Tuning (SMT)\nmethod begins by identifying the most significant sub-matrices in the gradient\nupdate, updating only these blocks during the fine-tuning process. In our\nexperiments, we demonstrate that SMT consistently surpasses other PEFT baseline\n(e.g. LoRA and DoRA) in fine-tuning popular large language models such as LLaMA\nacross a broad spectrum of tasks, while reducing the GPU memory footprint by\n67% compared to FT. We also examine how the performance of LoRA and DoRA tends\nto plateau and decline as the number of trainable parameters increases, in\ncontrast, our SMT method does not suffer from such issue.", "paper_summary_zh": "LoRA 及其變體已成為熱門的參數高效微調 (PEFT) 方法，因為它們能夠避免過高的計算成本。\n然而，PEFT 方法和完全微調 (FT) 之間通常存在準確性差距，而這個差距尚未經過系統性研究。在這項工作中，我們\n提出了一種選擇稀疏子矩陣的方法，旨在最小化 PEFT 與完全微調 (FT) 之間的效能差距，同時也能降低微調的計算成本和記憶體成本。我們的稀疏矩陣微調 (SMT) 方法首先識別梯度更新中最重要的子矩陣，並在微調過程中僅更新這些區塊。在我們的\n實驗中，我們證明 SMT 在微調 LLaMA 等熱門大型語言模型方面始終優於其他 PEFT 基準 (例如 LoRA 和 DoRA)，同時在各種任務中將 GPU 記憶體使用量減少了\n67%，與 FT 相比。我們還研究了 LoRA 和 DoRA 的效能如何隨著可訓練參數的增加而趨於平穩並下降，\n相反，我們的 SMT 方法並不存在這樣的問題。", "author": "Haoze He et.al.", "authors": "Haoze He, Juncheng Billy Li, Xuan Jiang, Heather Miller", "id": "2405.15525v1", "paper_url": "http://arxiv.org/abs/2405.15525v1", "repo": "null"}}