{"2407.16624": {"publish_time": "2024-07-23", "title": "Semantic Change Characterization with LLMs using Rhetorics", "paper_summary": "Languages continually evolve in response to societal events, resulting in new\nterms and shifts in meanings. These changes have significant implications for\ncomputer applications, including automatic translation and chatbots, making it\nessential to characterize them accurately. The recent development of LLMs has\nnotably advanced natural language understanding, particularly in sense\ninference and reasoning. In this paper, we investigate the potential of LLMs in\ncharacterizing three types of semantic change: dimension, relation, and\norientation. We achieve this by combining LLMs' Chain-of-Thought with\nrhetorical devices and conducting an experimental assessment of our approach\nusing newly created datasets. Our results highlight the effectiveness of LLMs\nin capturing and analyzing semantic changes, providing valuable insights to\nimprove computational linguistic applications.", "paper_summary_zh": "語言會持續隨著社會事件而演變，產生新詞彙和意義轉換。這些變化對電腦應用程式有重大的影響，包括自動翻譯和聊天機器人，因此精確地描述它們至關重要。大型語言模型 (LLM) 的最新發展顯著提升了自然語言理解，特別是在意義推論和推理方面。在本文中，我們探討了 LLM 在描述三種類型的語義變化（維度、關係和方向）方面的潛力。我們透過結合 LLM 的思考鏈、修辭裝置，並使用新建立的資料集對我們的做法進行實驗評估來達成這項任務。我們的結果突顯了 LLM 在捕捉和分析語義變化方面的效能，為改進計算語言應用程式提供了寶貴的見解。", "author": "Jader Martins Camboim de Sá et.al.", "authors": "Jader Martins Camboim de Sá, Marcos Da Silveira, Cédric Pruski", "id": "2407.16624v1", "paper_url": "http://arxiv.org/abs/2407.16624v1", "repo": "null"}}