{"2411.14869": {"publish_time": "2024-11-22", "title": "BIP3D: Bridging 2D Images and 3D Perception for Embodied Intelligence", "paper_summary": "In embodied intelligence systems, a key component is 3D perception algorithm,\nwhich enables agents to understand their surrounding environments. Previous\nalgorithms primarily rely on point cloud, which, despite offering precise\ngeometric information, still constrain perception performance due to inherent\nsparsity, noise, and data scarcity. In this work, we introduce a novel\nimage-centric 3D perception model, BIP3D, which leverages expressive image\nfeatures with explicit 3D position encoding to overcome the limitations of\npoint-centric methods. Specifically, we leverage pre-trained 2D vision\nfoundation models to enhance semantic understanding, and introduce a spatial\nenhancer module to improve spatial understanding. Together, these modules\nenable BIP3D to achieve multi-view, multi-modal feature fusion and end-to-end\n3D perception. In our experiments, BIP3D outperforms current state-of-the-art\nresults on the EmbodiedScan benchmark, achieving improvements of 5.69% in the\n3D detection task and 15.25% in the 3D visual grounding task.", "paper_summary_zh": "在具身智能系統中，一個關鍵組成部分是 3D 感知演算法，它使代理能夠理解其周圍的環境。先前的演算法主要依賴點雲，儘管提供精確的幾何資訊，但由於固有的稀疏性、雜訊和資料稀少，仍然會限制感知效能。在這項工作中，我們引入了一個新的以影像為中心的 3D 感知模型 BIP3D，它利用具有明確 3D 位置編碼的表達性影像特徵來克服以點為中心的限制方法。具體來說，我們利用預先訓練的 2D 視覺基礎模型來增強語意理解，並引入一個空間增強器模組來改善空間理解。這些模組共同使 BIP3D 能夠實現多視圖、多模式特徵融合和端到端的 3D 感知。在我們的實驗中，BIP3D 在 EmbodiedScan 基準上優於目前的最新結果，在 3D 偵測任務中改進了 5.69%，在 3D 視覺基礎任務中改進了 15.25%。", "author": "Xuewu Lin et.al.", "authors": "Xuewu Lin, Tianwei Lin, Lichao Huang, Hongyu Xie, Zhizhong Su", "id": "2411.14869v1", "paper_url": "http://arxiv.org/abs/2411.14869v1", "repo": "null"}}