{"2412.09237": {"publish_time": "2024-12-12", "title": "LMAgent: A Large-scale Multimodal Agents Society for Multi-user Simulation", "paper_summary": "The believable simulation of multi-user behavior is crucial for understanding\ncomplex social systems. Recently, large language models (LLMs)-based AI agents\nhave made significant progress, enabling them to achieve human-like\nintelligence across various tasks. However, real human societies are often\ndynamic and complex, involving numerous individuals engaging in multimodal\ninteractions. In this paper, taking e-commerce scenarios as an example, we\npresent LMAgent, a very large-scale and multimodal agents society based on\nmultimodal LLMs. In LMAgent, besides freely chatting with friends, the agents\ncan autonomously browse, purchase, and review products, even perform live\nstreaming e-commerce. To simulate this complex system, we introduce a\nself-consistency prompting mechanism to augment agents' multimodal\ncapabilities, resulting in significantly improved decision-making performance\nover the existing multi-agent system. Moreover, we propose a fast memory\nmechanism combined with the small-world model to enhance system efficiency,\nwhich supports more than 10,000 agent simulations in a society. Experiments on\nagents' behavior show that these agents achieve comparable performance to\nhumans in behavioral indicators. Furthermore, compared with the existing\nLLMs-based multi-agent system, more different and valuable phenomena are\nexhibited, such as herd behavior, which demonstrates the potential of LMAgent\nin credible large-scale social behavior simulations.", "paper_summary_zh": "多用戶行為的可信模擬對於理解複雜的社會系統至關重要。最近，大型語言模型 (LLM) 為基礎的人工智慧代理已取得顯著進展，讓它們能夠在各種任務中實現類人智慧。然而，真實的人類社會通常是動態且複雜的，涉及許多從事多模態互動的個人。在本文中，我們以電子商務場景為例，展示了 LMAgent，一個基於多模態 LLM 的非常大規模且多模態的代理社會。在 LMAgent 中，除了可以自由地與朋友聊天之外，代理還可以自主瀏覽、購買和評論產品，甚至進行直播電子商務。為了模擬這個複雜的系統，我們引入了一種自洽提示機制來擴充代理的多模態能力，從而顯著改善了現有多代理系統的決策制定性能。此外，我們提出了一種結合小世界模型的快速記憶機制來提高系統效率，這支持在一個社會中模擬 10,000 多個代理。代理行為的實驗表明，這些代理在行為指標上達到了與人類相當的表現。此外，與現有的基於 LLM 的多代理系統相比，展示了更多不同且有價值的現象，例如從眾行為，這證明了 LMAgent 在可信的大規模社會行為模擬中的潛力。", "author": "Yijun Liu et.al.", "authors": "Yijun Liu, Wu Liu, Xiaoyan Gu, Yong Rui, Xiaodong He, Yongdong Zhang", "id": "2412.09237v1", "paper_url": "http://arxiv.org/abs/2412.09237v1", "repo": "null"}}