{"2407.15343": {"publish_time": "2024-07-22", "title": "Improving Minimum Bayes Risk Decoding with Multi-Prompt", "paper_summary": "While instruction fine-tuned LLMs are effective text generators, sensitivity\nto prompt construction makes performance unstable and sub-optimal in practice.\nRelying on a single \"best\" prompt cannot capture all differing approaches to a\ngeneration problem. Using this observation, we propose multi-prompt decoding,\nwhere many candidate generations are decoded from a prompt bank at\ninference-time. To ensemble candidates, we use Minimum Bayes Risk (MBR)\ndecoding, which selects a final output using a trained value metric. We show\nmulti-prompt improves MBR across a comprehensive set of conditional generation\ntasks, and show this is a result of estimating a more diverse and higher\nquality candidate space than that of a single prompt. Further experiments\nconfirm multi-prompt improves generation across tasks, models and metrics.", "paper_summary_zh": "雖然經過微調的 LLM 是有效的文字生成器，但對提示結構的敏感性會導致效能不穩定且在實務上低於最佳狀態。依賴單一的「最佳」提示無法涵蓋所有不同的生成問題方法。利用此觀察結果，我們提出多提示解碼，其中在推論時間從提示庫解碼出許多候選生成。為了組合候選項，我們使用最小貝氏風險 (MBR) 解碼，它使用訓練後的數值指標來選擇最終輸出。我們展示多提示在全面的條件生成任務中改善 MBR，並展示這是估計比單一提示更為多樣且品質更高的候選空間的結果。進一步的實驗確認多提示改善了不同任務、模型和指標的生成。", "author": "David Heineman et.al.", "authors": "David Heineman, Yao Dou, Wei Xu", "id": "2407.15343v1", "paper_url": "http://arxiv.org/abs/2407.15343v1", "repo": "null"}}