{"2407.02055": {"publish_time": "2024-07-02", "title": "Abstract Dialectical Frameworks are Boolean Networks (full version)", "paper_summary": "Dialectical frameworks are a unifying model of formal argumentation, where\nargumentative relations between arguments are represented by assigning\nacceptance conditions to atomic arguments. Their generality allow them to cover\na number of different approaches with varying forms of representing the\nargumentation structure. Boolean regulatory networks are used to model the\ndynamics of complex biological processes, taking into account the interactions\nof biological compounds, such as proteins or genes. These models have proven\nhighly useful for comprehending such biological processes, allowing to\nreproduce known behaviour and testing new hypotheses and predictions in silico,\nfor example in the context of new medical treatments. While both these\napproaches stem from entirely different communities, it turns out that there\nare striking similarities in their appearence. In this paper, we study the\nrelation between these two formalisms revealing their communalities as well as\ntheir differences, and introducing a correspondence that allows to establish\nnovel results for the individual formalisms.", "paper_summary_zh": "辯證框架是形式論證的統一模型，其中論證之間的論證關係是透過指派接受條件給原子論證來表示。它們的普遍性允許它們涵蓋許多不同的方法，並以不同的形式表示論證結構。布林法規網路用於模擬複雜生物過程的動態，考量生物化合物（例如蛋白質或基因）的交互作用。這些模型已被證明對於理解此類生物過程非常有用，允許複製已知的行為並在電腦模擬中測試新的假設和預測，例如在新的醫療治療的背景下。儘管這兩種方法完全來自不同的社群，但事實證明它們的外觀有驚人的相似性。在本文中，我們研究這兩種形式主義之間的關係，揭示它們的共性以及它們的差異，並引入一種對應關係，允許為個別形式主義建立新的結果。", "author": "Jesse Heyninck et.al.", "authors": "Jesse Heyninck, Matthias Knorr, João Leite", "id": "2407.02055v1", "paper_url": "http://arxiv.org/abs/2407.02055v1", "repo": "null"}}