{"2411.01978": {"publish_time": "2024-11-04", "title": "Understanding Variational Autoencoders with Intrinsic Dimension and Information Imbalance", "paper_summary": "This work presents an analysis of the hidden representations of Variational\nAutoencoders (VAEs) using the Intrinsic Dimension (ID) and the Information\nImbalance (II). We show that VAEs undergo a transition in behaviour once the\nbottleneck size is larger than the ID of the data, manifesting in a double\nhunchback ID profile and a qualitative shift in information processing as\ncaptured by the II. Our results also highlight two distinct training phases for\narchitectures with sufficiently large bottleneck sizes, consisting of a rapid\nfit and a slower generalisation, as assessed by a differentiated behaviour of\nID, II, and KL loss. These insights demonstrate that II and ID could be\nvaluable tools for aiding architecture search, for diagnosing underfitting in\nVAEs, and, more broadly, they contribute to advancing a unified understanding\nof deep generative models through geometric analysis.", "paper_summary_zh": "本研究使用内在维度 (ID) 和信息不平衡 (II) 分析变分自动编码器 (VAE) 的隐藏表征。我们表明，一旦瓶颈大小大于数据的 ID，VAE 的行为就会发生转变，表现为双驼峰 ID 轮廓和 II 捕获的信息处理的质变。我们的结果还强调了具有足够大瓶颈大小的架构的两个不同的训练阶段，包括快速拟合和较慢泛化，如 ID、II 和 KL 损失的不同行为所评估的那样。这些见解表明，II 和 ID 可能是辅助架构搜索、诊断 VAE 中的欠拟合的宝贵工具，而且更广泛地说，它们有助于通过几何分析促进对深度生成模型的统一理解。", "author": "Charles Camboulin et.al.", "authors": "Charles Camboulin, Diego Doimo, Aldo Glielmo", "id": "2411.01978v1", "paper_url": "http://arxiv.org/abs/2411.01978v1", "repo": "https://github.com/bancaditalia/understanding-variational-autoencoders-with-intrinsic-dimension-and-information-imbalance"}}