{"2501.10062": {"publish_time": "2025-01-17", "title": "OMoE: Diversifying Mixture of Low-Rank Adaptation by Orthogonal Finetuning", "paper_summary": "Building mixture-of-experts (MoE) architecture for Low-rank adaptation (LoRA)\nis emerging as a potential direction in parameter-efficient fine-tuning (PEFT)\nfor its modular design and remarkable performance. However, simply stacking the\nnumber of experts cannot guarantee significant improvement. In this work, we\nfirst conduct qualitative analysis to indicate that experts collapse to similar\nrepresentations in vanilla MoE, limiting the capacity of modular design and\ncomputational efficiency. Ulteriorly, Our analysis reveals that the performance\nof previous MoE variants maybe limited by a lack of diversity among experts.\nMotivated by these findings, we propose Orthogonal Mixture-of-Experts (OMoE), a\nresource-efficient MoE variant that trains experts in an orthogonal manner to\npromote diversity. In OMoE, a Gram-Schmidt process is leveraged to enforce that\nthe experts' representations lie within the Stiefel manifold. By applying\northogonal constraints directly to the architecture, OMoE keeps the learning\nobjective unchanged, without compromising optimality. Our method is simple and\nalleviates memory bottlenecks, as it incurs minimal experts compared to vanilla\nMoE models. Experiments on diverse commonsense reasoning benchmarks demonstrate\nthat OMoE can consistently achieve stable and efficient performance improvement\nwhen compared with the state-of-the-art methods while significantly reducing\nthe number of required experts.", "paper_summary_zh": "<paragraph>建立混合专家 (MoE) 架構，用於低秩適應 (LoRA)，由於其模組化設計和卓越的效能，逐漸成為參數有效微調 (PEFT) 中潛在的方向。然而，單純堆疊專家數量無法保證顯著改善。在這項工作中，我們首先進行定性分析，以指出專家在香草 MoE 中會崩潰成類似的表示，限制了模組化設計和運算效率的能力。進一步來說，我們的分析顯示，先前的 MoE 變體效能可能受到專家之間缺乏多樣性的限制。受到這些發現的啟發，我們提出了正交混合專家 (OMoE)，這是一種資源有效率的 MoE 變體，它以正交方式訓練專家，以促進多樣性。在 OMoE 中，利用 Gram-Schmidt 程序來強制執行專家的表示位於 Stiefel 流形內。透過將正交約束直接應用於架構，OMoE 保持學習目標不變，同時不影響最佳性。我們的模型簡單，且可減輕記憶體瓶頸，因為與香草 MoE 模型相比，它會產生最少的專家。在各種常識推理基準測試上的實驗證明，與最先進的方法相比，OMoE 可以持續達成穩定且有效率的效能改善，同時大幅減少所需的專家數量。</paragraph>", "author": "Jinyuan Feng et.al.", "authors": "Jinyuan Feng, Zhiqiang Pu, Tianyi Hu, Dongmin Li, Xiaolin Ai, Huimu Wang", "id": "2501.10062v1", "paper_url": "http://arxiv.org/abs/2501.10062v1", "repo": "null"}}