{"2412.02084": {"publish_time": "2024-12-03", "title": "Comparative Analysis of Black-Box and White-Box Machine Learning Model in Phishing Detection", "paper_summary": "Background: Explainability in phishing detection model can support a further\nsolution of phishing attack mitigation by increasing trust and understanding\nhow phishing can be detected. Objective: The aims of this study to determine\nand best recommendation to apply an approach which has several components with\nabilities to fulfil the critical needs Methods: A methodology starting with\nanalyzing both black-box and white-box models to get the pros and cons\nspecifically in phishing detection. The conclusion of the analysis will be\nvalidated by experiment using a set of well-known algorithms and public\nphishing datasets. Experimental metrics covers 3 measurements such as\npredictive accuracy and explainability metrics. Conclusion: Both models are\ncomparable in terms of interpretability and consistency, with room for\nimprovement in diverse datasets. EBM as an example of white-box model is\ngenerally better suited for applications requiring explainability and\nactionable insights. Finally, each model, white-box and black-box model has\npositive and negative aspects both for performance metric and for explainable\nmetric. It is important to consider the objective of model usage.", "paper_summary_zh": "背景：網路釣魚偵測模型中的可解釋性可以支援進一步的網路釣魚攻擊緩解解決方案，方法是增加信任度並了解如何偵測網路釣魚。目標：本研究的目標是決定並最佳建議應用一種方法，該方法具有多項組成部分，具備滿足關鍵需求的能力。方法：一種方法從分析黑盒和白盒模型開始，以獲得利弊，特別是在網路釣魚偵測中。分析結論將透過使用一組眾所周知的演算法和公開網路釣魚資料集進行實驗驗證。實驗指標涵蓋 3 項測量，例如預測準確度和可解釋性指標。結論：這兩種模型在可解釋性和一致性方面具有可比性，在不同的資料集中有改進空間。EBM 作為白盒模型的一個範例，通常更適合需要可解釋性和可行見解的應用程式。最後，白盒模型和黑盒模型這兩種模型在效能指標和可解釋指標方面都有正面和負面面向。考慮模型使用的目標非常重要。", "author": "Abdullah Fajar et.al.", "authors": "Abdullah Fajar, Setiadi Yazid, Indra Budi", "id": "2412.02084v1", "paper_url": "http://arxiv.org/abs/2412.02084v1", "repo": "null"}}