{"2501.11935": {"publish_time": "2025-01-21", "title": "Webvs. LLMs: An Empirical Study of Learning Behaviors of CS2 Students", "paper_summary": "LLMs such as ChatGPT have been widely adopted by students in higher education\nas tools for learning programming and related concepts. However, it remains\nunclear how effective students are and what strategies students use while\nlearning with LLMs. Since the majority of students' experiences in online\nself-learning have come through using search engines such as Google, evaluating\nAI tools in this context can help us address these gaps. In this mixed methods\nresearch, we conducted an exploratory within-subjects study to understand how\nCS2 students learn programming concepts using both LLMs as well as traditional\nonline methods such as educational websites and videos to examine how students\napproach learning within and across both scenarios. We discovered that students\nfound it easier to learn a more difficult concept using traditional methods\nthan using ChatGPT. We also found that students ask fewer follow-ups and use\nmore keyword-based queries for search engines while their prompts to LLMs tend\nto explicitly ask for information.", "paper_summary_zh": "大型語言模型（LLM）例如 ChatGPT 已被高等教育中的學生廣泛採用，作為學習程式設計和相關概念的工具。然而，學生使用 LLM 的成效如何以及使用的策略為何仍不清楚。由於大多數學生在線上自學的經驗都來自使用 Google 等搜尋引擎，因此在此脈絡中評估 AI 工具有助於我們解決這些差距。在此混合方法研究中，我們進行了一項探索性的受試者內研究，以了解 CS2 學生如何使用 LLM 和傳統線上方法（例如教育網站和影片）學習程式設計概念，以探討學生如何在兩種情境中和跨情境學習。我們發現學生使用傳統方法學習較困難的概念比使用 ChatGPT 容易。我們還發現學生在使用搜尋引擎時會提出較少的追蹤問題，並使用更多基於關鍵字的查詢，而他們對 LLM 的提示則傾向於明確要求提供資訊。", "author": "Aayush Kumar et.al.", "authors": "Aayush Kumar, Daniel Prol, Amin Alipour, Sruti Srinivasa Ragavan", "id": "2501.11935v1", "paper_url": "http://arxiv.org/abs/2501.11935v1", "repo": "null"}}