{"2405.04985": {"publish_time": "2024-05-08", "title": "An Artificial Intelligence Approach for Interpreting Creative Combinational Designs", "paper_summary": "Combinational creativity, a form of creativity involving the blending of\nfamiliar ideas, is pivotal in design innovation. While most research focuses on\nhow combinational creativity in design is achieved through blending elements,\nthis study focuses on the computational interpretation, specifically\nidentifying the 'base' and 'additive' components that constitute a creative\ndesign. To achieve this goal, the authors propose a heuristic algorithm\nintegrating computer vision and natural language processing technologies, and\nimplement multiple approaches based on both discriminative and generative\nartificial intelligence architectures. A comprehensive evaluation was conducted\non a dataset created for studying combinational creativity. Among the\nimplementations of the proposed algorithm, the most effective approach\ndemonstrated a high accuracy in interpretation, achieving 87.5% for identifying\n'base' and 80% for 'additive'. We conduct a modular analysis and an ablation\nexperiment to assess the performance of each part in our implementations.\nAdditionally, the study includes an analysis of error cases and bottleneck\nissues, providing critical insights into the limitations and challenges\ninherent in the computational interpretation of creative designs.", "paper_summary_zh": "組合式創意是一種涉及融合熟悉概念的創意形式，在設計創新中至關重要。雖然大多數研究都集中在如何透過融合元素來達成設計中的組合式創意，但本研究專注於計算詮釋，特別是識別構成創意設計的「基礎」和「附加」組成部分。為了達成此目標，作者提出了一種整合電腦視覺和自然語言處理技術的啟發式演算法，並根據判別式和生成式人工智慧架構實作多種方法。針對專門用於研究組合式創意的資料集進行了全面的評估。在所提出的演算法實作中，最有效的方法在詮釋上展現出高準確度，在識別「基礎」時達到 87.5%，在識別「附加」時達到 80%。我們進行模組分析和消融實驗，以評估實作中每個部分的效能。此外，本研究還包含對錯誤案例和瓶頸問題的分析，提供了對創意設計計算詮釋中固有限制和挑戰的重要見解。", "author": "Liuqing Chen et.al.", "authors": "Liuqing Chen, Shuhong Xiao, Yunnong Chen, Linyun Sun, Peter R. N. Childs, Ji Han", "id": "2405.04985v1", "paper_url": "http://arxiv.org/abs/2405.04985v1", "repo": "null"}}