{"2411.15129": {"publish_time": "2024-11-22", "title": "Measuring Bullshit in the Language Games played by ChatGPT", "paper_summary": "Generative large language models (LLMs), which create text without direct\ncorrespondence to truth value, are widely understood to resemble the uses of\nlanguage described in Frankfurt's popular monograph On Bullshit. In this paper,\nwe offer a rigorous investigation of this topic, identifying how the phenomenon\nhas arisen, and how it might be analysed. In this paper, we elaborate on this\nargument to propose that LLM-based chatbots play the 'language game of\nbullshit'. We use statistical text analysis to investigate the features of this\nWittgensteinian language game, based on a dataset constructed to contrast the\nlanguage of 1,000 scientific publications with typical pseudo-scientific text\ngenerated by ChatGPT. We then explore whether the same language features can be\ndetected in two well-known contexts of social dysfunction: George Orwell's\ncritique of politics and language, and David Graeber's characterisation of\nbullshit jobs. Using simple hypothesis-testing methods, we demonstrate that a\nstatistical model of the language of bullshit can reliably relate the\nFrankfurtian artificial bullshit of ChatGPT to the political and workplace\nfunctions of bullshit as observed in natural human language.", "paper_summary_zh": "生成式大型語言模型（LLM）會產生沒有直接對應真值的文章，廣泛被認為類似於法蘭克福的暢銷專著《論扯淡》中所描述的語言用法。在本文中，我們對此主題進行嚴謹的探討，找出這種現象如何產生，以及如何分析。在本文中，我們進一步闡述這個論點，提出基於 LLM 的聊天機器人玩「扯淡的語言遊戲」。我們使用統計文本分析來探討這個維根斯坦語言遊戲的特徵，根據一個建構來對比 1,000 篇科學出版物語言與 ChatGPT 所產生典型偽科學文本的資料集。接著我們探討是否可以在兩個著名的社會失能情境中偵測到相同的語言特徵：喬治·歐威爾對政治與語言的批判，以及大衛·格雷伯對扯淡工作的描述。使用簡單的假設檢定方法，我們證明了扯淡語言的統計模型可以可靠地將 ChatGPT 的法蘭克福式人工扯淡與在自然人類語言中觀察到的扯淡的政治和職場功能關聯起來。", "author": "Alessandro Trevisan et.al.", "authors": "Alessandro Trevisan, Harry Giddens, Sarah Dillon, Alan F. Blackwell", "id": "2411.15129v1", "paper_url": "http://arxiv.org/abs/2411.15129v1", "repo": "null"}}