{"2412.17387": {"publish_time": "2024-12-23", "title": "Singular Value Scaling: Efficient Generative Model Compression via Pruned Weights Refinement", "paper_summary": "While pruning methods effectively maintain model performance without extra\ntraining costs, they often focus solely on preserving crucial connections,\noverlooking the impact of pruned weights on subsequent fine-tuning or\ndistillation, leading to inefficiencies. Moreover, most compression techniques\nfor generative models have been developed primarily for GANs, tailored to\nspecific architectures like StyleGAN, and research into compressing Diffusion\nmodels has just begun. Even more, these methods are often applicable only to\nGANs or Diffusion models, highlighting the need for approaches that work across\nboth model types. In this paper, we introduce Singular Value Scaling (SVS), a\nversatile technique for refining pruned weights, applicable to both model\ntypes. Our analysis reveals that pruned weights often exhibit dominant singular\nvectors, hindering fine-tuning efficiency and leading to suboptimal performance\ncompared to random initialization. Our method enhances weight initialization by\nminimizing the disparities between singular values of pruned weights, thereby\nimproving the fine-tuning process. This approach not only guides the compressed\nmodel toward superior solutions but also significantly speeds up fine-tuning.\nExtensive experiments on StyleGAN2, StyleGAN3 and DDPM demonstrate that SVS\nimproves compression performance across model types without additional training\ncosts. Our code is available at:\nhttps://github.com/LAIT-CVLab/Singular_Value_Scaling.", "paper_summary_zh": "雖然剪枝方法有效地維持模型效能而無額外的訓練成本，它們通常只專注於保留關鍵連接，而忽略修剪權重對後續微調或蒸餾的影響，導致效率低下。此外，大多數用於生成模型的壓縮技術主要針對 GAN 而開發，專門針對 StyleGAN 等特定架構，而對擴散模型的壓縮研究才剛開始。更重要的是，這些方法通常僅適用於 GAN 或擴散模型，這突顯了需要跨這兩種模型類型運作的方法。在本文中，我們引入了奇異值縮放 (SVS)，這是一種適用於這兩種模型類型的精煉修剪權重的通用技術。我們的分析揭示，修剪權重通常表現出主要的奇異向量，阻礙微調效率，並導致與隨機初始化相比次佳的效能。我們的技術通過最小化修剪權重的奇異值之間的差異來增強權重初始化，從而改善微調過程。這種方法不僅引導壓縮模型走向更好的解，而且還顯著加快了微調速度。對 StyleGAN2、StyleGAN3 和 DDPM 的大量實驗表明，SVS 改善了跨模型類型的壓縮效能，而無需額外的訓練成本。我們的程式碼可在以下網址取得：\nhttps://github.com/LAIT-CVLab/Singular_Value_Scaling。", "author": "Hyeonjin Kim et.al.", "authors": "Hyeonjin Kim, Jaejun Yoo", "id": "2412.17387v1", "paper_url": "http://arxiv.org/abs/2412.17387v1", "repo": "null"}}