{"2412.07658": {"publish_time": "2024-12-10", "title": "TraSCE: Trajectory Steering for Concept Erasure", "paper_summary": "Recent advancements in text-to-image diffusion models have brought them to\nthe public spotlight, becoming widely accessible and embraced by everyday\nusers. However, these models have been shown to generate harmful content such\nas not-safe-for-work (NSFW) images. While approaches have been proposed to\nerase such abstract concepts from the models, jail-breaking techniques have\nsucceeded in bypassing such safety measures. In this paper, we propose TraSCE,\nan approach to guide the diffusion trajectory away from generating harmful\ncontent. Our approach is based on negative prompting, but as we show in this\npaper, conventional negative prompting is not a complete solution and can\neasily be bypassed in some corner cases. To address this issue, we first\npropose a modification of conventional negative prompting. Furthermore, we\nintroduce a localized loss-based guidance that enhances the modified negative\nprompting technique by steering the diffusion trajectory. We demonstrate that\nour proposed method achieves state-of-the-art results on various benchmarks in\nremoving harmful content including ones proposed by red teams; and erasing\nartistic styles and objects. Our proposed approach does not require any\ntraining, weight modifications, or training data (both image or prompt), making\nit easier for model owners to erase new concepts.", "paper_summary_zh": "最近文本到图像扩散模型的进步使其成为公众关注的焦点，被广泛使用并被日常用户接受。然而，这些模型已被证明会生成有害内容，例如不适合工作的（NSFW）图像。虽然已经提出了从模型中抹去此类抽象概念的方法，但越狱技术已经成功绕过了此类安全措施。在本文中，我们提出了 TraSCE，这是一种引导扩散轨迹远离生成有害内容的方法。我们的方法基于负面提示，但正如我们在本文中所示，传统的负面提示并不是一个完整的解决方案，并且在某些极端情况下很容易被绕过。为了解决这个问题，我们首先提出了对传统负面提示的修改。此外，我们引入了一种基于局部损失的指导，通过控制扩散轨迹来增强修改后的负面提示技术。我们证明了我们提出的方法在消除有害内容（包括红队提出的内容）的各种基准测试中取得了最先进的结果；并擦除了艺术风格和物体。我们提出的方法不需要任何训练、权重修改或训练数据（图像或提示），这使得模型所有者更容易擦除新概念。", "author": "Anubhav Jain et.al.", "authors": "Anubhav Jain, Yuya Kobayashi, Takashi Shibuya, Yuhta Takida, Nasir Memon, Julian Togelius, Yuki Mitsufuji", "id": "2412.07658v1", "paper_url": "http://arxiv.org/abs/2412.07658v1", "repo": "null"}}