{"2406.14312": {"publish_time": "2024-06-20", "title": "Infusing clinical knowledge into tokenisers for language models", "paper_summary": "This study introduces a novel knowledge enhanced tokenisation mechanism,\nK-Tokeniser, for clinical text processing. Technically, at initialisation\nstage, K-Tokeniser populates global representations of tokens based on semantic\ntypes of domain concepts (such as drugs or diseases) from either a domain\nontology like Unified Medical Language System or the training data of the task\nrelated corpus. At training or inference stage, sentence level localised\ncontext will be utilised for choosing the optimal global token representation\nto realise the semantic-based tokenisation. To avoid pretraining using the new\ntokeniser, an embedding initialisation approach is proposed to generate\nrepresentations for new tokens. Using three transformer-based language models,\na comprehensive set of experiments are conducted on four real-world datasets\nfor evaluating K-Tokeniser in a wide range of clinical text analytics tasks\nincluding clinical concept and relation extraction, automated clinical coding,\nclinical phenotype identification, and clinical research article\nclassification. Overall, our models demonstrate consistent improvements over\ntheir counterparts in all tasks. In particular, substantial improvements are\nobserved in the automated clinical coding task with 13\\% increase on Micro\n$F_1$ score. Furthermore, K-Tokeniser also shows significant capacities in\nfacilitating quicker converge of language models. Specifically, using\nK-Tokeniser, the language models would only require 50\\% of the training data\nto achieve the best performance of the baseline tokeniser using all training\ndata in the concept extraction task and less than 20\\% of the data for the\nautomated coding task. It is worth mentioning that all these improvements\nrequire no pre-training process, making the approach generalisable.", "paper_summary_zh": "本研究引入一種新穎的知識增強標記化機制，K-Tokeniser，用於臨床文本處理。技術上，在初始化階段，K-Tokeniser 會根據來自領域概念（例如藥物或疾病）的語義類型，從統一醫學語言系統或任務相關語料庫的訓練資料中，填充標記的全局表示。在訓練或推論階段，句子級別的局部化上下文將被用於選擇最佳的全局標記表示，以實現基於語義的標記化。為了避免使用新的標記化器進行預訓練，提出了一種嵌入初始化方法，以產生新標記的表示。使用三種基於Transformer的語言模型，對四個真實世界數據集進行了一組全面的實驗，以評估 K-Tokeniser 在廣泛的臨床文本分析任務中的表現，包括臨床概念和關係提取、自動臨床編碼、臨床表型識別和臨床研究文章分類。總體而言，我們的模型在所有任務中都展示出比其對應模型更一致的改進。特別是，在自動臨床編碼任務中觀察到了顯著的改進，Micro $F_1$ 得分提高了 13%。此外，K-Tokeniser 還顯示出顯著的能力，可以促進語言模型更快的收斂。具體來說，使用 K-Tokeniser，語言模型只需要 50% 的訓練數據即可在概念提取任務中達到基線標記化器使用所有訓練數據的最佳性能，而自動編碼任務則不到 20% 的數據。值得一提的是，所有這些改進都不需要預訓練過程，這使得該方法具有普遍性。", "author": "Abul Hasan et.al.", "authors": "Abul Hasan, Jinge Wu, Quang Ngoc Nguyen, Salomé Andres, Imane Guellil, Huayu Zhang, Arlene Casey, Beatrice Alex, Bruce Guthrie, Honghan Wu", "id": "2406.14312v1", "paper_url": "http://arxiv.org/abs/2406.14312v1", "repo": "null"}}