{"2407.11599": {"publish_time": "2024-07-16", "title": "Enhancing TinyML Security: Study of Adversarial Attack Transferability", "paper_summary": "The recent strides in artificial intelligence (AI) and machine learning (ML)\nhave propelled the rise of TinyML, a paradigm enabling AI computations at the\nedge without dependence on cloud connections. While TinyML offers real-time\ndata analysis and swift responses critical for diverse applications, its\ndevices' intrinsic resource limitations expose them to security risks. This\nresearch delves into the adversarial vulnerabilities of AI models on\nresource-constrained embedded hardware, with a focus on Model Extraction and\nEvasion Attacks. Our findings reveal that adversarial attacks from powerful\nhost machines could be transferred to smaller, less secure devices like ESP32\nand Raspberry Pi. This illustrates that adversarial attacks could be extended\nto tiny devices, underscoring vulnerabilities, and emphasizing the necessity\nfor reinforced security measures in TinyML deployments. This exploration\nenhances the comprehension of security challenges in TinyML and offers insights\nfor safeguarding sensitive data and ensuring device dependability in AI-powered\nedge computing settings.", "paper_summary_zh": "最近在人工智慧（AI）和機器學習（ML）的進展，推動了 TinyML 的崛起，這是一個在邊緣進行 AI 計算的範例，不需要依賴雲端連線。儘管 TinyML 提供了即時資料分析和快速回應，這對各種應用程式來說至關重要，但其裝置內在的資源限制使它們面臨安全風險。這項研究探討了在資源受限的嵌入式硬體上，AI 模型的對抗性漏洞，重點在於模型萃取和規避攻擊。我們的研究結果顯示，強大的主機電腦的對抗性攻擊可以轉移到較小、安全性較低的裝置，例如 ESP32 和 Raspberry Pi。這說明了對抗性攻擊可以擴展到微型裝置，凸顯了漏洞，並強調在 TinyML 部署中強化安全措施的必要性。這項探討增強了對 TinyML 安全挑戰的理解，並提供了見解，用於保護敏感資料，並確保在 AI 驅動的邊緣運算設定中裝置的可靠性。", "author": "Parin Shah et.al.", "authors": "Parin Shah, Yuvaraj Govindarajulu, Pavan Kulkarni, Manojkumar Parmar", "id": "2407.11599v1", "paper_url": "http://arxiv.org/abs/2407.11599v1", "repo": "null"}}