{"2504.02074": {"publish_time": "2025-04-02", "title": "Trapped by Expectations: Functional Fixedness in LLM-Enabled Chat Search", "paper_summary": "Functional fixedness, a cognitive bias that restricts users' interactions\nwith a new system or tool to expected or familiar ways, limits the full\npotential of Large Language Model (LLM)-enabled chat search, especially in\ncomplex and exploratory tasks. To investigate its impact, we conducted a\ncrowdsourcing study with 450 participants, each completing one of six\ndecision-making tasks spanning public safety, diet and health management,\nsustainability, and AI ethics. Participants engaged in a multi-prompt\nconversation with ChatGPT to address the task, allowing us to compare pre-chat\nintent-based expectations with observed interactions. We found that: 1) Several\naspects of pre-chat expectations are closely associated with users' prior\nexperiences with ChatGPT, search engines, and virtual assistants; 2) Prior\nsystem experience shapes language use and prompting behavior. Frequent ChatGPT\nusers reduced deictic terms and hedge words and frequently adjusted prompts.\nUsers with rich search experience maintained structured, less-conversational\nqueries with minimal modifications. Users of virtual assistants favored\ndirective, command-like prompts, reinforcing functional fixedness; 3) When the\nsystem failed to meet expectations, participants generated more detailed\nprompts with increased linguistic diversity, reflecting adaptive shifts. These\nfindings suggest that while preconceived expectations constrain early\ninteractions, unmet expectations can motivate behavioral adaptation. With\nappropriate system support, this may promote broader exploration of LLM\ncapabilities. This work also introduces a typology for user intents in chat\nsearch and highlights the importance of mitigating functional fixedness to\nsupport more creative and analytical use of LLMs.", "paper_summary_zh": "<paragraph>功能固著是一種認知偏差，它會限制使用者以預期或熟悉的方式與新系統或工具互動，從而限制了大型語言模型 (LLM) 支援的聊天搜尋的全部潛力，尤其是在複雜和探索性任務中。為了探討其影響，我們進行了一項包含 450 名參與者的眾包研究，每位參與者完成六項決策任務中的一項，這些任務涵蓋公共安全、飲食和健康管理、永續性和 AI 倫理。參與者與 ChatGPT 進行多提示對話以處理任務，使我們能夠比較聊天前基於意圖的預期與觀察到的互動。我們發現：1) 聊天前預期的幾個方面與使用者先前使用 ChatGPT、搜尋引擎和虛擬助理的經驗密切相關；2) 先前的系統經驗會影響語言使用和提示行為。經常使用 ChatGPT 的使用者減少了指示詞和模糊詞，並經常調整提示。具有豐富搜尋經驗的使用者保持結構化、較少對話式的查詢，並儘量減少修改。虛擬助理的使用者偏愛指令式、類似命令的提示，強化了功能固著；3) 當系統未能達到預期時，參與者會產生更詳細的提示，並增加語言多樣性，反映了適應性轉變。這些發現表明，雖然先入為主的預期會限制早期互動，但未滿足的預期會激勵行為適應。在適當的系統支援下，這可能會促進對 LLM 功能的更廣泛探索。這項工作還介紹了聊天搜尋中使用者意圖的類型學，並強調了減輕功能固著以支援更具創造性和分析性地使用 LLM 的重要性。</paragraph>\n", "author": "Jiqun Liu et.al.", "authors": "Jiqun Liu, Jamshed Karimnazarov, Ryen W. White", "id": "2504.02074v1", "paper_url": "http://arxiv.org/abs/2504.02074v1", "repo": "null"}}