{"2501.08109": {"publish_time": "2025-01-14", "title": "Data-driven inventory management for new products: A warm-start and adjusted Dyna-$Q$ approach", "paper_summary": "In this paper, we propose a novel reinforcement learning algorithm for\ninventory management of newly launched products with no or limited historical\ndemand information. The algorithm follows the classic Dyna-$Q$ structure,\nbalancing the model-based and model-free approaches, while accelerating the\ntraining process of Dyna-$Q$ and mitigating the model discrepancy generated by\nthe model-based feedback. Warm-start information from the demand data of\nexisting similar products can be incorporated into the algorithm to further\nstabilize the early-stage training and reduce the variance of the estimated\noptimal policy. Our approach is validated through a case study of bakery\ninventory management with real data. The adjusted Dyna-$Q$ shows up to a 23.7\\%\nreduction in average daily cost compared with $Q$-learning, and up to a 77.5\\%\nreduction in training time within the same horizon compared with classic\nDyna-$Q$. By incorporating the warm-start information, it can be found that the\nadjusted Dyna-$Q$ has the lowest total cost, lowest variance in total cost, and\nrelatively low shortage percentages among all the algorithms under a 30-day\ntesting.", "paper_summary_zh": "<paragraph>在本文中，我们提出了一种新颖的强化学习演算法，用于在没有或只有有限的历史需求资讯的情况下管理新推出的产品的库存。此演算法遵循经典的 Dyna-$Q$ 结构，平衡基于模型和无模型的方法，同时加速 Dyna-$Q$ 的训练程序，并减轻基于模型的回馈产生的模型差异。可以将现有类似产品的需求资料的热启动资讯纳入演算法，以进一步稳定早期阶段的训练，并减少估计最佳政策的差异。我们的方法已透过实际资料的麵包店库存管理案例研究得到验证。调整后的 Dyna-$Q$ 显示出与 $Q$-learning 相比，平均每日成本降低了 23.7%，与经典 Dyna-$Q$ 相比，在相同范围内训练时间减少了 77.5%。透过纳入热启动资讯，可以发现调整后的 Dyna-$Q$ 在所有演算法中具有最低的总成本、最低的总成本差异，以及在 30 天测试中的相对较低的短缺百分比。</paragraph>", "author": "Xinyu Qu et.al.", "authors": "Xinyu Qu, Longxiao Liu, Wenjie Huang", "id": "2501.08109v1", "paper_url": "http://arxiv.org/abs/2501.08109v1", "repo": "null"}}