{"2412.06847": {"publish_time": "2024-12-08", "title": "M$^{3}$-20M: A Large-Scale Multi-Modal Molecule Dataset for AI-driven Drug Design and Discovery", "paper_summary": "This paper introduces M$^{3}$-20M, a large-scale Multi-Modal Molecular\ndataset that contains over 20 million molecules. Designed to support AI-driven\ndrug design and discovery, M$^{3}$-20M is 71 times more in the number of\nmolecules than the largest existing dataset, providing an unprecedented scale\nthat can highly benefit training or fine-tuning large (language) models with\nsuperior performance for drug design and discovery. This dataset integrates\none-dimensional SMILES, two-dimensional molecular graphs, three-dimensional\nmolecular structures, physicochemical properties, and textual descriptions\ncollected through web crawling and generated by using GPT-3.5, offering a\ncomprehensive view of each molecule. To demonstrate the power of M$^{3}$-20M in\ndrug design and discovery, we conduct extensive experiments on two key tasks:\nmolecule generation and molecular property prediction, using large language\nmodels including GLM4, GPT-3.5, and GPT-4. Our experimental results show that\nM$^{3}$-20M can significantly boost model performance in both tasks.\nSpecifically, it enables the models to generate more diverse and valid\nmolecular structures and achieve higher property prediction accuracy than the\nexisting single-modal datasets, which validates the value and potential of\nM$^{3}$-20M in supporting AI-driven drug design and discovery. The dataset is\navailable at \\url{https://github.com/bz99bz/M-3}.", "paper_summary_zh": "這篇論文介紹了 M$^{3}$-20M，一個包含超過 2000 萬個分子的大型多模態分子資料集。M$^{3}$-20M 旨在支援 AI 驅動的藥物設計和發現，其分子數量是現有最大資料集的 71 倍，提供了前所未有的規模，可以極大地受益於訓練或微調大型（語言）模型，以在藥物設計和發現方面獲得卓越的效能。此資料集整合了透過網路爬取收集和使用 GPT-3.5 生成的單維 SMILES、二維分子圖、三維分子結構、物理化學性質和文字描述，提供了每個分子的全面檢視。為了展示 M$^{3}$-20M 在藥物設計和發現中的強大功能，我們對兩個關鍵任務進行了廣泛的實驗：分子生成和分子性質預測，使用包括 GLM4、GPT-3.5 和 GPT-4 在內的大型語言模型。我們的實驗結果表明，M$^{3}$-20M 可以顯著提升模型在兩個任務中的效能。具體來說，它使模型能夠產生更多樣化和有效的分子結構，並比現有的單模態資料集獲得更高的性質預測準確度，這驗證了 M$^{3}$-20M 在支援 AI 驅動的藥物設計和發現中的價值和潛力。資料集可在 \\url{https://github.com/bz99bz/M-3} 取得。", "author": "Siyuan Guo et.al.", "authors": "Siyuan Guo, Lexuan Wang, Chang Jin, Jinxian Wang, Han Peng, Huayang Shi, Wengen Li, Jihong Guan, Shuigeng Zhou", "id": "2412.06847v1", "paper_url": "http://arxiv.org/abs/2412.06847v1", "repo": "https://github.com/bz99bz/m-3"}}