{"2502.09020": {"publish_time": "2025-02-13", "title": "EventSTR: A Benchmark Dataset and Baselines for Event Stream based Scene Text Recognition", "paper_summary": "Mainstream Scene Text Recognition (STR) algorithms are developed based on RGB\ncameras which are sensitive to challenging factors such as low illumination,\nmotion blur, and cluttered backgrounds. In this paper, we propose to recognize\nthe scene text using bio-inspired event cameras by collecting and annotating a\nlarge-scale benchmark dataset, termed EventSTR. It contains 9,928\nhigh-definition (1280 * 720) event samples and involves both Chinese and\nEnglish characters. We also benchmark multiple STR algorithms as the baselines\nfor future works to compare. In addition, we propose a new event-based scene\ntext recognition framework, termed SimC-ESTR. It first extracts the event\nfeatures using a visual encoder and projects them into tokens using a Q-former\nmodule. More importantly, we propose to augment the vision tokens based on a\nmemory mechanism before feeding into the large language models. A\nsimilarity-based error correction mechanism is embedded within the large\nlanguage model to correct potential minor errors fundamentally based on\ncontextual information. Extensive experiments on the newly proposed EventSTR\ndataset and two simulation STR datasets fully demonstrate the effectiveness of\nour proposed model. We believe that the dataset and algorithmic model can\ninnovatively propose an event-based STR task and are expected to accelerate the\napplication of event cameras in various industries. The source code and\npre-trained models will be released on https://github.com/Event-AHU/EventSTR", "paper_summary_zh": "主流場景文字辨識（STR）演算法是基於對低光源、動態模糊和雜亂背景等挑戰性因素敏感的 RGB 相機開發的。在本文中，我們提出使用生物靈感事件相機辨識場景文字，方法是收集和標註一個稱為 EventSTR 的大規模基準資料集。它包含 9,928 個高畫質（1280 * 720）事件範例，並包含中文字和英文字元。我們也基準化多個 STR 演算法作為未來工作的基準，以進行比較。此外，我們提出一個新的基於事件的場景文字辨識架構，稱為 SimC-ESTR。它首先使用視覺編碼器萃取事件特徵，並使用 Q-former 模組將它們投影到代幣中。更重要的是，我們提出在輸入大型語言模型之前，基於記憶機制擴充視覺代幣。一個基於相似性的錯誤修正機制嵌入在大型語言模型中，以根據上下文資訊從根本上修正潛在的輕微錯誤。在最新提出的 EventSTR 資料集和兩個模擬 STR 資料集上進行的廣泛實驗充分證明了我們提出的模型的有效性。我們相信，該資料集和演算法模型可以創新地提出一個基於事件的 STR 任務，並有望加速事件相機在各個產業的應用。原始碼和預先訓練的模型將在 https://github.com/Event-AHU/EventSTR 上釋出", "author": "Xiao Wang et.al.", "authors": "Xiao Wang, Jingtao Jiang, Dong Li, Futian Wang, Lin Zhu, Yaowei Wang, Yongyong Tian, Jin Tang", "id": "2502.09020v1", "paper_url": "http://arxiv.org/abs/2502.09020v1", "repo": "null"}}