{"2405.15294": {"publish_time": "2024-05-24", "title": "Semi-Supervised Learning guided by the Generalized Bayes Rule under Soft Revision", "paper_summary": "We provide a theoretical and computational investigation of the Gamma-Maximin\nmethod with soft revision, which was recently proposed as a robust criterion\nfor pseudo-label selection (PLS) in semi-supervised learning. Opposed to\ntraditional methods for PLS we use credal sets of priors (\"generalized Bayes\")\nto represent the epistemic modeling uncertainty. These latter are then updated\nby the Gamma-Maximin method with soft revision. We eventually select\npseudo-labeled data that are most likely in light of the least favorable\ndistribution from the so updated credal set. We formalize the task of finding\noptimal pseudo-labeled data w.r.t. the Gamma-Maximin method with soft revision\nas an optimization problem. A concrete implementation for the class of logistic\nmodels then allows us to compare the predictive power of the method with\ncompeting approaches. It is observed that the Gamma-Maximin method with soft\nrevision can achieve very promising results, especially when the proportion of\nlabeled data is low.", "paper_summary_zh": "我們提供 Gamma-Maximin 方法的理論和計算調查，它採用軟修正，最近被提議作為半監督學習中偽標籤選擇 (PLS) 的穩健準則。與 PLS 的傳統方法相反，我們使用先驗的可信集（「廣義貝氏」）來表示認識建模的不確定性。然後，這些後者由 Gamma-Maximin 方法透過軟修正更新。我們最終選擇最可能根據已更新可信集中最不利的分配的偽標籤資料。我們將尋找相對於 Gamma-Maximin 方法的最佳偽標籤資料 w.r.t. 的任務形式化為一個最佳化問題。然後，針對邏輯模型類別的具體實作允許我們將該方法的預測能力與競爭方法進行比較。可以觀察到，採用軟修正的 Gamma-Maximin 方法可以達成非常有希望的結果，特別是在標籤資料的比例較低時。", "author": "Stefan Dietrich et.al.", "authors": "Stefan Dietrich, Julian Rodemann, Christoph Jansen", "id": "2405.15294v1", "paper_url": "http://arxiv.org/abs/2405.15294v1", "repo": "null"}}