{"2408.11243": {"publish_time": "2024-08-20", "title": "Do Neural Scaling Laws Exist on Graph Self-Supervised Learning?", "paper_summary": "Self-supervised learning~(SSL) is essential to obtain foundation models in\nNLP and CV domains via effectively leveraging knowledge in large-scale\nunlabeled data. The reason for its success is that a suitable SSL design can\nhelp the model to follow the neural scaling law, i.e., the performance\nconsistently improves with increasing model and dataset sizes. However, it\nremains a mystery whether existing SSL in the graph domain can follow the\nscaling behavior toward building Graph Foundation Models~(GFMs) with\nlarge-scale pre-training. In this study, we examine whether existing graph SSL\ntechniques can follow the neural scaling behavior with the potential to serve\nas the essential component for GFMs. Our benchmark includes comprehensive SSL\ntechnique implementations with analysis conducted on both the conventional SSL\nsetting and many new settings adopted in other domains. Surprisingly, despite\nthe SSL loss continuously decreasing, no existing graph SSL techniques follow\nthe neural scaling behavior on the downstream performance. The model\nperformance only merely fluctuates on different data scales and model scales.\nInstead of the scales, the key factors influencing the performance are the\nchoices of model architecture and pretext task design. This paper examines\nexisting SSL techniques for the feasibility of Graph SSL techniques in\ndeveloping GFMs and opens a new direction for graph SSL design with the new\nevaluation prototype. Our code implementation is available online to ease\nreproducibility on https://github.com/GraphSSLScaling/GraphSSLScaling.", "paper_summary_zh": "自監督學習 (SSL) 對於透過有效利用大規模未標記資料中的知識來取得 NLP 和 CV 領域中的基礎模型至關重要。它成功的理由在於，適當的 SSL 設計可以幫助模型遵循神經擴充定律，亦即效能會隨著模型和資料集大小的增加而持續提升。然而，現有的圖形領域 SSL 是否能遵循擴充行為，朝著建構具備大規模預訓練的圖形基礎模型 (GFM) 邁進，仍然是個謎。在本研究中，我們檢視現有的圖形 SSL 技術是否能遵循神經擴充行為，並具備作為 GFM 基本元件的潛力。我們的基準包含全面的 SSL 技術實作，並對傳統 SSL 設定和採用其他領域的許多新設定進行分析。令人驚訝的是，儘管 SSL 損失持續下降，但沒有現有的圖形 SSL 技術在下游效能上遵循神經擴充行為。模型效能僅在不同的資料規模和模型規模上波動。影響效能的關鍵因素不是規模，而是模型架構和預設任務設計的選擇。本文檢視現有的 SSL 技術，探討圖形 SSL 技術在開發 GFM 中的可行性，並透過新的評估原型為圖形 SSL 設計開啟新的方向。我們的程式碼實作可以在線上取得，以簡化在 https://github.com/GraphSSLScaling/GraphSSLScaling 上的重現性。", "author": "Qian Ma et.al.", "authors": "Qian Ma, Haitao Mao, Jingzhe Liu, Zhehua Zhang, Chunlin Feng, Yu Song, Yihan Shao, Tianfan Fu, Yao Ma", "id": "2408.11243v1", "paper_url": "http://arxiv.org/abs/2408.11243v1", "repo": "https://github.com/graphsslscaling/graphsslscaling"}}