{"2407.18625": {"publish_time": "2024-07-26", "title": "Topology Optimization of Random Memristors for Input-Aware Dynamic SNN", "paper_summary": "There is unprecedented development in machine learning, exemplified by recent\nlarge language models and world simulators, which are artificial neural\nnetworks running on digital computers. However, they still cannot parallel\nhuman brains in terms of energy efficiency and the streamlined adaptability to\ninputs of different difficulties, due to differences in signal representation,\noptimization, run-time reconfigurability, and hardware architecture. To address\nthese fundamental challenges, we introduce pruning optimization for input-aware\ndynamic memristive spiking neural network (PRIME). Signal representation-wise,\nPRIME employs leaky integrate-and-fire neurons to emulate the brain's inherent\nspiking mechanism. Drawing inspiration from the brain's structural plasticity,\nPRIME optimizes the topology of a random memristive spiking neural network\nwithout expensive memristor conductance fine-tuning. For runtime\nreconfigurability, inspired by the brain's dynamic adjustment of computational\ndepth, PRIME employs an input-aware dynamic early stop policy to minimize\nlatency during inference, thereby boosting energy efficiency without\ncompromising performance. Architecture-wise, PRIME leverages memristive\nin-memory computing, mirroring the brain and mitigating the von Neumann\nbottleneck. We validated our system using a 40 nm 256 Kb memristor-based\nin-memory computing macro on neuromorphic image classification and image\ninpainting. Our results demonstrate the classification accuracy and Inception\nScore are comparable to the software baseline, while achieving maximal\n62.50-fold improvements in energy efficiency, and maximal 77.0% computational\nload savings. The system also exhibits robustness against stochastic synaptic\nnoise of analogue memristors. Our software-hardware co-designed model paves the\nway to future brain-inspired neuromorphic computing with brain-like energy\nefficiency and adaptivity.", "paper_summary_zh": "機器學習有空前的發展，最近的大語言模型和世界模擬器就是例證，它們是運作於數位電腦上的人工神經網路。然而，由於訊號表徵、最佳化、執行時間可重新組態性與硬體架構的差異，它們在能源效率和對不同難度輸入的簡化適應性方面，仍然無法與人腦並駕齊驅。為了應對這些基本挑戰，我們為輸入感知動態記憶電阻尖峰神經網路 (PRIME) 引進修剪最佳化。在訊號表徵方面，PRIME 採用漏電積分和發射神經元，模擬大腦固有的尖峰機制。PRIME 從大腦的結構可塑性中汲取靈感，最佳化隨機記憶電阻尖峰神經網路的拓撲，而無需昂貴的記憶電阻電導精細調整。對於執行時間可重新組態性，PRIME 受到大腦動態調整計算深度啟發，採用輸入感知動態早期停止策略，以在推論期間將延遲降至最低，從而提升能源效率，同時不損害效能。在架構方面，PRIME 充分利用記憶電阻內部記憶體運算，反映大腦並減輕馮紐曼瓶頸。我們使用 40 nm 256 Kb 基於記憶電阻的內部記憶體運算巨集，在神經形態影像分類和影像修復上驗證我們的系統。我們的結果顯示，分類準確度和 Inception 分數與軟體基準相當，同時在能源效率方面達到最大的 62.50 倍提升，並在計算負載方面節省最多 77.0%。該系統還展現出對類比記憶電阻的隨機突觸雜訊的穩健性。我們軟體硬體共同設計的模型，為未來具備大腦般能源效率和適應性的、受大腦啟發的神經形態運算鋪路。", "author": "Bo Wang et.al.", "authors": "Bo Wang, Shaocong Wang, Ning Lin, Yi Li, Yifei Yu, Yue Zhang, Jichang Yang, Xiaoshan Wu, Yangu He, Songqi Wang, Rui Chen, Guoqi Li, Xiaojuan Qi, Zhongrui Wang, Dashan Shang", "id": "2407.18625v1", "paper_url": "http://arxiv.org/abs/2407.18625v1", "repo": "null"}}