{"2405.20082": {"publish_time": "2024-05-30", "title": "Segment, Shuffle, and Stitch: A Simple Mechanism for Improving Time-Series Representations", "paper_summary": "Existing approaches for learning representations of time-series keep the\ntemporal arrangement of the time-steps intact with the presumption that the\noriginal order is the most optimal for learning. However, non-adjacent sections\nof real-world time-series may have strong dependencies. Accordingly we raise\nthe question: Is there an alternative arrangement for time-series which could\nenable more effective representation learning? To address this, we propose a\nsimple plug-and-play mechanism called Segment, Shuffle, and Stitch (S3)\ndesigned to improve time-series representation learning of existing models. S3\nworks by creating non-overlapping segments from the original sequence and\nshuffling them in a learned manner that is the most optimal for the task at\nhand. It then re-attaches the shuffled segments back together and performs a\nlearned weighted sum with the original input to capture both the newly shuffled\nsequence along with the original sequence. S3 is modular and can be stacked to\ncreate various degrees of granularity, and can be added to many forms of neural\narchitectures including CNNs or Transformers with negligible computation\noverhead. Through extensive experiments on several datasets and\nstate-of-the-art baselines, we show that incorporating S3 results in\nsignificant improvements for the tasks of time-series classification and\nforecasting, improving performance on certain datasets by up to 68\\%. We also\nshow that S3 makes the learning more stable with a smoother training loss curve\nand loss landscape compared to the original baseline. The code is available at\nhttps://github.com/shivam-grover/S3-TimeSeries .", "paper_summary_zh": "現有的時間序列表示學習方法保持時間步驟的時間順序完整，假設原始順序最適合學習。然而，現實世界時間序列的非相鄰部分可能具有很強的依賴性。因此，我們提出了問題：時間序列是否存在替代排列，可以實現更有效的表示學習？為了解決這個問題，我們提出了一種稱為分段、洗牌和拼接 (S3) 的簡單即插即用機制，旨在改善現有模型的時間序列表示學習。S3 通過從原始序列創建非重疊段並以對手頭任務最優化的學習方式對它們進行洗牌來工作。然後，它將洗牌的段重新附接在一起，並與原始輸入執行學習加權和，以捕獲新洗牌的序列和原始序列。S3 是模組化的，可以堆疊以創建不同程度的粒度，並且可以添加到許多形式的神經架構中，包括 CNN 或 Transformer，而計算開銷可以忽略不計。通過對幾個數據集和最先進的基線進行廣泛的實驗，我們表明整合 S3 可以顯著改善時間序列分類和預測任務，在某些數據集上的效能提升高達 68%。我們還表明，與原始基線相比，S3 使學習更穩定，具有更平滑的訓練損失曲線和損失狀況。程式碼可在 https://github.com/shivam-grover/S3-TimeSeries 取得。", "author": "Shivam Grover et.al.", "authors": "Shivam Grover, Amin Jalali, Ali Etemad", "id": "2405.20082v1", "paper_url": "http://arxiv.org/abs/2405.20082v1", "repo": "null"}}