{"2501.04928": {"publish_time": "2025-01-09", "title": "Image2CADSeq: Computer-Aided Design Sequence and Knowledge Inference from Product Images", "paper_summary": "Computer-aided design (CAD) tools empower designers to design and modify 3D\nmodels through a series of CAD operations, commonly referred to as a CAD\nsequence. In scenarios where digital CAD files are not accessible, reverse\nengineering (RE) has been used to reconstruct 3D CAD models. Recent advances\nhave seen the rise of data-driven approaches for RE, with a primary focus on\nconverting 3D data, such as point clouds, into 3D models in boundary\nrepresentation (B-rep) format. However, obtaining 3D data poses significant\nchallenges, and B-rep models do not reveal knowledge about the 3D modeling\nprocess of designs. To this end, our research introduces a novel data-driven\napproach with an Image2CADSeq neural network model. This model aims to reverse\nengineer CAD models by processing images as input and generating CAD sequences.\nThese sequences can then be translated into B-rep models using a solid modeling\nkernel. Unlike B-rep models, CAD sequences offer enhanced flexibility to modify\nindividual steps of model creation, providing a deeper understanding of the\nconstruction process of CAD models. To quantitatively and rigorously evaluate\nthe predictive performance of the Image2CADSeq model, we have developed a\nmulti-level evaluation framework for model assessment. The model was trained on\na specially synthesized dataset, and various network architectures were\nexplored to optimize the performance. The experimental and validation results\nshow great potential for the model in generating CAD sequences from 2D image\ndata.", "paper_summary_zh": "<paragraph>電腦輔助設計 (CAD) 工具讓設計師能夠透過一系列的 CAD 作業（通常稱為 CAD 順序）來設計和修改 3D 模型。在無法取得數位 CAD 檔案的情況下，逆向工程 (RE) 已被用於重建 3D CAD 模型。最近的進展已看到資料驅動方法在 RE 中的崛起，主要專注於將 3D 資料（例如點雲）轉換成邊界表示 (B-rep) 格式的 3D 模型。然而，取得 3D 資料會造成顯著的挑戰，而且 B-rep 模型並未揭露關於設計的 3D 建模程序的知識。為此，我們的研究引進了一種新穎的資料驅動方法，並採用 Image2CADSeq 神經網路模型。此模型旨在透過處理影像作為輸入和產生 CAD 順序來逆向工程 CAD 模型。這些順序接著可以使用實體建模核心轉換成 B-rep 模型。與 B-rep 模型不同，CAD 順序提供增強的彈性來修改模型建立的個別步驟，提供對 CAD 模型建構程序的更深入理解。為了量化且嚴謹地評估 Image2CADSeq 模型的預測效能，我們已開發一個多層級評估架構用於模型評估。此模型是根據特別合成的資料集進行訓練，並探索了各種網路架構以最佳化效能。實驗和驗證結果顯示此模型在從 2D 影像資料產生 CAD 順序方面具有極大的潛力。</paragraph>", "author": "Xingang Li et.al.", "authors": "Xingang Li, Zhenghui Sha", "id": "2501.04928v1", "paper_url": "http://arxiv.org/abs/2501.04928v1", "repo": "null"}}