{"2406.03441": {"publish_time": "2024-06-05", "title": "Cycles of Thought: Measuring LLM Confidence through Stable Explanations", "paper_summary": "In many high-risk machine learning applications it is essential for a model\nto indicate when it is uncertain about a prediction. While large language\nmodels (LLMs) can reach and even surpass human-level accuracy on a variety of\nbenchmarks, their overconfidence in incorrect responses is still a\nwell-documented failure mode. Traditional methods for ML uncertainty\nquantification can be difficult to directly adapt to LLMs due to the\ncomputational cost of implementation and closed-source nature of many models. A\nvariety of black-box methods have recently been proposed, but these often rely\non heuristics such as self-verbalized confidence. We instead propose a\nframework for measuring an LLM's uncertainty with respect to the distribution\nof generated explanations for an answer. While utilizing explanations is not a\nnew idea in and of itself, by interpreting each possible model+explanation pair\nas a test-time classifier we can calculate a posterior answer distribution over\nthe most likely of these classifiers. We demonstrate how a specific instance of\nthis framework using explanation entailment as our classifier likelihood\nimproves confidence score metrics (in particular AURC and AUROC) over baselines\nacross five different datasets. We believe these results indicate that our\nframework is both a well-principled and effective way of quantifying\nuncertainty in LLMs.", "paper_summary_zh": "在許多高風險機器學習應用中，模型在對預測不確定時，指示其不確定性至關重要。儘管大型語言模型 (LLM) 在各種基準測試中可以達到甚至超過人類的準確度，但它們對不正確回應的過度自信仍然是一個有據可查的失敗模式。傳統的 ML 不確定性量化方法由於實作的計算成本和許多模型的封閉原始碼特性，可能難以直接調整為 LLM。最近提出了各種黑盒方法，但這些方法通常依賴於啟發法，例如自我表達的信心。我們改為提出一個框架，用來針對答案的產生解釋分布來衡量 LLM 的不確定性。儘管利用解釋本身並不是一個新想法，但透過將每個可能的模型 + 解釋配對解釋為測試時間分類器，我們可以計算出這些分類器中最可能的分類器上的後驗答案分布。我們展示了這個框架的一個特定實例，使用解釋蘊涵作為我們的分類器可能性，如何改善五個不同資料集上基線的信心分數指標（特別是 AURC 和 AUROC）。我們相信這些結果表明，我們的框架是一種基於良好原則且有效的方法，用來量化 LLM 中的不確定性。", "author": "Evan Becker et.al.", "authors": "Evan Becker, Stefano Soatto", "id": "2406.03441v1", "paper_url": "http://arxiv.org/abs/2406.03441v1", "repo": "null"}}