{"2404.17000": {"publish_time": "2024-04-25", "title": "Evaluating Class Membership Relations in Knowledge Graphs using Large Language Models", "paper_summary": "A backbone of knowledge graphs are their class membership relations, which\nassign entities to a given class. As part of the knowledge engineering process,\nwe propose a new method for evaluating the quality of these relations by\nprocessing descriptions of a given entity and class using a zero-shot\nchain-of-thought classifier that uses a natural language intensional definition\nof a class. We evaluate the method using two publicly available knowledge\ngraphs, Wikidata and CaLiGraph, and 7 large language models. Using the\ngpt-4-0125-preview large language model, the method's classification\nperformance achieves a macro-averaged F1-score of 0.830 on data from Wikidata\nand 0.893 on data from CaLiGraph. Moreover, a manual analysis of the\nclassification errors shows that 40.9% of errors were due to the knowledge\ngraphs, with 16.0% due to missing relations and 24.9% due to incorrectly\nasserted relations. These results show how large language models can assist\nknowledge engineers in the process of knowledge graph refinement. The code and\ndata are available on Github.", "paper_summary_zh": "知識圖譜的骨幹是其類別成員關係，它將實體分配給特定類別。作為知識工程流程的一部分，我們提出了一種新的方法來評估這些關係的品質，方法是使用零次學習思維鏈分類器處理給定實體和類別的描述，該分類器使用類別的自然語言內涵定義。我們使用兩個公開可用的知識圖譜 Wikidata 和 CaLiGraph 以及 7 個大型語言模型來評估該方法。使用 gpt-4-0125-preview 大型語言模型，該方法的分類性能在 Wikidata 的資料上達到 0.830 的巨觀平均 F1 分數，在 CaLiGraph 的資料上達到 0.893。此外，對分類錯誤的手動分析顯示，40.9% 的錯誤是知識圖譜造成的，其中 16.0% 是由於關係遺失，24.9% 是由於錯誤斷言的關係。這些結果顯示了大型語言模型如何協助知識工程師進行知識圖譜優化的過程。程式碼和資料可在 Github 上取得。", "author": "Bradley P. Allen et.al.", "authors": "Bradley P. Allen, Paul T. Groth", "id": "2404.17000v1", "paper_url": "http://arxiv.org/abs/2404.17000v1", "repo": "https://github.com/bradleypallen/evaluating-kg-class-memberships-using-llms"}}