{"2405.10391": {"publish_time": "2024-05-16", "title": "Vision Transformers for End-to-End Vision-Based Quadrotor Obstacle Avoidance", "paper_summary": "We demonstrate the capabilities of an attention-based end-to-end approach for\nhigh-speed quadrotor obstacle avoidance in dense, cluttered environments, with\ncomparison to various state-of-the-art architectures. Quadrotor unmanned aerial\nvehicles (UAVs) have tremendous maneuverability when flown fast; however, as\nflight speed increases, traditional vision-based navigation via independent\nmapping, planning, and control modules breaks down due to increased sensor\nnoise, compounding errors, and increased processing latency. Thus,\nlearning-based, end-to-end planning and control networks have shown to be\neffective for online control of these fast robots through cluttered\nenvironments. We train and compare convolutional, U-Net, and recurrent\narchitectures against vision transformer models for depth-based end-to-end\ncontrol, in a photorealistic, high-physics-fidelity simulator as well as in\nhardware, and observe that the attention-based models are more effective as\nquadrotor speeds increase, while recurrent models with many layers provide\nsmoother commands at lower speeds. To the best of our knowledge, this is the\nfirst work to utilize vision transformers for end-to-end vision-based quadrotor\ncontrol.", "paper_summary_zh": "我們展示了基於注意力的端對端方法在密集、混亂環境中高速四旋翼障礙物避障的能力，並與各種最先進的架構進行了比較。四旋翼無人機 (UAV) 在快速飛行時具有極大的機動性；然而，隨著飛行速度的增加，由於傳感器噪聲增加、誤差累積和處理延遲增加，基於傳統視覺的導航通過獨立的映射、規劃和控制模塊會崩潰。因此，基於學習的端到端規劃和控制網路已被證明可以有效地對這些快速機器人在混亂的環境中進行線上控制。我們針對深度端到端控制訓練並比較了卷積、U-Net 和遞迴架構與視覺Transformer模型，在逼真的高物理保真度模擬器和硬體中，並觀察到基於注意力的模型在四旋翼速度增加時更有效，而具有多層的遞迴模型在較低速度下提供更平滑的指令。據我們所知，這是第一個利用視覺Transformer進行端到端基於視覺的四旋翼控制的工作。", "author": "Anish Bhattacharya et.al.", "authors": "Anish Bhattacharya, Nishanth Rao, Dhruv Parikh, Pratik Kunapuli, Nikolai Matni, Vijay Kumar", "id": "2405.10391v1", "paper_url": "http://arxiv.org/abs/2405.10391v1", "repo": "null"}}