{"2501.02702": {"publish_time": "2025-01-06", "title": "QuIM-RAG: Advancing Retrieval-Augmented Generation with Inverted Question Matching for Enhanced QA Performance", "paper_summary": "This work presents a novel architecture for building Retrieval-Augmented\nGeneration (RAG) systems to improve Question Answering (QA) tasks from a target\ncorpus. Large Language Models (LLMs) have revolutionized the analyzing and\ngeneration of human-like text. These models rely on pre-trained data and lack\nreal-time updates unless integrated with live data tools. RAG enhances LLMs by\nintegrating online resources and databases to generate contextually appropriate\nresponses. However, traditional RAG still encounters challenges like\ninformation dilution and hallucinations when handling vast amounts of data. Our\napproach addresses these challenges by converting corpora into a\ndomain-specific dataset and RAG architecture is constructed to generate\nresponses from the target document. We introduce QuIM-RAG (Question-to-question\nInverted Index Matching), a novel approach for the retrieval mechanism in our\nsystem. This strategy generates potential questions from document chunks and\nmatches these with user queries to identify the most relevant text chunks for\ngenerating accurate answers. We have implemented our RAG system on top of the\nopen-source Meta-LLaMA3-8B-instruct model by Meta Inc. that is available on\nHugging Face. We constructed a custom corpus of 500+ pages from a high-traffic\nwebsite accessed thousands of times daily for answering complex questions,\nalong with manually prepared ground truth QA for evaluation. We compared our\napproach with traditional RAG models using BERT-Score and RAGAS,\nstate-of-the-art metrics for evaluating LLM applications. Our evaluation\ndemonstrates that our approach outperforms traditional RAG architectures on\nboth metrics.", "paper_summary_zh": "本研究提出了一種新穎的架構，用於建構檢索增強生成 (RAG) 系統，以改善目標語料庫中的問答 (QA) 任務。大型語言模型 (LLM) 徹底改變了人類語言的分析和生成方式。這些模型依賴於預先訓練的資料，除非與即時資料工具整合，否則缺乏即時更新。RAG 透過整合線上資源和資料庫，增強 LLM，以產生符合脈絡的回應。然而，傳統的 RAG 在處理大量資料時仍會遇到資訊稀釋和幻覺等挑戰。我們的做法透過將語料庫轉換成特定領域的資料集來解決這些挑戰，並建構 RAG 架構，以從目標文件產生回應。我們引入了 QuIM-RAG（問題對問題反向索引比對），這是一種我們系統中檢索機制的創新方法。此策略從文件區塊中產生潛在問題，並將這些問題與使用者查詢進行比對，以找出最相關的文字區塊，用於產生準確的答案。我們已在 Meta Inc. 開源的 Meta-LLaMA3-8B-instruct 模型上實作我們的 RAG 系統，該模型可在 Hugging Face 上取得。我們從一個每日存取數千次的流量極高的網站建構了一個包含 500 多頁的客製化語料庫，用於回答複雜的問題，並手動準備了地面實況 QA 以進行評估。我們使用 BERT-Score 和 RAGAS（評估 LLM 應用程式的最新指標）將我們的方法與傳統的 RAG 模型進行比較。我們的評估證明，我們的做法在兩個指標上都優於傳統的 RAG 架構。", "author": "Binita Saha et.al.", "authors": "Binita Saha, Utsha Saha, Muhammad Zubair Malik", "id": "2501.02702v1", "paper_url": "http://arxiv.org/abs/2501.02702v1", "repo": "null"}}