{"2405.20835": {"publish_time": "2024-05-31", "title": "Outliers and Calibration Sets have Diminishing Effect on Quantization of Modern LLMs", "paper_summary": "Post-Training Quantization (PTQ) enhances the efficiency of Large Language\nModels (LLMs) by enabling faster operation and compatibility with more\naccessible hardware through reduced memory usage, at the cost of small\nperformance drops. We explore the role of calibration sets in PTQ, specifically\ntheir effect on hidden activations in various notable open-source LLMs.\nCalibration sets are crucial for evaluating activation magnitudes and\nidentifying outliers, which can distort the quantization range and negatively\nimpact performance. Our analysis reveals a marked contrast in quantization\neffectiveness across models. The older OPT model, upon which much of the\nquantization literature is based, shows significant performance deterioration\nand high susceptibility to outliers with varying calibration sets. In contrast,\nnewer models like Llama-2 7B, Llama-3 8B, Command-R 35B, and Mistral 7B\ndemonstrate strong robustness, with Mistral 7B showing near-immunity to\noutliers and stable activations. These findings suggest a shift in PTQ\nstrategies might be needed. As advancements in pre-training methods reduce the\nrelevance of outliers, there is an emerging need to reassess the fundamentals\nof current quantization literature. The emphasis should pivot towards\noptimizing inference speed, rather than primarily focusing on outlier\npreservation, to align with the evolving characteristics of state-of-the-art\nLLMs.", "paper_summary_zh": "訓練後量化 (PTQ) 透過減少記憶體用量來提升大型語言模型 (LLM) 的效率，讓運作速度更快，並與更容易取得的硬體相容，但代價是效能略微下降。我們探討校正組在 PTQ 中的角色，特別是它們對各種知名開源 LLM 中隱藏激活的影響。校正組對於評估激活幅度和找出異常值至關重要，因為異常值會扭曲量化範圍並對效能產生負面影響。我們的分析顯示，不同模型的量化效果有顯著差異。許多量化文獻所依據的較舊 OPT 模型，在使用不同的校正組時，效能會顯著下降，且對異常值高度敏感。相比之下，Llama-2 7B、Llama-3 8B、Command-R 35B 和 Mistral 7B 等較新的模型表現出強大的穩健性，其中 Mistral 7B 對異常值幾乎免疫，且激活穩定。這些發現表明，PTQ 策略可能需要改變。隨著預訓練方法的進步降低異常值的重要性，重新評估現有量化文獻的基本原理已成當務之急。重點應轉向最佳化推論速度，而不是主要關注異常值保留，以符合最先進 LLM 的演化特性。", "author": "Davide Paglieri et.al.", "authors": "Davide Paglieri, Saurabh Dash, Tim Rocktäschel, Jack Parker-Holder", "id": "2405.20835v2", "paper_url": "http://arxiv.org/abs/2405.20835v2", "repo": "null"}}