{"2408.10111": {"publish_time": "2024-08-19", "title": "PLUTUS: A Well Pre-trained Large Unified Transformer can Unveil Financial Time Series Regularities", "paper_summary": "Financial time series modeling is crucial for understanding and predicting\nmarket behaviors but faces challenges such as non-linearity, non-stationarity,\nand high noise levels. Traditional models struggle to capture complex patterns\ndue to these issues, compounded by limitations in computational resources and\nmodel capacity. Inspired by the success of large language models in NLP, we\nintroduce $\\textbf{PLUTUS}$, a $\\textbf{P}$re-trained $\\textbf{L}$arge\n$\\textbf{U}$nified $\\textbf{T}$ransformer-based model that $\\textbf{U}$nveils\nregularities in financial time $\\textbf{S}$eries. PLUTUS uses an invertible\nembedding module with contrastive learning and autoencoder techniques to create\nan approximate one-to-one mapping between raw data and patch embeddings.\nTimeFormer, an attention based architecture, forms the core of PLUTUS,\neffectively modeling high-noise time series. We incorporate a novel attention\nmechanisms to capture features across both variable and temporal dimensions.\nPLUTUS is pre-trained on an unprecedented dataset of 100 billion observations,\ndesigned to thrive in noisy financial environments. To our knowledge, PLUTUS is\nthe first open-source, large-scale, pre-trained financial time series model\nwith over one billion parameters. It achieves state-of-the-art performance in\nvarious tasks, demonstrating strong transferability and establishing a robust\nfoundational model for finance. Our research provides technical guidance for\npre-training financial time series data, setting a new standard in the field.", "paper_summary_zh": "<paragraph>財務時間序列建模對於理解和預測市場行為至關重要，但面臨非線性、非平穩和高雜訊等級等挑戰。由於這些問題，傳統模型難以捕捉複雜模式，並受到計算資源和模型容量的限制。受大型語言模型在 NLP 中成功的啟發，我們引入了 $\\textbf{PLUTUS}$，一個 $\\textbf{P}$re-trained $\\textbf{L}$arge $\\textbf{U}$nified $\\textbf{T}$ransformer-based 模型，它 $\\textbf{U}$nveils 財務時間 $\\textbf{S}$eries 中的規律性。PLUTUS 使用可逆嵌入模組，結合對比學習和自動編碼器技術，在原始資料和貼片嵌入之間建立近似的一對一對應。TimeFormer 是一個基於注意力的架構，構成 PLUTUS 的核心，有效地對高雜訊時間序列進行建模。我們納入了一種新穎的注意力機制，以捕捉變數和時間維度中的特徵。PLUTUS 在一個前所未有的 1000 億個觀測值的資料集上進行預訓練，旨在在嘈雜的金融環境中蓬勃發展。據我們所知，PLUTUS 是第一個開源、大規模、預訓練的財務時間序列模型，擁有超過 10 億個參數。它在各種任務中實現了最先進的效能，展示了強大的可轉移性，並為金融建立了一個強大的基礎模型。我們的研究為預訓練財務時間序列資料提供了技術指導，為該領域樹立了新的標準。</paragraph>", "author": "Yuanjian Xu et.al.", "authors": "Yuanjian Xu, Anxian Liu, Jianing Hao, Zhenzhuo Li, Shichang Meng, Guang Zhang", "id": "2408.10111v2", "paper_url": "http://arxiv.org/abs/2408.10111v2", "repo": "null"}}