{"2408.02919": {"publish_time": "2024-08-06", "title": "Data Checklist: On Unit-Testing Datasets with Usable Information", "paper_summary": "Model checklists (Ribeiro et al., 2020) have emerged as a useful tool for\nunderstanding the behavior of LLMs, analogous to unit-testing in software\nengineering. However, despite datasets being a key determinant of model\nbehavior, evaluating datasets, e.g., for the existence of annotation artifacts,\nis largely done ad hoc, once a problem in model behavior has already been found\ndownstream. In this work, we take a more principled approach to unit-testing\ndatasets by proposing a taxonomy based on the V-information literature. We call\na collection of such unit tests a data checklist. Using a checklist, not only\nare we able to recover known artifacts in well-known datasets such as SNLI, but\nwe also discover previously unknown artifacts in preference datasets for LLM\nalignment. Data checklists further enable a new kind of data filtering, which\nwe use to improve the efficacy and data efficiency of preference alignment.", "paper_summary_zh": "模型核對清單（Ribeiro 等人，2020 年）已成為了解 LLM 行為的有用工具，類似於軟體工程中的單元測試。然而，儘管資料集是模型行為的主要決定因素，但評估資料集（例如，是否存在標註人工製品）通常是臨時進行的，一旦發現模型行為中的問題，就會在後續流程中發現。在這項工作中，我們採用基於 V 型資訊文獻的分類法，對單元測試資料集採取更具原則性的方法。我們稱此類單元測試的集合為資料核對清單。透過使用核對清單，我們不僅能夠在 SNLI 等知名資料集中恢復已知的的人工製品，還能發現 LLM 對齊偏好資料集中先前未知的人工製品。資料核對清單進一步啟用了一種新的資料過濾，我們使用它來改善偏好對齊的效能和資料效率。", "author": "Heidi C. Zhang et.al.", "authors": "Heidi C. Zhang, Shabnam Behzad, Kawin Ethayarajh, Dan Jurafsky", "id": "2408.02919v1", "paper_url": "http://arxiv.org/abs/2408.02919v1", "repo": "null"}}