{"2406.04271": {"publish_time": "2024-06-06", "title": "Buffer of Thoughts: Thought-Augmented Reasoning with Large Language Models", "paper_summary": "We introduce Buffer of Thoughts (BoT), a novel and versatile\nthought-augmented reasoning approach for enhancing accuracy, efficiency and\nrobustness of large language models (LLMs). Specifically, we propose\nmeta-buffer to store a series of informative high-level thoughts, namely\nthought-template, distilled from the problem-solving processes across various\ntasks. Then for each problem, we retrieve a relevant thought-template and\nadaptively instantiate it with specific reasoning structures to conduct\nefficient reasoning. To guarantee the scalability and stability, we further\npropose buffer-manager to dynamically update the meta-buffer, thus enhancing\nthe capacity of meta-buffer as more tasks are solved. We conduct extensive\nexperiments on 10 challenging reasoning-intensive tasks, and achieve\nsignificant performance improvements over previous SOTA methods: 11% on Game of\n24, 20% on Geometric Shapes and 51% on Checkmate-in-One. Further analysis\ndemonstrate the superior generalization ability and model robustness of our\nBoT, while requiring only 12% of the cost of multi-query prompting methods\n(e.g., tree/graph of thoughts) on average. Notably, we find that our\nLlama3-8B+BoT has the potential to surpass Llama3-70B model. Our project is\navailable at: https://github.com/YangLing0818/buffer-of-thought-llm", "paper_summary_zh": "<paragraph>我們介紹了思想緩衝區 (BoT)，這是一種新穎且通用的思想增強推理方法，用於提升大型語言模型 (LLM) 的準確性、效率和穩健性。具體來說，我們提出元緩衝區，用於儲存一系列有意義的高階思想，即思想範本，從各種任務的解決問題過程中提煉出來。然後，對於每個問題，我們會擷取一個相關的思想範本，並以特定的推理結構自適應地實例化它，以進行有效率的推理。為了保證可擴充性和穩定性，我們進一步提出了緩衝區管理員，用於動態更新元緩衝區，從而隨著更多任務的解決而提升元緩衝區的容量。我們在 10 項具有挑戰性的推理密集型任務上進行了廣泛的實驗，並且相較於先前的 SOTA 方法取得了顯著的效能提升：24 的遊戲提升了 11%，幾何形狀提升了 20%，一招將死提升了 51%。進一步的分析證明了我們 BoT 的優異泛化能力和模型穩健性，同時平均只需要多查詢提示方法（例如思想樹/圖）成本的 12%。值得注意的是，我們發現我們的 Llama3-8B+BoT 有可能超越 Llama3-70B 模型。我們的專案可於以下網址取得：https://github.com/YangLing0818/buffer-of-thought-llm</paragraph>", "author": "Ling Yang et.al.", "authors": "Ling Yang, Zhaochen Yu, Tianjun Zhang, Shiyi Cao, Minkai Xu, Wentao Zhang, Joseph E. Gonzalez, Bin Cui", "id": "2406.04271v1", "paper_url": "http://arxiv.org/abs/2406.04271v1", "repo": "https://github.com/yangling0818/buffer-of-thought-llm"}}