{"2411.08992": {"publish_time": "2024-11-13", "title": "IDCIA: Immunocytochemistry Dataset for Cellular Image Analysis", "paper_summary": "We present a new annotated microscopic cellular image dataset to improve the\neffectiveness of machine learning methods for cellular image analysis. Cell\ncounting is an important step in cell analysis. Typically, domain experts\nmanually count cells in a microscopic image. Automated cell counting can\npotentially eliminate this tedious, time-consuming process. However, a good,\nlabeled dataset is required for training an accurate machine learning model.\nOur dataset includes microscopic images of cells, and for each image, the cell\ncount and the location of individual cells. The data were collected as part of\nan ongoing study investigating the potential of electrical stimulation to\nmodulate stem cell differentiation and possible applications for neural repair.\nCompared to existing publicly available datasets, our dataset has more images\nof cells stained with more variety of antibodies (protein components of immune\nresponses against invaders) typically used for cell analysis. The experimental\nresults on this dataset indicate that none of the five existing models under\nthis study are able to achieve sufficiently accurate count to replace the\nmanual methods. The dataset is available at\nhttps://figshare.com/articles/dataset/Dataset/21970604.", "paper_summary_zh": "<paragraph>我們提供一個新的註解式微觀細胞影像資料集，以提高機器學習方法在細胞影像分析方面的效能。細胞計數是細胞分析中的一項重要步驟。通常，領域專家會手動計算顯微鏡影像中的細胞。自動化細胞計數有可能消除這個繁瑣且耗時的程序。然而，訓練一個準確的機器學習模型需要一個良好且標註的資料集。我們的資料集包含細胞的顯微鏡影像，並且對於每個影像，會標註細胞計數和個別細胞的位置。這些資料是作為一項正在進行的研究的一部分收集的，該研究調查了電刺激調節幹細胞分化和神經修復的潛在應用。與現有公開可用的資料集相比，我們的資料集有更多使用各種抗體（針對入侵者的免疫反應的蛋白質成分）染色細胞的影像，這些抗體通常用於細胞分析。此資料集的實驗結果表明，本研究中的五個現有模型均無法達到足夠準確的計數來取代手動方法。該資料集可在 https://figshare.com/articles/dataset/Dataset/21970604 取得。</paragraph>", "author": "Abdurahman Ali Mohammed et.al.", "authors": "Abdurahman Ali Mohammed, Catherine Fonder, Donald S. Sakaguchi, Wallapak Tavanapong, Surya K. Mallapragada, Azeez Idris", "id": "2411.08992v1", "paper_url": "http://arxiv.org/abs/2411.08992v1", "repo": "https://github.com/isu-nrt-d4/cell-analysis"}}