{"2407.13998": {"publish_time": "2024-07-19", "title": "RAG-QA Arena: Evaluating Domain Robustness for Long-form Retrieval Augmented Question Answering", "paper_summary": "Question answering based on retrieval augmented generation (RAG-QA) is an\nimportant research topic in NLP and has a wide range of real-world\napplications. However, most existing datasets for this task are either\nconstructed using a single source corpus or consist of short extractive\nanswers, which fall short of evaluating large language model (LLM) based RAG-QA\nsystems on cross-domain generalization. To address these limitations, we create\nLong-form RobustQA (LFRQA), a new dataset comprising human-written long-form\nanswers that integrate short extractive answers from multiple documents into a\nsingle, coherent narrative, covering 26K queries and large corpora across seven\ndifferent domains. We further propose RAG-QA Arena by directly comparing\nmodel-generated answers against LFRQA's answers using LLMs as evaluators. We\nshow via extensive experiments that RAG-QA Arena and human judgments on answer\nquality are highly correlated. Moreover, only 41.3% of the most competitive\nLLM's answers are preferred to LFRQA's answers, demonstrating RAG-QA Arena as a\nchallenging evaluation platform for future research.", "paper_summary_zh": "基於擷取擴充生成（RAG-QA）的問題解答是 NLP 中一個重要的研究主題，並有廣泛的真實世界應用。然而，大多數現有的資料集不是使用單一來源語料庫建構，就是由簡短的抽取式答案組成，這無法評估基於大型語言模型（LLM）的 RAG-QA 系統在跨網域概括上的表現。為了解決這些限制，我們建立了長篇 RobustQA（LFRQA），一個新的資料集，包含人工撰寫的長篇答案，將來自多個文件的簡短抽取式答案整合到一個單一的連貫敘述中，涵蓋 26K 個查詢和橫跨七個不同網域的大型語料庫。我們進一步提出 RAG-QA Arena，透過使用 LLM 作為評估器，直接比較模型產生的答案和 LFRQA 的答案。我們透過廣泛的實驗證明，RAG-QA Arena 和人類對答案品質的判斷高度相關。此外，只有 41.3% 最具競爭力的 LLM 答案優於 LFRQA 的答案，這證明了 RAG-QA Arena 是未來研究具有挑戰性的評估平台。", "author": "Rujun Han et.al.", "authors": "Rujun Han, Yuhao Zhang, Peng Qi, Yumo Xu, Jenyuan Wang, Lan Liu, William Yang Wang, Bonan Min, Vittorio Castelli", "id": "2407.13998v1", "paper_url": "http://arxiv.org/abs/2407.13998v1", "repo": "https://github.com/awslabs/rag-qa-arena"}}