{"2406.17659": {"publish_time": "2024-06-25", "title": "DKPROMPT: Domain Knowledge Prompting Vision-Language Models for Open-World Planning", "paper_summary": "Vision-language models (VLMs) have been applied to robot task planning\nproblems, where the robot receives a task in natural language and generates\nplans based on visual inputs. While current VLMs have demonstrated strong\nvision-language understanding capabilities, their performance is still far from\nbeing satisfactory in planning tasks. At the same time, although classical task\nplanners, such as PDDL-based, are strong in planning for long-horizon tasks,\nthey do not work well in open worlds where unforeseen situations are common. In\nthis paper, we propose a novel task planning and execution framework, called\nDKPROMPT, which automates VLM prompting using domain knowledge in PDDL for\nclassical planning in open worlds. Results from quantitative experiments show\nthat DKPROMPT outperforms classical planning, pure VLM-based and a few other\ncompetitive baselines in task completion rate.", "paper_summary_zh": "視覺語言模型 (VLM) 已應用於機器人任務規劃問題，其中機器人會以自然語言接收任務，並根據視覺輸入產生計畫。雖然目前的 VLM 已展現出強大的視覺語言理解能力，但其在規劃任務中的表現仍遠未令人滿意。同時，儘管基於 PDDL 等的傳統任務規劃器在規劃長期任務方面很強大，但在不可預見的情況很常見的開放世界中，它們無法發揮作用。在本文中，我們提出一個名為 DKPROMPT 的新任務規劃和執行架構，它使用 PDDL 中的領域知識自動化 VLM 提示，以進行開放世界中的傳統規劃。定量實驗結果顯示，DKPROMPT 在任務完成率方面優於傳統規劃、純粹基於 VLM 的規劃以及其他一些具有競爭力的基線。", "author": "Xiaohan Zhang et.al.", "authors": "Xiaohan Zhang, Zainab Altaweel, Yohei Hayamizu, Yan Ding, Saeid Amiri, Hao Yang, Andy Kaminski, Chad Esselink, Shiqi Zhang", "id": "2406.17659v1", "paper_url": "http://arxiv.org/abs/2406.17659v1", "repo": "null"}}