{"2503.04153": {"publish_time": "2025-03-06", "title": "KidneyTalk-open: No-code Deployment of a Private Large Language Model with Medical Documentation-Enhanced Knowledge Database for Kidney Disease", "paper_summary": "Privacy-preserving medical decision support for kidney disease requires\nlocalized deployment of large language models (LLMs) while maintaining clinical\nreasoning capabilities. Current solutions face three challenges: 1) Cloud-based\nLLMs pose data security risks; 2) Local model deployment demands technical\nexpertise; 3) General LLMs lack mechanisms to integrate medical knowledge.\nRetrieval-augmented systems also struggle with medical document processing and\nclinical usability. We developed KidneyTalk-open, a desktop system integrating\nthree technical components: 1) No-code deployment of state-of-the-art (SOTA)\nopen-source LLMs (such as DeepSeek-r1, Qwen2.5) via local inference engine; 2)\nMedical document processing pipeline combining context-aware chunking and\nintelligent filtering; 3) Adaptive Retrieval and Augmentation Pipeline (AddRep)\nemploying agents collaboration for improving the recall rate of medical\ndocuments. A graphical interface was designed to enable clinicians to manage\nmedical documents and conduct AI-powered consultations without technical\nexpertise. Experimental validation on 1,455 challenging nephrology exam\nquestions demonstrates AddRep's effectiveness: achieving 29.1% accuracy (+8.1%\nover baseline) with intelligent knowledge integration, while maintaining\nrobustness through 4.9% rejection rate to suppress hallucinations. Comparative\ncase studies with the mainstream products (AnythingLLM, Chatbox, GPT4ALL)\ndemonstrate KidneyTalk-open's superior performance in real clinical query.\nKidneyTalk-open represents the first no-code medical LLM system enabling secure\ndocumentation-enhanced medical Q&A on desktop. Its designs establishes a new\nframework for privacy-sensitive clinical AI applications. The system\nsignificantly lowers technical barriers while improving evidence traceability,\nenabling more medical staff or patients to use SOTA open-source LLMs\nconveniently.", "paper_summary_zh": "<paragraph>保護隱私的腎臟疾病醫療決策支援系統需要在維持臨床推理能力的同時，將大型語言模型 (LLM) 部署到本地。目前的解決方案面臨三大挑戰：1) 基於雲端的 LLM 存在數據安全風險；2) 本地模型部署需要專業技術；3) 通用 LLM 缺乏整合醫學知識的機制。基於檢索增強的系統在處理醫療文件和臨床可用性方面也存在困難。我們開發了 KidneyTalk-open，一個整合了三個技術組件的桌面系統：1) 通過本地推理引擎，無程式碼部署最先進的 (SOTA) 開源 LLM（例如 DeepSeek-r1、Qwen2.5）；2) 結合上下文感知分塊和智能過濾的醫療文件處理流程；3) 採用代理協作以提高醫療文件召回率的自適應檢索和增強流程 (AddRep)。設計了一個圖形界面，使臨床醫生能夠在沒有專業技術的情況下管理醫療文件並進行 AI 驅動的會診。在 1,455 個具有挑戰性的腎臟科考試題目上的實驗驗證證明了 AddRep 的有效性：通過智能知識整合，準確率達到 29.1%（比基準高 8.1%），同時通過 4.9% 的拒絕率保持穩健性以抑制幻覺。與主流產品（AnythingLLM、Chatbox、GPT4ALL）的比較案例研究表明，KidneyTalk-open 在真實臨床查詢中表現更為出色。KidneyTalk-open 代表了第一個無程式碼醫療 LLM 系統，可在桌面上實現安全的、文件增強的醫療問答。其設計為注重隱私的臨床 AI 應用程式建立了一個新的框架。該系統顯著降低了技術壁壘，同時提高了證據可追溯性，使更多醫務人員或患者能夠方便地使用最先進的開源 LLM。</paragraph>\n", "author": "Yongchao Long et.al.", "authors": "Yongchao Long, Chao Yang, Gongzheng Tang, Jinwei Wang, Zhun Sui, Yuxi Zhou, Shenda Hong, Luxia Zhang", "id": "2503.04153v1", "paper_url": "http://arxiv.org/abs/2503.04153v1", "repo": "null"}}