{"2406.19234": {"publish_time": "2024-06-27", "title": "Seeing Is Believing: Black-Box Membership Inference Attacks Against Retrieval Augmented Generation", "paper_summary": "Retrieval-Augmented Generation (RAG) is a state-of-the-art technique that\nenhances Large Language Models (LLMs) by retrieving relevant knowledge from an\nexternal, non-parametric database. This approach aims to mitigate common LLM\nissues such as hallucinations and outdated knowledge. Although existing\nresearch has demonstrated security and privacy vulnerabilities within RAG\nsystems, making them susceptible to attacks like jailbreaks and prompt\ninjections, the security of the RAG system's external databases remains largely\nunderexplored. In this paper, we employ Membership Inference Attacks (MIA) to\ndetermine whether a sample is part of the knowledge database of a RAG system,\nusing only black-box API access. Our core hypothesis posits that if a sample is\na member, it will exhibit significant similarity to the text generated by the\nRAG system. To test this, we compute the cosine similarity and the model's\nperplexity to establish a membership score, thereby building robust features.\nWe then introduce two novel attack strategies: a Threshold-based Attack and a\nMachine Learning-based Attack, designed to accurately identify membership.\nExperimental validation of our methods has achieved a ROC AUC of 82%.", "paper_summary_zh": "檢索增強生成（RAG）是一種先進技術，它透過從外部的非參數資料庫中檢索相關知識，來增強大型語言模型（LLM）。此方法旨在減輕常見的 LLM 問題，例如幻覺和過時的知識。儘管現有的研究已證明 RAG 系統存在安全性和隱私漏洞，使其容易受到越獄和提示注入等攻擊，但 RAG 系統外部資料庫的安全性在很大程度上仍未得到探索。在本文中，我們採用成員推論攻擊（MIA）來確定範例是否為 RAG 系統知識資料庫的一部分，僅使用黑盒 API 存取。我們的核心假設是，如果範例是成員，它將與 RAG 系統產生的文字有顯著的相似性。為了測試這一點，我們計算餘弦相似性和模型的困惑度，以建立成員分數，從而建立健全的特徵。然後，我們介紹兩種新穎的攻擊策略：基於閾值的攻擊和基於機器學習的攻擊，旨在準確識別成員。我們的方法的實驗驗證已達到 82% 的 ROC AUC。", "author": "Yuying Li et.al.", "authors": "Yuying Li, Gaoyang Liu, Yang Yang, Chen Wang", "id": "2406.19234v1", "paper_url": "http://arxiv.org/abs/2406.19234v1", "repo": "null"}}