{"2412.18495": {"publish_time": "2024-12-24", "title": "How \"Real\" is Your Real-Time Simultaneous Speech-to-Text Translation System?", "paper_summary": "Simultaneous speech-to-text translation (SimulST) translates source-language\nspeech into target-language text concurrently with the speaker's speech,\nensuring low latency for better user comprehension. Despite its intended\napplication to unbounded speech, most research has focused on human\npre-segmented speech, simplifying the task and overlooking significant\nchallenges. This narrow focus, coupled with widespread terminological\ninconsistencies, is limiting the applicability of research outcomes to\nreal-world applications, ultimately hindering progress in the field. Our\nextensive literature review of 110 papers not only reveals these critical\nissues in current research but also serves as the foundation for our key\ncontributions. We 1) define the steps and core components of a SimulST system,\nproposing a standardized terminology and taxonomy; 2) conduct a thorough\nanalysis of community trends, and 3) offer concrete recommendations and future\ndirections to bridge the gaps in existing literature, from evaluation\nframeworks to system architectures, for advancing the field towards more\nrealistic and effective SimulST solutions.", "paper_summary_zh": "同聲傳譯（SimulST）在講者說話的同時，將源語言的語音轉換為目標語言的文字，確保低延遲以利使用者更佳地理解。儘管其預期應用於無限制的語音，但多數研究都專注於人類預先分段的語音，簡化了任務並忽略了重要的挑戰。這種狹隘的焦點，加上廣泛的術語不一致，限制了研究成果在現實世界中的應用，最終阻礙了該領域的進展。我們對 110 篇論文進行的廣泛文獻回顧，不僅揭示了當前研究中的這些關鍵問題，也作為我們關鍵貢獻的基礎。我們 1) 定義 SimulST 系統的步驟和核心組成部分，提出標準化術語和分類法；2) 徹底分析社群趨勢，以及 3) 提供具體建議和未來方向，以彌合現有文獻中的差距，從評估架構到系統架構，以推動該領域朝向更實際且有效的 SimulST 解決方案。", "author": "Sara Papi et.al.", "authors": "Sara Papi, Peter Polak, Ondřej Bojar, Dominik Macháček", "id": "2412.18495v1", "paper_url": "http://arxiv.org/abs/2412.18495v1", "repo": "null"}}