{"2408.07524": {"publish_time": "2024-08-14", "title": "Fast Inference for Probabilistic Answer Set Programs via the Residual Program", "paper_summary": "When we want to compute the probability of a query from a Probabilistic\nAnswer Set Program, some parts of a program may not influence the probability\nof a query, but they impact on the size of the grounding. Identifying and\nremoving them is crucial to speed up the computation. Algorithms for SLG\nresolution offer the possibility of returning the residual program which can be\nused for computing answer sets for normal programs that do have a total\nwell-founded model. The residual program does not contain the parts of the\nprogram that do not influence the probability. In this paper, we propose to\nexploit the residual program for performing inference. Empirical results on\ngraph datasets show that the approach leads to significantly faster inference.", "paper_summary_zh": "当我们想要从概率性答案集程序计算查询的概率时，程序的某些部分可能不会影响查询的概率，但它们会影响基础的大小。识别并移除它们对于加快计算至关重要。SLG 分辨率算法提供了返回剩余程序的可能性，该程序可用于计算具有完全良好基础模型的普通程序的答案集。剩余程序不包含不影响概率的程序部分。在本文中，我们建议利用剩余程序来执行推理。在图数据集上的经验结果表明，该方法可以显著加快推理。", "author": "Damiano Azzolini et.al.", "authors": "Damiano Azzolini, Fabrizio Riguzzi", "id": "2408.07524v1", "paper_url": "http://arxiv.org/abs/2408.07524v1", "repo": "null"}}