{"2501.16975": {"publish_time": "2025-01-28", "title": "Over-Tokenized Transformer: Vocabulary is Generally Worth Scaling", "paper_summary": "Tokenization is a fundamental component of large language models (LLMs), yet\nits influence on model scaling and performance is not fully explored. In this\npaper, we introduce Over-Tokenized Transformers, a novel framework that\ndecouples input and output vocabularies to improve language modeling\nperformance. Specifically, our approach scales up input vocabularies to\nleverage multi-gram tokens. Through extensive experiments, we uncover a\nlog-linear relationship between input vocabulary size and training loss,\ndemonstrating that larger input vocabularies consistently enhance model\nperformance, regardless of model size. Using a large input vocabulary, we\nachieve performance comparable to double-sized baselines with no additional\ncost. Our findings highlight the importance of tokenization in scaling laws and\nprovide practical insight for tokenizer design, paving the way for more\nefficient and powerful LLMs.", "paper_summary_zh": "分詞是大型語言模型 (LLM) 的基本組成部分，但\n其對模型擴展和效能的影響尚未完全探索。在本文中，\n我們介紹過度分詞Transformer，這是一個新穎的架構，\n它解耦輸入和輸出詞彙表以改善語言建模\n效能。具體來說，我們的做法是擴展輸入詞彙表以\n利用多字元詞彙。透過廣泛的實驗，我們發現輸入詞彙量大小和訓練損失之間存在對數線性關係，\n證明了較大的輸入詞彙量始終增強模型\n效能，無論模型大小如何。使用大量的輸入詞彙量，我們\n實現與雙倍大小基準相當的效能，而沒有額外的\n成本。我們的發現突顯了分詞在擴充定律中的重要性，\n並為分詞器設計提供了實用的見解，為更多\n高效且強大的 LLM 鋪平了道路。", "author": "Hongzhi Huang et.al.", "authors": "Hongzhi Huang, Defa Zhu, Banggu Wu, Yutao Zeng, Ya Wang, Qiyang Min, Xun Zhou", "id": "2501.16975v1", "paper_url": "http://arxiv.org/abs/2501.16975v1", "repo": "null"}}