{"2408.11526": {"publish_time": "2024-08-21", "title": "RConE: Rough Cone Embedding for Multi-Hop Logical Query Answering on Multi-Modal Knowledge Graphs", "paper_summary": "Multi-hop query answering over a Knowledge Graph (KG) involves traversing one\nor more hops from the start node to answer a query. Path-based and logic-based\nmethods are state-of-the-art for multi-hop question answering. The former is\nused in link prediction tasks. The latter is for answering complex logical\nqueries. The logical multi-hop querying technique embeds the KG and queries in\nthe same embedding space. The existing work incorporates First Order Logic\n(FOL) operators, such as conjunction ($\\wedge$), disjunction ($\\vee$), and\nnegation ($\\neg$), in queries. Though current models have most of the building\nblocks to execute the FOL queries, they cannot use the dense information of\nmulti-modal entities in the case of Multi-Modal Knowledge Graphs (MMKGs). We\npropose RConE, an embedding method to capture the multi-modal information\nneeded to answer a query. The model first shortlists candidate (multi-modal)\nentities containing the answer. It then finds the solution (sub-entities)\nwithin those entities. Several existing works tackle path-based\nquestion-answering in MMKGs. However, to our knowledge, we are the first to\nintroduce logical constructs in querying MMKGs and to answer queries that\ninvolve sub-entities of multi-modal entities as the answer. Extensive\nevaluation of four publicly available MMKGs indicates that RConE outperforms\nthe current state-of-the-art.", "paper_summary_zh": "多跳查询回答涉及从起始节点遍历一个或多个跳跃来回答查询。基于路径和基于逻辑的方法是多跳问题回答的最新技术。前者用于链接预测任务。后者用于回答复杂的逻辑查询。逻辑多跳查询技术将知识图谱和查询嵌入到相同的嵌入空间中。现有工作在查询中纳入了第一阶逻辑 (FOL) 运算符，例如合取 ($\\wedge$)、析取 ($\\vee$) 和否定 ($\\neg$)。虽然当前模型具有执行 FOL 查询的大部分构建模块，但它们在多模态知识图谱 (MMKG) 的情况下无法使用多模态实体的密集信息。我们提出了 RConE，这是一种嵌入方法，用于捕获回答查询所需的多模态信息。该模型首先筛选包含答案的候选（多模态）实体。然后在这些实体中找到解决方案（子实体）。一些现有工作解决了 MMKG 中基于路径的问题回答。然而，据我们所知，我们是第一个在查询 MMKG 中引入逻辑结构并回答查询的人，这些查询涉及多模态实体的子实体作为答案。对四个公开可用的 MMKG 的广泛评估表明，RConE 优于当前的最新技术。", "author": "Mayank Kharbanda et.al.", "authors": "Mayank Kharbanda, Rajiv Ratn Shah, Raghava Mutharaju", "id": "2408.11526v1", "paper_url": "http://arxiv.org/abs/2408.11526v1", "repo": "https://github.com/kracr/rcone-qa-mmkg"}}