{"2406.19236": {"publish_time": "2024-06-27", "title": "Human-Aware Vision-and-Language Navigation: Bridging Simulation to Reality with Dynamic Human Interactions", "paper_summary": "Vision-and-Language Navigation (VLN) aims to develop embodied agents that\nnavigate based on human instructions. However, current VLN frameworks often\nrely on static environments and optimal expert supervision, limiting their\nreal-world applicability. To address this, we introduce Human-Aware\nVision-and-Language Navigation (HA-VLN), extending traditional VLN by\nincorporating dynamic human activities and relaxing key assumptions. We propose\nthe Human-Aware 3D (HA3D) simulator, which combines dynamic human activities\nwith the Matterport3D dataset, and the Human-Aware Room-to-Room (HA-R2R)\ndataset, extending R2R with human activity descriptions. To tackle HA-VLN\nchallenges, we present the Expert-Supervised Cross-Modal (VLN-CM) and\nNon-Expert-Supervised Decision Transformer (VLN-DT) agents, utilizing\ncross-modal fusion and diverse training strategies for effective navigation in\ndynamic human environments. A comprehensive evaluation, including metrics\nconsidering human activities, and systematic analysis of HA-VLN's unique\nchallenges, underscores the need for further research to enhance HA-VLN agents'\nreal-world robustness and adaptability. Ultimately, this work provides\nbenchmarks and insights for future research on embodied AI and Sim2Real\ntransfer, paving the way for more realistic and applicable VLN systems in\nhuman-populated environments.", "paper_summary_zh": "視覺語言導航 (VLN) 的目標是開發具備根據人類指示導航功能的具身代理。然而，目前的 VLN 架構通常依賴於靜態環境和最佳專家監督，限制了它們在現實世界中的適用性。為了解決這個問題，我們引入了具有人類意識的視覺語言導航 (HA-VLN)，透過納入動態人類活動和放寬關鍵假設來擴展傳統 VLN。我們提出了具有人類意識的 3D (HA3D) 模擬器，它將動態人類活動與 Matterport3D 資料集結合在一起，以及具有人類意識的房間到房間 (HA-R2R) 資料集，將 R2R 擴展到人類活動描述。為了應對 HA-VLN 挑戰，我們提出了專家監督跨模態 (VLN-CM) 和非專家監督決策轉換器 (VLN-DT) 代理，利用跨模態融合和多樣化的訓練策略在動態人類環境中進行有效的導航。全面的評估，包括考慮人類活動的指標，以及對 HA-VLN 獨特挑戰的系統分析，強調了進一步研究以增強 HA-VLN 代理在現實世界中的穩健性和適應性的必要性。最終，這項工作為具身 AI 和 Sim2Real 傳輸的未來研究提供了基準和見解，為在有人類居住的環境中更逼真且適用的 VLN 系統鋪平了道路。", "author": "Minghan Li et.al.", "authors": "Minghan Li, Heng Li, Zhi-Qi Cheng, Yifei Dong, Yuxuan Zhou, Jun-Yan He, Qi Dai, Teruko Mitamura, Alexander G. Hauptmann", "id": "2406.19236v1", "paper_url": "http://arxiv.org/abs/2406.19236v1", "repo": "https://github.com/lpercc/ha3d_simulator"}}