{"2412.19043": {"publish_time": "2024-12-26", "title": "Indonesian-English Code-Switching Speech Synthesizer Utilizing Multilingual STEN-TTS and Bert LID", "paper_summary": "Multilingual text-to-speech systems convert text into speech across multiple\nlanguages. In many cases, text sentences may contain segments in different\nlanguages, a phenomenon known as code-switching. This is particularly common in\nIndonesia, especially between Indonesian and English. Despite its significance,\nno research has yet developed a multilingual TTS system capable of handling\ncode-switching between these two languages. This study addresses\nIndonesian-English code-switching in STEN-TTS. Key modifications include adding\na language identification component to the text-to-phoneme conversion using\nfinetuned BERT for per-word language identification, as well as removing\nlanguage embedding from the base model. Experimental results demonstrate that\nthe code-switching model achieves superior naturalness and improved speech\nintelligibility compared to the Indonesian and English baseline STEN-TTS\nmodels.", "paper_summary_zh": "多國語言文字轉語音系統會將文字轉換成跨多種語言的語音。在許多情況下，文字句子可能包含不同語言的區塊，這稱為代碼轉換。這種現象在印尼特別常見，特別是在印尼語和英語之間。儘管其重要性，但目前尚未有研究開發出能夠處理這兩種語言之間代碼轉換的多國語言 TTS 系統。本研究探討 STEN-TTS 中的印尼語-英語代碼轉換。主要的修改包括在文字轉音素轉換中加入語言辨識元件，使用微調 BERT 進行每個字詞的語言辨識，以及從基礎模型中移除語言嵌入。實驗結果證明，與印尼語和英語基準 STEN-TTS 模型相比，代碼轉換模型達到了更優異的自然度和更佳的語音清晰度。", "author": "Ahmad Alfani Handoyo et.al.", "authors": "Ahmad Alfani Handoyo, Chung Tran, Dessi Puji Lestari, Sakriani Sakti", "id": "2412.19043v1", "paper_url": "http://arxiv.org/abs/2412.19043v1", "repo": "null"}}