{"2502.02196": {"publish_time": "2025-02-04", "title": "Exploiting Ensemble Learning for Cross-View Isolated Sign Language Recognition", "paper_summary": "In this paper, we present our solution to the Cross-View Isolated Sign\nLanguage Recognition (CV-ISLR) challenge held at WWW 2025. CV-ISLR addresses a\ncritical issue in traditional Isolated Sign Language Recognition (ISLR), where\nexisting datasets predominantly capture sign language videos from a frontal\nperspective, while real-world camera angles often vary. To accurately recognize\nsign language from different viewpoints, models must be capable of\nunderstanding gestures from multiple angles, making cross-view recognition\nchallenging. To address this, we explore the advantages of ensemble learning,\nwhich enhances model robustness and generalization across diverse views. Our\napproach, built on a multi-dimensional Video Swin Transformer model, leverages\nthis ensemble strategy to achieve competitive performance. Finally, our\nsolution ranked 3rd in both the RGB-based ISLR and RGB-D-based ISLR tracks,\ndemonstrating the effectiveness in handling the challenges of cross-view\nrecognition. The code is available at:\nhttps://github.com/Jiafei127/CV_ISLR_WWW2025.", "paper_summary_zh": "在本文中，我們提出了我們在 2025 年 WWW 大會上舉辦的跨視角孤立手語識別 (CV-ISLR) 挑戰中的解決方案。CV-ISLR 解決了傳統孤立手語識別 (ISLR) 中的一個關鍵問題，其中現有的數據集主要從正面角度捕捉手語影片，而現實世界中的相機角度卻常常不同。為了準確識別來自不同視角的手語，模型必須能夠從多個角度理解手勢，這使得跨視角識別具有挑戰性。為了解決這個問題，我們探討了集成學習的優點，這增強了模型的穩健性和跨不同視角的泛化能力。我們的方法建立在多維影片 Swin Transformer 模型上，利用這種集成策略來實現競爭力的效能。最後，我們的解決方案在基於 RGB 的 ISLR 和基於 RGB-D 的 ISLR 軌道中均排名第三，證明了在處理跨視角識別挑戰方面的有效性。程式碼可在以下網址取得：\nhttps://github.com/Jiafei127/CV_ISLR_WWW2025。", "author": "Fei Wang et.al.", "authors": "Fei Wang, Kun Li, Yiqi Nie, Zhangling Duan, Peng Zou, Zhiliang Wu, Yuwei Wang, Yanyan Wei", "id": "2502.02196v1", "paper_url": "http://arxiv.org/abs/2502.02196v1", "repo": "null"}}