{"2406.03792": {"publish_time": "2024-06-06", "title": "Light-PEFT: Lightening Parameter-Efficient Fine-Tuning via Early Pruning", "paper_summary": "Parameter-efficient fine-tuning (PEFT) has emerged as the predominant\ntechnique for fine-tuning in the era of large language models. However,\nexisting PEFT methods still have inadequate training efficiency. Firstly, the\nutilization of large-scale foundation models during the training process is\nexcessively redundant for certain fine-tuning tasks. Secondly, as the model\nsize increases, the growth in trainable parameters of empirically added PEFT\nmodules becomes non-negligible and redundant, leading to inefficiency. To\nachieve task-specific efficient fine-tuning, we propose the Light-PEFT\nframework, which includes two methods: Masked Early Pruning of the Foundation\nModel and Multi-Granularity Early Pruning of PEFT. The Light-PEFT framework\nallows for the simultaneous estimation of redundant parameters in both the\nfoundation model and PEFT modules during the early stage of training. These\nparameters can then be pruned for more efficient fine-tuning. We validate our\napproach on GLUE, SuperGLUE, QA tasks, and various models. With Light-PEFT,\nparameters of the foundation model can be pruned by up to over 40%, while still\ncontrolling trainable parameters to be only 25% of the original PEFT method.\nCompared to utilizing the PEFT method directly, Light-PEFT achieves training\nand inference speedup, reduces memory usage, and maintains comparable\nperformance and the plug-and-play feature of PEFT.", "paper_summary_zh": "參數高效微調 (PEFT) 已成為大型語言模型時代微調的主要技術。然而，現有的 PEFT 方法仍有訓練效率不足的問題。首先，在訓練過程中使用大規模基礎模型對於某些微調任務來說過於冗餘。其次，隨著模型規模的增加，經驗性添加的 PEFT 模組中可訓練參數的增長變得不可忽視且冗餘，導致效率低下。為了實現特定任務的高效微調，我們提出了 Light-PEFT 框架，其中包含兩種方法：基礎模型的遮罩早期剪枝和 PEFT 的多粒度早期剪枝。Light-PEFT 框架允許在訓練的早期階段同時估計基礎模型和 PEFT 模組中的冗餘參數。然後可以剪枝這些參數以實現更有效的微調。我們在 GLUE、SuperGLUE、QA 任務和各種模型上驗證了我們的做法。使用 Light-PEFT，基礎模型的參數可以剪枝多達 40%，同時仍將可訓練參數控制在原始 PEFT 方法的 25%。與直接使用 PEFT 方法相比，Light-PEFT 可加快訓練和推論速度、減少記憶體使用量，並維持 PEFT 的可比效能和即插即用功能。", "author": "Naibin Gu et.al.", "authors": "Naibin Gu, Peng Fu, Xiyu Liu, Bowen Shen, Zheng Lin, Weiping Wang", "id": "2406.03792v1", "paper_url": "http://arxiv.org/abs/2406.03792v1", "repo": "null"}}