{"2502.12081": {"publish_time": "2025-02-17", "title": "Unhackable Temporal Rewarding for Scalable Video MLLMs", "paper_summary": "In the pursuit of superior video-processing MLLMs, we have encountered a\nperplexing paradox: the \"anti-scaling law\", where more data and larger models\nlead to worse performance. This study unmasks the culprit: \"temporal hacking\",\na phenomenon where models shortcut by fixating on select frames, missing the\nfull video narrative. In this work, we systematically establish a comprehensive\ntheory of temporal hacking, defining it from a reinforcement learning\nperspective, introducing the Temporal Perplexity (TPL) score to assess this\nmisalignment, and proposing the Unhackable Temporal Rewarding (UTR) framework\nto mitigate the temporal hacking. Both theoretically and empirically, TPL\nproves to be a reliable indicator of temporal modeling quality, correlating\nstrongly with frame activation patterns. Extensive experiments reveal that UTR\nnot only counters temporal hacking but significantly elevates video\ncomprehension capabilities. This work not only advances video-AI systems but\nalso illuminates the critical importance of aligning proxy rewards with true\nobjectives in MLLM development.", "paper_summary_zh": "在追求卓越的影片處理 MLLM 時，我們遭遇了一個令人費解的矛盾現象：「反規模化定律」，也就是更多資料和更大的模型會導致更差的效能。本研究揭露了罪魁禍首：「時間駭客」，這是一種模型透過專注於特定影格來簡化的現象，錯失了完整的影片敘事。在這項研究中，我們系統性地建立了一個關於時間駭客的全面理論，從強化學習的角度定義它，並引入了時間困惑度 (TPL) 分數來評估這種失衡，並提出了無法破解的時間獎勵 (UTR) 架構來減輕時間駭客現象。從理論和經驗上來說，TPL 被證明是時間建模品質的可靠指標，與影格啟動模式有很強的相關性。大量的實驗顯示，UTR 不僅對抗時間駭客，還能顯著提升影片理解能力。這項研究不僅推動了影片 AI 系統，也闡明了在 MLLM 開發中，將代理獎勵與真實目標對齊的重要性。", "author": "En Yu et.al.", "authors": "En Yu, Kangheng Lin, Liang Zhao, Yana Wei, Zining Zhu, Haoran Wei, Jianjian Sun, Zheng Ge, Xiangyu Zhang, Jingyu Wang, Wenbing Tao", "id": "2502.12081v1", "paper_url": "http://arxiv.org/abs/2502.12081v1", "repo": "null"}}