{"2408.11793": {"publish_time": "2024-08-21", "title": "Leveraging Chemistry Foundation Models to Facilitate Structure Focused Retrieval Augmented Generation in Multi-Agent Workflows for Catalyst and Materials Design", "paper_summary": "Molecular property prediction and generative design via deep learning models\nhas been the subject of intense research given its potential to accelerate\ndevelopment of new, high-performance materials. More recently, these workflows\nhave been significantly augmented with the advent of large language models\n(LLMs) and systems of LLM-driven agents capable of utilizing pre-trained models\nto make predictions in the context of more complex research tasks. While\neffective, there is still room for substantial improvement within the agentic\nsystems on the retrieval of salient information for material design tasks.\nMoreover, alternative uses of predictive deep learning models, such as\nleveraging their latent representations to facilitate cross-modal retrieval\naugmented generation within agentic systems to enable task-specific materials\ndesign, has remained unexplored. Herein, we demonstrate that large, pre-trained\nchemistry foundation models can serve as a basis for enabling semantic\nchemistry information retrieval for both small-molecules, complex polymeric\nmaterials, and reactions. Additionally, we show the use of chemistry foundation\nmodels in conjunction with image models such as OpenCLIP facilitate\nunprecedented queries and information retrieval across multiple\ncharacterization data domains. Finally, we demonstrate the integration of these\nsystems within multi-agent systems to facilitate structure and\ntopological-based natural language queries and information retrieval for\ncomplex research tasks.", "paper_summary_zh": "分子特性預測和生成設計透過深度學習模型\n一直是密集研究的主題，因為它有潛力加速\n開發新的高性能材料。最近，這些工作流程\n已透過大型語言模型 (LLM) 和 LLM 驅動代理系統的出現而顯著擴增，這些系統能夠利用預先訓練的模型\n在更複雜的研究任務的背景下進行預測。雖然\n有效，但代理系統在檢索材料設計任務的顯著資訊方面仍有大幅改善的空間。\n此外，預測性深度學習模型的替代用途，例如\n利用其潛在表示來促進跨模式檢索\n增強代理系統中的生成以實現特定任務的材料\n設計，仍然未被探索。在此，我們證明大型預訓練\n化學基礎模型可以作為啟用語義\n化學資訊檢索的基礎，適用於小分子、複雜聚合物\n材料和反應。此外，我們展示了化學基礎\n模型與圖像模型（例如 OpenCLIP）結合使用，促進\n跨多個\n表徵資料網域的空前查詢和資訊檢索。最後，我們展示了這些\n系統在多代理系統中的整合，以促進結構和\n基於拓撲的自然語言查詢和資訊檢索，用於\n複雜的研究任務。", "author": "Nathaniel H. Park et.al.", "authors": "Nathaniel H. Park, Tiffany J. Callahan, James L. Hedrick, Tim Erdmann, Sara Capponi", "id": "2408.11793v1", "paper_url": "http://arxiv.org/abs/2408.11793v1", "repo": "null"}}