{"2408.11049": {"publish_time": "2024-08-20", "title": "MagicDec: Breaking the Latency-Throughput Tradeoff for Long Context Generation with Speculative Decoding", "paper_summary": "Large Language Models (LLMs) have become more prevalent in long-context\napplications such as interactive chatbots, document analysis, and agent\nworkflows, but it is challenging to serve long-context requests with low\nlatency and high throughput. Speculative decoding (SD) is a widely used\ntechnique to reduce latency without sacrificing performance but the\nconventional wisdom suggests that its efficacy is limited to small batch sizes.\nIn MagicDec, we show that surprisingly SD can achieve speedup even for a high\nthroughput inference regime for moderate to long sequences. More interestingly,\nan intelligent drafting strategy can achieve better speedup with increasing\nbatch size based on our rigorous analysis. MagicDec first identifies the\nbottleneck shifts with increasing batch size and sequence length, and uses\nthese insights to deploy speculative decoding more effectively for high\nthroughput inference. Then, it leverages draft models with sparse KV cache to\naddress the KV bottleneck that scales with both sequence length and batch size.", "paper_summary_zh": "大型語言模型 (LLM) 在長語境應用中變得越來越普遍，例如互動式聊天機器人、文件分析和代理工作流程，但以低延遲和高吞吐量提供長語境請求具有挑戰性。推測性解碼 (SD) 是一種廣泛使用的技術，用於在不犧牲性能的情況下減少延遲，但傳統觀念認為其效力僅限於小批次大小。在 MagicDec 中，我們展示了令人驚訝的是，即使對於中等長度的序列，SD 也可以實現高吞吐量推理模式的速度提升。更有趣的是，基於我們嚴謹的分析，一種智能起草策略可以隨著批次大小的增加實現更好的加速。MagicDec 首先找出瓶頸隨著批次大小和序列長度的增加而發生轉移，並利用這些見解更有效地部署推測性解碼以進行高吞吐量推理。然後，它利用具有稀疏 KV 快取的草稿模型來解決隨著序列長度和批次大小而擴展的 KV 瓶頸。", "author": "Jian Chen et.al.", "authors": "Jian Chen, Vashisth Tiwari, Ranajoy Sadhukhan, Zhuoming Chen, Jinyuan Shi, Ian En-Hsu Yen, Beidi Chen", "id": "2408.11049v1", "paper_url": "http://arxiv.org/abs/2408.11049v1", "repo": "null"}}