{"2504.13835": {"publish_time": "2025-04-18", "title": "MIG: Automatic Data Selection for Instruction Tuning by Maximizing Information Gain in Semantic Space", "paper_summary": "Data quality and diversity are key to the construction of effective\ninstruction-tuning datasets. % With the increasing availability of open-source\ninstruction-tuning datasets, it is advantageous to automatically select\nhigh-quality and diverse subsets from a vast amount of data. % Existing methods\ntypically prioritize instance quality and use heuristic rules to maintain\ndiversity. % However, this absence of a comprehensive view of the entire\ncollection often leads to suboptimal results. % Moreover, heuristic rules\ngenerally focus on distance or clustering within the embedding space, which\nfails to accurately capture the intent of complex instructions in the semantic\nspace. % To bridge this gap, we propose a unified method for quantifying the\ninformation content of datasets. This method models the semantic space by\nconstructing a label graph and quantifies diversity based on the distribution\nof information within the graph. % Based on such a measurement, we further\nintroduce an efficient sampling method that selects data samples iteratively to\n\\textbf{M}aximize the \\textbf{I}nformation \\textbf{G}ain (MIG) in semantic\nspace. % Experiments on various datasets and base models demonstrate that MIG\nconsistently outperforms state-of-the-art methods. % Notably, the model\nfine-tuned with 5\\% Tulu3 data sampled by MIG achieves comparable performance\nto the official SFT model trained on the full dataset, with improvements of\n+5.73\\% on AlpacaEval and +6.89\\% on Wildbench.", "paper_summary_zh": "<paragraph>數據品質和多樣性是構建有效指令微調數據集的關鍵。隨著開源指令微調數據集的日益普及，能夠從海量數據中自動選擇高質量且多樣化的子集將會非常有益。現有方法通常優先考慮實例質量，並使用啟發式規則來保持多樣性。然而，由於缺乏對整個集合的全面了解，往往導致結果不盡如人意。此外，啟發式規則通常側重於嵌入空間內的距離或聚類，而無法準確捕捉語義空間中複雜指令的意圖。為了彌合這一差距，我們提出了一種量化數據集信息含量的統一方法。該方法通過構建標籤圖來模擬語義空間，並根據圖中信息的分布來量化多樣性。基於這種測量方法，我們進一步引入了一種高效的採樣方法，它迭代地選擇數據樣本，以在語義空間中\\textbf{最大化信息增益}（MIG）。在各種數據集和基礎模型上的實驗表明，MIG 的表現始終優於最先進的方法。值得注意的是，使用 MIG 採樣的 5% Tulu3 數據微調的模型，其性能與在完整數據集上訓練的官方 SFT 模型相當，在 AlpacaEval 上提升了 +5.73%，在 Wildbench 上提升了 +6.89%。</paragraph>\n", "author": "Yicheng Chen et.al.", "authors": "Yicheng Chen, Yining Li, Kai Hu, Zerun Ma, Haochen Ye, Kai Chen", "id": "2504.13835v1", "paper_url": "http://arxiv.org/abs/2504.13835v1", "repo": "null"}}