{"2501.17726": {"publish_time": "2025-01-29", "title": "VICCA: Visual Interpretation and Comprehension of Chest X-ray Anomalies in Generated Report Without Human Feedback", "paper_summary": "As artificial intelligence (AI) becomes increasingly central to healthcare,\nthe demand for explainable and trustworthy models is paramount. Current report\ngeneration systems for chest X-rays (CXR) often lack mechanisms for validating\noutputs without expert oversight, raising concerns about reliability and\ninterpretability. To address these challenges, we propose a novel multimodal\nframework designed to enhance the semantic alignment and localization accuracy\nof AI-generated medical reports. Our framework integrates two key modules: a\nPhrase Grounding Model, which identifies and localizes pathologies in CXR\nimages based on textual prompts, and a Text-to-Image Diffusion Module, which\ngenerates synthetic CXR images from prompts while preserving anatomical\nfidelity. By comparing features between the original and generated images, we\nintroduce a dual-scoring system: one score quantifies localization accuracy,\nwhile the other evaluates semantic consistency. This approach significantly\noutperforms existing methods, achieving state-of-the-art results in pathology\nlocalization and text-to-image alignment. The integration of phrase grounding\nwith diffusion models, coupled with the dual-scoring evaluation system,\nprovides a robust mechanism for validating report quality, paving the way for\nmore trustworthy and transparent AI in medical imaging.", "paper_summary_zh": "隨著人工智慧 (AI) 在醫療保健中扮演越來越重要的角色，\n對可解釋且值得信賴的模型的需求至關重要。目前針對胸部 X 光 (CXR) 的報告生成系統通常缺乏在沒有專家監督的情況下驗證輸出的機制，這引發了對可靠性和可解釋性的疑慮。為了應對這些挑戰，我們提出了一個新穎的多模態架構，旨在增強 AI 生成的醫療報告的語義對齊和定位準確度。我們的架構整合了兩個關鍵模組：一個基於文字提示識別和定位 CXR 影像中病理的詞組基礎模型，以及一個文字到影像擴散模組，該模組在保留解剖結構保真度的同時，從提示中生成合成 CXR 影像。透過比較原始影像和生成影像之間的特徵，我們引入了雙重評分系統：一個評分量化定位準確度，而另一個評分則評估語義一致性。這種方法顯著優於現有方法，在病理定位和文字到影像對齊方面取得了最先進的成果。詞組基礎與擴散模型的整合，加上雙重評分評估系統，提供了一個驗證報告品質的強健機制，為醫療影像中更值得信賴且透明的 AI 鋪路。", "author": "Sayeh Gholipour Picha et.al.", "authors": "Sayeh Gholipour Picha, Dawood Al Chanti, Alice Caplier", "id": "2501.17726v1", "paper_url": "http://arxiv.org/abs/2501.17726v1", "repo": "null"}}