{"2411.09807": {"publish_time": "2024-11-14", "title": "Evaluating Loss Landscapes from a Topology Perspective", "paper_summary": "Characterizing the loss of a neural network with respect to model parameters,\ni.e., the loss landscape, can provide valuable insights into properties of that\nmodel. Various methods for visualizing loss landscapes have been proposed, but\nless emphasis has been placed on quantifying and extracting actionable and\nreproducible insights from these complex representations. Inspired by powerful\ntools from topological data analysis (TDA) for summarizing the structure of\nhigh-dimensional data, here we characterize the underlying shape (or topology)\nof loss landscapes, quantifying the topology to reveal new insights about\nneural networks. To relate our findings to the machine learning (ML)\nliterature, we compute simple performance metrics (e.g., accuracy, error), and\nwe characterize the local structure of loss landscapes using Hessian-based\nmetrics (e.g., largest eigenvalue, trace, eigenvalue spectral density).\nFollowing this approach, we study established models from image pattern\nrecognition (e.g., ResNets) and scientific ML (e.g., physics-informed neural\nnetworks), and we show how quantifying the shape of loss landscapes can provide\nnew insights into model performance and learning dynamics.", "paper_summary_zh": "通过模型参数来表征神经网络的损失，即损失景观，可以为该模型的属性提供有价值的见解。已经提出了可视化损失景观的各种方法，但较少强调从这些复杂表示中量化和提取可操作且可重复的见解。受拓扑数据分析 (TDA) 中用于总结高维数据结构的强大工具的启发，我们在此表征损失景观的底层形状（或拓扑），量化拓扑以揭示有关神经网络的新见解。为了将我们的发现与机器学习 (ML) 文献联系起来，我们计算简单的性能指标（例如，准确度、错误），并使用基于 Hessian 的指标（例如，最大特征值、迹、特征值谱密度）来表征损失景观的局部结构。遵循这种方法，我们研究了图像模式识别（例如，ResNets）和科学 ML（例如，物理信息神经网络）中的已建立模型，并展示了量化损失景观的形状如何可以为模型性能和学习动态提供新的见解。", "author": "Tiankai Xie et.al.", "authors": "Tiankai Xie, Caleb Geniesse, Jiaqing Chen, Yaoqing Yang, Dmitriy Morozov, Michael W. Mahoney, Ross Maciejewski, Gunther H. Weber", "id": "2411.09807v1", "paper_url": "http://arxiv.org/abs/2411.09807v1", "repo": "null"}}