{"2410.18491": {"publish_time": "2024-10-24", "title": "ChineseSafe: A Chinese Benchmark for Evaluating Safety in Large Language Models", "paper_summary": "With the rapid development of Large language models (LLMs), understanding the\ncapabilities of LLMs in identifying unsafe content has become increasingly\nimportant. While previous works have introduced several benchmarks to evaluate\nthe safety risk of LLMs, the community still has a limited understanding of\ncurrent LLMs' capability to recognize illegal and unsafe content in Chinese\ncontexts. In this work, we present a Chinese safety benchmark (ChineseSafe) to\nfacilitate research on the content safety of large language models. To align\nwith the regulations for Chinese Internet content moderation, our ChineseSafe\ncontains 205,034 examples across 4 classes and 10 sub-classes of safety issues.\nFor Chinese contexts, we add several special types of illegal content:\npolitical sensitivity, pornography, and variant/homophonic words. Moreover, we\nemploy two methods to evaluate the legal risks of popular LLMs, including\nopen-sourced models and APIs. The results reveal that many LLMs exhibit\nvulnerability to certain types of safety issues, leading to legal risks in\nChina. Our work provides a guideline for developers and researchers to\nfacilitate the safety of LLMs. Our results are also available at\nhttps://huggingface.co/spaces/SUSTech/ChineseSafe-Benchmark.", "paper_summary_zh": "隨著大型語言模型 (LLM) 的快速發展，了解 LLM 在識別不安全內容方面的能力變得越來越重要。雖然先前的研究已經引入了幾個基準來評估 LLM 的安全風險，但社群對於當前 LLM 識別中文語境中非法和不安全內容的能力仍有有限的了解。在這項研究中，我們提出了一個中文安全基準 (ChineseSafe)，以促進對大型語言模型內容安全的研究。為了符合中國網路內容審核法規，我們的 ChineseSafe 包含 4 個類別和 10 個子類別的安全問題，共 205,034 個範例。對於中文語境，我們增加了幾種特殊類型的非法內容：政治敏感性、色情內容和變體/諧音字。此外，我們採用兩種方法來評估熱門 LLM 的法律風險，包括開源模型和 API。結果顯示，許多 LLM 對某些類型的安全問題表現出脆弱性，這導致了中國的法律風險。我們的研究為開發人員和研究人員提供了指導方針，以促進 LLM 的安全性。我們的結果也可在 https://huggingface.co/spaces/SUSTech/ChineseSafe-Benchmark 取得。", "author": "Hengxiang Zhang et.al.", "authors": "Hengxiang Zhang, Hongfu Gao, Qiang Hu, Guanhua Chen, Lili Yang, Bingyi Jing, Hongxin Wei, Bing Wang, Haifeng Bai, Lei Yang", "id": "2410.18491v1", "paper_url": "http://arxiv.org/abs/2410.18491v1", "repo": "null"}}