{"2410.12860": {"publish_time": "2024-10-11", "title": "LLMD: A Large Language Model for Interpreting Longitudinal Medical Records", "paper_summary": "We introduce LLMD, a large language model designed to analyze a patient's\nmedical history based on their medical records. Along with domain knowledge,\nLLMD is trained on a large corpus of records collected over time and across\nfacilities, as well as tasks and labels that make nuanced connections among\nthem. This approach is critical to an accurate picture of patient health, and\nhas distinctive advantages over models trained on knowledge alone, unlabeled\nrecords, structured EHR data, or records from a single health system.\n  The recipe for LLMD continues pretraining a foundational model on both domain\nknowledge and the contents of millions of records. These span an average of 10\nyears of care and as many as 140 care sites per patient. LLMD is then\ninstruction fine-tuned on structuring and abstraction tasks. The former jointly\nidentify and normalize document metadata, provenance information, clinical\nnamed-entities, and ontology mappings, while the latter roll these into\nhigher-level representations, such a continuous era of time a patient was on a\nmedication. LLMD is deployed within a layered validation system that includes\ncontinual random audits and review by experts, e.g. based on uncertainty,\ndisease-specific rules, or use-case.\n  LLMD exhibits large gains over both more-powerful generalized models and\ndomain-specific models. On medical knowledge benchmarks, LLMD-8B achieves state\nof the art accuracy on PubMedQA text responses, besting orders-of-magnitude\nlarger models. On production tasks, we show that LLMD significantly outperforms\nall other models evaluated, and among alternatives, large general purpose LLMs\nlike GPT-4o are more accurate than models emphasizing medical knowledge. We\nfind strong evidence that accuracy on today's medical benchmarks is not the\nmost significant factor when analyzing real-world patient data, an insight with\nimplications for future medical LLMs.'", "paper_summary_zh": "<paragraph>我們引入了 LLMD，這是一個大型語言模型，旨在根據病歷分析患者的病史。除了領域知識外，LLMD 還接受了大量隨著時間推移和跨設施收集的記錄的訓練，以及在它們之間建立細微聯繫的任務和標籤。這種方法對於準確描繪患者健康狀況至關重要，並且與僅接受知識訓練的模型、未標記記錄、結構化的 EHR 數據或來自單一健康系統的記錄相比，具有顯著優勢。\nLLMD 的秘訣是對基礎模型進行預訓練，既包括領域知識，也包括數百萬條記錄的內容。這些記錄平均涵蓋了每位患者 10 年的護理時間和多達 140 個護理地點。然後對 LLMD 進行結構化和抽象任務的指令微調。前者共同識別和標準化文檔元數據、來源信息、臨床命名實體和本体映射，而後者將這些內容轉換為更高級別的表示，例如患者服藥的連續時間段。LLMD 在一個分層驗證系統中部署，其中包括持續的隨機審核和專家審查，例如基於不確定性、特定疾病規則或用例。\nLLMD 在功能更強大的通用模型和特定領域模型方面都表現出巨大的優勢。在醫學知識基準測試中，LLMD-8B 在 PubMedQA 文本響應方面達到了最先進的準確性，優於數量級更大的模型。在生產任務中，我們表明 LLMD 明顯優於所有其他評估模型，並且在替代方案中，像 GPT-4o 這樣的大型通用 LLM 比強調醫學知識的模型更準確。我們發現強有力的證據表明，在分析現實世界的患者數據時，當今醫學基準測試的準確性並非最重要的因素，這對未來的醫學 LLM 也有影響。</paragraph>", "author": "Robert Porter et.al.", "authors": "Robert Porter, Adam Diehl, Benjamin Pastel, J. Henry Hinnefeld, Lawson Nerenberg, Pye Maung, Sebastien Kerbrat, Gillian Hanson, Troy Astorino, Stephen J. Tarsa", "id": "2410.12860v1", "paper_url": "http://arxiv.org/abs/2410.12860v1", "repo": "null"}}