{"2410.07118": {"publish_time": "2024-10-09", "title": "Exploring the Readiness of Prominent Small Language Models for the Democratization of Financial Literacy", "paper_summary": "The use of small language models (SLMs), herein defined as models with less\nthan three billion parameters, is increasing across various domains and\napplications. Due to their ability to run on more accessible hardware and\npreserve user privacy, SLMs possess the potential to democratize access to\nlanguage models for individuals of different socioeconomic status and with\ndifferent privacy preferences. This study assesses several state-of-the-art\nSLMs (e.g., Apple's OpenELM, Microsoft's Phi, Google's Gemma, and the Tinyllama\nproject) for use in the financial domain to support the development of\nfinancial literacy LMs. Democratizing access to quality financial information\nfor those who are financially under educated is greatly needed in society,\nparticularly as new financial markets and products emerge and participation in\nfinancial markets increases due to ease of access. We are the first to examine\nthe use of open-source SLMs to democratize access to financial question\nanswering capabilities for individuals and students. To this end, we provide an\nanalysis of the memory usage, inference time, similarity comparisons to\nground-truth answers, and output readability of prominent SLMs to determine\nwhich models are most accessible and capable of supporting access to financial\ninformation. We analyze zero-shot and few-shot learning variants of the models.\nThe results suggest that some off-the-shelf SLMs merit further exploration and\nfine-tuning to prepare them for individual use, while others may have limits to\ntheir democratization.", "paper_summary_zh": "小型語言模型 (SLM) 的使用，本文定義為參數少於 30 億的模型，正於各個領域和應用中增加。由於 SLM 能在更易取得的硬體上執行並保護使用者隱私，因此 SLM 具有民主化語言模型的使用權，讓不同社會經濟地位和隱私偏好的個人都能使用。本研究評估了數個最先進的 SLM（例如 Apple 的 OpenELM、Microsoft 的 Phi、Google 的 Gemma 和 Tinyllama 專案），以用於金融領域，以支援金融素養 LM 的開發。社會極需要民主化對高品質財務資訊的取得，特別是隨著新金融市場和產品的出現，以及由於易於取得而增加對金融市場的參與。我們是第一個探討使用開源 SLM，以民主化對個人和學生的財務問題解答能力的取得。為此，我們分析了記憶體使用量、推論時間、與正確答案的相似性比較，以及傑出 SLM 的輸出可讀性，以確定哪些模型最容易取得，且有能力支援取得財務資訊。我們分析了模型的零次學習和少次學習變體。結果表明，一些現成的 SLM 值得進一步探討和微調，以準備個人使用，而其他 SLM 可能有其民主化限制。", "author": "Tagore Rao Kosireddy et.al.", "authors": "Tagore Rao Kosireddy, Jeffrey D. Wall, Evan Lucas", "id": "2410.07118v1", "paper_url": "http://arxiv.org/abs/2410.07118v1", "repo": "https://github.com/Tagore-7/Small-Language-Models-for-the-Democratization-of-Financial-Literacy"}}