{"2406.18817": {"publish_time": "2024-06-27", "title": "Correspondence-Free Non-Rigid Point Set Registration Using Unsupervised Clustering Analysis", "paper_summary": "This paper presents a novel non-rigid point set registration method that is\ninspired by unsupervised clustering analysis. Unlike previous approaches that\ntreat the source and target point sets as separate entities, we develop a\nholistic framework where they are formulated as clustering centroids and\nclustering members, separately. We then adopt Tikhonov regularization with an\n$\\ell_1$-induced Laplacian kernel instead of the commonly used Gaussian kernel\nto ensure smooth and more robust displacement fields. Our formulation delivers\nclosed-form solutions, theoretical guarantees, independence from dimensions,\nand the ability to handle large deformations. Subsequently, we introduce a\nclustering-improved Nystr\\\"om method to effectively reduce the computational\ncomplexity and storage of the Gram matrix to linear, while providing a rigorous\nbound for the low-rank approximation. Our method achieves high accuracy results\nacross various scenarios and surpasses competitors by a significant margin,\nparticularly on shapes with substantial deformations. Additionally, we\ndemonstrate the versatility of our method in challenging tasks such as shape\ntransfer and medical registration.", "paper_summary_zh": "本文提出了一種新穎的非剛性點集配準方法，其靈感來自無監督聚類分析。與將源點集和目標點集視為獨立實體的先前方法不同，我們開發了一個整體框架，其中它們分別被表述為聚類質心和聚類成員。然後，我們採用 Tikhonov 正則化和 $\\ell_1$ 誘導的拉普拉斯核，而不是常用的高斯核，以確保平滑且更穩健的位移場。我們的公式提供了閉式解、理論保證、獨立於維度以及處理大變形的的能力。隨後，我們引入了一種聚類改進的 Nystr\\\"om 方法，以有效地將 Gram 矩陣的計算複雜度和存儲空間降低到線性，同時為低秩近似提供嚴格的界限。我們的算法在各種場景中都能取得高精度的結果，並且大幅超越競爭對手，特別是在形狀變形很大的情況下。此外，我們在形狀轉移和醫學配準等具有挑戰性的任務中證明了我們算法的多功能性。", "author": "Mingyang Zhao et.al.", "authors": "Mingyang Zhao, Jingen Jiang, Lei Ma, Shiqing Xin, Gaofeng Meng, Dong-Ming Yan", "id": "2406.18817v1", "paper_url": "http://arxiv.org/abs/2406.18817v1", "repo": "https://github.com/zikai1/cvpr24_pointsetreg"}}