{"2502.15662": {"publish_time": "2025-02-21", "title": "Automating Curriculum Learning for Reinforcement Learning using a Skill-Based Bayesian Network", "paper_summary": "A major challenge for reinforcement learning is automatically generating\ncurricula to reduce training time or improve performance in some target task.\nWe introduce SEBNs (Skill-Environment Bayesian Networks) which model a\nprobabilistic relationship between a set of skills, a set of goals that relate\nto the reward structure, and a set of environment features to predict policy\nperformance on (possibly unseen) tasks. We develop an algorithm that uses the\ninferred estimates of agent success from SEBN to weigh the possible next tasks\nby expected improvement. We evaluate the benefit of the resulting curriculum on\nthree environments: a discrete gridworld, continuous control, and simulated\nrobotics. The results show that curricula constructed using SEBN frequently\noutperform other baselines.", "paper_summary_zh": "強化學習的一項重大挑戰是自動生成課程，以減少訓練時間或改善某些目標任務的表現。我們引入了 SEBN（技能環境貝氏網路），它對一組技能、一組與獎勵結構相關的目標，以及一組環境特徵建模，以預測策略在（可能未見過的）任務上的表現。我們開發了一種演算法，它使用從 SEBN 推斷出的代理成功估計，根據預期的改進來權衡可能的後續任務。我們在三個環境中評估了所得課程的好處：離散網格世界、連續控制和模擬機器人。結果顯示，使用 SEBN 建構的課程經常優於其他基準。", "author": "Vincent Hsiao et.al.", "authors": "Vincent Hsiao, Mark Roberts, Laura M. Hiatt, George Konidaris, Dana Nau", "id": "2502.15662v1", "paper_url": "http://arxiv.org/abs/2502.15662v1", "repo": "null"}}