{"2412.19215": {"publish_time": "2024-12-26", "title": "Optimizing Fantasy Sports Team Selection with Deep Reinforcement Learning", "paper_summary": "Fantasy sports, particularly fantasy cricket, have garnered immense\npopularity in India in recent years, offering enthusiasts the opportunity to\nengage in strategic team-building and compete based on the real-world\nperformance of professional athletes. In this paper, we address the challenge\nof optimizing fantasy cricket team selection using reinforcement learning (RL)\ntechniques. By framing the team creation process as a sequential\ndecision-making problem, we aim to develop a model that can adaptively select\nplayers to maximize the team's potential performance. Our approach leverages\nhistorical player data to train RL algorithms, which then predict future\nperformance and optimize team composition. This not only represents a huge\nbusiness opportunity by enabling more accurate predictions of high-performing\nteams but also enhances the overall user experience. Through empirical\nevaluation and comparison with traditional fantasy team drafting methods, we\ndemonstrate the effectiveness of RL in constructing competitive fantasy teams.\nOur results show that RL-based strategies provide valuable insights into player\nselection in fantasy sports.", "paper_summary_zh": "近年來，奇幻運動，特別是奇幻板球運動，在印度獲得了極大的\n歡迎，讓愛好者有機會參與策略性的組隊，並根據職業運動員的實際表現進行競賽。在本文中，我們將探討使用強化學習 (RL) 技術來最佳化奇幻板球隊伍選擇的挑戰。透過將球隊建立過程建構為一個循序漸進的決策制定問題，我們的目標是開發一個模型，能夠適應性地選擇球員以最大化球隊的潛在表現。我們的做法利用歷史球員數據來訓練 RL 演算法，然後預測未來的表現並最佳化球隊組成。這不僅透過更準確地預測高績效球隊而代表著巨大的商機，同時也提升了整體使用者體驗。透過經驗評估和與傳統奇幻球隊選秀方法的比較，我們展示了 RL 在建立具有競爭力的奇幻球隊方面的效能。我們的結果顯示，基於 RL 的策略提供了關於奇幻運動中球員選擇的寶貴見解。", "author": "Shamik Bhattacharjee et.al.", "authors": "Shamik Bhattacharjee, Kamlesh Marathe, Hitesh Kapoor, Nilesh Patil", "id": "2412.19215v1", "paper_url": "http://arxiv.org/abs/2412.19215v1", "repo": "null"}}