{"2412.09627": {"publish_time": "2024-12-12", "title": "Doe-1: Closed-Loop Autonomous Driving with Large World Model", "paper_summary": "End-to-end autonomous driving has received increasing attention due to its\npotential to learn from large amounts of data. However, most existing methods\nare still open-loop and suffer from weak scalability, lack of high-order\ninteractions, and inefficient decision-making. In this paper, we explore a\nclosed-loop framework for autonomous driving and propose a large Driving wOrld\nmodEl (Doe-1) for unified perception, prediction, and planning. We formulate\nautonomous driving as a next-token generation problem and use multi-modal\ntokens to accomplish different tasks. Specifically, we use free-form texts\n(i.e., scene descriptions) for perception and generate future predictions\ndirectly in the RGB space with image tokens. For planning, we employ a\nposition-aware tokenizer to effectively encode action into discrete tokens. We\ntrain a multi-modal transformer to autoregressively generate perception,\nprediction, and planning tokens in an end-to-end and unified manner.\nExperiments on the widely used nuScenes dataset demonstrate the effectiveness\nof Doe-1 in various tasks including visual question-answering,\naction-conditioned video generation, and motion planning. Code:\nhttps://github.com/wzzheng/Doe.", "paper_summary_zh": "端到端自動駕駛由於其從大量資料中學習的潛力而備受關注。然而，大多數現有方法仍然是開迴路，並受到可擴充性弱、缺乏高階互動以及決策效率低下的困擾。在本文中，我們探討了一個用於自動駕駛的閉迴路架構，並提出了一個大型駕駛世界模型 (Doe-1) 以實現統一的感知、預測和規劃。我們將自動駕駛表述為一個下一個符號生成問題，並使用多模態符號來完成不同的任務。具體來說，我們使用自由形式文本（即場景描述）進行感知，並直接在 RGB 空間中使用影像符號生成未來的預測。對於規劃，我們採用一個位置感知符號化器，將動作有效編碼成離散符號。我們訓練一個多模態Transformer，以自迴歸方式生成感知、預測和規劃符號，並以端到端和統一的方式進行。在廣泛使用的 nuScenes 資料集上進行的實驗證明了 Doe-1 在各種任務中的有效性，包括視覺問答、動作條件影片生成和動作規劃。程式碼：https://github.com/wzzheng/Doe。", "author": "Wenzhao Zheng et.al.", "authors": "Wenzhao Zheng, Zetian Xia, Yuanhui Huang, Sicheng Zuo, Jie Zhou, Jiwen Lu", "id": "2412.09627v1", "paper_url": "http://arxiv.org/abs/2412.09627v1", "repo": "https://github.com/wzzheng/doe"}}