{"2409.05806": {"publish_time": "2024-09-09", "title": "Benchmarking Chinese Knowledge Rectification in Large Language Models", "paper_summary": "While Large Language Models (LLMs) exhibit remarkable generative\ncapabilities, they are not without flaws, particularly in the form of\nhallucinations. This issue is even more pronounced when LLMs are applied to\nspecific languages and domains. For example, LLMs may generate nonsense\ninformation when handling Chinese ancient poetry, proverbs, or idioms, owing to\nthe lack of specific knowledge. To this end, this paper introduces a benchmark\nfor rectifying Chinese knowledge in LLMs via knowledge editing. Specifically,\nwe introduce a new Chinese dataset, CKnowEdit, by collecting seven type of\nknowledge from various sources, including classical texts, idioms, and content\nfrom Baidu Tieba Ruozhiba, thereby accounting for the unique polyphony,\nantithesis, and logical constructs inherent in the Chinese language. Through\nthe analysis of this dataset, we uncover the challenges faced by current LLMs\nin mastering Chinese. Furthermore, our evaluation of state-of-the-art knowledge\nediting techniques on this dataset unveil the substantial scope for advancement\nin the rectification of Chinese knowledge. Code and dataset are available at\nhttps://github.com/zjunlp/EasyEdit.", "paper_summary_zh": "大型语言模型 (LLM) 虽然表现出非凡的生成能力，但也并非没有缺陷，特别是幻觉形式的缺陷。当 LLM 应用于特定语言和领域时，这个问题更为明显。例如，由于缺乏特定知识，LLM 在处理中国古代诗歌、谚语或成语时可能会产生无意义的信息。为此，本文通过知识编辑引入了一个用于纠正 LLM 中中文知识的基准。具体来说，我们通过从各种来源（包括经典文本、成语和百度贴吧若知八的的内容）收集七种类型的知识，引入了新的中文数据集 CKnowEdit，从而解释了中文语言中固有的独特多音、对立和逻辑结构。通过对该数据集的分析，我们发现了当前 LLM 在掌握中文时面临的挑战。此外，我们对该数据集上最先进的知识编辑技术的评估揭示了纠正中文知识的巨大进步空间。代码和数据集可在 https://github.com/zjunlp/EasyEdit 获得。", "author": "Tianhe Lu et.al.", "authors": "Tianhe Lu, Jizhan Fang, Yunzhi Yao, Xin Xu, Ningyu Zhang, Huajun Chen", "id": "2409.05806v1", "paper_url": "http://arxiv.org/abs/2409.05806v1", "repo": "https://github.com/zjunlp/easyedit"}}