{"2410.21008": {"publish_time": "2024-10-28", "title": "Is GPT-4 Less Politically Biased than GPT-3.5? A Renewed Investigation of ChatGPT's Political Biases", "paper_summary": "This work investigates the political biases and personality traits of\nChatGPT, specifically comparing GPT-3.5 to GPT-4. In addition, the ability of\nthe models to emulate political viewpoints (e.g., liberal or conservative\npositions) is analyzed. The Political Compass Test and the Big Five Personality\nTest were employed 100 times for each scenario, providing statistically\nsignificant results and an insight into the results correlations. The responses\nwere analyzed by computing averages, standard deviations, and performing\nsignificance tests to investigate differences between GPT-3.5 and GPT-4.\nCorrelations were found for traits that have been shown to be interdependent in\nhuman studies. Both models showed a progressive and libertarian political bias,\nwith GPT-4's biases being slightly, but negligibly, less pronounced.\nSpecifically, on the Political Compass, GPT-3.5 scored -6.59 on the economic\naxis and -6.07 on the social axis, whereas GPT-4 scored -5.40 and -4.73. In\ncontrast to GPT-3.5, GPT-4 showed a remarkable capacity to emulate assigned\npolitical viewpoints, accurately reflecting the assigned quadrant\n(libertarian-left, libertarian-right, authoritarian-left, authoritarian-right)\nin all four tested instances. On the Big Five Personality Test, GPT-3.5 showed\nhighly pronounced Openness and Agreeableness traits (O: 85.9%, A: 84.6%). Such\npronounced traits correlate with libertarian views in human studies. While\nGPT-4 overall exhibited less pronounced Big Five personality traits, it did\nshow a notably higher Neuroticism score. Assigned political orientations\ninfluenced Openness, Agreeableness, and Conscientiousness, again reflecting\ninterdependencies observed in human studies. Finally, we observed that test\nsequencing affected ChatGPT's responses and the observed correlations,\nindicating a form of contextual memory.", "paper_summary_zh": "<paragraph>本研究调查了 ChatGPT 的政治偏见和人格特质，特别是将 GPT-3.5 与 GPT-4 进行了比较。此外，分析了模型模拟政治观点（例如，自由派或保守派立场）的能力。政治罗盘测试和大五人格测试每种情况都进行了 100 次，提供了统计学意义上的结果，并深入了解了结果之间的相关性。通过计算平均值、标准差和执行显著性检验来分析响应，以调查 GPT-3.5 和 GPT-4 之间的差异。在人类研究中已显示相互依存的特质中发现了相关性。两种模型都表现出进步和自由主义的政治偏见，而 GPT-4 的偏见略微不明显，但可以忽略不计。具体来说，在政治罗盘上，GPT-3.5 在经济轴上得分为 -6.59，在社会轴上得分为 -6.07，而 GPT-4 得分为 -5.40 和 -4.73。与 GPT-3.5 相比，GPT-4 表现出模拟指定政治观点的显着能力，准确反映了所有四种测试实例中的指定象限（自由主义左派、自由主义右派、威权主义左派、威权主义右派）。在五大性格测试中，GPT-3.5 表现出非常明显开放性和宜人性特征 (O: 85.9%，A: 84.6%)。如此明显的特质与人类研究中的自由主义观点相关。虽然 GPT-4 整体表现出不太明显的五大性格特质，但它确实显示出明显较高的神经质分数。指定的政治取向影响了开放性、宜人性、尽责性，再次反映了人类研究中观察到的相互依存性。最后，我们观察到测试顺序影响了 ChatGPT 的响应和观察到的相关性，表明了一种上下文记忆形式。</paragraph>", "author": "Erik Weber et.al.", "authors": "Erik Weber, Jérôme Rutinowski, Niklas Jost, Markus Pauly", "id": "2410.21008v1", "paper_url": "http://arxiv.org/abs/2410.21008v1", "repo": "null"}}