{"2501.00958": {"publish_time": "2025-01-01", "title": "2.5 Years in Class: A Multimodal Textbook for Vision-Language Pretraining", "paper_summary": "Compared to image-text pair data, interleaved corpora enable Vision-Language\nModels (VLMs) to understand the world more naturally like humans. However, such\nexisting datasets are crawled from webpage, facing challenges like low\nknowledge density, loose image-text relations, and poor logical coherence\nbetween images. On the other hand, the internet hosts vast instructional videos\n(e.g., online geometry courses) that are widely used by humans to learn\nfoundational subjects, yet these valuable resources remain underexplored in VLM\ntraining. In this paper, we introduce a high-quality \\textbf{multimodal\ntextbook} corpus with richer foundational knowledge for VLM pretraining. It\ncollects over 2.5 years of instructional videos, totaling 22,000 class hours.\nWe first use an LLM-proposed taxonomy to systematically gather instructional\nvideos. Then we progressively extract and refine visual (keyframes), audio\n(ASR), and textual knowledge (OCR) from the videos, and organize as an\nimage-text interleaved corpus based on temporal order. Compared to its\ncounterparts, our video-centric textbook offers more coherent context, richer\nknowledge, and better image-text alignment. Experiments demonstrate its superb\npretraining performance, particularly in knowledge- and reasoning-intensive\ntasks like ScienceQA and MathVista. Moreover, VLMs pre-trained on our textbook\nexhibit outstanding interleaved context awareness, leveraging visual and\ntextual cues in their few-shot context for task solving~\\footnote{Our code are\navailable at \\url{https://github.com/DAMO-NLP-SG/multimodal_textbook}}.", "paper_summary_zh": "<paragraph>與影像文字配對資料相比，交錯語料庫能讓視覺語言模型 (VLM) 更像人類一樣自然地理解世界。然而，此類現有資料集是由網頁爬取而來，面臨知識密度低、影像文字關係鬆散，以及影像間邏輯連貫性差的挑戰。另一方面，網際網路上有大量教學影片（例如線上幾何課程），被廣泛用於人類學習基礎科目，但這些寶貴資源在 VLM 訓練中仍未被充分探索。在本文中，我們引入了具有豐富基礎知識的高品質**多模態教科書**語料庫，用於 VLM 預訓練。它收集了超過 2.5 年的教學影片，總計 22,000 小時的課程。我們首先使用 LLM 提出的分類法系統性地收集教學影片。然後，我們逐步從影片中萃取和精煉視覺（關鍵影格）、音訊（ASR）和文字知識（OCR），並根據時間順序組織成影像文字交錯語料庫。與其對應的教科書相比，我們以影片為中心的教科書提供了更連貫的脈絡、更豐富的知識，以及更好的影像文字對齊。實驗證明了它優異的預訓練效能，特別是在需要知識和推理的任務中，例如 ScienceQA 和 MathVista。此外，在我們的教科書上預訓練的 VLM 展現出傑出的交錯脈絡感知能力，在任務解決中運用視覺和文字提示進行少量次數的脈絡推論~\\footnote{我們的程式碼可在 \\url{https://github.com/DAMO-NLP-SG/multimodal_textbook} 取得}。</paragraph>", "author": "Wenqi Zhang et.al.", "authors": "Wenqi Zhang, Hang Zhang, Xin Li, Jiashuo Sun, Yongliang Shen, Weiming Lu, Deli Zhao, Yueting Zhuang, Lidong Bing", "id": "2501.00958v1", "paper_url": "http://arxiv.org/abs/2501.00958v1", "repo": "null"}}