{"2407.08454": {"publish_time": "2024-07-11", "title": "Model Tells You Where to Merge: Adaptive KV Cache Merging for LLMs on Long-Context Tasks", "paper_summary": "How to efficiently serve Large Language Models (LLMs) has become a pressing\nissue because of their huge computational cost in their autoregressive\ngeneration process. To mitigate computational costs, LLMs often employ the KV\nCache technique to improve the generation speed. While improving the\ncomputational efficiency, the storage requirements of the KV cache are\nsubstantial, particularly in long-context scenarios, leading to significant\nmemory consumption. Existing KV cache eviction methods often degrade the\nperformance of LLMs in long-context scenarios due to the information loss\nintroduced by eviction. In this paper, we propose a novel KV cache merging\napproach, called KVMerger, to achieve adaptive KV cache compression for\nlong-context tasks without significant performance degradation under\nconstrained memory budgets. Our approach is inspired by the intriguing\nobservation that key states exhibit high similarity at the token level within a\nsingle sequence. To facilitate merging, we develop an effective yet\nstraightforward merging set identification algorithm to identify suitable KV\nstates for merging. Our merging set identification algorithm stimulates the\nsecond observation that KV cache sparsity, from similarity perspective, is\nindependent of the dataset and remains persistent at the model level.\nSubsequently, we propose a Gaussian kernel weighted merging algorithm to\nselectively merge all states within each merging set. We conduct extensive\nexperiments to demonstrate the effectiveness of KVMerger for long-context tasks\nunder constrained memory budgets, applying it to models including\nLlama2-7B-chat and Llama2-13B-chat. Using the LongBench and ZeroScroll\nbenchmarks, we compare our method with other KV cache compression techniques,\nincluding H2O and CaM, showing that our method achieves superior performance\nacross tasks with both 50% and 35% KV cache budgets.", "paper_summary_zh": "<paragraph>如何有效地提供大型语言模型 (LLM) 已成为一项紧迫的问题，因为它们在自回归生成过程中的计算成本巨大。为了降低计算成本，LLM 经常采用 KV 缓存技术来提高生成速度。虽然提高了计算效率，但 KV 缓存的存储需求很大，尤其是在长上下文场景中，从而导致了大量的内存消耗。现有的 KV 缓存驱逐方法通常会因驱逐引入的信息丢失而降低 LLM 在长上下文场景中的性能。在本文中，我们提出了一种新颖的 KV 缓存合并方法，称为 KVMerger，以实现自适应 KV 缓存压缩，用于在受限内存预算下进行长上下文任务，而不会显着降低性能。我们的方法受到以下有趣观察的启发：关键状态在单个序列中的标记级别表现出高度相似性。为了促进合并，我们开发了一种有效且直接的合并集识别算法，以识别适合合并的 KV 状态。我们的合并集识别算法激发了第二个观察结果，即从相似性的角度来看，KV 缓存稀疏性与数据集无关，并且在模型级别保持不变。随后，我们提出了一种高斯核加权合并算法，以选择性地合并每个合并集中的所有状态。我们进行了广泛的实验，以证明 KVMerger 在受限内存预算下对长上下文任务的有效性，将其应用于包括 Llama2-7B-chat 和 Llama2-13B-chat 在内的模型。使用 LongBench 和 ZeroScroll 基准，我们将我们的方法与其他 KV 缓存压缩技术（包括 H2O 和 CaM）进行了比较，结果表明我们的方法在 KV 缓存预算为 50% 和 35% 的所有任务中都取得了卓越的性能。</paragraph>", "author": "Zheng Wang et.al.", "authors": "Zheng Wang, Boxiao Jin, Zhongzhi Yu, Minjia Zhang", "id": "2407.08454v1", "paper_url": "http://arxiv.org/abs/2407.08454v1", "repo": "null"}}