{"2412.03824": {"publish_time": "2024-12-05", "title": "Towards Data Governance of Frontier AI Models", "paper_summary": "Data is essential to train and fine-tune today's frontier artificial\nintelligence (AI) models and to develop future ones. To date, academic, legal,\nand regulatory work has primarily addressed how data can directly harm\nconsumers and creators, such as through privacy breaches, copyright\ninfringements, and bias and discrimination. Our work, instead, focuses on the\ncomparatively neglected question of how data can enable new governance\ncapacities for frontier AI models. This approach for \"frontier data governance\"\nopens up new avenues for monitoring and mitigating risks from advanced AI\nmodels, particularly as they scale and acquire specific dangerous capabilities.\nStill, frontier data governance faces challenges that stem from the fundamental\nproperties of data itself: data is non-rival, often non-excludable, easily\nreplicable, and increasingly synthesizable. Despite these inherent\ndifficulties, we propose a set of policy mechanisms targeting key actors along\nthe data supply chain, including data producers, aggregators, model developers,\nand data vendors. We provide a brief overview of 15 governance mechanisms, of\nwhich we centrally introduce five, underexplored policy recommendations. These\ninclude developing canary tokens to detect unauthorized use for producers;\n(automated) data filtering to remove malicious content for pre-training and\npost-training datasets; mandatory dataset reporting requirements for developers\nand vendors; improved security for datasets and data generation algorithms; and\nknow-your-customer requirements for vendors. By considering data not just as a\nsource of potential harm, but as a critical governance lever, this work aims to\nequip policymakers with a new tool for the governance and regulation of\nfrontier AI models.", "paper_summary_zh": "<paragraph>資料對於訓練和微調現今最前沿的人工智慧 (AI) 模型，以及開發未來的模型至關重要。迄今為止，學術、法律和法規工作主要探討資料如何直接損害消費者和創作者，例如透過隱私權外洩、侵犯著作權以及偏見和歧視。然而，我們的研究專注於一個相對被忽略的問題：資料如何為最前沿的 AI 模型啟用新的治理能力。這種「最前沿資料治理」方法開啟了新的途徑，用於監控和降低先進 AI 模型的風險，特別是在這些模型擴展規模並獲取特定危險能力時。儘管如此，最前沿資料治理仍面臨著源自資料本身基本屬性的挑戰：資料是非競爭性的、通常是非排他性的、容易複製的，而且越來越容易合成。儘管存在這些固有的困難，我們提出了一組政策機制，針對資料供應鏈中的關鍵參與者，包括資料生產者、彙總者、模型開發者和資料供應商。我們簡要概述了 15 項治理機制，其中我們重點介紹了五項未被充分探討的政策建議。這些建議包括：為生產者開發金絲雀代幣以偵測未經授權的使用；(自動) 資料過濾以移除預訓練和後訓練資料集中的惡意內容；強制性資料集報告要求，適用於開發者和供應商；改善資料集和資料生成演算法的安全性；以及供應商的認識客戶要求。透過將資料視為不僅是潛在危害的來源，也是重要的治理槓桿，這項研究旨在為政策制定者提供一個新的工具，用於最前沿 AI 模型的治理和法規。</paragraph>", "author": "Jason Hausenloy et.al.", "authors": "Jason Hausenloy, Duncan McClements, Madhavendra Thakur", "id": "2412.03824v1", "paper_url": "http://arxiv.org/abs/2412.03824v1", "repo": "null"}}