{"2409.16218": {"publish_time": "2024-09-24", "title": "Problem-oriented AutoML in Clustering", "paper_summary": "The Problem-oriented AutoML in Clustering (PoAC) framework introduces a\nnovel, flexible approach to automating clustering tasks by addressing the\nshortcomings of traditional AutoML solutions. Conventional methods often rely\non predefined internal Clustering Validity Indexes (CVIs) and static\nmeta-features, limiting their adaptability and effectiveness across diverse\nclustering tasks. In contrast, PoAC establishes a dynamic connection between\nthe clustering problem, CVIs, and meta-features, allowing users to customize\nthese components based on the specific context and goals of their task. At its\ncore, PoAC employs a surrogate model trained on a large meta-knowledge base of\nprevious clustering datasets and solutions, enabling it to infer the quality of\nnew clustering pipelines and synthesize optimal solutions for unseen datasets.\nUnlike many AutoML frameworks that are constrained by fixed evaluation metrics\nand algorithm sets, PoAC is algorithm-agnostic, adapting seamlessly to\ndifferent clustering problems without requiring additional data or retraining.\nExperimental results demonstrate that PoAC not only outperforms\nstate-of-the-art frameworks on a variety of datasets but also excels in\nspecific tasks such as data visualization, and highlight its ability to\ndynamically adjust pipeline configurations based on dataset complexity.", "paper_summary_zh": "問題導向式叢集自動化機器學習 (PoAC) 架構導入了一種\n新穎且彈性的方法來自動化叢集任務，解決傳統自動化機器學習\n解決方案的缺點。傳統方法通常依賴預先定義的內部叢集有效性\n指標 (CVI) 和靜態元特徵，這限制了其在不同叢集任務中的適應\n性和有效性。相反，PoAC 在叢集問題、CVI 和元特徵之間建立了\n動態連接，使用戶能夠根據其任務的特定背景和目標自訂這些\n組成部分。PoAC 的核心採用一個代理模型，該模型訓練於一個\n大型元知識庫，其中包含先前的叢集資料集和解決方案，使其能\n夠推斷新叢集管線的品質，並為未見資料集綜合最佳解決方案。\n與許多受限於固定評估指標和演算法集的自動化機器學習架構\n不同，PoAC 與演算法無關，能無縫地適應不同的叢集問題，而\n無需額外資料或重新訓練。實驗結果證明，PoAC 不僅在各種資料\n集上優於最先進的架構，而且在特定任務（例如資料視覺化）中\n也表現出色，並突顯了其根據資料集複雜性動態調整管線組態的\n能力。", "author": "Matheus Camilo da Silva et.al.", "authors": "Matheus Camilo da Silva, Gabriel Marques Tavares, Eric Medvet, Sylvio Barbon Junior", "id": "2409.16218v1", "paper_url": "http://arxiv.org/abs/2409.16218v1", "repo": "null"}}