{"2502.09757": {"publish_time": "2025-02-13", "title": "The AI-Therapist Duo: Exploring the Potential of Human-AI Collaboration in Personalized Art Therapy for PICS Intervention", "paper_summary": "Post-intensive care syndrome (PICS) is a multifaceted condition that arises\nfrom prolonged stays in an intensive care unit (ICU). While preventing PICS\namong ICU patients is becoming increasingly important, interventions remain\nlimited. Building on evidence supporting the effectiveness of art exposure in\naddressing the psychological aspects of PICS, we propose a novel art therapy\nsolution through a collaborative Human-AI approach that enhances personalized\ntherapeutic interventions using state-of-the-art Visual Art Recommendation\nSystems. We developed two Human-in-the-Loop (HITL) personalization methods and\nassessed their impact through a large-scale user study (N=150). Our findings\ndemonstrate that this Human-AI collaboration not only enhances the\npersonalization and effectiveness of art therapy but also supports therapists\nby streamlining their workload. While our study centres on PICS intervention,\nthe results suggest that human-AI collaborative Art therapy could potentially\nbenefit other areas where emotional support is critical, such as cases of\nanxiety and depression.", "paper_summary_zh": "重症後症候群 (PICS) 是一種多面向的疾病，源自於在加護病房 (ICU) 長期住院。雖然預防重症後症候群在加護病房患者中正變得越來越重要，但介入措施仍然有限。建立在支持藝術接觸在解決重症後症候群心理層面的證據上，我們提出一個創新的藝術療法解決方案，透過協作式的人工智慧方法，使用最先進的視覺藝術推薦系統，增強個人化的治療介入。我們開發了兩種人機迴路 (HITL) 個人化方法，並透過大規模使用者研究 (N=150) 評估其影響。我們的發現證明，這種人機協作不僅增強了藝術治療的個人化和有效性，也透過簡化治療師的工作量來提供支援。雖然我們的研究中心在重症後症候群介入，但結果顯示，人機協作藝術療法有可能對其他需要情緒支持的領域有益，例如焦慮和憂鬱症。", "author": "Bereket A. Yilma et.al.", "authors": "Bereket A. Yilma, Chan Mi Kim, Geke Ludden, Thomas van Rompay, Luis A. Leiva", "id": "2502.09757v1", "paper_url": "http://arxiv.org/abs/2502.09757v1", "repo": "null"}}