{"2407.16198": {"publish_time": "2024-07-23", "title": "INF-LLaVA: Dual-perspective Perception for High-Resolution Multimodal Large Language Model", "paper_summary": "With advancements in data availability and computing resources, Multimodal\nLarge Language Models (MLLMs) have showcased capabilities across various\nfields. However, the quadratic complexity of the vision encoder in MLLMs\nconstrains the resolution of input images. Most current approaches mitigate\nthis issue by cropping high-resolution images into smaller sub-images, which\nare then processed independently by the vision encoder. Despite capturing\nsufficient local details, these sub-images lack global context and fail to\ninteract with one another. To address this limitation, we propose a novel MLLM,\nINF-LLaVA, designed for effective high-resolution image perception. INF-LLaVA\nincorporates two innovative components. First, we introduce a Dual-perspective\nCropping Module (DCM), which ensures that each sub-image contains continuous\ndetails from a local perspective and comprehensive information from a global\nperspective. Second, we introduce Dual-perspective Enhancement Module (DEM) to\nenable the mutual enhancement of global and local features, allowing INF-LLaVA\nto effectively process high-resolution images by simultaneously capturing\ndetailed local information and comprehensive global context. Extensive ablation\nstudies validate the effectiveness of these components, and experiments on a\ndiverse set of benchmarks demonstrate that INF-LLaVA outperforms existing\nMLLMs. Code and pretrained model are available at\nhttps://github.com/WeihuangLin/INF-LLaVA.", "paper_summary_zh": "隨著數據可用性和運算資源的進步，多模態大型語言模型 (MLLM) 已在各個領域展示其能力。然而，MLLM 中視覺編碼器的二次複雜度限制了輸入影像解析度。目前大多數方法透過將高解析度影像裁切成較小的子影像來緩解此問題，然後由視覺編碼器獨立處理。儘管捕捉到足夠的局部細節，但這些子影像缺乏全局脈絡，且無法彼此互動。為了解決此限制，我們提出一個新穎的 MLLM，INF-LLaVA，旨在有效感知高解析度影像。INF-LLaVA 結合了兩個創新的組成部分。首先，我們引入一個雙視角裁切模組 (DCM)，確保每個子影像從局部視角包含連續的細節，並從全局視角包含全面的資訊。其次，我們引入雙視角增強模組 (DEM)，以實現全局和局部特徵的相互增強，讓 INF-LLaVA 能夠同時捕捉詳細的局部資訊和全面的全局脈絡，有效處理高解析度影像。廣泛的消融研究驗證了這些組成部分的有效性，且在各種基準測試上的實驗證明 INF-LLaVA 優於現有的 MLLM。程式碼和預訓練模型可在 https://github.com/WeihuangLin/INF-LLaVA 取得。", "author": "Yiwei Ma et.al.", "authors": "Yiwei Ma, Zhibin Wang, Xiaoshuai Sun, Weihuang Lin, Qiang Zhou, Jiayi Ji, Rongrong Ji", "id": "2407.16198v1", "paper_url": "http://arxiv.org/abs/2407.16198v1", "repo": "https://github.com/weihuanglin/inf-llava"}}