{"2502.01968": {"publish_time": "2025-02-04", "title": "Token Cleaning: Fine-Grained Data Selection for LLM Supervised Fine-Tuning", "paper_summary": "Recent studies show that in supervised fine-tuning (SFT) of large language\nmodels (LLMs), data quality matters more than quantity. While most data\ncleaning methods concentrate on filtering entire samples, the quality of\nindividual tokens within a sample can vary significantly. After pre-training,\neven in high-quality samples, patterns or phrases that are not task-related can\nbe redundant or uninformative. Continuing to fine-tune on these patterns may\noffer limited benefit and even degrade downstream task performance. In this\npaper, we investigate token quality from a noisy-label perspective and propose\na generic token cleaning pipeline for SFT tasks. Our method filters out\nuninformative tokens while preserving those carrying key task-specific\ninformation. Specifically, we first evaluate token quality by examining the\ninfluence of model updates on each token, then apply a threshold-based\nseparation. The token influence can be measured in a single pass with a fixed\nreference model or iteratively with self-evolving reference models. The\nbenefits and limitations of both methods are analyzed theoretically by error\nupper bounds. Extensive experiments show that our framework consistently\nimproves performance across multiple downstream tasks.", "paper_summary_zh": "最近的研究表明，在大语言模型 (LLM) 的监督微调 (SFT) 中，数据质量比数量更重要。虽然大多数数据清理方法专注于过滤整个样本，但样本中各个标记的质量可能差异很大。经过预训练后，即使在高质量样本中，与任务无关的模式或短语也可能是冗余或无信息的。继续对这些模式进行微调可能只会带来有限的好处，甚至会降低下游任务的性能。在本文中，我们从噪声标签的角度研究标记质量，并为 SFT 任务提出了一个通用的标记清理管道。我们的方法过滤掉无信息的标记，同时保留那些携带关键任务特定信息的标记。具体来说，我们首先通过检查模型更新对每个标记的影响来评估标记质量，然后应用基于阈值的分割。标记影响可以通过使用固定参考模型单次测量，或使用自进化参考模型迭代测量。通过误差上限对这两种方法的优点和局限性进行了理论分析。大量的实验表明，我们的框架在多个下游任务中始终如一地提高了性能。", "author": "Jinlong Pang et.al.", "authors": "Jinlong Pang, Na Di, Zhaowei Zhu, Jiaheng Wei, Hao Cheng, Chen Qian, Yang Liu", "id": "2502.01968v1", "paper_url": "http://arxiv.org/abs/2502.01968v1", "repo": "null"}}