{"2410.16090": {"publish_time": "2024-10-21", "title": "Analysing the Residual Stream of Language Models Under Knowledge Conflicts", "paper_summary": "Large language models (LLMs) can store a significant amount of factual\nknowledge in their parameters. However, their parametric knowledge may conflict\nwith the information provided in the context. Such conflicts can lead to\nundesirable model behaviour, such as reliance on outdated or incorrect\ninformation. In this work, we investigate whether LLMs can identify knowledge\nconflicts and whether it is possible to know which source of knowledge the\nmodel will rely on by analysing the residual stream of the LLM. Through probing\ntasks, we find that LLMs can internally register the signal of knowledge\nconflict in the residual stream, which can be accurately detected by probing\nthe intermediate model activations. This allows us to detect conflicts within\nthe residual stream before generating the answers without modifying the input\nor model parameters. Moreover, we find that the residual stream shows\nsignificantly different patterns when the model relies on contextual knowledge\nversus parametric knowledge to resolve conflicts. This pattern can be employed\nto estimate the behaviour of LLMs when conflict happens and prevent unexpected\nanswers before producing the answers. Our analysis offers insights into how\nLLMs internally manage knowledge conflicts and provides a foundation for\ndeveloping methods to control the knowledge selection processes.", "paper_summary_zh": "大型語言模型 (LLM) 可以將大量的實際知識儲存在其參數中。然而，它們的參數化知識可能與文中提供的資訊相衝突。此類衝突可能會導致不理想的模型行為，例如依賴於過時或不正確的資訊。在這項工作中，我們探討 LLM 是否能識別知識衝突，以及是否可以透過分析 LLM 的殘差流來得知模型將依賴於哪個知識來源。透過探測任務，我們發現 LLM 能在殘差流中內部註冊知識衝突訊號，而這能透過探測中間模型的激活來準確地偵測。這讓我們得以在產生答案之前偵測殘差流中的衝突，而無需修改輸入或模型參數。此外，我們發現當模型依賴於脈絡知識與參數化知識來解決衝突時，殘差流會顯示出顯著不同的模式。此模式可用於預測 LLM 在發生衝突時的行為，並在產生答案之前防止出現意外的答案。我們的分析提供了 LLM 如何在內部管理知識衝突的見解，並為開發控制知識選擇程序的方法奠定了基礎。", "author": "Yu Zhao et.al.", "authors": "Yu Zhao, Xiaotang Du, Giwon Hong, Aryo Pradipta Gema, Alessio Devoto, Hongru Wang, Xuanli He, Kam-Fai Wong, Pasquale Minervini", "id": "2410.16090v1", "paper_url": "http://arxiv.org/abs/2410.16090v1", "repo": "null"}}