{"2501.04995": {"publish_time": "2025-01-09", "title": "IPDN: Image-enhanced Prompt Decoding Network for 3D Referring Expression Segmentation", "paper_summary": "3D Referring Expression Segmentation (3D-RES) aims to segment point cloud\nscenes based on a given expression. However, existing 3D-RES approaches face\ntwo major challenges: feature ambiguity and intent ambiguity. Feature ambiguity\narises from information loss or distortion during point cloud acquisition due\nto limitations such as lighting and viewpoint. Intent ambiguity refers to the\nmodel's equal treatment of all queries during the decoding process, lacking\ntop-down task-specific guidance. In this paper, we introduce an Image enhanced\nPrompt Decoding Network (IPDN), which leverages multi-view images and\ntask-driven information to enhance the model's reasoning capabilities. To\naddress feature ambiguity, we propose the Multi-view Semantic Embedding (MSE)\nmodule, which injects multi-view 2D image information into the 3D scene and\ncompensates for potential spatial information loss. To tackle intent ambiguity,\nwe designed a Prompt-Aware Decoder (PAD) that guides the decoding process by\nderiving task-driven signals from the interaction between the expression and\nvisual features. Comprehensive experiments demonstrate that IPDN outperforms\nthe state-ofthe-art by 1.9 and 4.2 points in mIoU metrics on the 3D-RES and\n3D-GRES tasks, respectively.", "paper_summary_zh": "3D 參考表達分割 (3D-RES) 旨在根據給定的表達式對點雲場景進行分割。然而，現有的 3D-RES 方法面臨兩大挑戰：特徵模糊和意圖模糊。特徵模糊是由於點雲採集過程中由於照明和視點等限制而導致的信息丟失或失真。意圖模糊是指模型在解碼過程中對所有查詢進行平等處理，缺乏自上而下的任務特定指導。在本文中，我們引入了一個圖像增強提示解碼網絡 (IPDN)，它利用多視圖圖像和任務驅動信息來增強模型的推理能力。為了解決特徵模糊的問題，我們提出了多視圖語義嵌入 (MSE) 模塊，它將多視圖 2D 圖像信息注入到 3D 場景中，並彌補了潛在的空間信息丟失。為了解決意圖模糊的問題，我們設計了一個提示感知解碼器 (PAD)，它通過從表達式和視覺特徵之間的交互中推導出任務驅動信號來指導解碼過程。綜合實驗表明，IPDN 在 3D-RES 和 3D-GRES 任務的 mIoU 指標上分別比最先進的技術高出 1.9 和 4.2 個點。", "author": "Qi Chen et.al.", "authors": "Qi Chen, Changli Wu, Jiayi Ji, Yiwei Ma, Danni Yang, Xiaoshuai Sun", "id": "2501.04995v1", "paper_url": "http://arxiv.org/abs/2501.04995v1", "repo": "null"}}