{"2410.17886": {"publish_time": "2024-10-23", "title": "SpeakGer: A meta-data enriched speech corpus of German state and federal parliaments", "paper_summary": "The application of natural language processing on political texts as well as\nspeeches has become increasingly relevant in political sciences due to the\nability to analyze large text corpora which cannot be read by a single person.\nBut such text corpora often lack critical meta information, detailing for\ninstance the party, age or constituency of the speaker, that can be used to\nprovide an analysis tailored to more fine-grained research questions. To enable\nresearchers to answer such questions with quantitative approaches such as\nnatural language processing, we provide the SpeakGer data set, consisting of\nGerman parliament debates from all 16 federal states of Germany as well as the\nGerman Bundestag from 1947-2023, split into a total of 10,806,105 speeches.\nThis data set includes rich meta data in form of information on both reactions\nfrom the audience towards the speech as well as information about the speaker's\nparty, their age, their constituency and their party's political alignment,\nwhich enables a deeper analysis. We further provide three exploratory analyses,\ndetailing topic shares of different parties throughout time, a descriptive\nanalysis of the development of the age of an average speaker as well as a\nsentiment analysis of speeches of different parties with regards to the\nCOVID-19 pandemic.", "paper_summary_zh": "自然語言處理在政治文本和演講中的應用，由於分析單人無法讀完的大量文本語料庫的能力，在政治科學中變得越來越重要。但這些文本語料庫常常缺乏關鍵的元資訊，例如演講者的政黨、年齡或選區，這些資訊可用於提供針對更精細的研究問題量身打造的分析。為了讓研究人員能夠以自然語言處理等量化方法來回答這些問題，我們提供了 SpeakGer 資料集，其中包含來自德國所有 16 個聯邦州以及 1947-2023 年德國聯邦議院的德語議會辯論，共分為 10,806,105 篇演講。此資料集包含豐富的元資料，以觀眾對演講的反應資訊以及演講者的政黨、年齡、選區和政黨的政治立場資訊的形式呈現，這使得更深入的分析成為可能。我們進一步提供了三項探索性分析，詳細說明了不同政黨隨著時間推移的主題份額、對平均演講者年齡發展的描述性分析以及針對不同政黨在 COVID-19 大流行方面的演講的情緒分析。", "author": "Kai-Robin Lange et.al.", "authors": "Kai-Robin Lange, Carsten Jentsch", "id": "2410.17886v1", "paper_url": "http://arxiv.org/abs/2410.17886v1", "repo": "null"}}