{"2412.15540": {"publish_time": "2024-12-20", "title": "MRAG: A Modular Retrieval Framework for Time-Sensitive Question Answering", "paper_summary": "Understanding temporal relations and answering time-sensitive questions is\ncrucial yet a challenging task for question-answering systems powered by large\nlanguage models (LLMs). Existing approaches either update the parametric\nknowledge of LLMs with new facts, which is resource-intensive and often\nimpractical, or integrate LLMs with external knowledge retrieval (i.e.,\nretrieval-augmented generation). However, off-the-shelf retrievers often\nstruggle to identify relevant documents that require intensive temporal\nreasoning. To systematically study time-sensitive question answering, we\nintroduce the TempRAGEval benchmark, which repurposes existing datasets by\nincorporating temporal perturbations and gold evidence labels. As anticipated,\nall existing retrieval methods struggle with these temporal reasoning-intensive\nquestions. We further propose Modular Retrieval (MRAG), a trainless framework\nthat includes three modules: (1) Question Processing that decomposes question\ninto a main content and a temporal constraint; (2) Retrieval and Summarization\nthat retrieves evidence and uses LLMs to summarize according to the main\ncontent; (3) Semantic-Temporal Hybrid Ranking that scores each evidence\nsummarization based on both semantic and temporal relevance. On TempRAGEval,\nMRAG significantly outperforms baseline retrievers in retrieval performance,\nleading to further improvements in final answer accuracy.", "paper_summary_zh": "理解時間關係和回答時間敏感問題對於由大型語言模型 (LLM) 支援的問題回答系統至關重要，但卻是一項具有挑戰性的任務。現有方法會使用新事實更新 LLM 的參數化知識，這需要大量資源且通常不切實際，或將 LLM 與外部知識擷取整合（即擷取增強生成）。然而，現成的擷取器通常難以識別需要大量時間推理相關文件。為了系統性地研究時間敏感問題回答，我們引入了 TempRAGEval 基準，它透過整合時間擾動和黃金證據標籤，重新利用現有資料集。正如預期，所有現有擷取方法都難以處理這些時間推理密集的問題。我們進一步提出模組化擷取 (MRAG)，這是一個無訓練架構，包含三個模組：(1) 問題處理，將問題分解成主要內容和時間約束；(2) 擷取和摘要，擷取證據並使用 LLM 根據主要內容進行摘要；(3) 語義時間混合排名，根據語義和時間相關性對每個證據摘要進行評分。在 TempRAGEval 上，MRAG 在擷取效能上顯著優於基準擷取器，進而提升最終答案準確性。", "author": "Zhang Siyue et.al.", "authors": "Zhang Siyue, Xue Yuxiang, Zhang Yiming, Wu Xiaobao, Luu Anh Tuan, Zhao Chen", "id": "2412.15540v1", "paper_url": "http://arxiv.org/abs/2412.15540v1", "repo": "null"}}