{"2405.08223": {"publish_time": "2024-05-13", "title": "An information-theoretic model of shallow and deep language comprehension", "paper_summary": "A large body of work in psycholinguistics has focused on the idea that online\nlanguage comprehension can be shallow or `good enough': given constraints on\ntime or available computation, comprehenders may form interpretations of their\ninput that are plausible but inaccurate. However, this idea has not yet been\nlinked with formal theories of computation under resource constraints. Here we\nuse information theory to formulate a model of language comprehension as an\noptimal trade-off between accuracy and processing depth, formalized as bits of\ninformation extracted from the input, which increases with processing time. The\nmodel provides a measure of processing effort as the change in processing\ndepth, which we link to EEG signals and reading times. We validate our theory\nagainst a large-scale dataset of garden path sentence reading times, and EEG\nexperiments featuring N400, P600 and biphasic ERP effects. By quantifying the\ntimecourse of language processing as it proceeds from shallow to deep, our\nmodel provides a unified framework to explain behavioral and neural signatures\nof language comprehension.", "paper_summary_zh": "大量的心理语言学研究集中在这样一个观念上，即在线语言理解可以是肤浅的或“足够好的”：鉴于时间或可用计算的限制，理解者可能会对输入形成似是而非的解释。然而，这个观念尚未与资源约束下的形式计算理论联系起来。在这里，我们利用信息论来构建一个语言理解模型，作为准确性和处理深度之间的最优权衡，形式化为从输入中提取的信息比特，它随着处理时间而增加。该模型提供了处理工作量的衡量标准，即处理深度的变化，我们将其与脑电图信号和阅读时间联系起来。我们针对大规模的花园路径句子阅读时间数据集验证了我们的理论，以及具有 N400、P600 和双相 ERP 效应的脑电图实验。通过量化语言处理从浅到深的时间过程，我们的模型提供了一个统一的框架来解释语言理解的行为和神经特征。", "author": "Jiaxuan Li et.al.", "authors": "Jiaxuan Li, Richard Futrell", "id": "2405.08223v1", "paper_url": "http://arxiv.org/abs/2405.08223v1", "repo": "null"}}