{"2501.14114": {"publish_time": "2025-01-23", "title": "LeCoPCR: Legal Concept-guided Prior Case Retrieval for European Court of Human Rights cases", "paper_summary": "Prior case retrieval (PCR) is crucial for legal practitioners to find\nrelevant precedent cases given the facts of a query case. Existing approaches\noften overlook the underlying semantic intent in determining relevance with\nrespect to the query case. In this work, we propose LeCoPCR, a novel approach\nthat explicitly generate intents in the form of legal concepts from a given\nquery case facts and then augments the query with these concepts to enhance\nmodels understanding of semantic intent that dictates relavance. To overcome\nthe unavailability of annotated legal concepts, we employ a weak supervision\napproach to extract key legal concepts from the reasoning section using\nDeterminantal Point Process (DPP) to balance quality and diversity.\nExperimental results on the ECtHR-PCR dataset demonstrate the effectiveness of\nleveraging legal concepts and DPP-based key concept extraction.", "paper_summary_zh": "先例檢索 (PCR) 對法律從業人員而言至關重要，能根據查詢案例的事實找到相關的判例。現有方法在確定與查詢案例相關性時，經常忽略基礎語意意圖。在這項工作中，我們提出 LeCoPCR，一種創新的方法，能從給定的查詢案例事實中以法律概念的形式明確產生意圖，然後使用這些概念擴充查詢，以增強模型對語意意圖的理解，而語意意圖決定了相關性。為了克服標註法律概念的不可用性，我們採用弱監督方法，使用行列式點過程 (DPP) 從推理部分中萃取關鍵法律概念，以平衡品質和多樣性。在 ECtHR-PCR 資料集上的實驗結果證明了利用法律概念和基於 DPP 的關鍵概念萃取的有效性。", "author": "T. Y. S. S. Santosh et.al.", "authors": "T. Y. S. S. Santosh, Isaac Misael Olguín Nolasco, Matthias Grabmair", "id": "2501.14114v1", "paper_url": "http://arxiv.org/abs/2501.14114v1", "repo": "null"}}