{"2504.20970": {"publish_time": "2025-04-29", "title": "SVD Based Least Squares for X-Ray Pneumonia Classification Using Deep Features", "paper_summary": "Accurate and early diagnosis of pneumonia through X-ray imaging is essential\nfor effective treatment and improved patient outcomes. Recent advancements in\nmachine learning have enabled automated diagnostic tools that assist\nradiologists in making more reliable and efficient decisions. In this work, we\npropose a Singular Value Decomposition-based Least Squares (SVD-LS) framework\nfor multi-class pneumonia classification, leveraging powerful feature\nrepresentations from state-of-the-art self-supervised and transfer learning\nmodels. Rather than relying on computationally expensive gradient based\nfine-tuning, we employ a closed-form, non-iterative classification approach\nthat ensures efficiency without compromising accuracy. Experimental results\ndemonstrate that SVD-LS achieves competitive performance while offering\nsignificantly reduced computational costs, making it a viable alternative for\nreal-time medical imaging applications.", "paper_summary_zh": "<paragraph>透過 X 光影像進行準確且及時的肺炎診斷對於有效治療和改善患者預後至關重要。機器學習的最新進展促成了自動化診斷工具的發展，這些工具可以協助放射科醫師做出更可靠、更有效率的決策。 在這項研究中，我們提出了一個基於奇異值分解最小二乘法 (SVD-LS) 的多類型肺炎分類框架，它利用了最先進的自監督和遷移學習模型中強大的特徵表示。我們沒有依賴計算成本高昂的基於梯度的微調，而是採用了一種封閉式、非迭代的分類方法，在確保效率的同時不影響準確性。實驗結果表明，SVD-LS 在實現具競爭力的性能的同時，顯著降低了計算成本，使其成為即時醫學影像應用中可行的替代方案。</paragraph>\n", "author": "Mete Erdogan et.al.", "authors": "Mete Erdogan, Sebnem Demirtas", "id": "2504.20970v1", "paper_url": "http://arxiv.org/abs/2504.20970v1", "repo": "null"}}