{"2411.16425": {"publish_time": "2024-11-25", "title": "TopV-Nav: Unlocking the Top-View Spatial Reasoning Potential of MLLM for Zero-shot Object Navigation", "paper_summary": "The Zero-Shot Object Navigation (ZSON) task requires embodied agents to find\na previously unseen object by navigating in unfamiliar environments. Such a\ngoal-oriented exploration heavily relies on the ability to perceive,\nunderstand, and reason based on the spatial information of the environment.\nHowever, current LLM-based approaches convert visual observations to language\ndescriptions and reason in the linguistic space, leading to the loss of spatial\ninformation. In this paper, we introduce TopV-Nav, a MLLM-based method that\ndirectly reasons on the top-view map with complete spatial information. To\nfully unlock the MLLM's spatial reasoning potential in top-view perspective, we\npropose the Adaptive Visual Prompt Generation (AVPG) method to adaptively\nconstruct semantically-rich top-view map. It enables the agent to directly\nutilize spatial information contained in the top-view map to conduct thorough\nreasoning. Besides, we design a Dynamic Map Scaling (DMS) mechanism to\ndynamically zoom top-view map at preferred scales, enhancing local fine-grained\nreasoning. Additionally, we devise a Target-Guided Navigation (TGN) mechanism\nto predict and to utilize target locations, facilitating global and human-like\nexploration. Experiments on MP3D and HM3D benchmarks demonstrate the\nsuperiority of our TopV-Nav, e.g., $+3.9\\%$ SR and $+2.0\\%$ SPL absolute\nimprovements on HM3D.", "paper_summary_zh": "零鏡頭物件導航 (ZSON) 任務要求具身代理在不熟悉的環境中導航，以找到先前未見的物件。這種以目標為導向的探索極度依賴感知、理解和基於環境空間資訊進行推理的能力。然而，當前的基於 LLM 的方法會將視覺觀察轉換為語言描述，並在語言空間中進行推理，導致空間資訊遺失。在本篇論文中，我們引入了 TopV-Nav，一種基於 MLLM 的方法，它直接在具有完整空間資訊的俯視圖中進行推理。為了在俯視圖視角中充分發揮 MLLM 的空間推理潛力，我們提出了自適應視覺提示生成 (AVPG) 方法，以自適應地建構語意豐富的俯視圖。它使代理能夠直接利用俯視圖中包含的空間資訊來進行徹底的推理。此外，我們設計了一個動態地圖縮放 (DMS) 機制，以在首選比例尺動態縮放俯視圖，增強局部細粒度的推理。此外，我們設計了一個目標導引導航 (TGN) 機制，以預測和利用目標位置，促進全局和類似人類的探索。在 MP3D 和 HM3D 基準上的實驗證明了我們的 TopV-Nav 的優越性，例如，在 HM3D 上的絕對改進為 $+3.9\\%$ SR 和 $+2.0\\%$ SPL。", "author": "Linqing Zhong et.al.", "authors": "Linqing Zhong, Chen Gao, Zihan Ding, Yue Liao, Si Liu", "id": "2411.16425v1", "paper_url": "http://arxiv.org/abs/2411.16425v1", "repo": "null"}}