{"2410.17632": {"publish_time": "2024-10-23", "title": "LMLPA: Language Model Linguistic Personality Assessment", "paper_summary": "Large Language Models (LLMs) are increasingly used in everyday life and\nresearch. One of the most common use cases is conversational interactions,\nenabled by the language generation capabilities of LLMs. Just as between two\nhumans, a conversation between an LLM-powered entity and a human depends on the\npersonality of the conversants. However, measuring the personality of a given\nLLM is currently a challenge. This paper introduces the Language Model\nLinguistic Personality Assessment (LMLPA), a system designed to evaluate the\nlinguistic personalities of LLMs. Our system helps to understand LLMs' language\ngeneration capabilities by quantitatively assessing the distinct personality\ntraits reflected in their linguistic outputs. Unlike traditional human-centric\npsychometrics, the LMLPA adapts a personality assessment questionnaire,\nspecifically the Big Five Inventory, to align with the operational capabilities\nof LLMs, and also incorporates the findings from previous language-based\npersonality measurement literature. To mitigate sensitivity to the order of\noptions, our questionnaire is designed to be open-ended, resulting in textual\nanswers. Thus, the AI rater is needed to transform ambiguous personality\ninformation from text responses into clear numerical indicators of personality\ntraits. Utilising Principal Component Analysis and reliability validations, our\nfindings demonstrate that LLMs possess distinct personality traits that can be\neffectively quantified by the LMLPA. This research contributes to\nHuman-Computer Interaction and Human-Centered AI, providing a robust framework\nfor future studies to refine AI personality assessments and expand their\napplications in multiple areas, including education and manufacturing.", "paper_summary_zh": "大型語言模型（LLM）在日常生活和研究中使用越來越多。最常見的用例之一是對話互動，這要歸功於 LLM 的語言生成能力。就像兩個人類之間一樣，由 LLM 驅動的實體與人類之間的對話取決於對話者的個性。然而，測量給定 LLM 的個性目前是一個挑戰。本文介紹了語言模型語言人格評估 (LMLPA)，這是一個旨在評估 LLM 的語言人格的系統。我們的系統通過定量評估其語言輸出中反映的不同人格特質，幫助理解 LLM 的語言生成能力。與傳統的人本心理測量學不同，LMLPA 採用人格評量問卷，特別是大五人格量表，以符合 LLM 的運作能力，並納入先前基於語言的人格測量文獻中的發現。為了減輕對選項順序的敏感性，我們的問卷被設計成開放式的，從而產生文本答案。因此，需要 AI 評分者將文本回答中模稜兩可的人格信息轉換為人格特質的明確數字指標。利用主成分分析和信度驗證，我們的研究結果表明，LLM 具有不同的個性特質，可以通過 LMLPA 有效地量化。這項研究有助於人機互動和以人為中心的 AI，為未來的研究提供了一個穩健的框架，以完善 AI 人格評估並擴展其在包括教育和製造業在內的多個領域的應用。", "author": "Jingyao Zheng et.al.", "authors": "Jingyao Zheng, Xian Wang, Simo Hosio, Xiaoxian Xu, Lik-Hang Lee", "id": "2410.17632v1", "paper_url": "http://arxiv.org/abs/2410.17632v1", "repo": "null"}}