{"2406.08115": {"publish_time": "2024-06-12", "title": "Resource Allocation and Workload Scheduling for Large-Scale Distributed Deep Learning: A Survey", "paper_summary": "With rapidly increasing distributed deep learning workloads in large-scale\ndata centers, efficient distributed deep learning framework strategies for\nresource allocation and workload scheduling have become the key to\nhigh-performance deep learning. The large-scale environment with large volumes\nof datasets, models, and computational and communication resources raises\nvarious unique challenges for resource allocation and workload scheduling in\ndistributed deep learning, such as scheduling complexity, resource and workload\nheterogeneity, and fault tolerance. To uncover these challenges and\ncorresponding solutions, this survey reviews the literature, mainly from 2019\nto 2024, on efficient resource allocation and workload scheduling strategies\nfor large-scale distributed DL. We explore these strategies by focusing on\nvarious resource types, scheduling granularity levels, and performance goals\nduring distributed training and inference processes. We highlight critical\nchallenges for each topic and discuss key insights of existing technologies. To\nillustrate practical large-scale resource allocation and workload scheduling in\nreal distributed deep learning scenarios, we use a case study of training large\nlanguage models. This survey aims to encourage computer science, artificial\nintelligence, and communications researchers to understand recent advances and\nexplore future research directions for efficient framework strategies for\nlarge-scale distributed deep learning.", "paper_summary_zh": "<paragraph>隨著大型資料中心中快速增加的分布式深度學習工作負載，資源配置和工作負載排程的高效分布式深度學習架構策略已成為高性能深度學習的關鍵。大型環境中大量的資料集、模型以及運算和通訊資源，為分布式深度學習中的資源配置和工作負載排程帶來了各種獨特挑戰，例如排程複雜性、資源和工作負載異質性以及容錯能力。為了找出這些挑戰和對應的解決方案，本調查回顧了文獻，主要從 2019 年到 2024 年，探討了大型規模分布式深度學習的高效資源配置和工作負載排程策略。我們透過專注於各種資源類型、排程粒度層級和效能目標，在分布式訓練和推論過程中探討這些策略。我們重點指出每個主題的關鍵挑戰，並討論現有技術的主要見解。為了說明實際的大規模資源配置和工作負載排程在真實的分布式深度學習場景中，我們使用訓練大型語言模型的案例研究。本調查旨在鼓勵電腦科學、人工智慧和通訊研究人員了解最近的進展，並探討大型規模分布式深度學習的高效架構策略的未來研究方向。</paragraph>", "author": "Feng Liang et.al.", "authors": "Feng Liang, Zhen Zhang, Haifeng Lu, Chengming Li, Victor C. M. Leung, Yanyi Guo, Xiping Hu", "id": "2406.08115v1", "paper_url": "http://arxiv.org/abs/2406.08115v1", "repo": "null"}}