{"2406.06007": {"publish_time": "2024-06-10", "title": "CARES: A Comprehensive Benchmark of Trustworthiness in Medical Vision Language Models", "paper_summary": "Artificial intelligence has significantly impacted medical applications,\nparticularly with the advent of Medical Large Vision Language Models\n(Med-LVLMs), sparking optimism for the future of automated and personalized\nhealthcare. However, the trustworthiness of Med-LVLMs remains unverified,\nposing significant risks for future model deployment. In this paper, we\nintroduce CARES and aim to comprehensively evaluate the Trustworthiness of\nMed-LVLMs across the medical domain. We assess the trustworthiness of Med-LVLMs\nacross five dimensions, including trustfulness, fairness, safety, privacy, and\nrobustness. CARES comprises about 41K question-answer pairs in both closed and\nopen-ended formats, covering 16 medical image modalities and 27 anatomical\nregions. Our analysis reveals that the models consistently exhibit concerns\nregarding trustworthiness, often displaying factual inaccuracies and failing to\nmaintain fairness across different demographic groups. Furthermore, they are\nvulnerable to attacks and demonstrate a lack of privacy awareness. We publicly\nrelease our benchmark and code in https://github.com/richard-peng-xia/CARES.", "paper_summary_zh": "人工智能已顯著影響醫療應用，\n尤其是在醫療大型視覺語言模型 (Med-LVLMs) 出現後，為自動化和個人化醫療保健的未來帶來樂觀。然而，Med-LVLMs 的可信度仍未得到驗證，對未來的模型部署構成重大風險。在本文中，我們介紹了 CARES，旨在全面評估 Med-LVLMs 在醫療領域的可信度。我們從可信度、公平性、安全性、隱私和穩健性等五個面向評估 Med-LVLMs 的可信度。CARES 包含約 41K 個封閉式和開放式格式的問題解答配對，涵蓋 16 種醫學影像模式和 27 個解剖區域。我們的分析顯示，這些模型始終表現出關於可信度的疑慮，經常顯示出事實上的不準確性，並且無法在不同的人口群體中保持公平性。此外，它們容易受到攻擊，並且缺乏隱私意識。我們公開發布我們的基準和代碼，網址為 https://github.com/richard-peng-xia/CARES。", "author": "Peng Xia et.al.", "authors": "Peng Xia, Ze Chen, Juanxi Tian, Yangrui Gong, Ruibo Hou, Yue Xu, Zhenbang Wu, Zhiyuan Fan, Yiyang Zhou, Kangyu Zhu, Wenhao Zheng, Zhaoyang Wang, Xiao Wang, Xuchao Zhang, Chetan Bansal, Marc Niethammer, Junzhou Huang, Hongtu Zhu, Yun Li, Jimeng Sun, Zongyuan Ge, Gang Li, James Zou, Huaxiu Yao", "id": "2406.06007v1", "paper_url": "http://arxiv.org/abs/2406.06007v1", "repo": "https://github.com/richard-peng-xia/cares"}}