{"2412.05852": {"publish_time": "2024-12-08", "title": "Evolving Algebraic Multigrid Methods Using Grammar-Guided Genetic Programming", "paper_summary": "Multigrid methods despite being known to be asymptotically optimal\nalgorithms, depend on the careful selection of their individual components for\nefficiency. Also, they are mostly restricted to standard cycle types like V-,\nF-, and W-cycles. We use grammar rules to generate arbitrary-shaped cycles,\nwherein the smoothers and their relaxation weights are chosen independently at\neach step within the cycle. We call this a flexible multigrid cycle. These\nflexible cycles are used in Algebraic Multigrid (AMG) methods with the help of\ngrammar rules and optimized using genetic programming. The flexible AMG methods\nare implemented in the software library of hypre, and the programs are\noptimized separately for two cases: a standalone AMG solver for a 3D\nanisotropic problem and an AMG preconditioner with conjugate gradient for a\nmultiphysics code. We observe that the optimized flexible cycles provide higher\nefficiency and better performance than the standard cycle types.", "paper_summary_zh": "多重網格法儘管已知為漸近最佳演算法，但其效率取決於其個別組成的仔細選擇。此外，它們大多侷限於標準循環類型，例如 V、F 和 W 循環。我們使用語法規則來產生任意形狀的循環，其中平滑器及其鬆弛權重在循環中的每個步驟中獨立選擇。我們稱之為彈性多重網格循環。這些彈性循環在代數多重網格 (AMG) 方法中使用，並在語法規則的幫助下使用遺傳程式設計進行最佳化。彈性 AMG 方法在 hypre 的軟體程式庫中實作，且程式針對兩種情況分別最佳化：3D 異向性問題的獨立 AMG 求解器，以及多物理場程式碼的共軛梯度 AMG 預處理器。我們觀察到最佳化的彈性循環提供比標準循環類型更高的效率和更好的效能。", "author": "Dinesh Parthasarathy et.al.", "authors": "Dinesh Parthasarathy, Wayne Bradford Mitchell, Harald Köstler", "id": "2412.05852v1", "paper_url": "http://arxiv.org/abs/2412.05852v1", "repo": "null"}}