{"2411.17600": {"publish_time": "2024-11-26", "title": "Making History Readable", "paper_summary": "The Virginia Tech University Libraries (VTUL) Digital Library Platform (DLP)\nhosts digital collections that offer our users access to a wide variety of\ndocuments of historical and cultural importance. These collections are not only\nof academic importance but also provide our users with a glance at local\nhistorical events. Our DLP contains collections comprising digital objects\nfeaturing complex layouts, faded imagery, and hard-to-read handwritten text,\nwhich makes providing online access to these materials challenging. To address\nthese issues, we integrate AI into our DLP workflow and convert the text in the\ndigital objects into a machine-readable format. To enhance the user experience\nwith our historical collections, we use custom AI agents for handwriting\nrecognition, text extraction, and large language models (LLMs) for\nsummarization. This poster highlights three collections focusing on handwritten\nletters, newspapers, and digitized topographic maps. We discuss the challenges\nwith each collection and detail our approaches to address them. Our proposed\nmethods aim to enhance the user experience by making the contents in these\ncollections easier to search and navigate.", "paper_summary_zh": "維吉尼亞理工大學圖書館 (VTUL) 數位圖書館平台 (DLP)\n承載數位典藏，提供使用者存取各式各樣具有歷史和文化重要性的文件。這些典藏不僅具有學術重要性，也提供使用者一窺當地的歷史事件。我們的 DLP 包含由數位物件組成的典藏，特色為複雜的版面、褪色的圖像和難以辨識的手寫文字，這使得線上存取這些資料具有挑戰性。為了解決這些問題，我們將 AI 整合到我們的 DLP 工作流程中，並將數位物件中的文字轉換成機器可讀的格式。為了提升使用者使用我們歷史典藏的體驗，我們使用客製化 AI 代理進行手寫辨識、文字萃取，以及大型語言模型 (LLM) 進行摘要。這份海報重點介紹了三個以手寫信件、報紙和數位化地形圖為主的典藏。我們討論每個典藏的挑戰，並詳細說明我們解決這些挑戰的方法。我們提出的方法旨在透過讓這些典藏中的內容更容易搜尋和瀏覽，來提升使用者體驗。", "author": "Bipasha Banerjee et.al.", "authors": "Bipasha Banerjee, Jennifer Goyne, William A. Ingram", "id": "2411.17600v1", "paper_url": "http://arxiv.org/abs/2411.17600v1", "repo": "null"}}