{"2407.08351": {"publish_time": "2024-07-11", "title": "AutoBencher: Creating Salient, Novel, Difficult Datasets for Language Models", "paper_summary": "Evaluation is critical for assessing capabilities, tracking scientific\nprogress, and informing model selection. In this paper, we present three\ndesiderata for a good benchmark for language models: (i) salience (e.g.,\nknowledge about World War II is more salient than a random day in history),\n(ii) novelty (i.e., the benchmark reveals new trends in model rankings not\nshown by previous benchmarks), and (iii) difficulty (i.e., the benchmark should\nbe difficult for existing models, leaving headroom for future improvement). We\noperationalize these three desiderata and cast benchmark creation as a search\nproblem, that of finding benchmarks that that satisfy all three desiderata. To\ntackle this search problem, we present AutoBencher, which uses a language model\nto automatically search for datasets that meet the three desiderata.\nAutoBencher uses privileged information (e.g. relevant documents) to construct\nreliable datasets, and adaptivity with reranking to optimize for the search\nobjective. We use AutoBencher to create datasets for math, multilingual, and\nknowledge-intensive question answering. The scalability of AutoBencher allows\nit to test fine-grained categories and tail knowledge, creating datasets that\nare on average 27% more novel and 22% more difficult than existing benchmarks.\nA closer investigation of our constructed datasets shows that we can identify\nspecific gaps in LM knowledge in language models that are not captured by\nexisting benchmarks, such as Gemini Pro performing much worse on question\nanswering about the Permian Extinction and Fordism, while OpenAGI-7B performing\nsurprisingly well on QA about COVID-19.", "paper_summary_zh": "評量對於評估能力、追蹤科學進展和提供模型選擇至關重要。在本文中，我們提出一個好的語言模型基準的三個理想條件：(i) 顯著性（例如，有關二戰的知識比歷史中的隨機一天更顯著），(ii) 新穎性（即基準揭示了模型排名的新趨勢，而先前基準未顯示），以及 (iii) 困難度（即基準對於現有模型而言應具有難度，為未來的改進留下進步空間）。我們將這三個理想條件具體化，並將基準建立視為一個搜尋問題，即找出滿足所有三個理想條件的基準。為了解決這個搜尋問題，我們提出了 AutoBencher，它使用語言模型自動搜尋符合這三個理想條件的資料集。AutoBencher 使用特權資訊（例如相關文件）來建構可靠的資料集，並透過重新排名進行適應性調整，以最佳化搜尋目標。我們使用 AutoBencher 為數學、多語言和知識密集型問題解答建立資料集。AutoBencher 的可擴充性允許它測試細緻的類別和尾部知識，建立的資料集平均比現有基準新穎 27% 且困難 22%。對我們建構的資料集進行更深入的調查顯示，我們可以找出語言模型中 LM 知識的具體差距，而現有基準並未捕捉到這些差距，例如 Gemini Pro 在有關二疊紀大滅絕和福特主義的問題解答中表現得更差，而 OpenAGI-7B 在有關 COVID-19 的 QA 中表現出人意料的好。", "author": "Xiang Lisa Li et.al.", "authors": "Xiang Lisa Li, Evan Zheran Liu, Percy Liang, Tatsunori Hashimoto", "id": "2407.08351v1", "paper_url": "http://arxiv.org/abs/2407.08351v1", "repo": "null"}}