{"2410.13616": {"publish_time": "2024-10-17", "title": "Spatiotemporal Object Detection for Improved Aerial Vehicle Detection in Traffic Monitoring", "paper_summary": "This work presents advancements in multi-class vehicle detection using UAV\ncameras through the development of spatiotemporal object detection models. The\nstudy introduces a Spatio-Temporal Vehicle Detection Dataset (STVD) containing\n6, 600 annotated sequential frame images captured by UAVs, enabling\ncomprehensive training and evaluation of algorithms for holistic spatiotemporal\nperception. A YOLO-based object detection algorithm is enhanced to incorporate\ntemporal dynamics, resulting in improved performance over single frame models.\nThe integration of attention mechanisms into spatiotemporal models is shown to\nfurther enhance performance. Experimental validation demonstrates significant\nprogress, with the best spatiotemporal model exhibiting a 16.22% improvement\nover single frame models, while it is demonstrated that attention mechanisms\nhold the potential for additional performance gains.", "paper_summary_zh": "本研究透過時空物件偵測模型的開發，展示了使用無人機相機進行多類別車輛偵測的進展。本研究引入了時空車輛偵測資料集 (STVD)，其中包含無人機拍攝的 6,600 張標記順序影像，可全面訓練和評估整體時空感知演算法。一種基於 YOLO 的物件偵測演算法經過強化，以納入時間動態，進而提升單一影像模型的效能。整合注意機制到時空模型中，可進一步提升效能。實驗驗證顯示出顯著進展，最佳時空模型比單一影像模型進步了 16.22%，同時也證明注意機制有潛力進一步提升效能。", "author": "Kristina Telegraph et.al.", "authors": "Kristina Telegraph, Christos Kyrkou", "id": "2410.13616v1", "paper_url": "http://arxiv.org/abs/2410.13616v1", "repo": "null"}}