{"2405.20252": {"publish_time": "2024-05-30", "title": "Towards Hierarchical Multi-Agent Workflows for Zero-Shot Prompt Optimization", "paper_summary": "Large language models (LLMs) have shown great progress in responding to user\nquestions, allowing for a multitude of diverse applications. Yet, the quality\nof LLM outputs heavily depends on the prompt design, where a good prompt might\nenable the LLM to answer a very challenging question correctly. Therefore,\nrecent works have developed many strategies for improving the prompt, including\nboth manual crafting and in-domain optimization. However, their efficacy in\nunrestricted scenarios remains questionable, as the former depends on human\ndesign for specific questions and the latter usually generalizes poorly to\nunseen scenarios. To address these problems, we give LLMs the freedom to design\nthe best prompts according to themselves. Specifically, we include a hierarchy\nof LLMs, first constructing a prompt with precise instructions and accurate\nwording in a hierarchical manner, and then using this prompt to generate the\nfinal answer to the user query. We term this pipeline Hierarchical Multi-Agent\nWorkflow, or HMAW. In contrast with prior works, HMAW imposes no human\nrestriction and requires no training, and is completely task-agnostic while\ncapable of adjusting to the nuances of the underlying task. Through both\nquantitative and qualitative experiments across multiple benchmarks, we verify\nthat despite its simplicity, the proposed approach can create detailed and\nsuitable prompts, further boosting the performance of current LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 在回應使用者問題方面已展現出極佳的進展，並允許進行大量不同的應用。然而，LLM 輸出的品質在很大程度上取決於提示設計，其中一個好的提示可能會讓 LLM 正確回答一個非常具有挑戰性的問題。因此，最近的研究已開發出許多策略來改善提示，包括手動製作和領域內最佳化。然而，它們在不受限制的情況下的效力仍有待商榷，因為前者依賴於人類針對特定問題進行設計，而後者通常無法很好地概化到未見過的場景。為了解決這些問題，我們給予 LLM 自由，讓它們根據自身設計最佳提示。具體來說，我們包含了一個 LLM 層級，首先以分層的方式建構一個包含精確說明和準確用詞的提示，然後使用這個提示來產生對使用者查詢的最終答案。我們將這個流程稱為分層多代理工作流程，或 HMAW。與先前的研究相比，HMAW 不施加任何人類限制，也不需要訓練，而且完全與任務無關，同時還能調整到底層任務的細微差別。透過多個基準的多項量化和質化實驗，我們驗證了儘管方法簡單，但提出的方法可以建立詳細且適當的提示，進一步提升當前 LLM 的效能。", "author": "Yuchi Liu et.al.", "authors": "Yuchi Liu, Jaskirat Singh, Gaowen Liu, Ali Payani, Liang Zheng", "id": "2405.20252v1", "paper_url": "http://arxiv.org/abs/2405.20252v1", "repo": "null"}}