{"2407.16008": {"publish_time": "2024-07-22", "title": "Boosting Reward Model with Preference-Conditional Multi-Aspect Synthetic Data Generation", "paper_summary": "Reward models (RMs) are crucial for aligning large language models (LLMs)\nwith human preferences. They are trained using preference datasets where each\nexample consists of one input prompt, two responses, and a preference label. As\ncurating a high-quality human labeled preference dataset is both time-consuming\nand expensive, people often rely on existing powerful LLMs for preference label\ngeneration. This can potentially introduce noise and impede RM training. In\nthis work, we present RMBoost, a novel synthetic preference data generation\nparadigm to boost reward model quality. Unlike traditional methods, which\ngenerate two responses before obtaining the preference label, RMBoost first\ngenerates one response and selects a preference label, followed by generating\nthe second more (or less) preferred response conditioned on the pre-selected\npreference label and the first response. This approach offers two main\nadvantages. First, RMBoost reduces labeling noise since preference pairs are\nconstructed intentionally. Second, RMBoost facilitates the creation of more\ndiverse responses by incorporating various quality aspects (e.g., helpfulness,\nrelevance, completeness) into the prompts. We conduct extensive experiments\nacross three diverse datasets and demonstrate that RMBoost outperforms other\nsynthetic preference data generation techniques and significantly boosts the\nperformance of four distinct reward models.", "paper_summary_zh": "獎勵模型 (RM) 對於將大型語言模型 (LLM) 與人類偏好對齊至關重要。它們使用偏好資料集進行訓練，其中每個範例包含一個輸入提示、兩個回應和一個偏好標籤。由於策劃一個高品質的人類標記偏好資料集既耗時又昂貴，因此人們通常依賴現有的強大 LLM 來產生偏好標籤。這可能會引入雜訊並阻礙 RM 訓練。在這項工作中，我們提出了 RMBoost，這是一種新穎的合成偏好資料產生範例，用於提升獎勵模型品質。與在取得偏好標籤之前產生兩個回應的傳統方法不同，RMBoost 首先產生一個回應並選擇一個偏好標籤，然後在預先選取的偏好標籤和第一個回應的條件下產生第二個更（或更不）偏好的回應。這種方法提供了兩個主要優點。首先，RMBoost 減少了標記雜訊，因為偏好對是故意建構的。其次，RMBoost 透過將各種品質面向（例如，有用性、相關性、完整性）納入提示中，促進了更多樣化回應的產生。我們在三個不同的資料集上進行了廣泛的實驗，並證明 RMBoost 優於其他合成偏好資料產生技術，並顯著提升了四個不同獎勵模型的效能。", "author": "Jiaming Shen et.al.", "authors": "Jiaming Shen, Ran Xu, Yennie Jun, Zhen Qin, Tianqi Liu, Carl Yang, Yi Liang, Simon Baumgartner, Michael Bendersky", "id": "2407.16008v1", "paper_url": "http://arxiv.org/abs/2407.16008v1", "repo": "null"}}