{"2502.16848": {"publish_time": "2025-02-24", "title": "PulseBat: A field-accessible dataset for second-life battery diagnostics from realistic histories using multidimensional rapid pulse test", "paper_summary": "As electric vehicles (EVs) approach the end of their operational life, their\nbatteries retain significant economic value and present promising opportunities\nfor second-life use and material recycling. This is particularly compelling for\nGlobal South and other underdeveloped regions, where reliable energy storage is\nvital to addressing critical challenges posed by weak and even nonexistent\npower grid and energy infrastructures. However, despite this potential,\nwidespread adoption has been hindered by critical uncertainties surrounding the\ntechnical performance, safety, and recertification of second-life batteries. In\ncases where they have been redeployed, mismatches between estimated and actual\nperformance often render batteries technically unsuitable or hazardous, turning\nthem into liabilities for communities they were intended to benefit. This\nconsiderable misalignment exacerbates energy access disparities and undermines\nthe broader vision of energy justice, highlighting an urgent need for robust\nand scalable solutions to unlock the potential. In the PulseBat Dataset, the\nauthors tested 464 retired lithium-ion batteries, covering 3 cathode material\ntypes, 6 historical usages, 3 physical formats, and 6 capacity designs. The\npulse test experiments were performed repeatedly for each second-life battery\nwith 10 pulse width, 10 pulse magnitude, multiple state-of-charge, and\nstate-of-health conditions, e.g., from 0.37 to 1.03. The PulseBat Dataset\nrecorded these test conditions and the voltage response as well as the\ntemperature signals that were subject to the injected pulse current, which\ncould be used as a valuable data resource for critical diagnostics tasks such\nas state-of-charge estimation, state-of-health estimation, cathode material\ntype identification, open-circuit voltage reconstruction, thermal management,\nand beyond.", "paper_summary_zh": "隨著電動車 (EV) 接近其使用壽命的終點，其電池仍保留顯著的經濟價值，並為二次使用和材料回收提供了有前景的機會。這對於全球南方和其他不發達地區而言尤其具有吸引力，在這些地區，可靠的儲能對於應對薄弱甚至不存在的電網和能源基礎設施所帶來的關鍵挑戰至關重要。然而，儘管有這種潛力，但對於二次電池的技術性能、安全性和重新認證等關鍵不確定性阻礙了廣泛採用。在已經重新部署的情況下，估計性能和實際性能之間的不匹配通常會使電池在技術上不適合或有危險，從而使它們成為它們原本打算受益的社區的負擔。這種顯著的不一致加劇了能源獲取的差距，並破壞了能源正義的更廣泛願景，強調了迫切需要強大且可擴展的解決方案來釋放潛力。在 PulseBat 資料集中，作者測試了 464 個報廢的鋰離子電池，涵蓋 3 種正極材料類型、6 種歷史用途、3 種物理格式和 6 種容量設計。脈衝測試實驗對每個二次電池重複進行，具有 10 個脈衝寬度、10 個脈衝幅度、多個充電狀態和健康狀態條件，例如從 0.37 到 1.03。PulseBat 資料集記錄了這些測試條件和電壓響應以及注入脈衝電流的溫度信號，可用作電量狀態估計、健康狀態估計、正極材料類型識別、開路電壓重建、熱管理等關鍵診斷任務的寶貴數據資源。", "author": "Shengyu Tao et.al.", "authors": "Shengyu Tao, Guangyuan Ma, Huixiong Yang, Minyan Lu, Guodan Wei, Guangmin Zhou, Xuan Zhang", "id": "2502.16848v1", "paper_url": "http://arxiv.org/abs/2502.16848v1", "repo": "null"}}