{"2405.07663": {"publish_time": "2024-05-13", "title": "Sign Stitching: A Novel Approach to Sign Language Production", "paper_summary": "Sign Language Production (SLP) is a challenging task, given the limited\nresources available and the inherent diversity within sign data. As a result,\nprevious works have suffered from the problem of regression to the mean,\nleading to under-articulated and incomprehensible signing. In this paper, we\npropose using dictionary examples and a learnt codebook of facial expressions\nto create expressive sign language sequences. However, simply concatenating\nsigns and adding the face creates robotic and unnatural sequences. To address\nthis we present a 7-step approach to effectively stitch sequences together.\nFirst, by normalizing each sign into a canonical pose, cropping, and stitching\nwe create a continuous sequence. Then, by applying filtering in the frequency\ndomain and resampling each sign, we create cohesive natural sequences that\nmimic the prosody found in the original data. We leverage a SignGAN model to\nmap the output to a photo-realistic signer and present a complete Text-to-Sign\n(T2S) SLP pipeline. Our evaluation demonstrates the effectiveness of the\napproach, showcasing state-of-the-art performance across all datasets. Finally,\na user evaluation shows our approach outperforms the baseline model and is\ncapable of producing realistic sign language sequences.", "paper_summary_zh": "手語製作 (SLP) 是一項艱鉅的任務，因為手語資料中可用的資源有限且具有內在的多樣性。因此，先前的作品飽受回歸平均值的問題所苦，導致手語表達不足且難以理解。在本文中，我們提出使用字典範例和已學習的臉部表情碼本來建立表達性的手語序列。然而，僅僅串接手勢並加入臉部表情會產生機器人和不自然的手語序列。為了解決這個問題，我們提出了一個 7 步驟的方法，可以有效地將手語序列串接在一起。首先，透過將每個手勢標準化為標準姿勢、裁剪和串接，我們建立一個連續的序列。接著，透過在頻域中套用濾波器並重新取樣每個手勢，我們建立了連貫的自然序列，模擬原始資料中找到的語調。我們利用 SignGAN 模型將輸出對應到一位逼真的手語者，並展示一個完整的文字轉手語 (T2S) SLP 管線。我們的評估證明了此方法的有效性，在所有資料集上都展現出最先進的效能。最後，使用者評估顯示我們的做法優於基準模型，並且能夠產生逼真的手語序列。", "author": "Harry Walsh et.al.", "authors": "Harry Walsh, Ben Saunders, Richard Bowden", "id": "2405.07663v1", "paper_url": "http://arxiv.org/abs/2405.07663v1", "repo": "null"}}