{"2409.03327": {"publish_time": "2024-09-05", "title": "Normal forms in Virus Machines", "paper_summary": "In the present work, we further study the computational power of virus\nmachines (VMs in short). VMs provide a computing paradigm inspired by the\ntransmission and replication networks of viruses. VMs consist of process units\n(called hosts) structured by a directed graph whose arcs are called channels\nand an instruction graph that controls the transmissions of virus objects among\nhosts. The present work complements our understanding of the computing power of\nVMs by introducing normal forms; these expressions restrict the features in a\ngiven computing model. Some of the features that we restrict in our normal\nforms include (a) the number of hosts, (b) the number of instructions, and (c)\nthe number of virus objects in each host. After we recall some known results on\nthe computing power of VMs we give our normal forms, such as the size of the\nloops in the network, proving new characterisations of family of sets, such as\nthe finite sets, semilinear sets, or NRE.", "paper_summary_zh": "在目前的工作中，我们进一步研究了病毒机器（简称 VM）的计算能力。VM 提供了一种受病毒传输和复制网络启发的计算范例。VM 由进程单元（称为主机）组成，这些进程单元由有向图构成，其弧称为通道，以及一个控制病毒对象在主机之间传输的指令图。本工作通过引入范式来补充我们对 VM 计算能力的理解；这些表达式限制了给定计算模型中的特征。我们在范式中限制的一些特征包括 (a) 主机数量，(b) 指令数量，以及 (c) 每个主机中的病毒对象数量。在我们回顾了有关 VM 计算能力的一些已知结果后，我们给出了我们的范式，例如网络中循环的大小，证明了集合族的新特征，例如有限集、半线性集或 NRE。", "author": "A. Ramírez-de-Arellano et.al.", "authors": "A. Ramírez-de-Arellano, F. G. C. Cabarle, D. Orellana-Martín, M. J. Pérez-Jiménez", "id": "2409.03327v1", "paper_url": "http://arxiv.org/abs/2409.03327v1", "repo": "null"}}