{"2407.06292": {"publish_time": "2024-07-08", "title": "Hybrid X-Linker: Automated Data Generation and Extreme Multi-label Ranking for Biomedical Entity Linking", "paper_summary": "State-of-the-art deep learning entity linking methods rely on extensive\nhuman-labelled data, which is costly to acquire. Current datasets are limited\nin size, leading to inadequate coverage of biomedical concepts and diminished\nperformance when applied to new data. In this work, we propose to automatically\ngenerate data to create large-scale training datasets, which allows the\nexploration of approaches originally developed for the task of extreme\nmulti-label ranking in the biomedical entity linking task. We propose the\nhybrid X-Linker pipeline that includes different modules to link disease and\nchemical entity mentions to concepts in the MEDIC and the CTD-Chemical\nvocabularies, respectively. X-Linker was evaluated on several biomedical\ndatasets: BC5CDR-Disease, BioRED-Disease, NCBI-Disease, BC5CDR-Chemical,\nBioRED-Chemical, and NLM-Chem, achieving top-1 accuracies of 0.8307, 0.7969,\n0.8271, 0.9511, 0.9248, and 0.7895, respectively. X-Linker demonstrated\nsuperior performance in three datasets: BC5CDR-Disease, NCBI-Disease, and\nBioRED-Chemical. In contrast, SapBERT outperformed X-Linker in the remaining\nthree datasets. Both models rely only on the mention string for their\noperations. The source code of X-Linker and its associated data are publicly\navailable for performing biomedical entity linking without requiring\npre-labelled entities with identifiers from specific knowledge organization\nsystems.", "paper_summary_zh": "最先進的深度學習實體連結方法依賴於大量的\n人工標籤資料，而這類資料的取得成本很高。目前的資料集\n大小有限，導致生物醫學概念涵蓋不足，在應用於新資料時效能降低。在這項工作中，我們提議自動\n產生資料，以建立大規模的訓練資料集，這允許探索原本是為生物醫學實體連結任務中極端多標籤排名任務而開發的方法。我們提議混合 X-Linker 管線，其中包含不同的模組，分別將疾病和化學實體提及連結到 MEDIC 和 CTD-Chemical 字彙中的概念。X-Linker 已在多個生物醫學資料集上進行評估：BC5CDR-Disease、BioRED-Disease、NCBI-Disease、BC5CDR-Chemical、BioRED-Chemical 和 NLM-Chem，分別達到 0.8307、0.7969、0.8271、0.9511、0.9248 和 0.7895 的 top-1 準確度。X-Linker 在三個資料集：BC5CDR-Disease、NCBI-Disease 和 BioRED-Chemical 中表現出優異的效能。相反地，SapBERT 在其餘三個資料集中優於 X-Linker。兩個模型僅依賴於它們操作的提及字串。X-Linker 和其相關資料的原始程式碼公開提供，可執行生物醫學實體連結，而無需特定知識組織系統中識別符號的預先標籤實體。", "author": "Pedro Ruas et.al.", "authors": "Pedro Ruas, Fernando Gallego, Francisco J. Veredas, Francisco M. Couto", "id": "2407.06292v1", "paper_url": "http://arxiv.org/abs/2407.06292v1", "repo": "null"}}