{"2307.07764": {"publish_time": "2023-07-15", "title": "Explaining and visualizing black-box models through counterfactual paths", "paper_summary": "Explainable AI (XAI) is an increasingly important area of machine learning\nresearch, which aims to make black-box models transparent and interpretable. In\nthis paper, we propose a novel approach to XAI that uses the so-called\ncounterfactual paths generated by conditional permutations of features. The\nalgorithm measures feature importance by identifying sequential permutations of\nfeatures that most influence changes in model predictions. It is particularly\nsuitable for generating explanations based on counterfactual paths in knowledge\ngraphs incorporating domain knowledge. Counterfactual paths introduce an\nadditional graph dimension to current XAI methods in both explaining and\nvisualizing black-box models. Experiments with synthetic and medical data\ndemonstrate the practical applicability of our approach.", "paper_summary_zh": "可解釋 AI (XAI) 是機器學習研究中日益重要的領域，其目標是讓黑箱模型透明且可解釋。在本文中，我們提出了一種新的 XAI 方法，該方法使用由特徵條件置換產生的所謂反事實路徑。該演算法透過識別特徵的順序置換來衡量特徵重要性，這些置換最能影響模型預測的變化。它特別適合根據包含領域知識的知識圖譜中的反事實路徑來產生解釋。反事實路徑在解釋和視覺化黑箱模型時，為目前的 XAI 方法引入了額外的圖形維度。使用合成和醫療資料進行的實驗證明了我們方法的實用適用性。", "author": "Bastian Pfeifer et.al.", "authors": "Bastian Pfeifer, Mateusz Krzyzinski, Hubert Baniecki, Anna Saranti, Andreas Holzinger, Przemyslaw Biecek", "id": "2307.07764v3", "paper_url": "http://arxiv.org/abs/2307.07764v3", "repo": "https://github.com/pievos101/cpath"}}