{"2502.14704": {"publish_time": "2025-02-20", "title": "Not All Data are Good Labels: On the Self-supervised Labeling for Time Series Forecasting", "paper_summary": "Time Series Forecasting (TSF) is a crucial task in various domains, yet\nexisting TSF models rely heavily on high-quality data and insufficiently\nexploit all available data. This paper explores a novel self-supervised\napproach to re-label time series datasets by inherently constructing candidate\ndatasets. During the optimization of a simple reconstruction network,\nintermediates are used as pseudo labels in a self-supervised paradigm,\nimproving generalization for any predictor. We introduce the Self-Correction\nwith Adaptive Mask (SCAM), which discards overfitted components and selectively\nreplaces them with pseudo labels generated from reconstructions. Additionally,\nwe incorporate Spectral Norm Regularization (SNR) to further suppress\noverfitting from a loss landscape perspective. Our experiments on eleven\nreal-world datasets demonstrate that SCAM consistently improves the performance\nof various backbone models. This work offers a new perspective on constructing\ndatasets and enhancing the generalization of TSF models through self-supervised\nlearning.", "paper_summary_zh": "時間序列預測 (TSF) 在各個領域中都是一項重要的任務，但現有的 TSF 模型極度依賴高品質的資料，且無法充分利用所有可用的資料。本文探討了一種新穎的自監督方法，藉由內建地建構候選資料集來重新標記時間序列資料集。在最佳化一個簡單的重建網路過程中，中間產物會在自監督範例中作為偽標籤，進而改善任何預測器的概化能力。我們引入了帶有自適應遮罩 (SCAM) 的自我修正，它會捨棄過度擬合的組成，並選擇性地以從重建產生的偽標籤取代它們。此外，我們納入了頻譜範數正規化 (SNR) 來進一步抑制從損失景觀觀點來看產生的過度擬合。我們在 11 個真實世界的資料集上進行的實驗，證明 SCAM 持續改善各種主幹模型的效能。這項工作提供了建構資料集和透過自監督學習來提升 TSF 模型概化能力的新觀點。", "author": "Yuxuan Yang et.al.", "authors": "Yuxuan Yang, Dalin Zhang, Yuxuan Liang, Hua Lu, Huan Li, Gang Chen", "id": "2502.14704v1", "paper_url": "http://arxiv.org/abs/2502.14704v1", "repo": "null"}}