{"2405.20234": {"publish_time": "2024-05-30", "title": "Context Injection Attacks on Large Language Models", "paper_summary": "Large Language Models (LLMs) such as ChatGPT and Llama-2 have become\nprevalent in real-world applications, exhibiting impressive text generation\nperformance. LLMs are fundamentally developed from a scenario where the input\ndata remains static and lacks a clear structure. To behave interactively over\ntime, LLM-based chat systems must integrate additional contextual information\n(i.e., chat history) into their inputs, following a pre-defined structure. This\npaper identifies how such integration can expose LLMs to misleading context\nfrom untrusted sources and fail to differentiate between system and user\ninputs, allowing users to inject context. We present a systematic methodology\nfor conducting context injection attacks aimed at eliciting disallowed\nresponses by introducing fabricated context. This could lead to illegal\nactions, inappropriate content, or technology misuse. Our context fabrication\nstrategies, acceptance elicitation and word anonymization, effectively create\nmisleading contexts that can be structured with attacker-customized prompt\ntemplates, achieving injection through malicious user messages. Comprehensive\nevaluations on real-world LLMs such as ChatGPT and Llama-2 confirm the efficacy\nof the proposed attack with success rates reaching 97%. We also discuss\npotential countermeasures that can be adopted for attack detection and\ndeveloping more secure models. Our findings provide insights into the\nchallenges associated with the real-world deployment of LLMs for interactive\nand structured data scenarios.", "paper_summary_zh": "大型語言模型 (LLM)，例如 ChatGPT 和 Llama-2，在現實世界應用中已變得普遍，展現出令人印象深刻的文字生成效能。LLM 基本上是從輸入資料保持靜態且缺乏明確結構的場景中開發出來的。為了隨著時間互動式地執行，基於 LLM 的聊天系統必須將其他脈絡資訊（例如聊天記錄）整合到其輸入中，並遵循預先定義的結構。這篇論文探討了此整合如何讓 LLM 接收到來自不可信來源的誤導性脈絡，並無法區分系統和使用者輸入，進而讓使用者能注入脈絡。我們提出了一種系統性方法來進行脈絡注入攻擊，目的是透過引入虛構脈絡來引發不允許的回應。這可能會導致非法行為、不當內容或技術誤用。我們的脈絡捏造策略、接受引發和字詞匿名化，有效地創造出誤導性脈絡，這些脈絡可以用攻擊者自訂的提示範本來建構，並透過惡意使用者訊息來進行注入。對 ChatGPT 和 Llama-2 等現實世界的 LLM 進行的全面評估證實了所提出的攻擊的效力，成功率高達 97%。我們也討論了可以採用來進行攻擊偵測和開發更安全模型的潛在對策。我們的研究結果提供了對 LLM 在互動式和結構化資料場景中進行現實世界部署所面臨挑戰的見解。", "author": "Cheng'an Wei et.al.", "authors": "Cheng'an Wei, Kai Chen, Yue Zhao, Yujia Gong, Lu Xiang, Shenchen Zhu", "id": "2405.20234v1", "paper_url": "http://arxiv.org/abs/2405.20234v1", "repo": "null"}}