{"2406.12793": {"publish_time": "2024-06-18", "title": "ChatGLM: A Family of Large Language Models from GLM-130B to GLM-4 All Tools", "paper_summary": "We introduce ChatGLM, an evolving family of large language models that we\nhave been developing over time. This report primarily focuses on the GLM-4\nlanguage series, which includes GLM-4, GLM-4-Air, and GLM-4-9B. They represent\nour most capable models that are trained with all the insights and lessons\ngained from the preceding three generations of ChatGLM. To date, the GLM-4\nmodels are pre-trained on ten trillions of tokens mostly in Chinese and\nEnglish, along with a small set of corpus from 24 languages, and aligned\nprimarily for Chinese and English usage. The high-quality alignment is achieved\nvia a multi-stage post-training process, which involves supervised fine-tuning\nand learning from human feedback. Evaluations show that GLM-4 1) closely rivals\nor outperforms GPT-4 in terms of general metrics such as MMLU, GSM8K, MATH,\nBBH, GPQA, and HumanEval, 2) gets close to GPT-4-Turbo in instruction following\nas measured by IFEval, 3) matches GPT-4 Turbo (128K) and Claude 3 for long\ncontext tasks, and 4) outperforms GPT-4 in Chinese alignments as measured by\nAlignBench. The GLM-4 All Tools model is further aligned to understand user\nintent and autonomously decide when and which tool(s) touse -- including web\nbrowser, Python interpreter, text-to-image model, and user-defined functions --\nto effectively complete complex tasks. In practical applications, it matches\nand even surpasses GPT-4 All Tools in tasks like accessing online information\nvia web browsing and solving math problems using Python interpreter. Over the\ncourse, we have open-sourced a series of models, including ChatGLM-6B (three\ngenerations), GLM-4-9B (128K, 1M), GLM-4V-9B, WebGLM, and CodeGeeX, attracting\nover 10 million downloads on Hugging face in the year 2023 alone. The open\nmodels can be accessed through https://github.com/THUDM and\nhttps://huggingface.co/THUDM.", "paper_summary_zh": "<paragraph>我們推出 ChatGLM，這是一個隨著時間發展的大型語言模型系列。本報告主要關注 GLM-4 語言系列，其中包括 GLM-4、GLM-4-Air 和 GLM-4-9B。它們代表我們最優秀的模型，並利用從前三代 ChatGLM 中獲得的所有見解和經驗教訓進行訓練。迄今為止，GLM-4 模型已在數萬億個主要為中文和英文的符號上進行預訓練，並包含一小組來自 24 種語言的語料庫，並主要針對中文和英文使用進行對齊。高品質對齊是通過多階段後訓練過程實現的，其中涉及監督微調和從人類回饋中學習。評估顯示 GLM-4 1) 在 MMLU、GSM8K、MATH、BBH、GPQA 和 HumanEval 等一般指標方面與 GPT-4 接近或優於 GPT-4，2) 在 IFEval 衡量的指令遵循方面接近 GPT-4-Turbo，3) 在長上下文任務中與 GPT-4 Turbo (128K) 和 Claude 3 相匹配，以及 4) 在 AlignBench 衡量的中文對齊方面優於 GPT-4。GLM-4 All Tools 模型進一步對齊以了解用戶意圖並自主決定何時以及使用哪種工具（包括網路瀏覽器、Python 解譯器、文字轉圖像模型和使用者定義函式）來有效完成複雜任務。在實際應用中，它在通過網路瀏覽存取線上資訊和使用 Python 解譯器解決數學問題等任務中與 GPT-4 All Tools 相匹配甚至超越 GPT-4 All Tools。在此過程中，我們開源了一系列模型，包括 ChatGLM-6B（三代）、GLM-4-9B（128K、1M）、GLM-4V-9B、WebGLM 和 CodeGeeX，僅在 2023 年一年就在 Hugging face 上吸引了超過 1000 萬次的下載。開放模型可透過 https://github.com/THUDM 和 https://huggingface.co/THUDM 存取。</paragraph>", "author": "Team GLM et.al.", "authors": "Team GLM, :, Aohan Zeng, Bin Xu, Bowen Wang, Chenhui Zhang, Da Yin, Diego Rojas, Guanyu Feng, Hanlin Zhao, Hanyu Lai, Hao Yu, Hongning Wang, Jiadai Sun, Jiajie Zhang, Jiale Cheng, Jiayi Gui, Jie Tang, Jing Zhang, Juanzi Li, Lei Zhao, Lindong Wu, Lucen Zhong, Mingdao Liu, Minlie Huang, Peng Zhang, Qinkai Zheng, Rui Lu, Shuaiqi Duan, Shudan Zhang, Shulin Cao, Shuxun Yang, Weng Lam Tam, Wenyi Zhao, Xiao Liu, Xiao Xia, Xiaohan Zhang, Xiaotao Gu, Xin Lv, Xinghan Liu, Xinyi Liu, Xinyue Yang, Xixuan Song, Xunkai Zhang, Yifan An, Yifan Xu, Yilin Niu, Yuantao Yang, Yueyan Li, Yushi Bai, Yuxiao Dong, Zehan Qi, Zhaoyu Wang, Zhen Yang, Zhengxiao Du, Zhenyu Hou, Zihan Wang", "id": "2406.12793v1", "paper_url": "http://arxiv.org/abs/2406.12793v1", "repo": "null"}}