{"2410.10365": {"publish_time": "2024-10-14", "title": "SpeGCL: Self-supervised Graph Spectrum Contrastive Learning without Positive Samples", "paper_summary": "Graph Contrastive Learning (GCL) excels at managing noise and fluctuations in\ninput data, making it popular in various fields (e.g., social networks, and\nknowledge graphs). Our study finds that the difference in high-frequency\ninformation between augmented graphs is greater than that in low-frequency\ninformation. However, most existing GCL methods focus mainly on the time domain\n(low-frequency information) for node feature representations and cannot make\ngood use of high-frequency information to speed up model convergence.\nFurthermore, existing GCL paradigms optimize graph embedding representations by\npulling the distance between positive sample pairs closer and pushing the\ndistance between positive and negative sample pairs farther away, but our\ntheoretical analysis shows that graph contrastive learning benefits from\npushing negative pairs farther away rather than pulling positive pairs closer.\nTo solve the above-mentioned problems, we propose a novel spectral GCL\nframework without positive samples, named SpeGCL. Specifically, to solve the\nproblem that existing GCL methods cannot utilize high-frequency information,\nSpeGCL uses a Fourier transform to extract high-frequency and low-frequency\ninformation of node features, and constructs a contrastive learning mechanism\nin a Fourier space to obtain better node feature representation. Furthermore,\nSpeGCL relies entirely on negative samples to refine the graph embedding. We\nalso provide a theoretical justification for the efficacy of using only\nnegative samples in SpeGCL. Extensive experiments on un-supervised learning,\ntransfer learning, and semi-supervised learning have validated the superiority\nof our SpeGCL framework over the state-of-the-art GCL methods.", "paper_summary_zh": "圖形對比學習 (GCL) 擅長處理輸入資料中的雜訊和波動，使其在各種領域（例如社群網路和知識圖譜）中普及。我們的研究發現，擴充圖形中高頻資訊的差異大於低頻資訊的差異。然而，現有的 GCL 方法大多主要關注時間域（低頻資訊）的節點特徵表示，無法充分利用高頻資訊來加速模型收斂。此外，現有的 GCL 典範透過拉近正樣本對之間的距離並推開正樣本對和負樣本對之間的距離來最佳化圖形嵌入表示，但我們的理論分析表明，圖形對比學習受益於將負樣本對推得更遠，而不是將正樣本對拉得更近。為了解決上述問題，我們提出了一個沒有正樣本的新穎光譜 GCL 架構，稱為 SpeGCL。具體來說，為了解決現有的 GCL 方法無法利用高頻資訊的問題，SpeGCL 使用傅立葉轉換來提取節點特徵的高頻和低頻資訊，並在傅立葉空間中建構一個對比學習機制，以獲得更好的節點特徵表示。此外，SpeGCL 完全依賴負樣本來改善圖形嵌入。我們也提供了僅在 SpeGCL 中使用負樣本的有效性的理論依據。在無監督學習、轉移學習和半監督學習上的廣泛實驗驗證了我們的 SpeGCL 架構優於最先進的 GCL 方法。", "author": "Yuntao Shou et.al.", "authors": "Yuntao Shou, Xiangyong Cao, Deyu Meng", "id": "2410.10365v1", "paper_url": "http://arxiv.org/abs/2410.10365v1", "repo": "null"}}