{"2408.07435": {"publish_time": "2024-08-14", "title": "Real-world validation of safe reinforcement learning, model predictive control and decision tree-based home energy management systems", "paper_summary": "Recent advancements in machine learning based energy management approaches,\nspecifically reinforcement learning with a safety layer (OptLayerPolicy) and a\nmetaheuristic algorithm generating a decision tree control policy (TreeC), have\nshown promise. However, their effectiveness has only been demonstrated in\ncomputer simulations. This paper presents the real-world validation of these\nmethods, comparing against model predictive control and simple rule-based\ncontrol benchmark. The experiments were conducted on the electrical\ninstallation of 4 reproductions of residential houses, which all have their own\nbattery, photovoltaic and dynamic load system emulating a non-controllable\nelectrical load and a controllable electric vehicle charger. The results show\nthat the simple rules, TreeC, and model predictive control-based methods\nachieved similar costs, with a difference of only 0.6%. The reinforcement\nlearning based method, still in its training phase, obtained a cost 25.5\\%\nhigher to the other methods. Additional simulations show that the costs can be\nfurther reduced by using a more representative training dataset for TreeC and\naddressing errors in the model predictive control implementation caused by its\nreliance on accurate data from various sources. The OptLayerPolicy safety layer\nallows safe online training of a reinforcement learning agent in the\nreal-world, given an accurate constraint function formulation. The proposed\nsafety layer method remains error-prone, nonetheless, it is found beneficial\nfor all investigated methods. The TreeC method, which does require building a\nrealistic simulation for training, exhibits the safest operational performance,\nexceeding the grid limit by only 27.1 Wh compared to 593.9 Wh for reinforcement\nlearning.", "paper_summary_zh": "<paragraph>最近在基於機器學習的能源管理方法中取得進展，特別是具有安全層（OptLayerPolicy）的強化學習和產生決策樹控制策略（TreeC）的元啟發式演算法，已展現出前景。然而，它們的有效性僅在電腦模擬中得到證明。本文介紹了這些方法的現實世界驗證，並與模型預測控制和基於簡單規則的控制基準進行比較。這些實驗是在 4 個住宅複製品的電氣裝置上進行的，它們都配備自己的電池、光電和動態負載系統，模擬不可控電氣負載和可控電動車充電器。結果顯示，簡單規則、TreeC 和基於模型預測控制的方法達到了相似的成本，差異僅為 0.6%。基於強化學習的方法仍處於訓練階段，獲得的成本比其他方法高出 25.5%。其他模擬顯示，透過使用更具代表性的 TreeC 訓練資料集，以及解決模型預測控制實作中因依賴各種來源的準確資料而產生的錯誤，可以進一步降低成本。OptLayerPolicy 安全層允許在現實世界中安全地線上訓練強化學習代理，前提是提供準確的約束函數公式。所提出的安全層方法仍然容易出錯，儘管如此，發現它對所有研究的方法都有利。TreeC 方法需要建立一個用於訓練的現實模擬，表現出最安全的運作效能，與強化學習的 593.9 Wh 相比，僅超過電網限制 27.1 Wh。</paragraph>", "author": "Julian Ruddick et.al.", "authors": "Julian Ruddick, Glenn Ceusters, Gilles Van Kriekinge, Evgenii Genov, Thierry Coosemans, Maarten Messagie", "id": "2408.07435v1", "paper_url": "http://arxiv.org/abs/2408.07435v1", "repo": "null"}}