{"2412.14133": {"publish_time": "2024-12-18", "title": "Performance Gap in Entity Knowledge Extraction Across Modalities in Vision Language Models", "paper_summary": "Vision-language models (VLMs) excel at extracting and reasoning about\ninformation from images. Yet, their capacity to leverage internal knowledge\nabout specific entities remains underexplored. This work investigates the\ndisparity in model performance when answering factual questions about an entity\ndescribed in text versus depicted in an image. Our results reveal a significant\naccuracy drop --averaging 19%-- when the entity is presented visually instead\nof textually. We hypothesize that this decline arises from limitations in how\ninformation flows from image tokens to query tokens. We use mechanistic\ninterpretability tools to reveal that, although image tokens are preprocessed\nby the vision encoder, meaningful information flow from these tokens occurs\nonly in the much deeper layers. Furthermore, critical image processing happens\nin the language model's middle layers, allowing few layers for consecutive\nreasoning, highlighting a potential inefficiency in how the model utilizes its\nlayers for reasoning. These insights shed light on the internal mechanics of\nVLMs and offer pathways for enhancing their reasoning capabilities.", "paper_summary_zh": "視覺語言模型 (VLM) 擅長從影像中萃取和推理資訊。然而，它們利用關於特定實體的內部知識的能力仍未被充分探索。這項工作探討了在回答關於文本中描述或影像中描繪的實體的事實問題時，模型效能的差異。我們的結果顯示，當實體以視覺方式而非文字方式呈現時，準確度會顯著下降——平均下降 19%。我們假設這種下降是由於影像標記如何流向查詢標記的限制。我們使用機制可解釋性工具來揭示，儘管影像標記是由視覺編碼器預先處理的，但從這些標記的有意義的資訊流僅發生在更深的層級中。此外，重要的影像處理發生在語言模型的中間層，允許少數層進行連續推理，突顯了模型如何利用其層進行推理的潛在低效率。這些見解闡明了 VLM 的內部機制，並提供了增強其推理能力的途徑。", "author": "Ido Cohen et.al.", "authors": "Ido Cohen, Daniela Gottesman, Mor Geva, Raja Giryes", "id": "2412.14133v1", "paper_url": "http://arxiv.org/abs/2412.14133v1", "repo": "https://github.com/ido-co/vlm-modality-gap"}}