{"2412.16153": {"publish_time": "2024-12-20", "title": "MotiF: Making Text Count in Image Animation with Motion Focal Loss", "paper_summary": "Text-Image-to-Video (TI2V) generation aims to generate a video from an image\nfollowing a text description, which is also referred to as text-guided image\nanimation. Most existing methods struggle to generate videos that align well\nwith the text prompts, particularly when motion is specified. To overcome this\nlimitation, we introduce MotiF, a simple yet effective approach that directs\nthe model's learning to the regions with more motion, thereby improving the\ntext alignment and motion generation. We use optical flow to generate a motion\nheatmap and weight the loss according to the intensity of the motion. This\nmodified objective leads to noticeable improvements and complements existing\nmethods that utilize motion priors as model inputs. Additionally, due to the\nlack of a diverse benchmark for evaluating TI2V generation, we propose TI2V\nBench, a dataset consists of 320 image-text pairs for robust evaluation. We\npresent a human evaluation protocol that asks the annotators to select an\noverall preference between two videos followed by their justifications. Through\na comprehensive evaluation on TI2V Bench, MotiF outperforms nine open-sourced\nmodels, achieving an average preference of 72%. The TI2V Bench is released in\nhttps://wang-sj16.github.io/motif/.", "paper_summary_zh": "文本影像轉影片 (TI2V) 生成旨在根據文字描述從影像產生影片，這也稱為文字引導影像動畫。現有的方法大多難以產生與文字提示相符的影片，特別是在指定動作時。為了克服這個限制，我們引入了 MotiF，這是一種簡單但有效的方法，可以將模型的學習引導至動作較多的區域，從而改善文字對齊和動作產生。我們使用光流來產生動作熱圖，並根據動作強度加權損失。這個修改過的目標導致明顯的改善，並補充了將動作先驗用作模型輸入的現有方法。此外，由於缺乏用於評估 TI2V 生成的多元基準，我們提出了 TI2V Bench，一個由 320 個影像文字對組成的資料集，用於穩健評估。我們提出了一種人類評估協定，要求註解者在兩個影片之間選擇一個整體偏好，然後說明其理由。透過對 TI2V Bench 的全面評估，MotiF 優於九個開源模型，平均偏好達到 72%。TI2V Bench 已在 https://wang-sj16.github.io/motif/ 中發布。", "author": "Shijie Wang et.al.", "authors": "Shijie Wang, Samaneh Azadi, Rohit Girdhar, Saketh Rambhatla, Chen Sun, Xi Yin", "id": "2412.16153v1", "paper_url": "http://arxiv.org/abs/2412.16153v1", "repo": "null"}}