{"2501.02772": {"publish_time": "2025-01-06", "title": "GeAR: Generation Augmented Retrieval", "paper_summary": "Document retrieval techniques form the foundation for the development of\nlarge-scale information systems. The prevailing methodology is to construct a\nbi-encoder and compute the semantic similarity. However, such scalar similarity\nis difficult to reflect enough information and impedes our comprehension of the\nretrieval results. In addition, this computational process mainly emphasizes\nthe global semantics and ignores the fine-grained semantic relationship between\nthe query and the complex text in the document. In this paper, we propose a new\nmethod called $\\textbf{Ge}$neration $\\textbf{A}$ugmented $\\textbf{R}$etrieval\n($\\textbf{GeAR}$) that incorporates well-designed fusion and decoding modules.\nThis enables GeAR to generate the relevant text from documents based on the\nfused representation of the query and the document, thus learning to \"focus on\"\nthe fine-grained information. Also when used as a retriever, GeAR does not add\nany computational burden over bi-encoders. To support the training of the new\nframework, we have introduced a pipeline to efficiently synthesize high-quality\ndata by utilizing large language models. GeAR exhibits competitive retrieval\nand localization performance across diverse scenarios and datasets. Moreover,\nthe qualitative analysis and the results generated by GeAR provide novel\ninsights into the interpretation of retrieval results. The code, data, and\nmodels will be released after completing technical review to facilitate future\nresearch.", "paper_summary_zh": "文件檢索技術是建立大型資訊系統的基礎。目前普遍的方法是建構雙編碼器並計算語意相似度。然而，這種標量相似度難以反映足夠的資訊，阻礙我們理解檢索結果。此外，這個運算過程主要強調整體語意，而忽略查詢與文件中的複雜文字之間的細粒度語意關係。在本文中，我們提出了一種稱為 $\\textbf{Ge}$neration $\\textbf{A}$ugmented $\\textbf{R}$etrieval（$\\textbf{GeAR}$）的新方法，它結合了精心設計的融合和解碼模組。這使得 GeAR 能夠根據查詢和文件的融合表示來產生文件中的相關文字，從而學會「專注於」細粒度資訊。此外，當用作檢索器時，GeAR 並不會對雙編碼器增加任何運算負擔。為了支援新架構的訓練，我們引入了一個管道，利用大型語言模型有效地合成高品質資料。GeAR 在不同的場景和資料集上展現出有競爭力的檢索和定位效能。此外，GeAR 產生的定性分析和結果為檢索結果的詮釋提供了新的見解。在完成技術審查後，程式碼、資料和模型將會釋出，以利未來的研究。", "author": "Haoyu Liu et.al.", "authors": "Haoyu Liu, Shaohan Huang, Jianfeng Liu, Yuefeng Zhan, Hao Sun, Weiwei Deng, Feng Sun, Furu Wei, Qi Zhang", "id": "2501.02772v1", "paper_url": "http://arxiv.org/abs/2501.02772v1", "repo": "null"}}