{"2502.15392": {"publish_time": "2025-02-21", "title": "Chitrarth: Bridging Vision and Language for a Billion People", "paper_summary": "Recent multimodal foundation models are primarily trained on English or high\nresource European language data, which hinders their applicability to other\nmedium and low-resource languages. To address this limitation, we introduce\nChitrarth (Chitra: Image; Artha: Meaning), an inclusive Vision-Language Model\n(VLM), specifically targeting the rich linguistic diversity and visual\nreasoning across 10 prominent Indian languages. Our model effectively\nintegrates a state-of-the-art (SOTA) multilingual Large Language Model (LLM)\nwith a vision module, primarily trained on multilingual image-text data.\nFurthermore, we also introduce BharatBench, a comprehensive framework for\nevaluating VLMs across various Indian languages, ultimately contributing to\nmore diverse and effective AI systems. Our model achieves SOTA results for\nbenchmarks across low resource languages while retaining its efficiency in\nEnglish. Through our research, we aim to set new benchmarks in\nmultilingual-multimodal capabilities, offering substantial improvements over\nexisting models and establishing a foundation to facilitate future advancements\nin this arena.", "paper_summary_zh": "最近的多模态基础模型主要在英语或高资源的欧洲语言数据上进行训练，这阻碍了它们对其他中等和低资源语言的适用性。为了解决这一限制，我们引入了 Chitrarth（Chitra：图像；Artha：含义），这是一个包容性的视觉语言模型（VLM），专门针对 10 种主要的印度语言的丰富语言多样性和视觉推理。我们的模型有效地集成了最先进的（SOTA）多语言大语言模型（LLM）和视觉模块，主要在多语言图像文本数据上进行训练。此外，我们还引入了 BharatBench，这是一个用于跨各种印度语言评估 VLM 的综合框架，最终有助于实现更多样化和有效的 AI 系统。我们的模型在低资源语言的基准测试中取得了 SOTA 结果，同时保持了其在英语中的效率。通过我们的研究，我们旨在为多语言多模态能力设定新的基准，对现有模型进行实质性改进，并为促进该领域未来的进步奠定基础。", "author": "Shaharukh Khan et.al.", "authors": "Shaharukh Khan, Ayush Tarun, Abhinav Ravi, Ali Faraz, Akshat Patidar, Praveen Kumar Pokala, Anagha Bhangare, Raja Kolla, Chandra Khatri, Shubham Agarwal", "id": "2502.15392v1", "paper_url": "http://arxiv.org/abs/2502.15392v1", "repo": "null"}}