{"2409.17545": {"publish_time": "2024-09-26", "title": "Modulated Intervention Preference Optimization (MIPO): Keey the Easy, Refine the Difficult", "paper_summary": "Preference optimization methods typically begin training with a well-trained\nSFT model as a reference model. In RLHF and DPO, a regularization term is used\nduring the preference optimization process to prevent the policy model from\ndeviating too far from the reference model's distribution, thereby avoiding the\ngeneration of anomalous responses. When the reference model is already\nwell-aligned with the given data or only requires slight adjustments, this\napproach can produce a well-aligned model. However, if the reference model is\nnot aligned with the given data and requires significant deviation from its\ncurrent state, a regularization term may actually hinder the model alignment.\nIn this study, we propose \\textbf{Modulated Intervention Preference\nOptimization (MIPO)} to address this issue. MIPO modulates the degree of\nintervention from the reference model based on how well the given data is\naligned with it. If the data is well-aligned, the intervention is increased to\nprevent the policy model from diverging significantly from reference model.\nConversely, if the alignment is poor, the interference is reduced to facilitate\nmore extensive training. We compare the performance of MIPO and DPO using\nMistral-7B and Llama3-8B in Alpaca Eval 2.0 and MT-Bench. The experimental\nresults demonstrate that MIPO consistently outperforms DPO across various\nevaluation scenarios.", "paper_summary_zh": "偏好优化方法通常以训练有素的 SFT 模型作为参考模型来开始训练。在 RLHF 和 DPO 中，在偏好优化过程中使用正则化项来防止策略模型偏离参考模型的分布太远，从而避免生成异常响应。当参考模型已经与给定数据很好地对齐或只需要微调时，这种方法可以生成一个很好地对齐的模型。然而，如果参考模型与给定数据不一致，并且需要与其当前状态有较大偏差，那么正则化项实际上可能会阻碍模型对齐。在这项研究中，我们提出了**调制干预偏好优化 (MIPO)** 来解决这个问题。MIPO 根据给定数据与其对齐的程度来调节参考模型的干预程度。如果数据对齐良好，则增加干预以防止策略模型与参考模型显着偏离。相反，如果对齐较差，则减少干扰以促进更广泛的训练。我们使用 Alpaca Eval 2.0 和 MT-Bench 中的 Mistral-7B 和 Llama3-8B 比较了 MIPO 和 DPO 的性能。实验结果表明，在各种评估场景中，MIPO 的表现始终优于 DPO。", "author": "Cheolhun Jang et.al.", "authors": "Cheolhun Jang", "id": "2409.17545v1", "paper_url": "http://arxiv.org/abs/2409.17545v1", "repo": "null"}}