{"2411.09604": {"publish_time": "2024-11-14", "title": "Local-Global Attention: An Adaptive Mechanism for Multi-Scale Feature Integration", "paper_summary": "In recent years, attention mechanisms have significantly enhanced the\nperformance of object detection by focusing on key feature information.\nHowever, prevalent methods still encounter difficulties in effectively\nbalancing local and global features. This imbalance hampers their ability to\ncapture both fine-grained details and broader contextual information-two\ncritical elements for achieving accurate object detection.To address these\nchallenges, we propose a novel attention mechanism, termed Local-Global\nAttention, which is designed to better integrate both local and global\ncontextual features. Specifically, our approach combines multi-scale\nconvolutions with positional encoding, enabling the model to focus on local\ndetails while concurrently considering the broader global context.\nAdditionally, we introduce a learnable parameters, which allow the model to\ndynamically adjust the relative importance of local and global attention,\ndepending on the specific requirements of the task, thereby optimizing feature\nrepresentations across multiple scales.We have thoroughly evaluated the\nLocal-Global Attention mechanism on several widely used object detection and\nclassification datasets. Our experimental results demonstrate that this\napproach significantly enhances the detection of objects at various scales,\nwith particularly strong performance on multi-class and small object detection\ntasks. In comparison to existing attention mechanisms, Local-Global Attention\nconsistently outperforms them across several key metrics, all while maintaining\ncomputational efficiency.", "paper_summary_zh": "近年来，注意力机制通过关注关键特征信息显著提升了目标检测的性能。然而，流行的方法在有效平衡局部和全局特征方面仍然遇到困难。这种不平衡阻碍了它们同时捕捉细粒度细节和更广泛的上下文信息的能力，而这两者是实现准确目标检测的关键要素。为了应对这些挑战，我们提出了一种新颖的注意力机制，称为局部-全局注意力，旨在更好地整合局部和全局上下文特征。具体而言，我们的方法将多分辨率卷积与位置编码相结合，使模型能够专注于局部细节，同时考虑更广泛的全局上下文。此外，我们引入了一个可学习的参数，允许模型根据任务的具体要求动态调整局部和全局注意力的相对重要性，从而优化跨多个尺度的特征表示。我们在几个广泛使用目标检测和分类数据集上彻底评估了局部-全局注意力机制。我们的实验结果表明，这种方法显著增强了对不同尺度目标的检测，在多类和小目标检测任务上的表现尤其出色。与现有的注意力机制相比，局部-全局注意力在几个关键指标上始终优于它们，同时保持了计算效率。", "author": "Yifan Shao et.al.", "authors": "Yifan Shao", "id": "2411.09604v1", "paper_url": "http://arxiv.org/abs/2411.09604v1", "repo": "https://github.com/ziyueqingwan/localglobalattention"}}