{"2408.12003": {"publish_time": "2024-08-21", "title": "RAG-Optimized Tibetan Tourism LLMs: Enhancing Accuracy and Personalization", "paper_summary": "With the development of the modern social economy, tourism has become an\nimportant way to meet people's spiritual needs, bringing development\nopportunities to the tourism industry. However, existing large language models\n(LLMs) face challenges in personalized recommendation capabilities and the\ngeneration of content that can sometimes produce hallucinations. This study\nproposes an optimization scheme for Tibet tourism LLMs based on\nretrieval-augmented generation (RAG) technology. By constructing a database of\ntourist viewpoints and processing the data using vectorization techniques, we\nhave significantly improved retrieval accuracy. The application of RAG\ntechnology effectively addresses the hallucination problem in content\ngeneration. The optimized model shows significant improvements in fluency,\naccuracy, and relevance of content generation. This research demonstrates the\npotential of RAG technology in the standardization of cultural tourism\ninformation and data analysis, providing theoretical and technical support for\nthe development of intelligent cultural tourism service systems.", "paper_summary_zh": "隨著現代社會經濟的發展，旅遊已成為滿足人們精神需求的重要途徑，為旅遊產業帶來發展機遇。但現有的大語言模型（LLMs）在個性化推薦能力和內容生成方面面臨挑戰，有時會產生幻覺。本研究提出基於檢索增強生成（RAG）技術的西藏旅遊LLMs優化方案。通過構建旅遊景點數據庫，並利用向量化技術對數據進行處理，顯著提升了檢索準確率。RAG技術的應用有效地解決了內容生成中的幻覺問題。優化的模型在內容生成的流暢性、準確性和相關性方面均有顯著提升。本研究驗證了RAG技術在文化旅遊信息標準化和數據分析方面的潛力，為智能文化旅遊服務系統的發展提供理論和技術支撐。", "author": "Jinhu Qi et.al.", "authors": "Jinhu Qi, Shuai Yan, Yibo Zhang, Wentao Zhang, Rong Jin, Yuwei Hu, Ke Wang", "id": "2408.12003v1", "paper_url": "http://arxiv.org/abs/2408.12003v1", "repo": "null"}}