{"2410.06703": {"publish_time": "2024-10-09", "title": "ST-WebAgentBench: A Benchmark for Evaluating Safety and Trustworthiness in Web Agents", "paper_summary": "Recent advancements in LLM-based web agents have introduced novel\narchitectures and benchmarks showcasing progress in autonomous web navigation\nand interaction. However, most existing benchmarks prioritize effectiveness and\naccuracy, overlooking crucial factors like safety and trustworthiness which are\nessential for deploying web agents in enterprise settings. The risks of unsafe\nweb agent behavior, such as accidentally deleting user accounts or performing\nunintended actions in critical business operations, pose significant barriers\nto widespread adoption.In this paper, we present ST-WebAgentBench, a new online\nbenchmark specifically designed to evaluate the safety and trustworthiness of\nweb agents in enterprise contexts. This benchmark is grounded in a detailed\nframework that defines safe and trustworthy (ST) agent behavior, outlines how\nST policies should be structured and introduces the Completion under Policies\nmetric to assess agent performance. Our evaluation reveals that current SOTA\nagents struggle with policy adherence and cannot yet be relied upon for\ncritical business applications. Additionally, we propose architectural\nprinciples aimed at improving policy awareness and compliance in web agents. We\nopen-source this benchmark and invite the community to contribute, with the\ngoal of fostering a new generation of safer, more trustworthy AI agents.", "paper_summary_zh": "最近基於 LLM 的網路代理的進展引入了新的架構和基準，展示了自主網路導航和互動的進展。然而，現有的基準大多重視有效性和準確性，卻忽略了在企業環境中部署網路代理必備的安全性和可信賴性等關鍵因素。網路代理行為不安全的風險，例如意外刪除使用者帳戶或在關鍵業務運作中執行意外動作，會對廣泛採用造成重大障礙。在本文中，我們提出了 ST-WebAgentBench，這是一個專門設計用於評估企業環境中網路代理的安全性和可信賴性的新線上基準。此基準建立在一個詳細的架構上，定義了安全和可信賴 (ST) 代理行為，概述了 ST 政策應如何制定，並引入了在政策下完成的指標來評估代理效能。我們的評估顯示，目前的 SOTA 代理在政策遵守方面有困難，而且還無法依賴在關鍵業務應用程式上。此外，我們提出了旨在改善網路代理中政策意識和遵循度的架構原則。我們開放原始碼這個基準，並邀請社群共同貢獻，目標是培育新一代更安全、更可信賴的 AI 代理。", "author": "Ido Levy et.al.", "authors": "Ido Levy, Ben Wiesel, Sami Marreed, Alon Oved, Avi Yaeli, Segev Shlomov", "id": "2410.06703v1", "paper_url": "http://arxiv.org/abs/2410.06703v1", "repo": "null"}}