{"2407.21491": {"publish_time": "2024-07-31", "title": "Generative Expressive Conversational Speech Synthesis", "paper_summary": "Conversational Speech Synthesis (CSS) aims to express a target utterance with\nthe proper speaking style in a user-agent conversation setting. Existing CSS\nmethods employ effective multi-modal context modeling techniques to achieve\nempathy understanding and expression. However, they often need to design\ncomplex network architectures and meticulously optimize the modules within\nthem. In addition, due to the limitations of small-scale datasets containing\nscripted recording styles, they often fail to simulate real natural\nconversational styles. To address the above issues, we propose a novel\ngenerative expressive CSS system, termed GPT-Talker.We transform the multimodal\ninformation of the multi-turn dialogue history into discrete token sequences\nand seamlessly integrate them to form a comprehensive user-agent dialogue\ncontext. Leveraging the power of GPT, we predict the token sequence, that\nincludes both semantic and style knowledge, of response for the agent. After\nthat, the expressive conversational speech is synthesized by the\nconversation-enriched VITS to deliver feedback to the user.Furthermore, we\npropose a large-scale Natural CSS Dataset called NCSSD, that includes both\nnaturally recorded conversational speech in improvised styles and dialogues\nextracted from TV shows. It encompasses both Chinese and English languages,\nwith a total duration of 236 hours.We conducted comprehensive experiments on\nthe reliability of the NCSSD and the effectiveness of our GPT-Talker. Both\nsubjective and objective evaluations demonstrate that our model outperforms\nother state-of-the-art CSS systems significantly in terms of naturalness and\nexpressiveness. The Code, Dataset, and Pre-trained Model are available at:\nhttps://github.com/AI-S2-Lab/GPT-Talker.", "paper_summary_zh": "對話式語音合成 (CSS) 旨在在使用者代理對話設定中，以適當的說話風格表達目標語句。現有的 CSS 方法採用有效的多模式脈絡建模技術，以達成同理理解與表達。然而，他們經常需要設計複雜的網路架構，並仔細優化其中的模組。此外，由於包含腳本錄製風格的小規模資料集的限制，他們經常無法模擬真實自然的對話風格。為了解決上述問題，我們提出了一個新穎的生成表達式 CSS 系統，稱為 GPT-Talker。我們將多輪對話歷程的多模式資訊轉換為離散的符號序列，並將它們無縫整合，以形成一個全面的使用者代理對話脈絡。利用 GPT 的強大功能，我們預測了回應的符號序列，其中包括代理的語意和風格知識。在那之後，表達式的對話式語音由對話豐富的 VITS 合成，以向使用者提供回饋。此外，我們提出了一個名為 NCSSD 的大型自然 CSS 資料集，其中包括以即興風格自然錄製的對話式語音，以及從電視節目中擷取的對話。它包含中文和英文，總時長為 236 小時。我們對 NCSSD 的可靠性和我們 GPT-Talker 的有效性進行了全面的實驗。主觀和客觀評估均證明，我們的模型在自然性和表現力方面明顯優於其他最先進的 CSS 系統。程式碼、資料集和預訓練模型可在以下網址取得：https://github.com/AI-S2-Lab/GPT-Talker。", "author": "Rui Liu et.al.", "authors": "Rui Liu, Yifan Hu, Ren Yi, Yin Xiang, Haizhou Li", "id": "2407.21491v1", "paper_url": "http://arxiv.org/abs/2407.21491v1", "repo": "null"}}