{"2405.20643": {"publish_time": "2024-05-31", "title": "Learning Gaze-aware Compositional GAN", "paper_summary": "Gaze-annotated facial data is crucial for training deep neural networks\n(DNNs) for gaze estimation. However, obtaining these data is labor-intensive\nand requires specialized equipment due to the challenge of accurately\nannotating the gaze direction of a subject. In this work, we present a\ngenerative framework to create annotated gaze data by leveraging the benefits\nof labeled and unlabeled data sources. We propose a Gaze-aware Compositional\nGAN that learns to generate annotated facial images from a limited labeled\ndataset. Then we transfer this model to an unlabeled data domain to take\nadvantage of the diversity it provides. Experiments demonstrate our approach's\neffectiveness in generating within-domain image augmentations in the ETH-XGaze\ndataset and cross-domain augmentations in the CelebAMask-HQ dataset domain for\ngaze estimation DNN training. We also show additional applications of our work,\nwhich include facial image editing and gaze redirection.", "paper_summary_zh": "用凝視標註的人臉資料對於訓練深度神經網路 (DNN) 以進行凝視估計至關重要。然而，取得這些資料需要大量人力，且由於準確標註受試者的凝視方向具有挑戰性，因此需要專業的設備。在這項工作中，我們提出了一個生成式架構，透過利用標籤資料和未標籤資料來源的優點，來建立標註的凝視資料。我們提出了一個凝視感知合成 GAN，該 GAN 會學習從有限的標籤資料集中產生標註的人臉影像。然後，我們將此模型轉移到未標籤的資料網域，以利用其所提供的多樣性。實驗證明了我們的方法在 ETH-XGaze 資料集中產生同網域影像擴充，以及在 CelebAMask-HQ 資料集網域中產生跨網域擴充的有效性，以進行凝視估計 DNN 訓練。我們也展示了我們工作的其他應用，包括人臉影像編輯和凝視重新導向。", "author": "Nerea Aranjuelo et.al.", "authors": "Nerea Aranjuelo, Siyu Huang, Ignacio Arganda-Carreras, Luis Unzueta, Oihana Otaegui, Hanspeter Pfister, Donglai Wei", "id": "2405.20643v1", "paper_url": "http://arxiv.org/abs/2405.20643v1", "repo": "https://github.com/naranjuelo/gc-gan"}}