{"2411.12502": {"publish_time": "2024-11-19", "title": "Transformer Neural Processes -- Kernel Regression", "paper_summary": "Stochastic processes model various natural phenomena from disease\ntransmission to stock prices, but simulating and quantifying their uncertainty\ncan be computationally challenging. For example, modeling a Gaussian Process\nwith standard statistical methods incurs an $\\mathcal{O}(n^3)$ penalty, and\neven using state-of-the-art Neural Processes (NPs) incurs an $\\mathcal{O}(n^2)$\npenalty due to the attention mechanism. We introduce the Transformer Neural\nProcess - Kernel Regression (TNP-KR), a new architecture that incorporates a\nnovel transformer block we call a Kernel Regression Block (KRBlock), which\nreduces the computational complexity of attention in transformer-based Neural\nProcesses (TNPs) from $\\mathcal{O}((n_C+n_T)^2)$ to $O(n_C^2+n_Cn_T)$ by\neliminating masked computations, where $n_C$ is the number of context, and\n$n_T$ is the number of test points, respectively, and a fast attention variant\nthat further reduces all attention calculations to $\\mathcal{O}(n_C)$ in space\nand time complexity. In benchmarks spanning such tasks as meta-regression,\nBayesian optimization, and image completion, we demonstrate that the full\nvariant matches the performance of state-of-the-art methods while training\nfaster and scaling two orders of magnitude higher in number of test points, and\nthe fast variant nearly matches that performance while scaling to millions of\nboth test and context points on consumer hardware.", "paper_summary_zh": "隨機過程模擬了從疾病傳播到股票價格的各種自然現象，但模擬和量化它們的不確定性在計算上可能具有挑戰性。例如，使用標準統計方法對高斯過程進行建模會產生 $\\mathcal{O}(n^3)$ 懲罰，即使使用最先進的神經過程 (NP) 由於注意力機制也會產生 $\\mathcal{O}(n^2)$ 懲罰。我們介紹了 Transformer 神經過程 - 核迴歸 (TNP-KR)，這是一種新的架構，它包含了一個我們稱之為核迴歸塊 (KRBlock) 的新Transformer塊，它通過消除Transformer中基於注意力的神經過程 (TNP) 中的掩碼計算將計算複雜度從 $\\mathcal{O}((n_C+n_T)^2)$ 降低到 $O(n_C^2+n_Cn_T)$，其中 $n_C$ 分別是上下文數量，而 $n_T$ 是測試點數量，以及一種快速注意變體，它進一步將所有注意力計算減少到 $\\mathcal{O}(n_C)$ 的空間和時間複雜度。在涵蓋元迴歸、貝葉斯優化和圖像完成等任務的基準測試中，我們證明了完整變體在訓練速度更快且測試點數量擴展兩個數量級的同時，與最先進方法的性能相匹配，而快速變體在擴展到數百萬個測試和上下文點時幾乎與該性能相匹配消費者硬體。", "author": "Daniel Jenson et.al.", "authors": "Daniel Jenson, Jhonathan Navott, Mengyan Zhang, Makkunda Sharma, Elizaveta Semenova, Seth Flaxman", "id": "2411.12502v1", "paper_url": "http://arxiv.org/abs/2411.12502v1", "repo": "null"}}