{"2406.11839": {"publish_time": "2024-06-17", "title": "mDPO: Conditional Preference Optimization for Multimodal Large Language Models", "paper_summary": "Direct preference optimization (DPO) has shown to be an effective method for\nlarge language model (LLM) alignment. Recent works have attempted to apply DPO\nto multimodal scenarios but have found it challenging to achieve consistent\nimprovement. Through a comparative experiment, we identify the unconditional\npreference problem in multimodal preference optimization, where the model\noverlooks the image condition. To address this problem, we propose mDPO, a\nmultimodal DPO objective that prevents the over-prioritization of language-only\npreferences by also optimizing image preference. Moreover, we introduce a\nreward anchor that forces the reward to be positive for chosen responses,\nthereby avoiding the decrease in their likelihood -- an intrinsic problem of\nrelative preference optimization. Experiments on two multimodal LLMs of\ndifferent sizes and three widely used benchmarks demonstrate that mDPO\neffectively addresses the unconditional preference problem in multimodal\npreference optimization and significantly improves model performance,\nparticularly in reducing hallucination.", "paper_summary_zh": "直接偏好最佳化 (DPO) 已被證明是大型語言模型 (LLM) 對齊的有效方法。最近的研究已嘗試將 DPO 應用於多模態場景，但發現難以達成一致的改善。透過比較實驗，我們找出多模態偏好最佳化中的無條件偏好問題，其中模型忽略了影像條件。為了解決此問題，我們提出 mDPO，一種多模態 DPO 目標，透過最佳化影像偏好來防止過度優先考慮僅語言的偏好。此外，我們引入了獎勵錨點，強制獎勵對所選回應為正值，從而避免其可能性降低——這是相對偏好最佳化的內在問題。在不同大小的兩個多模態 LLM 和三個廣泛使用的基準上的實驗證明，mDPO 有效地解決了多模態偏好最佳化中的無條件偏好問題，並顯著改善了模型效能，特別是在減少幻覺方面。", "author": "Fei Wang et.al.", "authors": "Fei Wang, Wenxuan Zhou, James Y. Huang, Nan Xu, Sheng Zhang, Hoifung Poon, Muhao Chen", "id": "2406.11839v1", "paper_url": "http://arxiv.org/abs/2406.11839v1", "repo": "null"}}