{"2409.05076": {"publish_time": "2024-09-08", "title": "PIP: Detecting Adversarial Examples in Large Vision-Language Models via Attention Patterns of Irrelevant Probe Questions", "paper_summary": "Large Vision-Language Models (LVLMs) have demonstrated their powerful\nmultimodal capabilities. However, they also face serious safety problems, as\nadversaries can induce robustness issues in LVLMs through the use of\nwell-designed adversarial examples. Therefore, LVLMs are in urgent need of\ndetection tools for adversarial examples to prevent incorrect responses. In\nthis work, we first discover that LVLMs exhibit regular attention patterns for\nclean images when presented with probe questions. We propose an unconventional\nmethod named PIP, which utilizes the attention patterns of one randomly\nselected irrelevant probe question (e.g., \"Is there a clock?\") to distinguish\nadversarial examples from clean examples. Regardless of the image to be tested\nand its corresponding question, PIP only needs to perform one additional\ninference of the image to be tested and the probe question, and then achieves\nsuccessful detection of adversarial examples. Even under black-box attacks and\nopen dataset scenarios, our PIP, coupled with a simple SVM, still achieves more\nthan 98% recall and a precision of over 90%. Our PIP is the first attempt to\ndetect adversarial attacks on LVLMs via simple irrelevant probe questions,\nshedding light on deeper understanding and introspection within LVLMs. The code\nis available at https://github.com/btzyd/pip.", "paper_summary_zh": "大型視覺語言模型 (LVLMs) 已展現其強大的多模態能力。然而，它們也面臨嚴重的安全問題，因為對手可以透過使用精心設計的對抗範例，在 LVLMs 中引發健全性問題。因此，LVLMs 迫切需要對抗範例的偵測工具，以防止不正確的回應。在此研究中，我們首先發現當 LVLMs 面對探測問題時，它們會對乾淨的影像展現規律的注意力模式。我們提出一個名為 PIP 的非常規方法，它利用一個隨機選擇的不相關探測問題（例如「那裡有鐘嗎？」）的注意力模式，來區分對抗範例與乾淨範例。無論要測試的影像及其對應問題為何，PIP 只需要對要測試的影像和探測問題執行一次額外的推論，然後就能成功偵測對抗範例。即使在黑盒攻擊和開放資料集場景下，我們的 PIP 結合一個簡單的 SVM，仍可達到超過 98% 的召回率和超過 90% 的精確度。我們的 PIP 是第一個嘗試透過簡單的不相關探測問題來偵測 LVLMs 上的對抗攻擊，為 LVLMs 中更深入的理解和內省提供了啟發。程式碼可在 https://github.com/btzyd/pip 取得。", "author": "Yudong Zhang et.al.", "authors": "Yudong Zhang, Ruobing Xie, Jiansheng Chen, Xingwu Sun, Yu Wang", "id": "2409.05076v1", "paper_url": "http://arxiv.org/abs/2409.05076v1", "repo": "null"}}