{"2410.18035": {"publish_time": "2024-10-23", "title": "MiLoRA: Efficient Mixture of Low-Rank Adaptation for Large Language Models Fine-tuning", "paper_summary": "Low-rank adaptation (LoRA) and its mixture-of-experts (MOE) variants are\nhighly effective parameter-efficient fine-tuning (PEFT) methods. However, they\nintroduce significant latency in multi-tenant settings due to the LoRA modules\nand MOE routers added to multiple linear modules in the Transformer layer. To\naddress this issue, we propose Mixture of Low-Rank Adaptation (MiLoRA), a novel\nand efficient LoRA variant. MiLoRA differs from previous MOE-style LoRA methods\nby considering each LoRA module as an expert and employing a prompt-aware\nrouting mechanism. This mechanism calculates expert routing results once before\ngenerating the first new token and reuses these results for subsequent tokens,\nreducing latency. Extensive experiments and analysis on commonsense reasoning\ntasks, math reasoning tasks, and widely used LLM evaluation benchmarks\ndemonstrate that MiLoRA consistently outperforms strong PEFT baselines with\ncomparable tunable parameter budgets. Additionally, MiLoRA significantly\nreduces latency in multi-tenant settings compared to previous LoRA-based\nmethods.", "paper_summary_zh": "低秩適應 (LoRA) 及其混合專家 (MOE) 變體是高效率的參數有效微調 (PEFT) 方法。然而，由於在 Transformer 層中加入了 LoRA 模組和 MOE 路由器到多個線性模組中，它們在多租戶設定中引入了顯著的延遲。為了解決這個問題，我們提出了低秩適應混合 (MiLoRA)，一種新穎且高效的 LoRA 變體。MiLoRA 與先前的 MOE 風格 LoRA 方法不同，它將每個 LoRA 模組視為專家，並採用提示感知路由機制。此機制在產生第一個新符號之前計算一次專家路由結果，並將這些結果重複使用於後續符號，從而降低延遲。在常識推理任務、數學推理任務和廣泛使用的 LLM 評估基準上的廣泛實驗和分析表明，MiLoRA 持續優於具有可比較可調整參數預算的強大 PEFT 基準。此外，與先前的基於 LoRA 的方法相比，MiLoRA 在多租戶設定中顯著降低了延遲。", "author": "Jingfan Zhang et.al.", "authors": "Jingfan Zhang, Yi Zhao, Dan Chen, Xing Tian, Huanran Zheng, Wei Zhu", "id": "2410.18035v1", "paper_url": "http://arxiv.org/abs/2410.18035v1", "repo": "null"}}