{"2503.07682": {"publish_time": "2025-03-10", "title": "A Time Series Multitask Framework Integrating a Large Language Model, Pre-Trained Time Series Model, and Knowledge Graph", "paper_summary": "Time series analysis is crucial in fields like finance, transportation, and\nindustry. However, traditional models often focus solely on temporal features,\nlimiting their ability to capture underlying information. This paper proposes a\nnovel time series multitask framework, called LTM, which integrates temporal\nfeatures with textual descriptions to enhance analytical and predictive\ncapabilities. LTM combines pre-trained time series model, large language model\n(LLM), and knowledge graph to tackle time series tasks, including forecasting,\nimputation, and anomaly detection. LTM achieves improved performance with a few\ntrainable parameters. It is very efficient and practical. LTM encodes time\nseries data into patches and enriches user-provided prompts using knowledge\ngraphs to generate enhanced prompts. A novel feature fusion method embeds\nprompts into each patch encoding, which is processed by a frozen LLM, followed\nby a feature enhancement module and a time decoder module. During fine-tuning\nstage, cosine similarity between prompts and temporal patches is integrated\ninto the loss function to boost performance. Experiments on benchmark datasets\nshow that LTM significantly outperforms existing methods. It provides a robust\nand versatile solution for time series tasks.", "paper_summary_zh": "時間序列分析在金融、交通和工業等領域至關重要。然而，傳統模型通常只關注時間特徵，限制了其捕捉潛在資訊的能力。本文提出了一種新穎的時間序列多任務框架，稱為 LTM，它整合了時間特徵和文字描述以增強分析和預測能力。LTM 結合了預訓練的時間序列模型、大型語言模型（LLM）和知識圖譜來處理時間序列任務，包括預測、插補和異常檢測。LTM 只需少量可訓練參數即可提高效能。它非常高效且實用。LTM 將時間序列數據編碼成區塊，並使用知識圖譜豐富使用者提供的提示以產生增強的提示。一種新穎的特徵融合方法將提示嵌入到每個區塊編碼中，該編碼由凍結的 LLM 處理，然後由特徵增強模組和時間解碼器模組處理。在微調階段，提示和時間區塊之間的餘弦相似度被整合到損失函數中以提高效能。在基準數據集上的實驗表明，LTM 的效能顯著優於現有方法。它為時間序列任務提供了一個強大且通用的解決方案。\n", "author": "Shule Hao et.al.", "authors": "Shule Hao, Junpeng Bao, Chuncheng Lu", "id": "2503.07682v1", "paper_url": "http://arxiv.org/abs/2503.07682v1", "repo": "null"}}