{"2411.07494": {"publish_time": "2024-11-12", "title": "Rapid Response: Mitigating LLM Jailbreaks with a Few Examples", "paper_summary": "As large language models (LLMs) grow more powerful, ensuring their safety\nagainst misuse becomes crucial. While researchers have focused on developing\nrobust defenses, no method has yet achieved complete invulnerability to\nattacks. We propose an alternative approach: instead of seeking perfect\nadversarial robustness, we develop rapid response techniques to look to block\nwhole classes of jailbreaks after observing only a handful of attacks. To study\nthis setting, we develop RapidResponseBench, a benchmark that measures a\ndefense's robustness against various jailbreak strategies after adapting to a\nfew observed examples. We evaluate five rapid response methods, all of which\nuse jailbreak proliferation, where we automatically generate additional\njailbreaks similar to the examples observed. Our strongest method, which\nfine-tunes an input classifier to block proliferated jailbreaks, reduces attack\nsuccess rate by a factor greater than 240 on an in-distribution set of\njailbreaks and a factor greater than 15 on an out-of-distribution set, having\nobserved just one example of each jailbreaking strategy. Moreover, further\nstudies suggest that the quality of proliferation model and number of\nproliferated examples play an key role in the effectiveness of this defense.\nOverall, our results highlight the potential of responding rapidly to novel\njailbreaks to limit LLM misuse.", "paper_summary_zh": "隨著大型語言模型（LLM）變得越來越強大，確保它們不會被濫用變得至關重要。儘管研究人員專注於開發強大的防禦措施，但目前還沒有任何方法能完全抵禦攻擊。我們提出了一種替代方法：不是尋求完美的對抗性穩健性，而是開發快速的應對技術，在僅觀察到少數攻擊後就能阻止整類越獄。為了研究這種設定，我們開發了 RapidResponseBench，這是一個基準測試，用於衡量防禦措施在適應少數觀察到的範例後對各種越獄策略的穩健性。我們評估了五種快速應對方法，所有這些方法都使用越獄擴散，我們自動生成與觀察到的範例類似的其他越獄。我們最強大的方法是微調輸入分類器以阻止擴散的越獄，它將攻擊成功率降低了 240 倍以上，在分佈式越獄集合上，以及在觀察到每個越獄策略的一個範例後，在非分佈式集合上降低了 15 倍以上。此外，進一步的研究表明，擴散模型的品質和擴散範例的數量在這種防禦措施的有效性中扮演了關鍵角色。總的來說，我們的結果突顯了快速應對新型越獄以限制 LLM 濫用的潛力。", "author": "Alwin Peng et.al.", "authors": "Alwin Peng, Julian Michael, Henry Sleight, Ethan Perez, Mrinank Sharma", "id": "2411.07494v1", "paper_url": "http://arxiv.org/abs/2411.07494v1", "repo": "null"}}