{"2409.11813": {"publish_time": "2024-09-18", "title": "EventAug: Multifaceted Spatio-Temporal Data Augmentation Methods for Event-based Learning", "paper_summary": "The event camera has demonstrated significant success across a wide range of\nareas due to its low time latency and high dynamic range. However, the\ncommunity faces challenges such as data deficiency and limited diversity, often\nresulting in over-fitting and inadequate feature learning. Notably, the\nexploration of data augmentation techniques in the event community remains\nscarce. This work aims to address this gap by introducing a systematic\naugmentation scheme named EventAug to enrich spatial-temporal diversity. In\nparticular, we first propose Multi-scale Temporal Integration (MSTI) to\ndiversify the motion speed of objects, then introduce Spatial-salient Event\nMask (SSEM) and Temporal-salient Event Mask (TSEM) to enrich object variants.\nOur EventAug can facilitate models learning with richer motion patterns, object\nvariants and local spatio-temporal relations, thus improving model robustness\nto varied moving speeds, occlusions, and action disruptions. Experiment results\nshow that our augmentation method consistently yields significant improvements\nacross different tasks and backbones (e.g., a 4.87% accuracy gain on DVS128\nGesture). Our code will be publicly available for this community.", "paper_summary_zh": "事件相机因其低时间延迟和高动态范围而在广泛的领域展示出显著的成功。然而，该社区面临着数据不足和多样性受限等挑战，通常会导致过度拟合和特征学习不足。值得注意的是，在事件社区中探索数据增强技术仍然很少。这项工作旨在通过引入一个名为 EventAug 的系统增强方案来解决这一差距，以丰富时空多样性。具体来说，我们首先提出多尺度时间积分（MSTI）来使物体运动速度多样化，然后引入空间显著事件掩码（SSEM）和时间显著事件掩码（TSEM）来丰富物体变体。我们的 EventAug 可以促进模型学习具有更丰富的运动模式、物体变体和局部时空关系，从而提高模型对不同移动速度、遮挡和动作中断的鲁棒性。实验结果表明，我们的增强方法在不同的任务和骨干网络（例如，DVS128 手势上的 4.87% 精度提升）中始终产生显著的改进。我们的代码将为该社区公开。", "author": "Yukun Tian et.al.", "authors": "Yukun Tian, Hao Chen, Yongjian Deng, Feihong Shen, Kepan Liu, Wei You, Ziyang Zhang", "id": "2409.11813v1", "paper_url": "http://arxiv.org/abs/2409.11813v1", "repo": "null"}}