{"2502.21236": {"publish_time": "2025-02-28", "title": "Transforming Tuberculosis Care: Optimizing Large Language Models For Enhanced Clinician-Patient Communication", "paper_summary": "Tuberculosis (TB) is the leading cause of death from an infectious disease\nglobally, with the highest burden in low- and middle-income countries. In these\nregions, limited healthcare access and high patient-to-provider ratios impede\neffective patient support, communication, and treatment completion. To bridge\nthis gap, we propose integrating a specialized Large Language Model into an\nefficacious digital adherence technology to augment interactive communication\nwith treatment supporters. This AI-powered approach, operating within a\nhuman-in-the-loop framework, aims to enhance patient engagement and improve TB\ntreatment outcomes.", "paper_summary_zh": "<paragraph>結核病 (TB) 是全球傳染病致死的主要原因，低收入和中等收入國家的負擔最重。在這些地區，有限的醫療保健資源和高患者與醫療提供者比例阻礙了有效的患者支持、溝通和治療完成。為了彌合這一差距，我們建議將一個專門的大型語言模型整合到有效的數位依從性技術中，以增強與治療支持者的互動溝通。這種由人工智慧驅動的方法，在人機迴圈框架內運作，旨在提高患者參與度並改善結核病治療結果。</paragraph>\n", "author": "Daniil Filienko et.al.", "authors": "Daniil Filienko, Mahek Nizar, Javier Roberti, Denise Galdamez, Haroon Jakher, Sarah Iribarren, Weichao Yuwen, Martine De Cock", "id": "2502.21236v1", "paper_url": "http://arxiv.org/abs/2502.21236v1", "repo": "null"}}