{"2502.08754": {"publish_time": "2025-02-12", "title": "HistoSmith: Single-Stage Histology Image-Label Generation via Conditional Latent Diffusion for Enhanced Cell Segmentation and Classification", "paper_summary": "Precise segmentation and classification of cell instances are vital for\nanalyzing the tissue microenvironment in histology images, supporting medical\ndiagnosis, prognosis, treatment planning, and studies of brain\ncytoarchitecture. However, the creation of high-quality annotated datasets for\ntraining remains a major challenge. This study introduces a novel single-stage\napproach (HistoSmith) for generating image-label pairs to augment histology\ndatasets. Unlike state-of-the-art methods that utilize diffusion models with\nseparate components for label and image generation, our approach employs a\nlatent diffusion model to learn the joint distribution of cellular layouts,\nclassification masks, and histology images. This model enables tailored data\ngeneration by conditioning on user-defined parameters such as cell types,\nquantities, and tissue types. Trained on the Conic H&E histopathology dataset\nand the Nissl-stained CytoDArk0 dataset, the model generates realistic and\ndiverse labeled samples. Experimental results demonstrate improvements in cell\ninstance segmentation and classification, particularly for underrepresented\ncell types like neutrophils in the Conic dataset. These findings underscore the\npotential of our approach to address data scarcity challenges.", "paper_summary_zh": "精確的細胞實例分割和分類對於分析組織學影像中的組織微環境、支援醫療診斷、預後、治療規劃和腦部細胞結構研究至關重要。然而，建立用於訓練的高品質標註資料集仍然是一項重大挑戰。本研究提出了一種新穎的單階段方法 (HistoSmith)，用於產生影像標籤對，以擴充組織學資料集。與利用擴散模型並將標籤和影像產生分開的組成部分的現有技術不同，我們的做法採用潛在擴散模型來學習細胞佈局、分類遮罩和組織學影像的聯合分佈。此模型能透過調整使用者定義的參數（例如細胞類型、數量和組織類型）來進行客製化資料產生。在 Conic H&E 細胞病理學資料集和 Nissl 染色的 CytoDArk0 資料集上訓練後，此模型產生逼真且多樣化的標籤樣本。實驗結果顯示細胞實例分割和分類有顯著進步，特別是對於 Conic 資料集中代表性不足的細胞類型，例如中性球。這些發現強調了我們的方法在解決資料稀少性挑戰方面的潛力。", "author": "Valentina Vadori et.al.", "authors": "Valentina Vadori, Jean-Marie Graïc, Antonella Peruffo, Livio Finos, Ujwala Kiran Chaudhari, Enrico Grisan", "id": "2502.08754v1", "paper_url": "http://arxiv.org/abs/2502.08754v1", "repo": "null"}}