{"2405.09913": {"publish_time": "2024-05-16", "title": "TransMI: A Framework to Create Strong Baselines from Multilingual Pretrained Language Models for Transliterated Data", "paper_summary": "Transliterating related languages that use different scripts into a common\nscript shows effectiveness in improving crosslingual transfer in downstream\ntasks. However, this methodology often makes pretraining a model from scratch\nunavoidable, as transliteration brings about new subwords not covered in\nexisting multilingual pretrained language models (mPLMs). This is not desired\nbecause it takes a lot of computation budget for pretraining. A more promising\nway is to make full use of available mPLMs. To this end, this paper proposes a\nsimple but effective framework: Transliterate-Merge-Initialize (TransMI), which\ncan create a strong baseline well-suited for data that is transliterated into a\ncommon script by exploiting an mPLM and its accompanied tokenizer. TransMI has\nthree stages: (a) transliterate the vocabulary of an mPLM into a common script;\n(b) merge the new vocabulary with the original vocabulary; and (c) initialize\nthe embeddings of the new subwords. We applied TransMI to three recent strong\nmPLMs, and our experiments demonstrate that TransMI not only preserves their\nability to handle non-transliterated data, but also enables the models to\neffectively process transliterated data: the results show a consistent\nimprovement of 3% to 34%, varying across different models and tasks. We make\nour code and models publicly available at\n\\url{https://github.com/cisnlp/TransMI}.", "paper_summary_zh": "將使用不同腳本的相關語言轉錄成通用腳本，在改善下游任務中的跨語言轉移方面顯示出有效性。然而，這種方法通常會使從頭開始預訓練模型變得不可避免，因為轉錄會產生現有 mPLM（多語言預訓練語言模型）中未涵蓋的新子詞。這並非理想，因為預訓練需要大量的計算預算。一個更有前景的方法是充分利用現有的 mPLM。為此，本文提出了一個簡單但有效的框架：轉錄-合併-初始化（TransMI），它可以創建一個強大的基線，非常適合通過利用 mPLM 及其附帶的 tokenizer 轉錄成通用腳本的數據。TransMI 有三個階段：(a) 將 mPLM 的詞彙轉錄成通用腳本；(b) 將新詞彙與原始詞彙合併；(c) 初始化新子詞的嵌入。我們將 TransMI 應用於三個最近的強大 mPLM，我們的實驗表明 TransMI 不僅保留了它們處理未轉錄數據的能力，而且使模型能夠有效處理轉錄數據：結果顯示在不同的模型和任務中，一致地改進了 3% 到 34%。我們在 \\url{https://github.com/cisnlp/TransMI} 公開我們的代碼和模型。", "author": "Yihong Liu et.al.", "authors": "Yihong Liu, Chunlan Ma, Haotian Ye, Hinrich Schütze", "id": "2405.09913v1", "paper_url": "http://arxiv.org/abs/2405.09913v1", "repo": "https://github.com/cisnlp/transmi"}}