{"2405.17088": {"publish_time": "2024-05-27", "title": "Phase Transitions in the Output Distribution of Large Language Models", "paper_summary": "In a physical system, changing parameters such as temperature can induce a\nphase transition: an abrupt change from one state of matter to another.\nAnalogous phenomena have recently been observed in large language models.\nTypically, the task of identifying phase transitions requires human analysis\nand some prior understanding of the system to narrow down which low-dimensional\nproperties to monitor and analyze. Statistical methods for the automated\ndetection of phase transitions from data have recently been proposed within the\nphysics community. These methods are largely system agnostic and, as shown\nhere, can be adapted to study the behavior of large language models. In\nparticular, we quantify distributional changes in the generated output via\nstatistical distances, which can be efficiently estimated with access to the\nprobability distribution over next-tokens. This versatile approach is capable\nof discovering new phases of behavior and unexplored transitions -- an ability\nthat is particularly exciting in light of the rapid development of language\nmodels and their emergent capabilities.", "paper_summary_zh": "在物理系統中，改變溫度等參數會誘發相變：物質從一種狀態突然轉變為另一種狀態。最近在大語言模型中觀察到了類似的現象。通常，識別相變的任務需要人工分析和對系統的一些先驗理解，以縮小要監控和分析的低維屬性範圍。最近在物理界提出了從數據中自動檢測相變的統計方法。這些方法在很大程度上與系統無關，並且如本文所示，可以適應於研究大語言模型的行為。特別是，我們通過統計距離量化生成輸出中的分佈變化，這些距離可以使用對下一個符號的概率分佈進行有效估計。這種通用方法能夠發現新的行為階段和未探索的轉變——這種能力在語言模型快速發展及其新興能力的背景下尤其令人興奮。", "author": "Julian Arnold et.al.", "authors": "Julian Arnold, Flemming Holtorf, Frank Schäfer, Niels Lörch", "id": "2405.17088v1", "paper_url": "http://arxiv.org/abs/2405.17088v1", "repo": "https://github.com/llmtransitions/llmtransitions"}}