{"2411.19434": {"publish_time": "2024-11-29", "title": "Actions and Objects Pathways for Domain Adaptation in Video Question Answering", "paper_summary": "In this paper, we introduce the Actions and Objects Pathways (AOPath) for\nout-of-domain generalization in video question answering tasks. AOPath\nleverages features from a large pretrained model to enhance generalizability\nwithout the need for explicit training on the unseen domains. Inspired by human\nbrain, AOPath dissociates the pretrained features into action and object\nfeatures, and subsequently processes them through separate reasoning pathways.\nIt utilizes a novel module which converts out-of-domain features into\ndomain-agnostic features without introducing any trainable weights. We validate\nthe proposed approach on the TVQA dataset, which is partitioned into multiple\nsubsets based on genre to facilitate the assessment of generalizability. The\nproposed approach demonstrates 5% and 4% superior performance over conventional\nclassifiers on out-of-domain and in-domain datasets, respectively. It also\noutperforms prior methods that involve training millions of parameters, whereas\nthe proposed approach trains very few parameters.", "paper_summary_zh": "在本文中，我們介紹了動作和對象路徑 (AOPath)，用於影片問答任務中的領域外概化。AOPath 利用大型預訓練模型中的特徵來增強概化能力，而無需針對未見過的領域進行明確的訓練。受人腦啟發，AOPath 將預訓練特徵分解為動作和對象特徵，然後透過獨立的推理路徑進行處理。它利用一個新穎的模組，將領域外特徵轉換為領域不可知的特徵，而不會引入任何可訓練權重。我們在 TVQA 資料集上驗證所提出的方法，該資料集根據類型劃分為多個子集，以利於評估概化能力。所提出的方法在領域外和領域內資料集上分別展示出比傳統分類器高出 5% 和 4% 的優異效能。它也優於先前涉及訓練數百萬個參數的方法，而所提出的方法訓練的參數非常少。", "author": "Safaa Abdullahi Moallim Mohamud et.al.", "authors": "Safaa Abdullahi Moallim Mohamud, Ho-Young Jung", "id": "2411.19434v1", "paper_url": "http://arxiv.org/abs/2411.19434v1", "repo": "null"}}