{"2408.11252": {"publish_time": "2024-08-21", "title": "Counterfactuals As a Means for Evaluating Faithfulness of Attribution Methods in Autoregressive Language Models", "paper_summary": "Despite the widespread adoption of autoregressive language models,\nexplainability evaluation research has predominantly focused on span infilling\nand masked language models (MLMs). Evaluating the faithfulness of an\nexplanation method -- how accurately the method explains the inner workings and\ndecision-making of the model -- is very challenging because it is very hard to\nseparate the model from its explanation. Most faithfulness evaluation\ntechniques corrupt or remove some input tokens considered important according\nto a particular attribution (feature importance) method and observe the change\nin the model's output. This approach creates out-of-distribution inputs for\ncausal language models (CLMs) due to their training objective of next token\nprediction. In this study, we propose a technique that leverages counterfactual\ngeneration to evaluate the faithfulness of attribution methods for\nautoregressive language modeling scenarios. Our technique creates fluent and\nin-distribution counterfactuals that makes evaluation protocol more reliable.\nCode is available at https://github.com/Sepehr-Kamahi/faith", "paper_summary_zh": "儘管自迴歸語言模型被廣泛採用，\n可解釋性評估研究主要集中在跨度填補\n和遮蔽語言模型 (MLM)。評估解釋方法的忠實度\n——方法多準確地解釋模型的內部運作和\n決策制定——極具挑戰性，因為很難\n將模型與其解釋分開。大多數忠實度評估\n技術會損壞或移除一些輸入代碼，這些代碼被認為很重要，具體取決於\n特定歸因（特徵重要性）方法，並觀察模型\n輸出的變化。由於下一個代碼預測的訓練目標，這種方法會為\n因果語言模型 (CLM) 建立出分布的輸入。在本研究中，我們提出了一種利用反事實\n生成來評估自迴歸語言建模場景的歸因方法的忠實度的技術。我們的技術建立流暢且\n在分布中的反事實，使評估協定更可靠。\n程式碼可在 https://github.com/Sepehr-Kamahi/faith 取得", "author": "Sepehr Kamahi et.al.", "authors": "Sepehr Kamahi, Yadollah Yaghoobzadeh", "id": "2408.11252v1", "paper_url": "http://arxiv.org/abs/2408.11252v1", "repo": "null"}}