{"2409.11145": {"publish_time": "2024-09-17", "title": "High-Resolution Speech Restoration with Latent Diffusion Model", "paper_summary": "Traditional speech enhancement methods often oversimplify the task of\nrestoration by focusing on a single type of distortion. Generative models that\nhandle multiple distortions frequently struggle with phone reconstruction and\nhigh-frequency harmonics, leading to breathing and gasping artifacts that\nreduce the intelligibility of reconstructed speech. These models are also\ncomputationally demanding, and many solutions are restricted to producing\noutputs in the wide-band frequency range, which limits their suitability for\nprofessional applications. To address these challenges, we propose Hi-ResLDM, a\nnovel generative model based on latent diffusion designed to remove multiple\ndistortions and restore speech recordings to studio quality, sampled at 48kHz.\nWe benchmark Hi-ResLDM against state-of-the-art methods that leverage GAN and\nConditional Flow Matching (CFM) components, demonstrating superior performance\nin regenerating high-frequency-band details. Hi-ResLDM not only excels in\nnon-instrusive metrics but is also consistently preferred in human evaluation\nand performs competitively on intrusive evaluations, making it ideal for\nhigh-resolution speech restoration.", "paper_summary_zh": "傳統的語音增強方法通常過度簡化復原任務，專注於單一類型的失真。處理多重失真的生成模型經常在語音重建和高頻諧波方面遇到困難，導致喘息和喘氣的偽影，降低了重建語音的可懂度。這些模型在計算上也很要求，許多解決方案僅限於產生寬頻頻率範圍的輸出，這限制了它們在專業應用中的適用性。為了應對這些挑戰，我們提出了 Hi-ResLDM，一種基於潛在擴散的新型生成模型，旨在消除多重失真並將語音錄音恢復到錄音室品質，採樣率為 48kHz。我們將 Hi-ResLDM 與利用 GAN 和條件流匹配 (CFM) 組件的最新方法進行基準測試，證明了在再生高頻帶細節方面的卓越性能。Hi-ResLDM 不僅在非侵入性指標中表現出色，而且在人類評估中也始終如一地受到青睞，並且在侵入性評估中表現出色，使其成為高解析度語音還原的理想選擇。", "author": "Tushar Dhyani et.al.", "authors": "Tushar Dhyani, Florian Lux, Michele Mancusi, Giorgio Fabbro, Fritz Hohl, Ngoc Thang Vu", "id": "2409.11145v1", "paper_url": "http://arxiv.org/abs/2409.11145v1", "repo": "null"}}