{"2410.21750": {"publish_time": "2024-10-29", "title": "Learning and Unlearning of Fabricated Knowledge in Language Models", "paper_summary": "What happens when a new piece of knowledge is introduced into the training\ndata and how long does it last while a large language model (LM) continues to\ntrain? We investigate this question by injecting facts into LMs from a new\nprobing dataset, \"Outlandish\", which is designed to permit the testing of a\nspectrum of different fact types. When studying how robust these memories are,\nthere appears to be a sweet spot in the spectrum of fact novelty between\nconsistency with world knowledge and total randomness, where the injected\nmemory is the most enduring. Specifically we show that facts that conflict with\ncommon knowledge are remembered for tens of thousands of training steps, while\nprompts not conflicting with common knowledge (mundane), as well as scrambled\nprompts (randomly jumbled) are both forgotten much more rapidly. Further,\nknowledge-conflicting facts can \"prime'' how the language model hallucinates on\nlogically unrelated prompts, showing their propensity for non-target\ngeneralization, while both mundane and randomly jumbled facts prime\nsignificantly less. Finally, we show that impacts of knowledge-conflicting\nfacts in LMs, though they can be long lasting, can be largely erased by novel\napplication of multi-step sparse updates, even while the training ability of\nthe model is preserved. As such, this very simple procedure has direct\nimplications for mitigating the effects of data poisoning in training.", "paper_summary_zh": "當新的知識片段被引入訓練資料中，並且在大型語言模型 (LM) 持續訓練時，會發生什麼事？我們透過將事實注入來自新探測資料集「Outlandish」的 LM 來探討這個問題，該資料集旨在允許測試各種不同事實類型的光譜。在研究這些記憶的健全性時，在與世界知識一致性和完全隨機性之間的事實新穎性光譜中，似乎有一個甜蜜點，其中注入的記憶是最持久的。具體來說，我們展示了與常識相衝突的事實被記住了數萬個訓練步驟，而與常識不衝突的提示（平凡）以及打亂的提示（隨機混雜）都被遺忘得更快。此外，與知識相衝突的事實可以「啟動」語言模型如何對邏輯上無關的提示產生幻覺，顯示出它們對非目標概括的傾向，而平凡和隨機混雜的事實啟動的程度則顯著較低。最後，我們表明，儘管與知識相衝突的事實對 LM 的影響可能持續很長時間，但它們在很大程度上可以透過多步驟稀疏更新的新應用來消除，即使模型的訓練能力得以保留。因此，這個非常簡單的程序對減輕訓練中資料中毒的影響有直接的影響。", "author": "Chen Sun et.al.", "authors": "Chen Sun, Nolan Andrew Miller, Andrey Zhmoginov, Max Vladymyrov, Mark Sandler", "id": "2410.21750v1", "paper_url": "http://arxiv.org/abs/2410.21750v1", "repo": "null"}}