{"2405.14869": {"publish_time": "2024-05-23", "title": "PuzzleAvatar: Assembling 3D Avatars from Personal Albums", "paper_summary": "Generating personalized 3D avatars is crucial for AR/VR. However, recent\ntext-to-3D methods that generate avatars for celebrities or fictional\ncharacters, struggle with everyday people. Methods for faithful reconstruction\ntypically require full-body images in controlled settings. What if a user could\njust upload their personal \"OOTD\" (Outfit Of The Day) photo collection and get\na faithful avatar in return? The challenge is that such casual photo\ncollections contain diverse poses, challenging viewpoints, cropped views, and\nocclusion (albeit with a consistent outfit, accessories and hairstyle). We\naddress this novel \"Album2Human\" task by developing PuzzleAvatar, a novel model\nthat generates a faithful 3D avatar (in a canonical pose) from a personal OOTD\nalbum, while bypassing the challenging estimation of body and camera pose. To\nthis end, we fine-tune a foundational vision-language model (VLM) on such\nphotos, encoding the appearance, identity, garments, hairstyles, and\naccessories of a person into (separate) learned tokens and instilling these\ncues into the VLM. In effect, we exploit the learned tokens as \"puzzle pieces\"\nfrom which we assemble a faithful, personalized 3D avatar. Importantly, we can\ncustomize avatars by simply inter-changing tokens. As a benchmark for this new\ntask, we collect a new dataset, called PuzzleIOI, with 41 subjects in a total\nof nearly 1K OOTD configurations, in challenging partial photos with paired\nground-truth 3D bodies. Evaluation shows that PuzzleAvatar not only has high\nreconstruction accuracy, outperforming TeCH and MVDreamBooth, but also a unique\nscalability to album photos, and strong robustness. Our model and data will be\npublic.", "paper_summary_zh": "<paragraph>生成個性化 3D 頭像對於 AR/VR 至關重要。然而，最近的文字轉 3D 方法可為名人或虛構角色生成頭像，但在一般人身上卻有困難。忠實重建的方法通常需要在受控環境中拍攝全身影像。如果使用者只需上傳他們的個人「OOTD」（每日穿搭）照片集，就能換取一個忠實的頭像，那該有多好？挑戰在於此類休閒照片集包含姿勢多樣、視角有挑戰性、裁切的視角和遮擋（儘管服裝、配件和髮型一致）。我們透過開發 PuzzleAvatar 來處理這個新穎的「相簿轉人類」任務，這是一個新穎的模型，可從個人的 OOTD 相簿生成一個忠實的 3D 頭像（採用標準姿勢），同時繞過身體和相機姿勢的困難估計。為此，我們微調了此類照片上的基礎視覺語言模型 (VLM)，將一個人的外觀、身分、服裝、髮型和配件編碼成（分開的）學習代幣，並將這些線索灌輸到 VLM 中。實際上，我們利用學習到的代幣作為「拼圖碎片」，從中組裝一個忠實的個性化 3D 頭像。重要的是，我們可以透過簡單地交換代幣來自訂頭像。作為這個新任務的基準，我們收集了一個名為 PuzzleIOI 的新資料集，其中包含 41 個主體，總共近 1K 個 OOTD 組態，採用具有配對地面實況 3D 身體的具挑戰性部分照片。評估顯示，PuzzleAvatar 不僅具有高重建準確度，優於 TeCH 和 MVDreamBooth，而且還具有獨特的相簿照片擴充性，以及強大的穩健性。我們的模型和資料將公開。</paragraph>", "author": "Yuliang Xiu et.al.", "authors": "Yuliang Xiu, Yufei Ye, Zhen Liu, Dimitrios Tzionas, Michael J. Black", "id": "2405.14869v1", "paper_url": "http://arxiv.org/abs/2405.14869v1", "repo": "null"}}