{"2503.19900": {"publish_time": "2025-03-25", "title": "CAFe: Unifying Representation and Generation with Contrastive-Autoregressive Finetuning", "paper_summary": "The rapid advancement of large vision-language models (LVLMs) has driven\nsignificant progress in multimodal tasks, enabling models to interpret, reason,\nand generate outputs across both visual and textual domains. While excelling in\ngenerative tasks, existing LVLMs often face limitations in tasks requiring\nhigh-fidelity representation learning, such as generating image or text\nembeddings for retrieval. Recent work has proposed finetuning LVLMs for\nrepresentational learning, but the fine-tuned model often loses its generative\ncapabilities due to the representational learning training paradigm. To address\nthis trade-off, we introduce CAFe, a contrastive-autoregressive fine-tuning\nframework that enhances LVLMs for both representation and generative tasks. By\nintegrating a contrastive objective with autoregressive language modeling, our\napproach unifies these traditionally separate tasks, achieving state-of-the-art\nresults in both multimodal retrieval and multimodal generative benchmarks,\nincluding object hallucination (OH) mitigation. CAFe establishes a novel\nframework that synergizes embedding and generative functionalities in a single\nmodel, setting a foundation for future multimodal models that excel in both\nretrieval precision and coherent output generation.", "paper_summary_zh": "大型視覺語言模型 (LVLMs) 的快速發展推動了多模態任務的顯著進步，使模型能夠在視覺和文本領域進行解讀、推理和生成輸出。雖然現有的 LVLMs 在生成任務中表現出色，但在需要高保真表徵學習的任務（例如生成用於檢索的圖像或文本嵌入）中卻常常面臨限制。最近的研究提出對 LVLMs 進行微調以進行表徵學習，但微調後的模型通常會因為表徵學習的訓練範式而失去其生成能力。為了應對這種權衡，我們引入了 CAFe，這是一個對比式自回歸微調框架，可以增強 LVLMs 的表徵和生成任務能力。通過將對比目標與自回歸語言建模相結合，我們的方法將這些傳統上分離的任務統一了起來，在多模態檢索和多模態生成基準測試（包括物件幻覺 (OH) 緩解）中都達到了最先進的結果。CAFe 建立了一個新穎的框架，將嵌入和生成功能協同整合到單個模型中，為未來在檢索精度和連貫輸出生成方面都表現出色的多模態模型奠定了基礎。\n", "author": "Hao Yu et.al.", "authors": "Hao Yu, Zhuokai Zhao, Shen Yan, Lukasz Korycki, Jianyu Wang, Baosheng He, Jiayi Liu, Lizhu Zhang, Xiangjun Fan, Hanchao Yu", "id": "2503.19900v1", "paper_url": "http://arxiv.org/abs/2503.19900v1", "repo": "null"}}