{"2406.16672": {"publish_time": "2024-06-24", "title": "CAVE: Controllable Authorship Verification Explanations", "paper_summary": "Authorship Verification (AV) (do two documents have the same author?) is\nessential for many sensitive real-life applications. AV is often used in\nproprietary domains that require a private, offline model, making SOTA online\nmodels like ChatGPT undesirable. Other SOTA systems use methods, e.g. Siamese\nNetworks, that are uninterpretable, and hence cannot be trusted in high-stakes\napplications. In this work, we take the first step to address the above\nchallenges with our model CAVE (Controllable Authorship Verification\nExplanations): CAVE generates free-text AV explanations that are controlled to\nbe 1) structured (can be decomposed into sub-explanations with respect to\nrelevant linguistic features), and 2) easily verified for explanation-label\nconsistency (via intermediate labels in sub-explanations). In this work, we\ntrain a Llama-3-8B as CAVE; since there are no human-written corpora for AV\nexplanations, we sample silver-standard explanations from GPT-4-TURBO and\ndistill them into a pretrained Llama-3-8B. Results on three difficult AV\ndatasets IMdB2, Blog-Auth, and FanFiction show that CAVE generates high quality\nexplanations (as measured by automatic and human evaluation) as well as\ncompetitive task accuracies.", "paper_summary_zh": "作者驗證 (AV)（兩份文件是否由同一位作者撰寫？）對於許多敏感的實際應用至關重要。AV 通常用於需要私人離線模型的專有領域，這使得像 ChatGPT 這樣的 SOTA 線上模型不受歡迎。其他 SOTA 系統使用的方法（例如連體網路）無法解釋，因此無法在高風險應用中受到信任。在這項工作中，我們採取第一步，使用我們的模型 CAVE（可控作者驗證說明）來解決上述挑戰：CAVE 會產生自由文字的 AV 說明，這些說明受到控制，以達到 1）結構化（可以根據相關語言功能分解為子說明），以及 2）易於驗證說明標籤一致性（透過子說明中的中間標籤）。在這項工作中，我們訓練了一個 Llama-3-8B 作為 CAVE；由於沒有人工撰寫的 AV 說明語料庫，我們從 GPT-4-TURBO 中取樣白銀標準說明，並將它們提煉成預訓練的 Llama-3-8B。在三個困難的 AV 資料集 IMdB2、Blog-Auth 和 FanFiction 中的結果顯示，CAVE 會產生高品質的說明（根據自動和人工評估測量），以及具有競爭力的任務準確度。", "author": "Sahana Ramnath et.al.", "authors": "Sahana Ramnath, Kartik Pandey, Elizabeth Boschee, Xiang Ren", "id": "2406.16672v1", "paper_url": "http://arxiv.org/abs/2406.16672v1", "repo": "https://github.com/ink-usc/controllable-av-explanations"}}