{"2412.13791": {"publish_time": "2024-12-18", "title": "Physics Reasoner: Knowledge-Augmented Reasoning for Solving Physics Problems with Large Language Models", "paper_summary": "Physics problems constitute a significant aspect of reasoning, necessitating\ncomplicated reasoning ability and abundant physics knowledge. However, existing\nlarge language models (LLMs) frequently fail due to a lack of knowledge or\nincorrect knowledge application. To mitigate these issues, we propose Physics\nReasoner, a knowledge-augmented framework to solve physics problems with LLMs.\nSpecifically, the proposed framework constructs a comprehensive formula set to\nprovide explicit physics knowledge and utilizes checklists containing detailed\ninstructions to guide effective knowledge application. Namely, given a physics\nproblem, Physics Reasoner solves it through three stages: problem analysis,\nformula retrieval, and guided reasoning. During the process, checklists are\nemployed to enhance LLMs' self-improvement in the analysis and reasoning\nstages. Empirically, Physics Reasoner mitigates the issues of insufficient\nknowledge and incorrect application, achieving state-of-the-art performance on\nSciBench with an average accuracy improvement of 5.8%.", "paper_summary_zh": "物理學題目構成推理的重要面向，需要複雜的推理能力和豐富的物理知識。然而，現有的大型語言模型 (LLM) 經常因為缺乏知識或不正確地應用知識而失敗。為了減輕這些問題，我們提出物理推理器，一個知識增強框架，用 LLM 解決物理問題。具體來說，所提出的框架建構了一個全面的公式集，以提供明確的物理知識，並利用包含詳細說明的檢查清單來指導有效的知識應用。也就是說，給定一個物理問題，物理推理器透過三個階段來解決它：問題分析、公式檢索和引導推理。在過程中，使用檢查清單來增強 LLM 在分析和推理階段的自我改進。根據經驗，物理推理器減輕了知識不足和應用不正確的問題，在 SciBench 上實現了最先進的效能，平均準確度提高了 5.8%。", "author": "Xinyu Pang et.al.", "authors": "Xinyu Pang, Ruixin Hong, Zhanke Zhou, Fangrui Lv, Xinwei Yang, Zhilong Liang, Bo Han, Changshui Zhang", "id": "2412.13791v1", "paper_url": "http://arxiv.org/abs/2412.13791v1", "repo": "https://github.com/xinyu-pang/physics_reasoner"}}