{"2410.16069": {"publish_time": "2024-10-21", "title": "Rolling the DICE on Idiomaticity: How LLMs Fail to Grasp Context", "paper_summary": "Human processing of idioms relies on understanding the contextual sentences\nin which idioms occur, as well as language-intrinsic features such as frequency\nand speaker-intrinsic factors like familiarity. While LLMs have shown high\nperformance on idiomaticity detection tasks, this success may be attributed to\nreasoning shortcuts in existing datasets. To this end, we construct a novel,\ncontrolled contrastive dataset designed to test whether LLMs can effectively\nuse context to disambiguate idiomatic meaning. Additionally, we explore how\ncollocational frequency and sentence probability influence model performance.\nOur findings reveal that LLMs often fail to resolve idiomaticity when it is\nrequired to attend to the surrounding context, and that models perform better\non sentences that have higher likelihood. The collocational frequency of\nexpressions also impacts performance. We make our code and dataset publicly\navailable.", "paper_summary_zh": "人類對慣用語的處理依賴於理解慣用語出現的語境句子，以及語言內在特徵（例如頻率）和說話者內在因素（例如熟悉度）。雖然大語言模型在慣用語檢測任務上表現出高性能，但這種成功可能是歸因於現有資料集中的推理捷徑。為此，我們構建了一個新穎、受控的對比資料集，旨在測試大語言模型是否能有效使用語境來消除慣用語含義的歧義。此外，我們探討了搭配頻率和句子機率如何影響模型效能。我們的研究結果顯示，當需要關注周圍語境時，大語言模型常常無法解決慣用語，而且模型在機率較高的句子中表現得更好。表達式的搭配頻率也影響效能。我們公開我們的程式碼和資料集。", "author": "Maggie Mi et.al.", "authors": "Maggie Mi, Aline Villavicencio, Nafise Sadat Moosavi", "id": "2410.16069v1", "paper_url": "http://arxiv.org/abs/2410.16069v1", "repo": "null"}}