{"2501.05928": {"publish_time": "2025-01-10", "title": "Towards Backdoor Stealthiness in Model Parameter Space", "paper_summary": "Recent research on backdoor stealthiness focuses mainly on indistinguishable\ntriggers in input space and inseparable backdoor representations in feature\nspace, aiming to circumvent backdoor defenses that examine these respective\nspaces. However, existing backdoor attacks are typically designed to resist a\nspecific type of backdoor defense without considering the diverse range of\ndefense mechanisms. Based on this observation, we pose a natural question: Are\ncurrent backdoor attacks truly a real-world threat when facing diverse\npractical defenses?\n  To answer this question, we examine 12 common backdoor attacks that focus on\ninput-space or feature-space stealthiness and 17 diverse representative\ndefenses. Surprisingly, we reveal a critical blind spot: Backdoor attacks\ndesigned to be stealthy in input and feature spaces can be mitigated by\nexamining backdoored models in parameter space. To investigate the underlying\ncauses behind this common vulnerability, we study the characteristics of\nbackdoor attacks in the parameter space. Notably, we find that input- and\nfeature-space attacks introduce prominent backdoor-related neurons in parameter\nspace, which are not thoroughly considered by current backdoor attacks. Taking\ncomprehensive stealthiness into account, we propose a novel supply-chain attack\ncalled Grond. Grond limits the parameter changes by a simple yet effective\nmodule, Adversarial Backdoor Injection (ABI), which adaptively increases the\nparameter-space stealthiness during the backdoor injection. Extensive\nexperiments demonstrate that Grond outperforms all 12 backdoor attacks against\nstate-of-the-art (including adaptive) defenses on CIFAR-10, GTSRB, and a subset\nof ImageNet. In addition, we show that ABI consistently improves the\neffectiveness of common backdoor attacks.", "paper_summary_zh": "<paragraph>最近針對後門隱匿性的研究主要集中在輸入空間中無法區分的觸發器和特徵空間中無法分離的後門表示，目的是規避檢查這些各自空間的後門防禦措施。然而，現有的後門攻擊通常設計為抵抗特定類型的後門防禦，而不會考慮各種防禦機制。基於此觀察，我們提出了一個自然的問題：在面對各種實際防禦時，當前的後門攻擊是否真的是一個現實世界的威脅？\n為了回答這個問題，我們研究了 12 種常見的後門攻擊，這些攻擊專注於輸入空間或特徵空間隱匿性，以及 17 種不同的代表性防禦。令人驚訝的是，我們發現了一個關鍵的盲點：設計為在輸入和特徵空間中隱匿的後門攻擊可以通過在參數空間中檢查後門模型來減輕。為了調查這種常見漏洞背後的基本原因，我們研究了後門攻擊在參數空間中的特徵。值得注意的是，我們發現輸入和特徵空間攻擊在參數空間中引入了突出的後門相關神經元，而當前的後門攻擊並沒有徹底考慮這些神經元。考慮到全面的隱匿性，我們提出了一種名為 Grond 的新型供應鏈攻擊。Grond 通過一個簡單但有效的模塊（對抗後門注入 (ABI)）限制參數更改，該模塊會在後門注入期間自適應地增加參數空間隱匿性。大量實驗表明，在 CIFAR-10、GTSRB 和 ImageNet 的子集上，Grond 優於所有 12 種針對最先進（包括自適應）防禦的後門攻擊。此外，我們表明 ABI 始終如一地提高了常見後門攻擊的有效性。</paragraph>", "author": "Xiaoyun Xu et.al.", "authors": "Xiaoyun Xu, Zhuoran Liu, Stefanos Koffas, Stjepan Picek", "id": "2501.05928v1", "paper_url": "http://arxiv.org/abs/2501.05928v1", "repo": "https://github.com/xiaoyunxxy/parameter_backdoor"}}