{"2501.08617": {"publish_time": "2025-01-15", "title": "RLHS: Mitigating Misalignment in RLHF with Hindsight Simulation", "paper_summary": "Generative AI systems like foundation models (FMs) must align well with human\nvalues to ensure their behavior is helpful and trustworthy. While Reinforcement\nLearning from Human Feedback (RLHF) has shown promise for optimizing model\nperformance using human judgments, existing RLHF pipelines predominantly rely\non immediate feedback, which can fail to accurately reflect the downstream\nimpact of an interaction on users' utility. We demonstrate that feedback based\non evaluators' foresight estimates of downstream consequences systematically\ninduces Goodhart's Law dynamics, incentivizing misaligned behaviors like\nsycophancy and deception and ultimately degrading user outcomes. To alleviate\nthis, we propose decoupling evaluation from prediction by refocusing RLHF on\nhindsight feedback. Our theoretical analysis reveals that conditioning\nevaluator feedback on downstream observations mitigates misalignment and\nimproves expected human utility, even when these observations are simulated by\nthe AI system itself. To leverage this insight in a practical alignment\nalgorithm, we introduce Reinforcement Learning from Hindsight Simulation\n(RLHS), which first simulates plausible consequences and then elicits feedback\nto assess what behaviors were genuinely beneficial in hindsight. We apply RLHS\nto two widely-employed online and offline preference optimization methods --\nProximal Policy Optimization (PPO) and Direct Preference Optimization (DPO) --\nand show empirically that misalignment is significantly reduced with both\nmethods. Through an online human user study, we show that RLHS consistently\noutperforms RLHF in helping users achieve their goals and earns higher\nsatisfaction ratings, despite being trained solely with simulated hindsight\nfeedback. These results underscore the importance of focusing on long-term\nconsequences, even simulated ones, to mitigate misalignment in RLHF.", "paper_summary_zh": "生成式人工智能系統，如基礎模型 (FM)，必須與人類價值觀保持一致，以確保其行為是有幫助且值得信賴的。雖然透過人類回饋進行強化學習 (RLHF) 已顯示出利用人類判斷來最佳化模型效能的可能性，但現有的 RLHF 管線主要依賴即時回饋，這可能無法準確反映互動對使用者效用的下游影響。我們證明，基於評估者對下游後果的前瞻性估計的回饋系統性地誘發古德哈特定律動態，鼓勵拍馬屁和欺騙等不一致的行為，並最終降低使用者成果。為了解決這個問題，我們建議透過重新關注 RLHF 在事後回饋上來解除評估與預測的關聯。我們的理論分析表明，在評估者回饋中加入下游觀察結果可以減輕不一致性，並提高預期的使用者效用，即使這些觀察結果是由 AI 系統本身模擬的。為了在實際對齊演算法中運用這個見解，我們引入了事後模擬強化學習 (RLHS)，它會先模擬合理的後果，然後引發回饋，以評估哪些行為在事後真的有益。我們將 RLHS 應用於兩種廣泛使用的線上和離線偏好最佳化方法——近端策略最佳化 (PPO) 和直接偏好最佳化 (DPO)——並透過實證顯示，這兩種方法的不一致性都顯著降低。透過一項線上人類使用者研究，我們證明了 RLHS 在幫助使用者達成目標方面始終優於 RLHF，並獲得更高的滿意度評分，儘管僅使用模擬事後回饋進行訓練。這些結果強調了關注長期後果（即使是模擬的後果）以減輕 RLHF 中不一致性的重要性。", "author": "Kaiqu Liang et.al.", "authors": "Kaiqu Liang, Haimin Hu, Ryan Liu, Thomas L. Griffiths, Jaime Fernández Fisac", "id": "2501.08617v1", "paper_url": "http://arxiv.org/abs/2501.08617v1", "repo": "null"}}