{"2409.18602": {"publish_time": "2024-09-27", "title": "Do LLMs suffer from Multi-Party Hangover? A Diagnostic Approach to Addressee Recognition and Response Selection in Conversations", "paper_summary": "Assessing the performance of systems to classify Multi-Party Conversations\n(MPC) is challenging due to the interconnection between linguistic and\nstructural characteristics of conversations. Conventional evaluation methods\noften overlook variances in model behavior across different levels of\nstructural complexity on interaction graphs. In this work, we propose a\nmethodological pipeline to investigate model performance across specific\nstructural attributes of conversations. As a proof of concept we focus on\nResponse Selection and Addressee Recognition tasks, to diagnose model\nweaknesses. To this end, we extract representative diagnostic subdatasets with\na fixed number of users and a good structural variety from a large and open\ncorpus of online MPCs. We further frame our work in terms of data minimization,\navoiding the use of original usernames to preserve privacy, and propose\nalternatives to using original text messages. Results show that response\nselection relies more on the textual content of conversations, while addressee\nrecognition requires capturing their structural dimension. Using an LLM in a\nzero-shot setting, we further highlight how sensitivity to prompt variations is\ntask-dependent.", "paper_summary_zh": "評估多方對話 (MPC) 分類系統的效能具有挑戰性，因為對話的語言和結構特徵之間存在相互關聯。傳統的評估方法通常會忽略互動圖表中不同結構複雜度層級中模型行為的差異。在這項工作中，我們提出了一個方法論管道，用於調查模型在對話特定結構屬性上的效能。作為概念驗證，我們專注於回應選擇和受話者辨識任務，以診斷模型的弱點。為此，我們從大型開放的線上 MPC 語料庫中，萃取具有固定使用者數量和良好結構變化的具代表性的診斷子資料集。我們進一步根據資料最小化的概念架構我們的工作，避免使用原始使用者名稱以保護隱私，並提出使用原始簡訊的替代方案。結果顯示，回應選擇更依賴對話的文字內容，而受話者辨識則需要擷取其結構維度。在零次學習設定中使用 LLM，我們進一步強調提示變化的敏感度是依任務而定的。", "author": "Nicolò Penzo et.al.", "authors": "Nicolò Penzo, Maryam Sajedinia, Bruno Lepri, Sara Tonelli, Marco Guerini", "id": "2409.18602v1", "paper_url": "http://arxiv.org/abs/2409.18602v1", "repo": "null"}}