{"2410.10584": {"publish_time": "2024-10-14", "title": "STACKFEED: Structured Textual Actor-Critic Knowledge Base Editing with FeedBack", "paper_summary": "Large Language Models (LLMs) often generate incorrect or outdated\ninformation, especially in low-resource settings or when dealing with private\ndata. To address this, Retrieval-Augmented Generation (RAG) uses external\nknowledge bases (KBs), but these can also suffer from inaccuracies. We\nintroduce STACKFEED, a novel Structured Textual Actor-Critic Knowledge base\nediting with FEEDback approach that iteratively refines the KB based on expert\nfeedback using a multi-actor, centralized critic reinforcement learning\nframework. Each document is assigned to an actor, modeled as a ReACT agent,\nwhich performs structured edits based on document-specific targeted\ninstructions from a centralized critic. Experimental results show that\nSTACKFEED significantly improves KB quality and RAG system performance,\nenhancing accuracy by up to 8% over baselines.", "paper_summary_zh": "大型語言模型 (LLM) 經常會產生不正確或過時的資訊，尤其是在資源不足的環境中或處理私人資料時。為了解決這個問題，檢索增強產生 (RAG) 使用外部知識庫 (KB)，但這些知識庫也可能不準確。我們引進 STACKFEED，這是一種新穎的結構化文本 Actor-Critic 知識庫編輯方法，使用回饋，根據專家的回饋，使用多 Actor、集中式評論強化學習架構，反覆改善 KB。每份文件會分配給一個 Actor，建模為 ReACT 代理，它會根據集中式評論的特定目標文件指令，執行結構化的編輯。實驗結果顯示，STACKFEED 大幅改善 KB 品質和 RAG 系統效能，準確度比基準高出 8%。", "author": "Naman Gupta et.al.", "authors": "Naman Gupta, Shashank Kirtania, Priyanshu Gupta, Krishna Kariya, Sumit Gulwani, Arun Iyer, Suresh Parthasarathy, Arjun Radhakrishna, Sriram K. Rajamani, Gustavo Soares", "id": "2410.10584v1", "paper_url": "http://arxiv.org/abs/2410.10584v1", "repo": "null"}}