{"2410.23137": {"publish_time": "2024-10-30", "title": "Fair Division with Market Values", "paper_summary": "We introduce a model of fair division with market values, where indivisible\ngoods must be partitioned among agents with (additive) subjective valuations,\nand each good additionally has a market value. The market valuation can be\nviewed as a separate additive valuation that holds identically across all the\nagents. We seek allocations that are simultaneously fair with respect to the\nsubjective valuations and with respect to the market valuation.\n  We show that an allocation that satisfies stochastically-dominant\nenvy-freeness up to one good (SD-EF1) with respect to both the subjective\nvaluations and the market valuation does not always exist, but the weaker\nguarantee of EF1 with respect to the subjective valuations along with SD-EF1\nwith respect to the market valuation can be guaranteed. We also study a number\nof other guarantees such as Pareto optimality, EFX, and MMS. In addition, we\nexplore non-additive valuations and extend our model to cake-cutting. Along the\nway, we identify several tantalizing open questions.", "paper_summary_zh": "我們引入一個具有市場價值的公平分配模型，其中不可分割的商品必須分配給具有（加法）主觀估值的代理人，且每件商品額外具有市場價值。市場估值可以視為一個獨立的加法估值，在所有代理人之間完全相同。我們尋求在主觀估值和市場估值方面同時公平的分配。\n我們證明了一個分配，滿足關於一個商品的隨機支配嫉妒自由（SD-EF1），關於主觀估值和市場估值，並不總是存在，但是關於主觀估值的較弱保證 EF1 以及關於市場估值的 SD-EF1 可以得到保證。我們還研究了許多其他保證，例如帕累托最優性、EFX 和 MMS。此外，我們探索非加法估值，並將我們的模型擴展到蛋糕切割。在此過程中，我們發現了幾個誘人的開放問題。", "author": "Siddharth Barman et.al.", "authors": "Siddharth Barman, Soroush Ebadian, Mohamad Latifian, Nisarg Shah", "id": "2410.23137v1", "paper_url": "http://arxiv.org/abs/2410.23137v1", "repo": "null"}}