{"2410.23672": {"publish_time": "2024-10-31", "title": "Provable Benefit of Cutout and CutMix for Feature Learning", "paper_summary": "Patch-level data augmentation techniques such as Cutout and CutMix have\ndemonstrated significant efficacy in enhancing the performance of vision tasks.\nHowever, a comprehensive theoretical understanding of these methods remains\nelusive. In this paper, we study two-layer neural networks trained using three\ndistinct methods: vanilla training without augmentation, Cutout training, and\nCutMix training. Our analysis focuses on a feature-noise data model, which\nconsists of several label-dependent features of varying rarity and\nlabel-independent noises of differing strengths. Our theorems demonstrate that\nCutout training can learn low-frequency features that vanilla training cannot,\nwhile CutMix training can learn even rarer features that Cutout cannot capture.\nFrom this, we establish that CutMix yields the highest test accuracy among the\nthree. Our novel analysis reveals that CutMix training makes the network learn\nall features and noise vectors \"evenly\" regardless of the rarity and strength,\nwhich provides an interesting insight into understanding patch-level\naugmentation.", "paper_summary_zh": "修补层级资料扩增技术，例如 Cutout 和 CutMix，已证实能显著提升视觉任务的效能。\n然而，对于这些方法的全面理论理解仍然难以捉摸。在本文中，我们研究使用三种不同方法训练的两层神经网络：没有扩增的普通训练、Cutout 训练和 CutMix 训练。我们的分析重点在于特征杂讯资料模型，它包含了若干个稀有度不同的标签相关特征和强度不同的标签无关杂讯。我们的定理证明，Cutout 训练可以学习普通训练无法学习的低频特征，而 CutMix 训练甚至可以学习 Cutout 无法捕捉到的更稀有的特征。由此，我们确定 CutMix 在这三种方法中产生了最高的测试准确率。我们新颖的分析揭示，CutMix 训练使网络学习所有特征和杂讯向量“均匀”，而不管稀有度和强度如何，这为理解修补层级扩增提供了有趣的见解。", "author": "Junsoo Oh et.al.", "authors": "Junsoo Oh, Chulhee Yun", "id": "2410.23672v1", "paper_url": "http://arxiv.org/abs/2410.23672v1", "repo": "null"}}