{"2406.14833": {"publish_time": "2024-06-21", "title": "Efficient Continual Pre-training by Mitigating the Stability Gap", "paper_summary": "Continual pre-training has increasingly become the predominant approach for\nadapting Large Language Models (LLMs) to new domains. This process involves\nupdating the pre-trained LLM with a corpus from a new domain, resulting in a\nshift in the training distribution. To study the behavior of LLMs during this\nshift, we measured the model's performance throughout the continual\npre-training process. we observed a temporary performance drop at the\nbeginning, followed by a recovery phase, a phenomenon known as the \"stability\ngap,\" previously noted in vision models classifying new classes. To address\nthis issue and enhance LLM performance within a fixed compute budget, we\npropose three effective strategies: (1) Continually pre-training the LLM on a\nsubset with a proper size for multiple epochs, resulting in faster performance\nrecovery than pre-training the LLM on a large corpus in a single epoch; (2)\nPre-training the LLM only on high-quality sub-corpus, which rapidly boosts\ndomain performance; and (3) Using a data mixture similar to the pre-training\ndata to reduce distribution gap. We conduct various experiments on Llama-family\nmodels to validate the effectiveness of our strategies in both medical\ncontinual pre-training and instruction tuning. For example, our strategies\nimprove the average medical task performance of the OpenLlama-3B model from\n36.2% to 40.7% with only 40% of the original training budget and enhance the\naverage general task performance without causing forgetting. Furthermore, we\napply our strategies to the Llama-3-8B model. The resulting model,\nLlama-3-Physician, achieves the best medical performance among current\nopen-source models, and performs comparably to or even better than GPT-4 on\nseveral medical benchmarks. We release our models at\n\\url{https://huggingface.co/YiDuo1999/Llama-3-Physician-8B-Instruct}.", "paper_summary_zh": "持續預訓練已逐漸成為將大型語言模型 (LLM) 適應到新領域的主要方法。此程序涉及使用新領域的語料庫更新預先訓練的 LLM，導致訓練分佈發生轉變。為了研究 LLM 在此轉變期間的行為，我們在整個持續預訓練過程中測量模型的效能。我們觀察到一開始效能暫時下降，接著是復原階段，這種現象稱為「穩定性差距」，先前在分類新類別的視覺模型中發現。為了解決此問題並在固定的運算預算內提升 LLM 效能，我們提出三種有效的策略：(1) 持續在適當大小的子集上對 LLM 進行多個時期的預訓練，比在大型語料庫上對 LLM 進行單一時期的預訓練能更快復原效能；(2) 僅在高品質的子語料庫上對 LLM 進行預訓練，這能快速提升領域效能；(3) 使用類似預訓練資料的資料混合，以縮小分佈差距。我們在 Llama 家族模型上進行各種實驗，以驗證我們的策略在醫學持續預訓練和指令調整中的有效性。例如，我們的策略將 OpenLlama-3B 模型的平均醫學任務效能從 36.2% 提升至 40.7%，僅使用原先訓練預算的 40%，並提升平均一般任務效能，且不會造成遺忘。此外，我們將我們的策略應用於 Llama-3-8B 模型。產生的模型 Llama-3-Physician 在目前開放原始碼模型中獲得最佳醫學效能，且在幾個醫學基準上與 GPT-4 相當甚至更好。我們在 \\url{https://huggingface.co/YiDuo1999/Llama-3-Physician-8B-Instruct} 發布我們的模型。", "author": "Yiduo Guo et.al.", "authors": "Yiduo Guo, Jie Fu, Huishuai Zhang, Dongyan Zhao, Yikang Shen", "id": "2406.14833v1", "paper_url": "http://arxiv.org/abs/2406.14833v1", "repo": "null"}}