{"2501.01913": {"publish_time": "2025-01-03", "title": "Mingling with the Good to Backdoor Federated Learning", "paper_summary": "Federated learning (FL) is a decentralized machine learning technique that\nallows multiple entities to jointly train a model while preserving dataset\nprivacy. However, its distributed nature has raised various security concerns,\nwhich have been addressed by increasingly sophisticated defenses. These\nprotections utilize a range of data sources and metrics to, for example, filter\nout malicious model updates, ensuring that the impact of attacks is minimized\nor eliminated.\n  This paper explores the feasibility of designing a generic attack method\ncapable of installing backdoors in FL while evading a diverse array of\ndefenses. Specifically, we focus on an attacker strategy called MIGO, which\naims to produce model updates that subtly blend with legitimate ones. The\nresulting effect is a gradual integration of a backdoor into the global model,\noften ensuring its persistence long after the attack concludes, while\ngenerating enough ambiguity to hinder the effectiveness of defenses.\n  MIGO was employed to implant three types of backdoors across five datasets\nand different model architectures. The results demonstrate the significant\nthreat posed by these backdoors, as MIGO consistently achieved exceptionally\nhigh backdoor accuracy (exceeding 90%) while maintaining the utility of the\nmain task. Moreover, MIGO exhibited strong evasion capabilities against ten\ndefenses, including several state-of-the-art methods. When compared to four\nother attack strategies, MIGO consistently outperformed them across most\nconfigurations. Notably, even in extreme scenarios where the attacker controls\njust 0.1% of the clients, the results indicate that successful backdoor\ninsertion is possible if the attacker can persist for a sufficient number of\nrounds.", "paper_summary_zh": "<paragraph>聯邦學習 (FL) 是一種分散式機器學習技術，允許多個實體在保護資料集隱私的同時，共同訓練模型。然而，其分散式特性引發了各種安全問題，而越來越精密的防禦措施已解決了這些問題。這些防護利用各種資料來源和指標，例如，過濾惡意模型更新，以確保攻擊的影響最小化或消除。\n本文探討了設計一種通用攻擊方法的可行性，該方法能夠在迴避各種防禦的同時在 FL 中安裝後門。具體來說，我們專注於一種稱為 MIGO 的攻擊策略，其目的是產生與合法更新巧妙融合的模型更新。由此產生的效果是逐漸將後門整合到全局模型中，通常確保其在攻擊結束後長時間持續存在，同時產生足夠的模糊性來阻礙防禦的有效性。\nMIGO 被用於在五個資料集和不同的模型架構中植入三種類型的後門。結果證明了這些後門構成的重大威脅，因為 MIGO 持續實現極高的後門準確度（超過 90%），同時保持主任務的效用。此外，MIGO 對十種防禦措施表現出強大的規避能力，包括幾種最先進的方法。與其他四種攻擊策略相比，MIGO 在大多數配置中持續優於它們。值得注意的是，即使在極端情況下，攻擊者只控制 0.1% 的用戶端，結果表明，如果攻擊者可以持續進行足夠數量的回合，則可以成功插入後門。</paragraph>", "author": "Nuno Neves et.al.", "authors": "Nuno Neves", "id": "2501.01913v1", "paper_url": "http://arxiv.org/abs/2501.01913v1", "repo": "null"}}