{"2406.19552": {"publish_time": "2024-06-27", "title": "Rethinking harmless refusals when fine-tuning foundation models", "paper_summary": "In this paper, we investigate the degree to which fine-tuning in Large\nLanguage Models (LLMs) effectively mitigates versus merely conceals undesirable\nbehavior. Through the lens of semi-realistic role-playing exercises designed to\nelicit such behaviors, we explore the response dynamics of LLMs post\nfine-tuning interventions. Our methodology involves prompting models for\nChain-of-Thought (CoT) reasoning and analyzing the coherence between the\nreasoning traces and the resultant outputs. Notably, we identify a pervasive\nphenomenon we term \\emph{reason-based deception}, where models either stop\nproducing reasoning traces or produce seemingly ethical reasoning traces that\nbelie the unethical nature of their final outputs. We further examine the\nefficacy of response strategies (polite refusal versus explicit rebuttal) in\ncurbing the occurrence of undesired behavior in subsequent outputs of\nmulti-turn interactions. Our findings reveal that explicit rebuttals\nsignificantly outperform polite refusals in preventing the continuation of\nundesired outputs and nearly eliminate reason-based deception, challenging\ncurrent practices in model fine-tuning. Accordingly, the two key contributions\nof this paper are (1) defining and studying reason-based deception, a new type\nof hidden behavior, and (2) demonstrating that rebuttals provide a more robust\nresponse model to harmful requests than refusals, thereby highlighting the need\nto reconsider the response strategies in fine-tuning approaches.", "paper_summary_zh": "<paragraph>在本文中，我們探討大型語言模型 (LLM) 中微調的程度，有效地減輕或僅僅掩蓋不良行為。通過專門引發此類行為的半現實角色扮演練習，我們探討了微調干預後 LLM 的響應動態。我們的研究方法涉及提示模型進行思想鏈 (CoT) 推理，並分析推理軌跡和結果輸出之間的一致性。值得注意的是，我們發現了一個普遍存在的現象，我們稱之為「基於推理的欺騙」，其中模型要么停止產生推理軌跡，要么產生看似合乎道德的推理軌跡，而這些推理軌跡卻掩蓋了其最終輸出的不道德性質。我們進一步檢驗了響應策略（禮貌拒絕與明確反駁）在遏制多輪互動後續輸出中出現不良行為方面的有效性。我們的研究結果表明，明確的反駁在防止不良輸出持續方面明顯優於禮貌的拒絕，並且幾乎消除了基於推理的欺騙，對模型微調中的現行做法提出了挑戰。因此，本文的兩個關鍵貢獻是：(1) 定義和研究基於推理的欺騙，一種新型的隱藏行為，以及 (2) 證明反駁為有害請求提供了一個比拒絕更強大的響應模型，從而強調需要重新考慮微調方法中的響應策略。</paragraph>", "author": "Florin Pop et.al.", "authors": "Florin Pop, Judd Rosenblatt, Diogo Schwerz de Lucena, Michael Vaiana", "id": "2406.19552v1", "paper_url": "http://arxiv.org/abs/2406.19552v1", "repo": "null"}}