{"2501.19335": {"publish_time": "2025-01-31", "title": "What is causal about causal models and representations?", "paper_summary": "Causal Bayesian networks are 'causal' models since they make predictions\nabout interventional distributions. To connect such causal model predictions to\nreal-world outcomes, we must determine which actions in the world correspond to\nwhich interventions in the model. For example, to interpret an action as an\nintervention on a treatment variable, the action will presumably have to a)\nchange the distribution of treatment in a way that corresponds to the\nintervention, and b) not change other aspects, such as how the outcome depends\non the treatment; while the marginal distributions of some variables may change\nas an effect. We introduce a formal framework to make such requirements for\ndifferent interpretations of actions as interventions precise. We prove that\nthe seemingly natural interpretation of actions as interventions is circular:\nUnder this interpretation, every causal Bayesian network that correctly models\nthe observational distribution is trivially also interventionally valid, and no\naction yields empirical data that could possibly falsify such a model. We prove\nan impossibility result: No interpretation exists that is non-circular and\nsimultaneously satisfies a set of natural desiderata. Instead, we examine\nnon-circular interpretations that may violate some desiderata and show how this\nmay in turn enable the falsification of causal models. By rigorously examining\nhow a causal Bayesian network could be a 'causal' model of the world instead of\nmerely a mathematical object, our formal framework contributes to the\nconceptual foundations of causal representation learning, causal discovery, and\ncausal abstraction, while also highlighting some limitations of existing\napproaches.", "paper_summary_zh": "因果贝叶斯网络是「因果」模型，因为它们对干预分布进行预测。为了将此类因果模型预测与真实世界结果联系起来，我们必须确定世界中的哪些动作对应于模型中的哪些干预。例如，要将动作解释为对治疗变量的干预，则该动作可能必须 a) 以对应于干预的方式改变治疗分布，并且 b) 不改变其他方面，例如结果如何取决于治疗；而一些变量的边际分布可能会因效果而改变。我们引入一个正式框架，以使对动作的不同解释作为干预措施的要求变得精确。我们证明了看似自然的动作解释为干预是循环的：根据这种解释，正确建模观测分布的每个因果贝叶斯网络在干预上也是微不足道的，并且没有任何动作产生可以证伪此类模型的经验数据。我们证明了一个不可能的结果：不存在非循环且同时满足一组自然条件的解释。相反，我们检查可能违反某些条件的非循环解释，并展示这如何反过来实现因果模型的证伪。通过严格检查因果贝叶斯网络如何成为世界的「因果」模型，而不是仅仅是一个数学对象，我们的正式框架有助于因果表示学习、因果发现和因果抽象的概念基础，同时还强调了现有方法的一些局限性。", "author": "Frederik Hytting Jørgensen et.al.", "authors": "Frederik Hytting Jørgensen, Luigi Gresele, Sebastian Weichwald", "id": "2501.19335v1", "paper_url": "http://arxiv.org/abs/2501.19335v1", "repo": "null"}}