{"2501.19335": {"publish_time": "2025-01-31", "title": "What is causal about causal models and representations?", "paper_summary": "Causal Bayesian networks are 'causal' models since they make predictions\nabout interventional distributions. To connect such causal model predictions to\nreal-world outcomes, we must determine which actions in the world correspond to\nwhich interventions in the model. For example, to interpret an action as an\nintervention on a treatment variable, the action will presumably have to a)\nchange the distribution of treatment in a way that corresponds to the\nintervention, and b) not change other aspects, such as how the outcome depends\non the treatment; while the marginal distributions of some variables may change\nas an effect. We introduce a formal framework to make such requirements for\ndifferent interpretations of actions as interventions precise. We prove that\nthe seemingly natural interpretation of actions as interventions is circular:\nUnder this interpretation, every causal Bayesian network that correctly models\nthe observational distribution is trivially also interventionally valid, and no\naction yields empirical data that could possibly falsify such a model. We prove\nan impossibility result: No interpretation exists that is non-circular and\nsimultaneously satisfies a set of natural desiderata. Instead, we examine\nnon-circular interpretations that may violate some desiderata and show how this\nmay in turn enable the falsification of causal models. By rigorously examining\nhow a causal Bayesian network could be a 'causal' model of the world instead of\nmerely a mathematical object, our formal framework contributes to the\nconceptual foundations of causal representation learning, causal discovery, and\ncausal abstraction, while also highlighting some limitations of existing\napproaches.", "paper_summary_zh": "因果貝氏網路是「因果」模型，因為它們會對介入分佈做出預測。為了將此類因果模型預測與真實世界的結果連結，我們必須確定世界中的哪些動作對應於模型中的哪些介入。例如，要將動作解讀為對治療變數的介入，則該動作可能必須 a) 以對應於介入的方式來改變治療分佈，以及 b) 不改變其他面向，例如結果如何取決於治療；而某些變數的邊際分佈可能會因為效應而改變。我們引入一個正式架構來對動作作為介入的不同解讀做出此類要求。我們證明，將動作解讀為介入的看似自然解讀是循環的：在此解讀下，正確建模觀察分佈的每個因果貝氏網路在介入上也微不足道地有效，而且沒有動作會產生經驗資料，可能證偽此類模型。我們證明了一個不可能的結果：沒有解讀是非循環的，同時滿足一組自然的理想。相反地，我們檢視可能違反某些理想的非循環解讀，並展示這反過來如何能夠證偽因果模型。透過嚴謹地檢視因果貝氏網路如何成為世界的「因果」模型，而不是僅僅是一個數學物件，我們的正式架構有助於因果表徵學習、因果發現和因果抽象的概念基礎，同時也突顯了現有方法的一些限制。", "author": "Frederik Hytting Jørgensen et.al.", "authors": "Frederik Hytting Jørgensen, Luigi Gresele, Sebastian Weichwald", "id": "2501.19335v2", "paper_url": "http://arxiv.org/abs/2501.19335v2", "repo": "null"}}