{"2405.10476": {"publish_time": "2024-05-17", "title": "Analysis, Modeling and Design of Personalized Digital Learning Environment", "paper_summary": "This research analyzes, models and develops a novel Digital Learning\nEnvironment (DLE) fortified by the innovative Private Learning Intelligence\n(PLI) framework. The proposed PLI framework leverages federated machine\nlearning (FL) techniques to autonomously construct and continuously refine\npersonalized learning models for individual learners, ensuring robust privacy\nprotection. Our approach is pivotal in advancing DLE capabilities, empowering\nlearners to actively participate in personalized real-time learning\nexperiences. The integration of PLI within a DLE also streamlines instructional\ndesign and development demands for personalized teaching/learning. We seek ways\nto establish a foundation for the seamless integration of FL into learning\nsystems, offering a transformative approach to personalized learning in digital\nenvironments. Our implementation details and code are made public.", "paper_summary_zh": "本研究分析、建模並開發了一個創新的私人學習智慧 (PLI) 框架所強化的數位學習環境 (DLE)。所提出的 PLI 框架利用聯邦機器學習 (FL) 技術，自主建構並持續優化個人化學習模型，以確保強大的隱私保護。我們的做法對於推進 DLE 能力至關重要，讓學習者能夠積極參與個人化的即時學習體驗。在 DLE 中整合 PLI 也簡化了個人化教學/學習的教學設計和開發需求。我們尋求方法，為將 FL 無縫整合到學習系統中建立基礎，提供數位環境中個人化學習的轉型方法。我們的實作詳細資訊和程式碼已公開。", "author": "Sanjaya Khanal et.al.", "authors": "Sanjaya Khanal, Shiva Raj Pokhrel", "id": "2405.10476v1", "paper_url": "http://arxiv.org/abs/2405.10476v1", "repo": "https://github.com/pli-research-d/secure-ml-with-bert"}}