{"2501.09949": {"publish_time": "2025-01-17", "title": "MultiPruner: Balanced Structure Removal in Foundation Models", "paper_summary": "Recently, state-of-the-art approaches for pruning large pre-trained models\n(LPMs) have demonstrated that the training-free removal of non-critical\nresidual blocks in Transformers is viable for reducing model size, achieving\nresults that outperform previous training-free pruning approaches. Motivated by\nthese findings, we extend BlockPruner (Zhong et al., 2024) and propose\nMultiPruner, a pruning approach that surpasses recent training-free pruning\nmethods by adopting a multidimensional, iterative, fine-grained pruning\nstrategy. In MultiPruner, multidimensional pruning reinstates the structural\nbalance in block-pruned models by sequentially compressing along three\ndimensions: i) residual blocks, ii) channels of multilayer perceptrons (MLP),\nand iii) attention heads. This solution enhances zero-shot accuracy on\ndownstream tasks compared to other techniques while improving model compression\nratios, producing compressed models with fewer computing and memory\nrequirements. Extensive experiments demonstrate the advantages of the proposed\nmethod across various large pre-trained models. The code and pruning\nconfigurations are available at\nhttps://github.com/IntelLabs/Hardware-Aware-Automated-Machine-Learning.", "paper_summary_zh": "<paragraph>近來，修剪大型預訓練模型 (LPM) 的最新方法已證明，在 Transformer 中移除非必要的殘差區塊無需訓練，就能有效縮小模型大小，並達成優於先前無訓練修剪方法的結果。受這些發現啟發，我們擴充 BlockPruner (Zhong 等人，2024)，並提出 MultiPruner，這是一種修剪方法，採用多維、反覆、細緻的修剪策略，超越了最近的無訓練修剪方法。在 MultiPruner 中，多維修剪透過沿著三個維度順序壓縮來重建區塊修剪模型的結構平衡：i) 殘差區塊、ii) 多層感知器 (MLP) 的通道，以及 iii) 注意力層。與其他技術相比，此解決方案增強了下游任務的零次學習準確度，同時改善模型壓縮率，產生運算和記憶體需求較低的壓縮模型。廣泛的實驗證明了所提出方法在各種大型預訓練模型中的優點。程式碼和修剪組態可在 https://github.com/IntelLabs/Hardware-Aware-Automated-Machine-Learning 取得。</paragraph>", "author": "J. Pablo Muñoz et.al.", "authors": "J. Pablo Muñoz, Jinjie Yuan, Nilesh Jain", "id": "2501.09949v1", "paper_url": "http://arxiv.org/abs/2501.09949v1", "repo": "https://github.com/intellabs/hardware-aware-automated-machine-learning"}}