{"2408.12409": {"publish_time": "2024-08-22", "title": "Multi-Source Knowledge-Based Hybrid Neural Framework for Time Series Representation Learning", "paper_summary": "Accurately predicting the behavior of complex dynamical systems,\ncharacterized by high-dimensional multivariate time series(MTS) in\ninterconnected sensor networks, is crucial for informed decision-making in\nvarious applications to minimize risk. While graph forecasting networks(GFNs)\nare ideal for forecasting MTS data that exhibit spatio-temporal dependencies,\nprior works rely solely on the domain-specific knowledge of time-series\nvariables inter-relationships to model the nonlinear dynamics, neglecting\ninherent relational structural dependencies among the variables within the MTS\ndata. In contrast, contemporary works infer relational structures from MTS data\nbut neglect domain-specific knowledge. The proposed hybrid architecture\naddresses these limitations by combining both domain-specific knowledge and\nimplicit knowledge of the relational structure underlying the MTS data using\nKnowledge-Based Compositional Generalization. The hybrid architecture shows\npromising results on multiple benchmark datasets, outperforming\nstate-of-the-art forecasting methods. Additionally, the architecture models the\ntime varying uncertainty of multi-horizon forecasts.", "paper_summary_zh": "準確預測複雜動態系統的行為，\n其特徵是在互連感測器網路中具有高維度多變量時間序列 (MTS)，對於在各種應用中最小化風險的明智決策制定至關重要。雖然圖形預測網路 (GFN) 非常適合預測展現時空依賴性的 MTS 資料，\n但先前的工作僅依賴於時間序列變數相互關係的特定領域知識來建模非線性動態，忽略了 MTS 資料中變數之間內在的關聯結構依賴性。相比之下，當代作品從 MTS 資料推斷關聯結構，但忽略了特定領域的知識。所提出的混合架構透過使用基於知識的組合泛化，結合特定領域的知識和 MTS 資料中底層關聯結構的隱含知識，來解決這些限制。混合架構在多個基準資料集上顯示出有希望的結果，優於最先進的預測方法。此外，該架構對多時段預測的時間變異不確定性進行建模。", "author": "Sagar Srinivas Sakhinana et.al.", "authors": "Sagar Srinivas Sakhinana, Krishna Sai Sudhir Aripirala, Shivam Gupta, Venkataramana Runkana", "id": "2408.12409v1", "paper_url": "http://arxiv.org/abs/2408.12409v1", "repo": "null"}}