{"2502.03111": {"publish_time": "2025-02-05", "title": "Policies and Evaluation for Online Meeting Summarization", "paper_summary": "With more and more meetings moving to a digital domain, meeting summarization\nhas recently gained interest in both academic and commercial research. However,\nprior academic research focuses on meeting summarization as an offline task,\nperformed after the meeting concludes. In this paper, we perform the first\nsystematic study of online meeting summarization. For this purpose, we propose\nseveral policies for conducting online summarization. We discuss the unique\nchallenges of this task compared to the offline setting and define novel\nmetrics to evaluate latency and partial summary quality. The experiments on the\nAutoMin dataset show that 1) online models can produce strong summaries, 2) our\nmetrics allow a detailed analysis of different systems' quality-latency\ntrade-off, also taking into account intermediate outputs and 3) adaptive\npolicies perform better than fixed scheduled ones. These findings provide a\nstarting point for the wider research community to explore this important task.", "paper_summary_zh": "隨著越來越多的會議轉移到數位領域，會議摘要最近在學術和商業研究中都引起興趣。然而，先前的學術研究將會議摘要視為離線任務，在會議結束後執行。在本文中，我們執行第一個線上會議摘要的系統性研究。為此，我們提出幾項進行線上摘要的政策。我們討論了與離線設定相比此任務的獨特挑戰，並定義了評估延遲和部分摘要品質的新穎指標。在 AutoMin 資料集上的實驗顯示，1) 線上模型可以產生強大的摘要，2) 我們的指標允許詳細分析不同系統的品質延遲權衡，同時也考慮中間輸出，以及 3) 適應性政策比固定的排程政策執行得更好。這些發現為廣大的研究社群提供一個起點，以探索這項重要的任務。", "author": "Felix Schneider et.al.", "authors": "Felix Schneider, Marco Turchi, Alex Waibel", "id": "2502.03111v1", "paper_url": "http://arxiv.org/abs/2502.03111v1", "repo": "null"}}