{"2407.19586": {"publish_time": "2024-07-28", "title": "Is Generative AI an Existential Threat to Human Creatives? Insights from Financial Economics", "paper_summary": "With the phenomenal rise of generative AI models (e.g., large language models\nsuch as GPT or large image models such as Diffusion), there are increasing\nconcerns about human creatives' futures. Specifically, as generative models'\npower further increases, will they eventually replace all human creatives'\njobs? We argue that the answer is \"no,\" even if existing generative AI models'\ncapabilities reach their theoretical limit. Our theory has a close analogy to a\nfamiliar insight in financial economics on the impossibility of an\ninformationally efficient market [Grossman and Stiglitz (1980)]: If generative\nAI models can provide all the content humans need at low variable costs, then\nthere is no incentive for humans to spend costly resources on content creation\nas they cannot profit from it. But if no human creates new content, then\ngenerative AI can only learn from stale information and be unable to generate\nup-to-date content that reflects new happenings in the physical world. This\ncreates a paradox.", "paper_summary_zh": "隨著生成式 AI 模型（例如，大型語言模型，如 GPT 或大型影像模型，如 Diffusion）的驚人崛起，人們對於人類創意工作者的未來越來越感到憂心。具體來說，隨著生成式模型的效能持續提升，它們最終會取代所有人類創意工作者的工作嗎？我們認為答案是否定的，即使現有的生成式 AI 模型的能力達到理論上的極限。我們的理論與金融經濟學中關於資訊有效市場不可能存在的見解有密切的類比 [Grossman and Stiglitz (1980)]：如果生成式 AI 模型能以低變動成本提供人類所需的所有內容，那麼人類就沒有誘因花費昂貴的資源在內容創作上，因為他們無法從中獲利。但是，如果沒有人類創作新內容，那麼生成式 AI 就只能從陳舊的資訊中學習，並且無法產生反映物理世界中新事件的最新內容。這造成了悖論。", "author": "Jiasun Li et.al.", "authors": "Jiasun Li", "id": "2407.19586v1", "paper_url": "http://arxiv.org/abs/2407.19586v1", "repo": "null"}}