{"2408.14678": {"publish_time": "2024-08-26", "title": "Bridging the Gap: Unpacking the Hidden Challenges in Knowledge Distillation for Online Ranking Systems", "paper_summary": "Knowledge Distillation (KD) is a powerful approach for compressing a large\nmodel into a smaller, more efficient model, particularly beneficial for\nlatency-sensitive applications like recommender systems. However, current KD\nresearch predominantly focuses on Computer Vision (CV) and NLP tasks,\noverlooking unique data characteristics and challenges inherent to recommender\nsystems. This paper addresses these overlooked challenges, specifically: (1)\nmitigating data distribution shifts between teacher and student models, (2)\nefficiently identifying optimal teacher configurations within time and\nbudgetary constraints, and (3) enabling computationally efficient and rapid\nsharing of teacher labels to support multiple students. We present a robust KD\nsystem developed and rigorously evaluated on multiple large-scale personalized\nvideo recommendation systems within Google. Our live experiment results\ndemonstrate significant improvements in student model performance while\nensuring consistent and reliable generation of high quality teacher labels from\na continuous data stream of data.", "paper_summary_zh": "知識蒸餾 (KD) 是一種強大的方法，可用於將大型模型壓縮成較小、更有效率的模型，特別有利於對延遲敏感的應用程式，例如推薦系統。然而，目前的 KD 研究主要集中在電腦視覺 (CV) 和 NLP 任務，忽略了推薦系統固有的獨特資料特性和挑戰。本文探討了這些被忽視的挑戰，具體來說：(1) 減輕教師和學生模型之間的資料分佈轉移，(2) 在時間和預算限制內有效率地找出最佳教師配置，以及 (3) 啟用計算效率高且快速的教師標籤分享，以支援多個學生。我們展示了一個健全的 KD 系統，該系統是在 Google 內多個大型個人化影片推薦系統上開發和嚴格評估的。我們的現場實驗結果證明，學生模型效能顯著提升，同時確保從資料的連續資料串流中持續產生高品質的教師標籤。", "author": "Nikhil Khani et.al.", "authors": "Nikhil Khani, Shuo Yang, Aniruddh Nath, Yang Liu, Pendo Abbo, Li Wei, Shawn Andrews, Maciej Kula, Jarrod Kahn, Zhe Zhao, Lichan Hong, Ed Chi", "id": "2408.14678v1", "paper_url": "http://arxiv.org/abs/2408.14678v1", "repo": "null"}}