{"2501.12243": {"publish_time": "2025-01-21", "title": "FOCUS: First Order Concentrated Updating Scheme", "paper_summary": "Large language models (LLMs) demonstrate remarkable performance, and\nimproving their pre-training process appears to be key to enhancing their\ncapabilities further. Based on the documented success of Adam, learning rate\ndecay, and weight decay, we hypothesize that the pre-training loss landscape\nfeatures a narrowing valley structure. Through experiments with synthetic loss\nfunctions, we discover that when gradient query noise is high relative to the\nvalley's sharpness, Adam's performance falls behind that of Signum because Adam\nreduces the effective step size too drastically. This observation led us to\ndevelop FOCUS, an optimizer that enhances Signum by incorporating attraction\ntoward moving averaged parameters, allowing it to handle noise better while\nmaintaining larger step sizes. In training GPT-2, FOCUS proves to be more\nstable than Signum and faster than Adam. These results suggest that gradient\nnoise may be an underappreciated limiting factor in LLM training, and FOCUS\noffers promising solutions.", "paper_summary_zh": "大型語言模型 (LLM) 展現出卓越的效能，而改善其預訓練程序似乎是進一步提升其功能的關鍵。根據 Adam、學習率衰減和權重衰減的已記錄成功，我們假設預訓練損失景觀具有縮小的谷地結構。透過對合成損失函數的實驗，我們發現當梯度查詢雜訊相對於谷地的銳利度較高時，Adam 的效能會落後於 Signum，因為 Adam 會過度大幅度地減少有效步驟大小。這個觀察讓我們開發出 FOCUS，一種透過納入對移動平均參數的吸引力來增強 Signum 的最佳化器，讓它可以在維持較大步驟大小的同時更好地處理雜訊。在訓練 GPT-2 時，FOCUS 證明比 Signum 更穩定，而且比 Adam 更快。這些結果表明，梯度雜訊可能是 LLM 訓練中一個未被充分重視的限制因素，而 FOCUS 提供了有希望的解決方案。", "author": "Yizhou Liu et.al.", "authors": "Yizhou Liu, Ziming Liu, Jeff Gore", "id": "2501.12243v1", "paper_url": "http://arxiv.org/abs/2501.12243v1", "repo": "null"}}