{"2407.12165": {"publish_time": "2024-07-16", "title": "Building AI Agents for Autonomous Clouds: Challenges and Design Principles", "paper_summary": "The rapid growth in the use of Large Language Models (LLMs) and AI Agents as\npart of software development and deployment is revolutionizing the information\ntechnology landscape. While code generation receives significant attention, a\nhigher-impact application lies in using AI agents for operational resilience of\ncloud services, which currently require significant human effort and domain\nknowledge. There is a growing interest in AI for IT Operations (AIOps) which\naims to automate complex operational tasks, like fault localization and root\ncause analysis, thereby reducing human intervention and customer impact.\nHowever, achieving the vision of autonomous and self-healing clouds though\nAIOps is hampered by the lack of standardized frameworks for building,\nevaluating, and improving AIOps agents. This vision paper lays the groundwork\nfor such a framework by first framing the requirements and then discussing\ndesign decisions that satisfy them. We also propose AIOpsLab, a prototype\nimplementation leveraging agent-cloud-interface that orchestrates an\napplication, injects real-time faults using chaos engineering, and interfaces\nwith an agent to localize and resolve the faults. We report promising results\nand lay the groundwork to build a modular and robust framework for building,\nevaluating, and improving agents for autonomous clouds.", "paper_summary_zh": "大型語言模型 (LLM) 和 AI 代理在軟體開發和部署中使用的快速增長正在革新資訊技術領域。雖然程式碼生成受到極大關注，但影響力更大的應用在於使用 AI 代理來提升雲端服務的運作復原力，這目前需要大量的人力投入和領域知識。對 IT 運作的 AI (AIOps) 興趣日益增加，其目標是自動化複雜的運作任務，例如故障定位和根本原因分析，從而減少人為介入和客戶影響。然而，儘管有 AIOps，但要實現自主和自我修復雲端的願景，卻受到缺乏用於建構、評估和改善 AIOps 代理的標準化架構的阻礙。本願景文件透過首先建構需求，然後討論滿足這些需求的設計決策，為此類架構奠定基礎。我們還提出 AIOpsLab，這是一個原型實作，利用代理雲端介面來協調應用程式，使用混亂工程注入即時故障，並與代理介面以定位和解決故障。我們報告了有希望的結果，並奠定了建構、評估和改善用於自主雲端的代理的模組化且穩健的架構的基礎。", "author": "Manish Shetty et.al.", "authors": "Manish Shetty, Yinfang Chen, Gagan Somashekar, Minghua Ma, Yogesh Simmhan, Xuchao Zhang, Jonathan Mace, Dax Vandevoorde, Pedro Las-Casas, Shachee Mishra Gupta, Suman Nath, Chetan Bansal, Saravan Rajmohan", "id": "2407.12165v1", "paper_url": "http://arxiv.org/abs/2407.12165v1", "repo": "null"}}