{"2407.20176": {"publish_time": "2024-07-29", "title": "Emotion-Driven Melody Harmonization via Melodic Variation and Functional Representation", "paper_summary": "Emotion-driven melody harmonization aims to generate diverse harmonies for a\nsingle melody to convey desired emotions. Previous research found it hard to\nalter the perceived emotional valence of lead sheets only by harmonizing the\nsame melody with different chords, which may be attributed to the constraints\nimposed by the melody itself and the limitation of existing music\nrepresentation. In this paper, we propose a novel functional representation for\nsymbolic music. This new method takes musical keys into account, recognizing\ntheir significant role in shaping music's emotional character through\nmajor-minor tonality. It also allows for melodic variation with respect to keys\nand addresses the problem of data scarcity for better emotion modeling. A\nTransformer is employed to harmonize key-adaptable melodies, allowing for keys\ndetermined in rule-based or model-based manner. Experimental results confirm\nthe effectiveness of our new representation in generating key-aware harmonies,\nwith objective and subjective evaluations affirming the potential of our\napproach to convey specific valence for versatile melody.", "paper_summary_zh": "情感驅動的旋律和聲化旨在為單一旋律產生多樣化的和聲，以傳達所需的的情緒。先前的研究發現，僅通過使用不同的和弦來和聲化同一旋律，很難改變主旋律的感知情緒價，這可能歸因於旋律本身的約束和現有音樂表現形式的限制。在本文中，我們提出了一個符號音樂的新功能表示。這種新方法考慮了音樂的調性，承認了它們通過大調小調音調塑造音樂的情感特徵的重要作用。它還允許根據調性進行旋律變化，並解決了數據稀疏的問題，以進行更好的情緒建模。採用 Transformer 來和聲化可調整調性的旋律，允許以基於規則或基於模型的方式確定調性。實驗結果證實了我們的新表示在產生調性感知和聲方面的有效性，客觀和主觀評估肯定了我們的方法在傳達多功能旋律的特定價的潛力。", "author": "Jingyue Huang et.al.", "authors": "Jingyue Huang, Yi-Hsuan Yang", "id": "2407.20176v1", "paper_url": "http://arxiv.org/abs/2407.20176v1", "repo": "https://github.com/yuer867/emo_harmonizer"}}