{"2410.06718": {"publish_time": "2024-10-09", "title": "MatMamba: A Matryoshka State Space Model", "paper_summary": "State Space Models (SSMs) like Mamba2 are a promising alternative to\nTransformers, with faster theoretical training and inference times --\nespecially for long context lengths. Recent work on Matryoshka Representation\nLearning -- and its application to Transformer backbones in works like\nMatFormer -- showed how to introduce nested granularities of smaller submodels\nin one universal elastic model. In this work, we present MatMamba: a state\nspace model which combines Matryoshka-style learning with Mamba2, by modifying\nthe block to contain nested dimensions to enable joint training and adaptive\ninference. MatMamba allows for efficient and adaptive deployment across various\nmodel sizes. We train a single large MatMamba model and are able to get a\nnumber of smaller nested models for free -- while maintaining or improving upon\nthe performance of a baseline smaller model trained from scratch. We train\nlanguage and image models at a variety of parameter sizes from 35M to 1.4B. Our\nresults on ImageNet and FineWeb show that MatMamba models scale comparably to\nTransformers, while having more efficient inference characteristics. This makes\nMatMamba a practically viable option for deploying large-scale models in an\nelastic way based on the available inference compute. Code and models are open\nsourced at \\url{https://github.com/ScaledFoundations/MatMamba}", "paper_summary_zh": "狀態空間模型 (SSM)，例如 Mamba2，是 Transformer 的有前途的替代方案，理論訓練和推論時間更快——特別是對於長內容長度。最近關於 Matryoshka 表示學習的工作——以及它在 MatFormer 等作品中對 Transformer 主幹的應用——展示了如何在一個通用的彈性模型中引入較小子模型的嵌套粒度。在這項工作中，我們展示了 MatMamba：一種狀態空間模型，它通過修改塊以包含嵌套維度來結合 Matryoshka 風格的學習與 Mamba2，以實現聯合訓練和自適應推論。MatMamba 允許跨各種模型大小進行高效和自適應的部署。我們訓練一個大型 MatMamba 模型，並且能夠免費獲得許多較小的嵌套模型——同時保持或改進從頭開始訓練的基準較小模型的性能。我們以 35M 到 1.4B 的各種參數大小訓練語言和圖像模型。我們在 ImageNet 和 FineWeb 上的結果表明，MatMamba 模型可以與 Transformer 進行比較，同時具有更有效的推論特性。這使得 MatMamba 成為一種實用的可行選項，可以用彈性方式部署大規模模型，具體取決於可用的推論計算。代碼和模型在 \\url{https://github.com/ScaledFoundations/MatMamba} 開源", "author": "Abhinav Shukla et.al.", "authors": "Abhinav Shukla, Sai Vemprala, Aditya Kusupati, Ashish Kapoor", "id": "2410.06718v1", "paper_url": "http://arxiv.org/abs/2410.06718v1", "repo": "https://github.com/scaledfoundations/matmamba"}}