{"2407.19580": {"publish_time": "2024-07-28", "title": "Memory-efficient Training of LLMs with Larger Mini-batches", "paper_summary": "Training with larger mini-batches improves the performance and convergence\nrate of training machine learning models. However, training with large\nmini-batches becomes prohibitive for Large Language Models (LLMs) with billions\nof parameters, due to the large GPU memory requirement. To address this\nproblem, we propose finding small mini-batches that simulate the dynamics of\ntraining with larger mini-batches. Specifically, we formulate selecting smaller\nmini-batches of examples that closely capture gradients of large mini-batches\nas a submodular maximization problem. Nevertheless, the very large\ndimensionality of the gradients makes the problem very challenging to solve. To\naddress this, we leverage ideas from zeroth-order optimization and neural\nnetwork pruning to find lower-dimensional gradient estimates that allow finding\nhigh-quality subsets effectively with a limited amount of memory. We prove the\nsuperior convergence rate of training on the small mini-batches found by our\nmethod and empirically show its effectiveness. Our method can effectively\nreduce the memory requirement by 2x and speed up training by 1.3x, as we\nconfirm for fine-tuning Phi-2 on MathInstruct. Our method can be easily stacked\nwith LoRA and other memory-efficient methods to further reduce the memory\nrequirements of training LLMs.", "paper_summary_zh": "使用較大的迷你批次進行訓練會改善機器學習模型的訓練效能和收斂速度。然而，對於擁有數十億個參數的大型語言模型 (LLM) 來說，使用大型迷你批次進行訓練會受到限制，因為 GPU 記憶體需求很大。為了解決這個問題，我們建議尋找模擬較大型迷你批次訓練動態的小型迷你批次。具體來說，我們將選擇與大型迷你批次的梯度密切相關的小型範例迷你批次，並將其表述為次模組最大化問題。儘管如此，梯度的維度非常大，這使得問題的求解極具挑戰性。為了解決這個問題，我們利用零階最佳化和神經網路剪枝的想法，以尋找低維梯度估計值，並利用有限的記憶體有效地找到高品質子集。我們證明了使用我們的方法找到的小型迷你批次訓練的優異收斂速度，並實證顯示其有效性。我們的確能有效地將記憶體需求減少 2 倍，並將訓練速度提高 1.3 倍，正如我們在 MathInstruct 上對 Phi-2 進行微調所確認的那樣。我們的確能輕鬆地與 LoRA 和其他記憶體效率方法堆疊，以進一步減少 LLM 訓練的記憶體需求。", "author": "Dang Nguyen et.al.", "authors": "Dang Nguyen, Wenhan Yang, Rathul Anand, Yu Yang, Baharan Mirzasoleiman", "id": "2407.19580v1", "paper_url": "http://arxiv.org/abs/2407.19580v1", "repo": "null"}}