{"2504.08329": {"publish_time": "2025-04-11", "title": "MedRep: Medical Concept Representation for General Electronic Health Record Foundation Models", "paper_summary": "Electronic health record (EHR) foundation models have been an area ripe for\nexploration with their improved performance in various medical tasks. Despite\nthe rapid advances, there exists a fundamental limitation: Processing unseen\nmedical codes out of the vocabulary. This problem limits the generality of EHR\nfoundation models and the integration of models trained with different\nvocabularies. To deal with this problem, we propose MedRep for EHR foundation\nmodels based on the observational medical outcome partnership (OMOP) common\ndata model (CDM), providing the integrated medical concept representations and\nthe basic data augmentation strategy for patient trajectories. For concept\nrepresentation learning, we enrich the information of each concept with a\nminimal definition through large language model (LLM) prompts and enhance the\ntext-based representations through graph ontology of OMOP vocabulary.\nTrajectory augmentation randomly replaces selected concepts with other similar\nconcepts that have closely related representations to let the model practice\nwith the concepts out-of-vocabulary. Finally, we demonstrate that EHR\nfoundation models trained with MedRep better maintain the prediction\nperformance in external datasets. Our code implementation is publicly available\nat https://github.com/kicarussays/MedRep.", "paper_summary_zh": "電子健康紀錄 (EHR) 基礎模型一直是一個值得探索的領域，因為它們在各種醫療任務中表現出更佳的效能。儘管進展迅速，但存在一個根本性的限制：處理詞彙表以外的未見醫療代碼。這個問題限制了 EHR基礎模型的通用性，以及使用不同詞彙表訓練的模型的整合性。為了解決這個問題，我們基於觀察性醫療結果合作夥伴關係 (OMOP) 通用資料模型 (CDM) 提出了用於 EHR 基礎模型的 MedRep，提供整合的醫療概念表示和病人軌跡的基本資料擴增策略。對於概念表示學習，我們透過大型語言模型 (LLM) 提示，以最小定義豐富每個概念的資訊，並透過OMOP 詞彙表的圖形本體增強基於文字的表示。軌跡擴增會隨機將選定的概念替換為其他具有密切相關表示的相似概念，讓模型練習處理詞彙表以外的概念。最後，我們證明了使用 MedRep 訓練的 EHR基礎模型在外部資料集中能更好地維持預測效能。我們的程式碼實作已公開發布於https://github.com/kicarussays/MedRep。\n", "author": "Junmo Kim et.al.", "authors": "Junmo Kim, Namkyeong Lee, Jiwon Kim, Kwangsoo Kim", "id": "2504.08329v1", "paper_url": "http://arxiv.org/abs/2504.08329v1", "repo": "null"}}