{"2501.04253": {"publish_time": "2025-01-08", "title": "Integrated Offline and Online Learning to Solve a Large Class of Scheduling Problems", "paper_summary": "In this paper, we develop a unified machine learning (ML) approach to predict\nhigh-quality solutions for single-machine scheduling problems with a\nnon-decreasing min-sum objective function with or without release times. Our ML\napproach is novel in three major aspects. First, our approach is developed for\nthe entire class of the aforementioned problems. To achieve this, we exploit\nthe fact that the entire class of the problems considered can be formulated as\na time-indexed formulation in a unified manner. We develop a deep neural\nnetwork (DNN) which uses the cost parameters in the time-indexed formulation as\nthe inputs to effectively predict a continuous solution to this formulation,\nbased on which a feasible discrete solution is easily constructed. The second\nnovel aspect of our approach lies in how the DNN model is trained. In view of\nthe NP-hard nature of the problems, labels (i.e., optimal solutions) are hard\nto generate for training. To overcome this difficulty, we generate and utilize\na set of special instances, for which optimal solutions can be found with\nlittle computational effort, to train the ML model offline. The third novel\nidea we employ in our approach is that we develop an online single-instance\nlearning approach to fine tune the parameters in the DNN for a given online\ninstance, with the goal of generating an improved solution for the given\ninstance. To this end, we develop a feasibility surrogate that approximates the\nobjective value of a given instance as a continuous function of the outputs of\nthe DNN, which then enables us to derive gradients and update the learnable\nparameters in the DNN. Numerical results show that our approach can efficiently\ngenerate high-quality solutions for a variety of single-machine scheduling\nmin-sum problems with up to 1000 jobs.", "paper_summary_zh": "<paragraph>在本文中，我们开发了一种统一的机器学习 (ML) 方法来预测具有或不具有释放时间的非递减最小和目标函数的单机调度问题的优质解决方案。我们的 ML 方法在三个主要方面是新颖的。首先，我们的方法是为上述所有问题类别开发的。为了实现这一点，我们利用了这样一个事实：所考虑问题的整个类别可以用统一的方式表述为时间索引公式。我们开发了一个深度神经网络 (DNN)，它使用时间索引公式中的成本参数作为输入，以有效地预测该公式的连续解，在此基础上可以轻松构建可行的离散解。我们方法的第二个新颖之处在于 DNN 模型的训练方式。鉴于问题的 NP 困难性质，很难生成标签（即最优解）用于训练。为了克服这个困难，我们生成并利用了一组特殊实例，可以用很少的计算工作找到最优解，以离线训练 ML 模型。我们在方法中采用的第三个新颖思想是，我们开发了一种在线单实例学习方法，以微调给定在线实例的 DNN 中的参数，目的是为给定实例生成改进的解决方案。为此，我们开发了一个可行性代理，它将给定实例的目标值近似为 DNN 输出的连续函数，然后使我们能够导出梯度并更新 DNN 中可学习的参数。数值结果表明，我们的方法可以有效地生成各种单机调度最小和问题的优质解决方案，这些问题最多有 1000 个作业。</paragraph>", "author": "Anbang Liu et.al.", "authors": "Anbang Liu, Zhi-Long Chen, Jinyang Jiang, Xi Chen", "id": "2501.04253v1", "paper_url": "http://arxiv.org/abs/2501.04253v1", "repo": "null"}}