{"2501.09980": {"publish_time": "2025-01-17", "title": "Aneumo: A Large-Scale Comprehensive Synthetic Dataset of Aneurysm Hemodynamics", "paper_summary": "Intracranial aneurysm (IA) is a common cerebrovascular disease that is\nusually asymptomatic but may cause severe subarachnoid hemorrhage (SAH) if\nruptured. Although clinical practice is usually based on individual factors and\nmorphological features of the aneurysm, its pathophysiology and hemodynamic\nmechanisms remain controversial. To address the limitations of current\nresearch, this study constructed a comprehensive hemodynamic dataset of\nintracranial aneurysms. The dataset is based on 466 real aneurysm models, and\n10,000 synthetic models were generated by resection and deformation operations,\nincluding 466 aneurysm-free models and 9,534 deformed aneurysm models. The\ndataset also provides medical image-like segmentation mask files to support\ninsightful analysis. In addition, the dataset contains hemodynamic data\nmeasured at eight steady-state flow rates (0.001 to 0.004 kg/s), including\ncritical parameters such as flow velocity, pressure, and wall shear stress,\nproviding a valuable resource for investigating aneurysm pathogenesis and\nclinical prediction. This dataset will help advance the understanding of the\npathologic features and hemodynamic mechanisms of intracranial aneurysms and\nsupport in-depth research in related fields. Dataset hosted at\nhttps://github.com/Xigui-Li/Aneumo.", "paper_summary_zh": "顱內動脈瘤（IA）是一種常見的腦血管疾病，通常無症狀，但如果破裂可能會導致嚴重的蛛網膜下腔出血（SAH）。儘管臨床實務通常基於個體因素和動脈瘤的形態特徵，但其病理生理學和血流動力學機制仍存在爭議。為了解決當前研究的限制，本研究構建了一個顱內動脈瘤的全面血流動力學數據集。該數據集基於 466 個真實動脈瘤模型，並通過切除和變形操作生成了 10,000 個合成模型，包括 466 個無動脈瘤模型和 9,534 個變形動脈瘤模型。該數據集還提供了類醫學影像的分割遮罩檔案，以支持深入分析。此外，該數據集包含在八個穩態流速（0.001 至 0.004 kg/s）下測量的血流動力學數據，包括流速、壓力和壁面剪應力等關鍵參數，為研究動脈瘤發病機制和臨床預測提供了寶貴的資源。此數據集將有助於增進對顱內動脈瘤病理特徵和血流動力學機制的了解，並支持相關領域的深入研究。數據集託管於 https://github.com/Xigui-Li/Aneumo。", "author": "Xigui Li et.al.", "authors": "Xigui Li, Yuanye Zhou, Feiyang Xiao, Xin Guo, Yichi Zhang, Chen Jiang, Jianchao Ge, Xiansheng Wang, Qimeng Wang, Taiwei Zhang, Chensen Lin, Yuan Cheng, Yuan Qi", "id": "2501.09980v1", "paper_url": "http://arxiv.org/abs/2501.09980v1", "repo": "https://github.com/xigui-li/aneumo"}}