{"2407.10745": {"publish_time": "2024-07-15", "title": "What distinguishes conspiracy from critical narratives? A computational analysis of oppositional discourse", "paper_summary": "The current prevalence of conspiracy theories on the internet is a\nsignificant issue, tackled by many computational approaches. However, these\napproaches fail to recognize the relevance of distinguishing between texts\nwhich contain a conspiracy theory and texts which are simply critical and\noppose mainstream narratives. Furthermore, little attention is usually paid to\nthe role of inter-group conflict in oppositional narratives. We contribute by\nproposing a novel topic-agnostic annotation scheme that differentiates between\nconspiracies and critical texts, and that defines span-level categories of\ninter-group conflict. We also contribute with the multilingual\nXAI-DisInfodemics corpus (English and Spanish), which contains a high-quality\nannotation of Telegram messages related to COVID-19 (5,000 messages per\nlanguage). We also demonstrate the feasibility of an NLP-based automatization\nby performing a range of experiments that yield strong baseline solutions.\nFinally, we perform an analysis which demonstrates that the promotion of\nintergroup conflict and the presence of violence and anger are key aspects to\ndistinguish between the two types of oppositional narratives, i.e., conspiracy\nvs. critical.", "paper_summary_zh": "網路上陰謀論盛行，是當前一個重要的議題，許多計算方法都試圖解決。然而，這些方法並未意識到區分包含陰謀論的文本與僅僅批判並反對主流敘事的文本之間的相關性。此外，通常很少關注群際衝突在對立敘事中所扮演的角色。我們提出了一個創新的與主題無關的註解方案，用來區分陰謀論和批判性文本，並定義群際衝突的跨距層級類別。我們還貢獻了多語言的 XAI-DisInfodemics 語料庫（英文和西班牙文），其中包含與 COVID-19 相關的高品質 Telegram 訊息註解（每種語言 5,000 則訊息）。我們也透過執行一系列實驗來展示基於 NLP 的自動化的可行性，這些實驗產生了強大的基準解。最後，我們執行了一項分析，證明了群際衝突的推廣以及暴力和憤怒的存在，是區分兩種對立敘事（即陰謀論與批判）的主要面向。", "author": "Damir Korenčić et.al.", "authors": "Damir Korenčić, Berta Chulvi, Xavier Bonet Casals, Alejandro Toselli, Mariona Taulé, Paolo Rosso", "id": "2407.10745v1", "paper_url": "http://arxiv.org/abs/2407.10745v1", "repo": "null"}}