{"2405.14822": {"publish_time": "2024-05-23", "title": "PaGoDA: Progressive Growing of a One-Step Generator from a Low-Resolution Diffusion Teacher", "paper_summary": "To accelerate sampling, diffusion models (DMs) are often distilled into\ngenerators that directly map noise to data in a single step. In this approach,\nthe resolution of the generator is fundamentally limited by that of the teacher\nDM. To overcome this limitation, we propose Progressive Growing of Diffusion\nAutoencoder (PaGoDA), a technique to progressively grow the resolution of the\ngenerator beyond that of the original teacher DM. Our key insight is that a\npre-trained, low-resolution DM can be used to deterministically encode\nhigh-resolution data to a structured latent space by solving the PF-ODE forward\nin time (data-to-noise), starting from an appropriately down-sampled image.\nUsing this frozen encoder in an auto-encoder framework, we train a decoder by\nprogressively growing its resolution. From the nature of progressively growing\ndecoder, PaGoDA avoids re-training teacher/student models when we upsample the\nstudent model, making the whole training pipeline much cheaper. In experiments,\nwe used our progressively growing decoder to upsample from the pre-trained\nmodel's 64x64 resolution to generate 512x512 samples, achieving 2x faster\ninference compared to single-step distilled Stable Diffusion like LCM. PaGoDA\nalso achieved state-of-the-art FIDs on ImageNet across all resolutions from\n64x64 to 512x512. Additionally, we demonstrated PaGoDA's effectiveness in\nsolving inverse problems and enabling controllable generation.", "paper_summary_zh": "<paragraph>為了加速取樣，擴散模型 (DM) 經常被提煉成生成器，在單一步驟中直接將雜訊對應到資料。在這種方法中，生成器的解析度基本上受到教師 DM 的限制。為了克服這個限制，我們提出擴散自編碼器的漸進式成長 (PaGoDA)，這是一種技術，可以漸進式地成長生成器的解析度，超越原始教師 DM。我們的關鍵見解是，預先訓練的低解析度 DM 可以用來確定性地將高解析度資料編碼到結構化的潛在空間，方法是從適當地向下取樣的影像開始，隨著時間 (資料到雜訊) 解決 PF-ODE 正向。在自動編碼器架構中使用這個凍結編碼器，我們透過漸進式地成長它的解析度來訓練一個解碼器。從漸進式成長解碼器的本質來看，PaGoDA 在我們上採樣學生模型時避免重新訓練教師/學生模型，讓整個訓練流程便宜許多。在實驗中，我們使用漸進式成長解碼器從預先訓練模型的 64x64 解析度上採樣，以產生 512x512 樣本，與 LCM 等單步驟提煉的 Stable Diffusion 相比，推論速度快了 2 倍。PaGoDA 也在從 64x64 到 512x512 的所有解析度上，在 ImageNet 達到最先進的 FID。此外，我們展示了 PaGoDA 在解決反問題和啟用可控生成方面的效能。</paragraph>", "author": "Dongjun Kim et.al.", "authors": "Dongjun Kim, Chieh-Hsin Lai, Wei-Hsiang Liao, Yuhta Takida, Naoki Murata, Toshimitsu Uesaka, Yuki Mitsufuji, Stefano Ermon", "id": "2405.14822v1", "paper_url": "http://arxiv.org/abs/2405.14822v1", "repo": "null"}}