{"2411.04813": {"publish_time": "2024-11-07", "title": "LuxBank: The First Universal Dependency Treebank for Luxembourgish", "paper_summary": "The Universal Dependencies (UD) project has significantly expanded linguistic\ncoverage across 161 languages, yet Luxembourgish, a West Germanic language\nspoken by approximately 400,000 people, has remained absent until now. In this\npaper, we introduce LuxBank, the first UD Treebank for Luxembourgish,\naddressing the gap in syntactic annotation and analysis for this `low-research'\nlanguage. We establish formal guidelines for Luxembourgish language annotation,\nproviding the foundation for the first large-scale quantitative analysis of its\nsyntax. LuxBank serves not only as a resource for linguists and language\nlearners but also as a tool for developing spell checkers and grammar checkers,\norganising existing text archives and even training large language models. By\nincorporating Luxembourgish into the UD framework, we aim to enhance the\nunderstanding of syntactic variation within West Germanic languages and offer a\nmodel for documenting smaller, semi-standardised languages. This work positions\nLuxembourgish as a valuable resource in the broader linguistic and NLP\ncommunities, contributing to the study of languages with limited research and\nresources.", "paper_summary_zh": "通用依賴關係 (UD) 專案已大幅擴展 161 種語言的語言涵蓋範圍，但盧森堡語，一種約有 40 萬人使用的西日耳曼語，至今仍未納入其中。在本文中，我們將介紹 LuxBank，這是盧森堡語的第一個 UD 樹庫，用於解決這種「低研究」語言在句法註釋和分析方面的差距。我們為盧森堡語註釋建立了正式準則，為其首次大規模量化分析奠定基礎。LuxBank 不僅可用於語言學家和語言學習者，還可用於開發拼寫檢查器和語法檢查器，組織現有文字檔案，甚至訓練大型語言模型。透過將盧森堡語納入 UD 架構，我們旨在加強對西日耳曼語句法變化的理解，並提供一個用於記錄較小的半標準化語言的模型。這項工作將盧森堡語定位為更廣泛的語言學和 NLP 社群中的寶貴資源，有助於研究研究和資源有限的語言。", "author": "Alistair Plum et.al.", "authors": "Alistair Plum, Caroline Döhmer, Emilia Milano, Anne-Marie Lutgen, Christoph Purschke", "id": "2411.04813v1", "paper_url": "http://arxiv.org/abs/2411.04813v1", "repo": "null"}}