{"2408.05006": {"publish_time": "2024-08-09", "title": "Enhancing the Code Debugging Ability of LLMs via Communicative Agent Based Data Refinement", "paper_summary": "Debugging is a vital aspect of software development, yet the debugging\ncapabilities of Large Language Models (LLMs) remain largely unexplored. This\npaper first introduces DEBUGEVAL, a comprehensive benchmark designed to\nevaluate the debugging capabilities of LLMs. DEBUGEVAL collects data from\nexisting high-quality datasets and designs four different tasks to evaluate the\ndebugging effectiveness, including BUG Localization, BUG Identification, Code\nReview, and Code Repair. Additionally, to enhance the code debugging ability of\nLLMs, this paper proposes a CoMmunicative Agent BaSed DaTa REfinement FRamework\n(MASTER), which generates the refined code debugging data for supervised\nfinetuning. Specifically, MASTER employs the Code Quizzer to generate refined\ndata according to the defined tasks of DEBUGEVAL. Then the Code Learner acts as\na critic and reserves the generated problems that it can not solve. Finally,\nthe Code Teacher provides a detailed Chain-of-Thought based solution to deal\nwith the generated problem. We collect the synthesized data and finetune the\nCode Learner to enhance the debugging ability and conduct the NeuDebugger\nmodel. Our experiments evaluate various LLMs and NeuDebugger in the zero-shot\nsetting on DEBUGEVAL. Experimental results demonstrate that these 7B-scale LLMs\nhave weaker debugging capabilities, even these code-oriented LLMs. On the\ncontrary, these larger models (over 70B) show convincing debugging ability. Our\nfurther analyses illustrate that MASTER is an effective method to enhance the\ncode debugging ability by synthesizing data for Supervised Fine-Tuning (SFT)\nLLMs.", "paper_summary_zh": "<paragraph>除錯是軟體開發的重要面向，然而大型語言模型 (LLM) 的除錯能力仍鮮少被探討。本文首先介紹 DEBUGEVAL，一個用於評估 LLM 除錯能力的綜合基準測試。DEBUGEVAL 從現有的高品質資料集中收集資料，並設計四種不同的任務來評估除錯的有效性，包括錯誤定位、錯誤識別、程式碼檢閱和程式碼修復。此外，為了增強 LLM 的程式碼除錯能力，本文提出一個基於溝通代理的資料精煉框架 (MASTER)，為監督微調產生精煉的程式碼除錯資料。具體來說，MASTER 使用程式碼測驗產生精煉的資料，根據 DEBUGEVAL 定義的任務。然後，程式碼學習器扮演批評者的角色，保留它無法解決的產生問題。最後，程式碼教師提供一個基於思考鏈的詳細解決方案來處理產生的問題。我們收集合成的資料，並微調程式碼學習器以增強除錯能力，並執行 NeuDebugger 模型。我們的實驗在 DEBUGEVAL 上評估各種 LLM 和 NeuDebugger 的零次學習設定。實驗結果表明，這些 7B 級別的 LLM 具有較弱的除錯能力，即使是這些以程式碼為導向的 LLM。相反地，這些較大的模型 (超過 70B) 表現出令人信服的除錯能力。我們的進一步分析說明，MASTER 是一種通過為監督微調 (SFT) LLM 合成資料來增強程式碼除錯能力的有效方法。</paragraph>", "author": "Weiqing Yang et.al.", "authors": "Weiqing Yang, Hanbin Wang, Zhenghao Liu, Xinze Li, Yukun Yan, Shuo Wang, Yu Gu, Minghe Yu, Zhiyuan Liu, Ge Yu", "id": "2408.05006v1", "paper_url": "http://arxiv.org/abs/2408.05006v1", "repo": "null"}}