{"2412.12686": {"publish_time": "2024-12-17", "title": "XTransplant: A Probe into the Upper Bound Performance of Multilingual Capability and Culture Adaptability in LLMs via Mutual Cross-lingual Feed-forward Transplantation", "paper_summary": "Current large language models (LLMs) often exhibit imbalances in multilingual\ncapabilities and cultural adaptability, largely due to their English-centric\npretraining data. To address this imbalance, we propose a probing method named\nXTransplant that explores cross-lingual latent interactions via cross-lingual\nfeed-forward transplantation during inference stage, with the hope of enabling\nthe model to leverage the strengths of both English and non-English languages.\nThrough extensive pilot experiments, we empirically prove that both the\nmultilingual capabilities and cultural adaptability of LLMs hold the potential\nto be significantly improved by XTransplant, respectively from En -> non-En and\nnon-En -> En, highlighting the underutilization of current LLMs' multilingual\npotential. And the patterns observed in these pilot experiments further\nmotivate an offline scaling inference strategy, which demonstrates consistent\nperformance improvements in multilingual and culture-aware tasks, sometimes\neven surpassing multilingual supervised fine-tuning. And we do hope our further\nanalysis and discussion could help gain deeper insights into XTransplant\nmechanism.", "paper_summary_zh": "目前的大型語言模型 (LLM) 通常在多語言能力和文化適應性方面表現出不平衡，這主要是由於它們以英語為中心的預訓練數據。為了解決這種不平衡，我們提出了一種探測方法，稱為 XTransplant，它通過在推理階段進行跨語言前饋移植，探索跨語言潛在交互，希望能讓模型同時利用英語和非英語語言的優勢。通過廣泛的試驗實驗，我們憑經驗證明，XTransplant 可以顯著提升 LLM 的多語言能力和文化適應性，分別從英語到非英語和非英語到英語，突顯了當前 LLM 多語言潛力的利用不足。而且在這些試驗實驗中觀察到的模式進一步激勵了離線擴展推理策略，該策略在多語言和文化感知任務中展示了一致的性能提升，有時甚至超越了多語言監督微調。而且我們確實希望我們進一步的分析和討論有助於深入了解 XTransplant 機制。", "author": "Yangfan Ye et.al.", "authors": "Yangfan Ye, Xiaocheng Feng, Xiachong Feng, Libo Qin, Yichong Huang, Lei Huang, Weitao Ma, Zhirui Zhang, Yunfei Lu, Xiaohui Yan, Duyu Tang, Dandan Tu, Bing Qin", "id": "2412.12686v1", "paper_url": "http://arxiv.org/abs/2412.12686v1", "repo": "https://github.com/YYF-Tommy/XTransplant"}}