{"2501.00129": {"publish_time": "2024-12-30", "title": "A Data-Centric Approach to Detecting and Mitigating Demographic Bias in Pediatric Mental Health Text: A Case Study in Anxiety Detection", "paper_summary": "Introduction: Healthcare AI models often inherit biases from their training\ndata. While efforts have primarily targeted bias in structured data, mental\nhealth heavily depends on unstructured data. This study aims to detect and\nmitigate linguistic differences related to non-biological differences in the\ntraining data of AI models designed to assist in pediatric mental health\nscreening. Our objectives are: (1) to assess the presence of bias by evaluating\noutcome parity across sex subgroups, (2) to identify bias sources through\ntextual distribution analysis, and (3) to develop a de-biasing method for\nmental health text data. Methods: We examined classification parity across\ndemographic groups and assessed how gendered language influences model\npredictions. A data-centric de-biasing method was applied, focusing on\nneutralizing biased terms while retaining salient clinical information. This\nmethodology was tested on a model for automatic anxiety detection in pediatric\npatients. Results: Our findings revealed a systematic under-diagnosis of female\nadolescent patients, with a 4% lower accuracy and a 9% higher False Negative\nRate (FNR) compared to male patients, likely due to disparities in information\ndensity and linguistic differences in patient notes. Notes for male patients\nwere on average 500 words longer, and linguistic similarity metrics indicated\ndistinct word distributions between genders. Implementing our de-biasing\napproach reduced diagnostic bias by up to 27%, demonstrating its effectiveness\nin enhancing equity across demographic groups. Discussion: We developed a\ndata-centric de-biasing framework to address gender-based content disparities\nwithin clinical text. By neutralizing biased language and enhancing focus on\nclinically essential information, our approach demonstrates an effective\nstrategy for mitigating bias in AI healthcare models trained on text.", "paper_summary_zh": "<paragraph>引言：醫療保健 AI 模型通常會從其訓練資料中繼承偏見。雖然努力主要針對結構化資料中的偏見，但心理健康在很大程度上依賴於非結構化資料。本研究旨在檢測並減輕與設計用於協助兒童心理健康篩檢的 AI 模型訓練資料中的非生物差異相關的語言差異。我們的目標是：(1) 透過評估不同性別子群體的結果平價來評估偏見的存在，(2) 透過文本分佈分析來找出偏見來源，以及 (3) 開發一種心理健康文本資料的去偏見方法。方法：我們檢查了不同人口群體的分類平價，並評估了性別語言如何影響模型預測。應用了一種以資料為中心的去偏見方法，專注於在保留顯著臨床資訊的同時中和有偏見的術語。此方法在一個用於兒童患者自動焦慮檢測的模型上進行了測試。結果：我們的研究結果揭示了對女性青少年患者的系統性診斷不足，與男性患者相比，準確率低了 4%，假陰性率 (FNR) 高了 9%，這可能是由於患者備註中資訊密度和語言差異的差異。男性患者的備註平均長 500 個字，語言相似性指標顯示不同性別之間的字詞分佈截然不同。實施我們的去偏見方法將診斷偏見降低了 27%，證明了其在提升不同人口群體之間公平性的有效性。討論：我們開發了一個以資料為中心的去偏見架構，用於解決臨床文本中的基於性別的內容差異。透過中和有偏見的語言和加強對臨床必要資訊的關注，我們的做法展示了一種有效策略，用於減輕在文本上訓練的 AI 醫療保健模型中的偏見。</paragraph>", "author": "Julia Ive et.al.", "authors": "Julia Ive, Paulina Bondaronek, Vishal Yadav, Daniel Santel, Tracy Glauser, Tina Cheng, Jeffrey R. Strawn, Greeshma Agasthya, Jordan Tschida, Sanghyun Choo, Mayanka Chandrashekar, Anuj J. Kapadia, John Pestian", "id": "2501.00129v1", "paper_url": "http://arxiv.org/abs/2501.00129v1", "repo": "null"}}