{"2410.23230": {"publish_time": "2024-10-30", "title": "Aligning Audio-Visual Joint Representations with an Agentic Workflow", "paper_summary": "Visual content and accompanied audio signals naturally formulate a joint\nrepresentation to improve audio-visual (AV) related applications. While studies\ndevelop various AV representation learning frameworks, the importance of AV\ndata alignment is usually undermined for achieving high-quality representation.\nWe observe that an audio signal may contain background noise interference.\nAlso, non-synchronization may appear between audio and video streams. These\nnon-strict data alignment limits representation quality and downgrade\napplication performance. In this paper, we propose to improve AV joint\nrepresentations from a data-centric perspective by aligning audio signals to\nvisual data. Our alignment is conducted in an agentic workflow controlled by an\nLLM-based assistant named AVAgent. For each input AV data pair, our AVAgent\nuses a multi-modal LLM to convert audio and visual data into language\ndescriptions separately (i.e., tool use). Then, AVAgent reasons whether this\npaired data is aligned well and plans to edit the audio signal if needed (i.e.,\nplanning). The audio editing is executed by predefined actions that filter\nnoise or augment data. Moreover, we use a VLM to evaluate how modified audio\nsignals match the visual content and provide feedback to AVAgent (i.e.,\nreflection). The tool use, planning, and reflection steps operate cyclically to\nbecome an agentic workflow where audio signals are gradually aligned to visual\ncontent. To this end, existing methods can directly leverage the aligned AV\ndata via our agentic workflow to improve AV joint representations. The\nexperimental results comprehensively demonstrate the state-of-the-art\nperformance of the proposed approach against previous baselines in diverse\ndownstream tasks.", "paper_summary_zh": "視覺內容和伴隨的音訊訊號自然會形成一種聯合表示，以改善音訊視覺 (AV) 相關應用程式。儘管研究開發了各種 AV 表示學習架構，但 AV 資料對齊的重要性通常會被低估，以實現高品質的表示。我們觀察到，音訊訊號可能包含背景噪音干擾。此外，音訊串流和視訊串流之間可能出現不同步。這些非嚴格資料對齊會限制表示品質並降低應用程式效能。在本文中，我們提議從以資料為中心的觀點改善 AV 聯合表示，方法是將音訊訊號與視覺資料對齊。我們的對齊是在由名為 AVAgent 的基於 LLM 的助理控制的代理工作流程中進行的。對於每個輸入 AV 資料對，我們的 AVAgent 使用多模態 LLM 將音訊和視覺資料分別轉換成語言描述（即工具使用）。然後，AVAgent 推論這組資料對是否對齊良好，並計畫在需要時編輯音訊訊號（即計畫）。音訊編輯是由預定義的動作執行的，這些動作會過濾雜訊或擴充資料。此外，我們使用 VLM 來評估修改後的音訊訊號如何與視覺內容相符，並向 AVAgent 提供回饋（即反思）。工具使用、計畫和反思步驟循環運作，成為一個代理工作流程，其中音訊訊號逐漸與視覺內容對齊。為此，現有方法可以直接透過我們的代理工作流程利用對齊的 AV 資料來改善 AV 聯合表示。實驗結果全面展示了所提出的方法在各種下游任務中相較於先前基線的最佳效能。", "author": "Shentong Mo et.al.", "authors": "Shentong Mo, Yibing Song", "id": "2410.23230v2", "paper_url": "http://arxiv.org/abs/2410.23230v2", "repo": "null"}}