{"2501.18452": {"publish_time": "2025-01-30", "title": "Clustering Properties of Self-Supervised Learning", "paper_summary": "Self-supervised learning (SSL) methods via joint embedding architectures have\nproven remarkably effective at capturing semantically rich representations with\nstrong clustering properties, magically in the absence of label supervision.\nDespite this, few of them have explored leveraging these untapped properties to\nimprove themselves. In this paper, we provide an evidence through various\nmetrics that the encoder's output $encoding$ exhibits superior and more stable\nclustering properties compared to other components. Building on this insight,\nwe propose a novel positive-feedback SSL method, termed Representation Soft\nAssignment (ReSA), which leverages the model's clustering properties to promote\nlearning in a self-guided manner. Extensive experiments on standard SSL\nbenchmarks reveal that models pretrained with ReSA outperform other\nstate-of-the-art SSL methods by a significant margin. Finally, we analyze how\nReSA facilitates better clustering properties, demonstrating that it\neffectively enhances clustering performance at both fine-grained and\ncoarse-grained levels, shaping representations that are inherently more\nstructured and semantically meaningful.", "paper_summary_zh": "透過聯合嵌入架構的自監督學習 (SSL) 方法已證明在捕捉具有強大群集特性的語義豐富表徵方面非常有效，神奇的是在沒有標籤監督的情況下。儘管如此，很少有人探索利用這些未開發的特性來改善自身。在本文中，我們透過各種指標提供證據，證明編碼器的輸出 $encoding$ 與其他組件相比，表現出優異且更穩定的群集特性。根據此見解，我們提出了一種新穎的正回饋 SSL 方法，稱為表徵軟指派 (ReSA)，它利用模型的群集特性以自導引的方式促進學習。在標準 SSL 基準上的廣泛實驗表明，使用 ReSA 預訓練的模型在顯著幅度上優於其他最先進的 SSL 方法。最後，我們分析了 ReSA 如何促進更好的群集特性，證明它有效地增強了精細和粗略層級的群集效能，塑造出本質上更結構化且語義上有意義的表徵。", "author": "Xi Weng et.al.", "authors": "Xi Weng, Jianing An, Xudong Ma, Binhang Qi, Jie Luo, Xi Yang, Jin Song Dong, Lei Huang", "id": "2501.18452v1", "paper_url": "http://arxiv.org/abs/2501.18452v1", "repo": "null"}}