{"2410.15859": {"publish_time": "2024-10-21", "title": "Mesa-Extrapolation: A Weave Position Encoding Method for Enhanced Extrapolation in LLMs", "paper_summary": "Large language models (LLMs), although having revolutionized many fields,\nstill suffer from the challenging extrapolation problem, where the inference\nability of LLMs sharply declines beyond their max training lengths. In this\nwork, we conduct a theoretical analysis to better understand why No Position\nEncoding (NoPE) fails outside its effective range, as well as examining the\npower of Position Encoding (PE) in this context. Our findings reveal that with\nmeticulous weave position, PE can indeed be extended beyond effective range.\nOur theorems establish that LLMs equipped with weave PE can achieve improved\nextrapolation performance without additional cost. Furthermore, we introduce a\nnovel weave PE method, Mesa-Extrapolation, which utilizes a chunk-based\ntriangular attention matrix and applies Stair PE to manage the final chunk.\nThis method not only retains competitive performance but also offers\nsubstantial benefits such as significantly reduced memory demand and faster\ninference speed. Extensive experiments validate the effectiveness of\nMesa-Extrapolation, demonstrating its potential as a scalable solution to\nenhancing LLMs applicative reach.", "paper_summary_zh": "大型語言模型 (LLM) 儘管已經革新許多領域，\n仍受限於具有挑戰性的外推問題，其中 LLM 的推論\n能力在其最大訓練長度之外急劇下降。在這\n項工作中，我們進行理論分析，以更好地理解為什麼無位置\n編碼 (NoPE) 在其有效範圍之外會失敗，以及在此情況下探討\n位置編碼 (PE) 的能力。我們的發現顯示，透過\n細緻的編織位置，PE 確實可以擴展到有效範圍之外。\n我們的定理表明配備編織 PE 的 LLM 可以實現改進\n的外推效能，而無需額外成本。此外，我們引入一種\n新穎的編織 PE 方法，Mesa-Extrapolation，它利用基於塊的\n三角形注意力矩陣，並應用階梯 PE 來管理最後一個塊。\n此方法不僅保持競爭力，而且還提供\n顯著降低記憶體需求和更快的推論速度等實質性優點。廣泛的實驗驗證了\nMesa-Extrapolation 的有效性，證明其作為可擴充解決方案的潛力，以\n增強 LLM 的應用範圍。", "author": "Xin Ma et.al.", "authors": "Xin Ma, Yang Liu, Jingjing Liu, Xiaoxu Ma", "id": "2410.15859v2", "paper_url": "http://arxiv.org/abs/2410.15859v2", "repo": "null"}}