{"2408.08212": {"publish_time": "2024-08-15", "title": "Covert Bias: The Severity of Social Views' Unalignment Towards Implicit and Explicit Opinion", "paper_summary": "While various approaches have recently been studied for bias identification,\nlittle is known about how implicit language that does not explicitly convey a\nviewpoint affects bias amplification in large language models.To examine the\nseverity of bias toward a view, we evaluated the performance of two downstream\ntasks where the implicit and explicit knowledge of social groups were used.\nFirst, we present a stress test evaluation by using a biased model in edge\ncases of excessive bias scenarios. Then, we evaluate how LLMs calibrate\nlinguistically in response to both implicit and explicit opinions when they are\naligned with conflicting viewpoints. Our findings reveal a discrepancy in LLM\nperformance in identifying implicit and explicit opinions, with a general\ntendency of bias toward explicit opinions of opposing stances. Moreover, the\nbias-aligned models generate more cautious responses using uncertainty phrases\ncompared to the unaligned (zero-shot) base models. The direct, incautious\nresponses of the unaligned models suggest a need for further refinement of\ndecisiveness by incorporating uncertainty markers to enhance their reliability,\nespecially on socially nuanced topics with high subjectivity.", "paper_summary_zh": "儘管最近已針對偏差辨識研究出各種方法，\n但對於未明確傳達觀點的隱含語言如何影響大型語言模型中的偏差放大，目前所知甚少。為檢視觀點偏差的嚴重性，我們評估了兩個下游任務的效能，其中使用了社會群體的隱含和明確知識。\n首先，我們使用有偏差模型在過度偏差情境的邊緣案例中，提出壓力測試評估。然後，我們評估 LLM 在與相互衝突的觀點一致時，如何對隱含和明確意見在語言上進行校準。我們的研究結果揭示了 LLM 在辨識隱含和明確意見方面的效能差異，通常傾向於對反對立場的明確意見產生偏差。此外，與未對齊（零次學習）基礎模型相比，偏差對齊模型使用不確定性詞彙產生更謹慎的回應。未對齊模型的直接、魯莽回應表明需要進一步改進決斷力，方法是加入不確定性標記以增強其可靠性，特別是在主觀性高的社會細微差別主題上。", "author": "Abeer Aldayel et.al.", "authors": "Abeer Aldayel, Areej Alokaili, Rehab Alahmadi", "id": "2408.08212v1", "paper_url": "http://arxiv.org/abs/2408.08212v1", "repo": "null"}}