{"2405.08254": {"publish_time": "2024-05-14", "title": "Detecting Fallacies in Climate Misinformation: A Technocognitive Approach to Identifying Misleading Argumentation", "paper_summary": "Misinformation about climate change is a complex societal issue requiring\nholistic, interdisciplinary solutions at the intersection between technology\nand psychology. One proposed solution is a \"technocognitive\" approach,\ninvolving the synthesis of psychological and computer science research.\nPsychological research has identified that interventions in response to\nmisinformation require both fact-based (e.g., factual explanations) and\ntechnique-based (e.g., explanations of misleading techniques) content. However,\nlittle progress has been made on documenting and detecting fallacies in climate\nmisinformation. In this study, we apply a previously developed critical\nthinking methodology for deconstructing climate misinformation, in order to\ndevelop a dataset mapping different types of climate misinformation to\nreasoning fallacies. This dataset is used to train a model to detect fallacies\nin climate misinformation. Our study shows F1 scores that are 2.5 to 3.5 better\nthan previous works. The fallacies that are easiest to detect include fake\nexperts and anecdotal arguments, while fallacies that require background\nknowledge, such as oversimplification, misrepresentation, and slothful\ninduction, are relatively more difficult to detect. This research lays the\ngroundwork for development of solutions where automatically detected climate\nmisinformation can be countered with generative technique-based corrections.", "paper_summary_zh": "气候变迁的错误信息是一个复杂的社会问题，需要在技术和心理学的交叉点上采用整体的、跨学科的解决方案。一个建议的解决方案是“技术认知”方法，涉及心理和计算机科学研究的综合。心理研究已经发现，针对错误信息的干预措施需要基于事实（例如，事实解释）和基于技术的（例如，误导技术的解释）内容。然而，在记录和检测气候错误信息中的谬误方面几乎没有取得进展。在这项研究中，我们应用了先前开发的批判性思维方法来解构气候错误信息，以便开发一个数据集，将不同类型的气候错误信息映射到推理谬误。此数据集用于训练模型以检测气候错误信息中的谬误。我们的研究显示，F1 分数比以前的作品高出 2.5 到 3.5。最容易检测到的谬误包括虚假专家和轶事论证，而需要背景知识的谬误，例如过度简化、歪曲和懒惰归纳，则相对更难检测。这项研究为解决方案的开发奠定了基础，其中自动检测到的气候错误信息可以通过生成基于技术的更正来加以应对。", "author": "Francisco Zanartu et.al.", "authors": "Francisco Zanartu, John Cook, Markus Wagner, Julian Garcia", "id": "2405.08254v1", "paper_url": "http://arxiv.org/abs/2405.08254v1", "repo": "null"}}