{"2408.09914": {"publish_time": "2024-08-19", "title": "Active Learning for Identifying Disaster-Related Tweets: A Comparison with Keyword Filtering and Generic Fine-Tuning", "paper_summary": "Information from social media can provide essential information for emergency\nresponse during natural disasters in near real-time. However, it is difficult\nto identify the disaster-related posts among the large amounts of unstructured\ndata available. Previous methods often use keyword filtering, topic modelling\nor classification-based techniques to identify such posts. Active Learning (AL)\npresents a promising sub-field of Machine Learning (ML) that has not been used\nmuch in the field of text classification of social media content. This study\ntherefore investigates the potential of AL for identifying disaster-related\nTweets. We compare a keyword filtering approach, a RoBERTa model fine-tuned\nwith generic data from CrisisLex, a base RoBERTa model trained with AL and a\nfine-tuned RoBERTa model trained with AL regarding classification performance.\nFor testing, data from CrisisLex and manually labelled data from the 2021 flood\nin Germany and the 2023 Chile forest fires were considered. The results show\nthat generic fine-tuning combined with 10 rounds of AL outperformed all other\napproaches. Consequently, a broadly applicable model for the identification of\ndisaster-related Tweets could be trained with very little labelling effort. The\nmodel can be applied to use cases beyond this study and provides a useful tool\nfor further research in social media analysis.", "paper_summary_zh": "社群媒體上的資訊能在近乎即時的情況下，提供自然災害期間緊急應變的重要資訊。然而，在大量的非結構化資料中找出與災害相關的貼文卻很困難。先前的做法通常會使用關鍵字過濾、主題模型或基於分類的技術來找出此類貼文。主動學習 (AL) 是機器學習 (ML) 中一個有前景的子領域，尚未廣泛用於社群媒體內容的文字分類領域。因此，本研究探討 AL 在找出與災害相關推文方面的潛力。我們比較了關鍵字過濾方法、使用 CrisisLex 中的通用資料微調的 RoBERTa 模型、使用 AL 訓練的基本 RoBERTa 模型，以及使用 AL 訓練的微調 RoBERTa 模型的分類效能。在測試方面，考量了 CrisisLex 中的資料，以及 2021 年德國洪災和 2023 年智利森林大火的手動標籤資料。結果顯示，通用微調結合 10 輪 AL 的表現優於其他所有方法。因此，可用非常少的標籤工作訓練出一個廣泛適用的模型來找出與災害相關的推文。此模型可應用於本研究以外的用例，並提供一個有用的工具，用於社群媒體分析的後續研究。", "author": "David Hanny et.al.", "authors": "David Hanny, Sebastian Schmidt, Bernd Resch", "id": "2408.09914v1", "paper_url": "http://arxiv.org/abs/2408.09914v1", "repo": "null"}}