{"2410.08058": {"publish_time": "2024-10-10", "title": "Closing the Loop: Learning to Generate Writing Feedback via Language Model Simulated Student Revisions", "paper_summary": "Providing feedback is widely recognized as crucial for refining students'\nwriting skills. Recent advances in language models (LMs) have made it possible\nto automatically generate feedback that is actionable and well-aligned with\nhuman-specified attributes. However, it remains unclear whether the feedback\ngenerated by these models is truly effective in enhancing the quality of\nstudent revisions. Moreover, prompting LMs with a precise set of instructions\nto generate feedback is nontrivial due to the lack of consensus regarding the\nspecific attributes that can lead to improved revising performance. To address\nthese challenges, we propose PROF that PROduces Feedback via learning from LM\nsimulated student revisions. PROF aims to iteratively optimize the feedback\ngenerator by directly maximizing the effectiveness of students' overall\nrevising performance as simulated by LMs. Focusing on an economic essay\nassignment, we empirically test the efficacy of PROF and observe that our\napproach not only surpasses a variety of baseline methods in effectiveness of\nimproving students' writing but also demonstrates enhanced pedagogical values,\neven though it was not explicitly trained for this aspect.", "paper_summary_zh": "提供回饋被廣泛認為對於精進學生的寫作技巧至關重要。語言模型 (LM) 的最新進展讓自動產生回饋成為可能，而這些回饋具有可操作性，且與人類指定的屬性高度一致。然而，由這些模型產生的回饋是否真的能有效提升學生修改的品質，仍不清楚。此外，由於對於可能導致修改表現提升的特定屬性缺乏共識，因此提示 LM 產生回饋時，使用一組精確的說明並非易事。為了應對這些挑戰，我們提出 PROF，它透過學習 LM 模擬的學生修改來產生回饋。PROF 的目標是透過直接最大化學生整體修改表現的有效性（由 LM 模擬），來反覆最佳化回饋產生器。我們著重於經濟論文作業，實證測試 PROF 的效能，並觀察到我們的做法不僅在提升學生寫作的有效性方面超越各種基準方法，即使在這個面向並未經過明確訓練，也展現出增強的教學價值。", "author": "Inderjeet Nair et.al.", "authors": "Inderjeet Nair, Jiaye Tan, Xiaotian Su, Anne Gere, Xu Wang, Lu Wang", "id": "2410.08058v1", "paper_url": "http://arxiv.org/abs/2410.08058v1", "repo": "null"}}