{"2406.19638": {"publish_time": "2024-06-28", "title": "Precision matters: Precision-aware ensemble for weakly supervised semantic segmentation", "paper_summary": "Weakly Supervised Semantic Segmentation (WSSS) employs weak supervision, such\nas image-level labels, to train the segmentation model. Despite the impressive\nachievement in recent WSSS methods, we identify that introducing weak labels\nwith high mean Intersection of Union (mIoU) does not guarantee high\nsegmentation performance. Existing studies have emphasized the importance of\nprioritizing precision and reducing noise to improve overall performance. In\nthe same vein, we propose ORANDNet, an advanced ensemble approach tailored for\nWSSS. ORANDNet combines Class Activation Maps (CAMs) from two different\nclassifiers to increase the precision of pseudo-masks (PMs). To further\nmitigate small noise in the PMs, we incorporate curriculum learning. This\ninvolves training the segmentation model initially with pairs of smaller-sized\nimages and corresponding PMs, gradually transitioning to the original-sized\npairs. By combining the original CAMs of ResNet-50 and ViT, we significantly\nimprove the segmentation performance over the single-best model and the naive\nensemble model, respectively. We further extend our ensemble method to CAMs\nfrom AMN (ResNet-like) and MCTformer (ViT-like) models, achieving performance\nbenefits in advanced WSSS models. It highlights the potential of our ORANDNet\nas a final add-on module for WSSS models.", "paper_summary_zh": "弱監督語意分割 (WSSS) 採用弱監督，例如影像等級標籤，來訓練分割模型。儘管近期的 WSSS 方法取得令人印象深刻的成就，我們發現，引入平均交集聯集 (mIoU) 較高的弱標籤並不能保證高分割效能。現有研究強調了優先考慮精確度和降低雜訊以提升整體效能的重要性。基於相同的觀點，我們提出 ORANDNet，一種針對 WSSS 量身打造的進階整體方法。ORANDNet 結合來自兩個不同分類器的類別啟動圖 (CAM) 以提升偽遮罩 (PM) 的精確度。為了進一步減輕 PM 中的微小雜訊，我們納入了課程學習。這包括最初使用較小尺寸影像和對應 PM 訓練分割模型，並逐漸過渡到原始尺寸的配對。透過結合 ResNet-50 和 ViT 的原始 CAM，我們分別顯著提升了單一最佳模型和單純整體模型的分割效能。我們進一步將整體方法擴充到來自 AMN (類似 ResNet) 和 MCTformer (類似 ViT) 模型的 CAM，在進階 WSSS 模型中獲得效能優勢。這突顯了我們的 ORANDNet 作為 WSSS 模型最終附加模組的潛力。", "author": "Junsung Park et.al.", "authors": "Junsung Park, Hyunjung Shim", "id": "2406.19638v1", "paper_url": "http://arxiv.org/abs/2406.19638v1", "repo": "https://github.com/engineerJPark/ORANDNet"}}