{"2407.05680": {"publish_time": "2024-07-08", "title": "Fine-Grained Multi-View Hand Reconstruction Using Inverse Rendering", "paper_summary": "Reconstructing high-fidelity hand models with intricate textures plays a\ncrucial role in enhancing human-object interaction and advancing real-world\napplications. Despite the state-of-the-art methods excelling in texture\ngeneration and image rendering, they often face challenges in accurately\ncapturing geometric details. Learning-based approaches usually offer better\nrobustness and faster inference, which tend to produce smoother results and\nrequire substantial amounts of training data. To address these issues, we\npresent a novel fine-grained multi-view hand mesh reconstruction method that\nleverages inverse rendering to restore hand poses and intricate details.\nFirstly, our approach predicts a parametric hand mesh model through Graph\nConvolutional Networks (GCN) based method from multi-view images. We further\nintroduce a novel Hand Albedo and Mesh (HAM) optimization module to refine both\nthe hand mesh and textures, which is capable of preserving the mesh topology.\nIn addition, we suggest an effective mesh-based neural rendering scheme to\nsimultaneously generate photo-realistic image and optimize mesh geometry by\nfusing the pre-trained rendering network with vertex features. We conduct the\ncomprehensive experiments on InterHand2.6M, DeepHandMesh and dataset collected\nby ourself, whose promising results show that our proposed approach outperforms\nthe state-of-the-art methods on both reconstruction accuracy and rendering\nquality. Code and dataset are publicly available at\nhttps://github.com/agnJason/FMHR.", "paper_summary_zh": "重建具有复杂纹理的高保真手部模型在增强人机交互和推进现实世界应用程序中发挥着至关重要的作用。尽管最先进的方法在纹理生成和图像渲染方面表现出色，但它们在准确捕捉几何细节方面往往面临挑战。基于学习的方法通常提供更好的鲁棒性和更快的推理，这往往会产生更平滑的结果，并且需要大量的训练数据。为了解决这些问题，我们提出了一种新颖的细粒度多视图手部网格重建方法，该方法利用逆向渲染来恢复手部姿势和复杂细节。首先，我们的方法通过基于图卷积网络 (GCN) 的方法从多视图图像中预测参数化手部网格模型。我们进一步引入了一个新颖的手部反照率和网格 (HAM) 优化模块来优化手部网格和纹理，它能够保留网格拓扑。此外，我们提出了一种有效的基于网格的神经渲染方案，通过将预训练的渲染网络与顶点特征融合，同时生成逼真的图像并优化网格几何。我们在 InterHand2.6M、DeepHandMesh 和我们自己收集的数据集上进行了全面的实验，其有希望的结果表明，我们提出的方法在重建精度和渲染质量上都优于最先进的方法。代码和数据集可在 https://github.com/agnJason/FMHR 公开获得。", "author": "Qijun Gan et.al.", "authors": "Qijun Gan, Wentong Li, Jinwei Ren, Jianke Zhu", "id": "2407.05680v1", "paper_url": "http://arxiv.org/abs/2407.05680v1", "repo": "https://github.com/agnjason/fmhr"}}