{"2407.08408": {"publish_time": "2024-07-11", "title": "A Two-Stage Machine Learning-Aided Approach for Quench Identification at the European XFEL", "paper_summary": "This paper introduces a machine learning-aided fault detection and isolation\nmethod applied to the case study of quench identification at the European X-Ray\nFree-Electron Laser. The plant utilizes 800 superconducting radio-frequency\ncavities in order to accelerate electron bunches to high energies of up to 17.5\nGeV. Various faulty events can disrupt the nominal functioning of the\naccelerator, including quenches that can lead to a loss of the\nsuperconductivity of the cavities and the interruption of their operation. In\nthis context, our solution consists in analyzing signals reflecting the\ndynamics of the cavities in a two-stage approach. (I) Fault detection that uses\nanalytical redundancy to process the data and generate a residual. The\nevaluation of the residual through the generalized likelihood ratio allows\ndetecting the faulty behaviors. (II) Fault isolation which involves the\ndistinction of the quenches from the other faults. To this end, we proceed with\na data-driven model of the k-medoids algorithm that explores different\nsimilarity measures, namely, the Euclidean and the dynamic time warping.\nFinally, we evaluate the new method and compare it to the currently deployed\nquench detection system, the results show the improved performance achieved by\nour method.", "paper_summary_zh": "本文介紹了一種機器學習輔助的故障偵測與隔離方法，應用於歐洲 X 光自由電子雷射的猝發識別案例研究。該工廠利用 800 個超導射頻腔來加速電子束達到高達 17.5 GeV 的高能量。各種故障事件會中斷加速器的正常運作，包括可能導致腔體超導性喪失和中斷其運作的猝發。在此背景下，我們的解決方案包括分析反映腔體動態的信號，採用兩階段方法。(I) 故障偵測，使用分析冗餘處理資料並產生殘差。透過廣義似然比評估殘差，可以偵測故障行為。(II) 故障隔離，涉及將猝發與其他故障區分開來。為此，我們使用 k-medoids 演算法的資料驅動模型來探討不同的相似性測量，即歐幾里得和動態時間規整。最後，我們評估新方法並將其與目前部署的猝發偵測系統進行比較，結果顯示我們的方法達到了改進的效能。", "author": "Lynda Boukela et.al.", "authors": "Lynda Boukela, Annika Eichler, Julien Branlard, Nur Zulaiha Jomhari", "id": "2407.08408v1", "paper_url": "http://arxiv.org/abs/2407.08408v1", "repo": "null"}}