{"2501.03226": {"publish_time": "2025-01-06", "title": "BoostStep: Boosting mathematical capability of Large Language Models via improved single-step reasoning", "paper_summary": "Cutting-edge large language models (LLMs) demonstrate promising performance\nin solving complex math problems with a divide-and-conquer pipeline and the\nassistance of in-context learning (ICL) examples. However, their potential for\nimprovement is limited by two critical problems within their ICL examples:\ngranularity-mismatch and the ensuing negative-effect noise problem.\nSpecifically, the LLMs are capable of the dividing process yet mostly failed by\ninaccurate reasoning within a few conquer steps, while the ICL examples\nretrieved in question-grained sometimes lack relevant steps for a specific\nchallenging reasoning step. Further, this disconnect may hinder the correct\nreasoning due to its irrelevance. To this end, we focus on improving the\nreasoning quality within each step and present BoostStep. BoostStep aligns the\ngranularity between the retrieving and reasoning on step grained, and provides\nhighly related ICL examples for each reasoning step with a novel `first-try'\nstrategy. BoostStep provides more relevant examples than the coarse\nquestion-grained strategy, enhancing the model reasoning quality within each\nstep steadily. BoostStep is a general and robust reasoning-enhancing method\nthat not only improves standalone reasoning performance but also integrates\nseamlessly with Monte Carlo Tree Search methods (MCTS) to refine both candidate\ngeneration and decision-making. Quantitatively, it improves GPT-4o and\nQwen2.5-Math-72B by 3.6\\% and 2.0\\% respectively on various mathematical\nbenchmarks, and 7.5\\% gain combined with MCTS.", "paper_summary_zh": "尖端的巨量語言模型 (LLM) 在解決複雜的數學問題上展現了有前途的表現，採用分而治之的管道和情境學習 (ICL) 範例的協助。然而，它們的進步潛力受到 ICL 範例中兩個關鍵問題的限制：粒度不匹配和隨之而來的負面效應噪音問題。具體來說，LLM 有能力進行分隔處理，但在幾個征服步驟中的不準確推理大多失敗，而以問題粒度檢索的 ICL 範例有時缺乏特定挑戰性推理步驟的相关步驟。此外，這種脫節可能會因其無關性而阻礙正確的推理。為此，我們專注於提高每個步驟中的推理品質，並提出 BoostStep。BoostStep 在步驟粒度上調整檢索和推理之間的粒度，並使用新穎的「首次嘗試」策略為每個推理步驟提供高度相關的 ICL 範例。BoostStep 提供比粗略的問題粒度策略更相關的範例，穩步提升每個步驟中的模型推理品質。BoostStep 是一種通用且強大的推理增強方法，不僅改善獨立推理表現，還能與蒙地卡羅樹狀搜尋方法 (MCTS) 無縫整合，以改善候選產生和決策制定。在量化方面，它分別在各種數學基準上將 GPT-4o 和 Qwen2.5-Math-72B 提升了 3.6% 和 2.0%，並結合 MCTS 獲得了 7.5% 的增益。", "author": "Beichen Zhang et.al.", "authors": "Beichen Zhang, Yuhong Liu, Xiaoyi Dong, Yuhang Zang, Pan Zhang, Haodong Duan, Yuhang Cao, Dahua Lin, Jiaqi Wang", "id": "2501.03226v1", "paper_url": "http://arxiv.org/abs/2501.03226v1", "repo": "https://github.com/beichenzbc/booststep"}}