{"2409.10343": {"publish_time": "2024-09-16", "title": "Large Language Model Enhanced Hard Sample Identification for Denoising Recommendation", "paper_summary": "Implicit feedback, often used to build recommender systems, unavoidably\nconfronts noise due to factors such as misclicks and position bias. Previous\nstudies have attempted to alleviate this by identifying noisy samples based on\ntheir diverged patterns, such as higher loss values, and mitigating the noise\nthrough sample dropping or reweighting. Despite the progress, we observe\nexisting approaches struggle to distinguish hard samples and noise samples, as\nthey often exhibit similar patterns, thereby limiting their effectiveness in\ndenoising recommendations. To address this challenge, we propose a Large\nLanguage Model Enhanced Hard Sample Denoising (LLMHD) framework. Specifically,\nwe construct an LLM-based scorer to evaluate the semantic consistency of items\nwith the user preference, which is quantified based on summarized historical\nuser interactions. The resulting scores are used to assess the hardness of\nsamples for the pointwise or pairwise training objectives. To ensure\nefficiency, we introduce a variance-based sample pruning strategy to filter\npotential hard samples before scoring. Besides, we propose an iterative\npreference update module designed to continuously refine summarized user\npreference, which may be biased due to false-positive user-item interactions.\nExtensive experiments on three real-world datasets and four backbone\nrecommenders demonstrate the effectiveness of our approach.", "paper_summary_zh": "隱含回饋通常用於建立推薦系統，不可避免地會遇到雜訊，原因在於誤點和位置偏差等因素。先前的研究已嘗試透過識別雜訊樣本（根據它們的發散模式，例如較高的損失值）並透過樣本刪除或重新加權來減輕雜訊。儘管有進展，我們觀察到現有方法難以區分困難樣本和雜訊樣本，因為它們通常表現出類似的模式，從而限制了它們在去噪推薦中的有效性。為了應對這一挑戰，我們提出了一個大型語言模型增強的困難樣本去噪 (LLMHD) 框架。具體來說，我們建構了一個基於 LLM 的評分器來評估項目與使用者偏好的語義一致性，該一致性是根據總結的歷史使用者互動來量化的。產生的分數用於評估樣本對於逐點或成對訓練目標的難度。為了確保效率，我們引入了一個基於變異的樣本修剪策略，在評分之前過濾潛在的困難樣本。此外，我們提出了一個迭代偏好更新模組，旨在持續改善總結的使用者偏好，而這些偏好可能會因為誤判的使用者-項目互動而產生偏差。在三個真實世界資料集和四個主幹推薦系統上的廣泛實驗證明了我們方法的有效性。", "author": "Tianrui Song et.al.", "authors": "Tianrui Song, Wenshuo Chao, Hao Liu", "id": "2409.10343v1", "paper_url": "http://arxiv.org/abs/2409.10343v1", "repo": "null"}}