{"2501.18403": {"publish_time": "2025-01-30", "title": "Efficient Transformer for High Resolution Image Motion Deblurring", "paper_summary": "This paper presents a comprehensive study and improvement of the Restormer\narchitecture for high-resolution image motion deblurring. We introduce\narchitectural modifications that reduce model complexity by 18.4% while\nmaintaining or improving performance through optimized attention mechanisms.\nOur enhanced training pipeline incorporates additional transformations\nincluding color jitter, Gaussian blur, and perspective transforms to improve\nmodel robustness as well as a new frequency loss term. Extensive experiments on\nthe RealBlur-R, RealBlur-J, and Ultra-High-Definition Motion blurred (UHDM)\ndatasets demonstrate the effectiveness of our approach. The improved\narchitecture shows better convergence behavior and reduced training time while\nmaintaining competitive performance across challenging scenarios. We also\nprovide detailed ablation studies analyzing the impact of our modifications on\nmodel behavior and performance. Our results suggest that thoughtful\narchitectural simplification combined with enhanced training strategies can\nyield more efficient yet equally capable models for motion deblurring tasks.\nCode and Data Available at: https://github.com/hamzafer/image-deblurring", "paper_summary_zh": "本文提出了一項關於 Restormer 架構的全面研究和改進，用於高解析度影像動態去模糊。我們引入了架構修改，可將模型複雜度降低 18.4%，同時透過最佳化的注意力機制來維持或改善效能。我們的增強訓練管道納入了額外的轉換，包括色彩抖動、高斯模糊和透視轉換，以改善模型穩健性以及新的頻率損失項。在 RealBlur-R、RealBlur-J 和超高解析度動態模糊 (UHDM) 資料集上的廣泛實驗證明了我們方法的有效性。改良後的架構展現出更好的收斂行為和縮短的訓練時間，同時在具挑戰性的場景中維持具競爭力的效能。我們也提供了詳細的消融研究，分析了修改對模型行為和效能的影響。我們的結果表明，深思熟慮的架構簡化結合增強的訓練策略，可以產生更有效率但功能同樣強大的動態去模糊任務模型。程式碼和資料可於此取得：https://github.com/hamzafer/image-deblurring", "author": "Amanturdieva Akmaral et.al.", "authors": "Amanturdieva Akmaral, Muhammad Hamza Zafar", "id": "2501.18403v1", "paper_url": "http://arxiv.org/abs/2501.18403v1", "repo": "https://github.com/hamzafer/image-deblurring"}}