{"2408.16180": {"publish_time": "2024-08-29", "title": "Benchmarking Japanese Speech Recognition on ASR-LLM Setups with Multi-Pass Augmented Generative Error Correction", "paper_summary": "With the strong representational power of large language models (LLMs),\ngenerative error correction (GER) for automatic speech recognition (ASR) aims\nto provide semantic and phonetic refinements to address ASR errors. This work\nexplores how LLM-based GER can enhance and expand the capabilities of Japanese\nlanguage processing, presenting the first GER benchmark for Japanese ASR with\n0.9-2.6k text utterances. We also introduce a new multi-pass augmented\ngenerative error correction (MPA GER) by integrating multiple system hypotheses\non the input side with corrections from multiple LLMs on the output side and\nthen merging them. To the best of our knowledge, this is the first\ninvestigation of the use of LLMs for Japanese GER, which involves second-pass\nlanguage modeling on the output transcriptions generated by the ASR system\n(e.g., N-best hypotheses). Our experiments demonstrated performance improvement\nin the proposed methods of ASR quality and generalization both in SPREDS-U1-ja\nand CSJ data.", "paper_summary_zh": "利用大型語言模型 (LLM) 強大的表示能力，自動語音辨識 (ASR) 的生成錯誤修正 (GER) 旨在提供語意和語音修正，以解決 ASR 錯誤。本研究探討了基於 LLM 的 GER 如何增強和擴展日語處理的能力，並展示了第一個針對日語 ASR 的 GER 基準，其中包含 0.9-2.6k 個文字語句。我們還引入了一種新的多重通過擴增生成錯誤修正 (MPA GER)，方法是在輸入端整合多個系統假設，並在輸出端使用多個 LLM 的修正，然後將它們合併在一起。據我們所知，這是首次研究使用 LLM 進行日語 GER，其中涉及對 ASR 系統生成的輸出轉錄進行第二次語言建模（例如，N-best 假設）。我們的實驗證明了在 SPREDS-U1-ja 和 CSJ 數據中，所提出的 ASR 品質和泛化方法的效能有所提升。", "author": "Yuka Ko et.al.", "authors": "Yuka Ko, Sheng Li, Chao-Han Huck Yang, Tatsuya Kawahara", "id": "2408.16180v1", "paper_url": "http://arxiv.org/abs/2408.16180v1", "repo": "null"}}