{"2410.22944": {"publish_time": "2024-10-30", "title": "Focus On This, Not That! Steering LLMs With Adaptive Feature Specification", "paper_summary": "Despite the success of Instruction Tuning (IT) in training large language\nmodels (LLMs) to perform arbitrary user-specified tasks, these models often\nstill leverage spurious or biased features learned from their training data,\nleading to undesired behaviours when deploying them in new contexts. In this\nwork, we introduce Focus Instruction Tuning (FIT), which trains LLMs to\ncondition their responses by focusing on specific features whilst ignoring\nothers, leading to different behaviours based on what features are specified.\nAcross several experimental settings, we show that focus-tuned models can be\nadaptively steered by focusing on different features at inference-time: for\ninstance, robustness can be improved by focusing on task-causal features and\nignoring spurious features, and social bias can be mitigated by ignoring\ndemographic categories. Furthermore, FIT can steer behaviour in new contexts,\ngeneralising under distribution shift and to new unseen features at inference\ntime, and thereby facilitating more robust, fair, and controllable LLM\napplications in real-world environments.", "paper_summary_zh": "儘管指令調整 (IT) 在訓練大型語言模型 (LLM) 以執行任意使用者指定任務方面取得成功，但這些模型通常仍會利用從其訓練資料中學習到的虛假或偏差特徵，導致在新的環境中部署它們時出現不必要的行為。在這項工作中，我們引入了焦點指令調整 (FIT)，它訓練 LLM 透過專注於特定特徵同時忽略其他特徵來調整其回應，從而根據所指定的特徵產生不同的行為。在多個實驗設定中，我們展示了焦點調整模型可以在推論時透過專注於不同的特徵來適應性地進行引導：例如，透過專注於任務因果特徵並忽略虛假特徵，可以提高健壯性，並且透過忽略人口統計類別，可以減輕社會偏見。此外，FIT 可以引導在新的環境中的行為，在推論時對分佈轉移和新的未見特徵進行概化，從而促進在現實世界環境中更健壯、更公平且可控的 LLM 應用。", "author": "Tom A. Lamb et.al.", "authors": "Tom A. Lamb, Adam Davies, Alasdair Paren, Philip H. S. Torr, Francesco Pinto", "id": "2410.22944v1", "paper_url": "http://arxiv.org/abs/2410.22944v1", "repo": "null"}}