{"2411.07781": {"publish_time": "2024-11-12", "title": "RedCode: Risky Code Execution and Generation Benchmark for Code Agents", "paper_summary": "With the rapidly increasing capabilities and adoption of code agents for\nAI-assisted coding, safety concerns, such as generating or executing risky\ncode, have become significant barriers to the real-world deployment of these\nagents. To provide comprehensive and practical evaluations on the safety of\ncode agents, we propose RedCode, a benchmark for risky code execution and\ngeneration: (1) RedCode-Exec provides challenging prompts that could lead to\nrisky code execution, aiming to evaluate code agents' ability to recognize and\nhandle unsafe code. We provide a total of 4,050 risky test cases in Python and\nBash tasks with diverse input formats including code snippets and natural text.\nThey covers 25 types of critical vulnerabilities spanning 8 domains (e.g.,\nwebsites, file systems). We provide Docker environments and design\ncorresponding evaluation metrics to assess their execution results. (2)\nRedCode-Gen provides 160 prompts with function signatures and docstrings as\ninput to assess whether code agents will follow instructions to generate\nharmful code or software. Our empirical findings, derived from evaluating three\nagent frameworks based on 19 LLMs, provide insights into code agents'\nvulnerabilities. For instance, evaluations on RedCode-Exec show that agents are\nmore likely to reject executing risky operations on the operating system, but\nare less likely to reject executing technically buggy code, indicating high\nrisks. Risky operations described in natural text lead to a lower rejection\nrate than those in code format. Additionally, evaluations on RedCode-Gen show\nthat more capable base models and agents with stronger overall coding\nabilities, such as GPT4, tend to produce more sophisticated and effective\nharmful software. Our findings highlight the need for stringent safety\nevaluations for diverse code agents. Our dataset and code are available at\nhttps://github.com/AI-secure/RedCode.", "paper_summary_zh": "<paragraph>隨著支援 AI 編碼的程式碼代理功能快速提升且廣泛採用，安全性疑慮（例如產生或執行有風險的程式碼）已成為這些代理在現實世界中部署的重大障礙。為了對程式碼代理的安全性進行全面且實際的評估，我們提出 RedCode，一個有風險的程式碼執行和產生基準：(1) RedCode-Exec 提供可能導致有風險的程式碼執行的具挑戰性提示，目的是評估程式碼代理辨識和處理不安全程式碼的能力。我們總共提供了 4,050 個有風險的測試案例，採用 Python 和 Bash 任務，並包含多樣化的輸入格式，包括程式碼片段和自然語言。它們涵蓋了 8 個網域（例如網站、檔案系統）中的 25 種類型的重大漏洞。我們提供 Docker 環境並設計對應的評估指標來評估其執行結果。(2) RedCode-Gen 提供 160 個提示，包含函式簽章和文件字串，作為輸入來評估程式碼代理是否會遵循指令產生有害的程式碼或軟體。我們的實證結果源自於根據 19 個 LLM 評估三個代理架構，提供了程式碼代理漏洞的見解。例如，對 RedCode-Exec 的評估顯示，代理比較有可能拒絕執行作業系統上的有風險操作，但比較不可能拒絕執行技術上有問題的程式碼，這表示風險很高。以自然語言描述的有風險操作比以程式碼格式描述的有風險操作的拒絕率較低。此外，對 RedCode-Gen 的評估顯示，功能更強大的基礎模型和編碼能力更強的代理（例如 GPT4）往往會產生更精緻且有效的有害軟體。我們的發現強調了對各種程式碼代理進行嚴格安全性評估的必要性。我們的資料集和程式碼可在 https://github.com/AI-secure/RedCode 取得。</paragraph>", "author": "Chengquan Guo et.al.", "authors": "Chengquan Guo, Xun Liu, Chulin Xie, Andy Zhou, Yi Zeng, Zinan Lin, Dawn Song, Bo Li", "id": "2411.07781v1", "paper_url": "http://arxiv.org/abs/2411.07781v1", "repo": "null"}}