{"2408.13678": {"publish_time": "2024-08-24", "title": "A layer-wise analysis of Mandarin and English suprasegmentals in SSL speech models", "paper_summary": "This study asks how self-supervised speech models represent suprasegmental\ncategories like Mandarin lexical tone, English lexical stress, and English\nphrasal accents. Through a series of probing tasks, we make layer-wise\ncomparisons of English and Mandarin 12 layer monolingual models. Our findings\nsuggest that 1) English and Mandarin wav2vec 2.0 models learn contextual\nrepresentations of abstract suprasegmental categories which are strongest in\nthe middle third of the network. 2) Models are better at representing features\nthat exist in the language of their training data, and this difference is\ndriven by enriched context in transformer blocks, not local acoustic\nrepresentation. 3) Fine-tuned wav2vec 2.0 improves performance in later layers\ncompared to pre-trained models mainly for lexically contrastive features like\ntone and stress, 4) HuBERT and WavLM learn similar representations to wav2vec\n2.0, differing mainly in later layer performance. Our results extend previous\nunderstanding of how models represent suprasegmentals and offer new insights\ninto the language-specificity and contextual nature of these representations.", "paper_summary_zh": "本研究探討自監督語音模型如何呈現超音段範疇，例如漢語詞調、英語詞彙重音和英語片語重音。透過一系列探測任務，我們對英語和漢語 12 層單語模型進行逐層比較。我們的研究結果表明：1) 英語和漢語 wav2vec 2.0 模型學習抽象超音段範疇的語境表示，這些範疇在網路的中間三分之一處最強。2) 模型更擅長表示其訓練資料語言中存在的特徵，而這種差異是由Transformer區塊中的豐富語境推動的，而不是由局部音訊表示推動。3) 微調的 wav2vec 2.0 改善了後層的效能，與預先訓練的模型相比，主要是針對音調和重音等詞彙對比特徵。4) HuBERT 和 WavLM 學習到與 wav2vec 2.0 類似的表示，主要差異在於後層效能。我們的結果擴展了先前對模型如何表示超音段的了解，並對這些表示的語言特異性和語境性質提供了新的見解。", "author": "Antón de la Fuente et.al.", "authors": "Antón de la Fuente, Dan Jurafsky", "id": "2408.13678v1", "paper_url": "http://arxiv.org/abs/2408.13678v1", "repo": "null"}}