{"2503.05193": {"publish_time": "2025-03-07", "title": "Memory-augmented Query Reconstruction for LLM-based Knowledge Graph Reasoning", "paper_summary": "Large language models (LLMs) have achieved remarkable performance on\nknowledge graph question answering (KGQA) tasks by planning and interacting\nwith knowledge graphs. However, existing methods often confuse tool utilization\nwith knowledge reasoning, harming readability of model outputs and giving rise\nto hallucinatory tool invocations, which hinder the advancement of KGQA. To\naddress this issue, we propose Memory-augmented Query Reconstruction for\nLLM-based Knowledge Graph Reasoning (MemQ) to decouple LLM from tool invocation\ntasks using LLM-built query memory. By establishing a memory module with\nexplicit descriptions of query statements, the proposed MemQ facilitates the\nKGQA process with natural language reasoning and memory-augmented query\nreconstruction. Meanwhile, we design an effective and readable reasoning to\nenhance the LLM's reasoning capability in KGQA. Experimental results that MemQ\nachieves state-of-the-art performance on widely used benchmarks WebQSP and CWQ.", "paper_summary_zh": "大型語言模型 (LLM) 在透過規劃和與知識圖譜互動的知識圖譜問答 (KGQA) 任務上取得了顯著的成果。然而，現有方法經常將工具利用與知識推理混淆，損害了模型輸出的可讀性，並導致產生幻覺的工具調用，阻礙了 KGQA 的發展。為了應對這個問題，我們提出了基於 LLM 的知識圖譜推理的記憶增強查詢重建 (MemQ)，使用 LLM 建立的查詢記憶體將 LLM 與工具調用任務分離。透過建立一個具有查詢語句明確描述的記憶體模組，提出的 MemQ 使用自然語言推理和記憶體增強查詢重建來促進 KGQA 過程。同時，我們設計了一種有效且可讀的推理方式來增強 LLM 在 KGQA 中的推理能力。實驗結果顯示，MemQ 在廣泛使用的基準測試 WebQSP 和 CWQ 上達到了最先進的性能。\n", "author": "Mufan Xu et.al.", "authors": "Mufan Xu, Gewen Liang, Kehai Chen, Wei Wang, Xun Zhou, Muyun Yang, Tiejun Zhao, Min Zhang", "id": "2503.05193v1", "paper_url": "http://arxiv.org/abs/2503.05193v1", "repo": "null"}}