{"2405.11519": {"publish_time": "2024-05-19", "title": "MSNER: A Multilingual Speech Dataset for Named Entity Recognition", "paper_summary": "While extensively explored in text-based tasks, Named Entity Recognition\n(NER) remains largely neglected in spoken language understanding. Existing\nresources are limited to a single, English-only dataset. This paper addresses\nthis gap by introducing MSNER, a freely available, multilingual speech corpus\nannotated with named entities. It provides annotations to the VoxPopuli dataset\nin four languages (Dutch, French, German, and Spanish). We have also releasing\nan efficient annotation tool that leverages automatic pre-annotations for\nfaster manual refinement. This results in 590 and 15 hours of silver-annotated\nspeech for training and validation, alongside a 17-hour, manually-annotated\nevaluation set. We further provide an analysis comparing silver and gold\nannotations. Finally, we present baseline NER models to stimulate further\nresearch on this newly available dataset.", "paper_summary_zh": "儘管在基於文字的任務中已廣泛探討，但命名實體辨識 (NER) 在口語理解中仍被大量忽略。現有資源僅限於單一的、僅限英語的資料集。本文透過介紹 MSNER 來解決此差距，MSNER 是一個免費提供的多語言語音語料庫，其中標註了命名實體。它為 VoxPopuli 資料集提供四種語言 (荷蘭語、法語、德語和西班牙語) 的標註。我們也發布了一個高效的標註工具，它利用自動預標註來加快手動精煉。這產生了 590 小時和 15 小時的銀標註語音，用於訓練和驗證，以及一個 17 小時的手動標註評估集。我們進一步提供了一個分析，比較銀標註和金標註。最後，我們提出基準 NER 模型，以激勵對這個新資料集的進一步研究。", "author": "Quentin Meeus et.al.", "authors": "Quentin Meeus, Marie-Francine Moens, Hugo Van hamme", "id": "2405.11519v1", "paper_url": "http://arxiv.org/abs/2405.11519v1", "repo": "null"}}