{"2407.07288": {"publish_time": "2024-07-10", "title": "Structural Design Through Reinforcement Learning", "paper_summary": "This paper introduces the Structural Optimization gym (SOgym), a novel\nopen-source reinforcement learning environment designed to advance the\napplication of machine learning in topology optimization. SOgym aims for RL\nagents to learn to generate physically viable and structurally robust designs\nby integrating the physics of TO directly into the reward function. To enhance\nscalability, SOgym leverages feature mapping methods as a mesh-independent\ninterface between the environment and the agent, allowing for efficient\ninteraction with the design variables regardless of the mesh resolution.\nBaseline results are presented using a model-free proximal policy optimization\nagent and a model-based DreamerV3 agent. Three observation space configurations\nwere tested. The TopOpt game inspired configuration, an interactive educational\ntool that improves students' intuition in designing structures to minimize\ncompliance under volume constraints, performed best in terms of performance and\nsample efficiency. The 100M parameter version of DreamerV3 produced structures\nwithin 54% of the baseline compliance achieved by traditional optimization\nmethods as well as a 0% disconnection rate, an improvement over supervised\nlearning approaches that often struggle with disconnected load paths. When\ncomparing the learning rates of the agents to those of engineering students\nfrom the TopOpt game experiment, the DreamerV3-100M model shows a learning rate\napproximately four orders of magnitude lower, an impressive feat for a policy\ntrained from scratch through trial and error. These results suggest RL's\npotential to solve continuous TO problems and its capacity to explore and learn\nfrom diverse design solutions. SOgym provides a platform for developing RL\nagents for complex structural design challenges and is publicly available to\nsupport further research in the field.", "paper_summary_zh": "<paragraph>本文介绍了结构优化健身房 (SOgym)，这是一个新颖的开源强化学习环境，旨在推进机器学习在拓扑优化中的应用。SOgym 的目标是让 RL 代理学习生成物理可行且结构稳健的设计，方法是将 TO 的物理特性直接整合到奖励函数中。为了提高可扩展性，SOgym 利用特征映射方法作为环境和代理之间的网格无关接口，从而可以与设计变量进行高效交互，而不管网格分辨率如何。使用无模型近端策略优化代理和基于模型的 DreamerV3 代理展示了基准结果。测试了三种观察空间配置。受 TopOpt 游戏启发的配置是一种交互式教育工具，可以提高学生在设计结构以最大限度地减少体积约束下的柔顺性方面的直觉，在性能和样本效率方面表现最佳。DreamerV3 的 100M 参数版本产生的结构在传统优化方法实现的基准柔顺性范围内为 54%，并且断开率为 0%，这比通常难以处理断开负载路径的监督学习方法有所改进。当将代理的学习率与来自 TopOpt 游戏实验的工程学生的学习率进行比较时，DreamerV3-100M 模型显示的学习率大约低四个数量级，对于通过反复试验从头开始训练的策略来说，这是一个令人印象深刻的壮举。这些结果表明 RL 有可能解决连续 TO 问题，并有能力探索和学习各种设计解决方案。SOgym 为开发用于复杂结构设计挑战的 RL 代理提供了一个平台，并且公开可用以支持该领域的进一步研究。</paragraph>", "author": "Thomas Rochefort-Beaudoin et.al.", "authors": "Thomas Rochefort-Beaudoin, Aurelian Vadean, Niels Aage, Sofiane Achiche", "id": "2407.07288v1", "paper_url": "http://arxiv.org/abs/2407.07288v1", "repo": "null"}}