{"2409.06904": {"publish_time": "2024-09-10", "title": "Applied Federated Model Personalisation in the Industrial Domain: A Comparative Study", "paper_summary": "The time-consuming nature of training and deploying complicated Machine and\nDeep Learning (DL) models for a variety of applications continues to pose\nsignificant challenges in the field of Machine Learning (ML). These challenges\nare particularly pronounced in the federated domain, where optimizing models\nfor individual nodes poses significant difficulty. Many methods have been\ndeveloped to tackle this problem, aiming to reduce training expenses and time\nwhile maintaining efficient optimisation. Three suggested strategies to tackle\nthis challenge include Active Learning, Knowledge Distillation, and Local\nMemorization. These methods enable the adoption of smaller models that require\nfewer computational resources and allow for model personalization with local\ninsights, thereby improving the effectiveness of current models. The present\nstudy delves into the fundamental principles of these three approaches and\nproposes an advanced Federated Learning System that utilises different\nPersonalisation methods towards improving the accuracy of AI models and\nenhancing user experience in real-time NG-IoT applications, investigating the\nefficacy of these techniques in the local and federated domain. The results of\nthe original and optimised models are then compared in both local and federated\ncontexts using a comparison analysis. The post-analysis shows encouraging\noutcomes when it comes to optimising and personalising the models with the\nsuggested techniques.", "paper_summary_zh": "在机器学习（ML）领域中，训练和部署各种应用程序的复杂机器和深度学习（DL）模型耗时，这持续对该领域构成重大挑战。这些挑战在联邦领域中尤为明显，在该领域中，针对各个节点优化模型会造成重大困难。已经开发了许多方法来解决此问题，旨在减少训练开支和时间，同时保持有效的优化。解决此挑战的三种建议策略包括主动学习、知识蒸馏和本地记忆。这些方法能够采用需要较少计算资源的较小模型，并允许使用本地见解对模型进行个性化设置，从而提高当前模型的有效性。本研究深入探讨了这三种方法的基本原理，并提出了一个先进的联邦学习系统，该系统利用不同的个性化方法来提高人工智能模型的准确性，并增强实时 NG-IoT 应用程序中的用户体验，调查了这些技术在本地和联邦领域的功效。然后，使用比较分析在本地和联邦上下文中比较原始模型和优化模型的结果。事后分析显示，使用建议的技术对模型进行优化和个性化时，结果令人鼓舞。", "author": "Ilias Siniosoglou et.al.", "authors": "Ilias Siniosoglou, Vasileios Argyriou, George Fragulis, Panagiotis Fouliras, Georgios Th. Papadopoulos, Anastasios Lytos, Panagiotis Sarigiannidis", "id": "2409.06904v1", "paper_url": "http://arxiv.org/abs/2409.06904v1", "repo": "null"}}