{"2409.06097": {"publish_time": "2024-09-09", "title": "ClarQ-LLM: A Benchmark for Models Clarifying and Requesting Information in Task-Oriented Dialog", "paper_summary": "We introduce ClarQ-LLM, an evaluation framework consisting of bilingual\nEnglish-Chinese conversation tasks, conversational agents and evaluation\nmetrics, designed to serve as a strong benchmark for assessing agents' ability\nto ask clarification questions in task-oriented dialogues. The benchmark\nincludes 31 different task types, each with 10 unique dialogue scenarios\nbetween information seeker and provider agents. The scenarios require the\nseeker to ask questions to resolve uncertainty and gather necessary information\nto complete tasks. Unlike traditional benchmarks that evaluate agents based on\nfixed dialogue content, ClarQ-LLM includes a provider conversational agent to\nreplicate the original human provider in the benchmark. This allows both\ncurrent and future seeker agents to test their ability to complete information\ngathering tasks through dialogue by directly interacting with our provider\nagent. In tests, LLAMA3.1 405B seeker agent managed a maximum success rate of\nonly 60.05\\%, showing that ClarQ-LLM presents a strong challenge for future\nresearch.", "paper_summary_zh": "我們推出 ClarQ-LLM，這是一個評估框架，由雙語英語-中文對話任務、對話代理和評估指標組成，旨在作為評估代理在任務導向對話中提出澄清問題的能力的強大基準。該基準包含 31 種不同的任務類型，每個任務類型都包含信息尋求者和提供者代理之間的 10 個獨特對話場景。這些場景要求尋求者提出問題以解決不確定性並收集必要的資訊以完成任務。與根據固定對話內容評估代理的傳統基準不同，ClarQ-LLM 包含一個提供者對話代理，以複製基準中的原始人類提供者。這允許當前和未來的尋求者代理透過直接與我們的提供者代理互動來測試他們完成資訊收集任務的能力。在測試中，LLAMA3.1 405B 尋求者代理僅管理 60.05% 的最高成功率，這表明 ClarQ-LLM 對未來的研究提出了嚴峻的挑戰。", "author": "Yujian Gan et.al.", "authors": "Yujian Gan, Changling Li, Jinxia Xie, Luou Wen, Matthew Purver, Massimo Poesio", "id": "2409.06097v1", "paper_url": "http://arxiv.org/abs/2409.06097v1", "repo": "null"}}