{"2501.14457": {"publish_time": "2025-01-24", "title": "Understanding and Mitigating Gender Bias in LLMs via Interpretable Neuron Editing", "paper_summary": "Large language models (LLMs) often exhibit gender bias, posing challenges for\ntheir safe deployment. Existing methods to mitigate bias lack a comprehensive\nunderstanding of its mechanisms or compromise the model's core capabilities. To\naddress these issues, we propose the CommonWords dataset, to systematically\nevaluate gender bias in LLMs. Our analysis reveals pervasive bias across models\nand identifies specific neuron circuits, including gender neurons and general\nneurons, responsible for this behavior. Notably, editing even a small number of\ngeneral neurons can disrupt the model's overall capabilities due to\nhierarchical neuron interactions. Based on these insights, we propose an\ninterpretable neuron editing method that combines logit-based and causal-based\nstrategies to selectively target biased neurons. Experiments on five LLMs\ndemonstrate that our method effectively reduces gender bias while preserving\nthe model's original capabilities, outperforming existing fine-tuning and\nediting approaches. Our findings contribute a novel dataset, a detailed\nanalysis of bias mechanisms, and a practical solution for mitigating gender\nbias in LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 經常表現出性別偏見，對其安全部署構成挑戰。現有的減輕偏見的方法缺乏對其機制的全面理解，或損害模型的核心能力。為了解決這些問題，我們提出 CommonWords 資料集，以系統性地評估 LLM 中的性別偏見。我們的分析揭示了跨模型的普遍偏見，並識別出特定神經元電路，包括性別神經元和一般神經元，這些神經元對這種行為負責。值得注意的是，由於分層神經元交互作用，即使編輯少數一般神經元也會破壞模型的整體能力。基於這些見解，我們提出了一種可解釋的神經元編輯方法，該方法結合了基於邏輯和基於因果的策略來選擇性地針對有偏見的神經元。對五個 LLM 的實驗表明，我們的模型有效地減少了性別偏見，同時保留了模型的原始能力，優於現有的微調和編輯方法。我們的研究結果提供了一個新的資料集、對偏見機制的詳細分析，以及一種減輕 LLM 中性別偏見的實用解決方案。", "author": "Zeping Yu et.al.", "authors": "Zeping Yu, Sophia Ananiadou", "id": "2501.14457v1", "paper_url": "http://arxiv.org/abs/2501.14457v1", "repo": "null"}}