{"2405.12849": {"publish_time": "2024-05-21", "title": "Training and inference in the ReckON RSNN architecture implemented on a MPSoC", "paper_summary": "With the rise of artificial intelligence, biological neuron models are being\nused to implement neural networks that can learn certain tasks after a training\nphase. One type of such networks are spiking neural networks (SNNs) that rely\non a simplified model for biological neurons, the Integrate and Fire neuron.\nSeveral accelerators have emerged to implement SNNs with this kind of neuron.\nThe ReckON system is one of these that allows both the training and execution\nof a recurrent SNN. The ReckON architecture, implemented on a custom ASIC, can\nbe fully described using a hardware description language. In this work, we\nadapt the Verilog description to implement it on a Xilinx Multiprocessor System\non Chip system (MPSoC). We present the circuits required for the efficient\noperation of the system, and a Python framework to use it on the Pynq ZU\nplatform. We validate the architecture and implementation in two different\nscenarios, and show how the simulated accuracy is preserved with a peak\nperformance of 3.8M events processed per second.", "paper_summary_zh": "隨著人工智慧的崛起，生物神經元模型被用於實現神經網路，讓其在訓練階段後能夠學習特定任務。其中一種此類網路是尖峰神經網路 (SNN)，它依賴於生物神經元的簡化模型，即積分與發射神經元。已經出現了多種加速器，用於使用這種神經元來實現 SNN。ReckON 系統就是其中之一，它允許訓練和執行遞迴 SNN。ReckON 架構實作於客製化 ASIC 上，可以使用硬體描述語言完整描述。在這項工作中，我們調整了 Verilog 描述，以便在 Xilinx 多處理器系統單晶片系統 (MPSoC) 上實現它。我們展示了系統有效運作所需的電路，以及一個 Python 框架，以便在 Pynq ZU 平台上使用它。我們在兩種不同的情境中驗證了架構和實作，並展示了模擬準確度如何以每秒處理 380 萬個事件的峰值效能保留下來。", "author": "Alejandro Linares-Barranco et.al.", "authors": "Alejandro Linares-Barranco, Luciano Prono, Robert Lengenstein, Giacomo Indiveri, Charlotte Frenkel", "id": "2405.12849v1", "paper_url": "http://arxiv.org/abs/2405.12849v1", "repo": "null"}}