{"2406.18333": {"publish_time": "2024-06-26", "title": "Continuous Sign Language Recognition Using Intra-inter Gloss Attention", "paper_summary": "Many continuous sign language recognition (CSLR) studies adopt\ntransformer-based architectures for sequence modeling due to their powerful\ncapacity for capturing global contexts. Nevertheless, vanilla self-attention,\nwhich serves as the core module of the transformer, calculates a weighted\naverage over all time steps; therefore, the local temporal semantics of sign\nvideos may not be fully exploited. In this study, we introduce a novel module\nin sign language recognition studies, called intra-inter gloss attention\nmodule, to leverage the relationships among frames within glosses and the\nsemantic and grammatical dependencies between glosses in the video. In the\nintra-gloss attention module, the video is divided into equally sized chunks\nand a self-attention mechanism is applied within each chunk. This localized\nself-attention significantly reduces complexity and eliminates noise introduced\nby considering non-relative frames. In the inter-gloss attention module, we\nfirst aggregate the chunk-level features within each gloss chunk by average\npooling along the temporal dimension. Subsequently, multi-head self-attention\nis applied to all chunk-level features. Given the non-significance of the\nsigner-environment interaction, we utilize segmentation to remove the\nbackground of the videos. This enables the proposed model to direct its focus\ntoward the signer. Experimental results on the PHOENIX-2014 benchmark dataset\ndemonstrate that our method can effectively extract sign language features in\nan end-to-end manner without any prior knowledge, improve the accuracy of CSLR,\nand achieve the word error rate (WER) of 20.4 on the test set which is a\ncompetitive result compare to the state-of-the-art which uses additional\nsupervisions.", "paper_summary_zh": "許多連續手語識別 (CSLR) 研究採用基於轉換器的架構進行序列建模，因為它們具有捕捉全局脈絡的強大能力。儘管如此，作為轉換器核心模組的香草自注意力會計算所有時間步長的加權平均值；因此，手語影片的局部時間語義可能無法被充分利用。在本研究中，我們在手語識別研究中引入了一個新模組，稱為句內句間光照注意力模組，以利用手勢內的幀之間的關係以及影片中手勢之間的語義和語法依賴性。在句內注意力模組中，影片被分成大小相等的塊，並在每個塊內應用自注意力機制。這種局部自注意力顯著降低了複雜性，並消除了考慮非相關幀所產生的雜訊。在句間注意力模組中，我們首先透過沿時間維度進行平均池化，彙總每個手勢塊內的塊級特徵。隨後，將多頭自注意力應用於所有塊級特徵。鑑於手勢者環境互動的不顯著性，我們利用分割來移除影片的背景。這使提出的模型能夠將其焦點導向手勢者。PHOENIX-2014 基準資料集上的實驗結果表明，我們的方法能夠在端到端的方式中有效地提取手語特徵，而無需任何先驗知識，提高 CSLR 的準確性，並在測試集上實現 20.4 的字元錯誤率 (WER)，這是一個與使用額外監督的最新技術相比具有競爭力的結果。", "author": "Hossein Ranjbar et.al.", "authors": "Hossein Ranjbar, Alireza Taheri", "id": "2406.18333v1", "paper_url": "http://arxiv.org/abs/2406.18333v1", "repo": "null"}}