{"2407.13945": {"publish_time": "2024-07-18", "title": "FANTAstic SEquences and Where to Find Them: Faithful and Efficient API Call Generation through State-tracked Constrained Decoding and Reranking", "paper_summary": "API call generation is the cornerstone of large language models' tool-using\nability that provides access to the larger world. However, existing supervised\nand in-context learning approaches suffer from high training costs, poor data\nefficiency, and generated API calls that can be unfaithful to the API\ndocumentation and the user's request. To address these limitations, we propose\nan output-side optimization approach called FANTASE. Two of the unique\ncontributions of FANTASE are its State-Tracked Constrained Decoding (SCD) and\nReranking components. SCD dynamically incorporates appropriate API constraints\nin the form of Token Search Trie for efficient and guaranteed generation\nfaithfulness with respect to the API documentation. The Reranking component\nefficiently brings in the supervised signal by leveraging a lightweight model\nas the discriminator to rerank the beam-searched candidate generations of the\nlarge language model. We demonstrate the superior performance of FANTASE in API\ncall generation accuracy, inference efficiency, and context efficiency with\nDSTC8 and API Bank datasets.", "paper_summary_zh": "API 呼叫生成是大型語言模型工具使用能力的基石，可存取更廣大的世界。然而，現有的監督式和情境內學習方法有訓練成本高、資料效率差，以及產生的 API 呼叫可能不符合 API 文件和使用者要求的問題。為了解決這些限制，我們提出了一種稱為 FANTASE 的輸出端最佳化方法。FANTASE 的兩個獨特貢獻是其狀態追蹤約束解碼 (SCD) 和重新排序元件。SCD 以 Token 搜尋 Trie 的形式動態納入適當的 API 約束，以確保產生結果與 API 文件相符，且效率高。重新排序元件透過利用輕量級模型作為判別器，有效地引入監督訊號，以重新排序大型語言模型的波束搜尋候選產生結果。我們在 DSTC8 和 API Bank 資料集上展示了 FANTASE 在 API 呼叫產生準確性、推論效率和情境效率方面的卓越效能。", "author": "Zhuoer Wang et.al.", "authors": "Zhuoer Wang, Leonardo F. R. Ribeiro, Alexandros Papangelis, Rohan Mukherjee, Tzu-Yen Wang, Xinyan Zhao, Arijit Biswas, James Caverlee, Angeliki Metallinou", "id": "2407.13945v1", "paper_url": "http://arxiv.org/abs/2407.13945v1", "repo": "null"}}