{"2502.15334": {"publish_time": "2025-02-21", "title": "Attention Eclipse: Manipulating Attention to Bypass LLM Safety-Alignment", "paper_summary": "Recent research has shown that carefully crafted jailbreak inputs can induce\nlarge language models to produce harmful outputs, despite safety measures such\nas alignment. It is important to anticipate the range of potential Jailbreak\nattacks to guide effective defenses and accurate assessment of model safety. In\nthis paper, we present a new approach for generating highly effective Jailbreak\nattacks that manipulate the attention of the model to selectively strengthen or\nweaken attention among different parts of the prompt. By harnessing attention\nloss, we develop more effective jailbreak attacks, that are also transferrable.\nThe attacks amplify the success rate of existing Jailbreak algorithms including\nGCG, AutoDAN, and ReNeLLM, while lowering their generation cost (for example,\nthe amplified GCG attack achieves 91.2% ASR, vs. 67.9% for the original attack\non Llama2-7B/AdvBench, using less than a third of the generation time).", "paper_summary_zh": "最近的研究表明，精心设计的越狱输入可以诱导大型语言模型产生有害输出，尽管有对齐等安全措施。重要的是要预见到潜在越狱攻击的范围，以指导有效的防御和对模型安全的准确评估。在本文中，我们提出了一种生成高效越狱攻击的新方法，该方法操纵模型的注意力，以选择性地加强或削弱提示不同部分之间的注意力。通过利用注意力损失，我们开发出更有效的越狱攻击，这些攻击也是可转移的。这些攻击放大了现有越狱算法的成功率，包括 GCG、AutoDAN 和 ReNeLLM，同时降低了它们的生成成本（例如，放大的 GCG 攻击实现了 91.2% 的 ASR，而原始攻击在 Llama2-7B/AdvBench 上为 67.9%，使用的时间不到生成时间的 1/3）。", "author": "Pedram Zaree et.al.", "authors": "Pedram Zaree, Md Abdullah Al Mamun, Quazi Mishkatul Alam, Yue Dong, Ihsen Alouani, Nael Abu-Ghazaleh", "id": "2502.15334v1", "paper_url": "http://arxiv.org/abs/2502.15334v1", "repo": "null"}}