{"2410.11305": {"publish_time": "2024-10-15", "title": "QSpec: Speculative Decoding with Complementary Quantization Schemes", "paper_summary": "Quantization has been substantially adopted to accelerate inference and\nreduce memory consumption of large language models (LLMs). While\nactivation-weight joint quantization speeds up the inference process through\nlow-precision kernels, we demonstrate that it suffers severe performance\ndegradation on multi-step reasoning tasks, rendering it ineffective. We propose\na novel quantization paradigm called QSPEC, which seamlessly integrates two\ncomplementary quantization schemes for speculative decoding. Leveraging nearly\ncost-free execution switching, QSPEC drafts tokens with low-precision, fast\nactivation-weight quantization, and verifies them with high-precision\nweight-only quantization, effectively combining the strengths of both\nquantization schemes. Compared to high-precision quantization methods, QSPEC\nempirically boosts token generation throughput by up to 1.80x without any\nquality compromise, distinguishing it from other low-precision quantization\napproaches. This enhancement is also consistent across various serving tasks,\nmodel sizes, quantization methods, and batch sizes. Unlike existing speculative\ndecoding techniques, our approach reuses weights and the KV cache, avoiding\nadditional memory overhead. Furthermore, QSPEC offers a plug-and-play advantage\nwithout requiring any training. We believe that QSPEC demonstrates unique\nstrengths for future deployment of high-fidelity quantization schemes,\nparticularly in memory-constrained scenarios (e.g., edge devices).", "paper_summary_zh": "量化技術已被廣泛採用以加速推理並減少大型語言模型 (LLM) 的記憶體消耗。雖然激活權重聯合量化透過低精度核心加速推理過程，但我們證明它在多步驟推理任務中會遭受嚴重的效能降低，導致它無效。我們提出一個稱為 QSPEC 的新量化範例，它無縫整合了兩種互補的量化方案，用於推測性解碼。利用幾乎免費的執行切換，QSPEC 起草具有低精度、快速激活權重量化的代碼，並使用高精度僅權重量化驗證它們，有效地結合了兩種量化方案的優點。與高精度量化方法相比，QSPEC 實證地將代碼產生吞吐量提升了 1.80 倍，且不影響任何品質，使其有別於其他低精度量化方法。這種增強也一致適用於各種服務任務、模型大小、量化方法和批次大小。與現有的推測性解碼技術不同，我們的方法會重複使用權重和 KV 快取，避免額外的記憶體開銷。此外，QSPEC 提供即插即用的優點，無需任何訓練。我們相信 QSPEC 為未來部署高保真量化方案展現了獨特的優勢，特別是在受記憶體限制的場景（例如邊緣裝置）中。", "author": "Juntao Zhao et.al.", "authors": "Juntao Zhao, Wenhao Lu, Sheng Wang, Lingpeng Kong, Chuan Wu", "id": "2410.11305v1", "paper_url": "http://arxiv.org/abs/2410.11305v1", "repo": "null"}}