{"2410.10714": {"publish_time": "2024-10-14", "title": "SeedLM: Compressing LLM Weights into Seeds of Pseudo-Random Generators", "paper_summary": "Large Language Models (LLMs) have transformed natural language processing,\nbut face significant challenges in widespread deployment due to their high\nruntime cost. In this paper, we introduce SeedLM, a novel post-training\ncompression method that uses seeds of pseudo-random generators to encode and\ncompress model weights. Specifically, for each block of weights, we find a seed\nthat is fed into a Linear Feedback Shift Register (LFSR) during inference to\nefficiently generate a random matrix. This matrix is then linearly combined\nwith compressed coefficients to reconstruct the weight block. SeedLM reduces\nmemory access and leverages idle compute cycles during inference, effectively\nspeeding up memory-bound tasks by trading compute for fewer memory accesses.\nUnlike state-of-the-art compression methods that rely on calibration data, our\napproach is data-free and generalizes well across diverse tasks. Our\nexperiments with Llama 3 70B, which is particularly challenging to compress,\nshow that SeedLM achieves significantly better zero-shot accuracy retention at\n4- and 3-bit than state-of-the-art techniques, while maintaining performance\ncomparable to FP16 baselines. Additionally, FPGA-based tests demonstrate that\n4-bit SeedLM, as model size increases to 70B, approaches a 4x speed-up over an\nFP16 Llama 2/3 baseline.", "paper_summary_zh": "大型語言模型 (LLM) 已轉變自然語言處理，但由於其高執行時間成本，在廣泛部署中面臨重大挑戰。在本文中，我們介紹了 SeedLM，這是一種新穎的訓練後壓縮方法，它使用偽隨機生成器的種子對模型權重進行編碼和壓縮。具體來說，對於每個權重塊，我們找到一個種子，在推理期間將其輸入線性反饋移位暫存器 (LFSR) 中，以有效生成隨機矩陣。然後將此矩陣與壓縮係數線性組合以重建權重塊。SeedLM 減少了記憶體存取，並在推理期間利用閒置的運算週期，有效地通過用運算交換更少的記憶體存取來加速受記憶體限制的任務。與依賴校準資料的最新壓縮方法不同，我們的做法是無資料的，並且在各種任務中具有良好的泛化性。我們使用特別難以壓縮的 Llama 3 70B 進行的實驗表明，SeedLM 在 4 位和 3 位時實現了顯著更好的零次學習準確率保留，同時保持與 FP16 基準相當的效能。此外，基於 FPGA 的測試表明，隨著模型大小增加到 70B，4 位元 SeedLM 接近 FP16 Llama 2/3 基準的 4 倍加速。", "author": "Rasoul Shafipour et.al.", "authors": "Rasoul Shafipour, David Harrison, Maxwell Horton, Jeffrey Marker, Houman Bedayat, Sachin Mehta, Mohammad Rastegari, Mahyar Najibi, Saman Naderiparizi", "id": "2410.10714v1", "paper_url": "http://arxiv.org/abs/2410.10714v1", "repo": "null"}}