{"2406.08384": {"publish_time": "2024-06-12", "title": "Diff-A-Riff: Musical Accompaniment Co-creation via Latent Diffusion Models", "paper_summary": "Recent advancements in deep generative models present new opportunities for\nmusic production but also pose challenges, such as high computational demands\nand limited audio quality. Moreover, current systems frequently rely solely on\ntext input and typically focus on producing complete musical pieces, which is\nincompatible with existing workflows in music production. To address these\nissues, we introduce \"Diff-A-Riff,\" a Latent Diffusion Model designed to\ngenerate high-quality instrumental accompaniments adaptable to any musical\ncontext. This model offers control through either audio references, text\nprompts, or both, and produces 48kHz pseudo-stereo audio while significantly\nreducing inference time and memory usage. We demonstrate the model's\ncapabilities through objective metrics and subjective listening tests, with\nextensive examples available on the accompanying website:\nsonycslparis.github.io/diffariff-companion/", "paper_summary_zh": "深度生成模型的最新进展为音乐制作带来了新机遇，但也带来了挑战，例如高计算需求和有限的音频质量。此外，当前系统通常仅依赖文本输入，并且通常专注于制作完整的音乐片段，这与音乐制作中的现有工作流程不兼容。为了解决这些问题，我们引入了“Diff-A-Riff”，这是一种潜在扩散模型，旨在生成高质量的器乐伴奏，可适应任何音乐环境。此模型通过音频参考、文本提示或两者提供控制，并生成 48kHz 的伪立体声音频，同时显著减少推理时间和内存使用。我们通过客观指标和主观听力测试展示了该模型的能力，并提供了广泛的示例，可在随附网站上找到：sonycslparis.github.io/diffariff-companion/", "author": "Javier Nistal et.al.", "authors": "Javier Nistal, Marco Pasini, Cyran Aouameur, Maarten Grachten, Stefan Lattner", "id": "2406.08384v1", "paper_url": "http://arxiv.org/abs/2406.08384v1", "repo": "null"}}