{"2410.11730": {"publish_time": "2024-10-15", "title": "Patch-Based Diffusion Models Beat Whole-Image Models for Mismatched Distribution Inverse Problems", "paper_summary": "Diffusion models have achieved excellent success in solving inverse problems\ndue to their ability to learn strong image priors, but existing approaches\nrequire a large training dataset of images that should come from the same\ndistribution as the test dataset. When the training and test distributions are\nmismatched, artifacts and hallucinations can occur in reconstructed images due\nto the incorrect priors. In this work, we systematically study out of\ndistribution (OOD) problems where a known training distribution is first\nprovided. We first study the setting where only a single measurement obtained\nfrom the unknown test distribution is available. Next we study the setting\nwhere a very small sample of data belonging to the test distribution is\navailable, and our goal is still to reconstruct an image from a measurement\nthat came from the test distribution. In both settings, we use a patch-based\ndiffusion prior that learns the image distribution solely from patches.\nFurthermore, in the first setting, we include a self-supervised loss that helps\nthe network output maintain consistency with the measurement. Extensive\nexperiments show that in both settings, the patch-based method can obtain high\nquality image reconstructions that can outperform whole-image models and can\ncompete with methods that have access to large in-distribution training\ndatasets. Furthermore, we show how whole-image models are prone to memorization\nand overfitting, leading to artifacts in the reconstructions, while a\npatch-based model can resolve these issues.", "paper_summary_zh": "擴散模型由於能夠學習強大的影像先驗，在解決逆向問題上已取得卓越的成功，但現有方法需要一個大型的影像訓練資料集，這些資料集應與測試資料集來自相同的分布。當訓練和測試分布不匹配時，由於先驗不正確，在重建影像中可能會出現人工製品和幻覺。在這項工作中，我們系統性地研究了已知的訓練分布首先提供的分布外 (OOD) 問題。我們首先研究僅從未知測試分布中獲得單一測量的設定。接下來，我們研究屬於測試分布的極小數據樣本的設定，我們的目標仍然是從測試分布中來的測量重建影像。在這兩種設定中，我們使用基於區塊的擴散先驗，僅從區塊中學習影像分布。此外，在第一個設定中，我們包含一個自我監督損失，有助於網路輸出與測量保持一致性。大量的實驗表明，在這兩種設定中，基於區塊的方法可以獲得高品質的影像重建，其效能優於整體影像模型，並且可以與有存取大量分布內訓練資料集的方法競爭。此外，我們展示了整體影像模型容易記憶和過度擬合，導致重建中出現人工製品，而基於區塊的模型可以解決這些問題。", "author": "Jason Hu et.al.", "authors": "Jason Hu, Bowen Song, Jeffrey A. Fessler, Liyue Shen", "id": "2410.11730v1", "paper_url": "http://arxiv.org/abs/2410.11730v1", "repo": "null"}}