{"2406.17251": {"publish_time": "2024-06-25", "title": "TopoGCL: Topological Graph Contrastive Learning", "paper_summary": "Graph contrastive learning (GCL) has recently emerged as a new concept which\nallows for capitalizing on the strengths of graph neural networks (GNNs) to\nlearn rich representations in a wide variety of applications which involve\nabundant unlabeled information. However, existing GCL approaches largely tend\nto overlook the important latent information on higher-order graph\nsubstructures. We address this limitation by introducing the concepts of\ntopological invariance and extended persistence on graphs to GCL. In\nparticular, we propose a new contrastive mode which targets topological\nrepresentations of the two augmented views from the same graph, yielded by\nextracting latent shape properties of the graph at multiple resolutions. Along\nwith the extended topological layer, we introduce a new extended persistence\nsummary, namely, extended persistence landscapes (EPL) and derive its\ntheoretical stability guarantees. Our extensive numerical results on\nbiological, chemical, and social interaction graphs show that the new\nTopological Graph Contrastive Learning (TopoGCL) model delivers significant\nperformance gains in unsupervised graph classification for 11 out of 12\nconsidered datasets and also exhibits robustness under noisy scenarios.", "paper_summary_zh": "圖形對比學習 (GCL) 近期浮現為一種新概念，它利用圖形神經網路 (GNN) 的優勢，在各種應用中學習豐富的表徵，其中包含大量未標記資訊。然而，現有的 GCL 方法大多傾向於忽略高階圖形子結構中重要的潛在資訊。我們透過在 GCL 中引入拓撲不變性和圖形上的擴充持久性概念來解決這個限制。特別是，我們提出一個新的對比模式，它針對來自同一個圖形的兩個擴充檢視的拓撲表徵，藉由提取圖形在多個解析度下的潛在形狀屬性來產生。隨著擴充拓撲層，我們引入一個新的擴充持久性摘要，即擴充持久性景觀 (EPL)，並推導出其理論穩定性保證。我們在生物、化學和社交互動圖形上的廣泛數值結果顯示，新的拓撲圖形對比學習 (TopoGCL) 模型在 12 個考慮中的資料集中有 11 個資料集的無監督圖形分類中提供了顯著的效能提升，並且在有雜訊的情況下也展現出穩健性。", "author": "Yuzhou Chen et.al.", "authors": "Yuzhou Chen, Jose Frias, Yulia R. Gel", "id": "2406.17251v1", "paper_url": "http://arxiv.org/abs/2406.17251v1", "repo": "https://github.com/topogclaaai24/topogcl"}}