{"2502.13566": {"publish_time": "2025-02-19", "title": "Extracting Social Connections from Finnish Karelian Refugee Interviews Using LLMs", "paper_summary": "We performed a zero-shot information extraction study on a historical\ncollection of 89,339 brief Finnish-language interviews of refugee families\nrelocated post-WWII from Finnish Eastern Karelia. Our research objective is\ntwo-fold. First, we aim to extract social organizations and hobbies from the\nfree text of the interviews, separately for each family member. These can act\nas a proxy variable indicating the degree of social integration of refugees in\ntheir new environment. Second, we aim to evaluate several alternative ways to\napproach this task, comparing a number of generative models and a supervised\nlearning approach, to gain a broader insight into the relative merits of these\ndifferent approaches and their applicability in similar studies.\n  We find that the best generative model (GPT-4) is roughly on par with human\nperformance, at an F-score of 88.8%. Interestingly, the best open generative\nmodel (Llama-3-70B-Instruct) reaches almost the same performance, at 87.7%\nF-score, demonstrating that open models are becoming a viable alternative for\nsome practical tasks even on non-English data. Additionally, we test a\nsupervised learning alternative, where we fine-tune a Finnish BERT model\n(FinBERT) using GPT-4 generated training data. By this method, we achieved an\nF-score of 84.1% already with 6K interviews up to an F-score of 86.3% with 30k\ninterviews. Such an approach would be particularly appealing in cases where the\ncomputational resources are limited, or there is a substantial mass of data to\nprocess.", "paper_summary_zh": "<paragraph>我們對 89,339 份芬蘭語簡短訪談的歷史資料進行了零次抽樣資訊萃取研究，這些訪談來自二戰後從芬蘭東卡累利亞遷移的難民家庭。我們的研究目標有兩個面向。首先，我們旨在從訪談的自由文本中萃取出每個家庭成員的社會組織和嗜好。這些資料可以用作代理變數，表示難民在其新環境中的社會整合程度。其次，我們旨在評估處理此任務的幾種替代方法，比較多種生成模型和監督式學習方法，以更廣泛地了解這些不同方法的相對優點及其在類似研究中的適用性。\n我們發現最佳的生成模型 (GPT-4) 與人類表現大致相當，F 分數為 88.8%。有趣的是，最佳的開放生成模型 (Llama-3-70B-Instruct) 達到了幾乎相同的表現，F 分數為 87.7%，這證明了開放模型正成為非英語資料中一些實際任務的可行替代方案。此外，我們測試了一種監督式學習替代方案，其中我們使用 GPT-4 生成的訓練資料微調了芬蘭 BERT 模型 (FinBERT)。透過這種方法，我們僅使用 6K 份訪談就達到了 84.1% 的 F 分數，使用 30k 份訪談則達到了 86.3% 的 F 分數。這種方法在計算資源有限或有大量資料需要處理的情況下特別有吸引力。</paragraph>", "author": "Joonatan Laato et.al.", "authors": "Joonatan Laato, Jenna Kanerva, John Loehr, Virpi Lummaa, Filip Ginter", "id": "2502.13566v1", "paper_url": "http://arxiv.org/abs/2502.13566v1", "repo": "null"}}