{"2407.13218": {"publish_time": "2024-07-18", "title": "LiNR: Model Based Neural Retrieval on GPUs at LinkedIn", "paper_summary": "This paper introduces LiNR, LinkedIn's large-scale, GPU-based retrieval\nsystem. LiNR supports a billion-sized index on GPU models. We discuss our\nexperiences and challenges in creating scalable, differentiable search indexes\nusing TensorFlow and PyTorch at production scale. In LiNR, both items and model\nweights are integrated into the model binary. Viewing index construction as a\nform of model training, we describe scaling our system for large indexes,\nincorporating full scans and efficient filtering. A key focus is on enabling\nattribute-based pre-filtering for exhaustive GPU searches, addressing the\ncommon challenge of post-filtering in KNN searches that often reduces system\nquality. We further provide multi-embedding retrieval algorithms and strategies\nfor tackling cold start issues in retrieval. Our advancements in supporting\nlarger indexes through quantization are also discussed. We believe LiNR\nrepresents one of the industry's first Live-updated model-based retrieval\nindexes. Applied to out-of-network post recommendations on LinkedIn Feed, LiNR\nhas contributed to a 3% relative increase in professional daily active users.\nWe envisage LiNR as a step towards integrating retrieval and ranking into a\nsingle GPU model, simplifying complex infrastructures and enabling end-to-end\noptimization of the entire differentiable infrastructure through gradient\ndescent.", "paper_summary_zh": "本文介绍了 LinkedIn 的大规模基于 GPU 的检索系统 LiNR。LiNR 在 GPU 模型上支持十亿级索引。我们讨论了使用 TensorFlow 和 PyTorch 在生产规模上创建可扩展、可微分搜索索引的经验和挑战。在 LiNR 中，项目和模型权重都集成到了模型二进制文件中。将索引构建视为一种模型训练形式，我们描述了针对大型索引扩展我们的系统，结合了全扫描和高效过滤。一个重点是针对穷举 GPU 搜索启用基于属性的预过滤，解决了 KNN 搜索中常见的后过滤挑战，而后过滤通常会降低系统质量。我们进一步提供了多嵌入检索算法和策略，以解决检索中的冷启动问题。我们还讨论了通过量化支持更大索引的进展。我们相信 LiNR 代表了业界首批基于实时更新模型的检索索引之一。应用于 LinkedIn Feed 上的网络外帖子推荐，LiNR 已为专业日活跃用户增加了 3% 的相对增长。我们设想 LiNR 是将检索和排名集成到单一 GPU 模型中的一步，简化复杂的架构并通过梯度下降实现整个可微分架构的端到端优化。", "author": "Fedor Borisyuk et.al.", "authors": "Fedor Borisyuk, Qingquan Song, Mingzhou Zhou, Ganesh Parameswaran, Madhu Arun, Siva Popuri, Tugrul Bingol, Zhuotao Pei, Kuang-Hsuan Lee, Lu Zheng, Qizhan Shao, Ali Naqvi, Sen Zhou, Aman Gupta", "id": "2407.13218v1", "paper_url": "http://arxiv.org/abs/2407.13218v1", "repo": "null"}}