{"2503.08684": {"publish_time": "2025-03-11", "title": "Perplexity Trap: PLM-Based Retrievers Overrate Low Perplexity Documents", "paper_summary": "Previous studies have found that PLM-based retrieval models exhibit a\npreference for LLM-generated content, assigning higher relevance scores to\nthese documents even when their semantic quality is comparable to human-written\nones. This phenomenon, known as source bias, threatens the sustainable\ndevelopment of the information access ecosystem. However, the underlying causes\nof source bias remain unexplored. In this paper, we explain the process of\ninformation retrieval with a causal graph and discover that PLM-based\nretrievers learn perplexity features for relevance estimation, causing source\nbias by ranking the documents with low perplexity higher. Theoretical analysis\nfurther reveals that the phenomenon stems from the positive correlation between\nthe gradients of the loss functions in language modeling task and retrieval\ntask. Based on the analysis, a causal-inspired inference-time debiasing method\nis proposed, called Causal Diagnosis and Correction (CDC). CDC first diagnoses\nthe bias effect of the perplexity and then separates the bias effect from the\noverall estimated relevance score. Experimental results across three domains\ndemonstrate the superior debiasing effectiveness of CDC, emphasizing the\nvalidity of our proposed explanatory framework. Source codes are available at\nhttps://github.com/WhyDwelledOnAi/Perplexity-Trap.", "paper_summary_zh": "<paragraph>先前的研究發現，基於 PLM 的檢索模型會表現出對 LLM 生成內容的偏好，即使這些文件的語義品質與人工編寫的文件相當，也會給予它們更高的相關性分數。這種現象被稱為來源偏差，威脅著資訊檢索生態系統的可持續發展。然而，來源偏差的根本原因仍未被探討。在本文中，我們用因果圖來解釋資訊檢索的過程，並發現基於 PLM 的檢索器會學習困惑度特徵來估計相關性，透過將低困惑度的文件排在更高的位置而導致來源偏差。理論分析進一步揭示，這種現象源於語言建模任務和檢索任務中損失函數梯度的正相關性。基於此分析，我們提出了一種因果啟發的推理時去偏差方法，稱為因果診斷和校正 (CDC)。CDC 首先診斷困惑度的偏差效應，然後將偏差效應從整體估計的相關性分數中分離出來。跨三個領域的實驗結果證明了 CDC 優越的去偏差效果，強調了我們提出的解釋框架的有效性。原始碼可在 https://github.com/WhyDwelledOnAi/Perplexity-Trap 獲得。</paragraph>\n", "author": "Haoyu Wang et.al.", "authors": "Haoyu Wang, Sunhao Dai, Haiyuan Zhao, Liang Pang, Xiao Zhang, Gang Wang, Zhenhua Dong, Jun Xu, Ji-Rong Wen", "id": "2503.08684v1", "paper_url": "http://arxiv.org/abs/2503.08684v1", "repo": "null"}}