{"2407.02833": {"publish_time": "2024-07-03", "title": "LANE: Logic Alignment of Non-tuning Large Language Models and Online Recommendation Systems for Explainable Reason Generation", "paper_summary": "The explainability of recommendation systems is crucial for enhancing user\ntrust and satisfaction. Leveraging large language models (LLMs) offers new\nopportunities for comprehensive recommendation logic generation. However, in\nexisting related studies, fine-tuning LLM models for recommendation tasks\nincurs high computational costs and alignment issues with existing systems,\nlimiting the application potential of proven proprietary/closed-source LLM\nmodels, such as GPT-4. In this work, our proposed effective strategy LANE\naligns LLMs with online recommendation systems without additional LLMs tuning,\nreducing costs and improving explainability. This innovative approach addresses\nkey challenges in integrating language models with recommendation systems while\nfully utilizing the capabilities of powerful proprietary models. Specifically,\nour strategy operates through several key components: semantic embedding, user\nmulti-preference extraction using zero-shot prompting, semantic alignment, and\nexplainable recommendation generation using Chain of Thought (CoT) prompting.\nBy embedding item titles instead of IDs and utilizing multi-head attention\nmechanisms, our approach aligns the semantic features of user preferences with\nthose of candidate items, ensuring coherent and user-aligned recommendations.\nSufficient experimental results including performance comparison, questionnaire\nvoting, and visualization cases prove that our method can not only ensure\nrecommendation performance, but also provide easy-to-understand and reasonable\nrecommendation logic.", "paper_summary_zh": "推薦系統的可解釋性對於提升使用者信任度和滿意度至關重要。利用大型語言模型 (LLM) 為全面性的推薦邏輯生成提供了新的機會。然而，在現有的相關研究中，針對推薦任務微調 LLM 模型會產生高昂的運算成本，並與現有系統產生對齊問題，限制了已驗證的專有/閉源 LLM 模型（例如 GPT-4）的應用潛力。在本文中，我們提出的有效策略 LANE 將 LLM 與線上推薦系統對齊，無需額外的 LLM 調整，降低成本並提升可解釋性。這種創新的方法解決了將語言模型與推薦系統整合時遇到的關鍵挑戰，同時充分利用強大的專有模型的能力。具體來說，我們的策略透過幾個關鍵組件運作：語義嵌入、使用零次提示提取使用者多重偏好、語義對齊，以及使用思考鏈 (CoT) 提示產生可解釋的推薦。透過嵌入項目標題而非 ID，並利用多頭注意力機制，我們的做法將使用者偏好的語義特徵與候選項目的語義特徵對齊，確保推薦結果前後一致且符合使用者需求。充足的實驗結果，包括效能比較、問卷投票和視覺化案例，證明了我們的模型不僅能確保推薦效能，還能提供易於理解且合理的推薦邏輯。", "author": "Hongke Zhao et.al.", "authors": "Hongke Zhao, Songming Zheng, Likang Wu, Bowen Yu, Jing Wang", "id": "2407.02833v1", "paper_url": "http://arxiv.org/abs/2407.02833v1", "repo": "null"}}