{"2406.07381": {"publish_time": "2024-06-11", "title": "World Models with Hints of Large Language Models for Goal Achieving", "paper_summary": "Reinforcement learning struggles in the face of long-horizon tasks and sparse\ngoals due to the difficulty in manual reward specification. While existing\nmethods address this by adding intrinsic rewards, they may fail to provide\nmeaningful guidance in long-horizon decision-making tasks with large state and\naction spaces, lacking purposeful exploration. Inspired by human cognition, we\npropose a new multi-modal model-based RL approach named Dreaming with Large\nLanguage Models (DLLM). DLLM integrates the proposed hinting subgoals from the\nLLMs into the model rollouts to encourage goal discovery and reaching in\nchallenging tasks. By assigning higher intrinsic rewards to samples that align\nwith the hints outlined by the language model during model rollouts, DLLM\nguides the agent toward meaningful and efficient exploration. Extensive\nexperiments demonstrate that the DLLM outperforms recent methods in various\nchallenging, sparse-reward environments such as HomeGrid, Crafter, and\nMinecraft by 27.7\\%, 21.1\\%, and 9.9\\%, respectively.", "paper_summary_zh": "由於手動獎勵規範的難度，強化學習在面對長時程任務和稀疏目標時會遇到困難。雖然現有方法透過增加內在獎勵來解決此問題，但它們可能無法在具有大量狀態和動作空間的長時程決策任務中提供有意義的指導，缺乏有目的的探索。受到人類認知的啟發，我們提出了一種新的多模式基於模型的 RL 方法，稱為使用大型語言模型的夢想 (DLLM)。DLLM 將 LLM 中提出的提示子目標整合到模型的滾動中，以鼓勵目標的發現和在具有挑戰性的任務中達成目標。透過將較高的內在獎勵分配給與語言模型在模型滾動期間概述的提示一致的樣本，DLLM 引導代理朝向有意義且有效的探索。大量的實驗證明，DLLM 在各種具有挑戰性的稀疏獎勵環境中優於最近的方法，例如 HomeGrid、Crafter 和 Minecraft，分別提高了 27.7%、21.1% 和 9.9%。", "author": "Zeyuan Liu et.al.", "authors": "Zeyuan Liu, Ziyu Huan, Xiyao Wang, Jiafei Lyu, Jian Tao, Xiu Li, Furong Huang, Huazhe Xu", "id": "2406.07381v1", "paper_url": "http://arxiv.org/abs/2406.07381v1", "repo": "null"}}