{"2411.08367": {"publish_time": "2024-11-13", "title": "Surprisingly Popular Voting for Concentric Rank-Order Models", "paper_summary": "An important problem on social information sites is the recovery of ground\ntruth from individual reports when the experts are in the minority. The wisdom\nof the crowd, i.e. the collective opinion of a group of individuals fails in\nsuch a scenario. However, the surprisingly popular (SP)\nalgorithm~\\cite{prelec2017solution} can recover the ground truth even when the\nexperts are in the minority, by asking the individuals to report additional\nprediction reports--their beliefs about the reports of others. Several recent\nworks have extended the surprisingly popular algorithm to an equivalent voting\nrule (SP-voting) to recover the ground truth ranking over a set of $m$\nalternatives. However, we are yet to fully understand when SP-voting can\nrecover the ground truth ranking, and if so, how many samples (votes and\npredictions) it needs. We answer this question by proposing two rank-order\nmodels and analyzing the sample complexity of SP-voting under these models. In\nparticular, we propose concentric mixtures of Mallows and Plackett-Luce models\nwith $G (\\ge 2)$ groups. Our models generalize previously proposed concentric\nmixtures of Mallows models with $2$ groups, and we highlight the importance of\n$G > 2$ groups by identifying three distinct groups (expert, intermediate, and\nnon-expert) from existing datasets. Next, we provide conditions on the\nparameters of the underlying models so that SP-voting can recover ground-truth\nrankings with high probability, and also derive sample complexities under the\nsame. We complement the theoretical results by evaluating SP-voting on\nsimulated and real datasets.", "paper_summary_zh": "<paragraph>在社交資訊網站上，一個重要問題是在專家為少數時，如何從個別報告中恢復基本事實。群眾的智慧，也就是一群個人的集體意見，在這種情況下會失效。然而，令人驚訝地流行的 (SP) 演算法~\\cite{prelec2017solution} 即使在專家為少數時，也能透過要求個人回報其他預測報告，也就是他們對他人報告的看法，來恢復基本事實。最近有許多研究將令人驚訝地流行的演算法擴充到等值的投票規則 (SP-voting)，以恢復一組 $m$ 個替代方案的基本事實排名。然而，我們尚未完全了解 SP-voting 何時可以恢復基本事實排名，如果可以，需要多少樣本（投票和預測）。我們透過提出兩個等級順序模型，並分析在這些模型下 SP-voting 的樣本複雜度，來回答這個問題。特別是，我們提出馬洛斯和普拉契特-魯斯模型的同心混合，其中有 $G (\\ge 2)$ 個群組。我們的模型概括了先前提出的具有 $2$ 個群組的馬洛斯模型的同心混合，並且透過從現有資料集中找出三個不同的群組（專家、中級和非專家），強調了 $G > 2$ 個群組的重要性。接下來，我們提供底層模型參數的條件，以便 SP-voting 可以高機率恢復基本事實排名，並在相同條件下推導出樣本複雜度。我們透過評估模擬和真實資料集上的 SP-voting 來補充理論結果。</paragraph>", "author": "Hadi Hosseini et.al.", "authors": "Hadi Hosseini, Debmalya Mandal, Amrit Puhan", "id": "2411.08367v1", "paper_url": "http://arxiv.org/abs/2411.08367v1", "repo": "null"}}