{"2411.12663": {"publish_time": "2024-11-19", "title": "PoM: Efficient Image and Video Generation with the Polynomial Mixer", "paper_summary": "Diffusion models based on Multi-Head Attention (MHA) have become ubiquitous\nto generate high quality images and videos. However, encoding an image or a\nvideo as a sequence of patches results in costly attention patterns, as the\nrequirements both in terms of memory and compute grow quadratically. To\nalleviate this problem, we propose a drop-in replacement for MHA called the\nPolynomial Mixer (PoM) that has the benefit of encoding the entire sequence\ninto an explicit state. PoM has a linear complexity with respect to the number\nof tokens. This explicit state also allows us to generate frames in a\nsequential fashion, minimizing memory and compute requirement, while still\nbeing able to train in parallel. We show the Polynomial Mixer is a universal\nsequence-to-sequence approximator, just like regular MHA. We adapt several\nDiffusion Transformers (DiT) for generating images and videos with PoM\nreplacing MHA, and we obtain high quality samples while using less\ncomputational resources. The code is available at\nhttps://github.com/davidpicard/HoMM.", "paper_summary_zh": "基於多頭注意力 (MHA) 的擴散模型已廣泛用於產生高品質的影像和影片。然而，將影像或影片編碼成一系列修補程式會導致昂貴的注意力模式，因為記憶體和運算需求會以二次方的速度增長。為了減輕這個問題，我們提出一個 MHA 的替代方案，稱為多項式混合器 (PoM)，它具有將整個序列編碼成明確狀態的優點。PoM 具有與 token 數量成線性的複雜度。這個明確的狀態也允許我們以順序的方式產生畫面，將記憶體和運算需求降到最低，同時仍然能夠並行訓練。我們證明了多項式混合器是一個通用的序列對序列逼近器，就像一般的 MHA 一樣。我們改編了幾個用於產生影像和影片的擴散Transformer (DiT)，並用 PoM 取代 MHA，我們在使用較少運算資源的同時獲得了高品質的樣本。程式碼可在 https://github.com/davidpicard/HoMM 取得。", "author": "David Picard et.al.", "authors": "David Picard, Nicolas Dufour", "id": "2411.12663v1", "paper_url": "http://arxiv.org/abs/2411.12663v1", "repo": "https://github.com/davidpicard/homm"}}