{"2408.01118": {"publish_time": "2024-08-02", "title": "IAI Group at CheckThat! 2024: Transformer Models and Data Augmentation for Checkworthy Claim Detection", "paper_summary": "This paper describes IAI group's participation for automated check-worthiness\nestimation for claims, within the framework of the 2024 CheckThat! Lab \"Task 1:\nCheck-Worthiness Estimation\". The task involves the automated detection of\ncheck-worthy claims in English, Dutch, and Arabic political debates and Twitter\ndata. We utilized various pre-trained generative decoder and encoder\ntransformer models, employing methods such as few-shot chain-of-thought\nreasoning, fine-tuning, data augmentation, and transfer learning from one\nlanguage to another. Despite variable success in terms of performance, our\nmodels achieved notable placements on the organizer's leaderboard: ninth-best\nin English, third-best in Dutch, and the top placement in Arabic, utilizing\nmultilingual datasets for enhancing the generalizability of check-worthiness\ndetection. Despite a significant drop in performance on the unlabeled test\ndataset compared to the development test dataset, our findings contribute to\nthe ongoing efforts in claim detection research, highlighting the challenges\nand potential of language-specific adaptations in claim verification systems.", "paper_summary_zh": "本文描述了 IAI 小組參與 2024 年 CheckThat！實驗室「任務 1：檢核價值評估」中自動化聲明檢核價值評估的過程。此任務涉及自動偵測英文、荷蘭文和阿拉伯文政治辯論和 Twitter 資料中的檢核價值聲明。我們利用了各種預先訓練的生成式解碼器和編碼器Transformer模型，並採用了少樣本思維鏈推理、微調、資料擴充和從一種語言到另一種語言的遷移學習等方法。儘管在效能方面有不同的成功，但我們的模型在組織者的排行榜上取得了顯著的排名：英文第九名、荷蘭文第三名，並利用多語言資料集來增強檢核價值偵測的概括性，在阿拉伯文方面排名第一。儘管在未標記測試資料集上的效能與開發測試資料集相比大幅下降，但我們的研究結果有助於聲明偵測研究的持續努力，並突顯了聲明驗證系統中特定語言適應的挑戰和潛力。", "author": "Peter Røysland Aarnes et.al.", "authors": "Peter Røysland Aarnes, Vinay Setty, Petra Galuščáková", "id": "2408.01118v1", "paper_url": "http://arxiv.org/abs/2408.01118v1", "repo": "null"}}