{"2408.07694": {"publish_time": "2024-08-14", "title": "End-to-end Semantic-centric Video-based Multimodal Affective Computing", "paper_summary": "In the pathway toward Artificial General Intelligence (AGI), understanding\nhuman's affection is essential to enhance machine's cognition abilities. For\nachieving more sensual human-AI interaction, Multimodal Affective Computing\n(MAC) in human-spoken videos has attracted increasing attention. However,\nprevious methods are mainly devoted to designing multimodal fusion algorithms,\nsuffering from two issues: semantic imbalance caused by diverse pre-processing\noperations and semantic mismatch raised by inconsistent affection content\ncontained in different modalities comparing with the multimodal ground truth.\nBesides, the usage of manual features extractors make they fail in building\nend-to-end pipeline for multiple MAC downstream tasks. To address above\nchallenges, we propose a novel end-to-end framework named SemanticMAC to\ncompute multimodal semantic-centric affection for human-spoken videos. We\nfirstly employ pre-trained Transformer model in multimodal data pre-processing\nand design Affective Perceiver module to capture unimodal affective\ninformation. Moreover, we present a semantic-centric approach to unify\nmultimodal representation learning in three ways, including gated feature\ninteraction, multi-task pseudo label generation, and intra-/inter-sample\ncontrastive learning. Finally, SemanticMAC effectively learn specific- and\nshared-semantic representations in the guidance of semantic-centric labels.\nExtensive experimental results demonstrate that our approach surpass the\nstate-of-the-art methods on 7 public datasets in four MAC downstream tasks.", "paper_summary_zh": "在通往人工通用智能 (AGI) 的道路上，理解人类的情感对于增强机器的认知能力至关重要。为了实现更感性的的人机交互，人类语音视频中的多模态情感计算 (MAC) 吸引了越来越多的关注。然而，以前的方法主要致力于设计多模态融合算法，存在两个问题：由不同的预处理操作导致的语义不平衡以及与多模态基本事实相比，不同模态中包含的不一致情感内容导致的语义不匹配。此外，手动特征提取器的使用使得它们无法为多个 MAC 下游任务构建端到端管道。为了解决上述挑战，我们提出了一种名为 SemanticMAC 的新颖端到端框架，用于计算人类语音视频的多模态语义中心情感。我们首先在多模态数据预处理中采用预训练的 Transformer 模型，并设计情感感知器模块来捕获单模态情感信息。此外，我们提出了一种语义中心方法，通过门控特征交互、多任务伪标签生成以及样本内/样本间对比学习这三种方式来统一多模态表示学习。最后，SemanticMAC 在语义中心标签的指导下有效地学习特定和共享语义表示。广泛的实验结果表明，我们的方法在四个 MAC 下游任务的 7 个公共数据集上超越了最先进的方法。", "author": "Ronghao Lin et.al.", "authors": "Ronghao Lin, Ying Zeng, Sijie Mai, Haifeng Hu", "id": "2408.07694v1", "paper_url": "http://arxiv.org/abs/2408.07694v1", "repo": "null"}}