{"2409.06135": {"publish_time": "2024-09-10", "title": "Draw an Audio: Leveraging Multi-Instruction for Video-to-Audio Synthesis", "paper_summary": "Foley is a term commonly used in filmmaking, referring to the addition of\ndaily sound effects to silent films or videos to enhance the auditory\nexperience. Video-to-Audio (V2A), as a particular type of automatic foley task,\npresents inherent challenges related to audio-visual synchronization. These\nchallenges encompass maintaining the content consistency between the input\nvideo and the generated audio, as well as the alignment of temporal and\nloudness properties within the video. To address these issues, we construct a\ncontrollable video-to-audio synthesis model, termed Draw an Audio, which\nsupports multiple input instructions through drawn masks and loudness signals.\nTo ensure content consistency between the synthesized audio and target video,\nwe introduce the Mask-Attention Module (MAM), which employs masked video\ninstruction to enable the model to focus on regions of interest. Additionally,\nwe implement the Time-Loudness Module (TLM), which uses an auxiliary loudness\nsignal to ensure the synthesis of sound that aligns with the video in both\nloudness and temporal dimensions. Furthermore, we have extended a large-scale\nV2A dataset, named VGGSound-Caption, by annotating caption prompts. Extensive\nexperiments on challenging benchmarks across two large-scale V2A datasets\nverify Draw an Audio achieves the state-of-the-art. Project page:\nhttps://yannqi.github.io/Draw-an-Audio/.", "paper_summary_zh": "福利是電影製作中常用的術語，指的是在默片或影片中加入日常音效，以增強聽覺體驗。影片轉音訊 (V2A) 是一種特殊的自動福利任務，在音訊視覺同步方面存在固有的挑戰。這些挑戰包括在輸入影片和產生的音訊之間維持內容一致性，以及影片中時間和響度的屬性對齊。為了解決這些問題，我們構建了一個可控的影片轉音訊合成模型，稱為繪製音訊，它支援透過繪製遮罩和響度訊號提供多重輸入指令。為了確保合成音訊和目標影片之間的內容一致性，我們引入了遮罩注意模組 (MAM)，它採用遮罩影片指令，讓模型能夠專注於感興趣的區域。此外，我們實作了時間響度模組 (TLM)，它使用輔助響度訊號來確保合成音訊在響度和時間維度上與影片對齊。此外，我們透過註解字幕提示，擴充了一個名為 VGGSound-Caption 的大型 V2A 資料集。在兩個大型 V2A 資料集中的具有挑戰性的基準上進行的廣泛實驗驗證，繪製音訊達到了最先進的技術水準。專案頁面：https://yannqi.github.io/Draw-an-Audio/。", "author": "Qi Yang et.al.", "authors": "Qi Yang, Binjie Mao, Zili Wang, Xing Nie, Pengfei Gao, Ying Guo, Cheng Zhen, Pengfei Yan, Shiming Xiang", "id": "2409.06135v1", "paper_url": "http://arxiv.org/abs/2409.06135v1", "repo": "null"}}