{"2408.05097": {"publish_time": "2024-08-09", "title": "Hyperbolic Learning with Multimodal Large Language Models", "paper_summary": "Hyperbolic embeddings have demonstrated their effectiveness in capturing\nmeasures of uncertainty and hierarchical relationships across various\ndeep-learning tasks, including image segmentation and active learning. However,\ntheir application in modern vision-language models (VLMs) has been limited. A\nnotable exception is MERU, which leverages the hierarchical properties of\nhyperbolic space in the CLIP ViT-large model, consisting of hundreds of\nmillions parameters. In our work, we address the challenges of scaling\nmulti-modal hyperbolic models by orders of magnitude in terms of parameters\n(billions) and training complexity using the BLIP-2 architecture. Although\nhyperbolic embeddings offer potential insights into uncertainty not present in\nEuclidean embeddings, our analysis reveals that scaling these models is\nparticularly difficult. We propose a novel training strategy for a hyperbolic\nversion of BLIP-2, which allows to achieve comparable performance to its\nEuclidean counterpart, while maintaining stability throughout the training\nprocess and showing a meaningful indication of uncertainty with each embedding.", "paper_summary_zh": "雙曲嵌入已證明其在捕捉各種深度學習任務中的不確定性和層級關係的測量值（包括影像分割和主動學習）方面有效。然而，它們在現代視覺語言模型 (VLM) 中的應用受到限制。一個值得注意的例外是 MERU，它利用了 CLIP ViT-large 模型中雙曲空間的層級屬性，該模型包含數億個參數。在我們的研究中，我們透過 BLIP-2 架構解決了在參數（數十億）和訓練複雜性方面擴展多模態雙曲模型的挑戰。儘管雙曲嵌入提供了歐幾里得嵌入中不存在的不確定性潛在見解，但我們的分析表明，擴展這些模型特別困難。我們為 BLIP-2 的雙曲版本提出了創新的訓練策略，該策略允許實現與其歐幾里得對應項相當的效能，同時在整個訓練過程中保持穩定性，並顯示每個嵌入的不確定性有意義的指標。", "author": "Paolo Mandica et.al.", "authors": "Paolo Mandica, Luca Franco, Konstantinos Kallidromitis, Suzanne Petryk, Fabio Galasso", "id": "2408.05097v1", "paper_url": "http://arxiv.org/abs/2408.05097v1", "repo": "null"}}