{"2407.18875": {"publish_time": "2024-07-26", "title": "Generative Adversarial Networks for Imputing Sparse Learning Performance", "paper_summary": "Learning performance data, such as correct or incorrect responses to\nquestions in Intelligent Tutoring Systems (ITSs) is crucial for tracking and\nassessing the learners' progress and mastery of knowledge. However, the issue\nof data sparsity, characterized by unexplored questions and missing attempts,\nhampers accurate assessment and the provision of tailored, personalized\ninstruction within ITSs. This paper proposes using the Generative Adversarial\nImputation Networks (GAIN) framework to impute sparse learning performance\ndata, reconstructed into a three-dimensional (3D) tensor representation across\nthe dimensions of learners, questions and attempts. Our customized GAIN-based\nmethod computational process imputes sparse data in a 3D tensor space,\nsignificantly enhanced by convolutional neural networks for its input and\noutput layers. This adaptation also includes the use of a least squares loss\nfunction for optimization and aligns the shapes of the input and output with\nthe dimensions of the questions-attempts matrices along the learners'\ndimension. Through extensive experiments on six datasets from various ITSs,\nincluding AutoTutor, ASSISTments and MATHia, we demonstrate that the GAIN\napproach generally outperforms existing methods such as tensor factorization\nand other generative adversarial network (GAN) based approaches in terms of\nimputation accuracy. This finding enhances comprehensive learning data modeling\nand analytics in AI-based education.", "paper_summary_zh": "學習表現資料，例如智慧型教學系統 (ITS) 中問題的正確或錯誤回應，對於追蹤和評量學生的進度和知識掌握至關重要。然而，資料稀疏的問題，其特徵是未探索的問題和遺漏的嘗試，阻礙了準確的評量和在 ITS 中提供客製化、個人化的教學。本文提出使用生成對抗式填補網路 (GAIN) 架構來填補稀疏的學習表現資料，並將其重建為跨越學生、問題和嘗試維度的三維 (3D) 張量表示。我們客製化的 GAIN 為基礎的方法運算處理在 3D 張量空間中填補稀疏資料，其輸入和輸出層由卷積神經網路大幅強化。此調整也包含使用最小平方損失函數進行最佳化，並將輸入和輸出的形狀與學生的維度沿著問題嘗試矩陣的維度對齊。透過對來自各種 ITS 的六個資料集進行廣泛的實驗，包括 AutoTutor、ASSISTments 和 MATHia，我們證明 GAIN 方法在填補準確性方面通常優於現有方法，例如張量分解和其他基於生成對抗網路 (GAN) 的方法。此發現增強了基於 AI 的教育中的綜合學習資料建模和分析。", "author": "Liang Zhang et.al.", "authors": "Liang Zhang, Mohammed Yeasin, Jionghao Lin, Felix Havugimana, Xiangen Hu", "id": "2407.18875v1", "paper_url": "http://arxiv.org/abs/2407.18875v1", "repo": "null"}}