{"2503.13281": {"publish_time": "2025-03-17", "title": "LLM-Match: An Open-Sourced Patient Matching Model Based on Large Language Models and Retrieval-Augmented Generation", "paper_summary": "Patient matching is the process of linking patients to appropriate clinical\ntrials by accurately identifying and matching their medical records with trial\neligibility criteria. We propose LLM-Match, a novel framework for patient\nmatching leveraging fine-tuned open-source large language models. Our approach\nconsists of four key components. First, a retrieval-augmented generation (RAG)\nmodule extracts relevant patient context from a vast pool of electronic health\nrecords (EHRs). Second, a prompt generation module constructs input prompts by\nintegrating trial eligibility criteria (both inclusion and exclusion criteria),\npatient context, and system instructions. Third, a fine-tuning module with a\nclassification head optimizes the model parameters using structured prompts and\nground-truth labels. Fourth, an evaluation module assesses the fine-tuned\nmodel's performance on the testing datasets. We evaluated LLM-Match on four\nopen datasets - n2c2, SIGIR, TREC 2021, and TREC 2022 - using open-source\nmodels, comparing it against TrialGPT, Zero-Shot, and GPT-4-based closed\nmodels. LLM-Match outperformed all baselines.", "paper_summary_zh": "<paragraph>病人匹配是指透過準確識別病人的病歷並將其與試驗的資格標準進行匹配，從而將病人與合適的臨床試驗聯繫起來的過程。我們提出了 LLM-Match，這是一個利用微調開源大型語言模型進行病人匹配的新穎框架。我們的方法包含四個關鍵組成部分。首先，一個檢索增強生成 (RAG) 模組從大量的電子健康記錄 (EHR) 中提取相關的病人資訊。其次，一個提示生成模組透過整合試驗資格標準（包括納入和排除標準）、病人資訊和系統指令來構建輸入提示。第三，一個帶有分類頭的微調模組使用結構化提示和真實標籤來優化模型參數。第四，一個評估模組評估微調模型在測試數據集上的性能。我們使用開源模型在四個開放數據集（n2c2、SIGIR、TREC 2021 和 TREC 2022）上評估了 LLM-Match，並將其與基於 TrialGPT、Zero-Shot 和 GPT-4 的閉源模型進行了比較。LLM-Match 的表現優於所有基準模型。</paragraph>\n", "author": "Xiaodi Li et.al.", "authors": "Xiaodi Li, Shaika Chowdhury, Chung Il Wi, Maria Vassilaki, Ken Liu, Terence T Sio, Owen Garrick, Young J Juhn, James R Cerhan, Cui Tao, Nansu Zong", "id": "2503.13281v2", "paper_url": "http://arxiv.org/abs/2503.13281v2", "repo": "null"}}