{"2502.04667": {"publish_time": "2025-02-07", "title": "Unveiling the Mechanisms of Explicit CoT Training: How Chain-of-Thought Enhances Reasoning Generalization", "paper_summary": "Training large language models (LLMs) with high-quality Chain-of-Thought\n(CoT) annotations has become a widely adopted strategy due to its significant\nenhancement of reasoning capabilities. To fully comprehend this approach, two\nquestions naturally arise: (Q1) What advantages does training with CoT offer\ncompared to training without CoT? (Q2) If there are advantages, what are the\nunderlying mechanisms of explicit CoT training? Analyzing the advantages and\nmechanisms of CoT training is challenging due to the many factors involved. To\naddress this, we conduct a detailed analysis using clear and controllable data\ndistributions and, for the first time, reveal that CoT training offers the\nfollowing advantages: (1) Training with CoT markedly improves reasoning\ngeneralization, extending it from in-distribution (ID) to both ID and\nout-of-distribution (OOD) scenarios, while also speeding up convergence; (2)\nEven when training with CoT includes a certain range of erroneous reasoning\nsteps, it still enables the model to learn reasoning patterns, leading to\nsystematic generalization. We further explore the underlying mechanisms from a\ncircuit perspective: (1) The data distribution (e.g., ratio $\\lambda$ and\npattern) plays a crucial role in influencing the model's systematic\ngeneralization; (2) CoT training (with two-hop facts) internalizes reasoning\ninto a two-stage generalizing circuit, where the number of stages corresponds\nto the explicit reasoning steps during training. Our findings elucidate the\nmechanisms underlying explicit CoT training and offer critical insights into\ntuning strategies for LLMs to achieve robust generalization.", "paper_summary_zh": "<paragraph>使用高品質思維鏈 (CoT) 標註來訓練大型語言模型 (LLM) 已成為廣泛採用的策略，因為它顯著增強了推理能力。為了充分理解這種方法，自然會產生兩個問題：(Q1) 與沒有 CoT 的訓練相比，使用 CoT 訓練有哪些優點？(Q2) 如果有優點，明確的 CoT 訓練的底層機制是什麼？分析 CoT 訓練的優點和機制具有挑戰性，因為涉及許多因素。為了解決這個問題，我們使用清晰且可控的資料分佈進行詳細分析，並首次揭示 CoT 訓練提供以下優點：(1) 使用 CoT 進行訓練顯著改善推理泛化，將其從分佈內 (ID) 延伸到 ID 和分佈外 (OOD) 場景，同時也加快了收斂速度；(2) 即使使用 CoT 進行訓練包含一定範圍的錯誤推理步驟，它仍然使模型能夠學習推理模式，從而導致系統性泛化。我們進一步從電路角度探討其底層機制：(1) 資料分佈（例如比率 $\\lambda$ 和模式）在影響模型的系統性泛化中扮演著至關重要的角色；(2) CoT 訓練（使用兩跳事實）將推理內化為兩階段泛化電路，其中階段數對應於訓練期間的明確推理步驟。我們的發現闡明了明確 CoT 訓練的底層機制，並為調整 LLM 的策略提供了關鍵見解，以實現強大的泛化。</paragraph>", "author": "Xinhao Yao et.al.", "authors": "Xinhao Yao, Ruifeng Ren, Yun Liao, Yong Liu", "id": "2502.04667v1", "paper_url": "http://arxiv.org/abs/2502.04667v1", "repo": "null"}}