{"2405.15444": {"publish_time": "2024-05-24", "title": "HyperInterval: Hypernetwork approach to training weight interval regions in continual learning", "paper_summary": "Recently, a new Continual Learning (CL) paradigm was presented to control\ncatastrophic forgetting, called Interval Continual Learning (InterContiNet),\nwhich relies on enforcing interval constraints on the neural network parameter\nspace. Unfortunately, InterContiNet training is challenging due to the high\ndimensionality of the weight space, making intervals difficult to manage. To\naddress this issue, we introduce HyperInterval, a technique that employs\ninterval arithmetic within the embedding space and utilizes a hypernetwork to\nmap these intervals to the target network parameter space. We train interval\nembeddings for consecutive tasks and train a hypernetwork to transform these\nembeddings into weights of the target network. An embedding for a given task is\ntrained along with the hypernetwork, preserving the response of the target\nnetwork for the previous task embeddings. Interval arithmetic works with a more\nmanageable, lower-dimensional embedding space rather than directly preparing\nintervals in a high-dimensional weight space. Our model allows faster and more\nefficient training. Furthermore, HyperInterval maintains the guarantee of not\nforgetting. At the end of training, we can choose one universal embedding to\nproduce a single network dedicated to all tasks. In such a framework,\nhypernetwork is used only for training and can be seen as a meta-trainer.\nHyperInterval obtains significantly better results than InterContiNet and gives\nSOTA results on several benchmarks.", "paper_summary_zh": "最近，提出了一种新的连续学习 (CL) 范例来控制灾难性遗忘，称为区间连续学习 (InterContiNet)，它依赖于在神经网络参数空间中实施区间约束。不幸的是，由于权重空间的高维性，InterContiNet 训练具有挑战性，这使得区间难以管理。为了解决这个问题，我们引入了 HyperInterval，这是一种在嵌入空间中使用区间算法并利用超网络将这些区间映射到目标网络参数空间的技术。我们对连续任务训练区间嵌入，并训练超网络将这些嵌入转换为目标网络的权重。给定任务的嵌入与超网络一起训练，保留目标网络对先前任务嵌入的响应。区间算法使用更易于管理的低维嵌入空间，而不是直接在高维权重空间中准备区间。我们的模型允许更快、更有效的训练。此外，HyperInterval 保证不遗忘。在训练结束时，我们可以选择一个通用嵌入来生成一个专门用于所有任务的单一网络。在这样的框架中，超网络仅用于训练，可以看作元训练器。HyperInterval 获得明显优于 InterContiNet 的结果，并在多个基准上给出了 SOTA 结果。", "author": "Patryk Krukowski et.al.", "authors": "Patryk Krukowski, Anna Bielawska, Kamil Książek, Paweł Wawrzyński, Paweł Batorski, Przemysław Spurek", "id": "2405.15444v1", "paper_url": "http://arxiv.org/abs/2405.15444v1", "repo": "https://github.com/gmum/hyperinterval"}}