{"2407.05734": {"publish_time": "2024-07-08", "title": "Empirical Study of Symmetrical Reasoning in Conversational Chatbots", "paper_summary": "This work explores the capability of conversational chatbots powered by large\nlanguage models (LLMs), to understand and characterize predicate symmetry, a\ncognitive linguistic function traditionally believed to be an inherent human\ntrait. Leveraging in-context learning (ICL), a paradigm shift enabling chatbots\nto learn new tasks from prompts without re-training, we assess the symmetrical\nreasoning of five chatbots: ChatGPT 4, Huggingface chat AI, Microsoft's Copilot\nAI, LLaMA through Perplexity, and Gemini Advanced. Using the Symmetry Inference\nSentence (SIS) dataset by Tanchip et al. (2020), we compare chatbot responses\nagainst human evaluations to gauge their understanding of predicate symmetry.\nExperiment results reveal varied performance among chatbots, with some\napproaching human-like reasoning capabilities. Gemini, for example, reaches a\ncorrelation of 0.85 with human scores, while providing a sounding justification\nfor each symmetry evaluation. This study underscores the potential and\nlimitations of LLMs in mirroring complex cognitive processes as symmetrical\nreasoning.", "paper_summary_zh": "本研究探討由大型語言模型 (LLM) 驅動的對話式聊天機器人的能力，了解和描述謂詞對稱性，這是一種傳統上被認為是人類固有特質的認知語言功能。利用情境學習 (ICL) 的典範轉移，聊天機器人能夠從提示中學習新任務而無需重新訓練，我們評估了五個聊天機器人的對稱推理：ChatGPT 4、Huggingface 聊天 AI、Microsoft 的 Copilot AI、通過 Perplexity 的 LLaMA 和 Gemini Advanced。使用 Tanchip 等人 (2020) 的對稱推理句子 (SIS) 資料集，我們將聊天機器人的回應與人類評估進行比較，以評估他們對謂詞對稱性的理解。實驗結果顯示聊天機器人之間的表現差異很大，有些接近人類的推理能力。例如，Gemini 與人類分數相關性達到 0.85，同時為每個對稱評估提供合理的理由。這項研究強調了 LLM 在鏡像對稱推理等複雜認知過程中潛力和局限性。", "author": "Daniela N. Rim et.al.", "authors": "Daniela N. Rim, Heeyoul Choi", "id": "2407.05734v1", "paper_url": "http://arxiv.org/abs/2407.05734v1", "repo": "null"}}