{"2501.08958": {"publish_time": "2025-01-15", "title": "Kolmogorov-Arnold Networks for Time Series Granger Causality Inference", "paper_summary": "We introduce Granger Causality Kolmogorov-Arnold Networks (GCKAN), an\ninnovative architecture that extends the recently proposed Kolmogorov-Arnold\nNetworks (KAN) to the domain of causal inference. By extracting base weights\nfrom KAN layers and incorporating the sparsity-inducing penalty along with\nridge regularization, GCKAN infers the Granger causality from time series while\nenabling automatic time lag selection. Additionally, we propose an algorithm\nleveraging time-reversed Granger causality to enhance inference accuracy. The\nalgorithm compares prediction and sparse-inducing losses derived from the\noriginal and time-reversed series, automatically selecting the casual\nrelationship with the higher score or integrating the results to mitigate\nspurious connectivities. Comprehensive experiments conducted on Lorenz-96, gene\nregulatory networks, fMRI BOLD signals, and VAR datasets demonstrate that the\nproposed model achieves competitive performance to state-of-the-art methods in\ninferring Granger causality from nonlinear, high-dimensional, and\nlimited-sample time series.", "paper_summary_zh": "我們介紹 Granger 因果關係 Kolmogorov-Arnold 網路 (GCKAN)，這是一種創新的架構，將最近提出的 Kolmogorov-Arnold 網路 (KAN) 延伸到因果推論的領域。透過從 KAN 層中提取基礎權重並結合稀疏性誘導懲罰以及嶺回歸，GCKAN 從時間序列中推斷 Granger 因果關係，同時啟用自動時間滯後選擇。此外，我們提出一個演算法，利用時間反轉 Granger 因果關係來增強推論準確性。該演算法比較從原始時間序列和時間反轉時間序列中衍生的預測和稀疏性誘導損失，自動選擇具有較高分數的因果關係或整合結果以減輕虛假連通性。在 Lorenz-96、基因調控網路、fMRI BOLD 訊號和 VAR 資料集上進行的全面實驗證明，所提出的模型在從非線性、高維和有限樣本時間序列中推斷 Granger 因果關係方面，可達到與最先進方法相媲美的效能。", "author": "Meiliang Liu et.al.", "authors": "Meiliang Liu, Yunfang Xu, Zijin Li, Zhengye Si, Xiaoxiao Yang, Xinyue Yang, Zhiwen Zhao", "id": "2501.08958v1", "paper_url": "http://arxiv.org/abs/2501.08958v1", "repo": "null"}}