{"2407.21647": {"publish_time": "2024-07-31", "title": "Human interaction classifier for LLM based chatbot", "paper_summary": "This study investigates different approaches to classify human interactions\nin an artificial intelligence-based environment, specifically for Applus+\nIDIADA's intelligent agent AIDA. The main objective is to develop a classifier\nthat accurately identifies the type of interaction received (Conversation,\nServices, or Document Translation) to direct requests to the appropriate\nchannel and provide a more specialized and efficient service. Various models\nare compared, including LLM-based classifiers, KNN using Titan and Cohere\nembeddings, SVM, and artificial neural networks. Results show that SVM and ANN\nmodels with Cohere embeddings achieve the best overall performance, with\nsuperior F1 scores and faster execution times compared to LLM-based approaches.\nThe study concludes that the SVM model with Cohere embeddings is the most\nsuitable option for classifying human interactions in the AIDA environment,\noffering an optimal balance between accuracy and computational efficiency.", "paper_summary_zh": "本研究探討了在基於人工智慧的環境中對人類互動進行分類的不同方法，特別是針對 Applus+ IDIADA 的智慧代理人 AIDA。主要目標是開發一個分類器，能精確識別接收到的互動類型（對話、服務或文件翻譯），以將請求導向適當的管道，並提供更專業且有效率的服務。比較了各種模型，包括基於 LLM 的分類器、使用 Titan 和 Cohere 內嵌的 KNN、SVM 和人工神經網路。結果顯示，採用 Cohere 內嵌的 SVM 和 ANN 模型可達成最佳整體效能，與基於 LLM 的方法相比，具有優異的 F1 分數和更快的執行時間。研究結論是，採用 Cohere 內嵌的 SVM 模型最適合在 AIDA 環境中對人類互動進行分類，在準確度和運算效率之間取得最佳平衡。", "author": "Diego Martín et.al.", "authors": "Diego Martín, Jordi Sanchez, Xavier Vizcaíno", "id": "2407.21647v1", "paper_url": "http://arxiv.org/abs/2407.21647v1", "repo": "null"}}