{"2412.17346": {"publish_time": "2024-12-23", "title": "FFA Sora, video generation as fundus fluorescein angiography simulator", "paper_summary": "Fundus fluorescein angiography (FFA) is critical for diagnosing retinal\nvascular diseases, but beginners often struggle with image interpretation. This\nstudy develops FFA Sora, a text-to-video model that converts FFA reports into\ndynamic videos via a Wavelet-Flow Variational Autoencoder (WF-VAE) and a\ndiffusion transformer (DiT). Trained on an anonymized dataset, FFA Sora\naccurately simulates disease features from the input text, as confirmed by\nobjective metrics: Frechet Video Distance (FVD) = 329.78, Learned Perceptual\nImage Patch Similarity (LPIPS) = 0.48, and Visual-question-answering Score\n(VQAScore) = 0.61. Specific evaluations showed acceptable alignment between the\ngenerated videos and textual prompts, with BERTScore of 0.35. Additionally, the\nmodel demonstrated strong privacy-preserving performance in retrieval\nevaluations, achieving an average Recall@K of 0.073. Human assessments\nindicated satisfactory visual quality, with an average score of 1.570(scale: 1\n= best, 5 = worst). This model addresses privacy concerns associated with\nsharing large-scale FFA data and enhances medical education.", "paper_summary_zh": "眼底螢光血管攝影 (FFA) 對診斷視網膜血管疾病至關重要，但初學者常常難以解讀影像。本研究開發出 FFA Sora，一個文字轉影片模型，可透過小波流變動自編碼器 (WF-VAE) 和擴散轉換器 (DiT) 將 FFA 報告轉換成動態影片。FFA Sora 在匿名資料集上訓練，能準確模擬輸入文字中的疾病特徵，並由客觀指標證實：Fréchet 影片距離 (FVD) = 329.78、學習知覺影像區塊相似度 (LPIPS) = 0.48 和視覺問答分數 (VQAScore) = 0.61。特定評估顯示產生的影片和文字提示之間有可接受的一致性，BERTScore 為 0.35。此外，該模型在檢索評估中展現出強大的隱私保護效能，平均 Recall@K 達到 0.073。人類評估顯示令人滿意的視覺品質，平均分數為 1.570（量表：1 = 最佳，5 = 最差）。此模型解決了與分享大規模 FFA 資料相關的隱私疑慮，並增進醫學教育。", "author": "Xinyuan Wu et.al.", "authors": "Xinyuan Wu, Lili Wang, Ruoyu Chen, Bowen Liu, Weiyi Zhang, Xi Yang, Yifan Feng, Mingguang He, Danli Shi", "id": "2412.17346v1", "paper_url": "http://arxiv.org/abs/2412.17346v1", "repo": "null"}}