{"2405.03869": {"publish_time": "2024-05-06", "title": "Outlier Gradient Analysis: Efficiently Improving Deep Learning Model Performance via Hessian-Free Influence Functions", "paper_summary": "Influence functions offer a robust framework for assessing the impact of each\ntraining data sample on model predictions, serving as a prominent tool in\ndata-centric learning. Despite their widespread use in various tasks, the\nstrong convexity assumption on the model and the computational cost associated\nwith calculating the inverse of the Hessian matrix pose constraints,\nparticularly when analyzing large deep models. This paper focuses on a\nclassical data-centric scenario--trimming detrimental samples--and addresses\nboth challenges within a unified framework. Specifically, we establish an\nequivalence transformation between identifying detrimental training samples via\ninfluence functions and outlier gradient detection. This transformation not\nonly presents a straightforward and Hessian-free formulation but also provides\nprofound insights into the role of the gradient in sample impact. Moreover, it\nrelaxes the convexity assumption of influence functions, extending their\napplicability to non-convex deep models. Through systematic empirical\nevaluations, we first validate the correctness of our proposed outlier gradient\nanalysis on synthetic datasets and then demonstrate its effectiveness in\ndetecting mislabeled samples in vision models, selecting data samples for\nimproving performance of transformer models for natural language processing,\nand identifying influential samples for fine-tuned Large Language Models.", "paper_summary_zh": "影響函數提供了一個強大的架構，用於評估每個訓練資料範例對模型預測的影響，並作為資料中心學習中的重要工具。儘管它們廣泛用於各種任務，但模型的強凸性假設和與計算 Hessian 矩陣的逆相關的計算成本會造成限制，特別是在分析大型深度模型時。本文重點關注一個經典的資料中心場景——修剪有害範例——並在一個統一的架構中解決這兩個挑戰。具體來說，我們建立了透過影響函數和異常值梯度偵測來識別有害訓練範例之間的等價轉換。此轉換不僅呈現了一個直接且無 Hessian 的公式，還深入了解了梯度在範例影響中的角色。此外，它放寬了影響函數的凸性假設，將其適用性擴展到非凸深度模型。透過系統性的經驗評估，我們首先驗證了我們提出的異常值梯度分析在合成資料集上的正確性，然後證明了其在偵測視覺模型中的標籤錯誤範例、選擇資料範例以改善自然語言處理的 Transformer 模型效能，以及識別微調的大型語言模型中的影響力範例方面的有效性。", "author": "Anshuman Chhabra et.al.", "authors": "Anshuman Chhabra, Bo Li, Jian Chen, Prasant Mohapatra, Hongfu Liu", "id": "2405.03869v1", "paper_url": "http://arxiv.org/abs/2405.03869v1", "repo": "null"}}