{"2409.18374": {"publish_time": "2024-09-27", "title": "Adaptive Learning of the Latent Space of Wasserstein Generative Adversarial Networks", "paper_summary": "Generative models based on latent variables, such as generative adversarial\nnetworks (GANs) and variational auto-encoders (VAEs), have gained lots of\ninterests due to their impressive performance in many fields. However, many\ndata such as natural images usually do not populate the ambient Euclidean space\nbut instead reside in a lower-dimensional manifold. Thus an inappropriate\nchoice of the latent dimension fails to uncover the structure of the data,\npossibly resulting in mismatch of latent representations and poor generative\nqualities. Towards addressing these problems, we propose a novel framework\ncalled the latent Wasserstein GAN (LWGAN) that fuses the Wasserstein\nauto-encoder and the Wasserstein GAN so that the intrinsic dimension of the\ndata manifold can be adaptively learned by a modified informative latent\ndistribution. We prove that there exist an encoder network and a generator\nnetwork in such a way that the intrinsic dimension of the learned encoding\ndistribution is equal to the dimension of the data manifold. We theoretically\nestablish that our estimated intrinsic dimension is a consistent estimate of\nthe true dimension of the data manifold. Meanwhile, we provide an upper bound\non the generalization error of LWGAN, implying that we force the synthetic data\ndistribution to be similar to the real data distribution from a population\nperspective. Comprehensive empirical experiments verify our framework and show\nthat LWGAN is able to identify the correct intrinsic dimension under several\nscenarios, and simultaneously generate high-quality synthetic data by sampling\nfrom the learned latent distribution.", "paper_summary_zh": "基於潛在變數的生成模型，例如生成對抗網路 (GAN) 和變異自動編碼器 (VAE)，由於在許多領域的出色表現而廣受關注。然而，許多資料，例如自然影像，通常不會填充環境歐幾里得空間，而是存在於較低維度的流形中。因此，潛在維度的選擇不當，會無法揭露資料的結構，可能導致潛在表示不匹配和生成品質不佳。為了解決這些問題，我們提出一個稱為潛在 Wasserstein GAN (LWGAN) 的新框架，它融合了 Wasserstein 自動編碼器和 Wasserstein GAN，以便資料流形的內在維度可以透過修改後的資訊潛在分布自適應地學習。我們證明了一個編碼器網路和一個生成器網路的存在，使得學習到的編碼分布的內在維度等於資料流形的維度。我們在理論上建立了我們的估計內在維度是資料流形真實維度的相容估計值。同時，我們提供了 LWGAN 泛化誤差的上界，這表示我們強制合成資料分布從族群觀點來看與真實資料分布相似。全面的實證實驗驗證了我們的框架，並表明 LWGAN 能夠在多種情境下識別正確的內在維度，並同時透過從學習到的潛在分布中抽樣來產生高品質的合成資料。", "author": "Yixuan Qiu et.al.", "authors": "Yixuan Qiu, Qingyi Gao, Xiao Wang", "id": "2409.18374v1", "paper_url": "http://arxiv.org/abs/2409.18374v1", "repo": "null"}}