{"2410.23537": {"publish_time": "2024-10-31", "title": "ALISE: Accelerating Large Language Model Serving with Speculative Scheduling", "paper_summary": "Large Language Models (LLMs) represent a revolutionary advancement in the\ncontemporary landscape of artificial general intelligence (AGI). As exemplified\nby ChatGPT, LLM-based applications necessitate minimal response latency and\nmaximal throughput for inference serving. However, due to the unpredictability\nof LLM execution, the first-come-first-serve (FCFS) scheduling policy employed\nby current LLM serving systems suffers from head-of-line (HoL) blocking issues\nand long job response times.\n  In this paper, we propose a new efficient LLM inference serving framework,\nnamed ALISE. The key design paradigm of ALISE is to leverage a novel\nspeculative scheduler by estimating the execution time for each job and\nexploiting such prior knowledge to assign appropriate job priority orders, thus\nminimizing potential queuing delays for heterogeneous workloads. Furthermore,\nto mitigate the memory overhead of the intermediate key-value (KV) cache, we\nemploy a priority-based adaptive memory management protocol and\nquantization-based compression techniques. Evaluations demonstrate that in\ncomparison to the state-of-the-art solution vLLM, ALISE improves the throughput\nof inference serving by up to 1.8x and 2.1x under the same latency constraint\non the Alpaca and ShareGPT datasets, respectively.", "paper_summary_zh": "大型語言模型 (LLM) 代表了當代人工通用智能 (AGI) 領域的一場革命性進展。以 ChatGPT 為例，基於 LLM 的應用需要最小的回應延遲和最大的推論服務傳輸量。然而，由於 LLM 執行不可預測，當前 LLM 服務系統採用的先到先服務 (FCFS) 排程政策會出現隊頭 (HoL) 阻塞問題和長的作業回應時間。\n在本文中，我們提出一個新的高效 LLM 推論服務架構，名為 ALISE。ALISE 的主要設計範例是利用一個新的推測排程器，透過估計每個作業的執行時間，並利用此類先驗知識來指定適當的作業優先順序，從而最大程度地減少異質工作負載的潛在排隊延遲。此外，為了減輕中間鍵值 (KV) 快取的記憶體開銷，我們採用基於優先順序的自適應記憶體管理協定和基於量化的壓縮技術。評估表明，與最先進的解決方案 vLLM 相比，ALISE 在 Alpaca 和 ShareGPT 資料集上分別在相同的延遲限制下將推論服務的傳輸量提升了 1.8 倍和 2.1 倍。", "author": "Youpeng Zhao et.al.", "authors": "Youpeng Zhao, Jun Wang", "id": "2410.23537v1", "paper_url": "http://arxiv.org/abs/2410.23537v1", "repo": "null"}}