{"2411.10004": {"publish_time": "2024-11-15", "title": "EyeDiff: text-to-image diffusion model improves rare eye disease diagnosis", "paper_summary": "The rising prevalence of vision-threatening retinal diseases poses a\nsignificant burden on the global healthcare systems. Deep learning (DL) offers\na promising solution for automatic disease screening but demands substantial\ndata. Collecting and labeling large volumes of ophthalmic images across various\nmodalities encounters several real-world challenges, especially for rare\ndiseases. Here, we introduce EyeDiff, a text-to-image model designed to\ngenerate multimodal ophthalmic images from natural language prompts and\nevaluate its applicability in diagnosing common and rare diseases. EyeDiff is\ntrained on eight large-scale datasets using the advanced latent diffusion\nmodel, covering 14 ophthalmic image modalities and over 80 ocular diseases, and\nis adapted to ten multi-country external datasets. The generated images\naccurately capture essential lesional characteristics, achieving high alignment\nwith text prompts as evaluated by objective metrics and human experts.\nFurthermore, integrating generated images significantly enhances the accuracy\nof detecting minority classes and rare eye diseases, surpassing traditional\noversampling methods in addressing data imbalance. EyeDiff effectively tackles\nthe issue of data imbalance and insufficiency typically encountered in rare\ndiseases and addresses the challenges of collecting large-scale annotated\nimages, offering a transformative solution to enhance the development of\nexpert-level diseases diagnosis models in ophthalmic field.", "paper_summary_zh": "隨著威脅視力的視網膜疾病盛行率上升，對全球醫療保健系統造成重大負擔。深度學習 (DL) 為自動疾病篩檢提供了一個有希望的解決方案，但需要大量資料。收集和標記各種模式的大量眼科影像會遇到若干實際挑戰，尤其是罕見疾病。在此，我們介紹 EyeDiff，這是一個文字轉影像模型，旨在從自然語言提示中生成多模式眼科影像，並評估其在診斷常見和罕見疾病中的適用性。EyeDiff 使用先進的潛在擴散模型在八個大型資料集上進行訓練，涵蓋 14 種眼科影像模式和超過 80 種眼部疾病，並適應十個多國外部資料集。生成的影像精準捕捉必要的病灶特徵，與由客觀指標和人類專家評估的文字提示高度一致。此外，整合生成的影像顯著增強了偵測少數類別和罕見眼疾的準確性，在解決資料不平衡方面超越了傳統的過度抽樣方法。EyeDiff 有效解決了罕見疾病中通常遇到的資料不平衡和不足問題，並解決了收集大量標註影像的挑戰，提供了一個變革性的解決方案，以增強眼科領域專家級疾病診斷模型的開發。", "author": "Ruoyu Chen et.al.", "authors": "Ruoyu Chen, Weiyi Zhang, Bowen Liu, Xiaolan Chen, Pusheng Xu, Shunming Liu, Mingguang He, Danli Shi", "id": "2411.10004v1", "paper_url": "http://arxiv.org/abs/2411.10004v1", "repo": "null"}}