{"2406.18259": {"publish_time": "2024-06-26", "title": "Detecting Machine-Generated Texts: Not Just \"AI vs Humans\" and Explainability is Complicated", "paper_summary": "As LLMs rapidly advance, increasing concerns arise regarding risks about\nactual authorship of texts we see online and in real world. The task of\ndistinguishing LLM-authored texts is complicated by the nuanced and overlapping\nbehaviors of both machines and humans. In this paper, we challenge the current\npractice of considering LLM-generated text detection a binary classification\ntask of differentiating human from AI. Instead, we introduce a novel ternary\ntext classification scheme, adding an \"undecided\" category for texts that could\nbe attributed to either source, and we show that this new category is crucial\nto understand how to make the detection result more explainable to lay users.\nThis research shifts the paradigm from merely classifying to explaining\nmachine-generated texts, emphasizing need for detectors to provide clear and\nunderstandable explanations to users. Our study involves creating four new\ndatasets comprised of texts from various LLMs and human authors. Based on new\ndatasets, we performed binary classification tests to ascertain the most\neffective SOTA detection methods and identified SOTA LLMs capable of producing\nharder-to-detect texts. We constructed a new dataset of texts generated by two\ntop-performing LLMs and human authors, and asked three human annotators to\nproduce ternary labels with explanation notes. This dataset was used to\ninvestigate how three top-performing SOTA detectors behave in new ternary\nclassification context. Our results highlight why \"undecided\" category is much\nneeded from the viewpoint of explainability. Additionally, we conducted an\nanalysis of explainability of the three best-performing detectors and the\nexplanation notes of the human annotators, revealing insights about the\ncomplexity of explainable detection of machine-generated texts. Finally, we\npropose guidelines for developing future detection systems with improved\nexplanatory power.", "paper_summary_zh": "<paragraph>隨著大型語言模型 (LLM) 快速進步，對於我們在網路上和現實世界中所見文字的實際作者身分，也引發了越來越多的風險疑慮。區分 LLM 撰寫文字的任務，因為機器和人類細微且重疊的行為而變得複雜。在本文中，我們挑戰了將 LLM 生成的文字偵測視為區分人類與 AI 的二元分類任務的現行做法。相反地，我們引進了一種新穎的三元文字分類架構，為可能歸因於任一來源的文字新增了一個「未決定」類別，並且我們證明了這個新類別對於了解如何讓偵測結果對一般使用者更具解釋性至關重要。這項研究將典範從單純分類轉變為解釋機器產生的文字，強調偵測器需要向使用者提供明確且易懂的解釋。我們的研究包括建立四個由來自各種 LLM 和人類作者的文字組成的全新資料集。根據新的資料集，我們執行了二元分類測試，以確定最有效的 SOTA 偵測方法，並找出能夠產生難以偵測文字的 SOTA LLM。我們建構了一個由兩個效能最佳的 LLM 和人類作者產生的文字組成的全新資料集，並請三位人類註解員提供包含解釋註解的三元標籤。這個資料集被用於調查三種效能最佳的 SOTA 偵測器在新三元分類脈絡中的表現。我們的結果強調了為什麼從可解釋性的觀點來看，「未決定」類別非常必要。此外，我們對效能最佳的三種偵測器的可解釋性以及人類註解員的解釋註解進行了分析，揭示了機器產生的文字的可解釋性偵測的複雜性。最後，我們提出了開發具有改進解釋力的未來偵測系統的準則。</paragraph>", "author": "Jiazhou Ji et.al.", "authors": "Jiazhou Ji, Ruizhe Li, Shujun Li, Jie Guo, Weidong Qiu, Zheng Huang, Chiyu Chen, Xiaoyu Jiang, Xinru Lu", "id": "2406.18259v1", "paper_url": "http://arxiv.org/abs/2406.18259v1", "repo": "null"}}