{"2408.11380": {"publish_time": "2024-08-21", "title": "Reflex-Based Open-Vocabulary Navigation without Prior Knowledge Using Omnidirectional Camera and Multiple Vision-Language Models", "paper_summary": "Various robot navigation methods have been developed, but they are mainly\nbased on Simultaneous Localization and Mapping (SLAM), reinforcement learning,\netc., which require prior map construction or learning. In this study, we\nconsider the simplest method that does not require any map construction or\nlearning, and execute open-vocabulary navigation of robots without any prior\nknowledge to do this. We applied an omnidirectional camera and pre-trained\nvision-language models to the robot. The omnidirectional camera provides a\nuniform view of the surroundings, thus eliminating the need for complicated\nexploratory behaviors including trajectory generation. By applying multiple\npre-trained vision-language models to this omnidirectional image and\nincorporating reflective behaviors, we show that navigation becomes simple and\ndoes not require any prior setup. Interesting properties and limitations of our\nmethod are discussed based on experiments with the mobile robot Fetch.", "paper_summary_zh": "已開發出各種機器人導航方法，但它們主要基於同時定位與建圖 (SLAM)、強化學習等，需要事先建構地圖或學習。在本研究中，我們考慮最簡單的方法，不需要任何地圖建構或學習，並執行機器人的開放式詞彙導航，無需任何先驗知識即可執行此操作。我們將全景相機和預先訓練的視覺語言模型應用於機器人。全景相機提供周圍環境的統一視圖，因此無需複雜的探索行為，包括軌跡生成。通過將多個預先訓練的視覺語言模型應用於此全景圖像並結合反射行為，我們表明導航變得簡單，並且不需要任何先前的設置。根據使用移動機器人 Fetch 進行的實驗，討論了我們方法的有趣特性和限制。", "author": "Kento Kawaharazuka et.al.", "authors": "Kento Kawaharazuka, Yoshiki Obinata, Naoaki Kanazawa, Naoto Tsukamoto, Kei Okada, Masayuki Inaba", "id": "2408.11380v1", "paper_url": "http://arxiv.org/abs/2408.11380v1", "repo": "null"}}