{"2410.02631": {"publish_time": "2024-10-03", "title": "Large Language Model for Multi-Domain Translation: Benchmarking and Domain CoT Fine-tuning", "paper_summary": "Achieving consistent high-quality machine translation (MT) across diverse\ndomains remains a significant challenge, primarily due to the limited and\nimbalanced parallel training data available in various domains. While large\nlanguage models (LLMs) have demonstrated impressive general understanding and\ngeneration abilities, their potential in multi-domain MT is under-explored. We\nestablish a comprehensive benchmark for multi-domain translation, featuring 25\nGerman$\\Leftrightarrow$English and 22 Chinese$\\Leftrightarrow$English test sets\nrespectively covering 15 domains. Our evaluation of prominent LLMs reveals a\ndiscernible performance gap against traditional MT systems, highlighting domain\noverfitting and catastrophic forgetting issues after fine-tuning on\ndomain-limited corpora. To mitigate this, we propose a domain Chain of Thought\n(CoT) fine-tuning technique that utilizes the intrinsic multi-domain\nintelligence of LLMs to improve translation performance. This method inspires\nthe LLM to perceive domain information from the source text, which then serves\nas a helpful hint to guide the translation process. Despite being trained on a\nsmall dataset of four domains, our CoT fine-tune approach achieves notable\nenhancements in translation accuracy and domain robustness than traditional\nfine-tuning, as evidenced by an average 1.53 BLEU score increase in over 20\nGerman$\\rightarrow$English distinct out-of-domain tests.", "paper_summary_zh": "在不同的領域中持續獲得高品質的機器翻譯 (MT) 仍是一項重大的挑戰，這主要是因為在不同的領域中，可用的平行訓練資料有限且不平衡。儘管大型語言模型 (LLM) 已展現出令人印象深刻的理解力和生成能力，但其在多領域 MT 中的潛力尚未被充分探索。我們建立了一個全面的多領域翻譯基準，分別包含 25 個德語$\\Leftrightarrow$英語和 22 個中文$\\Leftrightarrow$英語的測試集，涵蓋 15 個領域。我們對著名的 LLM 進行評估，發現與傳統 MT 系統相比，其性能存在明顯差距，這突顯了在特定領域語料庫上微調後，會出現領域過度擬合和災難性遺忘問題。為了減輕這種情況，我們提出了一種基於思考鏈 (CoT) 的領域微調技術，該技術利用了 LLM 內在的多領域智能來改善翻譯性能。此方法啟發 LLM 從原始文本中感知領域信息，然後作為有用的提示來指導翻譯過程。儘管在四個領域的小型數據集上進行訓練，但我們的 CoT 微調方法在翻譯準確性和領域魯棒性方面取得了顯著的提升，這一點在超過 20 個德語$\\rightarrow$英語的不同領域外測試中，平均 BLEU 分數提升了 1.53 個點即可證明。", "author": "Tianxiang Hu et.al.", "authors": "Tianxiang Hu, Pei Zhang, Baosong Yang, Jun Xie, Derek F. Wong, Rui Wang", "id": "2410.02631v1", "paper_url": "http://arxiv.org/abs/2410.02631v1", "repo": "null"}}