{"2408.03837": {"publish_time": "2024-08-07", "title": "WalledEval: A Comprehensive Safety Evaluation Toolkit for Large Language Models", "paper_summary": "WalledEval is a comprehensive AI safety testing toolkit designed to evaluate\nlarge language models (LLMs). It accommodates a diverse range of models,\nincluding both open-weight and API-based ones, and features over 35 safety\nbenchmarks covering areas such as multilingual safety, exaggerated safety, and\nprompt injections. The framework supports both LLM and judge benchmarking, and\nincorporates custom mutators to test safety against various text-style\nmutations such as future tense and paraphrasing. Additionally, WalledEval\nintroduces WalledGuard, a new, small and performant content moderation tool,\nand SGXSTest, a benchmark for assessing exaggerated safety in cultural\ncontexts. We make WalledEval publicly available at\nhttps://github.com/walledai/walledeval", "paper_summary_zh": "WalledEval 是一款全面的 AI 安全測試工具包，旨在評估大型語言模型 (LLM)。它適用於各種模型，包括開放權重和基於 API 的模型，並具有超過 35 個安全基準，涵蓋多語言安全、誇大安全和提示注入等領域。該框架同時支援 LLM 和評審基準測試，並整合自訂變異器，以針對各種文本樣式變異（例如未來式和同義改寫）測試安全性。此外，WalledEval 還引入了 WalledGuard，這是一款全新、小巧且效能良好的內容審核工具，以及 SGXSTest，一個用於評估文化背景中誇大安全的基準。我們在 https://github.com/walledai/walledeval 上公開 WalledEval", "author": "Prannaya Gupta et.al.", "authors": "Prannaya Gupta, Le Qi Yau, Hao Han Low, I-Shiang Lee, Hugo Maximus Lim, Yu Xin Teoh, Jia Hng Koh, Dar Win Liew, Rishabh Bhardwaj, Rajat Bhardwaj, Soujanya Poria", "id": "2408.03837v2", "paper_url": "http://arxiv.org/abs/2408.03837v2", "repo": "https://github.com/walledai/walledeval"}}