{"2410.13776": {"publish_time": "2024-10-17", "title": "Aggregation Artifacts in Subjective Tasks Collapse Large Language Models' Posteriors", "paper_summary": "In-context Learning (ICL) has become the primary method for performing\nnatural language tasks with Large Language Models (LLMs). The knowledge\nacquired during pre-training is crucial for this few-shot capability, providing\nthe model with task priors. However, recent studies have shown that ICL\npredominantly relies on retrieving task priors rather than \"learning\" to\nperform tasks. This limitation is particularly evident in complex subjective\ndomains such as emotion and morality, where priors significantly influence\nposterior predictions. In this work, we examine whether this is the result of\nthe aggregation used in corresponding datasets, where trying to combine\nlow-agreement, disparate annotations might lead to annotation artifacts that\ncreate detrimental noise in the prompt. Moreover, we evaluate the posterior\nbias towards certain annotators by grounding our study in appropriate,\nquantitative measures of LLM priors. Our results indicate that aggregation is a\nconfounding factor in the modeling of subjective tasks, and advocate focusing\non modeling individuals instead. However, aggregation does not explain the\nentire gap between ICL and the state of the art, meaning other factors in such\ntasks also account for the observed phenomena. Finally, by rigorously studying\nannotator-level labels, we find that it is possible for minority annotators to\nboth better align with LLMs and have their perspectives further amplified.", "paper_summary_zh": "語境學習 (ICL) 已成為使用大型語言模型 (LLM) 執行自然語言任務的主要方法。預訓練期間獲得的知識對於這種少次學習的能力至關重要，為模型提供了任務先驗。然而，最近的研究表明，ICL 主要依賴於檢索任務先驗，而不是「學習」執行任務。這種限制在情緒和道德等複雜的主觀領域中尤其明顯，在這些領域中，先驗會顯著影響後驗預測。在這項工作中，我們探討這是否是對應數據集中使用的聚合所導致的結果，其中嘗試結合低一致性、不同的註解可能會導致註解人工製品，在提示中產生有害的雜訊。此外，我們通過在適當的 LLM 先驗定量測量中奠定研究基礎，評估後驗對某些註解者的偏見。我們的結果表明，聚合是主觀任務建模中的混雜因素，並提倡專注於對個人進行建模。然而，聚合並不能解釋 ICL 和最先進技術之間的全部差距，這意味著此類任務中的其他因素也會導致觀察到的現象。最後，通過嚴謹地研究註解者級別的標籤，我們發現少數註解者有可能與 LLM 更好地對齊，並進一步放大他們的觀點。", "author": "Georgios Chochlakis et.al.", "authors": "Georgios Chochlakis, Alexandros Potamianos, Kristina Lerman, Shrikanth Narayanan", "id": "2410.13776v1", "paper_url": "http://arxiv.org/abs/2410.13776v1", "repo": "null"}}