{"2412.02830": {"publish_time": "2024-12-03", "title": "RARE: Retrieval-Augmented Reasoning Enhancement for Large Language Models", "paper_summary": "This work introduces RARE (Retrieval-Augmented Reasoning Enhancement), a\nversatile extension to the mutual reasoning framework (rStar), aimed at\nenhancing reasoning accuracy and factual integrity across large language models\n(LLMs) for complex, knowledge-intensive tasks such as commonsense and medical\nreasoning. RARE incorporates two innovative actions within the Monte Carlo Tree\nSearch (MCTS) framework: A6, which generates search queries based on the\ninitial problem statement, performs information retrieval using those queries,\nand augments reasoning with the retrieved data to formulate the final answer;\nand A7, which leverages information retrieval specifically for generated\nsub-questions and re-answers these sub-questions with the relevant contextual\ninformation. Additionally, a Retrieval-Augmented Factuality Scorer is proposed\nto replace the original discriminator, prioritizing reasoning paths that meet\nhigh standards of factuality. Experimental results with LLaMA 3.1 show that\nRARE enables open-source LLMs to achieve competitive performance with top\nopen-source models like GPT-4 and GPT-4o. This research establishes RARE as a\nscalable solution for improving LLMs in domains where logical coherence and\nfactual integrity are critical.", "paper_summary_zh": "這項工作介紹了 RARE（檢索增強推理強化），這是對相互推理架構 (rStar) 的多功能擴充，旨在增強大型語言模型 (LLM) 在常識和醫學推理等複雜、知識密集型任務的推理準確性和事實完整性。RARE 在蒙地卡羅樹搜尋 (MCTS) 架構中包含兩個創新的動作：A6，它根據初始問題陳述產生搜尋查詢，使用這些查詢執行資訊檢索，並使用檢索到的資料擴充推理以制定最終答案；以及 A7，它特別針對生成的子問題利用資訊檢索，並使用相關的上下文資訊重新回答這些子問題。此外，還提出了檢索增強事實評分器來取代原始的判別器，優先考慮符合高事實標準的推理路徑。與 LLaMA 3.1 的實驗結果顯示，RARE 能讓開源 LLM 達到與 GPT-4 和 GPT-4o 等頂尖開源模型競爭的效能。這項研究將 RARE 建立為一個可擴充的解決方案，用於改善在邏輯連貫性和事實完整性至關重要的領域中的 LLM。", "author": "Hieu Tran et.al.", "authors": "Hieu Tran, Zonghai Yao, Junda Wang, Yifan Zhang, Zhichao Yang, Hong Yu", "id": "2412.02830v1", "paper_url": "http://arxiv.org/abs/2412.02830v1", "repo": "null"}}