{"2409.17012": {"publish_time": "2024-09-25", "title": "AI-Driven Risk-Aware Scheduling for Active Debris Removal Missions", "paper_summary": "The proliferation of debris in Low Earth Orbit (LEO) represents a significant\nthreat to space sustainability and spacecraft safety. Active Debris Removal\n(ADR) has emerged as a promising approach to address this issue, utilising\nOrbital Transfer Vehicles (OTVs) to facilitate debris deorbiting, thereby\nreducing future collision risks. However, ADR missions are substantially\ncomplex, necessitating accurate planning to make the missions economically\nviable and technically effective. Moreover, these servicing missions require a\nhigh level of autonomous capability to plan under evolving orbital conditions\nand changing mission requirements. In this paper, an autonomous\ndecision-planning model based on Deep Reinforcement Learning (DRL) is developed\nto train an OTV to plan optimal debris removal sequencing. It is shown that\nusing the proposed framework, the agent can find optimal mission plans and\nlearn to update the planning autonomously to include risk handling of debris\nwith high collision risk.", "paper_summary_zh": "低地球軌道 (LEO) 中的碎片激增對太空永續性和太空船安全構成重大威脅。主動碎片移除 (ADR) 已成為解決此問題的一種有前景的方法，利用軌道轉移載具 (OTV) 促進碎片脫軌，從而降低未來的碰撞風險。然而，ADR 任務相當複雜，需要準確的規劃才能使任務在經濟上可行且在技術上有效。此外，這些維修任務需要高度的自主能力，以便在不斷變化的軌道條件和變化的任務需求下進行規劃。在本文中，開發了一個基於深度強化學習 (DRL) 的自主決策規劃模型，用於訓練 OTV 規劃最佳的碎片移除順序。結果表明，使用所提出的框架，代理可以找到最佳的任務計畫，並學會自主更新計畫，以納入對高碰撞風險碎片的風險處理。", "author": "Antoine Poupon et.al.", "authors": "Antoine Poupon, Hugo de Rohan Willner, Pierre Nikitits, Adam Abdin", "id": "2409.17012v1", "paper_url": "http://arxiv.org/abs/2409.17012v1", "repo": "null"}}