{"2405.11912": {"publish_time": "2024-05-20", "title": "ARAIDA: Analogical Reasoning-Augmented Interactive Data Annotation", "paper_summary": "Human annotation is a time-consuming task that requires a significant amount\nof effort. To address this issue, interactive data annotation utilizes an\nannotation model to provide suggestions for humans to approve or correct.\nHowever, annotation models trained with limited labeled data are prone to\ngenerating incorrect suggestions, leading to extra human correction effort. To\ntackle this challenge, we propose Araida, an analogical reasoning-based\napproach that enhances automatic annotation accuracy in the interactive data\nannotation setting and reduces the need for human corrections. Araida involves\nan error-aware integration strategy that dynamically coordinates an annotation\nmodel and a k-nearest neighbors (KNN) model, giving more importance to KNN's\npredictions when predictions from the annotation model are deemed inaccurate.\nEmpirical studies demonstrate that Araida is adaptable to different annotation\ntasks and models. On average, it reduces human correction labor by 11.02%\ncompared to vanilla interactive data annotation methods.", "paper_summary_zh": "人工註解是一項耗時的任務，需要大量的精力。為了解決這個問題，互動式資料註解利用註解模型提供人類批准或更正的建議。然而，使用受限標記資料訓練的註解模型容易產生不正確的建議，導致額外的人工更正工作。為了應對這個挑戰，我們提出了 Araida，一種基於類比推理的方法，它增強了互動式資料註解設定中的自動註解準確性，並減少了人工更正的需求。Araida 涉及一個錯誤感知整合策略，它動態地協調一個註解模型和一個 k 最近鄰 (KNN) 模型，當註解模型的預測被認為不準確時，賦予 KNN 的預測更多重要性。實證研究表明，Araida 適用於不同的註解任務和模型。平均而言，與香草互動式資料註解方法相比，它將人工更正工作量減少了 11.02%。", "author": "Chen Huang et.al.", "authors": "Chen Huang, Yiping Jin, Ilija Ilievski, Wenqiang Lei, Jiancheng Lv", "id": "2405.11912v1", "paper_url": "http://arxiv.org/abs/2405.11912v1", "repo": "null"}}