{"2502.15398": {"publish_time": "2025-02-21", "title": "Enhancing Vehicle Make and Model Recognition with 3D Attention Modules", "paper_summary": "Vehicle make and model recognition (VMMR) is a crucial component of the\nIntelligent Transport System, garnering significant attention in recent years.\nVMMR has been widely utilized for detecting suspicious vehicles, monitoring\nurban traffic, and autonomous driving systems. The complexity of VMMR arises\nfrom the subtle visual distinctions among vehicle models and the wide variety\nof classes produced by manufacturers. Convolutional Neural Networks (CNNs), a\nprominent type of deep learning model, have been extensively employed in\nvarious computer vision tasks, including VMMR, yielding remarkable results. As\nVMMR is a fine-grained classification problem, it primarily faces inter-class\nsimilarity and intra-class variation challenges. In this study, we implement an\nattention module to address these challenges and enhance the model's focus on\ncritical areas containing distinguishing features. This module, which does not\nincrease the parameters of the original model, generates three-dimensional\n(3-D) attention weights to refine the feature map. Our proposed model\nintegrates the attention module into two different locations within the middle\nsection of a convolutional model, where the feature maps from these sections\noffer sufficient information about the input frames without being overly\ndetailed or overly coarse. The performance of our proposed model, along with\nstate-of-the-art (SOTA) convolutional and transformer-based models, was\nevaluated using the Stanford Cars dataset. Our proposed model achieved the\nhighest accuracy, 90.69\\%, among the compared models.", "paper_summary_zh": "車輛廠牌和型號辨識 (VMMR) 是智慧運輸系統的重要組成部分，近年來備受關注。VMMR 已廣泛用於偵測可疑車輛、監控市區交通和自動駕駛系統。VMMR 的複雜性源於車輛型號間細微的視覺差異，以及製造商生產的種類繁多。卷積神經網路 (CNN) 是一種著名的深度學習模型類型，已廣泛用於各種電腦視覺任務，包括 VMMR，並取得顯著成果。由於 VMMR 是細粒度分類問題，因此它主要面臨類間相似性和類內差異的挑戰。在本研究中，我們實作了一個注意力模組來解決這些挑戰，並增強模型對包含區別特徵的關鍵區域的關注。此模組不會增加原始模型的參數，會產生三維 (3-D) 注意力權重來改善特徵圖。我們提出的模型將注意力模組整合到卷積模型中間部分的兩個不同位置，這些區段的特徵圖提供了輸入幀的充足資訊，不會過於詳細或過於粗略。我們提出的模型的效能，以及最先進 (SOTA) 的卷積和基於Transformer的模型，使用史丹佛汽車資料集進行評估。我們提出的模型在比較模型中達到最高的準確度，為 90.69%。", "author": "Narges Semiromizadeh et.al.", "authors": "Narges Semiromizadeh, Omid Nejati Manzari, Shahriar B. Shokouhi, Sattar Mirzakuchaki", "id": "2502.15398v1", "paper_url": "http://arxiv.org/abs/2502.15398v1", "repo": "null"}}