{"2412.06774": {"publish_time": "2024-12-09", "title": "Visual Lexicon: Rich Image Features in Language Space", "paper_summary": "We present Visual Lexicon, a novel visual language that encodes rich image\ninformation into the text space of vocabulary tokens while retaining intricate\nvisual details that are often challenging to convey in natural language. Unlike\ntraditional methods that prioritize either high-level semantics (e.g., CLIP) or\npixel-level reconstruction (e.g., VAE), ViLex simultaneously captures rich\nsemantic content and fine visual details, enabling high-quality image\ngeneration and comprehensive visual scene understanding. Through a\nself-supervised learning pipeline, ViLex generates tokens optimized for\nreconstructing input images using a frozen text-to-image (T2I) diffusion model,\npreserving the detailed information necessary for high-fidelity semantic-level\nreconstruction. As an image embedding in the language space, ViLex tokens\nleverage the compositionality of natural languages, allowing them to be used\nindependently as \"text tokens\" or combined with natural language tokens to\nprompt pretrained T2I models with both visual and textual inputs, mirroring how\nwe interact with vision-language models (VLMs). Experiments demonstrate that\nViLex achieves higher fidelity in image reconstruction compared to text\nembeddings--even with a single ViLex token. Moreover, ViLex successfully\nperforms various DreamBooth tasks in a zero-shot, unsupervised manner without\nfine-tuning T2I models. Additionally, ViLex serves as a powerful vision\nencoder, consistently improving vision-language model performance across 15\nbenchmarks relative to a strong SigLIP baseline.", "paper_summary_zh": "我們提出 Visual Lexicon，這是一種新穎的視覺語言，它將豐富的圖像資訊編碼到詞彙符號的文字空間中，同時保留了自然語言中通常難以傳達的複雜視覺細節。與優先考慮高階語義（例如 CLIP）或像素級重建（例如 VAE）的傳統方法不同，ViLex 同時擷取豐富的語義內容和精細的視覺細節，實現高品質的圖像生成和全面的視覺場景理解。透過自監督學習管道，ViLex 產生最佳化符號，用於使用凍結的文字轉圖像 (T2I) 擴散模型重建輸入圖像，保留高保真語義級重建所需的詳細資訊。作為語言空間中的圖像嵌入，ViLex 符號利用自然語言的組合性，允許它們獨立用作「文字符號」，或與自然語言符號結合，以視覺和文字輸入提示預訓練的 T2I 模型，反映我們與視覺語言模型 (VLM) 的互動方式。實驗證明，與文字嵌入相比，ViLex 在圖像重建中實現了更高的保真度，即使只使用一個 ViLex 符號。此外，ViLex 以零次學習、無監督的方式成功執行各種 DreamBooth 任務，而無需微調 T2I 模型。此外，ViLex 是一個強大的視覺編碼器，在 15 個基準測試中，相對於強大的 SigLIP 基準，持續改善視覺語言模型的效能。", "author": "XuDong Wang et.al.", "authors": "XuDong Wang, Xingyi Zhou, Alireza Fathi, Trevor Darrell, Cordelia Schmid", "id": "2412.06774v1", "paper_url": "http://arxiv.org/abs/2412.06774v1", "repo": "null"}}