{"2409.03643": {"publish_time": "2024-09-05", "title": "CDM: A Reliable Metric for Fair and Accurate Formula Recognition Evaluation", "paper_summary": "Formula recognition presents significant challenges due to the complicated\nstructure and varied notation of mathematical expressions. Despite continuous\nadvancements in formula recognition models, the evaluation metrics employed by\nthese models, such as BLEU and Edit Distance, still exhibit notable\nlimitations. They overlook the fact that the same formula has diverse\nrepresentations and is highly sensitive to the distribution of training data,\nthereby causing the unfairness in formula recognition evaluation. To this end,\nwe propose a Character Detection Matching (CDM) metric, ensuring the evaluation\nobjectivity by designing a image-level rather than LaTex-level metric score.\nSpecifically, CDM renders both the model-predicted LaTeX and the ground-truth\nLaTeX formulas into image-formatted formulas, then employs visual feature\nextraction and localization techniques for precise character-level matching,\nincorporating spatial position information. Such a spatially-aware and\ncharacter-matching method offers a more accurate and equitable evaluation\ncompared with previous BLEU and Edit Distance metrics that rely solely on\ntext-based character matching. Experimentally, we evaluated various formula\nrecognition models using CDM, BLEU, and ExpRate metrics. Their results\ndemonstrate that the CDM aligns more closely with human evaluation standards\nand provides a fairer comparison across different models by eliminating\ndiscrepancies caused by diverse formula representations.", "paper_summary_zh": "公式辨識由於數學表達式的複雜結構和多樣符號，因此面臨重大挑戰。儘管公式辨識模型持續進步，這些模型所採用的評估指標，例如 BLEU 和編輯距離，仍存在顯著的限制。它們忽略了同一個公式有多種表示法，且對訓練資料的分配高度敏感，從而導致公式辨識評估的不公平性。為此，我們提出一個字元偵測比對 (CDM) 指標，透過設計一個影像層級而非 LaTex 層級的指標分數，確保評估的客觀性。具體而言，CDM 將模型預測的 LaTeX 和真實的 LaTeX 公式都轉換成影像格式的公式，然後採用視覺特徵萃取和定位技術進行精確的字元層級比對，並納入空間位置資訊。這種具有空間感知和字元比對的方法，與僅依賴於基於文字的字元比對的先前 BLEU 和編輯距離指標相比，提供了更準確和公平的評估。在實驗中，我們使用 CDM、BLEU 和 ExpRate 指標評估了各種公式辨識模型。其結果表明，CDM 與人類評估標準更為一致，並透過消除由不同公式表示法所造成的差異，提供了不同模型之間更公平的比較。", "author": "Bin Wang et.al.", "authors": "Bin Wang, Fan Wu, Linke Ouyang, Zhuangcheng Gu, Rui Zhang, Renqiu Xia, Bo Zhang, Conghui He", "id": "2409.03643v1", "paper_url": "http://arxiv.org/abs/2409.03643v1", "repo": "https://github.com/opendatalab/unimernet"}}