{"2504.10481": {"publish_time": "2025-04-14", "title": "xVerify: Efficient Answer Verifier for Reasoning Model Evaluations", "paper_summary": "With the release of the o1 model by OpenAI, reasoning models adopting slow\nthinking strategies have gradually emerged. As the responses generated by such\nmodels often include complex reasoning, intermediate steps, and\nself-reflection, existing evaluation methods are often inadequate. They\nstruggle to determine whether the LLM output is truly equivalent to the\nreference answer, and also have difficulty identifying and extracting the final\nanswer from long, complex responses. To address this issue, we propose xVerify,\nan efficient answer verifier for reasoning model evaluations. xVerify\ndemonstrates strong capability in equivalence judgment, enabling it to\neffectively determine whether the answers produced by reasoning models are\nequivalent to reference answers across various types of objective questions. To\ntrain and evaluate xVerify, we construct the VAR dataset by collecting\nquestion-answer pairs generated by multiple LLMs across various datasets,\nleveraging multiple reasoning models and challenging evaluation sets designed\nspecifically for reasoning model assessment. A multi-round annotation process\nis employed to ensure label accuracy. Based on the VAR dataset, we train\nmultiple xVerify models of different scales. In evaluation experiments\nconducted on both the test set and generalization set, all xVerify models\nachieve overall F1 scores and accuracy exceeding 95\\%. Notably, the smallest\nvariant, xVerify-0.5B-I, outperforms all evaluation methods except GPT-4o,\nwhile xVerify-3B-Ib surpasses GPT-4o in overall performance. These results\nvalidate the effectiveness and generalizability of xVerify.", "paper_summary_zh": "<paragraph>隨著 OpenAI 推出 o1 模型，採用慢速思考策略的推理模型逐漸興起。由於此類模型產生的回應通常包含複雜的推理、中間步驟和自我反思，現有的評估方法往往不足。它們難以判斷大型語言模型的輸出是否與參考答案真正等效，也難以從冗長而複雜的回應中識別和提取最終答案。為了應對這個問題，我們提出了 xVerify，這是一種用於推理模型評估的高效答案驗證器。xVerify 展現了強大的等效判斷能力，使其能夠有效地判斷推理模型產生的答案在各種類型的客觀題中是否與參考答案等效。為了訓練和評估 xVerify，我們構建了 VAR 數據集，方法是收集多個大型語言模型在各個數據集上生成的問答對，利用多個推理模型和專為推理模型評估而設計的挑戰性評估集。我們採用了多輪標註流程來確保標籤準確性。基於 VAR 數據集，我們訓練了多個不同規模的 xVerify 模型。在測試集和泛化集上進行的評估實驗中，所有 xVerify 模型的整體 F1 分數和準確率都超過了 95%。值得注意的是，最小的變體 xVerify-0.5B-I 的性能優於除 GPT-4o 之外的所有評估方法，而 xVerify-3B-Ib 的整體性能則超越了 GPT-4o。這些結果驗證了 xVerify 的有效性和泛化能力。</paragraph>\n", "author": "Ding Chen et.al.", "authors": "Ding Chen, Qingchen Yu, Pengyuan Wang, Wentao Zhang, Bo Tang, Feiyu Xiong, Xinchi Li, Minchuan Yang, Zhiyu Li", "id": "2504.10481v1", "paper_url": "http://arxiv.org/abs/2504.10481v1", "repo": "null"}}