{"2408.13171": {"publish_time": "2024-08-23", "title": "Lessons in co-creation: the inconvenient truths of inclusive sign language technology development", "paper_summary": "In the era of AI-driven language technologies, there is a growing demand for\nthe participation and leadership of deaf communities in sign language\ntechnology development, often framed as co-creation. This paper, developed\nthrough collaborative and iterative dialogue between the authors with data from\ninformal participant observations, examines the involvement of the European\nUnion of the Deaf in two EU Horizon 2020 projects, EASIER and SignON. These\nprojects aimed to develop mobile translation applications between signed and\nspoken languages, bringing together predominantly hearing, non-signing\ntechnology experts with predominantly hearing sign language academics and\norganizations representing deaf end users in large multi-partner consortia.\nWhile co-creation is sometimes presented as the best or required way to do\nresearch or even as emancipatory, it frequently masks systemic issues of power\nimbalances and tokenism. Drawing from EUD's experiences of these projects, we\nhighlight several inconvenient truths of co-creation, and propose seven lessons\nfor future initiatives: recognizing deaf partners' invisible labour as work,\nmanaging expectations about technologies, cripping co-creation processes,\nexploring alternative methods to mitigate co-creation fatigue, seeking\nintersectional feedback, ensuring co-creation is not just virtue signalling,\nand fostering deaf leadership in AI sign language research. We argue for\nco-creation as a transformative activity that fundamentally alters the status\nquo and levels the playing field. This necessitates increasing the number of\ndeaf researchers and enhancing AI literacy among deaf communities. Without\nthese critical transformative actions, co-creation risks merely paying lip\nservice to deaf communities.", "paper_summary_zh": "在人工智能驅動語言技術的時代，對於聾人社群參與及領導手語科技發展的需求日益增加，這通常被稱為共同創作。本文透過作者之間的協作與反覆對話，以及來自非正式參與者觀察的資料，探討歐洲聾人聯盟參與兩個歐盟地平線 2020 專案，EASIER 和 SignON。這些專案旨在開發手語和口語之間的行動翻譯應用程式，主要結合聽力正常、不會手語的技術專家，以及聽力正常的聾人手語學者和代表眾多合作夥伴聯盟中聾人最終使用者的組織。雖然共同創作有時被認為是進行研究的最佳或必要方式，甚至被視為解放，但它經常掩蓋了系統性的權力失衡和象徵主義問題。我們根據 EUD 對這些專案的經驗，強調了共同創作的幾個不方便的真相，並為未來的倡議提出了七個教訓：承認聾人夥伴的無形勞動是工作、管理對技術的期望、使共同創作過程殘障化、探索減輕共同創作疲勞的替代方法、尋求交叉回饋、確保共同創作不僅僅是美德信號，並促進聾人在 AI 手語研究中的領導地位。我們主張共同創作是一種變革活動，它從根本上改變了現狀並平衡了競爭環境。這需要增加聾人研究人員的數量，並提高聾人社群的 AI 素養。在沒有這些關鍵的變革行動的情況下，共同創作只會淪為對聾人社群的口頭服務。", "author": "Maartje De Meulder et.al.", "authors": "Maartje De Meulder, Davy Van Landuyt, Rehana Omardeen", "id": "2408.13171v1", "paper_url": "http://arxiv.org/abs/2408.13171v1", "repo": "null"}}