{"2501.09126": {"publish_time": "2025-01-15", "title": "Augmenting Human-Annotated Training Data with Large Language Model Generation and Distillation in Open-Response Assessment", "paper_summary": "Large Language Models (LLMs) like GPT-4o can help automate text\nclassification tasks at low cost and scale. However, there are major concerns\nabout the validity and reliability of LLM outputs. By contrast, human coding is\ngenerally more reliable but expensive to procure at scale. In this study, we\npropose a hybrid solution to leverage the strengths of both. We combine\nhuman-coded data and synthetic LLM-produced data to fine-tune a classical\nmachine learning classifier, distilling both into a smaller BERT model. We\nevaluate our method on a human-coded test set as a validity measure for LLM\noutput quality. In three experiments, we systematically vary LLM-generated\nsamples' size, variety, and consistency, informed by best practices in LLM\ntuning. Our findings indicate that augmenting datasets with synthetic samples\nimproves classifier performance, with optimal results achieved at an 80%\nsynthetic to 20% human-coded data ratio. Lower temperature settings of 0.3,\ncorresponding to less variability in LLM generations, produced more stable\nimprovements but also limited model learning from augmented samples. In\ncontrast, higher temperature settings (0.7 and above) introduced greater\nvariability in performance estimates and, at times, lower performance. Hence,\nLLMs may produce more uniform output that classifiers overfit to earlier or\nproduce more diverse output that runs the risk of deteriorating model\nperformance through information irrelevant to the prediction task. Filtering\nout inconsistent synthetic samples did not enhance performance. We conclude\nthat integrating human and LLM-generated data to improve text classification\nmodels in assessment offers a scalable solution that leverages both the\naccuracy of human coding and the variety of LLM outputs.", "paper_summary_zh": "大型語言模型 (LLM) 如 GPT-4o 可以協助自動化文本分類任務，成本低且可擴充。然而，對於 LLM 輸出的有效性和可靠性有很大的疑慮。相比之下，人工編碼通常更可靠，但大規模採購成本高。在本研究中，我們提出一個混合解決方案，以利用兩者的優點。我們結合人工編碼資料和 LLM 產生的合成資料，微調傳統機器學習分類器，將兩者精煉成較小的 BERT 模型。我們使用人工編碼的測試集評估我們的模型，作為 LLM 輸出品質的有效性指標。在三個實驗中，我們系統性地改變 LLM 產生的範例大小、種類和一致性，並根據 LLM 調校的最佳實務來進行。我們的研究結果顯示，使用合成範例擴充資料集可以提升分類器的效能，最佳結果出現在合成資料與人工編碼資料的比例為 80% 比 20% 時。溫度設定較低（0.3），代表 LLM 產生的變異性較低，可以產生較穩定的提升，但也會限制模型從擴充範例中學習。相反地，溫度設定較高（0.7 以上）會造成效能估計的變異性較大，有時效能也會較低。因此，LLM 產生的輸出可能較為一致，導致分類器過度擬合到較早的資料，或產生較多樣化的輸出，有風險會因為與預測任務無關的資訊而降低模型效能。過濾掉不一致的合成範例並未提升效能。我們的結論是，整合人工和 LLM 產生的資料來改善評估中的文本分類模型，提供了一個可擴充的解決方案，同時利用了人工編碼的準確性和 LLM 輸出的多樣性。", "author": "Conrad Borchers et.al.", "authors": "Conrad Borchers, Danielle R. Thomas, Jionghao Lin, Ralph Abboud, Kenneth R. Koedinger", "id": "2501.09126v1", "paper_url": "http://arxiv.org/abs/2501.09126v1", "repo": "null"}}