{"2409.13447": {"publish_time": "2024-09-20", "title": "AQA: Adaptive Question Answering in a Society of LLMs via Contextual Multi-Armed Bandit", "paper_summary": "In question answering (QA), different questions can be effectively addressed\nwith different answering strategies. Some require a simple lookup, while others\nneed complex, multi-step reasoning to be answered adequately. This observation\nmotivates the development of a dynamic method that adaptively selects the most\nsuitable QA strategy for each question, enabling more efficient and effective\nsystems capable of addressing a broader range of question types. To this aim,\nwe build on recent advances in the orchestration of multiple large language\nmodels (LLMs) and formulate adaptive QA as a dynamic orchestration challenge.\nWe define this as a contextual multi-armed bandit problem, where the context is\ndefined by the characteristics of the incoming question and the action space\nconsists of potential communication graph configurations among the LLM agents.\nWe then train a linear upper confidence bound model to learn an optimal mapping\nbetween different question types and their corresponding optimal multi-LLM\ncommunication graph representation. Our experiments show that the proposed\nsolution is viable for adaptive orchestration of a QA system with multiple\nmodules, as it combines the superior performance of more complex strategies\nwhile avoiding their costs when simpler strategies suffice.", "paper_summary_zh": "在問答 (QA) 中，不同的問題可以用不同的回答策略有效地解決。有些問題只需要簡單的查詢，而另一些問題則需要複雜的多步驟推理才能得到充分的回答。這個觀察促使開發一種動態方法，能適應性地為每個問題選擇最合適的 QA 策略，從而實現更高效且有效的系統，能解決更廣泛的類型問題。為此，我們建立在多個大型語言模型 (LLM) 編排的最新進展之上，並將適應性 QA 制定為一個動態編排挑戰。我們將其定義為一個情境多重選擇問題，其中情境由輸入問題的特徵定義，而動作空間由 LLM 代理之間的潛在通信圖形配置組成。然後，我們訓練一個線性上限置信界模型，以學習不同問題類型及其對應的最佳多 LLM 通信圖形表示之間的最佳映射。我們的實驗表明，所提出的解決方案適用於具有多個模組的 QA 系統的適應性編排，因為它結合了更複雜策略的優越效能，同時在較簡單的策略足夠時避免了其成本。", "author": "Mohanna Hoveyda et.al.", "authors": "Mohanna Hoveyda, Arjen P. de Vries, Maarten de Rijke, Harrie Oosterhuis, Faegheh Hasibi", "id": "2409.13447v2", "paper_url": "http://arxiv.org/abs/2409.13447v2", "repo": "null"}}