{"2503.04722": {"publish_time": "2025-03-06", "title": "Enough Coin Flips Can Make LLMs Act Bayesian", "paper_summary": "Large language models (LLMs) exhibit the ability to generalize given few-shot\nexamples in their input prompt, an emergent capability known as in-context\nlearning (ICL). We investigate whether LLMs utilize ICL to perform structured\nreasoning in ways that are consistent with a Bayesian framework or rely on\npattern matching. Using a controlled setting of biased coin flips, we find\nthat: (1) LLMs often possess biased priors, causing initial divergence in\nzero-shot settings, (2) in-context evidence outweighs explicit bias\ninstructions, (3) LLMs broadly follow Bayesian posterior updates, with\ndeviations primarily due to miscalibrated priors rather than flawed updates,\nand (4) attention magnitude has negligible effect on Bayesian inference. With\nsufficient demonstrations of biased coin flips via ICL, LLMs update their\npriors in a Bayesian manner.", "paper_summary_zh": "大型語言模型 (LLM) 展現了在輸入提示中給定少量樣本範例即可泛化的能力，這種新興能力稱為上下文學習 (ICL)。我們研究了 LLM 是否利用 ICL 以與貝氏框架一致的方式執行結構化推理，還是僅僅依賴模式匹配。使用有偏差的擲硬幣的受控設定，我們發現：(1) LLM 通常具有偏差的先驗，導致零樣本設定中的初始差異，(2) 上下文證據的影響大於明確的偏差指令，(3) LLM 大致遵循貝氏後驗更新，偏差主要歸因於先驗校準錯誤，而非更新缺陷，以及 (4) 注意力大小對貝氏推論的影響可忽略不計。透過 ICL 充分展示有偏差的擲硬幣後，LLM 會以貝氏方式更新其先驗。\n", "author": "Ritwik Gupta et.al.", "authors": "Ritwik Gupta, Rodolfo Corona, Jiaxin Ge, Eric Wang, Dan Klein, Trevor Darrell, David M. Chan", "id": "2503.04722v1", "paper_url": "http://arxiv.org/abs/2503.04722v1", "repo": "null"}}