{"2406.02128": {"publish_time": "2024-06-04", "title": "Iteration Head: A Mechanistic Study of Chain-of-Thought", "paper_summary": "Chain-of-Thought (CoT) reasoning is known to improve Large Language Models\nboth empirically and in terms of theoretical approximation power. However, our\nunderstanding of the inner workings and conditions of apparition of CoT\ncapabilities remains limited. This paper helps fill this gap by demonstrating\nhow CoT reasoning emerges in transformers in a controlled and interpretable\nsetting. In particular, we observe the appearance of a specialized attention\nmechanism dedicated to iterative reasoning, which we coined \"iteration heads\".\nWe track both the emergence and the precise working of these iteration heads\ndown to the attention level, and measure the transferability of the CoT skills\nto which they give rise between tasks.", "paper_summary_zh": "鏈式思考 (CoT) 推理已知能改善大型語言模型，這在經驗上和理論近似能力方面皆然。然而，我們對 CoT 能力的內部運作和出現條件的理解仍然有限。本文透過展示 CoT 推理如何在受控且可解釋的設定中出現在 Transformer 中，有助於填補此一缺口。具體來說，我們觀察到一種專門用於反覆推理的注意力機制出現，我們將其稱為「反覆頭」。我們追蹤這些反覆頭的出現和精確運作，直到注意力層級，並衡量 CoT 技能在任務之間的轉移性。", "author": "Vivien Cabannes et.al.", "authors": "Vivien Cabannes, Charles Arnal, Wassim Bouaziz, Alice Yang, Francois Charton, Julia Kempe", "id": "2406.02128v1", "paper_url": "http://arxiv.org/abs/2406.02128v1", "repo": "null"}}