{"2406.06508": {"publish_time": "2024-06-10", "title": "Monkey See, Monkey Do: Harnessing Self-attention in Motion Diffusion for Zero-shot Motion Transfer", "paper_summary": "Given the remarkable results of motion synthesis with diffusion models, a\nnatural question arises: how can we effectively leverage these models for\nmotion editing? Existing diffusion-based motion editing methods overlook the\nprofound potential of the prior embedded within the weights of pre-trained\nmodels, which enables manipulating the latent feature space; hence, they\nprimarily center on handling the motion space. In this work, we explore the\nattention mechanism of pre-trained motion diffusion models. We uncover the\nroles and interactions of attention elements in capturing and representing\nintricate human motion patterns, and carefully integrate these elements to\ntransfer a leader motion to a follower one while maintaining the nuanced\ncharacteristics of the follower, resulting in zero-shot motion transfer.\nEditing features associated with selected motions allows us to confront a\nchallenge observed in prior motion diffusion approaches, which use general\ndirectives (e.g., text, music) for editing, ultimately failing to convey subtle\nnuances effectively. Our work is inspired by how a monkey closely imitates what\nit sees while maintaining its unique motion patterns; hence we call it Monkey\nSee, Monkey Do, and dub it MoMo. Employing our technique enables accomplishing\ntasks such as synthesizing out-of-distribution motions, style transfer, and\nspatial editing. Furthermore, diffusion inversion is seldom employed for\nmotions; as a result, editing efforts focus on generated motions, limiting the\neditability of real ones. MoMo harnesses motion inversion, extending its\napplication to both real and generated motions. Experimental results show the\nadvantage of our approach over the current art. In particular, unlike methods\ntailored for specific applications through training, our approach is applied at\ninference time, requiring no training. Our webpage is at\nhttps://monkeyseedocg.github.io.", "paper_summary_zh": "<paragraph>鉴于扩散模型在运动合成方面取得了显著成果，一个自然而然的问题出现了：我们如何有效地利用这些模型进行运动编辑？现有的基于扩散的运动编辑方法忽略了预训练模型权重中嵌入的先验的巨大潜力，而这使得操纵潜在特征空间成为可能；因此，它们主要集中于处理运动空间。在这项工作中，我们探索了预训练运动扩散模型的注意力机制。我们揭示了注意力元素在捕捉和表示复杂的人类运动模式中的作用和交互，并仔细整合这些元素，将一个引导者的运动转移给一个跟随者，同时保持跟随者的细微特征，从而实现零次运动转移。编辑与所选动作相关的特征使我们能够应对先前运动扩散方法中观察到的一个挑战，该方法使用一般指令（例如，文本、音乐）进行编辑，最终无法有效传达微妙的细微差别。我们的工作灵感来自于猴子在保持其独特运动模式的同时密切模仿它所看到的东西；因此，我们称之为 Monkey See，Monkey Do，并称之为 MoMo。采用我们的技术可以完成诸如合成分布外运动、风格迁移和空间编辑等任务。此外，扩散反演很少用于运动；因此，编辑工作集中在生成的运动上，限制了真实运动的可编辑性。MoMo 利用运动反演，将其应用扩展到真实运动和生成运动。实验结果表明了我们的方法优于当前技术。特别是，与通过训练针对特定应用程序的方法不同，我们的方法应用于推理时间，不需要训练。我们的网页位于 https://monkeyseedocg.github.io。</paragraph>", "author": "Sigal Raab et.al.", "authors": "Sigal Raab, Inbar Gat, Nathan Sala, Guy Tevet, Rotem Shalev-Arkushin, Ohad Fried, Amit H. Bermano, Daniel Cohen-Or", "id": "2406.06508v1", "paper_url": "http://arxiv.org/abs/2406.06508v1", "repo": "https://github.com/monkeyseedocg/momo-code"}}