{"2407.10820": {"publish_time": "2024-07-15", "title": "Enabling MCTS Explainability for Sequential Planning Through Computation Tree Logic", "paper_summary": "Monte Carlo tree search (MCTS) is one of the most capable online search\nalgorithms for sequential planning tasks, with significant applications in\nareas such as resource allocation and transit planning. Despite its strong\nperformance in real-world deployment, the inherent complexity of MCTS makes it\nchallenging to understand for users without technical background. This paper\nconsiders the use of MCTS in transportation routing services, where the\nalgorithm is integrated to develop optimized route plans. These plans are\nrequired to meet a range of constraints and requirements simultaneously,\nfurther complicating the task of explaining the algorithm's operation in\nreal-world contexts. To address this critical research gap, we introduce a\nnovel computation tree logic-based explainer for MCTS. Our framework begins by\ntaking user-defined requirements and translating them into rigorous logic\nspecifications through the use of language templates. Then, our explainer\nincorporates a logic verification and quantitative evaluation module that\nvalidates the states and actions traversed by the MCTS algorithm. The outcomes\nof this analysis are then rendered into human-readable descriptive text using a\nsecond set of language templates. The user satisfaction of our approach was\nassessed through a survey with 82 participants. The results indicated that our\nexplanatory approach significantly outperforms other baselines in user\npreference.", "paper_summary_zh": "蒙特卡羅樹狀搜尋 (MCTS) 是用於順序規劃任務的最有能力的線上搜尋演算法之一，在資源配置和運輸規劃等領域有重要的應用。儘管在實際部署中表現強勁，但 MCTS 的內在複雜性使得沒有技術背景的使用者難以理解。本文考慮在運輸路線服務中使用 MCTS，其中演算法被整合來開發最佳化的路線計畫。這些計畫需要同時滿足一系列限制和需求，進一步複雜化了在實際情況中解釋演算法運作的工作。為了解決這個重要的研究差距，我們引入了一個基於新穎運算樹狀邏輯的 MCTS 解釋器。我們的架構首先採用使用者定義的需求，並透過使用語言範本將它們轉換為嚴謹的邏輯規範。然後，我們的解釋器結合了邏輯驗證和定量評估模組，驗證了 MCTS 演算法所遍歷的狀態和動作。接著將此分析的結果使用第二組語言範本轉換成人類可讀的描述性文字。我們的作法透過一項有 82 位參與者的調查來評估使用者滿意度。結果顯示，我們的解釋方法在使用者偏好方面顯著優於其他基準。", "author": "Ziyan An et.al.", "authors": "Ziyan An, Hendrik Baier, Abhishek Dubey, Ayan Mukhopadhyay, Meiyi Ma", "id": "2407.10820v1", "paper_url": "http://arxiv.org/abs/2407.10820v1", "repo": "null"}}