{"2409.17745": {"publish_time": "2024-09-26", "title": "Few-shot Pairwise Rank Prompting: An Effective Non-Parametric Retrieval Model", "paper_summary": "A supervised ranking model, despite its advantage of being effective, usually\ninvolves complex processing - typically multiple stages of task-specific\npre-training and fine-tuning. This has motivated researchers to explore simpler\npipelines leveraging large language models (LLMs) that are capable of working\nin a zero-shot manner. However, since zero-shot inference does not make use of\na training set of pairs of queries and their relevant documents, its\nperformance is mostly worse than that of supervised models, which are trained\non such example pairs. Motivated by the existing findings that training\nexamples generally improve zero-shot performance, in our work, we explore if\nthis also applies to ranking models. More specifically, given a query and a\npair of documents, the preference prediction task is improved by augmenting\nexamples of preferences for similar queries from a training set. Our proposed\npairwise few-shot ranker demonstrates consistent improvements over the\nzero-shot baseline on both in-domain (TREC DL) and out-domain (BEIR subset)\nretrieval benchmarks. Our method also achieves a close performance to that of a\nsupervised model without requiring any complex training pipeline.", "paper_summary_zh": "監督式排名模型儘管具有有效率的優勢，通常涉及複雜的處理程序，通常是任務特定預訓練和微調的多個階段。這促使研究人員探索利用大型語言模型 (LLM) 的更簡單管道，這些模型能夠以零次學習的方式工作。然而，由於零次學習推理並未利用查詢對及其相關文件訓練集，因此其效能大多比監督式模型差，而監督式模型是在此類範例對上訓練的。受現有發現的激勵，即訓練範例通常會改善零次學習效能，在我們的研究中，我們探討這是否也適用於排名模型。更具體地說，給定一個查詢和一對文件，偏好預測任務會透過增加訓練集類似查詢的偏好範例而得到改善。我們提出的成對少次學習排名器在領域內 (TREC DL) 和領域外 (BEIR 子集) 檢索基準上都展現出比零次學習基準線更一致的改善。我們的模型也達成與監督式模型相當的效能，而無需任何複雜的訓練管道。", "author": "Nilanjan Sinhababu et.al.", "authors": "Nilanjan Sinhababu, Andrew Parry, Debasis Ganguly, Debasis Samanta, Pabitra Mitra", "id": "2409.17745v2", "paper_url": "http://arxiv.org/abs/2409.17745v2", "repo": "null"}}