{"2410.23743": {"publish_time": "2024-10-31", "title": "What Happened in LLMs Layers when Trained for Fast vs. Slow Thinking: A Gradient Perspective", "paper_summary": "What makes a difference in the post-training of LLMs? We investigate the\ntraining patterns of different layers in large language models (LLMs), through\nthe lens of gradient, when training with different responses and initial\nmodels. We are specifically interested in how fast vs. slow thinking affects\nthe layer-wise gradients, given the recent popularity of training LLMs on\nreasoning paths such as chain-of-thoughts (CoT) and process rewards. In our\nstudy, fast thinking without CoT leads to larger gradients and larger\ndifferences of gradients across layers than slow thinking (Detailed CoT),\nindicating the learning stability brought by the latter. Moreover, pre-trained\nLLMs are less affected by the instability of fast thinking than\ninstruction-tuned LLMs. Additionally, we study whether the gradient patterns\ncan reflect the correctness of responses when training different LLMs using\nslow vs. fast thinking paths. The results show that the gradients of slow\nthinking can distinguish correct and irrelevant reasoning paths. As a\ncomparison, we conduct similar gradient analyses on non-reasoning knowledge\nlearning tasks, on which, however, trivially increasing the response length\ndoes not lead to similar behaviors of slow thinking. Our study strengthens\nfundamental understandings of LLM training and sheds novel insights on its\nefficiency and stability, which pave the way towards building a generalizable\nSystem-2 agent. Our code, data, and gradient statistics can be found in:\nhttps://github.com/MingLiiii/Layer_Gradient.", "paper_summary_zh": "在 LLM 的後訓練中，什麼會造成差異？我們透過梯度的視角，在訓練大型語言模型 (LLM) 時，探討不同層的訓練模式，以及在不同的回應和初始模型下訓練時，這些模式的變化。我們特別感興趣的是，在 LLM 於推理路徑（如思維鏈 (CoT) 和過程獎勵）上訓練的近期熱潮下，快速思考與慢思考如何影響逐層梯度。在我們的研究中，沒有 CoT 的快速思考會導致比慢思考（詳細的 CoT）更大的梯度和更大層間梯度差異，這表示後者帶來了學習的穩定性。此外，預先訓練的 LLM 受快速思考的不穩定性影響較小，而非指令調整的 LLM 則受影響較大。此外，我們研究梯度模式是否可以在使用慢思考與快速思考路徑訓練不同的 LLM 時，反映回應的正確性。結果顯示，慢思考的梯度可以區分正確的推理路徑和不相關的推理路徑。作為比較，我們對非推理知識學習任務進行類似的梯度分析，然而，在這些任務中，單純增加回應長度不會導致類似慢思考的行為。我們的研究強化了對 LLM 訓練的基本理解，並對其效率和穩定性提出了新的見解，為建構可概括的 System-2 代理鋪平了道路。我們的程式碼、資料和梯度統計資料可以在以下位置找到：\nhttps://github.com/MingLiiii/Layer_Gradient。", "author": "Ming Li et.al.", "authors": "Ming Li, Yanhong Li, Tianyi Zhou", "id": "2410.23743v1", "paper_url": "http://arxiv.org/abs/2410.23743v1", "repo": "https://github.com/mingliiii/layer_gradient"}}