{"2405.16761": {"publish_time": "2024-05-27", "title": "Masked Face Recognition with Generative-to-Discriminative Representations", "paper_summary": "Masked face recognition is important for social good but challenged by\ndiverse occlusions that cause insufficient or inaccurate representations. In\nthis work, we propose a unified deep network to learn\ngenerative-to-discriminative representations for facilitating masked face\nrecognition. To this end, we split the network into three modules and learn\nthem on synthetic masked faces in a greedy module-wise pretraining manner.\nFirst, we leverage a generative encoder pretrained for face inpainting and\nfinetune it to represent masked faces into category-aware descriptors.\nAttribute to the generative encoder's ability in recovering context\ninformation, the resulting descriptors can provide occlusion-robust\nrepresentations for masked faces, mitigating the effect of diverse masks. Then,\nwe incorporate a multi-layer convolutional network as a discriminative reformer\nand learn it to convert the category-aware descriptors into identity-aware\nvectors, where the learning is effectively supervised by distilling relation\nknowledge from off-the-shelf face recognition model. In this way, the\ndiscriminative reformer together with the generative encoder serves as the\npretrained backbone, providing general and discriminative representations\ntowards masked faces. Finally, we cascade one fully-connected layer following\nby one softmax layer into a feature classifier and finetune it to identify the\nreformed identity-aware vectors. Extensive experiments on synthetic and\nrealistic datasets demonstrate the effectiveness of our approach in recognizing\nmasked faces.", "paper_summary_zh": "遮罩人脸识别对于社会有益，但因各种遮挡而受到挑战，这些遮挡会导致表示不足或不准确。在这项工作中，我们提出了一种统一的深度网络，用于学习生成到判别表示，以促进遮罩人脸识别。为此，我们将网络分成三个模块，并以贪婪的模块化预训练方式在合成遮罩人脸上学习它们。首先，我们利用一个生成式编码器，该编码器经过预训练用于人脸修复，并对其进行微调以将遮罩人脸表示为类别感知描述符。归功于生成式编码器在恢复上下文信息方面的能力，所得描述符可以为遮罩人脸提供遮挡鲁棒表示，从而减轻各种遮罩的影响。然后，我们结合一个多层卷积网络作为判别式改造器，并学习将其转换为身份感知向量的类别感知描述符，其中学习通过从现成的人脸识别模型中提取关系知识来有效地监督。通过这种方式，判别式改造器与生成式编码器一起作为预训练骨干，为遮罩人脸提供通用且判别式的表示。最后，我们将一个全连接层级联到一个 softmax 层中，形成一个特征分类器，并对其进行微调以识别改造后的身份感知向量。在合成和真实数据集上的大量实验表明了我们方法在识别遮罩人脸方面的有效性。", "author": "Shiming Ge et.al.", "authors": "Shiming Ge, Weijia Guo, Chenyu Li, Junzheng Zhang, Yong Li, Dan Zeng", "id": "2405.16761v1", "paper_url": "http://arxiv.org/abs/2405.16761v1", "repo": "null"}}