{"2406.05084": {"publish_time": "2024-06-07", "title": "On Ambiguity and the Expressive Function of Law: The Role of Pragmatics in Smart Legal Ecosystems", "paper_summary": "This is a long paper, an essay, on ambiguity, pragmatics, legal ecosystems,\nand the expressive function of law. It is divided into two parts and fifteen\nsections. The first part (Pragmatics) addresses ambiguity from the perspective\nof linguistic and cognitive pragmatics in the legal field. The second part\n(Computing) deals with this issue from the point of view of human-centered\ndesign and artificial intelligence, specifically focusing on the notion and\nmodelling of rules and what it means to comply with the rules. This is\nnecessary for the scaffolding of smart legal ecosystems (SLE). I will develop\nthis subject with the example of the architecture, information flows, and smart\necosystem of OPTIMAI, an EU project of Industry 4.0 for zero-defect\nmanufacturing (Optimizing Manufacturing Processes through Artificial\nIntelligence and Virtualization).", "paper_summary_zh": "這是一篇關於模稜兩可、語用學、法律生態系統和法律的表達功能的長篇論文和散文。它分為兩部分和十五個部分。第一部分（語用學）從法律領域的語言學和認知語用學角度探討了模稜兩可性。第二部分（運算）從以人為中心的設計和人工智能的角度處理這個問題，特別關注規則的概念和建模以及遵守規則的含義。這對於構建智慧法律生態系統 (SLE) 是必要的。我將以歐盟工業 4.0 專案 OPTIMAI 的架構、資訊流和智慧生態系統為例來探討這個主題，該專案透過人工智慧和虛擬化來最佳化製造流程，以達成零缺陷製造。", "author": "Pompeu Casanovas et.al.", "authors": "Pompeu Casanovas", "id": "2406.05084v1", "paper_url": "http://arxiv.org/abs/2406.05084v1", "repo": "null"}}