{"2502.14482": {"publish_time": "2025-02-20", "title": "NLoRA: Nyström-Initiated Low-Rank Adaptation for Large Language Models", "paper_summary": "Parameter-efficient fine-tuning (PEFT) is essential for adapting large\nlanguage models (LLMs), with low-rank adaptation (LoRA) being the most popular\napproach. However, LoRA suffers from slow convergence, and some recent LoRA\nvariants, such as PiSSA, primarily rely on Singular Value Decomposition (SVD)\nfor initialization, leading to expensive computation. To mitigate these\nproblems, we use the Nystr\\\"om method, which follows a three-matrix\nmanipulation. We first introduce StructuredLoRA (SLoRA), which investigates\nadding a small intermediate matrix between the low-rank matrices A and B.\nSecondly, we propose Nystr\\\"omLoRA (NLoRA), which leverages Nystr\\\"om-based\ninitialization for SLoRA to improve its effectiveness and efficiency. Finally,\nwe propose IntermediateTune (IntTune), which explores fine-tuning exclusively\non the intermediate matrix of NLoRA to further boost LLM efficiency. We\nevaluate our methods on five natural language generation (NLG) tasks and eight\nnatural language understanding (NLU) tasks. On GSM8K, SLoRA and NLoRA achieve\naccuracies of 56.48% and 57.70%, surpassing LoRA by 33.52% and 36.41%, with\nonly 3.67 million additional trainable parameters. IntTune improves average NLG\nperformance over LoRA by 7.45% while using only 1.25% of its parameters. These\nresults demonstrate the efficiency and effectiveness of our approach in\nenhancing model performance with minimal parameter overhead.", "paper_summary_zh": "參數高效微調 (PEFT) 對於調整大型語言模型 (LLM) 至關重要，其中低秩調整 (LoRA) 是最受歡迎的方法。然而，LoRA 存在收斂速度慢的問題，而一些最近的 LoRA 變體，例如 PiSSA，主要依賴奇異值分解 (SVD) 進行初始化，導致運算成本高昂。為了減輕這些問題，我們使用了 Nystr\\\"om 方法，它遵循三矩陣操作。我們首先介紹 StructuredLoRA (SLoRA)，它研究在低秩矩陣 A 和 B 之間添加一個小的中間矩陣。其次，我們提出了 Nystr\\\"omLoRA (NLoRA)，它利用基於 Nystr\\\"om 的初始化方法為 SLoRA 提升其有效性和效率。最後，我們提出了 IntermediateTune (IntTune)，它探討了僅對 NLoRA 的中間矩陣進行微調，以進一步提升 LLM 效率。我們在五項自然語言生成 (NLG) 任務和八項自然語言理解 (NLU) 任務上評估了我們的這些方法。在 GSM8K 上，SLoRA 和 NLoRA 分別達到了 56.48% 和 57.70% 的準確率，比 LoRA 高出 33.52% 和 36.41%，而僅增加了 367 萬個可訓練參數。IntTune 在僅使用 LoRA 1.25% 的參數的情況下，將平均 NLG 效能提升了 7.45%。這些結果證明了我們的方法在以最少的參數開銷提升模型效能方面的效率和有效性。", "author": "Chenlu Guo et.al.", "authors": "Chenlu Guo, Yuan Wu, Yi Chang", "id": "2502.14482v1", "paper_url": "http://arxiv.org/abs/2502.14482v1", "repo": "null"}}