{"2303.03140": {"publish_time": "2023-03-06", "title": "Cybersecurity of AI medical devices: risks, legislation, and challenges", "paper_summary": "Medical devices and artificial intelligence systems rapidly transform\nhealthcare provisions. At the same time, due to their nature, AI in or as\nmedical devices might get exposed to cyberattacks, leading to patient safety\nand security risks. This book chapter is divided into three parts. The first\npart starts by setting the scene where we explain the role of cybersecurity in\nhealthcare. Then, we briefly define what we refer to when we talk about AI that\nis considered a medical device by itself or supports one. To illustrate the\nrisks such medical devices pose, we provide three examples: the poisoning of\ndatasets, social engineering, and data or source code extraction. In the second\npart, the paper provides an overview of the European Union's regulatory\nframework relevant for ensuring the cybersecurity of AI as or in medical\ndevices (MDR, NIS Directive, Cybersecurity Act, GDPR, the AI Act proposal and\nthe NIS 2 Directive proposal). Finally, the third part of the paper examines\npossible challenges stemming from the EU regulatory framework. In particular,\nwe look toward the challenges deriving from the two legislative proposals and\ntheir interaction with the existing legislation concerning AI medical devices'\ncybersecurity. They are structured as answers to the following questions: (1)\nhow will the AI Act interact with the MDR regarding the cybersecurity and\nsafety requirements?; (2) how should we interpret incident notification\nrequirements from the NIS 2 Directive proposal and MDR?; and (3) what are the\nconsequences of the evolving term of critical infrastructures?\n  [This is a draft chapter. The final version will be available in Research\nHandbook on Health, AI and the Law edited by Barry Solaiman & I. Glenn Cohen,\nforthcoming 2023, Edward Elgar Publishing Ltd]", "paper_summary_zh": "醫療設備和人工智慧系統快速轉化醫療保健的提供方式。同時，由於其本質，醫療設備中或作為醫療設備的人工智慧可能會遭受網路攻擊，進而導致患者安全和安全風險。本章節分為三部分。第一部分從設定場景開始，說明網路安全在醫療保健中的角色。然後，我們簡要定義我們在談論被視為醫療設備本身或支援醫療設備的人工智慧時所指涉的內容。為了說明此類醫療設備帶來的風險，我們提供了三個範例：資料集中毒、社會工程和資料或原始碼萃取。在第二部分，本文概述了歐盟的監管架構，與確保醫療設備中或作為醫療設備的人工智慧的網路安全相關（醫療器材法規、網路與資訊安全指令、網路安全法、一般資料保護規範、人工智慧法提案和網路與資訊安全 2 指令提案）。最後，本文的第三部分探討源自歐盟監管架構的潛在挑戰。特別是，我們展望源自這兩項立法提案的挑戰，以及它們與現有關於人工智慧醫療設備網路安全的立法之間的互動。它們被架構為以下問題的解答：(1) 人工智慧法將如何與醫療器材法規互動，就網路安全和安全要求而言？(2) 我們應如何解讀網路與資訊安全 2 指令提案和醫療器材法規的事件通知要求？(3) 關鍵基礎設施演進的術語會帶來什麼後果？\n[這是草稿章節。最終版本將刊載於 Barry Solaiman 和 I. Glenn Cohen 編輯的《健康、人工智慧與法律研究手冊》中，2023 年出版，Edward Elgar Publishing Ltd]", "author": "Elisabetta Biasin et.al.", "authors": "Elisabetta Biasin, Erik Kamenjasevic, Kaspar Rosager Ludvigsen", "id": "2303.03140v1", "paper_url": "http://arxiv.org/abs/2303.03140v1", "repo": "null"}}