{"2303.03140": {"publish_time": "2023-03-06", "title": "Cybersecurity of AI medical devices: risks, legislation, and challenges", "paper_summary": "Medical devices and artificial intelligence systems rapidly transform\nhealthcare provisions. At the same time, due to their nature, AI in or as\nmedical devices might get exposed to cyberattacks, leading to patient safety\nand security risks. This book chapter is divided into three parts. The first\npart starts by setting the scene where we explain the role of cybersecurity in\nhealthcare. Then, we briefly define what we refer to when we talk about AI that\nis considered a medical device by itself or supports one. To illustrate the\nrisks such medical devices pose, we provide three examples: the poisoning of\ndatasets, social engineering, and data or source code extraction. In the second\npart, the paper provides an overview of the European Union's regulatory\nframework relevant for ensuring the cybersecurity of AI as or in medical\ndevices (MDR, NIS Directive, Cybersecurity Act, GDPR, the AI Act proposal and\nthe NIS 2 Directive proposal). Finally, the third part of the paper examines\npossible challenges stemming from the EU regulatory framework. In particular,\nwe look toward the challenges deriving from the two legislative proposals and\ntheir interaction with the existing legislation concerning AI medical devices'\ncybersecurity. They are structured as answers to the following questions: (1)\nhow will the AI Act interact with the MDR regarding the cybersecurity and\nsafety requirements?; (2) how should we interpret incident notification\nrequirements from the NIS 2 Directive proposal and MDR?; and (3) what are the\nconsequences of the evolving term of critical infrastructures?\n  [This is a draft chapter. The final version will be available in Research\nHandbook on Health, AI and the Law edited by Barry Solaiman & I. Glenn Cohen,\nforthcoming 2023, Edward Elgar Publishing Ltd]", "paper_summary_zh": "", "author": "Elisabetta Biasin et.al.", "authors": "Elisabetta Biasin,Erik Kamenjasevic,Kaspar Rosager Ludvigsen", "id": "2303.03140v1", "paper_url": "http://arxiv.org/abs/2303.03140v1", "repo": "null"}}