{"2412.06575": {"publish_time": "2024-12-09", "title": "Data Quality Enhancement on the Basis of Diversity with Large Language Models for Text Classification: Uncovered, Difficult, and Noisy", "paper_summary": "In recent years, the use of large language models (LLMs) for text\nclassification has attracted widespread attention. Despite this, the\nclassification accuracy of LLMs has not yet universally surpassed that of\nsmaller models. LLMs can enhance their performance in text classification\nthrough fine-tuning. However, existing data quality research based on LLMs is\nchallenging to apply directly to solve text classification problems. To further\nimprove the performance of LLMs in classification tasks, this paper proposes a\ndata quality enhancement (DQE) method for text classification based on LLMs.\nThis method starts by using a greedy algorithm to select data, dividing the\ndataset into sampled and unsampled subsets, and then performing fine-tuning of\nthe LLMs using the sampled data. Subsequently, this model is used to predict\nthe outcomes for the unsampled data, categorizing incorrectly predicted data\ninto uncovered, difficult, and noisy data. Experimental results demonstrate\nthat our method effectively enhances the performance of LLMs in text\nclassification tasks and significantly improves training efficiency, saving\nnearly half of the training time. Our method has achieved state-of-the-art\nperformance in several open-source classification tasks.", "paper_summary_zh": "近年來，使用大型語言模型（LLM）進行文本分類已廣受關注。儘管如此，LLM 的分類準確度尚未普遍超越較小的模型。LLM 可以透過微調來提升其在文本分類中的效能。然而，現有的基於 LLM 的資料品質研究難以直接應用於解決文本分類問題。為了進一步提升 LLM 在分類任務中的效能，本文提出了一種基於 LLM 的文本分類資料品質提升（DQE）方法。此方法首先使用貪婪演算法來選擇資料，將資料集分為取樣和未取樣子集，然後使用取樣資料對 LLM 進行微調。接著，使用此模型來預測未取樣資料的結果，將預測錯誤的資料分類為未涵蓋、困難和雜訊資料。實驗結果證明，我們的模型有效提升了 LLM 在文本分類任務中的效能，並顯著提升訓練效率，節省了將近一半的訓練時間。我們的模型在多項開放原始碼分類任務中達到了最先進的效能。", "author": "Min Zeng et.al.", "authors": "Min Zeng, Caiquan Liu, Shiqi Zhang, Li Xie, Chen Sang, Xiaoxin Chen, Xiaoxin Chen", "id": "2412.06575v1", "paper_url": "http://arxiv.org/abs/2412.06575v1", "repo": "null"}}