{"2412.04403": {"publish_time": "2024-12-05", "title": "Establishing Task Scaling Laws via Compute-Efficient Model Ladders", "paper_summary": "We develop task scaling laws and model ladders to predict the individual task\nperformance of pretrained language models (LMs) in the overtrained setting.\nStandard power laws for language modeling loss cannot accurately model task\nperformance. Therefore, we leverage a two-step prediction approach: first use\nmodel and data size to predict a task-specific loss, and then use this task\nloss to predict task performance. We train a set of small-scale \"ladder\"\nmodels, collect data points to fit the parameterized functions of the two\nprediction steps, and make predictions for two target models: a 7B model\ntrained to 4T tokens and a 13B model trained to 5T tokens. Training the ladder\nmodels only costs 1% of the compute used for the target models. On four\nmultiple-choice tasks written in ranked classification format, we can predict\nthe accuracy of both target models within 2 points of absolute error. We have\nhigher prediction error on four other tasks (average absolute error 6.9) and\nfind that these are often tasks with higher variance in task metrics. We also\nfind that using less compute to train fewer ladder models tends to deteriorate\npredictions. Finally, we empirically show that our design choices and the\ntwo-step approach lead to superior performance in establishing scaling laws.", "paper_summary_zh": "<paragraph>我們開發任務擴充法則和模型階梯，以預測預訓練語言模型 (LM) 在過度訓練設定中的個別任務執行效能。\n語言模型損失的標準冪次法則無法精準模擬任務效能。因此，我們利用兩步驟預測方法：首先使用模型和資料大小預測特定任務的損失，然後使用此任務損失預測任務效能。我們訓練一組小規模「階梯」模型，收集資料點以符合兩個預測步驟的參數化函數，並對兩個目標模型進行預測：一個訓練至 4T 令牌的 7B 模型和一個訓練至 5T 令牌的 13B 模型。訓練階梯模型僅耗費目標模型運算的 1%。在四個以排名分類格式撰寫的多重選擇任務中，我們可以預測兩個目標模型的準確度，絕對誤差在 2 點以內。我們在其他四個任務上具有較高的預測誤差（平均絕對誤差 6.9），並發現這些任務通常是任務指標變異較高的任務。我們還發現，使用較少的運算訓練較少的階梯模型往往會導致預測惡化。最後，我們透過經驗證明，我們的設計選擇和兩步驟方法有助於在建立擴充法則時獲得優異的效能。</paragraph>", "author": "Akshita Bhagia et.al.", "authors": "Akshita Bhagia, Jiacheng Liu, Alexander Wettig, David Heineman, Oyvind Tafjord, Ananya Harsh Jha, Luca Soldaini, Noah A. Smith, Dirk Groeneveld, Pang Wei Koh, Jesse Dodge, Hannaneh Hajishirzi", "id": "2412.04403v1", "paper_url": "http://arxiv.org/abs/2412.04403v1", "repo": "null"}}