{"2502.04535": {"publish_time": "2025-02-06", "title": "A Decoding Algorithm for Length-Control Summarization Based on Directed Acyclic Transformers", "paper_summary": "Length-control summarization aims to condense long texts into a short one\nwithin a certain length limit. Previous approaches often use autoregressive\n(AR) models and treat the length requirement as a soft constraint, which may\nnot always be satisfied. In this study, we propose a novel length-control\ndecoding algorithm based on the Directed Acyclic Transformer (DAT). Our\napproach allows for multiple plausible sequence fragments and predicts a\n\\emph{path} to connect them. In addition, we propose a Sequence Maximum a\nPosteriori (SeqMAP) decoding algorithm that marginalizes different possible\npaths and finds the most probable summary satisfying the length budget. Our\nalgorithm is based on beam search, which further facilitates a reranker for\nperformance improvement. Experimental results on the Gigaword and DUC2004\ndatasets demonstrate our state-of-the-art performance for length-control\nsummarization.", "paper_summary_zh": "長度控制摘要旨在將長篇文字濃縮成短篇文字，並符合特定長度限制。先前的做法通常使用自迴歸 (AR) 模型，並將長度要求視為軟性約束，這可能無法始終得到滿足。在本研究中，我們提出一個新的長度控制解碼演算法，演算法基於有向非循環Transformer (DAT)。我們的做法允許多個合理的序列片段，並預測一條連接它們的「路徑」。此外，我們提出一個序列最大後驗 (SeqMAP) 解碼演算法，這個演算法將不同的可能路徑邊際化，並找出最有可能的摘要，以符合長度預算。我們的演算法基於光束搜尋，這進一步促進了重新排序器，以提升效能。在 Gigaword 和 DUC2004 資料集上的實驗結果證明了我們在長度控制摘要方面的最先進效能。", "author": "Chenyang Huang et.al.", "authors": "Chenyang Huang, Hao Zhou, Cameron Jen, Kangjie Zheng, Osmar R. Zaïane, Lili Mou", "id": "2502.04535v1", "paper_url": "http://arxiv.org/abs/2502.04535v1", "repo": "null"}}