{"2408.07931": {"publish_time": "2024-08-15", "title": "Surgical SAM 2: Real-time Segment Anything in Surgical Video by Efficient Frame Pruning", "paper_summary": "Surgical video segmentation is a critical task in computer-assisted surgery\nand is vital for enhancing surgical quality and patient outcomes. Recently, the\nSegment Anything Model 2 (SAM2) framework has shown superior advancements in\nimage and video segmentation. However, SAM2 struggles with efficiency due to\nthe high computational demands of processing high-resolution images and complex\nand long-range temporal dynamics in surgical videos. To address these\nchallenges, we introduce Surgical SAM 2 (SurgSAM-2), an advanced model to\nutilize SAM2 with an Efficient Frame Pruning (EFP) mechanism, to facilitate\nreal-time surgical video segmentation. The EFP mechanism dynamically manages\nthe memory bank by selectively retaining only the most informative frames,\nreducing memory usage and computational cost while maintaining high\nsegmentation accuracy. Our extensive experiments demonstrate that SurgSAM-2\nsignificantly improves both efficiency and segmentation accuracy compared to\nthe vanilla SAM2. Remarkably, SurgSAM-2 achieves a 3$\\times$ FPS compared with\nSAM2, while also delivering state-of-the-art performance after fine-tuning with\nlower-resolution data. These advancements establish SurgSAM-2 as a leading\nmodel for surgical video analysis, making real-time surgical video segmentation\nin resource-constrained environments a feasible reality.", "paper_summary_zh": "手術影片分割是電腦輔助手術中的一項重要任務，對於提升手術品質和患者預後至關重要。最近，Segment Anything Model 2 (SAM2) 框架在影像和影片分割方面展現出卓越的進步。然而，SAM2 在處理高解析度影像和手術影片中複雜且長程的時間動態時，由於運算需求高，因此在效率方面有所掙扎。為了應對這些挑戰，我們引入了手術 SAM 2 (SurgSAM-2)，這是一個進階模型，結合 SAM2 與高效度影像剔除 (EFP) 機制，以促進即時手術影片分割。EFP 機制透過選擇性地僅保留資訊量最高的影像，動態管理記憶體庫，在維持高分割精確度的同時，減少記憶體使用量和運算成本。我們廣泛的實驗證明，與原始 SAM2 相比，SurgSAM-2 在效率和分割精確度方面都有顯著的提升。值得注意的是，SurgSAM-2 的 FPS 比 SAM2 高出 3 倍，同時在使用低解析度資料進行微調後，也提供了最先進的效能。這些進展確立了 SurgSAM-2 作為手術影片分析的領先模型，使在資源受限的環境中進行即時手術影片分割成為可行的現實。", "author": "Haofeng Liu et.al.", "authors": "Haofeng Liu, Erli Zhang, Junde Wu, Mingxuan Hong, Yueming Jin", "id": "2408.07931v1", "paper_url": "http://arxiv.org/abs/2408.07931v1", "repo": "null"}}