{"2412.11674": {"publish_time": "2024-12-16", "title": "UA-PDFL: A Personalized Approach for Decentralized Federated Learning", "paper_summary": "Federated learning (FL) is a privacy preserving machine learning paradigm\ndesigned to collaboratively learn a global model without data leakage.\nSpecifically, in a typical FL system, the central server solely functions as an\ncoordinator to iteratively aggregate the collected local models trained by each\nclient, potentially introducing single-point transmission bottleneck and\nsecurity threats. To mitigate this issue, decentralized federated learning\n(DFL) has been proposed, where all participating clients engage in peer-to-peer\ncommunication without a central server. Nonetheless, DFL still suffers from\ntraining degradation as FL does due to the non-independent and identically\ndistributed (non-IID) nature of client data. And incorporating personalization\nlayers into DFL may be the most effective solutions to alleviate the side\neffects caused by non-IID data. Therefore, in this paper, we propose a novel\nunit representation aided personalized decentralized federated learning\nframework, named UA-PDFL, to deal with the non-IID challenge in DFL. By\nadaptively adjusting the level of personalization layers through the guidance\nof the unit representation, UA-PDFL is able to address the varying degrees of\ndata skew. Based on this scheme, client-wise dropout and layer-wise\npersonalization are proposed to further enhance the learning performance of\nDFL. Extensive experiments empirically prove the effectiveness of our proposed\nmethod.", "paper_summary_zh": "聯邦學習 (FL) 是一種注重隱私的機器學習範例，旨在協作學習一個整體模型，而不會發生資料外洩。具體來說，在典型的 FL 系統中，中央伺服器僅作為協調器，反覆彙總每個客戶端訓練的收集到的本地模型，可能會造成單點傳輸瓶頸和安全威脅。為了減輕這個問題，已經提出了去中心化聯邦學習 (DFL)，其中所有參與的客戶端都參與點對點通訊，而沒有中央伺服器。儘管如此，DFL 仍然會像 FL 一樣遭受訓練退化的問題，因為客戶端資料是非獨立且同分布 (non-IID) 的。而將個人化層納入 DFL 可能會是最有效的解決方案，以減輕由非 IID 資料造成的副作用。因此，在本文中，我們提出了一個新穎的單元表示輔助個人化去中心化聯邦學習架構，稱為 UA-PDFL，以應對 DFL 中的非 IID 挑戰。通過單元表示的指導，自適應調整個人化層的層級，UA-PDFL 能夠解決資料偏差的程度不同。基於這個架構，提出了客戶端隨機失活和層級個人化，以進一步增強 DFL 的學習效能。廣泛的實驗經驗證明了我們提出的方法的有效性。", "author": "Hangyu Zhu et.al.", "authors": "Hangyu Zhu, Yuxiang Fan, Zhenping Xie", "id": "2412.11674v1", "paper_url": "http://arxiv.org/abs/2412.11674v1", "repo": "null"}}