{"2502.13647": {"publish_time": "2025-02-19", "title": "Instruction Tuning on Public Government and Cultural Data for Low-Resource Language: a Case Study in Kazakh", "paper_summary": "Instruction tuning in low-resource languages remains underexplored due to\nlimited text data, particularly in government and cultural domains. To address\nthis, we introduce and open-source a large-scale (10,600 samples)\ninstruction-following (IFT) dataset, covering key institutional and cultural\nknowledge relevant to Kazakhstan. Our dataset enhances LLMs' understanding of\nprocedural, legal, and structural governance topics. We employ LLM-assisted\ndata generation, comparing open-weight and closed-weight models for dataset\nconstruction, and select GPT-4o as the backbone. Each entity of our dataset\nundergoes full manual verification to ensure high quality. We also show that\nfine-tuning Qwen, Falcon, and Gemma on our dataset leads to consistent\nperformance improvements in both multiple-choice and generative tasks,\ndemonstrating the potential of LLM-assisted instruction tuning for low-resource\nlanguages.", "paper_summary_zh": "由於文本資料有限，特別是在政府和文化領域，因此低資源語言的指令調整仍未得到充分探索。為了解決這個問題，我們引入並開放了一個大型（10,600 個範例）指令遵循 (IFT) 資料集，涵蓋與哈薩克相關的主要制度和文化知識。我們的資料集增強了 LLM 對程序、法律和結構治理主題的理解。我們採用 LLM 輔助資料生成，比較開放權重和封閉權重模型以進行資料集建構，並選擇 GPT-4o 作為主幹。我們資料集的每個實體都經過完整的手動驗證，以確保高品質。我們還表明，在我們的資料集上微調 Qwen、Falcon 和 Gemma 會在多重選擇和生成任務中持續改善效能，這證明了 LLM 輔助指令調整在低資源語言中的潛力。", "author": "Nurkhan Laiyk et.al.", "authors": "Nurkhan Laiyk, Daniil Orel, Rituraj Joshi, Maiya Goloburda, Yuxia Wang, Preslav Nakov, Fajri Koto", "id": "2502.13647v1", "paper_url": "http://arxiv.org/abs/2502.13647v1", "repo": "null"}}