{"2501.19314": {"publish_time": "2025-01-31", "title": "An Efficient Approach for Machine Translation on Low-resource Languages: A Case Study in Vietnamese-Chinese", "paper_summary": "Despite the rise of recent neural networks in machine translation, those\nnetworks do not work well if the training data is insufficient. In this paper,\nwe proposed an approach for machine translation in low-resource languages such\nas Vietnamese-Chinese. Our proposed method leveraged the power of the\nmultilingual pre-trained language model (mBART) and both Vietnamese and Chinese\nmonolingual corpus. Firstly, we built an early bird machine translation model\nusing the bilingual training dataset. Secondly, we used TF-IDF technique to\nselect sentences from the monolingual corpus which are the most related to\ndomains of the parallel dataset. Finally, the first model was used to\nsynthesize the augmented training data from the selected monolingual corpus for\nthe translation model. Our proposed scheme showed that it outperformed 8%\ncompared to the transformer model. The augmented dataset also pushed the model\nperformance.", "paper_summary_zh": "儘管最近機器翻譯中的神經網路興起，如果訓練資料不足，這些網路就無法順利運作。在本文中，我們提出了一個用於低資源語言（例如越南語-中文）的機器翻譯方法。我們提出的方法利用了多語言預訓練語言模型 (mBART) 和越南語和中文單語語料庫的力量。首先，我們使用雙語訓練資料集建立了一個早期機器翻譯模型。其次，我們使用 TF-IDF 技術從單語語料庫中選擇與平行資料集領域最相關的句子。最後，第一個模型用於從所選的單語語料庫中合成擴充訓練資料，以供翻譯模型使用。我們提出的方案顯示，與Transformer模型相比，它的表現優異 8%。擴充資料集也提升了模型效能。", "author": "Tran Ngoc Son et.al.", "authors": "Tran Ngoc Son, Nguyen Anh Tu, Nguyen Minh Tri", "id": "2501.19314v1", "paper_url": "http://arxiv.org/abs/2501.19314v1", "repo": "null"}}