{"2408.10605": {"publish_time": "2024-08-20", "title": "MUSES: 3D-Controllable Image Generation via Multi-Modal Agent Collaboration", "paper_summary": "Despite recent advancements in text-to-image generation, most existing\nmethods struggle to create images with multiple objects and complex spatial\nrelationships in 3D world. To tackle this limitation, we introduce a generic AI\nsystem, namely MUSES, for 3D-controllable image generation from user queries.\nSpecifically, our MUSES addresses this challenging task by developing a\nprogressive workflow with three key components, including (1) Layout Manager\nfor 2D-to-3D layout lifting, (2) Model Engineer for 3D object acquisition and\ncalibration, (3) Image Artist for 3D-to-2D image rendering. By mimicking the\ncollaboration of human professionals, this multi-modal agent pipeline\nfacilitates the effective and automatic creation of images with 3D-controllable\nobjects, through an explainable integration of top-down planning and bottom-up\ngeneration. Additionally, we find that existing benchmarks lack detailed\ndescriptions of complex 3D spatial relationships of multiple objects. To fill\nthis gap, we further construct a new benchmark of T2I-3DisBench (3D image\nscene), which describes diverse 3D image scenes with 50 detailed prompts.\nExtensive experiments show the state-of-the-art performance of MUSES on both\nT2I-CompBench and T2I-3DisBench, outperforming recent strong competitors such\nas DALL-E 3 and Stable Diffusion 3. These results demonstrate a significant\nstep of MUSES forward in bridging natural language, 2D image generation, and 3D\nworld.", "paper_summary_zh": "儘管文字轉圖片的生成技術近來有長足進步，但現有的方法大多難以在 3D 世界中建立具有多個物件和複雜空間關係的圖片。為了克服此限制，我們推出一個通用的 AI 系統，稱為 MUSES，用於從使用者查詢生成可 3D 控制的圖片。具體來說，我們的 MUSES 透過開發一個具有三個關鍵組件的漸進式工作流程來解決這項艱鉅的任務，包括 (1) 用於 2D 到 3D 佈局提升的佈局管理員、(2) 用於 3D 物件擷取和校準的模型工程師，以及 (3) 用於 3D 到 2D 圖片渲染的圖片藝術家。透過模仿人類專業人員的協作，此多模式代理程式管道透過自上而下的規劃和自下而上的生成的說明性整合，促進有效且自動建立具有 3D 可控制物件的圖片。此外，我們發現現有的基準缺乏對多個物件複雜 3D 空間關係的詳細說明。為了填補此差距，我們進一步建立了一個 T2I-3DisBench（3D 圖片場景）的新基準，其中描述了具有 50 個詳細提示的多樣化 3D 圖片場景。廣泛的實驗顯示，MUSES 在 T2I-CompBench 和 T2I-3DisBench 上都具有最先進的效能，優於 DALL-E 3 和 Stable Diffusion 3 等近期強勁的競爭對手。這些結果證明了 MUSES 在橋接自然語言、2D 圖片生成和 3D 世界方面邁出了一大步。", "author": "Yanbo Ding et.al.", "authors": "Yanbo Ding, Shaobin Zhuang, Kunchang Li, Zhengrong Yue, Yu Qiao, Yali Wang", "id": "2408.10605v2", "paper_url": "http://arxiv.org/abs/2408.10605v2", "repo": "null"}}