{"2411.02393": {"publish_time": "2024-11-04", "title": "Adaptive Length Image Tokenization via Recurrent Allocation", "paper_summary": "Current vision systems typically assign fixed-length representations to\nimages, regardless of the information content. This contrasts with human\nintelligence - and even large language models - which allocate varying\nrepresentational capacities based on entropy, context and familiarity. Inspired\nby this, we propose an approach to learn variable-length token representations\nfor 2D images. Our encoder-decoder architecture recursively processes 2D image\ntokens, distilling them into 1D latent tokens over multiple iterations of\nrecurrent rollouts. Each iteration refines the 2D tokens, updates the existing\n1D latent tokens, and adaptively increases representational capacity by adding\nnew tokens. This enables compression of images into a variable number of\ntokens, ranging from 32 to 256. We validate our tokenizer using reconstruction\nloss and FID metrics, demonstrating that token count aligns with image entropy,\nfamiliarity and downstream task requirements. Recurrent token processing with\nincreasing representational capacity in each iteration shows signs of token\nspecialization, revealing potential for object / part discovery.", "paper_summary_zh": "目前的視覺系統通常會將固定長度的表徵分配給影像，而不管資訊內容為何。這與人類的智慧——甚至是大型語言模型——形成對比，後者會根據熵、脈絡和熟悉度分配不同的表徵容量。受到這點啟發，我們提出一個方法來學習 2D 影像的可變長度標記表徵。我們的編碼器-解碼器架構會遞迴處理 2D 影像標記，將它們在遞迴展開的多次迭代中提煉成 1D 潛在標記。每次迭代都會精煉 2D 標記、更新現有的 1D 潛在標記，並透過新增標記來適應性地增加表徵容量。這能將影像壓縮成數量可變的標記，範圍從 32 到 256。我們使用重建損失和 FID 指標驗證我們的標記器，證明標記數量與影像熵、熟悉度和下游任務需求相符。在每次迭代中，遞迴標記處理會隨著表徵容量的增加而顯示標記專業化的跡象，揭示了物件/部分發現的潛力。", "author": "Shivam Duggal et.al.", "authors": "Shivam Duggal, Phillip Isola, Antonio Torralba, William T. Freeman", "id": "2411.02393v1", "paper_url": "http://arxiv.org/abs/2411.02393v1", "repo": "https://github.com/shivamduggal4/adaptive-length-tokenizer"}}