{"2410.02560": {"publish_time": "2024-10-03", "title": "Convolutional Variational Autoencoders for Spectrogram Compression in Automatic Speech Recognition", "paper_summary": "For many Automatic Speech Recognition (ASR) tasks audio features as\nspectrograms show better results than Mel-frequency Cepstral Coefficients\n(MFCC), but in practice they are hard to use due to a complex dimensionality of\na feature space. The following paper presents an alternative approach towards\ngenerating compressed spectrogram representation, based on Convolutional\nVariational Autoencoders (VAE). A Convolutional VAE model was trained on a\nsubsample of the LibriSpeech dataset to reconstruct short fragments of audio\nspectrograms (25 ms) from a 13-dimensional embedding. The trained model for a\n40-dimensional (300 ms) embedding was used to generate features for corpus of\nspoken commands on the GoogleSpeechCommands dataset. Using the generated\nfeatures an ASR system was built and compared to the model with MFCC features.", "paper_summary_zh": "對於許多自動語音辨識 (ASR) 任務，音訊特徵（例如譜圖）顯示比梅爾頻率倒譜係數 (MFCC) 更好的結果，但實際上，由於特徵空間的複雜維度，它們難以使用。以下論文提出了一個基於卷積變異自動編碼器 (VAE) 的生成壓縮譜圖表示的替代方法。在 LibriSpeech 資料集的子樣本上訓練了一個卷積 VAE 模型，以從 13 維嵌入中重建音訊譜圖的短片段（25 毫秒）。40 維（300 毫秒）嵌入的訓練模型用於為 GoogleSpeechCommands 資料集上口說指令語料庫生成特徵。使用生成的特性建立了一個 ASR 系統，並與具有 MFCC 特性的模型進行比較。", "author": "Olga Yakovenko et.al.", "authors": "Olga Yakovenko, Ivan Bondarenko", "id": "2410.02560v1", "paper_url": "http://arxiv.org/abs/2410.02560v1", "repo": "null"}}