{"2407.06579": {"publish_time": "2024-07-09", "title": "NoisyAG-News: A Benchmark for Addressing Instance-Dependent Noise in Text Classification", "paper_summary": "Existing research on learning with noisy labels predominantly focuses on\nsynthetic label noise. Although synthetic noise possesses well-defined\nstructural properties, it often fails to accurately replicate real-world noise\npatterns. In recent years, there has been a concerted effort to construct\ngeneralizable and controllable instance-dependent noise datasets for image\nclassification, significantly advancing the development of noise-robust\nlearning in this area. However, studies on noisy label learning for text\nclassification remain scarce. To better understand label noise in real-world\ntext classification settings, we constructed the benchmark dataset NoisyAG-News\nthrough manual annotation. Initially, we analyzed the annotated data to gather\nobservations about real-world noise. We qualitatively and quantitatively\ndemonstrated that real-world noisy labels adhere to instance-dependent\npatterns. Subsequently, we conducted comprehensive learning experiments on\nNoisyAG-News and its corresponding synthetic noise datasets using pre-trained\nlanguage models and noise-handling techniques. Our findings reveal that while\npre-trained models are resilient to synthetic noise, they struggle against\ninstance-dependent noise, with samples of varying confusion levels showing\ninconsistent performance during training and testing. These real-world noise\npatterns pose new, significant challenges, prompting a reevaluation of noisy\nlabel handling methods. We hope that NoisyAG-News will facilitate the\ndevelopment and evaluation of future solutions for learning with noisy labels.", "paper_summary_zh": "現有關於帶有雜訊標籤學習的研究主要集中在\n合成的標籤雜訊上。儘管合成的雜訊具有明確的\n結構屬性，但它常常無法準確複製真實世界的雜訊\n模式。近年來，人們一直在努力構建\n可概括和可控的與實例相關的雜訊資料集，用於影像\n分類，大幅推進了此領域中抗雜訊\n學習的發展。然而，關於用於文字\n分類的雜訊標籤學習的研究仍然很少。為了更深入地了解真實世界\n文字分類設定中的標籤雜訊，我們透過手動註解構建了基準資料集 NoisyAG-News。最初，我們分析了已註解的資料，以收集\n關於真實世界雜訊的觀察結果。我們定性和定量\n證明了真實世界的雜訊標籤遵循與實例相關的\n模式。隨後，我們對\nNoisyAG-News 及其對應的合成雜訊資料集進行了全面的學習實驗，使用預先訓練好的\n語言模型和雜訊處理技術。我們的研究結果顯示，雖然\n預先訓練好的模型具有合成雜訊的韌性，但它們在與實例相關的雜訊中會遇到困難，在訓練和測試期間，混淆程度不同的樣本顯示出不一致的效能。這些真實世界的雜訊\n模式帶來了新的重大挑戰，促使重新評估雜訊\n標籤處理方法。我們希望 NoisyAG-News 將有助於\n開發和評估未來使用雜訊標籤進行學習的解決方案。", "author": "Hongfei Huang et.al.", "authors": "Hongfei Huang, Tingting Liang, Xixi Sun, Zikang Jin, Yuyu Yin", "id": "2407.06579v1", "paper_url": "http://arxiv.org/abs/2407.06579v1", "repo": "null"}}