{"2411.10436": {"publish_time": "2024-11-15", "title": "Mitigating Hallucination in Multimodal Large Language Model via Hallucination-targeted Direct Preference Optimization", "paper_summary": "Multimodal Large Language Models (MLLMs) are known to hallucinate, which\nlimits their practical applications. Recent works have attempted to apply\nDirect Preference Optimization (DPO) to enhance the performance of MLLMs, but\nhave shown inconsistent improvements in mitigating hallucinations. To address\nthis issue more effectively, we introduce Hallucination-targeted Direct\nPreference Optimization (HDPO) to reduce hallucinations in MLLMs. Unlike\nprevious approaches, our method tackles hallucinations from their diverse forms\nand causes. Specifically, we develop three types of preference pair data\ntargeting the following causes of MLLM hallucinations: (1) insufficient visual\ncapabilities, (2) long context generation, and (3) multimodal conflicts.\nExperimental results demonstrate that our method achieves superior performance\nacross multiple hallucination evaluation datasets, surpassing most\nstate-of-the-art (SOTA) methods and highlighting the potential of our approach.\nAblation studies and in-depth analyses further confirm the effectiveness of our\nmethod and suggest the potential for further improvements through scaling up.", "paper_summary_zh": "多模态大型语言模型 (MLLM) 会出现幻觉，这限制了它们的实际应用。最近的研究尝试应用直接偏好优化 (DPO) 来增强 MLLM 的性能，但在减轻幻觉方面表现并不一致。为了更有效地解决这个问题，我们引入了幻觉目标直接偏好优化 (HDPO) 来减少 MLLM 中的幻觉。与以前的方法不同，我们的方法从其不同的形式和原因来解决幻觉。具体来说，我们针对以下 MLLM 幻觉原因开发了三种类型的偏好对数据：(1) 视觉能力不足，(2) 长上下文生成，以及 (3) 多模态冲突。实验结果表明，我们的方法在多个幻觉评估数据集上实现了卓越的性能，超越了大多数最先进 (SOTA) 方法，并突出了我们方法的潜力。消融研究和深入分析进一步证实了我们方法的有效性，并表明通过扩展可以进一步改进。", "author": "Yuhan Fu et.al.", "authors": "Yuhan Fu, Ruobing Xie, Xingwu Sun, Zhanhui Kang, Xirong Li", "id": "2411.10436v1", "paper_url": "http://arxiv.org/abs/2411.10436v1", "repo": "null"}}