{"2405.14632": {"publish_time": "2024-05-23", "title": "Reinforcement Learning for Fine-tuning Text-to-speech Diffusion Models", "paper_summary": "Recent advancements in generative models have sparked significant interest\nwithin the machine learning community. Particularly, diffusion models have\ndemonstrated remarkable capabilities in synthesizing images and speech. Studies\nsuch as those by Lee et al. [19], Black et al. [4], Wang et al. [36], and Fan\net al. [8] illustrate that Reinforcement Learning with Human Feedback (RLHF)\ncan enhance diffusion models for image synthesis. However, due to architectural\ndifferences between these models and those employed in speech synthesis, it\nremains uncertain whether RLHF could similarly benefit speech synthesis models.\nIn this paper, we explore the practical application of RLHF to diffusion-based\ntext-to-speech synthesis, leveraging the mean opinion score (MOS) as predicted\nby UTokyo-SaruLab MOS prediction system [29] as a proxy loss. We introduce\ndiffusion model loss-guided RL policy optimization (DLPO) and compare it\nagainst other RLHF approaches, employing the NISQA speech quality and\nnaturalness assessment model [21] and human preference experiments for further\nevaluation. Our results show that RLHF can enhance diffusion-based\ntext-to-speech synthesis models, and, moreover, DLPO can better improve\ndiffusion models in generating natural and high quality speech audios.", "paper_summary_zh": "<paragraph>生成模型的最新进展在机器学习社区中引起了极大的兴趣。特别是，扩散模型在图像和语音合成方面表现出了非凡的能力。李等人[19]、布莱克等人[4]、王等人[36]和范等人[8]等人的研究表明，人类反馈强化学习（RLHF）可以增强图像合成的扩散模型。然而，由于这些模型与用于语音合成的模型在架构上的差异，RLHF是否可以同样有利于语音合成模型仍然不确定。在本文中，我们探讨了RLHF在基于扩散的文本到语音合成中的实际应用，利用东京大学SaruLab MOS预测系统[29]预测的平均意见分（MOS）作为代理损失。我们引入了扩散模型损失引导的RL策略优化（DLPO），并将其与其他RLHF方法进行了比较，采用NISQA语音质量和自然度评估模型[21]和人类偏好实验进行进一步评估。我们的结果表明，RLHF可以增强基于扩散的文本到语音合成模型，而且，DLPO可以更好地改进扩散模型，生成自然且高质量的语音音频。</paragraph>", "author": "Jingyi Chen et.al.", "authors": "Jingyi Chen, Ju-Seung Byun, Micha Elsner, Andrew Perrault", "id": "2405.14632v1", "paper_url": "http://arxiv.org/abs/2405.14632v1", "repo": "null"}}