{"2410.06555": {"publish_time": "2024-10-09", "title": "ING-VP: MLLMs cannot Play Easy Vision-based Games Yet", "paper_summary": "As multimodal large language models (MLLMs) continue to demonstrate\nincreasingly competitive performance across a broad spectrum of tasks, more\nintricate and comprehensive benchmarks have been developed to assess these\ncutting-edge models. These benchmarks introduce new challenges to core\ncapabilities such as perception, reasoning, and planning. However, existing\nmultimodal benchmarks fall short in providing a focused evaluation of\nmulti-step planning based on spatial relationships in images. To bridge this\ngap, we present ING-VP, the first INteractive Game-based Vision Planning\nbenchmark, specifically designed to evaluate the spatial imagination and\nmulti-step reasoning abilities of MLLMs. ING-VP features 6 distinct games,\nencompassing 300 levels, each with 6 unique configurations. A single model\nengages in over 60,000 rounds of interaction. The benchmark framework allows\nfor multiple comparison settings, including image-text vs. text-only inputs,\nsingle-step vs. multi-step reasoning, and with-history vs. without-history\nconditions, offering valuable insights into the model's capabilities. We\nevaluated numerous state-of-the-art MLLMs, with the highest-performing model,\nClaude-3.5 Sonnet, achieving an average accuracy of only 3.37%, far below the\nanticipated standard. This work aims to provide a specialized evaluation\nframework to drive advancements in MLLMs' capacity for complex spatial\nreasoning and planning. The code is publicly available at\nhttps://github.com/Thisisus7/ING-VP.git.", "paper_summary_zh": "隨著多模態大型語言模型 (MLLM) 持續展現出在廣泛任務中越來越有競爭力的表現，已經開發出更複雜且全面的基準來評估這些尖端模型。這些基準為核心能力（例如感知、推理和規劃）帶來了新的挑戰。然而，現有的多模態基準在提供基於圖像中空間關係的多步驟規劃的重點評估方面做得並不好。為了彌補這個差距，我們提出了 ING-VP，這是第一個基於互動遊戲的視覺規劃基準，專門設計用於評估 MLLM 的空間想像力和多步驟推理能力。ING-VP 特色是 6 個不同的遊戲，包含 300 個等級，每個等級有 6 個獨特配置。一個單一模型參與超過 60,000 輪互動。基準架構允許多種比較設定，包括圖像文字與純文字輸入、單步驟與多步驟推理，以及有歷史記錄與無歷史記錄條件，提供對模型能力的寶貴見解。我們評估了許多最先進的 MLLM，表現最好的模型 Claude-3.5 Sonnet，平均準確度僅達到 3.37%，遠低於預期的標準。這項工作旨在提供一個專業的評估架構，以推動 MLLM 在複雜空間推理和規劃方面的能力進步。程式碼可在 https://github.com/Thisisus7/ING-VP.git 公開取得。", "author": "Haoran Zhang et.al.", "authors": "Haoran Zhang, Hangyu Guo, Shuyue Guo, Meng Cao, Wenhao Huang, Jiaheng Liu, Ge Zhang", "id": "2410.06555v1", "paper_url": "http://arxiv.org/abs/2410.06555v1", "repo": "https://github.com/thisisus7/ing-vp"}}