{"2409.08719": {"publish_time": "2024-09-13", "title": "Distilling Monolingual and Crosslingual Word-in-Context Representations", "paper_summary": "In this study, we propose a method that distils representations of word\nmeaning in context from a pre-trained masked language model in both monolingual\nand crosslingual settings. Word representations are the basis for context-aware\nlexical semantics and unsupervised semantic textual similarity (STS)\nestimation. Different from existing approaches, our method does not require\nhuman-annotated corpora nor updates of the parameters of the pre-trained model.\nThe latter feature is appealing for practical scenarios where the off-the-shelf\npre-trained model is a common asset among different applications. Specifically,\nour method learns to combine the outputs of different hidden layers of the\npre-trained model using self-attention. Our auto-encoder based training only\nrequires an automatically generated corpus. To evaluate the performance of the\nproposed approach, we performed extensive experiments using various benchmark\ntasks. The results on the monolingual tasks confirmed that our representations\nexhibited a competitive performance compared to that of the previous study for\nthe context-aware lexical semantic tasks and outperformed it for STS\nestimation. The results of the crosslingual tasks revealed that the proposed\nmethod largely improved crosslingual word representations of multilingual\npre-trained models.", "paper_summary_zh": "<paragraph>在這項研究中，我們提出了一種方法，可以從預先訓練好的遮蔽語言模型中提取單詞在上下文中含義的表徵，同時適用於單語和跨語言設置。單詞表徵是基於上下文感知的詞彙語義和無監督語義文本相似性 (STS) 估計。與現有方法不同，我們的方法不需要人工註解的語料庫，也不需要更新預先訓練好的模型的參數。後者對於實際場景很有吸引力，在這種場景中，現成的預先訓練好的模型是不同應用程序之間的共同資產。具體來說，我們的方法學會使用自注意力結合預先訓練好的模型的不同隱藏層的輸出。我們基於自動編碼器的訓練只需要一個自動生成的語料庫。為了評估所提出方法的性能，我們使用各種基準任務進行了廣泛的實驗。單語任務的結果證實，與先前研究相比，我們的表徵在基於上下文的詞彙語義任務中表現出了競爭力，並且在 STS 估計中優於它。跨語言任務的結果表明，所提出的方法極大地改進了多語言預先訓練模型的跨語言單詞表徵。</paragraph>", "author": "Yuki Arase et.al.", "authors": "Yuki Arase, Tomoyuki Kajiwara", "id": "2409.08719v1", "paper_url": "http://arxiv.org/abs/2409.08719v1", "repo": "https://github.com/yukiar/distil_wic"}}