{"2410.02365": {"publish_time": "2024-10-03", "title": "From Concrete to Abstract: A Multimodal Generative Approach to Abstract Concept Learning", "paper_summary": "Understanding and manipulating concrete and abstract concepts is fundamental\nto human intelligence. Yet, they remain challenging for artificial agents. This\npaper introduces a multimodal generative approach to high order abstract\nconcept learning, which integrates visual and categorical linguistic\ninformation from concrete ones. Our model initially grounds subordinate level\nconcrete concepts, combines them to form basic level concepts, and finally\nabstracts to superordinate level concepts via the grounding of basic-level\nconcepts. We evaluate the model language learning ability through\nlanguage-to-visual and visual-to-language tests with high order abstract\nconcepts. Experimental results demonstrate the proficiency of the model in both\nlanguage understanding and language naming tasks.", "paper_summary_zh": "理解和操作具體和抽象概念是人類智能的基礎。然而，它們對人工智慧來說仍然具有挑戰性。本文介紹了一種多模態生成方法，用於高階抽象概念學習，它整合了來自具體概念的視覺和分類語言信息。我們的模型最初建立了從屬級別的具體概念，將它們組合起來形成基本級別的概念，最後通過基本級別概念的基礎，抽象到超類別級別的概念。我們通過高階抽象概念的語言到視覺和視覺到語言測試來評估模型的語言學習能力。實驗結果證明了該模型在語言理解和語言命名任務中的熟練程度。", "author": "Haodong Xie et.al.", "authors": "Haodong Xie, Rahul Singh Maharjan, Federico Tavella, Angelo Cangelosi", "id": "2410.02365v1", "paper_url": "http://arxiv.org/abs/2410.02365v1", "repo": "null"}}