{"2408.07194": {"publish_time": "2024-08-13", "title": "Massive Dimensions Reduction and Hybridization with Meta-heuristics in Deep Learning", "paper_summary": "Deep learning is mainly based on utilizing gradient-based optimization for\ntraining Deep Neural Network (DNN) models. Although robust and widely used,\ngradient-based optimization algorithms are prone to getting stuck in local\nminima. In this modern deep learning era, the state-of-the-art DNN models have\nmillions and billions of parameters, including weights and biases, making them\nhuge-scale optimization problems in terms of search space. Tuning a huge number\nof parameters is a challenging task that causes vanishing/exploding gradients\nand overfitting; likewise, utilized loss functions do not exactly represent our\ntargeted performance metrics. A practical solution to exploring large and\ncomplex solution space is meta-heuristic algorithms. Since DNNs exceed\nthousands and millions of parameters, even robust meta-heuristic algorithms,\nsuch as Differential Evolution, struggle to efficiently explore and converge in\nsuch huge-dimensional search spaces, leading to very slow convergence and high\nmemory demand. To tackle the mentioned curse of dimensionality, the concept of\nblocking was recently proposed as a technique that reduces the search space\ndimensions by grouping them into blocks. In this study, we aim to introduce\nHistogram-based Blocking Differential Evolution (HBDE), a novel approach that\nhybridizes gradient-based and gradient-free algorithms to optimize parameters.\nExperimental results demonstrated that the HBDE could reduce the parameters in\nthe ResNet-18 model from 11M to 3K during the training/optimizing phase by\nmetaheuristics, namely, the proposed HBDE, which outperforms baseline\ngradient-based and parent gradient-free DE algorithms evaluated on CIFAR-10 and\nCIFAR-100 datasets showcasing its effectiveness with reduced computational\ndemands for the very first time.", "paper_summary_zh": "深度學習主要基於利用基於梯度的最佳化來訓練深度神經網路 (DNN) 模型。儘管基於梯度的最佳化演算法強大且廣泛使用，但它們很容易陷入局部最小值。在這個現代深度學習時代，最先進的 DNN 模型擁有數百萬和數十億個參數，包括權重和偏差，這使得它們在搜尋空間方面成為大規模最佳化問題。調整大量的參數是一項具有挑戰性的任務，它會導致梯度消失/爆炸和過度擬合；同樣地，所使用的損失函數並不能準確地表示我們的目標效能指標。探索廣泛而複雜的解空間的實用解決方案是元啟發式演算法。由於 DNN 超過數千個和數百萬個參數，即使是強大的元啟發式演算法，例如差分演化，在探索和收斂於如此巨大的維度搜尋空間時也會遇到困難，導致收斂速度非常慢且記憶體需求很高。為了應對所提到的維度災難，最近提出了封鎖的概念，這是一種通過將搜尋空間分組成區塊來減少搜尋空間維度的技術。在本研究中，我們旨在介紹基於直方圖的封鎖差分演化 (HBDE)，這是一種將基於梯度和無梯度演算法混合起來以最佳化參數的新方法。實驗結果表明，HBDE 可以通過元啟發式演算法（即所提出的 HBDE）將 ResNet-18 模型中的參數從 11M 減少到 3K，而基於梯度的基線和父級無梯度 DE 演算法在 CIFAR-10 和 CIFAR-100 資料集上的評估結果則顯示了其有效性，首次減少了運算需求。", "author": "Rasa Khosrowshahli et.al.", "authors": "Rasa Khosrowshahli, Shahryar Rahnamayan, Beatrice Ombuki-Berman", "id": "2408.07194v1", "paper_url": "http://arxiv.org/abs/2408.07194v1", "repo": "null"}}