{"2502.10768": {"publish_time": "2025-02-15", "title": "Evaluating improvements on using Large Language Models (LLMs) for property extraction in the Open Research Knowledge Graph (ORKG)", "paper_summary": "Current research highlights the great potential of Large Language Models\n(LLMs) for constructing Scholarly Knowledge Graphs (SKGs). One particularly\ncomplex step in this process is relation extraction, aimed at identifying\nsuitable properties to describe the content of research. This study builds\ndirectly on previous research of three Open Research Knowledge Graph (ORKG)\nteam members who assessed the readiness of LLMs such as GPT-3.5, Llama 2, and\nMistral for property extraction in scientific literature. Given the moderate\nperformance observed, the previous work concluded that fine-tuning is needed to\nimprove these models' alignment with scientific tasks and their emulation of\nhuman expertise. Expanding on this prior experiment, this study evaluates the\nimpact of advanced prompt engineering techniques and demonstrates that these\ntechniques can highly significantly enhance the results. Additionally, this\nstudy extends the property extraction process to include property matching to\nexisting ORKG properties, which are retrieved via the API. The evaluation\nreveals that results generated through advanced prompt engineering achieve a\nhigher proportion of matches with ORKG properties, further emphasizing the\nenhanced alignment achieved. Moreover, this lays the groundwork for addressing\nchallenges such as the inconsistency of ORKG properties, an issue highlighted\nin prior studies. By assigning unique URIs and using standardized terminology,\nthis work increases the consistency of the properties, fulfilling a crucial\naspect of Linked Data and FAIR principles - core commitments of ORKG. This, in\nturn, significantly enhances the applicability of ORKG content for subsequent\ntasks such as comparisons of research publications. Finally, the study\nconcludes with recommendations for future improvements in the overall property\nextraction process.", "paper_summary_zh": "<paragraph>目前的調查強調大語言模型 (LLM) 在建構學術知識圖譜 (SKG) 上的巨大潛力。此過程中特別複雜的步驟是關係萃取，目標是找出合適的屬性來描述研究內容。本研究直接建立在三位開放研究知識圖譜 (ORKG) 團隊成員先前研究的基礎上，他們評估了 GPT-3.5、Llama 2 和 Mistral 等 LLM 在科學文獻中萃取屬性的準備情況。鑑於觀察到的表現中等，先前的研究結論是需要微調，以改善這些模型與科學任務的一致性，以及它們對人類專業知識的模擬。本研究擴展了先前的實驗，評估了進階提示工程技術的影響，並證明這些技術可以大幅顯著地提升結果。此外，本研究將屬性萃取流程擴展到包含與現有 ORKG 屬性的屬性比對，這些屬性是透過 API 擷取的。評估結果顯示，透過進階提示工程產生的結果與 ORKG 屬性有更高的比對比例，進一步強調所達成的進階一致性。此外，這也為了解決先前的研究中強調的問題，例如 ORKG 屬性的不一致性，奠定了基礎。透過指定唯一的 URI 並使用標準化的術語，本研究增加了屬性的相容性，達成了連結資料和 FAIR 原則的重要層面，這是 ORKG 的核心承諾。這反過來大幅提升了 ORKG 內容在後續任務中的適用性，例如研究出版品的比較。最後，本研究以針對整體屬性萃取流程未來改進的建議作為結論。</paragraph>", "author": "Sandra Schaftner et.al.", "authors": "Sandra Schaftner", "id": "2502.10768v1", "paper_url": "http://arxiv.org/abs/2502.10768v1", "repo": "null"}}