{"2503.10638": {"publish_time": "2025-03-13", "title": "Studying Classifier(-Free) Guidance From a Classifier-Centric Perspective", "paper_summary": "Classifier-free guidance has become a staple for conditional generation with\ndenoising diffusion models. However, a comprehensive understanding of\nclassifier-free guidance is still missing. In this work, we carry out an\nempirical study to provide a fresh perspective on classifier-free guidance.\nConcretely, instead of solely focusing on classifier-free guidance, we trace\nback to the root, i.e., classifier guidance, pinpoint the key assumption for\nthe derivation, and conduct a systematic study to understand the role of the\nclassifier. We find that both classifier guidance and classifier-free guidance\nachieve conditional generation by pushing the denoising diffusion trajectories\naway from decision boundaries, i.e., areas where conditional information is\nusually entangled and is hard to learn. Based on this classifier-centric\nunderstanding, we propose a generic postprocessing step built upon\nflow-matching to shrink the gap between the learned distribution for a\npre-trained denoising diffusion model and the real data distribution, majorly\naround the decision boundaries. Experiments on various datasets verify the\neffectiveness of the proposed approach.", "paper_summary_zh": "<paragraph>無分類器引導已成為使用去噪擴散模型進行條件生成的必要條件。然而，目前仍缺乏對無分類器引導的全面理解。在這項工作中，我們進行了一項實證研究，以提供對無分類器引導的全新視角。具體來說，我們沒有只關注無分類器引導，而是追溯到根本，即分類器引導，精確指出推導的關鍵假設，並進行系統研究以了解分類器的作用。我們發現，分類器引導和無分類器引導都是透過將去噪擴散軌跡推離決策邊界（即條件資訊通常糾纏且難以學習的區域）來實現條件生成。基於這種以分類器為中心的理解，我們提出了一個基於流匹配的通用後處理步驟，以縮小預訓練去噪擴散模型的學習分佈與真實數據分佈之間的差距，主要圍繞決策邊界。在各種數據集上的實驗驗證了所提出方法的有效性。</paragraph>\n", "author": "Xiaoming Zhao et.al.", "authors": "Xiaoming Zhao, Alexander G. Schwing", "id": "2503.10638v1", "paper_url": "http://arxiv.org/abs/2503.10638v1", "repo": "null"}}