{"2410.21869": {"publish_time": "2024-10-29", "title": "Cross-Entropy Is All You Need To Invert the Data Generating Process", "paper_summary": "Supervised learning has become a cornerstone of modern machine learning, yet\na comprehensive theory explaining its effectiveness remains elusive. Empirical\nphenomena, such as neural analogy-making and the linear representation\nhypothesis, suggest that supervised models can learn interpretable factors of\nvariation in a linear fashion. Recent advances in self-supervised learning,\nparticularly nonlinear Independent Component Analysis, have shown that these\nmethods can recover latent structures by inverting the data generating process.\nWe extend these identifiability results to parametric instance discrimination,\nthen show how insights transfer to the ubiquitous setting of supervised\nlearning with cross-entropy minimization. We prove that even in standard\nclassification tasks, models learn representations of ground-truth factors of\nvariation up to a linear transformation. We corroborate our theoretical\ncontribution with a series of empirical studies. First, using simulated data\nmatching our theoretical assumptions, we demonstrate successful disentanglement\nof latent factors. Second, we show that on DisLib, a widely-used\ndisentanglement benchmark, simple classification tasks recover latent\nstructures up to linear transformations. Finally, we reveal that models trained\non ImageNet encode representations that permit linear decoding of proxy factors\nof variation. Together, our theoretical findings and experiments offer a\ncompelling explanation for recent observations of linear representations, such\nas superposition in neural networks. This work takes a significant step toward\na cohesive theory that accounts for the unreasonable effectiveness of\nsupervised deep learning.", "paper_summary_zh": "監督式學習已成為現代機器學習的基石，但能解釋其有效性的全面理論仍然難以捉摸。經驗現象，例如神經類比製作和線性表示假設，表明監督模型可以線性方式學習可解釋的變異因子。自監督學習的最新進展，特別是非線性獨立成分分析，表明這些方法可以通過反轉數據生成過程來恢復潛在結構。我們將這些可識別性結果擴展到參數實例判別，然後展示如何將見解轉移到使用交叉熵最小化的普遍監督學習設置中。我們證明，即使在標準分類任務中，模型也會學習表示真實變異因子，直到線性轉換。我們用一系列經驗研究證實了我們的理論貢獻。首先，使用符合我們理論假設的模擬數據，我們展示了潛在因子的成功解纏。其次，我們表明，在廣泛使用的解纏基準 DisLib 上，簡單的分類任務可以恢復線性轉換的潛在結構。最後，我們揭示了在 ImageNet 上訓練的模型編碼表示，允許對變異的代理因子進行線性解碼。我們的理論發現和實驗共同為線性表示的最新觀察提供了一個令人信服的解釋，例如神經網路中的疊加。這項工作朝著一個連貫的理論邁出了重要一步，該理論解釋了監督深度學習的異常有效性。", "author": "Patrik Reizinger et.al.", "authors": "Patrik Reizinger, Alice Bizeul, Attila Juhos, Julia E. Vogt, Randall Balestriero, Wieland Brendel, David Klindt", "id": "2410.21869v1", "paper_url": "http://arxiv.org/abs/2410.21869v1", "repo": "null"}}