{"2412.16089": {"publish_time": "2024-12-20", "title": "The Evolution of LLM Adoption in Industry Data Curation Practices", "paper_summary": "As large language models (LLMs) grow increasingly adept at processing\nunstructured text data, they offer new opportunities to enhance data curation\nworkflows. This paper explores the evolution of LLM adoption among\npractitioners at a large technology company, evaluating the impact of LLMs in\ndata curation tasks through participants' perceptions, integration strategies,\nand reported usage scenarios. Through a series of surveys, interviews, and user\nstudies, we provide a timely snapshot of how organizations are navigating a\npivotal moment in LLM evolution. In Q2 2023, we conducted a survey to assess\nLLM adoption in industry for development tasks (N=84), and facilitated expert\ninterviews to assess evolving data needs (N=10) in Q3 2023. In Q2 2024, we\nexplored practitioners' current and anticipated LLM usage through a user study\ninvolving two LLM-based prototypes (N=12). While each study addressed distinct\nresearch goals, they revealed a broader narrative about evolving LLM usage in\naggregate. We discovered an emerging shift in data understanding from\nheuristic-first, bottom-up approaches to insights-first, top-down workflows\nsupported by LLMs. Furthermore, to respond to a more complex data landscape,\ndata practitioners now supplement traditional subject-expert-created 'golden\ndatasets' with LLM-generated 'silver' datasets and rigorously validated 'super\ngolden' datasets curated by diverse experts. This research sheds light on the\ntransformative role of LLMs in large-scale analysis of unstructured data and\nhighlights opportunities for further tool development.", "paper_summary_zh": "<paragraph>隨著大型語言模型 (LLM) 在處理非結構化文字資料方面的能力日益增進，它們為增強資料策展工作流程提供了新的機會。本文探討了 LLM 在大型科技公司實務工作者間的採用演進，透過參與者的認知、整合策略和回報的使用情境，評估 LLM 在資料策展任務中的影響。透過一系列的調查、訪談和使用者研究，我們提供了組織如何應對 LLM 演化中關鍵時刻的即時概況。在 2023 年第二季，我們進行了一項調查，以評估產業中 LLM 在開發任務中的採用（N=84），並於 2023 年第三季進行專家訪談，以評估不斷變化的資料需求（N=10）。在 2024 年第二季，我們透過一項涉及兩個基於 LLM 的原型之使用者研究，探討了實務工作者目前和預期的 LLM 使用情況（N=12）。雖然每項研究都針對不同的研究目標，但它們揭示了關於 LLM 使用演進的更廣泛敘述。我們發現資料理解從啟發式優先的由下而上方法，轉變為見解優先的由上而下工作流程，而這仰賴 LLM 的支援。此外，為了應對更複雜的資料環境，資料實務工作者現在使用 LLM 生成的「銀色」資料集，以及由不同領域專家策展並經過嚴格驗證的「超級金色」資料集，來補充傳統由主題專家建立的「黃金」資料集。本研究闡明了 LLM 在非結構化資料的大規模分析中扮演的變革性角色，並強調了進一步工具開發的機會。</paragraph>", "author": "Crystal Qian et.al.", "authors": "Crystal Qian, Michael Xieyang Liu, Emily Reif, Grady Simon, Nada Hussein, Nathan Clement, James Wexler, Carrie J. Cai, Michael Terry, Minsuk Kahng", "id": "2412.16089v1", "paper_url": "http://arxiv.org/abs/2412.16089v1", "repo": "null"}}