{"2501.17414": {"publish_time": "2025-01-29", "title": "Reqo: A Robust and Explainable Query Optimization Cost Model", "paper_summary": "In recent years, there has been a growing interest in using machine learning\n(ML) in query optimization to select more efficient plans. Existing\nlearning-based query optimizers use certain model architectures to convert\ntree-structured query plans into representations suitable for downstream ML\ntasks. As the design of these architectures significantly impacts cost\nestimation, we propose a tree model architecture based on Bidirectional Graph\nNeural Networks (Bi-GNN) aggregated by Gated Recurrent Units (GRUs) to achieve\nmore accurate cost estimates. The inherent uncertainty of data and model\nparameters also leads to inaccurate cost estimates, resulting in suboptimal\nplans and less robust query performance. To address this, we implement a novel\nlearning-to-rank cost model that effectively quantifies the uncertainty in cost\nestimates using approximate probabilistic ML. This model adaptively integrates\nquantified uncertainty with estimated costs and learns from comparing pairwise\nplans, achieving more robust performance. In addition, we propose the first\nexplainability technique specifically designed for learning-based cost models.\nThis technique explains the contribution of any subgraphs in the query plan to\nthe final predicted cost, which can be integrated and trained with any\nlearning-based cost model to significantly boost the model's explainability. By\nincorporating these innovations, we propose a cost model for a Robust and\nExplainable Query Optimizer, Reqo, that improves the accuracy, robustness, and\nexplainability of cost estimation, outperforming state-of-the-art approaches in\nall three dimensions.", "paper_summary_zh": "近年来，人们对在查询优化中使用机器学习 (ML) 来选择更有效的计划越来越感兴趣。现有的基于学习的查询优化器使用特定模型架构将树形结构查询计划转换为适合下游 ML 任务的表示。由于这些架构的设计会显著影响成本估算，我们提出了一种基于双向图神经网络 (Bi-GNN) 的树模型架构，该架构由门控循环单元 (GRU) 聚合，以实现更准确的成本估算。数据和模型参数的固有不确定性也会导致成本估算不准确，从而导致计划不理想和查询性能不佳。为了解决这个问题，我们实现了一个新颖的学习排序成本模型，该模型使用近似概率 ML 有效地量化了成本估算中的不确定性。此模型自适应地将量化的不确定性与估计成本相结合，并从比较成对计划中学习，从而实现更稳健的性能。此外，我们提出了第一个专门为基于学习的成本模型设计的可解释性技术。此技术解释了查询计划中任何子图对最终预测成本的贡献，该技术可以与任何基于学习的成本模型集成并进行训练，以显著提高模型的可解释性。通过结合这些创新，我们为稳健且可解释的查询优化器 Reqo 提出了一种成本模型，该模型提高了成本估算的准确性、稳健性和可解释性，在所有三个维度上都优于最先进的方法。", "author": "Baoming Chang et.al.", "authors": "Baoming Chang, Amin Kamali, Verena Kantere", "id": "2501.17414v1", "paper_url": "http://arxiv.org/abs/2501.17414v1", "repo": "https://github.com/baomingchang/reqo-on-postgresql"}}