{"2501.05643": {"publish_time": "2025-01-10", "title": "Iconicity in Large Language Models", "paper_summary": "Lexical iconicity, a direct relation between a word's meaning and its form,\nis an important aspect of every natural language, most commonly manifesting\nthrough sound-meaning associations. Since Large language models' (LLMs') access\nto both meaning and sound of text is only mediated (meaning through textual\ncontext, sound through written representation, further complicated by\ntokenization), we might expect that the encoding of iconicity in LLMs would be\neither insufficient or significantly different from human processing. This\nstudy addresses this hypothesis by having GPT-4 generate highly iconic\npseudowords in artificial languages. To verify that these words actually carry\niconicity, we had their meanings guessed by Czech and German participants\n(n=672) and subsequently by LLM-based participants (generated by GPT-4 and\nClaude 3.5 Sonnet). The results revealed that humans can guess the meanings of\npseudowords in the generated iconic language more accurately than words in\ndistant natural languages and that LLM-based participants are even more\nsuccessful than humans in this task. This core finding is accompanied by\nseveral additional analyses concerning the universality of the generated\nlanguage and the cues that both human and LLM-based participants utilize.", "paper_summary_zh": "語彙標誌性，詞彙意義與形式之間的直接關係，是每種自然語言的重要面向，最常見的表現方式是透過聲音與意義的聯想。由於大型語言模型 (LLM) 對文字的意義和聲音的存取僅透過中介（意義透過文字脈絡，聲音透過書面表述，進一步複雜化的是進行標記化），我們可以預期 LLM 中標誌性的編碼會不足，或與人類處理方式有顯著差異。本研究透過讓 GPT-4 在人工語言中產生高度標誌性的偽詞來探討這個假設。為了驗證這些詞彙實際上具有標誌性，我們請捷克和德國參與者 (n=672) 猜測它們的意義，隨後再請基於 LLM 的參與者 (由 GPT-4 和 Claude 3.5 Sonnet 產生) 猜測。結果顯示，人類猜測在所產生標誌性語言中偽詞的意義，比猜測遠距離自然語言中詞彙的意義更準確，而且基於 LLM 的參與者在這個任務中比人類更成功。這個核心發現伴隨著幾個額外的分析，關於所產生語言的普遍性，以及人類和基於 LLM 的參與者所利用的線索。", "author": "Anna Marklová et.al.", "authors": "Anna Marklová, Jiří Milička, Leonid Ryvkin, Ľudmila Lacková Bennet, Libuše Kormaníková", "id": "2501.05643v1", "paper_url": "http://arxiv.org/abs/2501.05643v1", "repo": "null"}}