{"2409.03219": {"publish_time": "2024-09-05", "title": "Content Moderation by LLM: From Accuracy to Legitimacy", "paper_summary": "One trending application of LLM (large language model) is to use it for\ncontent moderation in online platforms. Most current studies on this\napplication have focused on the metric of accuracy - the extent to which LLM\nmakes correct decisions about content. This article argues that accuracy is\ninsufficient and misleading, because it fails to grasp the distinction between\neasy cases and hard cases as well as the inevitable trade-offs in achieving\nhigher accuracy. Closer examination reveals that content moderation is a\nconstitutive part of platform governance, the key of which is to gain and\nenhance legitimacy. Instead of making moderation decisions correct, the chief\ngoal of LLM is to make them legitimate. In this regard, this article proposes a\nparadigm shift from the single benchmark of accuracy towards a legitimacy-based\nframework of evaluating the performance of LLM moderators. The framework\nsuggests that for easy cases, the key is to ensure accuracy, speed and\ntransparency, while for hard cases, what matters is reasoned justification and\nuser participation. Examined under this framework, LLM's real potential in\nmoderation is not accuracy improvement. Rather, LLM can better contribute in\nfour other aspects: to conduct screening of hard cases from easy cases, to\nprovide quality explanations for moderation decisions, to assist human\nreviewers in getting more contextual information, and to facilitate user\nparticipation in a more interactive way. Using normative theories from law and\nsocial sciences to critically assess the new technological application, this\narticle seeks to redefine LLM's role in content moderation and redirect\nrelevant research in this field.", "paper_summary_zh": "大型語言模型（LLM）的一個熱門應用是將其用於線上平台的內容審核。目前大多數關於此應用的研究都專注於準確度指標，也就是 LLM 對內容做出正確決策的程度。這篇文章認為準確度是不足且具有誤導性的，因為它無法掌握簡單案例與困難案例之間的區別，以及在實現更高準確度時不可避免的權衡取捨。更仔細的檢視顯示，內容審核是平台治理的組成部分，其關鍵在於獲得並提升合法性。LLM 的主要目標並非做出正確的審核決策，而是讓決策合法化。有鑑於此，本文提出了一個典範轉移，從單一的準確度基準轉向以合法性為基礎的 LLM 審核員績效評估架構。該架構建議，對於簡單案例，關鍵在於確保準確度、速度和透明度，而對於困難案例，重要的是有理據的證明和使用者參與。在這個架構下檢視，LLM 在審核中的真正潛力並非準確度提升。相反地，LLM 可以透過以下四個方面做出更好的貢獻：從簡單案例中篩選出困難案例、為審核決策提供品質說明、協助人工審查員取得更多脈絡資訊，以及以更互動的方式促進使用者參與。本文使用法律和社會科學的規範理論來批判性地評估新的技術應用，試圖重新定義 LLM 在內容審核中的角色，並重新導向此領域相關的研究。", "author": "Tao Huang et.al.", "authors": "Tao Huang", "id": "2409.03219v1", "paper_url": "http://arxiv.org/abs/2409.03219v1", "repo": "null"}}