{"2406.04331": {"publish_time": "2024-06-06", "title": "PaCE: Parsimonious Concept Engineering for Large Language Models", "paper_summary": "Large Language Models (LLMs) are being used for a wide variety of tasks.\nWhile they are capable of generating human-like responses, they can also\nproduce undesirable output including potentially harmful information, racist or\nsexist language, and hallucinations. Alignment methods are designed to reduce\nsuch undesirable output, via techniques such as fine-tuning, prompt\nengineering, and representation engineering. However, existing methods face\nseveral challenges: some require costly fine-tuning for every alignment task;\nsome do not adequately remove undesirable concepts, failing alignment; some\nremove benign concepts, lowering the linguistic capabilities of LLMs. To\naddress these issues, we propose Parsimonious Concept Engineering (PaCE), a\nnovel activation engineering framework for alignment. First, to sufficiently\nmodel the concepts, we construct a large-scale concept dictionary in the\nactivation space, in which each atom corresponds to a semantic concept. Then,\ngiven any alignment task, we instruct a concept partitioner to efficiently\nannotate the concepts as benign or undesirable. Finally, at inference time, we\ndecompose the LLM activations along the concept dictionary via sparse coding,\nto accurately represent the activation as a linear combination of the benign\nand undesirable components. By removing the latter ones from the activation, we\nreorient the behavior of LLMs towards alignment goals. We conduct experiments\non tasks such as response detoxification, faithfulness enhancement, and\nsentiment revising, and show that PaCE achieves state-of-the-art alignment\nperformance while maintaining linguistic capabilities.", "paper_summary_zh": "大型語言模型 (LLM) 已用於各種任務。\n雖然它們能夠產生類似人類的回應，但它們也可能\n產生不良的輸出，包括潛在有害訊息、種族或\n性別歧視語言以及幻覺。對齊方法旨在透過微調等技術減少\n這種不良輸出，提示工程和表示工程。然而，現有方法面臨\n一些挑戰：有些需要為每個對齊任務進行昂貴的微調；\n有些無法充分移除不良概念，導致對齊失敗；有些\n移除良性概念，降低 LLM 的語言能力。為了\n解決這些問題，我們提出簡約概念工程 (PaCE)，一種\n用於對齊的新型激活工程框架。首先，為了充分\n建構概念模型，我們在激活空間中建構一個大型概念字典，其中每個原子對應一個語義概念。然後，\n針對任何對齊任務，我們指示概念分割器有效地\n將概念註解為良性或不良。最後，在推理時間，我們\n透過稀疏編碼分解 LLM 激活，沿著概念字典進行，\n以準確地將激活表示為良性和不良組成的線性組合。透過移除後者從激活中，我們\n重新導向 LLM 的行為以朝向對齊目標。我們在回應解毒、忠實度增強和\n情緒修正等任務上進行實驗，並顯示 PaCE 達到最先進的對齊\n效能，同時維持語言能力。", "author": "Jinqi Luo et.al.", "authors": "Jinqi Luo, Tianjiao Ding, Kwan Ho Ryan Chan, Darshan Thaker, Aditya Chattopadhyay, Chris Callison-Burch, René Vidal", "id": "2406.04331v1", "paper_url": "http://arxiv.org/abs/2406.04331v1", "repo": "https://github.com/peterljq/parsimonious-concept-engineering"}}