{"2411.13045": {"publish_time": "2024-11-20", "title": "Explainable LLM-driven Multi-dimensional Distillation for E-Commerce Relevance Learning", "paper_summary": "Effective query-item relevance modeling is pivotal for enhancing user\nexperience and safeguarding user satisfaction in e-commerce search systems.\nRecently, benefiting from the vast inherent knowledge, Large Language Model\n(LLM) approach demonstrates strong performance and long-tail generalization\nability compared with previous neural-based specialized relevance learning\nmethods. Though promising, current LLM-based methods encounter the following\ninadequacies in practice: First, the massive parameters and computational\ndemands make it difficult to be deployed online. Second, distilling LLM models\nto online models is a feasible direction, but the LLM relevance modeling is a\nblack box, and its rich intrinsic knowledge is difficult to extract and apply\nonline. To improve the interpretability of LLM and boost the performance of\nonline relevance models via LLM, we propose an Explainable LLM-driven\nMulti-dimensional Distillation framework for e-commerce relevance learning,\nwhich comprises two core components: (1) An Explainable LLM for relevance\nmodeling (ELLM-rele), which decomposes the relevance learning into intermediate\nsteps and models relevance learning as a Chain-of-Thought (CoT) reasoning,\nthereby enhancing both interpretability and performance of LLM. (2) A\nMulti-dimensional Knowledge Distillation (MKD) architecture that transfers the\nknowledge of ELLM-rele to current deployable interaction-based and\nrepresentation-based student models from both the relevance score distribution\nand CoT reasoning aspects. Through distilling the probabilistic and CoT\nreasoning knowledge, MKD improves both the semantic interaction and long-tail\ngeneralization abilities of student models. Extensive offline evaluations and\nonline experiments on Taobao search ad scene demonstrate that our proposed\nframework significantly enhances e-commerce relevance learning performance and\nuser experience.", "paper_summary_zh": "<paragraph>有效的查詢項目相關性建模對於提升使用者體驗和保障電子商務搜尋系統中的使用者滿意度至關重要。最近，受益於廣泛的內在知識，大型語言模型 (LLM) 方法展現了強大的效能和長尾概化能力，與先前的基於神經網路的專業相關性學習方法相比。儘管有前景，目前的基於 LLM 的方法在實務上仍遇到以下不足：首先，龐大的參數和運算需求使得線上部署困難。其次，將 LLM 模型精簡為線上模型是一個可行的方向，但 LLM 相關性建模是一個黑盒子，其豐富的內在知識難以提取並線上應用。為了提升 LLM 的可解釋性，並透過 LLM 提升線上相關性模型的效能，我們提出了一個可解釋 LLM 驅動的多維度知識萃取架構，用於電子商務相關性學習，其中包含兩個核心組成部分：(1) 一個用於相關性建模的可解釋 LLM (ELLM-rele)，它將相關性學習分解成中間步驟，並將相關性學習建模為一個思考鏈 (CoT) 推理，從而提升 LLM 的可解釋性和效能。(2) 一個多維度知識萃取 (MKD) 架構，它將 ELLM-rele 的知識轉移到目前可部署的基於互動和基於表示的學生模型，從相關性分數分佈和 CoT 推理面向進行轉移。透過萃取機率和 CoT 推理知識，MKD 提升了學生模型的語意互動和長尾概化能力。在淘寶搜尋廣告場景中進行的大量離線評估和線上實驗顯示，我們提出的架構顯著提升了電子商務相關性學習效能和使用者體驗。</paragraph>", "author": "Gang Zhao et.al.", "authors": "Gang Zhao, Ximing Zhang, Chenji Lu, Hui Zhao, Tianshu Wu, Pengjie Wang, Jian Xu, Bo Zheng", "id": "2411.13045v1", "paper_url": "http://arxiv.org/abs/2411.13045v1", "repo": "null"}}