{"2406.17474": {"publish_time": "2024-06-25", "title": "Transformer-based Named Entity Recognition with Combined Data Representation", "paper_summary": "This study examines transformer-based models and their effectiveness in named\nentity recognition tasks. The study investigates data representation\nstrategies, including single, merged, and context, which respectively use one\nsentence, multiple sentences, and sentences joined with attention to context\nper vector. Analysis shows that training models with a single strategy may lead\nto poor performance on different data representations. To address this\nlimitation, the study proposes a combined training procedure that utilizes all\nthree strategies to improve model stability and adaptability. The results of\nthis approach are presented and discussed for four languages (English, Polish,\nCzech, and German) across various datasets, demonstrating the effectiveness of\nthe combined strategy.", "paper_summary_zh": "本研究探討基於 Transformer 的模型及其在命名實體辨識任務中的效能。這項研究調查資料表示策略，包括單一、合併和語境，分別使用一個句子、多個句子和與語境注意力結合的句子作為每個向量的輸入。分析顯示，使用單一策略訓練模型可能會在不同的資料表示上導致效能不佳。為了解決此限制，本研究提出一個結合訓練程序，利用所有三種策略來提升模型的穩定性和適應性。此方法的結果針對四種語言（英語、波蘭語、捷克語和德語）在各種資料集上進行呈現和討論，證明了結合策略的效能。", "author": "Michał Marcińczuk et.al.", "authors": "Michał Marcińczuk", "id": "2406.17474v1", "paper_url": "http://arxiv.org/abs/2406.17474v1", "repo": "null"}}