{"2502.13130": {"publish_time": "2025-02-18", "title": "Magma: A Foundation Model for Multimodal AI Agents", "paper_summary": "We present Magma, a foundation model that serves multimodal AI agentic tasks\nin both the digital and physical worlds. Magma is a significant extension of\nvision-language (VL) models in that it not only retains the VL understanding\nability (verbal intelligence) of the latter, but is also equipped with the\nability to plan and act in the visual-spatial world (spatial-temporal\nintelligence) and complete agentic tasks ranging from UI navigation to robot\nmanipulation. To endow the agentic capabilities, Magma is pretrained on large\namounts of heterogeneous datasets spanning from images, videos to robotics\ndata, where the actionable visual objects (e.g., clickable buttons in GUI) in\nimages are labeled by Set-of-Mark (SoM) for action grounding, and the object\nmovements (e.g., the trace of human hands or robotic arms) in videos are\nlabeled by Trace-of-Mark (ToM) for action planning. Extensive experiments show\nthat SoM and ToM reach great synergy and facilitate the acquisition of\nspatial-temporal intelligence for our Magma model, which is fundamental to a\nwide range of tasks as shown in Fig.1. In particular, Magma creates new\nstate-of-the-art results on UI navigation and robotic manipulation tasks,\noutperforming previous models that are specifically tailored to these tasks. On\nimage and video-related multimodal tasks, Magma also compares favorably to\npopular large multimodal models that are trained on much larger datasets. We\nmake our model and code public for reproducibility at\nhttps://microsoft.github.io/Magma.", "paper_summary_zh": "<paragraph>我們提出 Magma，這是一個基礎模型，用於服務數位和物理世界中的多模態 AI 代理任務。Magma 是視覺語言 (VL) 模型的重大延伸，它不僅保留了後者的 VL 理解能力（語言智能），還具備在視覺空間世界中規劃和行動的能力（時空智能），並完成從 UI 導航到機器人操作的代理任務。為了賦予代理能力，Magma 在從影像、影片到機器人資料的大量異質資料集上進行預訓練，其中影像中的可操作視覺物件（例如 GUI 中的可點擊按鈕）由動作接地 Set-of-Mark (SoM) 標記，影片中的物件動作（例如人手或機器手臂的軌跡）由動作規劃 Trace-of-Mark (ToM) 標記。廣泛的實驗表明，SoM 和 ToM 達到了極大的協同作用，並促進了我們 Magma 模型的時空智能的獲取，這對於圖 1 中所示的各種任務至關重要。特別是，Magma 在 UI 導航和機器人操作任務上創造了新的最先進的結果，優於專門針對這些任務的先前模型。在影像和影片相關的多模態任務上，Magma 也與在更大資料集上訓練的流行大型多模態模型相比，表現得很好。我們公開我們的模型和程式碼，以便在 https://microsoft.github.io/Magma 上重現。</paragraph>", "author": "Jianwei Yang et.al.", "authors": "Jianwei Yang, Reuben Tan, Qianhui Wu, Ruijie Zheng, Baolin Peng, Yongyuan Liang, Yu Gu, Mu Cai, Seonghyeon Ye, Joel Jang, Yuquan Deng, Lars Liden, Jianfeng Gao", "id": "2502.13130v1", "paper_url": "http://arxiv.org/abs/2502.13130v1", "repo": "null"}}