{"2412.10095": {"publish_time": "2024-12-13", "title": "HiTZ at VarDial 2025 NorSID: Overcoming Data Scarcity with Language Transfer and Automatic Data Annotation", "paper_summary": "In this paper we present our submission for the NorSID Shared Task as part of\nthe 2025 VarDial Workshop (Scherrer et al., 2025), consisting of three tasks:\nIntent Detection, Slot Filling and Dialect Identification, evaluated using data\nin different dialects of the Norwegian language. For Intent Detection and Slot\nFilling, we have fine-tuned a multitask model in a cross-lingual setting, to\nleverage the xSID dataset available in 17 languages. In the case of Dialect\nIdentification, our final submission consists of a model fine-tuned on the\nprovided development set, which has obtained the highest scores within our\nexperiments. Our final results on the test set show that our models do not drop\nin performance compared to the development set, likely due to the\ndomain-specificity of the dataset and the similar distribution of both subsets.\nFinally, we also report an in-depth analysis of the provided datasets and their\nartifacts, as well as other sets of experiments that have been carried out but\ndid not yield the best results. Additionally, we present an analysis on the\nreasons why some methods have been more successful than others; mainly the\nimpact of the combination of languages and domain-specificity of the training\ndata on the results.", "paper_summary_zh": "<paragraph>在本文中，我們提交了我們對 NorSID 共享任務的提交，作為 2025 VarDial 研討會（Scherrer 等人，2025 年）的一部分，包括三個任務：意圖偵測、槽位填補和方言辨識，使用挪威語不同方言的資料進行評估。對於意圖偵測和槽位填補，我們在跨語言設定中微調了一個多任務模型，以利用 17 種語言中可用的 xSID 資料集。在方言辨識的情況下，我們的最終提交包含一個在提供的開發設定上微調的模型，該模型在我們的實驗中獲得了最高分。我們在測試設定上的最終結果顯示，與開發設定相比，我們的模型的效能沒有下降，這可能是由於資料集的特定領域和兩個子集的相似分佈。最後，我們還報告了對提供的資料集及其人工製品的深入分析，以及已執行但未產生最佳結果的其他實驗組。此外，我們分析了某些方法比其他方法更成功的原因；主要是語言組合和訓練資料的特定領域對結果的影響。</paragraph>", "author": "Jaione Bengoetxea et.al.", "authors": "Jaione Bengoetxea, Mikel Zubillaga, Ekhi Azurmendi, Maite Heredia, Julen Etxaniz, Markel Ferro, Jeremy Barnes", "id": "2412.10095v1", "paper_url": "http://arxiv.org/abs/2412.10095v1", "repo": "null"}}