{"2406.20079": {"publish_time": "2024-06-28", "title": "Molecular Facts: Desiderata for Decontextualization in LLM Fact Verification", "paper_summary": "Automatic factuality verification of large language model (LLM) generations\nis becoming more and more widely used to combat hallucinations. A major point\nof tension in the literature is the granularity of this fact-checking: larger\nchunks of text are hard to fact-check, but more atomic facts like propositions\nmay lack context to interpret correctly. In this work, we assess the role of\ncontext in these atomic facts. We argue that fully atomic facts are not the\nright representation, and define two criteria for molecular facts:\ndecontextuality, or how well they can stand alone, and minimality, or how\nlittle extra information is added to achieve decontexuality. We quantify the\nimpact of decontextualization on minimality, then present a baseline\nmethodology for generating molecular facts automatically, aiming to add the\nright amount of information. We compare against various methods of\ndecontextualization and find that molecular facts balance minimality with fact\nverification accuracy in ambiguous settings.", "paper_summary_zh": "大型語言模型 (LLM) 生成的自動事實驗證正變得越來越廣泛地用於對抗幻覺。文獻中的一個主要爭論點是這個事實查核的粒度：較大的文本塊很難進行事實查核，但像命題這樣的更原子的事實可能缺乏正確解釋的背景。在這項工作中，我們評估了背景在這些原子事實中的作用。我們認為完全原子的事實並不是正確的表示，並定義了分子事實的兩個標準：去脈絡化，或它們可以獨立存在的程度，以及最少化，或為了實現去脈絡化而添加的額外資訊有多少。我們量化了去脈絡化對最少化的影響，然後提出了一種生成分子事實的基準方法，旨在添加適量的資訊。我們與各種去脈絡化方法進行比較，並發現分子事實平衡了最小化和在模棱兩可的環境中進行事實驗證的準確性。", "author": "Anisha Gunjal et.al.", "authors": "Anisha Gunjal, Greg Durrett", "id": "2406.20079v1", "paper_url": "http://arxiv.org/abs/2406.20079v1", "repo": "https://github.com/anisha2102/molecular_facts"}}