{"2407.20777": {"publish_time": "2024-07-30", "title": "Metaheuristic Enhanced with Feature-Based Guidance and Diversity Management for Solving the Capacitated Vehicle Routing Problem", "paper_summary": "We propose a metaheuristic algorithm enhanced with feature-based guidance\nthat is designed to solve the Capacitated Vehicle Routing Problem (CVRP). To\nformulate the proposed guidance, we developed and explained a supervised\nMachine Learning (ML) model, that is used to formulate the guidance and control\nthe diversity of the solution during the optimization process. We propose a\nmetaheuristic algorithm combining neighborhood search and a novel mechanism of\nhybrid split and path relinking to implement the proposed guidance. The\nproposed guidance has proven to give a statistically significant improvement to\nthe proposed metaheuristic algorithm when solving CVRP. Moreover, the proposed\nguided metaheuristic is also capable of producing competitive solutions among\nstate-of-the-art metaheuristic algorithms.", "paper_summary_zh": "我們提出了一種增強型元啟發式演算法，其中包含基於特徵的引導，旨在解決容量限制載具路徑問題 (CVRP)。為了制定建議的引導，我們開發並解釋了一個監督式機器學習 (ML) 模型，用於制定引導並控制最佳化過程中解的多樣性。我們提出了一種元啟發式演算法，結合鄰域搜尋和混合分割和路徑重新連結的新機制來實作建議的引導。建議的引導已被證明在解決 CVRP 時，可以顯著改善建議的元啟發式演算法。此外，建議的引導式元啟發式演算法也能够在最先進的元啟發式演算法中產生具有競爭力的解。", "author": "Bachtiar Herdianto et.al.", "authors": "Bachtiar Herdianto, Romain Billot, Flavien Lucas, Marc Sevaux", "id": "2407.20777v1", "paper_url": "http://arxiv.org/abs/2407.20777v1", "repo": "null"}}