{"2501.09431": {"publish_time": "2025-01-16", "title": "A Survey on Responsible LLMs: Inherent Risk, Malicious Use, and Mitigation Strategy", "paper_summary": "While large language models (LLMs) present significant potential for\nsupporting numerous real-world applications and delivering positive social\nimpacts, they still face significant challenges in terms of the inherent risk\nof privacy leakage, hallucinated outputs, and value misalignment, and can be\nmaliciously used for generating toxic content and unethical purposes after been\njailbroken. Therefore, in this survey, we present a comprehensive review of\nrecent advancements aimed at mitigating these issues, organized across the four\nphases of LLM development and usage: data collecting and pre-training,\nfine-tuning and alignment, prompting and reasoning, and post-processing and\nauditing. We elaborate on the recent advances for enhancing the performance of\nLLMs in terms of privacy protection, hallucination reduction, value alignment,\ntoxicity elimination, and jailbreak defenses. In contrast to previous surveys\nthat focus on a single dimension of responsible LLMs, this survey presents a\nunified framework that encompasses these diverse dimensions, providing a\ncomprehensive view of enhancing LLMs to better serve real-world applications.", "paper_summary_zh": "儘管大型語言模型 (LLM) 在支援許多真實世界的應用程式和產生正面的社會影響方面具有顯著的潛力，但它們在固有的隱私外洩風險、虛構產出和價值偏差方面仍面臨重大的挑戰，而且在被破解後可能會被惡意用於產生有毒內容和不道德的目的。因此，在本次調查中，我們對旨在減輕這些問題的最新進展進行了全面的回顧，並針對 LLM 開發和使用的四個階段進行整理：資料收集和預訓練、微調和校準、提示和推理，以及後處理和稽核。我們詳細說明了在隱私保護、減少虛構、價值校準、消除毒性以及破解防禦方面增強 LLM 效能的最新進展。與先前僅關注負責任的 LLM 單一面向的調查相比，本調查提出了涵蓋這些不同面向的統一架構，提供了增強 LLM 以更好地服務於真實世界應用程式的全面觀點。", "author": "Huandong Wang et.al.", "authors": "Huandong Wang, Wenjie Fu, Yingzhou Tang, Zhilong Chen, Yuxi Huang, Jinghua Piao, Chen Gao, Fengli Xu, Tao Jiang, Yong Li", "id": "2501.09431v1", "paper_url": "http://arxiv.org/abs/2501.09431v1", "repo": "null"}}