{"2407.04808": {"publish_time": "2024-07-05", "title": "Brain Age Estimation with a Greedy Dual-Stream Model for Limited Datasets", "paper_summary": "Brain age estimation involves predicting the biological age of individuals\nfrom their brain images, which offers valuable insights into the aging process\nand the progression of neurodegenerative diseases. Conducting large-scale\ndatasets for medical image analysis is a challenging and time-consuming task.\nExisting approaches mostly depend on large datasets, which are hard to come by\nand expensive. These approaches also require sophisticated, resource-intensive\nmodels with a large number of parameters, necessitating a considerable amount\nof processing power. As a result, there is a vital need to develop innovative\nmethods that can achieve robust performance with limited datasets and efficient\nuse of computational resources. This paper proposes a novel slice-based\ndual-stream method called GDSM (Greedy Dual-Stream Model) for brain age\nestimation. This method addresses the limitations of large dataset requirements\nand computational resource intensiveness. The proposed method incorporates\nlocal and global aspects of the brain, thereby refining the focus on specific\ntarget regions. The approach employs four backbones to predict ages based on\nlocal and global features, complemented by a final model for age correction.\nOur method demonstrates a Mean Absolute Error (MAE) of 3.25 years on the test\nset of IBID, which only contains 289 subjects. To demonstrate the robustness of\nour approach for any small dataset, we analyzed the proposed method with the\nIXI dataset and achieved an MAE of 4.18 years on the test set of IXI. By\nleveraging dual-stream and greedy strategies, this approach achieves efficiency\nand robust performance, making it comparable with other state-of-the-art\nmethods. The code for the GDSM model is available at\nhttps://github.com/iman2693/GDSM.", "paper_summary_zh": "大腦年齡估計涉及從大腦影像預測個體的生物年齡，這對老化過程和神經退化性疾病的進展提供了寶貴的見解。對醫學影像分析進行大規模的數據集處理是一項具有挑戰性且耗時的任務。現有的方法大多依賴於大型數據集，而這些數據集難以獲得且昂貴。這些方法還需要複雜的、資源密集型的模型，這些模型具有大量的參數，需要大量的處理能力。因此，迫切需要開發創新的方法，這些方法可以在有限的數據集和高效利用計算資源的情況下實現穩健的性能。本文提出了一種稱為 GDSM（貪婪雙流模型）的新型基於切片的雙流方法，用於大腦年齡估計。這種方法解決了對大型數據集需求和計算資源密集性的限制。所提出的方法結合了大腦的局部和全局方面，從而精確關注具體的目標區域。該方法採用四個主幹根據局部和全局特徵預測年齡，並輔以一個最終模型進行年齡校正。我們的模型在僅包含 289 個受試者的 IBID 測試集中展示了 3.25 年的平均絕對誤差 (MAE)。為了證明我們的模型對任何小型數據集的穩健性，我們使用 IXI 數據集分析了所提出的方法，並在 IXI 的測試集中實現了 4.18 年的 MAE。通過利用雙流和貪婪策略，這種方法實現了高效和穩健的性能，使其與其他最先進的方法相當。GDSM 模型的代碼可在 https://github.com/iman2693/GDSM 上獲得。", "author": "Iman Kianian et.al.", "authors": "Iman Kianian, Hedieh Sajedi", "id": "2407.04808v1", "paper_url": "http://arxiv.org/abs/2407.04808v1", "repo": "https://github.com/iman2693/gdsm"}}