{"2412.20505": {"publish_time": "2024-12-29", "title": "Planning, Living and Judging: A Multi-agent LLM-based Framework for Cyclical Urban Planning", "paper_summary": "Urban regeneration presents significant challenges within the context of\nurbanization, requiring adaptive approaches to tackle evolving needs.\nLeveraging advancements in large language models (LLMs), we propose Cyclical\nUrban Planning (CUP), a new paradigm that continuously generates, evaluates,\nand refines urban plans in a closed-loop. Specifically, our multi-agent\nLLM-based framework consists of three key components: (1) Planning, where LLM\nagents generate and refine urban plans based on contextual data; (2) Living,\nwhere agents simulate the behaviors and interactions of residents, modeling\nlife in the urban environment; and (3) Judging, which involves evaluating plan\neffectiveness and providing iterative feedback for improvement. The cyclical\nprocess enables a dynamic and responsive planning approach. Experiments on the\nreal-world dataset demonstrate the effectiveness of our framework as a\ncontinuous and adaptive planning process.", "paper_summary_zh": "城市更新在都市化的背景下提出了重大挑戰，需要採用適應性方法來因應不斷變化的需求。\n利用大型語言模型 (LLM) 的進展，我們提出循環城市規劃 (CUP)，這是一個新的範例，可以持續在閉環中產生、評估和改善城市計畫。具體來說，我們基於多代理 LLM 的架構包含三個關鍵組成部分：(1) 規劃，其中 LLM 代理根據脈絡數據產生和改善城市規劃；(2) 生活，其中代理模擬居民的行為和互動，模擬城市環境中的生活；(3) 評斷，其中包括評估計畫的有效性並提供反覆的回饋以進行改善。循環過程能實現動態且靈敏的規劃方法。在真實世界資料集上的實驗證明了我們架構作為持續且適應性規劃過程的有效性。", "author": "Hang Ni et.al.", "authors": "Hang Ni, Yuzhi Wang, Hao Liu", "id": "2412.20505v1", "paper_url": "http://arxiv.org/abs/2412.20505v1", "repo": "null"}}