{"2407.06590": {"publish_time": "2024-07-09", "title": "Revolutionizing Battery Disassembly: The Design and Implementation of a Battery Disassembly Autonomous Mobile Manipulator Robot(BEAM-1)", "paper_summary": "The efficient disassembly of end-of-life electric vehicle batteries(EOL-EVBs)\nis crucial for green manufacturing and sustainable development. The current\npre-programmed disassembly conducted by the Autonomous Mobile Manipulator\nRobot(AMMR) struggles to meet the disassembly requirements in dynamic\nenvironments, complex scenarios, and unstructured processes. In this paper, we\npropose a Battery Disassembly AMMR(BEAM-1) system based on NeuralSymbolic AI.\nIt detects the environmental state by leveraging a combination of multi-sensors\nand neural predicates and then translates this information into a\nquasi-symbolic space. In real-time, it identifies the optimal sequence of\naction primitives through LLM-heuristic tree search, ensuring high-precision\nexecution of these primitives. Additionally, it employs positional speculative\nsampling using intuitive networks and achieves the disassembly of various bolt\ntypes with a meticulously designed end-effector. Importantly, BEAM-1 is a\ncontinuously learning embodied intelligence system capable of subjective\nreasoning like a human, and possessing intuition. A large number of real scene\nexperiments have proved that it can autonomously perceive, decide, and execute\nto complete the continuous disassembly of bolts in multiple, multi-category,\nand complex situations, with a success rate of 98.78%. This research attempts\nto use NeuroSymbolic AI to give robots real autonomous reasoning, planning, and\nlearning capabilities. BEAM-1 realizes the revolution of battery disassembly.\nIts framework can be easily ported to any robotic system to realize different\napplication scenarios, which provides a ground-breaking idea for the design and\nimplementation of future embodied intelligent robotic systems.", "paper_summary_zh": "<paragraph>高效拆解报废电动汽车电池（EOL-EVB）对于绿色制造和可持续发展至关重要。当前由自主移动机械手机器人（AMMR）执行的预编程拆解难以满足动态环境、复杂场景和非结构化流程中的拆解要求。在本文中，我们提出了一种基于神经符号 AI 的电池拆解 AMMR（BEAM-1）系统。它通过利用多传感器和神经谓词的组合来检测环境状态，然后将此信息转换为准符号空间。在实时中，它通过 LLM 启发式树搜索识别出最佳的动作基元序列，确保这些基元的执行高精度。此外，它使用直觉网络采用位置推测采样，并使用精心设计的末端执行器实现各种螺栓类型的拆解。重要的是，BEAM-1 是一个持续学习的具身智能系统，能够像人类一样进行主观推理，并具有直觉。大量真实场景实验表明，它可以在多重、多类别和复杂的情况下自主感知、决策和执行，以完成螺栓的连续拆解，成功率为 98.78%。本研究尝试使用神经符号 AI 为机器人提供真正的自主推理、规划和学习能力。BEAM-1 实现了电池拆解的革命。其框架可以轻松移植到任何机器人系统中以实现不同的应用场景，这为未来具身智能机器人系统的设计和实现提供了突破性的思路。</paragraph>", "author": "Yanlong Peng et.al.", "authors": "Yanlong Peng, Zhigang Wang, Yisheng Zhang, Shengmin Zhang, Nan Cai, Fan Wu, Ming Chen", "id": "2407.06590v1", "paper_url": "http://arxiv.org/abs/2407.06590v1", "repo": "null"}}