{"2405.04212": {"publish_time": "2024-05-07", "title": "Green Tsetlin Redefining Efficiency in Tsetlin Machine Frameworks", "paper_summary": "Green Tsetlin (GT) is a Tsetlin Machine (TM) framework developed to solve\nreal-world problems using TMs. Several frameworks already exist that provide\naccess to TM implementations. However, these either lack features or have a\nresearch-first focus. GT is an easy-to-use framework that aims to lower the\ncomplexity and provide a production-ready TM implementation that is great for\nexperienced practitioners and beginners. To this end, GT establishes a clear\nseparation between training and inference. A C++ backend with a Python\ninterface provides competitive training and inference performance, with the\noption of running in pure Python. It also integrates support for critical\ncomponents such as exporting trained models, hyper-parameter search, and\ncross-validation out-of-the-box.", "paper_summary_zh": "Green Tsetlin (GT) 是一個 Tsetlin Machine (TM) 框架，用於使用 TM 解決實際問題。已經存在多個框架，提供對 TM 實作的存取。然而，這些框架不是缺少功能，就是以研究為優先。GT 是一個易於使用的框架，旨在降低複雜性，並提供一個對經驗豐富的從業者和初學者都很棒的生產就緒 TM 實作。為此，GT 在訓練和推論之間建立了明確的分離。具有 Python 介面的 C++ 後端提供具有競爭力的訓練和推論效能，並可選擇以純 Python 執行。它還整合了對關鍵元件的支援，例如匯出訓練過的模型、超參數搜尋和交叉驗證開箱即用。", "author": "Sondre Glimsdal et.al.", "authors": "Sondre Glimsdal, Sebastian Østby, Tobias M. Brambo, Eirik M. Vinje", "id": "2405.04212v1", "paper_url": "http://arxiv.org/abs/2405.04212v1", "repo": "null"}}