{"2405.05876": {"publish_time": "2024-05-09", "title": "Composable Part-Based Manipulation", "paper_summary": "In this paper, we propose composable part-based manipulation (CPM), a novel\napproach that leverages object-part decomposition and part-part correspondences\nto improve learning and generalization of robotic manipulation skills. By\nconsidering the functional correspondences between object parts, we\nconceptualize functional actions, such as pouring and constrained placing, as\ncombinations of different correspondence constraints. CPM comprises a\ncollection of composable diffusion models, where each model captures a\ndifferent inter-object correspondence. These diffusion models can generate\nparameters for manipulation skills based on the specific object parts.\nLeveraging part-based correspondences coupled with the task decomposition into\ndistinct constraints enables strong generalization to novel objects and object\ncategories. We validate our approach in both simulated and real-world\nscenarios, demonstrating its effectiveness in achieving robust and generalized\nmanipulation capabilities.", "paper_summary_zh": "在本文中，我們提出可組成部分式操作 (CPM)，這是一種新穎的方法，它利用物件部分分解和部分對應來改善機器人操作技能的學習和概化。透過考量物件部分之間的功能對應，我們將功能動作（例如倒水和受限放置）概念化為不同對應約束的組合。CPM 包含一組可組成的擴散模型，其中每個模型都擷取不同的物件間對應。這些擴散模型可根據特定的物件部分產生操作技能的參數。利用部分對應以及將任務分解為不同約束，能對新物件和物件類別進行強大的概化。我們在模擬和真實世界的場景中驗證了我們的做法，證明了其在達成穩健且概化的操作能力方面的有效性。", "author": "Weiyu Liu et.al.", "authors": "Weiyu Liu, Jiayuan Mao, Joy Hsu, Tucker Hermans, Animesh Garg, Jiajun Wu", "id": "2405.05876v1", "paper_url": "http://arxiv.org/abs/2405.05876v1", "repo": "null"}}