{"2412.19178": {"publish_time": "2024-12-26", "title": "Reversed in Time: A Novel Temporal-Emphasized Benchmark for Cross-Modal Video-Text Retrieval", "paper_summary": "Cross-modal (e.g. image-text, video-text) retrieval is an important task in\ninformation retrieval and multimodal vision-language understanding field.\nTemporal understanding makes video-text retrieval more challenging than\nimage-text retrieval. However, we find that the widely used video-text\nbenchmarks have shortcomings in comprehensively assessing abilities of models,\nespecially in temporal understanding, causing large-scale image-text\npre-trained models can already achieve comparable zero-shot performance with\nvideo-text pre-trained models. In this paper, we introduce RTime, a novel\ntemporal-emphasized video-text retrieval dataset. We first obtain videos of\nactions or events with significant temporality, and then reverse these videos\nto create harder negative samples. We then recruit annotators to judge the\nsignificance and reversibility of candidate videos, and write captions for\nqualified videos. We further adopt GPT-4 to extend more captions based on\nhuman-written captions. Our RTime dataset currently consists of 21k videos with\n10 captions per video, totalling about 122 hours. Based on RTime, we propose\nthree retrieval benchmark tasks: RTime-Origin, RTime-Hard, and RTime-Binary. We\nfurther enhance the use of harder-negatives in model training, and benchmark a\nvariety of video-text models on RTime. Extensive experiment analysis proves\nthat RTime indeed poses new and higher challenges to video-text retrieval. We\nrelease our RTime\ndataset\\footnote{\\url{https://github.com/qyr0403/Reversed-in-Time}} to further\nadvance video-text retrieval and multimodal understanding research.", "paper_summary_zh": "跨模態（例如圖片文字、影片文字）檢索在資訊檢索和多模態視覺語言理解領域中是一項重要的任務。\n時間理解讓影片文字檢索比圖片文字檢索更具挑戰性。然而，我們發現廣泛使用的影片文字基準在全面評估模型的能力方面有其不足之處，特別是在時間理解方面，導致大規模的圖片文字預訓練模型已經可以與影片文字預訓練模型達到相當的零次學習效能。在本文中，我們介紹了 RTime，一個新的強調時間的影片文字檢索資料集。我們首先取得具有顯著時間性的動作或事件影片，然後反轉這些影片以建立更困難的負面樣本。接著我們招募註解者來判斷候選影片的重要性和可逆性，並為合格的影片撰寫字幕。我們進一步採用 GPT-4，根據人工撰寫的字幕延伸更多字幕。我們的 RTime 資料集目前包含 21k 個影片，每個影片有 10 個字幕，總計約 122 小時。根據 RTime，我們提出了三項檢索基準任務：RTime-Origin、RTime-Hard 和 RTime-Binary。我們進一步加強在模型訓練中使用更困難的負面樣本，並在 RTime 上評定了各種影片文字模型。廣泛的實驗分析證明，RTime 確實對影片文字檢索提出了新的、更嚴峻的挑戰。我們釋出我們的 RTime 資料集\\footnote{\\url{https://github.com/qyr0403/Reversed-in-Time}}，以進一步推進影片文字檢索和多模態理解研究。", "author": "Yang Du et.al.", "authors": "Yang Du, Yuqi Liu, Qin Jin", "id": "2412.19178v1", "paper_url": "http://arxiv.org/abs/2412.19178v1", "repo": "https://github.com/qyr0403/reversed-in-time"}}