{"2407.10949": {"publish_time": "2024-07-15", "title": "Representing Rule-based Chatbots with Transformers", "paper_summary": "Transformer-based chatbots can conduct fluent, natural-sounding\nconversations, but we have limited understanding of the mechanisms underlying\ntheir behavior. Prior work has taken a bottom-up approach to understanding\nTransformers by constructing Transformers for various synthetic and formal\nlanguage tasks, such as regular expressions and Dyck languages. However, it is\nnot obvious how to extend this approach to understand more naturalistic\nconversational agents. In this work, we take a step in this direction by\nconstructing a Transformer that implements the ELIZA program, a classic,\nrule-based chatbot. ELIZA illustrates some of the distinctive challenges of the\nconversational setting, including both local pattern matching and long-term\ndialog state tracking. We build on constructions from prior work -- in\nparticular, for simulating finite-state automata -- showing how simpler\nconstructions can be composed and extended to give rise to more sophisticated\nbehavior. Next, we train Transformers on a dataset of synthetically generated\nELIZA conversations and investigate the mechanisms the models learn. Our\nanalysis illustrates the kinds of mechanisms these models tend to prefer -- for\nexample, models favor an induction head mechanism over a more precise, position\nbased copying mechanism; and using intermediate generations to simulate\nrecurrent data structures, like ELIZA's memory mechanisms. Overall, by drawing\nan explicit connection between neural chatbots and interpretable, symbolic\nmechanisms, our results offer a new setting for mechanistic analysis of\nconversational agents.", "paper_summary_zh": "基於 Transformer 的聊天機器人可以進行流暢、聽起來很自然的對話，但我們對於其行為背後機制的了解有限。先前的工作已採取自下而上的方式來了解 Transformer，方法是為各種合成和形式語言任務（例如正規表達式和 Dyck 語言）建構 Transformer。然而，如何延伸此方法來了解更自然的對話代理程式並不明顯。在這項工作中，我們透過建構一個實作 ELIZA 程式（一種經典的基於規則的聊天機器人）的 Transformer，朝這個方向邁出了一步。ELIZA 說明了對話設定中的一些獨特挑戰，包括局部模式比對和長期對話狀態追蹤。我們建立在先前工作的建構之上，特別是對於模擬有限狀態自動機，展示如何將較簡單的建構組合並延伸，以產生更精密的行為。接下來，我們在一個合成產生的 ELIZA 對話資料集上訓練 Transformer，並探討模型學習的機制。我們的分析說明了這些模型傾向於偏好的機制類型，例如，模型偏好歸納頭機制，而非更精確的基於位置的複製機制；以及使用中間生成來模擬遞迴資料結構，例如 ELIZA 的記憶機制。總的來說，透過在神經聊天機器人與可解釋的符號機制之間建立明確的連結，我們的結果為對話代理程式的機制分析提供了新的設定。", "author": "Dan Friedman et.al.", "authors": "Dan Friedman, Abhishek Panigrahi, Danqi Chen", "id": "2407.10949v1", "paper_url": "http://arxiv.org/abs/2407.10949v1", "repo": "https://github.com/princeton-nlp/eliza-transformer"}}