{"2408.12494": {"publish_time": "2024-08-22", "title": "GenderCARE: A Comprehensive Framework for Assessing and Reducing Gender Bias in Large Language Models", "paper_summary": "Large language models (LLMs) have exhibited remarkable capabilities in\nnatural language generation, but they have also been observed to magnify\nsocietal biases, particularly those related to gender. In response to this\nissue, several benchmarks have been proposed to assess gender bias in LLMs.\nHowever, these benchmarks often lack practical flexibility or inadvertently\nintroduce biases. To address these shortcomings, we introduce GenderCARE, a\ncomprehensive framework that encompasses innovative Criteria, bias Assessment,\nReduction techniques, and Evaluation metrics for quantifying and mitigating\ngender bias in LLMs. To begin, we establish pioneering criteria for gender\nequality benchmarks, spanning dimensions such as inclusivity, diversity,\nexplainability, objectivity, robustness, and realisticity. Guided by these\ncriteria, we construct GenderPair, a novel pair-based benchmark designed to\nassess gender bias in LLMs comprehensively. Our benchmark provides standardized\nand realistic evaluations, including previously overlooked gender groups such\nas transgender and non-binary individuals. Furthermore, we develop effective\ndebiasing techniques that incorporate counterfactual data augmentation and\nspecialized fine-tuning strategies to reduce gender bias in LLMs without\ncompromising their overall performance. Extensive experiments demonstrate a\nsignificant reduction in various gender bias benchmarks, with reductions\npeaking at over 90% and averaging above 35% across 17 different LLMs.\nImportantly, these reductions come with minimal variability in mainstream\nlanguage tasks, remaining below 2%. By offering a realistic assessment and\ntailored reduction of gender biases, we hope that our GenderCARE can represent\na significant step towards achieving fairness and equity in LLMs. More details\nare available at https://github.com/kstanghere/GenderCARE-ccs24.", "paper_summary_zh": "大型語言模型 (LLM) 在自然語言生成方面表現出非凡的能力，但它們也被觀察到會放大社會偏見，特別是與性別相關的偏見。為了回應這個問題，已經提出了幾個基準來評估 LLM 中的性別偏見。然而，這些基準通常缺乏實用的靈活性，或者會無意中引入偏見。為了解決這些缺點，我們引入了 GenderCARE，一個全面的框架，其中包含創新的標準、偏見評估、減少技術和評估指標，用於量化和減輕 LLM 中的性別偏見。首先，我們為性別平等基準制定了開創性的標準，涵蓋包容性、多樣性、可解釋性、客觀性、穩健性和現實性等面向。在這些標準的指導下，我們構建了 GenderPair，一個新穎的基於配對的基準，旨在全面評估 LLM 中的性別偏見。我們的基準提供了標準化和現實的評估，包括以前被忽視的性別群體，例如跨性別者和非二元性別者。此外，我們開發了有效的去偏技術，結合了反事實數據擴充和專門的微調策略，以減少 LLM 中的性別偏見，同時不損害其整體性能。大量的實驗證明了各種性別偏見基準的顯著減少，減少幅度最高超過 90%，在 17 個不同的 LLM 中平均降低了 35% 以上。重要的是，這些減少伴隨著主流語言任務的最小變異性，保持在 2% 以下。通過提供對性別偏見的現實評估和量身定制的減少，我們希望我們的 GenderCARE 能代表著邁向在 LLM 中實現公平和正義的重要一步。更多詳情可在 https://github.com/kstanghere/GenderCARE-ccs24 找到。", "author": "Kunsheng Tang et.al.", "authors": "Kunsheng Tang, Wenbo Zhou, Jie Zhang, Aishan Liu, Gelei Deng, Shuai Li, Peigui Qi, Weiming Zhang, Tianwei Zhang, Nenghai Yu", "id": "2408.12494v1", "paper_url": "http://arxiv.org/abs/2408.12494v1", "repo": "https://github.com/kstanghere/gendercare-ccs24"}}