{"2409.05383": {"publish_time": "2024-09-09", "title": "Deep Learning for Video Anomaly Detection: A Review", "paper_summary": "Video anomaly detection (VAD) aims to discover behaviors or events deviating\nfrom the normality in videos. As a long-standing task in the field of computer\nvision, VAD has witnessed much good progress. In the era of deep learning, with\nthe explosion of architectures of continuously growing capability and capacity,\na great variety of deep learning based methods are constantly emerging for the\nVAD task, greatly improving the generalization ability of detection algorithms\nand broadening the application scenarios. Therefore, such a multitude of\nmethods and a large body of literature make a comprehensive survey a pressing\nnecessity. In this paper, we present an extensive and comprehensive research\nreview, covering the spectrum of five different categories, namely,\nsemi-supervised, weakly supervised, fully supervised, unsupervised and open-set\nsupervised VAD, and we also delve into the latest VAD works based on\npre-trained large models, remedying the limitations of past reviews in terms of\nonly focusing on semi-supervised VAD and small model based methods. For the VAD\ntask with different levels of supervision, we construct a well-organized\ntaxonomy, profoundly discuss the characteristics of different types of methods,\nand show their performance comparisons. In addition, this review involves the\npublic datasets, open-source codes, and evaluation metrics covering all the\naforementioned VAD tasks. Finally, we provide several important research\ndirections for the VAD community.", "paper_summary_zh": "影片異常偵測（VAD）旨在找出影片中偏離正常情況的行為或事件。作為電腦視覺領域中一項長期的任務，VAD 已見證許多良好的進展。在深度學習的時代，隨著架構不斷增長的能力和容量爆炸，各種基於深度學習的方法不斷湧現，用於 VAD 任務，大大提高了偵測演算法的泛化能力，並擴展了應用場景。因此，如此眾多的方法和大量的文獻使得全面的調查迫在眉睫。在本文中，我們提出了一項廣泛且全面的研究回顧，涵蓋了五種類別的範圍，即半監督、弱監督、完全監督、無監督和開放集監督 VAD，我們也深入探討了基於預訓練大型模型的最新 VAD 作品，彌補過去僅專注於半監督 VAD 和小型模型方法的回顧限制。對於具有不同監督層級的 VAD 任務，我們建構了一個組織良好的分類法，深入探討不同類型方法的特徵，並展示其效能比較。此外，此回顧涉及公開資料集、開源程式碼和評估指標，涵蓋所有上述 VAD 任務。最後，我們為 VAD 社群提供了幾個重要的研究方向。", "author": "Peng Wu et.al.", "authors": "Peng Wu, Chengyu Pan, Yuting Yan, Guansong Pang, Peng Wang, Yanning Zhang", "id": "2409.05383v1", "paper_url": "http://arxiv.org/abs/2409.05383v1", "repo": "null"}}