{"2503.09091": {"publish_time": "2025-03-12", "title": "Multi-Modal Foundation Models for Computational Pathology: A Survey", "paper_summary": "Foundation models have emerged as a powerful paradigm in computational\npathology (CPath), enabling scalable and generalizable analysis of\nhistopathological images. While early developments centered on uni-modal models\ntrained solely on visual data, recent advances have highlighted the promise of\nmulti-modal foundation models that integrate heterogeneous data sources such as\ntextual reports, structured domain knowledge, and molecular profiles. In this\nsurvey, we provide a comprehensive and up-to-date review of multi-modal\nfoundation models in CPath, with a particular focus on models built upon\nhematoxylin and eosin (H&E) stained whole slide images (WSIs) and tile-level\nrepresentations. We categorize 32 state-of-the-art multi-modal foundation\nmodels into three major paradigms: vision-language, vision-knowledge graph, and\nvision-gene expression. We further divide vision-language models into\nnon-LLM-based and LLM-based approaches. Additionally, we analyze 28 available\nmulti-modal datasets tailored for pathology, grouped into image-text pairs,\ninstruction datasets, and image-other modality pairs. Our survey also presents\na taxonomy of downstream tasks, highlights training and evaluation strategies,\nand identifies key challenges and future directions. We aim for this survey to\nserve as a valuable resource for researchers and practitioners working at the\nintersection of pathology and AI.", "paper_summary_zh": "<paragraph>基礎模型已成為計算病理學 (CPath) 中一個強大的典範，使其能夠對組織病理學影像進行可擴展且可泛化的分析。雖然早期發展集中在僅使用視覺數據訓練的單模態模型，但近期的進展突顯了整合異質數據源（如文本報告、結構化領域知識和分子圖譜）的多模態基礎模型的潛力。 在本綜述中，我們對 CPath 中的多模態基礎模型進行了全面和最新的回顧，特別關注建立在蘇木精和伊紅 (H&E) 染色的全玻片影像 (WSIs) 和切片級表徵之上的模型。我們將 32 個最先進的多模態基礎模型分為三大類：視覺-語言、視覺-知識圖譜和視覺-基因表達。 我們進一步將視覺-語言模型分為非基於大型語言模型 (LLM) 和基於 LLM 的方法。此外，我們分析了 28 個可用的、專為病理學定制的多模態數據集，將其分為圖像-文本對、指令數據集以及圖像-其他模態對。我們的綜述還提出了下游任務的分類，重點介紹了訓練和評估策略，並指出了關鍵挑戰和未來方向。我們的目標是使本綜述成為在病理學和人工智慧交叉領域工作的研究人員和從業人員的寶貴資源。</paragraph>\n", "author": "Dong Li et.al.", "authors": "Dong Li, Guihong Wan, Xintao Wu, Xinyu Wu, Xiaohui Chen, Yi He, Christine G. Lian, Peter K. Sorger, Yevgeniy R. Semenov, Chen Zhao", "id": "2503.09091v1", "paper_url": "http://arxiv.org/abs/2503.09091v1", "repo": "null"}}