{"2501.05069": {"publish_time": "2025-01-09", "title": "Commonsense Video Question Answering through Video-Grounded Entailment Tree Reasoning", "paper_summary": "This paper proposes the first video-grounded entailment tree reasoning method\nfor commonsense video question answering (VQA). Despite the remarkable progress\nof large visual-language models (VLMs), there are growing concerns that they\nlearn spurious correlations between videos and likely answers, reinforced by\ntheir black-box nature and remaining benchmarking biases. Our method explicitly\ngrounds VQA tasks to video fragments in four steps: entailment tree\nconstruction, video-language entailment verification, tree reasoning, and\ndynamic tree expansion. A vital benefit of the method is its generalizability\nto current video and image-based VLMs across reasoning types. To support fair\nevaluation, we devise a de-biasing procedure based on large-language models\nthat rewrites VQA benchmark answer sets to enforce model reasoning. Systematic\nexperiments on existing and de-biased benchmarks highlight the impact of our\nmethod components across benchmarks, VLMs, and reasoning types.", "paper_summary_zh": "本文提出第一個影片接地推論樹推理方法，用於常識影片問答 (VQA)。儘管大型視覺語言模型 (VLM) 有顯著進展，但對於它們學習影片與可能答案之間的虛假關聯性，並因其黑盒性質和現有基準偏差而加強，越來越令人擔憂。我們的模型明確地將 VQA 任務建立在影片片段上，分為四個步驟：推論樹構建、影片語言推論驗證、樹推理和動態樹擴充。此方法的一項重要優點是其對各種推理類型中現有影片和基於影像的 VLM 的通用性。為了支持公平的評估，我們設計了一個基於大型語言模型的去偏程序，用於改寫 VQA 基準答案集以強制執行模型推理。在現有和去偏基準上的系統性實驗突顯了我們的模型組成在基準、VLM 和推理類型上的影響。", "author": "Huabin Liu et.al.", "authors": "Huabin Liu, Filip Ilievski, Cees G. M. Snoek", "id": "2501.05069v1", "paper_url": "http://arxiv.org/abs/2501.05069v1", "repo": "null"}}