{"2501.14073": {"publish_time": "2025-01-23", "title": "LLMs are Vulnerable to Malicious Prompts Disguised as Scientific Language", "paper_summary": "As large language models (LLMs) have been deployed in various real-world\nsettings, concerns about the harm they may propagate have grown. Various\njailbreaking techniques have been developed to expose the vulnerabilities of\nthese models and improve their safety. This work reveals that many\nstate-of-the-art proprietary and open-source LLMs are vulnerable to malicious\nrequests hidden behind scientific language. Specifically, our experiments with\nGPT4o, GPT4o-mini, GPT-4, LLama3-405B-Instruct, Llama3-70B-Instruct, Cohere,\nGemini models on the StereoSet data demonstrate that, the models' biases and\ntoxicity substantially increase when prompted with requests that deliberately\nmisinterpret social science and psychological studies as evidence supporting\nthe benefits of stereotypical biases. Alarmingly, these models can also be\nmanipulated to generate fabricated scientific arguments claiming that biases\nare beneficial, which can be used by ill-intended actors to systematically\njailbreak even the strongest models like GPT. Our analysis studies various\nfactors that contribute to the models' vulnerabilities to malicious requests in\nacademic language. Mentioning author names and venues enhances the\npersuasiveness of some models, and the bias scores can increase as dialogues\nprogress. Our findings call for a more careful investigation on the use of\nscientific data in the training of LLMs.", "paper_summary_zh": "隨著大型語言模型 (LLM) 在各種真實世界場景中部署，人們對其可能傳播的危害的擔憂也隨之增加。已經開發了各種越獄技術來揭露這些模型的漏洞並提高其安全性。這項工作揭示了許多最先進的專有和開源 LLM 容易受到隱藏在科學語言背後的惡意請求的攻擊。具體來說，我們對 StereoSet 數據上的 GPT4o、GPT4o-mini、GPT-4、LLama3-405B-Instruct、Llama3-70B-Instruct、Cohere、Gemini 模型的實驗表明，當使用故意將社會科學和心理學研究誤解為支持刻板印象偏見好處的證據的請求時，模型的偏見和毒性會大幅增加。令人擔憂的是，這些模型還可以被操縱以產生虛假的科學論據，聲稱偏見是有益的，這可以被心懷不軌的人用來系統性地越獄甚至像 GPT 這樣的最強大的模型。我們的分析研究了導致模型容易受到學術語言中的惡意請求攻擊的各種因素。提及作者姓名和場景會增強某些模型的說服力，並且隨著對話的進行，偏見分數可能會增加。我們的研究結果要求對 LLM 訓練中科學數據的使用進行更仔細的調查。", "author": "Yubin Ge et.al.", "authors": "Yubin Ge, Neeraja Kirtane, Hao Peng, Dilek Hakkani-Tür", "id": "2501.14073v1", "paper_url": "http://arxiv.org/abs/2501.14073v1", "repo": "null"}}