{"2406.11785": {"publish_time": "2024-06-17", "title": "CELL your Model: Contrastive Explanation Methods for Large Language Models", "paper_summary": "The advent of black-box deep neural network classification models has sparked\nthe need to explain their decisions. However, in the case of generative AI such\nas large language models (LLMs), there is no class prediction to explain.\nRather, one can ask why an LLM output a particular response to a given prompt.\nIn this paper, we answer this question by proposing, to the best of our\nknowledge, the first contrastive explanation methods requiring simply\nblack-box/query access. Our explanations suggest that an LLM outputs a reply to\na given prompt because if the prompt was slightly modified, the LLM would have\ngiven a different response that is either less preferable or contradicts the\noriginal response. The key insight is that contrastive explanations simply\nrequire a distance function that has meaning to the user and not necessarily a\nreal valued representation of a specific response (viz. class label). We offer\ntwo algorithms for finding contrastive explanations: i) A myopic algorithm,\nwhich although effective in creating contrasts, requires many model calls and\nii) A budgeted algorithm, our main algorithmic contribution, which\nintelligently creates contrasts adhering to a query budget, necessary for\nlonger contexts. We show the efficacy of these methods on diverse natural\nlanguage tasks such as open-text generation, automated red teaming, and\nexplaining conversational degradation.", "paper_summary_zh": "隨著黑箱深度神經網路分類模型的出現，解釋其決策的需求也隨之產生。然而，在生成式 AI（例如大型語言模型 (LLM)）的情況下，沒有類別預測可以解釋。相反，可以詢問 LLM 為何對特定提示輸出特定回應。在本文中，我們透過提出（據我們所知）第一個只要求黑箱/查詢存取權的對比解釋方法來回答這個問題。我們的解釋表明，LLM 對特定提示輸出的回覆是因為，如果提示稍作修改，LLM 會給出不同的回覆，而該回覆較不理想或與原始回覆相矛盾。關鍵見解在於，對比解釋僅需要對使用者有意義的距離函數，而不一定需要特定回覆的實值表示（即類別標籤）。我們提供了兩種尋找對比解釋的演算法：i) 一種近視演算法，雖然在建立對比方面有效，但需要許多模型呼叫，以及 ii) 一種預算演算法，這是我們主要的演算法貢獻，它可以智慧地建立符合查詢預算的對比，這對於較長的脈絡是必要的。我們在各種自然語言任務上展示了這些方法的效能，例如開放文字生成、自動化紅隊測試，以及解釋對話式退化。", "author": "Ronny Luss et.al.", "authors": "Ronny Luss, Erik Miehling, Amit Dhurandhar", "id": "2406.11785v1", "paper_url": "http://arxiv.org/abs/2406.11785v1", "repo": "null"}}