{"2410.13641": {"publish_time": "2024-10-17", "title": "An Active Learning Framework for Inclusive Generation by Large Language Models", "paper_summary": "Ensuring that Large Language Models (LLMs) generate text representative of\ndiverse sub-populations is essential, particularly when key concepts related to\nunder-represented groups are scarce in the training data. We address this\nchallenge with a novel clustering-based active learning framework, enhanced\nwith knowledge distillation. The proposed framework transforms the intermediate\noutputs of the learner model, enabling effective active learning for generative\ntasks for the first time. Integration of clustering and knowledge distillation\nyields more representative models without prior knowledge of underlying data\ndistribution and overbearing human efforts. We validate our approach in\npractice through case studies in counter-narration and style transfer. We\nconstruct two new datasets in tandem with model training, showing a performance\nimprovement of 2%-10% over baseline models. Our results also show more\nconsistent performance across various data subgroups and increased lexical\ndiversity, underscoring our model's resilience to skewness in available data.\nFurther, our results show that the data acquired via our approach improves the\nperformance of secondary models not involved in the learning loop, showcasing\npractical utility of the framework.", "paper_summary_zh": "確保大型語言模型 (LLM) 產生的文字能代表不同的次族群，這點很重要，特別是在訓練資料中與代表性不足的族群相關的重要概念很稀少時。我們透過一種新的基於聚類的主動學習架構來應對這個挑戰，並利用知識萃取來增強。所提出的架構轉換了學習者模型的中間輸出，首次能讓生成式任務進行有效的主動學習。整合聚類和知識萃取，在沒有底層資料分佈和過度人力介入的先備知識下，就能產生更具代表性的模型。我們透過反敘述和風格轉換的案例研究，在實務中驗證了我們的做法。我們在模型訓練的同時建構了兩個新的資料集，顯示比基準模型提升了 2%-10% 的效能。我們的結果也顯示在各種資料子群中效能更一致，且詞彙更多元，強調了我們的模型對於可用資料的偏誤具有韌性。此外，我們的結果顯示，透過我們的方法所取得的資料能提升未參與學習迴圈的次要模型的效能，展示了這個架構的實用性。", "author": "Sabit Hassan et.al.", "authors": "Sabit Hassan, Anthony Sicilia, Malihe Alikhani", "id": "2410.13641v1", "paper_url": "http://arxiv.org/abs/2410.13641v1", "repo": "null"}}