{"2408.00584": {"publish_time": "2024-08-01", "title": "Non Verbis, Sed Rebus: Large Language Models are Weak Solvers of Italian Rebuses", "paper_summary": "Rebuses are puzzles requiring constrained multi-step reasoning to identify a\nhidden phrase from a set of images and letters. In this work, we introduce a\nlarge collection of verbalized rebuses for the Italian language and use it to\nassess the rebus-solving capabilities of state-of-the-art large language\nmodels. While general-purpose systems such as LLaMA-3 and GPT-4o perform poorly\non this task, ad-hoc fine-tuning seems to improve models' performance. However,\nwe find that performance gains from training are largely motivated by\nmemorization. Our results suggest that rebus solving remains a challenging test\nbed to evaluate large language models' linguistic proficiency and sequential\ninstruction-following skills.", "paper_summary_zh": "謎語是需要受限多步驟推理才能從一組圖像和字母中找出隱藏短語的謎題。在本文中，我們引進了一大批義大利語的文字謎語，並用它來評估最先進的大語言模型的謎語解題能力。儘管 LLaMA-3 和 GPT-4o 等通用系統在此任務上的表現不佳，但特別微調似乎能提升模型的表現。然而，我們發現訓練產生的表現提升，在很大程度上是由於記憶。我們的結果顯示，謎語解題仍然是大語言模型語言能力和循序指令遵循技能評估的嚴峻考驗。", "author": "Gabriele Sarti et.al.", "authors": "Gabriele Sarti, Tommaso Caselli, Malvina Nissim, Arianna Bisazza", "id": "2408.00584v1", "paper_url": "http://arxiv.org/abs/2408.00584v1", "repo": "null"}}