{"2407.10377": {"publish_time": "2024-07-15", "title": "Enhanced Self-supervised Learning for Multi-modality MRI Segmentation and Classification: A Novel Approach Avoiding Model Collapse", "paper_summary": "Multi-modality magnetic resonance imaging (MRI) can provide complementary\ninformation for computer-aided diagnosis. Traditional deep learning algorithms\nare suitable for identifying specific anatomical structures segmenting lesions\nand classifying diseases with magnetic resonance images. However, manual labels\nare limited due to high expense, which hinders further improvement of model\naccuracy. Self-supervised learning (SSL) can effectively learn feature\nrepresentations from unlabeled data by pre-training and is demonstrated to be\neffective in natural image analysis. Most SSL methods ignore the similarity of\nmulti-modality MRI, leading to model collapse. This limits the efficiency of\npre-training, causing low accuracy in downstream segmentation and\nclassification tasks. To solve this challenge, we establish and validate a\nmulti-modality MRI masked autoencoder consisting of hybrid mask pattern (HMP)\nand pyramid barlow twin (PBT) module for SSL on multi-modality MRI analysis.\nThe HMP concatenates three masking steps forcing the SSL to learn the semantic\nconnections of multi-modality images by reconstructing the masking patches. We\nhave proved that the proposed HMP can avoid model collapse. The PBT module\nexploits the pyramidal hierarchy of the network to construct barlow twin loss\nbetween masked and original views, aligning the semantic representations of\nimage patches at different vision scales in latent space. Experiments on\nBraTS2023, PI-CAI, and lung gas MRI datasets further demonstrate the\nsuperiority of our framework over the state-of-the-art. The performance of the\nsegmentation and classification is substantially enhanced, supporting the\naccurate detection of small lesion areas. The code is available at\nhttps://github.com/LinxuanHan/M2-MAE.", "paper_summary_zh": "多模態磁共振成像 (MRI) 能為電腦輔助診斷提供互補資訊。傳統深度學習演算法適用於識別特定的解剖結構、分割病灶並使用磁共振影像對疾病進行分類。然而，手動標籤由於費用高昂而受到限制，這阻礙了模型精確度的進一步提升。自監督學習 (SSL) 能透過預訓練有效地從未標籤的資料中學習特徵表徵，並證明其在自然影像分析中是有效的。大多數 SSL 方法忽略了多模態 MRI 的相似性，導致模型崩潰。這限制了預訓練的效率，導致下游分割和分類任務的準確度降低。為了解決這個挑戰，我們建立並驗證了一個多模態 MRI 遮罩自動編碼器，它由混合遮罩模式 (HMP) 和金字塔 Barlow 雙胞胎 (PBT) 模組組成，用於多模態 MRI 分析的 SSL。HMP 串接三個遮罩步驟，強迫 SSL 透過重建遮罩貼片來學習多模態影像的語義連接。我們已經證明，所提出的 HMP 能避免模型崩潰。PBT 模組利用網路的金字塔層級來建構遮罩和原始檢視之間的 Barlow 雙胞胎損失，在潛在空間中對齊不同視覺尺度影像貼片的語義表徵。在 BraTS2023、PI-CAI 和肺部氣體 MRI 資料集上的實驗進一步證明了我們框架優於現有技術。分割和分類的效能顯著提升，支援準確偵測小病灶區域。程式碼可在 https://github.com/LinxuanHan/M2-MAE 取得。", "author": "Linxuan Han et.al.", "authors": "Linxuan Han, Sa Xiao, Zimeng Li, Haidong Li, Xiuchao Zhao, Fumin Guo, Yeqing Han, Xin Zhou", "id": "2407.10377v1", "paper_url": "http://arxiv.org/abs/2407.10377v1", "repo": "https://github.com/linxuanhan/m2-mae"}}