{"2406.11524": {"publish_time": "2024-06-17", "title": "Explainable Artificial Intelligence and Multicollinearity : A Mini Review of Current Approaches", "paper_summary": "Explainable Artificial Intelligence (XAI) methods help to understand the\ninternal mechanism of machine learning models and how they reach a specific\ndecision or made a specific action. The list of informative features is one of\nthe most common output of XAI methods. Multicollinearity is one of the big\nissue that should be considered when XAI generates the explanation in terms of\nthe most informative features in an AI system. No review has been dedicated to\ninvestigate the current approaches to handle such significant issue. In this\npaper, we provide a review of the current state-of-the-art approaches in\nrelation to the XAI in the context of recent advances in dealing with the\nmulticollinearity issue. To do so, we searched in three repositories that are:\nWeb of Science, Scopus and IEEE Xplore to find pertinent published papers.\nAfter excluding irrelevant papers, seven papers were considered in the review.\nIn addition, we discuss the current XAI methods and their limitations in\ndealing with the multicollinearity and suggest future directions.", "paper_summary_zh": "可解釋人工智慧（XAI）方法有助於理解機器學習模型的內部機制，以及它們如何達成特定決策或採取特定行動。資訊性特徵清單是 XAI 方法最常見的輸出之一。多重共線性是 XAI 在 AI 系統中根據資訊性特徵產生解釋時應考慮的主要問題之一。目前還沒有任何評論專門探討處理此類重大問題的現有方法。在本文中，我們回顧了與 XAI 相關的現有最先進方法，以及在處理多重共線性問題方面取得的最新進展。為此，我們在 Web of Science、Scopus 和 IEEE Xplore 三個資料庫中搜尋相關已發表的論文。在排除無關論文後，我們在評論中考慮了七篇論文。此外，我們討論了現有的 XAI 方法及其在處理多重共線性方面的限制，並提出了未來的方向。", "author": "Ahmed M Salih et.al.", "authors": "Ahmed M Salih", "id": "2406.11524v1", "paper_url": "http://arxiv.org/abs/2406.11524v1", "repo": "null"}}