{"2406.09979": {"publish_time": "2024-06-14", "title": "HIRO: Hierarchical Information Retrieval Optimization", "paper_summary": "Large Language Models (LLMs) excel in natural language tasks but face\nlimitations due to static training datasets, resulting in outdated or\ncontextually shallow responses. Retrieval-Augmented Generation (RAG) addresses\nthis by integrating real-time external knowledge, enhancing model accuracy and\ncredibility, especially for knowledge-intensive tasks. However, RAG-enhanced\nLLMs struggle with long contexts, causing them to \"choke\" on information\noverload, compromising response quality. Recent RAG applications use\nhierarchical data structures for storing documents, organized at various levels\nof summarization and information density. In this context, we introduce HIRO\n(Hierarchical Information Retrieval Optimization), a novel querying approach\nfor RAG applications using hierarchical structures for storing documents. HIRO\nemploys DFS-based recursive similarity score calculation and branch pruning to\nminimize the context returned to the LLM without informational loss. HIRO\noutperforms existing querying mechanisms on the NarrativeQA dataset by an\nabsolute performance gain of 10.85%.", "paper_summary_zh": "大型語言模型 (LLM) 在自然語言任務中表現出色，但由於訓練資料集為靜態，因此面臨限制，導致回應過時或脈絡淺薄。檢索增強生成 (RAG) 透過整合即時外部知識來解決此問題，增強模型的準確性和可信度，特別是對於知識密集型任務。然而，RAG 增強的 LLM 難以處理長脈絡，導致它們在資訊超載時「窒息」，損害回應品質。最近的 RAG 應用程式使用階層式資料結構來儲存文件，並在各種摘要和資訊密度層級中組織。在此脈絡下，我們介紹了 HIRO（階層式資訊檢索最佳化），這是一種新穎的查詢方法，用於 RAG 應用程式，使用階層式結構來儲存文件。HIRO 採用基於 DFS 的遞迴相似性分數計算和分支剪枝，以在不造成資訊遺失的情況下，將回傳至 LLM 的脈絡降至最低。HIRO 在 NarrativeQA 資料集上優於現有的查詢機制，絕對效能提升了 10.85%。", "author": "Krish Goel et.al.", "authors": "Krish Goel, Mahek Chandak", "id": "2406.09979v1", "paper_url": "http://arxiv.org/abs/2406.09979v1", "repo": "https://github.com/krishgoel/hiro"}}