{"2412.07462": {"publish_time": "2024-12-10", "title": "Bilingual BSARD: Extending Statutory Article Retrieval to Dutch", "paper_summary": "Statutory article retrieval plays a crucial role in making legal information\nmore accessible to both laypeople and legal professionals. Multilingual\ncountries like Belgium present unique challenges for retrieval models due to\nthe need for handling legal issues in multiple languages. Building on the\nBelgian Statutory Article Retrieval Dataset (BSARD) in French, we introduce the\nbilingual version of this dataset, bBSARD. The dataset contains parallel\nBelgian statutory articles in both French and Dutch, along with legal questions\nfrom BSARD and their Dutch translation. Using bBSARD, we conduct extensive\nbenchmarking of retrieval models available for Dutch and French. Our\nbenchmarking setup includes lexical models, zero-shot dense models, and\nfine-tuned small foundation models. Our experiments show that BM25 remains a\ncompetitive baseline compared to many zero-shot dense models in both languages.\nWe also observe that while proprietary models outperform open alternatives in\nthe zero-shot setting, they can be matched or surpassed by fine-tuning small\nlanguage-specific models. Our dataset and evaluation code are publicly\navailable.", "paper_summary_zh": "法定條文檢索在讓法律資訊更易於讓一般民眾和法律專業人士取得方面扮演著至關重要的角色。像比利時等多語國家由於需要處理多種語言的法律問題，因此對檢索模型提出了獨特的挑戰。我們在法語的比利時法定條文檢索資料集 (BSARD) 的基礎上，推出了這個資料集的雙語版本 bBSARD。這個資料集包含法語和荷蘭語的比利時法定條文平行語料，以及 BSARD 中的法律問題及其荷蘭語翻譯。使用 bBSARD，我們對荷蘭語和法語可用的檢索模型進行了廣泛的基準測試。我們的基準測試設定包括詞彙模型、零次學習稠密模型和微調小型基礎模型。我們的實驗表明，與兩種語言中的許多零次學習稠密模型相比，BM25 仍然是一個有競爭力的基線。我們還觀察到，雖然專有模型在零次學習設定中優於開放式替代方案，但它們可以通過微調特定於語言的小型模型來匹配或超越。我們的資料集和評估程式碼已公開。", "author": "Ehsan Lotfi et.al.", "authors": "Ehsan Lotfi, Nikolay Banar, Nerses Yuzbashyan, Walter Daelemans", "id": "2412.07462v1", "paper_url": "http://arxiv.org/abs/2412.07462v1", "repo": "null"}}