{"2408.12525": {"publish_time": "2024-08-22", "title": "PCGRL+: Scaling, Control and Generalization in Reinforcement Learning Level Generators", "paper_summary": "Procedural Content Generation via Reinforcement Learning (PCGRL) has been\nintroduced as a means by which controllable designer agents can be trained\nbased only on a set of computable metrics acting as a proxy for the level's\nquality and key characteristics. While PCGRL offers a unique set of affordances\nfor game designers, it is constrained by the compute-intensive process of\ntraining RL agents, and has so far been limited to generating relatively small\nlevels. To address this issue of scale, we implement several PCGRL environments\nin Jax so that all aspects of learning and simulation happen in parallel on the\nGPU, resulting in faster environment simulation; removing the CPU-GPU transfer\nof information bottleneck during RL training; and ultimately resulting in\nsignificantly improved training speed. We replicate several key results from\nprior works in this new framework, letting models train for much longer than\npreviously studied, and evaluating their behavior after 1 billion timesteps.\nAiming for greater control for human designers, we introduce randomized level\nsizes and frozen \"pinpoints\" of pivotal game tiles as further ways of\ncountering overfitting. To test the generalization ability of learned\ngenerators, we evaluate models on large, out-of-distribution map sizes, and\nfind that partial observation sizes learn more robust design strategies.", "paper_summary_zh": "程序化内容生成通过强化学习（PCGRL）已被引入，作为一种手段，可根据一组可计算的指标（作为关卡质量和关键特征的代理）来训练可控的设计师代理。虽然 PCGRL 为游戏设计师提供了一组独特的便利性，但它受到训练 RL 代理的计算密集型过程的限制，并且到目前为止仅限于生成相对较小的关卡。为了解决这个问题，我们在 Jax 中实现了几个 PCGRL 环境，以便学习和模拟的所有方面都在 GPU 上并行发生，从而实现更快的环境模拟；在 RL 训练期间消除 CPU-GPU 信息瓶颈传输；并最终显着提高训练速度。我们在这一新框架中复制了先前工作的一些关键结果，让模型训练的时间比以前的研究长得多，并在 10 亿个时间步之后评估了它们的行为。为了让人类设计师获得更大的控制权，我们引入了随机关卡大小和关键游戏图块的冻结“关键点”，作为对抗过拟合的进一步方法。为了测试学习生成器的泛化能力，我们在大型、分布外的地图大小上评估模型，并发现部分观察大小学习了更稳健的设计策略。", "author": "Sam Earle et.al.", "authors": "Sam Earle, Zehua Jiang, Julian Togelius", "id": "2408.12525v1", "paper_url": "http://arxiv.org/abs/2408.12525v1", "repo": "null"}}