{"2407.00129": {"publish_time": "2024-06-28", "title": "Multimodal Learning and Cognitive Processes in Radiology: MedGaze for Chest X-ray Scanpath Prediction", "paper_summary": "Predicting human gaze behavior within computer vision is integral for\ndeveloping interactive systems that can anticipate user attention, address\nfundamental questions in cognitive science, and hold implications for fields\nlike human-computer interaction (HCI) and augmented/virtual reality (AR/VR)\nsystems. Despite methodologies introduced for modeling human eye gaze behavior,\napplying these models to medical imaging for scanpath prediction remains\nunexplored. Our proposed system aims to predict eye gaze sequences from\nradiology reports and CXR images, potentially streamlining data collection and\nenhancing AI systems using larger datasets. However, predicting human scanpaths\non medical images presents unique challenges due to the diverse nature of\nabnormal regions. Our model predicts fixation coordinates and durations\ncritical for medical scanpath prediction, outperforming existing models in the\ncomputer vision community. Utilizing a two-stage training process and large\npublicly available datasets, our approach generates static heatmaps and eye\ngaze videos aligned with radiology reports, facilitating comprehensive\nanalysis. We validate our approach by comparing its performance with\nstate-of-the-art methods and assessing its generalizability among different\nradiologists, introducing novel strategies to model radiologists' search\npatterns during CXR image diagnosis. Based on the radiologist's evaluation,\nMedGaze can generate human-like gaze sequences with a high focus on relevant\nregions over the CXR images. It sometimes also outperforms humans in terms of\nredundancy and randomness in the scanpaths.", "paper_summary_zh": "預測電腦視覺中的人類視線行為對於開發互動式系統至關重要，這些系統可以預測使用者注意力、解決認知科學中的基本問題，並對人機互動 (HCI) 和擴增/虛擬實境 (AR/VR) 系統等領域產生影響。儘管引入了用於建模人類視線行為的方法，但將這些模型應用於醫學影像以進行掃描路徑預測仍未得到探索。我們提出的系統旨在根據放射科報告和 CXR 影像預測視線序列，這有可能簡化資料收集並使用更大的資料集來增強 AI 系統。然而，由於異常區域的多樣性，預測醫學影像上的人類掃描路徑提出了獨特的挑戰。我們的模型預測了對醫學掃描路徑預測至關重要的注視坐標和持續時間，表現優於電腦視覺社群中現有的模型。利用兩階段訓練流程和大量的公開可用資料集，我們的做法產生了與放射科報告相符的靜態熱圖和視線影片，從而促成了全面的分析。我們透過將其效能與最先進的方法進行比較並評估其在不同放射科醫師之間的概括性來驗證我們的做法，引入了新的策略來建模放射科醫師在 CXR 影像診斷期間的搜尋模式。根據放射科醫師的評估，MedGaze 可以產生類似人類的視線序列，高度關注 CXR 影像上的相關區域。在掃描路徑的冗餘性和隨機性方面，它有時也優於人類。", "author": "Akash Awasthi et.al.", "authors": "Akash Awasthi, Ngan Le, Zhigang Deng, Rishi Agrawal, Carol C. Wu, Hien Van Nguyen", "id": "2407.00129v1", "paper_url": "http://arxiv.org/abs/2407.00129v1", "repo": "null"}}