{"2412.16100": {"publish_time": "2024-12-20", "title": "Logical Consistency of Large Language Models in Fact-checking", "paper_summary": "In recent years, large language models (LLMs) have demonstrated significant\nsuccess in performing varied natural language tasks such as language\ntranslation, question-answering, summarizing, fact-checking, etc. Despite LLMs'\nimpressive ability to generate human-like texts, LLMs are infamous for their\ninconsistent responses -- a meaning-preserving change in the input query\nresults in an inconsistent response and attributes to vulnerabilities of LLMs\nsuch as hallucination, jailbreaking, etc. Consequently, existing research\nfocuses on simple paraphrasing-based consistency assessment of LLMs, and\nignores complex queries that necessitates an even better understanding of\nlogical reasoning by an LLM. Our work therefore addresses the logical\ninconsistency of LLMs under complex logical queries with primitive logical\noperators, e.g., negation, conjunction, and disjunction. As a test bed, we\nconsider retrieval-augmented LLMs on a fact-checking task involving\npropositional logic queries from real-world knowledge graphs (KGs). Our\ncontributions are three-fold. Benchmark: We introduce three logical\nfact-checking datasets over KGs for community development towards logically\nconsistent LLMs. Assessment: We propose consistency measures of LLMs on\npropositional logic queries as input and demonstrate that existing LLMs lack\nlogical consistency, specially on complex queries. Improvement: We employ\nsupervised fine-tuning to improve the logical consistency of LLMs on the\ncomplex fact-checking task with KG contexts.", "paper_summary_zh": "近年來，大型語言模型 (LLM) 在執行各種自然語言任務（例如語言翻譯、問答、摘要、事實查核等）方面展現出顯著的成功。儘管 LLM 能產生類似人類的文字，但 LLM 以其不一致的回應而臭名昭著——輸入查詢中一個保意改變會導致不一致的回應，並歸因於 LLM 的漏洞，例如幻覺、越獄等。因此，現有的研究專注於 LLM 的基於簡單改寫的一致性評估，而忽略了需要 LLM 更深入理解邏輯推理的複雜查詢。因此，我們的研究解決了 LLM 在具有基本邏輯運算元（例如否定、合取和析取）的複雜邏輯查詢下的邏輯不一致性。作為一個測試平台，我們考慮在一個涉及來自真實世界知識圖譜 (KG) 的命題邏輯查詢的事實查核任務中，檢索增強的 LLM。我們的貢獻有三方面。基準：我們在 KG 上引入了三個邏輯事實查核數據集，以促進社區開發邏輯一致的 LLM。評估：我們提出了 LLM 在命題邏輯查詢作為輸入上的一致性測量，並證明現有的 LLM 缺乏邏輯一致性，特別是在複雜查詢上。改進：我們採用監督微調來提高 LLM 在具有 KG 背景的複雜事實查核任務上的邏輯一致性。", "author": "Bishwamittra Ghosh et.al.", "authors": "Bishwamittra Ghosh, Sarah Hasan, Naheed Anjum Arafat, Arijit Khan", "id": "2412.16100v1", "paper_url": "http://arxiv.org/abs/2412.16100v1", "repo": "null"}}