{"2409.10570": {"publish_time": "2024-09-14", "title": "Protecting Copyright of Medical Pre-trained Language Models: Training-Free Backdoor Watermarking", "paper_summary": "Pre-training language models followed by fine-tuning on specific tasks is\nstandard in NLP, but traditional models often underperform when applied to the\nmedical domain, leading to the development of specialized medical pre-trained\nlanguage models (Med-PLMs). These models are valuable assets but are vulnerable\nto misuse and theft, requiring copyright protection. However, no existing\nwatermarking methods are tailored for Med-PLMs, and adapting general PLMs\nwatermarking techniques to the medical domain faces challenges such as task\nincompatibility, loss of fidelity, and inefficiency. To address these issues,\nwe propose the first training-free backdoor watermarking method for Med-PLMs.\nOur method uses rare special symbols as trigger words, which do not impact\ndownstream task performance, embedding watermarks by replacing their original\nembeddings with those of specific medical terms in the Med-PLMs' word\nembeddings layer. After fine-tuning the watermarked Med-PLMs on various medical\ndownstream tasks, the final models (FMs) respond to the trigger words in the\nsame way they would to the corresponding medical terms. This property can be\nutilized to extract the watermark. Experiments demonstrate that our method\nachieves high fidelity while effectively extracting watermarks across various\nmedical downstream tasks. Additionally, our method demonstrates robustness\nagainst various attacks and significantly enhances the efficiency of watermark\nembedding, reducing the embedding time from 10 hours to 10 seconds.", "paper_summary_zh": "預訓練語言模型，後續針對特定任務進行微調，在自然語言處理中是標準作業，但傳統模型應用於醫療領域時，往往表現不佳，導致專門的醫療預訓練語言模型 (Med-PLM) 應運而生。這些模型是寶貴的資產，但容易遭到濫用和竊取，需要版權保護。然而，現有的浮水印方法並未針對 Med-PLM 量身打造，而將一般 PLM 浮水印技術調整為醫療領域時，則面臨任務不相容、保真度下降和效率不彰等挑戰。為了解決這些問題，我們提出第一個針對 Med-PLM 的免訓練後門浮水印方法。我們的做法是使用罕見的特殊符號作為觸發字，這不會影響下游任務的表現，並透過將其原始嵌入替換為 Med-PLM 字嵌入層中特定醫療術語的嵌入，來嵌入浮水印。在針對各種醫療下游任務微調帶有浮水印的 Med-PLM 之後，最終模型 (FM) 對觸發字的回應方式與對應醫療術語相同。此特性可用於提取浮水印。實驗證明，我們的做法在各種醫療下游任務中，都能有效提取浮水印，同時維持高保真度。此外，我們的做法展現出對各種攻擊的強健性，並大幅提升浮水印嵌入的效率，將嵌入時間從 10 小時縮短為 10 秒。", "author": "Cong Kong et.al.", "authors": "Cong Kong, Rui Xu, Weixi Chen, Jiawei Chen, Zhaoxia Yin", "id": "2409.10570v1", "paper_url": "http://arxiv.org/abs/2409.10570v1", "repo": "null"}}