{"2405.19954": {"publish_time": "2024-05-30", "title": "GenKubeSec: LLM-Based Kubernetes Misconfiguration Detection, Localization, Reasoning, and Remediation", "paper_summary": "A key challenge associated with Kubernetes configuration files (KCFs) is that\nthey are often highly complex and error-prone, leading to security\nvulnerabilities and operational setbacks. Rule-based (RB) tools for KCF\nmisconfiguration detection rely on static rule sets, making them inherently\nlimited and unable to detect newly-discovered misconfigurations. RB tools also\nsuffer from misdetection, since mistakes are likely when coding the detection\nrules. Recent methods for detecting and remediating KCF misconfigurations are\nlimited in terms of their scalability and detection coverage, or due to the\nfact that they have high expertise requirements and do not offer automated\nremediation along with misconfiguration detection. Novel approaches that employ\nLLMs in their pipeline rely on API-based, general-purpose, and mainly\ncommercial models. Thus, they pose security challenges, have inconsistent\nclassification performance, and can be costly. In this paper, we propose\nGenKubeSec, a comprehensive and adaptive, LLM-based method, which, in addition\nto detecting a wide variety of KCF misconfigurations, also identifies the exact\nlocation of the misconfigurations and provides detailed reasoning about them,\nalong with suggested remediation. When empirically compared with three\nindustry-standard RB tools, GenKubeSec achieved equivalent precision (0.990)\nand superior recall (0.999). When a random sample of KCFs was examined by a\nKubernetes security expert, GenKubeSec's explanations as to misconfiguration\nlocalization, reasoning and remediation were 100% correct, informative and\nuseful. To facilitate further advancements in this domain, we share the unique\ndataset we collected, a unified misconfiguration index we developed for label\nstandardization, our experimentation code, and GenKubeSec itself as an\nopen-source tool.", "paper_summary_zh": "<paragraph>與 Kubernetes 設定檔 (KCF) 相關的一個主要挑戰在於它們通常非常複雜且容易出錯，導致安全漏洞和作業挫折。用於 KCF 錯誤設定偵測的基於規則 (RB) 工具依賴靜態規則集，使得它們本質上受到限制，無法偵測新發現的錯誤設定。RB 工具也會受到誤判的影響，因為在編寫偵測規則時很容易出錯。最近用於偵測和修復 KCF 錯誤設定的方法在可擴充性和偵測範圍方面受到限制，或者由於它們具有很高的專業知識需求，而且無法在偵測錯誤設定的同時提供自動修復。在它們的管線中採用 LLM 的新方法依賴於基於 API 的、通用且主要是商業模式。因此，它們會造成安全挑戰、分類效能不一致，而且可能很昂貴。在本文中，我們提出 GenKubeSec，這是一種全面且適應性的基於 LLM 的方法，除了偵測各種 KCF 錯誤設定外，它還識別錯誤設定的確切位置，並提供有關錯誤設定的詳細推理，以及建議的修復措施。與三種產業標準 RB 工具進行實證比較時，GenKubeSec 達到了相當的精確度 (0.990) 和更高的召回率 (0.999)。當一位 Kubernetes 安全專家檢查 KCF 的隨機範例時，GenKubeSec 對錯誤設定定位、推理和修復的說明 100% 正確、具參考價值且有用。為了促進這個領域的進一步發展，我們分享了我們收集到的獨特資料集、我們為標籤標準化開發的統一錯誤設定索引、我們的實驗程式碼，以及 GenKubeSec 本身作為一個開源工具。</paragraph>", "author": "Ehud Malul et.al.", "authors": "Ehud Malul, Yair Meidan, Dudu Mimran, Yuval Elovici, Asaf Shabtai", "id": "2405.19954v1", "paper_url": "http://arxiv.org/abs/2405.19954v1", "repo": "null"}}