{"2412.13851": {"publish_time": "2024-12-18", "title": "From approximation error to optimality gap -- Explaining the performance impact of opportunity cost approximation in integrated demand management and vehicle routing", "paper_summary": "The widespread adoption of digital distribution channels both enables and\nforces more and more logistical service providers to manage booking processes\nactively to maintain competitiveness. As a result, their operational planning\nis no longer limited to solving vehicle routing problems. Instead, demand\nmanagement decisions and vehicle routing decisions are optimized integratively\nwith the aim of maximizing revenue and minimizing fulfillment cost. The\nresulting integrated demand management and vehicle routing problems (i-DMVRPs)\ncan be formulated as Markov decision process models and, theoretically, can be\nsolved via the well-known Bellman equation. Unfortunately, the Bellman equation\nis intractable for realistic-sized instances. Thus, in the literature, i-DMVRPs\nare often addressed via decomposition-based solution approaches involving an\nopportunity cost approximation as a key component. Despite its importance, to\nthe best of our knowledge, there is neither a technique to systematically\nanalyze how the accuracy of the opportunity cost approximation translates into\noverall solution quality nor are there general guidelines on when to apply\nwhich class of approximation approach. In this work, we address this research\ngap by proposing an explainability technique that quantifies and visualizes the\nmagnitude of approximation errors, their immediate impact, and their relevance\nin specific regions of the state space. Exploiting reward decomposition, it\nfurther yields a characterization of different types of approximation errors.\nApplying the technique to a generic i-DMVRP in a full-factorial computational\nstudy and comparing the results with observations in existing literature, we\nshow that the technique contributes to better explaining algorithmic\nperformance and provides guidance for the algorithm selection and development\nprocess.", "paper_summary_zh": "<paragraph>數位配送管道廣泛採用，促使且強迫越來越多的物流服務供應商積極管理預訂流程，以維持競爭力。因此，他們的營運規劃不再僅限於解決車輛路線問題。相反地，需求管理決策和車輛路線決策會整合最佳化，以最大化收益並最小化履行成本。由此產生的整合需求管理和車輛路線問題 (i-DMVRP) 可表述為馬可夫決策程序模型，理論上可透過著名的貝爾曼方程式求解。遺憾的是，貝爾曼方程式對於實際規模的個案來說難以處理。因此，在文獻中，i-DMVRP 通常透過基於分解的解決方案方法來解決，其中機會成本近似值是一個關鍵組成部分。儘管其重要性，但據我們所知，既沒有系統分析機會成本近似值準確度如何轉化為整體解決方案品質的技術，也沒有關於何時套用哪一類近似值方法的一般準則。在這項工作中，我們透過提出一個可量化並視覺化近似誤差大小、其立即影響及其在狀態空間特定區域中相關性的可解釋性技術，來解決這個研究差距。利用獎勵分解，它進一步對不同類型的近似誤差進行表徵。將此技術應用於全因子運算研究中的通用 i-DMVRP，並將結果與現有文獻中的觀察結果進行比較，我們表明該技術有助於更好地解釋演算法效能，並為演算法選擇和開發流程提供指導。</paragraph>", "author": "David Fleckenstein et.al.", "authors": "David Fleckenstein, Robert Klein, Vienna Klein, Claudius Steinhardt", "id": "2412.13851v1", "paper_url": "http://arxiv.org/abs/2412.13851v1", "repo": "null"}}