{"2405.20805": {"publish_time": "2024-05-31", "title": "Multilingual Text Style Transfer: Datasets & Models for Indian Languages", "paper_summary": "Text style transfer (TST) involves altering the linguistic style of a text\nwhile preserving its core content. This paper focuses on sentiment transfer, a\nvital TST subtask (Mukherjee et al., 2022a), across a spectrum of Indian\nlanguages: Hindi, Magahi, Malayalam, Marathi, Punjabi, Odia, Telugu, and Urdu,\nexpanding upon previous work on English-Bangla sentiment transfer (Mukherjee et\nal., 2023). We introduce dedicated datasets of 1,000 positive and 1,000\nnegative style-parallel sentences for each of these eight languages. We then\nevaluate the performance of various benchmark models categorized into parallel,\nnon-parallel, cross-lingual, and shared learning approaches, including the\nLlama2 and GPT-3.5 large language models (LLMs). Our experiments highlight the\nsignificance of parallel data in TST and demonstrate the effectiveness of the\nMasked Style Filling (MSF) approach (Mukherjee et al., 2023) in non-parallel\ntechniques. Moreover, cross-lingual and joint multilingual learning methods\nshow promise, offering insights into selecting optimal models tailored to the\nspecific language and task requirements. To the best of our knowledge, this\nwork represents the first comprehensive exploration of the TST task as\nsentiment transfer across a diverse set of languages.", "paper_summary_zh": "文本風格轉移（TST）涉及更改文本的語言風格，同時保留其核心內容。本文重點關注情緒轉移，這是一個重要的 TST 子任務（Mukherjee 等人，2022a），涉及印地語、馬加希語、馬拉雅拉姆語、馬拉地語、旁遮普語、奧里亞語、泰盧固語和烏爾都語等印度語言，擴展了先前關於英語-孟加拉語情緒轉移（Mukherjee 等人，2023）的研究。我們為這八種語言中的每種語言引入了 1,000 個積極和 1,000 個消極的風格平行句子的專用數據集。然後，我們評估了各種基準模型的性能，這些模型分為平行、非平行、跨語言和共享學習方法，包括 Llama2 和 GPT-3.5 大型語言模型 (LLM)。我們的實驗突出了平行數據在 TST 中的重要性，並展示了掩碼風格填充 (MSF) 方法（Mukherjee 等人，2023）在非平行技術中的有效性。此外，跨語言和聯合多語言學習方法顯示出前景，提供了針對特定語言和任務要求選擇最佳模型的見解。據我們所知，這項工作代表了首次對 TST 任務作為跨多種語言的情緒轉移進行全面探索。", "author": "Sourabrata Mukherjee et.al.", "authors": "Sourabrata Mukherjee, Atul Kr. Ojha, Akanksha Bansal, Deepak Alok, John P. McCrae, Ondřej Dušek", "id": "2405.20805v1", "paper_url": "http://arxiv.org/abs/2405.20805v1", "repo": "null"}}