{"2409.08111": {"publish_time": "2024-09-12", "title": "Towards a graph-based foundation model for network traffic analysis", "paper_summary": "Foundation models have shown great promise in various fields of study. A\npotential application of such models is in computer network traffic analysis,\nwhere these models can grasp the complexities of network traffic dynamics and\nadapt to any specific task or network environment with minimal fine-tuning.\nPrevious approaches have used tokenized hex-level packet data and the model\narchitecture of large language transformer models. We propose a new, efficient\ngraph-based alternative at the flow-level. Our approach represents network\ntraffic as a dynamic spatio-temporal graph, employing a self-supervised link\nprediction pretraining task to capture the spatial and temporal dynamics in\nthis network graph framework. To evaluate the effectiveness of our approach, we\nconduct a few-shot learning experiment for three distinct downstream network\ntasks: intrusion detection, traffic classification, and botnet classification.\nModels finetuned from our pretrained base achieve an average performance\nincrease of 6.87\\% over training from scratch, demonstrating their ability to\neffectively learn general network traffic dynamics during pretraining. This\nsuccess suggests the potential for a large-scale version to serve as an\noperational foundational model.", "paper_summary_zh": "基礎模型已在各個研究領域中展現出極大的前景。此類模型的潛在應用之一在於電腦網路流量分析，其中這些模型可以掌握網路流量動態的複雜性，並以最小的微調適應任何特定任務或網路環境。先前的做法已使用標記化十六進位層級封包資料和大型語言轉換器模型的模型架構。我們提出一個新的、有效的流程層級圖形化替代方案。我們的做法將網路流量表示為動態時空圖形，採用自我監督連結預測預訓練任務來捕捉此網路圖形架構中的空間和時間動態。為了評估我們做法的有效性，我們對三個不同的下游網路任務（入侵偵測、流量分類和殭屍網路分類）進行少量學習實驗。從我們的預訓練基礎微調的模型，其平均效能提升 6.87%，高於從頭訓練，這證明了它們在預訓練期間有效學習一般網路流量動態的能力。這項成功顯示出大規模版本有潛力作為運作基礎模型。", "author": "Louis Van Langendonck et.al.", "authors": "Louis Van Langendonck, Ismael Castell-Uroz, Pere Barlet-Ros", "id": "2409.08111v1", "paper_url": "http://arxiv.org/abs/2409.08111v1", "repo": "null"}}