{"2405.14437": {"publish_time": "2024-05-23", "title": "Combining Denoising Autoencoders with Contrastive Learning to fine-tune Transformer Models", "paper_summary": "Recently, using large pretrained Transformer models for transfer learning\ntasks has evolved to the point where they have become one of the flagship\ntrends in the Natural Language Processing (NLP) community, giving rise to\nvarious outlooks such as prompt-based, adapters or combinations with\nunsupervised approaches, among many others. This work proposes a 3 Phase\ntechnique to adjust a base model for a classification task. First, we adapt the\nmodel's signal to the data distribution by performing further training with a\nDenoising Autoencoder (DAE). Second, we adjust the representation space of the\noutput to the corresponding classes by clustering through a Contrastive\nLearning (CL) method. In addition, we introduce a new data augmentation\napproach for Supervised Contrastive Learning to correct the unbalanced\ndatasets. Third, we apply fine-tuning to delimit the predefined categories.\nThese different phases provide relevant and complementary knowledge to the\nmodel to learn the final task. We supply extensive experimental results on\nseveral datasets to demonstrate these claims. Moreover, we include an ablation\nstudy and compare the proposed method against other ways of combining these\ntechniques.", "paper_summary_zh": "最近，使用大型预训练 Transformer 模型进行迁移学习的任务已经发展到成为自然语言处理 (NLP) 社群中旗舰趋势之一的地步，催生了各种展望，例如基于提示、适配器或与无监督方法相结合，还有许多其他方法。这项工作提出了一种 3 阶段技术，用于调整基础模型以进行分类任务。首先，我们通过使用去噪自动编码器 (DAE) 执行进一步的训练，将模型的信号调整到数据分布。其次，我们通过对比学习 (CL) 方法进行聚类，将输出的表示空间调整到相应的类别。此外，我们引入了一种新的数据扩充方法，用于监督对比学习，以纠正不平衡的数据集。第三，我们应用微调来划定预定义的类别。这些不同的阶段为模型提供了相关且互补的知识，以学习最终任务。我们在多个数据集上提供了广泛的实验结果，以证明这些说法。此外，我们还包括消融研究，并将所提出的方法与结合这些技术的其他方式进行比较。", "author": "Alejo Lopez-Avila et.al.", "authors": "Alejo Lopez-Avila, Víctor Suárez-Paniagua", "id": "2405.14437v1", "paper_url": "http://arxiv.org/abs/2405.14437v1", "repo": "https://github.com/vsuarezpaniagua/3-phase_finetuning"}}