{"2502.10325": {"publish_time": "2025-02-14", "title": "Process Reward Models for LLM Agents: Practical Framework and Directions", "paper_summary": "We introduce Agent Process Reward Models (AgentPRM), a simple and scalable\nframework for training LLM agents to continually improve through interactions.\nAgentPRM follows a lightweight actor-critic paradigm, using Monte Carlo\nrollouts to compute reward targets and optimize policies. It requires minimal\nmodifications to existing RLHF pipelines, making it easy to integrate at scale.\nBeyond AgentPRM, we propose InversePRM, which learns process rewards directly\nfrom demonstrations without explicit outcome supervision. We also explore key\nchallenges and opportunities, including exploration, process reward shaping,\nand model-predictive reasoning. We evaluate on ALFWorld benchmark, show that\nsmall 3B models trained with AgentPRM and InversePRM outperform strong GPT-4o\nbaselines, and analyze test-time scaling, reward hacking, and more. Our code is\navailable at: https://github.com/sanjibanc/agent_prm.", "paper_summary_zh": "我們介紹了代理程序獎勵模型 (AgentPRM)，這是一個簡單且可擴充的框架，用於訓練 LLM 代理程序透過互動持續改進。AgentPRM 遵循輕量級的 Actor-Critic 範例，使用蒙地卡羅滾動計算獎勵目標並最佳化策略。它只需要對現有的 RLHF 管線進行最小的修改，使其易於大規模整合。除了 AgentPRM，我們提出了 InversePRM，它直接從示範中學習過程獎勵，而無需明確的結果監督。我們還探討了關鍵挑戰和機會，包括探索、過程獎勵塑造和模型預測推理。我們在 ALFWorld 基準上進行評估，表明使用 AgentPRM 和 InversePRM 訓練的小型 3B 模型優於強大的 GPT-4o 基準，並分析測試時間縮放、獎勵破解等。我們的程式碼可於此處取得：https://github.com/sanjibanc/agent_prm。", "author": "Sanjiban Choudhury et.al.", "authors": "Sanjiban Choudhury", "id": "2502.10325v1", "paper_url": "http://arxiv.org/abs/2502.10325v1", "repo": "null"}}