{"2408.10604": {"publish_time": "2024-08-20", "title": "Multilingual Non-Factoid Question Answering with Silver Answers", "paper_summary": "Most existing Question Answering Datasets (QuADs) primarily focus on\nfactoid-based short-context Question Answering (QA) in high-resource languages.\nHowever, the scope of such datasets for low-resource languages remains limited,\nwith only a few works centered on factoid-based QuADs and none on non-factoid\nQuADs. Therefore, this work presents MuNfQuAD, a multilingual QuAD with\nnon-factoid questions. It utilizes interrogative sub-headings from BBC news\narticles as questions and the corresponding paragraphs as silver answers. The\ndataset comprises over 370K QA pairs across 38 languages, encompassing several\nlow-resource languages, and stands as the largest multilingual QA dataset to\ndate. Based on the manual annotations of 790 QA-pairs from MuNfQuAD (golden\nset), we observe that 98\\% of questions can be answered using their\ncorresponding silver answer. Our fine-tuned Answer Paragraph Selection (APS)\nmodel outperforms the baselines. The APS model attained an accuracy of 80\\% and\n72\\%, as well as a macro F1 of 72\\% and 66\\%, on the MuNfQuAD testset and the\ngolden set, respectively. Furthermore, the APS model effectively generalizes\ncertain a language within the golden set, even after being fine-tuned on silver\nlabels.", "paper_summary_zh": "現有的大多數問答資料集（QuAD）主要關注高資源語言中的基於事實的短文脈問答（QA）。然而，此類資料集在低資源語言中的應用範圍仍然有限，只有少數作品專注於基於事實的 QuAD，而沒有關於非事實 QuAD 的作品。因此，這項工作提出了 MuNfQuAD，一個具有非事實問題的多語言 QuAD。它利用 BBC 新聞文章中的疑問小標題作為問題，並將相應的段落作為銀色答案。該資料集包含 38 種語言中超過 37 萬個 QA 對，涵蓋多種低資源語言，並且是迄今為止最大的多語言 QA 資料集。根據 MuNfQuAD（黃金集）中 790 個 QA 對的手動註釋，我們觀察到 98% 的問題可以使用其相應的銀色答案來回答。我們微調後的答案段落選擇（APS）模型優於基線。APS 模型在 MuNfQuAD 測試集和黃金集上分別達到 80% 和 72% 的準確率，以及 72% 和 66% 的巨集 F1。此外，即使在銀色標籤上進行微調後，APS 模型也能有效地概括黃金集中某些語言。", "author": "Ritwik Mishra et.al.", "authors": "Ritwik Mishra, Sreeram Vennam, Rajiv Ratn Shah, Ponnurangam Kumaraguru", "id": "2408.10604v1", "paper_url": "http://arxiv.org/abs/2408.10604v1", "repo": "null"}}