{"2412.18270": {"publish_time": "2024-12-24", "title": "Annotating References to Mythological Entities in French Literature", "paper_summary": "In this paper, we explore the relevance of large language models (LLMs) for\nannotating references to Roman and Greek mythological entities in modern and\ncontemporary French literature. We present an annotation scheme and demonstrate\nthat recent LLMs can be directly applied to follow this scheme effectively,\nalthough not without occasionally making significant analytical errors.\nAdditionally, we show that LLMs (and, more specifically, ChatGPT) are capable\nof offering interpretative insights into the use of mythological references by\nliterary authors. However, we also find that LLMs struggle to accurately\nidentify relevant passages in novels (when used as an information retrieval\nengine), often hallucinating and generating fabricated examples-an issue that\nraises significant ethical concerns. Nonetheless, when used carefully, LLMs\nremain valuable tools for performing annotations with high accuracy, especially\nfor tasks that would be difficult to annotate comprehensively on a large scale\nthrough manual methods alone.", "paper_summary_zh": "在本文中，我們探討大型語言模型 (LLM) 對現代和當代法語文學中羅馬和希臘神話實體引用的註解相關性。我們提出一個註解方案，並展示最近的 LLM 可以直接應用於有效遵循此方案，儘管偶爾會出現重大的分析錯誤。此外，我們展示了 LLM（更具體地說，是 ChatGPT）能夠提供對文學作者使用神話引用的詮釋見解。然而，我們也發現 LLM 難以準確識別小說中的相關段落（當用作資訊檢索引擎時），經常出現幻覺並產生虛構的範例，這是一個引發重大道德問題的問題。儘管如此，在小心使用時，LLM 仍然是執行高準確度註解的寶貴工具，特別是對於僅透過手動方法難以全面註解的大規模任務。", "author": "Thierry Poibeau et.al.", "authors": "Thierry Poibeau", "id": "2412.18270v1", "paper_url": "http://arxiv.org/abs/2412.18270v1", "repo": "null"}}