{"2412.02410": {"publish_time": "2024-12-03", "title": "A Multi-Agent Framework for Extensible Structured Text Generation in PLCs", "paper_summary": "Programmable Logic Controllers (PLCs) are microcomputers essential for\nautomating factory operations. Structured Text (ST), a high-level language\nadhering to the IEC 61131-3 standard, is pivotal for PLCs due to its ability to\nexpress logic succinctly and to seamlessly integrate with other languages\nwithin the same standard. However, vendors develop their own customized\nversions of ST, and the lack of comprehensive and standardized documentation\nfor the full semantics of ST has contributed to inconsistencies in how the\nlanguage is implemented. Consequently, the steep learning curve associated with\nST, combined with ever-evolving industrial requirements, presents significant\nchallenges for developers. In response to these issues, we present AutoPLC, an\nLLM-based approach designed to automate the generation of vendor-specific ST\ncode. To facilitate effective code generation, we first built a comprehensive\nknowledge base, including Rq2ST Case Library (requirements and corresponding\nimplementations) and Instruction libraries. Then we developed a retrieval\nmodule to incorporate the domain-specific knowledge by identifying pertinent\ncases and instructions, guiding the LLM to generate code that meets the\nrequirements. In order to verify and improve the quality of the generated code,\nwe designed an adaptable code checker. If errors are detected, we initiate an\niterative self-improvement process to instruct the LLM to revise the generated\ncode. We evaluate AutoPLC's performance against seven state-of-the-art\nbaselines using three benchmarks, one for open-source basic ST and two for\ncommercial Structured Control Language (SCL) from Siemens. The results show\nthat our approach consistently achieves superior performance across all\nbenchmarks. Ablation study emphasizes the significance of our modules. Further\nmanual analysis confirm the practical utility of the ST code generated by\nAutoPLC.", "paper_summary_zh": "可程式邏輯控制器 (PLC) 是工廠自動化作業中不可或缺的微電腦。結構化文字 (ST) 是一種遵循 IEC 61131-3 標準的高階語言，由於其能夠簡潔地表達邏輯並與同一個標準中的其他語言無縫整合，因此對於 PLC 至關重要。然而，供應商開發了自己的自訂 ST 版本，而且缺乏全面且標準化的 ST 語意文件，導致語言實作方式不一致。因此，與 ST 相關的陡峭學習曲線，加上不斷變化的產業需求，對開發人員來說構成重大挑戰。為了回應這些問題，我們提出了 AutoPLC，這是一種基於 LLM 的方法，旨在自動產生特定供應商的 ST 程式碼。為了促進有效的程式碼產生，我們首先建立了一個全面的知識庫，包括 Rq2ST 案例程式庫（需求和對應的實作）和指令程式庫。然後，我們開發了一個擷取模組，透過識別相關的案例和指令來納入特定領域的知識，引導 LLM 產生符合需求的程式碼。為了驗證和提升所產生程式碼的品質，我們設計了一個適應性程式碼檢查器。如果偵測到錯誤，我們會啟動一個反覆的自體改善程序，指示 LLM 修改所產生的程式碼。我們使用三個基準對 AutoPLC 的效能進行評估，其中一個基準是開放原始碼的基本 ST，另外兩個基準是來自西門子的商業結構化控制語言 (SCL)。結果顯示，我們的做法在所有基準中持續達成卓越的效能。消融研究強調了我們模組的重要性。進一步的手動分析確認了 AutoPLC 所產生的 ST 程式碼的實用性。", "author": "Donghao Yang et.al.", "authors": "Donghao Yang, Aolang Wu, Tianyi Zhang, Li Zhang, Fang Liu, Xiaoli Lian, Yuming Ren, Jiaji Tian", "id": "2412.02410v1", "paper_url": "http://arxiv.org/abs/2412.02410v1", "repo": "null"}}