{"2408.11554": {"publish_time": "2024-08-21", "title": "Differentiating Choices via Commonality for Multiple-Choice Question Answering", "paper_summary": "Multiple-choice question answering (MCQA) becomes particularly challenging\nwhen all choices are relevant to the question and are semantically similar. Yet\nthis setting of MCQA can potentially provide valuable clues for choosing the\nright answer. Existing models often rank each choice separately, overlooking\nthe context provided by other choices. Specifically, they fail to leverage the\nsemantic commonalities and nuances among the choices for reasoning. In this\npaper, we propose a novel MCQA model by differentiating choices through\nidentifying and eliminating their commonality, called DCQA. Our model captures\ntoken-level attention of each choice to the question, and separates tokens of\nthe question attended to by all the choices (i.e., commonalities) from those by\nindividual choices (i.e., nuances). Using the nuances as refined contexts for\nthe choices, our model can effectively differentiate choices with subtle\ndifferences and provide justifications for choosing the correct answer. We\nconduct comprehensive experiments across five commonly used MCQA benchmarks,\ndemonstrating that DCQA consistently outperforms baseline models. Furthermore,\nour case study illustrates the effectiveness of the approach in directing the\nattention of the model to more differentiating features.", "paper_summary_zh": "多選題問答 (MCQA) 在所有選項都與問題相關且語義相似時，會變得特別具有挑戰性。然而，這種 MCQA 設定可以潛在提供有價值的線索，以選擇正確答案。現有的模型通常會分別對每個選項進行排名，忽略其他選項提供的上下文。具體來說，它們無法利用選項之間的語義共性和細微差別進行推理。在本文中，我們提出了通過識別和消除它們的共性來區分選項的新型 MCQA 模型，稱為 DCQA。我們的模型捕捉每個選項對問題的標記級別注意力，並將所有選項關注的問題標記（即共性）與個別選項關注的問題標記（即細微差別）分開。使用細微差別作為選項的精緻上下文，我們的模型可以有效地區分具有細微差別並提供選擇正確答案的理由。我們在五個常用的 MCQA 基準上進行了全面的實驗，證明 DCQA 持續優於基準模型。此外，我們的案例研究說明了該方法在將模型的注意力引導到更多區分性特徵方面的有效性。", "author": "Wenqing Deng et.al.", "authors": "Wenqing Deng, Zhe Wang, Kewen Wang, Shirui Pan, Xiaowang Zhang, Zhiyong Feng", "id": "2408.11554v1", "paper_url": "http://arxiv.org/abs/2408.11554v1", "repo": "https://github.com/dwq-vicki/dcqa"}}