{"2410.06547": {"publish_time": "2024-10-09", "title": "TuringQ: Benchmarking AI Comprehension in Theory of Computation", "paper_summary": "We present TuringQ, the first benchmark designed to evaluate the reasoning\ncapabilities of large language models (LLMs) in the theory of computation.\nTuringQ consists of 4,006 undergraduate and graduate-level question-answer\npairs, categorized into four difficulty levels and covering seven core\ntheoretical areas. We evaluate several open-source LLMs, as well as GPT-4,\nusing Chain of Thought prompting and expert human assessment. Additionally, we\npropose an automated LLM-based evaluation system that demonstrates competitive\naccuracy when compared to human evaluation. Fine-tuning a Llama3-8B model on\nTuringQ shows measurable improvements in reasoning ability and out-of-domain\ntasks such as algebra. TuringQ serves as both a benchmark and a resource for\nenhancing LLM performance in complex computational reasoning tasks. Our\nanalysis offers insights into LLM capabilities and advances in AI comprehension\nof theoretical computer science.", "paper_summary_zh": "我們展示 TuringQ，這是第一個基準，旨在評估大型語言模型 (LLM) 在計算理論中的推理能力。TuringQ 包含 4,006 個大學部和研究所等級的問答配對，分為四個難度等級，涵蓋七個核心理論領域。我們使用 Thought 提示鏈和專家人類評估來評估幾個開源 LLM，以及 GPT-4。此外，我們提出了一個自動化的 LLM 基礎評估系統，與人類評估相比，它展示出具有競爭力的準確性。在 TuringQ 上微調 Llama3-8B 模型顯示出推理能力和代數等領域任務的可衡量改進。TuringQ 同時作為基準和資源，用於增強 LLM 在複雜計算推理任務中的表現。我們的分析提供了對 LLM 能力的見解，並推動了 AI 對理論計算科學的理解。", "author": "Pardis Sadat Zahraei et.al.", "authors": "Pardis Sadat Zahraei, Ehsaneddin Asgari", "id": "2410.06547v1", "paper_url": "http://arxiv.org/abs/2410.06547v1", "repo": "null"}}