{"2411.09318": {"publish_time": "2024-11-14", "title": "DriveThru: a Document Extraction Platform and Benchmark Datasets for Indonesian Local Language Archives", "paper_summary": "Indonesia is one of the most diverse countries linguistically. However,\ndespite this linguistic diversity, Indonesian languages remain underrepresented\nin Natural Language Processing (NLP) research and technologies. In the past two\nyears, several efforts have been conducted to construct NLP resources for\nIndonesian languages. However, most of these efforts have been focused on\ncreating manual resources thus difficult to scale to more languages. Although\nmany Indonesian languages do not have a web presence, locally there are\nresources that document these languages well in printed forms such as books,\nmagazines, and newspapers. Digitizing these existing resources will enable\nscaling of Indonesian language resource construction to many more languages. In\nthis paper, we propose an alternative method of creating datasets by digitizing\ndocuments, which have not previously been used to build digital language\nresources in Indonesia. DriveThru is a platform for extracting document content\nutilizing Optical Character Recognition (OCR) techniques in its system to\nprovide language resource building with less manual effort and cost. This paper\nalso studies the utility of current state-of-the-art LLM for post-OCR\ncorrection to show the capability of increasing the character accuracy rate\n(CAR) and word accuracy rate (WAR) compared to off-the-shelf OCR.", "paper_summary_zh": "印尼在語言學上是最多元化的國家之一。然而，儘管有這種語言的多樣性，印尼語在自然語言處理 (NLP) 研究和技術中仍然代表性不足。在過去兩年，已經進行了數項工作來構建印尼語的 NLP 資源。然而，這些工作大多集中在創建手動資源上，因此難以擴展到更多語言。儘管許多印尼語沒有網路存在，但在當地有資源以印刷形式（例如書籍、雜誌和報紙）很好地記錄了這些語言。將這些現有資源數位化將使印尼語資源構建擴展到更多語言。在本文中，我們提出了一種通過數位化文件來創建資料集的替代方法，該方法以前未用於在印尼建立數位語言資源。DriveThru 是利用其系統中的光學字元辨識 (OCR) 技術來擷取文件內容的平台，可提供語言資源建置，且人工成本較低。本文還研究了當前最先進的 LLM 在 OCR 後校正中的效用，以展示與現成的 OCR 相比，提高字元準確率 (CAR) 和字詞準確率 (WAR) 的能力。", "author": "MohammadRifqi Farhansyah et.al.", "authors": "MohammadRifqi Farhansyah, Muhammad Zuhdi Fikri Johari, Afinzaki Amiral, Ayu Purwarianti, Kumara Ari Yuana, Derry Tanti Wijaya", "id": "2411.09318v1", "paper_url": "http://arxiv.org/abs/2411.09318v1", "repo": "https://github.com/ragambahasa/OCR-Correction"}}