{"2410.14425": {"publish_time": "2024-10-18", "title": "Unlearning Backdoor Attacks for LLMs with Weak-to-Strong Knowledge Distillation", "paper_summary": "Parameter-efficient fine-tuning (PEFT) can bridge the gap between large\nlanguage models (LLMs) and downstream tasks. However, PEFT has been proven\nvulnerable to malicious attacks. Research indicates that poisoned LLMs, even\nafter PEFT, retain the capability to activate internalized backdoors when input\nsamples contain predefined triggers. In this paper, we introduce a novel\nweak-to-strong unlearning algorithm to defend against backdoor attacks based on\nfeature alignment knowledge distillation, named W2SDefense. Specifically, we\nfirst train a small-scale language model through full-parameter fine-tuning to\nserve as the clean teacher model. Then, this teacher model guides the\nlarge-scale poisoned student model in unlearning the backdoor, leveraging PEFT.\nTheoretical analysis suggests that W2SDefense has the potential to enhance the\nstudent model's ability to unlearn backdoor features, preventing the activation\nof the backdoor. We conduct experiments on text classification tasks involving\nthree state-of-the-art language models and three different backdoor attack\nalgorithms. Our empirical results demonstrate the outstanding performance of\nW2SDefense in defending against backdoor attacks without compromising model\nperformance.", "paper_summary_zh": "參數高效微調 (PEFT) 可以彌合大型語言模型 (LLM) 和下游任務之間的差距。然而，PEFT 已被證明容易受到惡意攻擊。研究表明，中毒的 LLM，即使在 PEFT 之後，仍有能力在輸入範例包含預定義觸發器時啟動內部後門。在本文中，我們引入了一種新穎的弱到強的遺忘演算法，以基於特徵對齊知識蒸餾來防禦後門攻擊，稱為 W2SDefense。具體來說，我們首先通過全參數微調訓練一個小規模語言模型，作為乾淨的教師模型。然後，這個教師模型指導大規模中毒的學生模型在利用 PEFT 遺忘後門。理論分析表明，W2SDefense 有可能增強學生模型遺忘後門特徵的能力，防止後門被啟動。我們對涉及三個最先進語言模型和三個不同後門攻擊演算法的文本分類任務進行了實驗。我們的實證結果證明了 W2SDefense 在防禦後門攻擊方面的出色表現，而不會損害模型性能。", "author": "Shuai Zhao et.al.", "authors": "Shuai Zhao, Xiaobao Wu, Cong-Duy Nguyen, Meihuizi Jia, Yichao Feng, Luu Anh Tuan", "id": "2410.14425v1", "paper_url": "http://arxiv.org/abs/2410.14425v1", "repo": "https://github.com/shuaizhao95/Unlearning"}}