{"2412.09957": {"publish_time": "2024-12-13", "title": "Romanized to Native Malayalam Script Transliteration Using an Encoder-Decoder Framework", "paper_summary": "In this work, we present the development of a reverse transliteration model\nto convert romanized Malayalam to native script using an encoder-decoder\nframework built with attention-based bidirectional Long Short Term Memory\n(Bi-LSTM) architecture. To train the model, we have used curated and combined\ncollection of 4.3 million transliteration pairs derived from publicly available\nIndic language translitertion datasets, Dakshina and Aksharantar. We evaluated\nthe model on two different test dataset provided by IndoNLP-2025-Shared-Task\nthat contain, (1) General typing patterns and (2) Adhoc typing patterns,\nrespectively. On the Test Set-1, we obtained a character error rate (CER) of\n7.4%. However upon Test Set-2, with adhoc typing patterns, where most vowel\nindicators are missing, our model gave a CER of 22.7%.", "paper_summary_zh": "在這項工作中，我們展示了一個反轉音譯模型的開發，使用一個建構於基於注意力的雙向長短期記憶 (Bi-LSTM) 架構的編碼器-解碼器框架，將羅馬化的馬拉雅拉姆語轉換成原生文字。為了訓練模型，我們使用了一個由公開的印度語言轉寫資料集 Dakshina 和 Aksharantar 中衍生的 430 萬個轉寫對的精選和組合集合。我們在 IndoNLP-2025-Shared-Task 提供的兩個不同的測試資料集上評估了模型，分別包含 (1) 一般輸入模式和 (2) 特殊輸入模式。在測試集 1 上，我們獲得了 7.4% 的字元錯誤率 (CER)。然而在測試集 2 上，在特殊輸入模式中，大多數的元音指示符號都遺失，我們的模型給出了 22.7% 的 CER。", "author": "Bajiyo Baiju et.al.", "authors": "Bajiyo Baiju, Kavya Manohar, Leena G Pillai, Elizabeth Sherly", "id": "2412.09957v1", "paper_url": "http://arxiv.org/abs/2412.09957v1", "repo": "null"}}