{"2409.08107": {"publish_time": "2024-09-12", "title": "WhisperNER: Unified Open Named Entity and Speech Recognition", "paper_summary": "Integrating named entity recognition (NER) with automatic speech recognition\n(ASR) can significantly enhance transcription accuracy and informativeness. In\nthis paper, we introduce WhisperNER, a novel model that allows joint speech\ntranscription and entity recognition. WhisperNER supports open-type NER,\nenabling recognition of diverse and evolving entities at inference. Building on\nrecent advancements in open NER research, we augment a large synthetic dataset\nwith synthetic speech samples. This allows us to train WhisperNER on a large\nnumber of examples with diverse NER tags. During training, the model is\nprompted with NER labels and optimized to output the transcribed utterance\nalong with the corresponding tagged entities. To evaluate WhisperNER, we\ngenerate synthetic speech for commonly used NER benchmarks and annotate\nexisting ASR datasets with open NER tags. Our experiments demonstrate that\nWhisperNER outperforms natural baselines on both out-of-domain open type NER\nand supervised finetuning.", "paper_summary_zh": "整合命名實體辨識 (NER) 與自動語音辨識 (ASR) 能夠大幅提升轉錄的準確度和資訊量。在這篇論文中，我們介紹了 WhisperNER，一種新穎的模型，可同時進行語音轉錄和實體辨識。WhisperNER 支援開放式 NER，可在推論時辨識出多樣且不斷演進的實體。建構在開放式 NER 研究的最新進展上，我們擴充了一個大型合成資料集，加入了合成語音範例。這讓我們能夠使用大量標有不同 NER 標籤的範例訓練 WhisperNER。在訓練期間，模型會提示 NER 標籤，並最佳化輸出轉錄的語句以及對應標記的實體。為了評估 WhisperNER，我們為常用的 NER 基準產生合成語音，並使用開放式 NER 標籤註解現有的 ASR 資料集。我們的實驗證明，WhisperNER 在開放式 NER 和監督式微調的非領域外任務上都優於自然基準。", "author": "Gil Ayache et.al.", "authors": "Gil Ayache, Menachem Pirchi, Aviv Navon, Aviv Shamsian, Gill Hetz, Joseph Keshet", "id": "2409.08107v1", "paper_url": "http://arxiv.org/abs/2409.08107v1", "repo": "null"}}