{"2207.04969": {"publish_time": "2022-07-11", "title": "From Correlation to Causation: Formalizing Interpretable Machine Learning as a Statistical Process", "paper_summary": "Explainable AI (XAI) is a necessity in safety-critical systems such as in\nclinical diagnostics due to a high risk for fatal decisions. Currently,\nhowever, XAI resembles a loose collection of methods rather than a well-defined\nprocess. In this work, we elaborate on conceptual similarities between the\nlargest subgroup of XAI, interpretable machine learning (IML), and classical\nstatistics. Based on these similarities, we present a formalization of IML\nalong the lines of a statistical process. Adopting this statistical view allows\nus to interpret machine learning models and IML methods as sophisticated\nstatistical tools. Based on this interpretation, we infer three key questions,\nwhich we identify as crucial for the success and adoption of IML in\nsafety-critical settings. By formulating these questions, we further aim to\nspark a discussion about what distinguishes IML from classical statistics and\nwhat our perspective implies for the future of the field.", "paper_summary_zh": "可解釋人工智慧 (XAI) 在安全關鍵系統中是必要的，例如在臨床診斷中，因為有做出致命決策的高風險。然而，目前 XAI 就像是一堆鬆散的方法，而不是一個定義良好的流程。在這項工作中，我們闡述了 XAI 最大子群體可解釋機器學習 (IML) 與古典統計之間的概念相似性。基於這些相似性，我們提出了一個沿著統計流程的 IML 形式化。採用這種統計觀點使我們能夠將機器學習模型和 IML 方法解釋為複雜的統計工具。基於這種解釋，我們推論出三個關鍵問題，我們將其視為在安全關鍵環境中 IML 成功和採用至關重要的問題。透過制定這些問題，我們進一步旨在引發一場關於 IML 與古典統計之間的區別以及我們的觀點對該領域未來的影響的討論。", "author": "Lukas Klein et.al.", "authors": "Lukas Klein, Mennatallah El-Assady, Paul F. Jäger", "id": "2207.04969v1", "paper_url": "http://arxiv.org/abs/2207.04969v1", "repo": "null"}}