{"2407.00731": {"publish_time": "2024-06-30", "title": "Large Language Models Struggle in Token-Level Clinical Named Entity Recognition", "paper_summary": "Large Language Models (LLMs) have revolutionized various sectors, including\nhealthcare where they are employed in diverse applications. Their utility is\nparticularly significant in the context of rare diseases, where data scarcity,\ncomplexity, and specificity pose considerable challenges. In the clinical\ndomain, Named Entity Recognition (NER) stands out as an essential task and it\nplays a crucial role in extracting relevant information from clinical texts.\nDespite the promise of LLMs, current research mostly concentrates on\ndocument-level NER, identifying entities in a more general context across\nentire documents, without extracting their precise location. Additionally,\nefforts have been directed towards adapting ChatGPT for token-level NER.\nHowever, there is a significant research gap when it comes to employing\ntoken-level NER for clinical texts, especially with the use of local\nopen-source LLMs. This study aims to bridge this gap by investigating the\neffectiveness of both proprietary and local LLMs in token-level clinical NER.\nEssentially, we delve into the capabilities of these models through a series of\nexperiments involving zero-shot prompting, few-shot prompting,\nretrieval-augmented generation (RAG), and instruction-fine-tuning. Our\nexploration reveals the inherent challenges LLMs face in token-level NER,\nparticularly in the context of rare diseases, and suggests possible\nimprovements for their application in healthcare. This research contributes to\nnarrowing a significant gap in healthcare informatics and offers insights that\ncould lead to a more refined application of LLMs in the healthcare sector.", "paper_summary_zh": "大型語言模型 (LLM) 已徹底改變了各個領域，包括醫療保健，它們在其中被用於各種應用程式。它們的實用性在罕見疾病的背景下尤其重要，因為資料稀少、複雜且具特異性，對此構成相當大的挑戰。在臨床領域中，命名實體識別 (NER) 是一個重要的任務，在從臨床文本中擷取相關資訊方面扮演至關重要的角色。儘管 LLM 前景看好，但目前的研究大多集中在文件層級的 NER，在整個文件中識別更通用的背景中的實體，而不會擷取它們精確的位置。此外，已將精力投入於調整 ChatGPT 以進行代幣層級的 NER。然而，在使用代幣層級的 NER 來處理臨床文本時，特別是在使用本地的開源 LLM 時，存在重大的研究差距。本研究旨在透過探討專有和本地 LLM 在代幣層級臨床 NER 中的有效性來彌補此差距。基本上，我們透過一系列涉及零次提示、少次提示、檢索增強生成 (RAG) 和指令微調的實驗，深入探討這些模型的能力。我們的探索揭示了 LLM 在代幣層級 NER 中面臨的固有挑戰，特別是在罕見疾病的背景下，並建議了它們在醫療保健應用中可能的改進。本研究有助於縮小醫療保健資訊學中的一個重大差距，並提供可望導致在醫療保健領域更精緻地應用 LLM 的見解。", "author": "Qiuhao Lu et.al.", "authors": "Qiuhao Lu, Rui Li, Andrew Wen, Jinlian Wang, Liwei Wang, Hongfang Liu", "id": "2407.00731v1", "paper_url": "http://arxiv.org/abs/2407.00731v1", "repo": "null"}}