{"2409.16867": {"publish_time": "2024-09-25", "title": "Multi-objective Evolution of Heuristic Using Large Language Model", "paper_summary": "Heuristics are commonly used to tackle diverse search and optimization\nproblems. Design heuristics usually require tedious manual crafting with domain\nknowledge. Recent works have incorporated large language models (LLMs) into\nautomatic heuristic search leveraging their powerful language and coding\ncapacity. However, existing research focuses on the optimal performance on the\ntarget problem as the sole objective, neglecting other criteria such as\nefficiency and scalability, which are vital in practice. To tackle this\nchallenge, we propose to model heuristic search as a multi-objective\noptimization problem and consider introducing other practical criteria beyond\noptimal performance. Due to the complexity of the search space, conventional\nmulti-objective optimization methods struggle to effectively handle\nmulti-objective heuristic search. We propose the first LLM-based\nmulti-objective heuristic search framework, Multi-objective Evolution of\nHeuristic (MEoH), which integrates LLMs in a zero-shot manner to generate a\nnon-dominated set of heuristics to meet multiple design criteria. We design a\nnew dominance-dissimilarity mechanism for effective population management and\nselection, which incorporates both code dissimilarity in the search space and\ndominance in the objective space. MEoH is demonstrated in two well-known\ncombinatorial optimization problems: the online Bin Packing Problem (BPP) and\nthe Traveling Salesman Problem (TSP). Results indicate that a variety of elite\nheuristics are automatically generated in a single run, offering more trade-off\noptions than existing methods. It successfully achieves competitive or superior\nperformance while improving efficiency up to 10 times. Moreover, we also\nobserve that the multi-objective search introduces novel insights into\nheuristic design and leads to the discovery of diverse heuristics.", "paper_summary_zh": "啟發式法通常用於解決各種搜尋和最佳化問題。設計啟發式法通常需要使用領域知識進行繁瑣的手動製作。最近的研究已將大型語言模型 (LLM) 納入自動啟發式搜尋中，以利用其強大的語言和編碼能力。然而，現有研究只關注目標問題的最佳效能，而忽略了其他標準，例如效率和可擴充性，這在實務上至關重要。為了應對這個挑戰，我們提出將啟發式搜尋建模為多目標最佳化問題，並考慮在最佳效能之外引入其他實用標準。由於搜尋空間的複雜性，傳統的多目標最佳化方法難以有效處理多目標啟發式搜尋。我們提出了第一個基於 LLM 的多目標啟發式搜尋架構，即啟發式多目標演化 (MEoH)，它以零次學習的方式整合 LLM，以產生一組非支配的啟發式法，以滿足多重設計標準。我們設計了一個新的支配相異性機制，用於有效的人口管理和選擇，它結合了搜尋空間中的程式碼相異性和目標空間中的支配性。MEoH 在兩個著名的組合最佳化問題中得到證明：線上二維 bin 分割問題 (BPP) 和旅行推銷員問題 (TSP)。結果表明，在單次執行中自動產生了各種精英啟發式法，提供了比現有方法更多權衡選項。它成功地達到了競爭性或優越的效能，同時將效率提升了 10 倍。此外，我們還觀察到，多目標搜尋為啟發式設計引入了新的見解，並導致了各種啟發式法的發現。", "author": "Shunyu Yao et.al.", "authors": "Shunyu Yao, Fei Liu, Xi Lin, Zhichao Lu, Zhenkun Wang, Qingfu Zhang", "id": "2409.16867v1", "paper_url": "http://arxiv.org/abs/2409.16867v1", "repo": "null"}}