{"2405.05755": {"publish_time": "2024-05-09", "title": "CSA-Net: Channel-wise Spatially Autocorrelated Attention Networks", "paper_summary": "In recent years, convolutional neural networks (CNNs) with channel-wise\nfeature refining mechanisms have brought noticeable benefits to modelling\nchannel dependencies. However, current attention paradigms fail to infer an\noptimal channel descriptor capable of simultaneously exploiting statistical and\nspatial relationships among feature maps. In this paper, to overcome this\nshortcoming, we present a novel channel-wise spatially autocorrelated (CSA)\nattention mechanism. Inspired by geographical analysis, the proposed CSA\nexploits the spatial relationships between channels of feature maps to produce\nan effective channel descriptor. To the best of our knowledge, this is the f\nirst time that the concept of geographical spatial analysis is utilized in deep\nCNNs. The proposed CSA imposes negligible learning parameters and light\ncomputational overhead to the deep model, making it a powerful yet efficient\nattention module of choice. We validate the effectiveness of the proposed CSA\nnetworks (CSA-Nets) through extensive experiments and analysis on ImageNet, and\nMS COCO benchmark datasets for image classification, object detection, and\ninstance segmentation. The experimental results demonstrate that CSA-Nets are\nable to consistently achieve competitive performance and superior\ngeneralization than several state-of-the-art attention-based CNNs over\ndifferent benchmark tasks and datasets.", "paper_summary_zh": "近年來，具有通道級特徵精煉機制的卷積神經網路 (CNN) 為通道依賴關係建模帶來了顯著的好處。然而，當前的注意力範例無法推斷出同時利用特徵圖中統計和空間關係的最佳通道描述符。在本文中，為了克服這個缺點，我們提出了一種新的通道級空間自相關 (CSA) 注意力機制。受地理分析的啟發，所提出的 CSA 利用特徵圖通道之間的空間關係來產生有效的通道描述符。據我們所知，這是地理空間分析的概念首次用於深度 CNN。所提出的 CSA 對深度模型施加了可忽略的學習參數和輕量級的運算開銷，使其成為功能強大且高效的注意力模組。我們透過在 ImageNet 和 MS COCO 基準資料集上進行廣泛的實驗和分析，驗證了所提出的 CSA 網路 (CSA-Nets) 的有效性，用於影像分類、物件偵測和實例分割。實驗結果表明，與多種現有注意力式 CNN 相比，CSA-Nets 能在不同的基準任務和資料集上持續達成具競爭力的效能和優越的泛化能力。", "author": "Nick et.al.", "authors": "Nick, Nikzad, Yongsheng Gao, Jun Zhou", "id": "2405.05755v1", "paper_url": "http://arxiv.org/abs/2405.05755v1", "repo": "null"}}