{"2412.13682": {"publish_time": "2024-12-18", "title": "ChinaTravel: A Real-World Benchmark for Language Agents in Chinese Travel Planning", "paper_summary": "Recent advances in LLMs, particularly in language reasoning and tool\nintegration, have rapidly sparked the real-world development of Language\nAgents. Among these, travel planning represents a prominent domain, combining\nacademic challenges with practical value due to its complexity and market\ndemand. However, existing benchmarks fail to reflect the diverse, real-world\nrequirements crucial for deployment. To address this gap, we introduce\nChinaTravel, a benchmark specifically designed for authentic Chinese travel\nplanning scenarios. We collect the travel requirements from questionnaires and\npropose a compositionally generalizable domain-specific language that enables a\nscalable evaluation process, covering feasibility, constraint satisfaction, and\npreference comparison. Empirical studies reveal the potential of neuro-symbolic\nagents in travel planning, achieving a constraint satisfaction rate of 27.9%,\nsignificantly surpassing purely neural models at 2.6%. Moreover, we identify\nkey challenges in real-world travel planning deployments, including open\nlanguage reasoning and unseen concept composition. These findings highlight the\nsignificance of ChinaTravel as a pivotal milestone for advancing language\nagents in complex, real-world planning scenarios.", "paper_summary_zh": "近來 LLM 在語言推理和工具整合方面取得了進展，迅速激發了語言代理的實際開發。其中，旅遊規劃代表了一個突出的領域，它結合了學術挑戰和實際價值，因為它的複雜性和市場需求。然而，現有的基準未能反映出對於部署至關重要的多樣化現實世界需求。為了解決這個差距，我們引入了 ChinaTravel，一個專門為正宗的中國旅遊規劃場景設計的基準。我們從問卷中收集旅遊需求，並提出一個可組合的通用特定領域語言，它能進行可擴充的評估過程，涵蓋可行性、約束滿足和偏好比較。實證研究揭示了神經符號代理在旅遊規劃中的潛力，實現了 27.9% 的約束滿足率，顯著超過了 2.6% 的純神經模型。此外，我們確定了現實世界旅遊規劃部署中的關鍵挑戰，包括開放語言推理和未見的概念組合。這些發現突出了 ChinaTravel 作為在複雜的現實世界規劃場景中推進語言代理的重要里程碑。", "author": "Jie-Jing Shao et.al.", "authors": "Jie-Jing Shao, Xiao-Wen Yang, Bo-Wen Zhang, Baizhi Chen, Wen-Da Wei, Lan-Zhe Guo, Yu-feng Li", "id": "2412.13682v1", "paper_url": "http://arxiv.org/abs/2412.13682v1", "repo": "null"}}