{"2410.21067": {"publish_time": "2024-10-28", "title": "CRAT: A Multi-Agent Framework for Causality-Enhanced Reflective and Retrieval-Augmented Translation with Large Language Models", "paper_summary": "Large language models (LLMs) have shown great promise in machine translation,\nbut they still struggle with contextually dependent terms, such as new or\ndomain-specific words. This leads to inconsistencies and errors that are\ndifficult to address. Existing solutions often depend on manual identification\nof such terms, which is impractical given the complexity and evolving nature of\nlanguage. While Retrieval-Augmented Generation (RAG) could provide some\nassistance, its application to translation is limited by issues such as\nhallucinations from information overload. In this paper, we propose CRAT, a\nnovel multi-agent translation framework that leverages RAG and\ncausality-enhanced self-reflection to address these challenges. This framework\nconsists of several specialized agents: the Unknown Terms Identification agent\ndetects unknown terms within the context, the Knowledge Graph (KG) Constructor\nagent extracts relevant internal knowledge about these terms and retrieves\nbilingual information from external sources, the Causality-enhanced Judge agent\nvalidates the accuracy of the information, and the Translator agent\nincorporates the refined information into the final output. This automated\nprocess allows for more precise and consistent handling of key terms during\ntranslation. Our results show that CRAT significantly improves translation\naccuracy, particularly in handling context-sensitive terms and emerging\nvocabulary.", "paper_summary_zh": "大型語言模型（LLM）在機器翻譯方面展現出極大的前景，\n但它們仍然難以應對依賴於語境的詞彙，例如新詞或特定領域的詞彙。這會導致不一致和錯誤，而這些錯誤很難解決。現有的解決方案通常依賴於手動識別此類詞彙，但由於語言的複雜性和不斷演變的特性，這並不可行。雖然檢索增強生成（RAG）可以提供一些協助，但其在翻譯中的應用受到諸如資訊超載產生的幻覺等問題的限制。在本文中，我們提出 CRAT，這是一個新穎的多代理翻譯架構，它利用 RAG 和因果增強自省來應對這些挑戰。此架構包含幾個專門的代理：未知詞彙識別代理會偵測語境中的未知詞彙，知識圖譜（KG）建構代理會擷取這些詞彙相關的內部知識，並從外部來源中檢索雙語資訊，因果增強判斷代理會驗證資訊的準確性，而翻譯代理會將精煉過的資訊納入最終輸出。這個自動化的流程允許在翻譯過程中更精確且一致地處理關鍵詞彙。我們的結果顯示，CRAT 大幅提升了翻譯準確性，特別是在處理對語境敏感的詞彙和新興詞彙方面。", "author": "Meiqi Chen et.al.", "authors": "Meiqi Chen, Fandong Meng, Yingxue Zhang, Yan Zhang, Jie Zhou", "id": "2410.21067v1", "paper_url": "http://arxiv.org/abs/2410.21067v1", "repo": "null"}}