{"2407.12964": {"publish_time": "2024-07-17", "title": "Learning Long-Horizon Predictions for Quadrotor Dynamics", "paper_summary": "Accurate modeling of system dynamics is crucial for achieving\nhigh-performance planning and control of robotic systems. Although existing\ndata-driven approaches represent a promising approach for modeling dynamics,\ntheir accuracy is limited to a short prediction horizon, overlooking the impact\nof compounding prediction errors over longer prediction horizons. Strategies to\nmitigate these cumulative errors remain underexplored. To bridge this gap, in\nthis paper, we study the key design choices for efficiently learning\nlong-horizon prediction dynamics for quadrotors. Specifically, we analyze the\nimpact of multiple architectures, historical data, and multi-step loss\nformulation. We show that sequential modeling techniques showcase their\nadvantage in minimizing compounding errors compared to other types of\nsolutions. Furthermore, we propose a novel decoupled dynamics learning\napproach, which further simplifies the learning process while also enhancing\nthe approach modularity. Extensive experiments and ablation studies on\nreal-world quadrotor data demonstrate the versatility and precision of the\nproposed approach. Our outcomes offer several insights and methodologies for\nenhancing long-term predictive accuracy of learned quadrotor dynamics for\nplanning and control.", "paper_summary_zh": "系統動態的準確建模對於實現機器人系統的高效能規劃和控制至關重要。儘管現有的資料驅動方法代表了建模動態的一種有前途的方法，但其準確性僅限於短預測範圍，忽視了在較長預測範圍內累積預測誤差的影響。減輕這些累積誤差的策略仍未得到充分探索。為了彌合這一差距，在本文中，我們研究了有效學習四旋翼飛行器長期預測動態的關鍵設計選擇。具體而言，我們分析了多種架構、歷史資料和多步損失公式的影響。我們表明，與其他類型的解決方案相比，序列建模技術展示了其在最小化累積誤差方面的優勢。此外，我們提出了一種新穎的解耦動態學習方法，它進一步簡化了學習過程，同時也增強了方法的模組化。對真實世界四旋翼飛行器資料進行的廣泛實驗和消融研究證明了所提出方法的多功能性和精確性。我們的成果為增強學習的四旋翼飛行器動態的長期預測準確性以進行規劃和控制提供了多種見解和方法。", "author": "Pratyaksh Prabhav Rao et.al.", "authors": "Pratyaksh Prabhav Rao, Alessandro Saviolo, Tommaso Castiglione Ferrari, Giuseppe Loianno", "id": "2407.12964v1", "paper_url": "http://arxiv.org/abs/2407.12964v1", "repo": "null"}}