{"2408.01018": {"publish_time": "2024-08-02", "title": "GNN-MolKAN: Harnessing the Power of KAN to Advance Molecular Representation Learning with GNNs", "paper_summary": "Effective molecular representation learning is crucial for molecular property\nprediction and drug design. However, existing approaches struggle with\nlimitations in insufficient annotations and suboptimal architecture design. For\ninstance, Graph Neural Networks (GNNs) suffer from over-squashing, causing the\nloss of important structural details in molecules, thus impairing molecular\nrepresentations. In this work, we propose a new class of GNNs, GNN-MolKAN and\nits augmented variant, GNN-MolKAN+, that integrate the Kolmogorov-Arnold\nNetworks (KAN) architecture from AI + Science into GNNs to address these\nchallenges. Additionally, we introduce Adaptive FastKAN (AdFastKAN), an\nadvanced KAN that offers increased stability and speed, further enhancing the\nperformance of standard GNNs. Notably, our approach holds three key benefits:\n1) Superior Performance: GNN-MolKAN and GNN-MolKAN+ demonstrate superior\nprediction ability, robust generalization to unseen scaffolds, and versatile\ntransferability across different GNN architectures. 2) Efficiency: These models\nrequire less computational time and fewer parameters while matching or\nsurpassing the state-of-the-art (SOTA) self-supervised methods. 3) Few-shot\nLearning Ability: GNN-MolKAN demonstrates great potential in few-shot learning\nscenarios, achieving an average improvement of 6.97% across few-shot\nbenchmarks. Overall, we validate our architecture on 6 classification datasets,\n6 regression datasets, and 4 few-shot learning datasets, consistently achieving\nhighly competitive results across all of them.", "paper_summary_zh": "有效的分子表示學習對於分子屬性預測和藥物設計至關重要。然而，現有方法在註解不足和次優架構設計方面存在局限性。例如，圖神經網路 (GNN) 會產生過度壓縮，導致分子中重要的結構細節遺失，進而損害分子表示。在這項工作中，我們提出一個新的 GNN 類別，GNN-MolKAN 及其擴增變體 GNN-MolKAN+，將來自 AI + Science 的 Kolmogorov-Arnold 網路 (KAN) 架構整合到 GNN 中，以解決這些挑戰。此外，我們引入了自適應快速 KAN (AdFastKAN)，這是一種先進的 KAN，提供了更高的穩定性和速度，進一步增強了標準 GNN 的效能。值得注意的是，我們的做法有三大好處：1) 優異的效能：GNN-MolKAN 和 GNN-MolKAN+ 展現出優異的預測能力、對未見支架的強健泛化能力，以及在不同 GNN 架構之間的多功能可傳遞性。2) 效率：這些模型所需的運算時間較短，且參數較少，同時匹配或超越了最先進 (SOTA) 的自監督方法。3) 少樣本學習能力：GNN-MolKAN 在少樣本學習情境中展現出極大的潛力，在少樣本基準中平均提升了 6.97%。總體而言，我們在 6 個分類資料集、6 個回歸資料集和 4 個少樣本學習資料集上驗證了我們的架構，在所有這些資料集上持續取得極具競爭力的結果。", "author": "Ruifeng Li et.al.", "authors": "Ruifeng Li", "id": "2408.01018v1", "paper_url": "http://arxiv.org/abs/2408.01018v1", "repo": "null"}}