{"2412.18827": {"publish_time": "2024-12-25", "title": "PhyloGen: Language Model-Enhanced Phylogenetic Inference via Graph Structure Generation", "paper_summary": "Phylogenetic trees elucidate evolutionary relationships among species, but\nphylogenetic inference remains challenging due to the complexity of combining\ncontinuous (branch lengths) and discrete parameters (tree topology).\nTraditional Markov Chain Monte Carlo methods face slow convergence and\ncomputational burdens. Existing Variational Inference methods, which require\npre-generated topologies and typically treat tree structures and branch lengths\nindependently, may overlook critical sequence features, limiting their accuracy\nand flexibility. We propose PhyloGen, a novel method leveraging a pre-trained\ngenomic language model to generate and optimize phylogenetic trees without\ndependence on evolutionary models or aligned sequence constraints. PhyloGen\nviews phylogenetic inference as a conditionally constrained tree structure\ngeneration problem, jointly optimizing tree topology and branch lengths through\nthree core modules: (i) Feature Extraction, (ii) PhyloTree Construction, and\n(iii) PhyloTree Structure Modeling. Meanwhile, we introduce a Scoring Function\nto guide the model towards a more stable gradient descent. We demonstrate the\neffectiveness and robustness of PhyloGen on eight real-world benchmark\ndatasets. Visualization results confirm PhyloGen provides deeper insights into\nphylogenetic relationships.", "paper_summary_zh": "系統發生樹闡明了物種之間的演化關係，但由於連續參數（分支長度）和離散參數（樹形結構）結合的複雜性，系統發生推論仍然具有挑戰性。傳統的馬可夫鏈蒙特卡羅方法面臨收斂速度慢和計算負擔重。現有的變分推論方法需要預先產生的拓撲結構，並且通常獨立處理樹形結構和分支長度，可能會忽略關鍵的序列特徵，從而限制其準確性和靈活性。我們提出了 PhyloGen，這是一種新穎的方法，利用預訓練的基因組語言模型來生成和優化系統發生樹，而不需要依賴演化模型或比對序列約束。PhyloGen 將系統發生推論視為一個條件約束的樹形結構生成問題，通過三個核心模組共同優化樹形結構和分支長度：(i) 特徵提取、(ii) PhyloTree 構建，以及 (iii) PhyloTree 結構建模。同時，我們引入了評分函數來引導模型朝著更穩定的梯度下降方向發展。我們在八個真實世界的基準數據集上展示了 PhyloGen 的有效性和魯棒性。可視化結果證實，PhyloGen 能夠更深入地了解系統發生關係。", "author": "ChenRui Duan et.al.", "authors": "ChenRui Duan, Zelin Zang, Siyuan Li, Yongjie Xu, Stan Z. Li", "id": "2412.18827v1", "paper_url": "http://arxiv.org/abs/2412.18827v1", "repo": "null"}}