{"2410.23494": {"publish_time": "2024-10-30", "title": "Causality-Driven Audits of Model Robustness", "paper_summary": "Robustness audits of deep neural networks (DNN) provide a means to uncover\nmodel sensitivities to the challenging real-world imaging conditions that\nsignificantly degrade DNN performance in-the-wild. Such conditions are often\nthe result of the compounding of multiple factors inherent to the environment,\nsensor, or processing pipeline and may lead to complex image distortions that\nare not easily categorized. When robustness audits are limited to a set of\npre-determined imaging effects or distortions, the results cannot be (easily)\ntransferred to real-world conditions where image corruptions may be more\ncomplex or nuanced. To address this challenge, we present a new alternative\nrobustness auditing method that uses causal inference to measure DNN\nsensitivities to the factors of the imaging process that cause complex\ndistortions. Our approach uses causal models to explicitly encode assumptions\nabout the domain-relevant factors and their interactions. Then, through\nextensive experiments on natural and rendered images across multiple vision\ntasks, we show that our approach reliably estimates causal effects of each\nfactor on DNN performance using observational domain data. These causal effects\ndirectly tie DNN sensitivities to observable properties of the imaging pipeline\nin the domain of interest towards reducing the risk of unexpected DNN failures\nwhen deployed in that domain.", "paper_summary_zh": "深度神经网络 (DNN) 的稳健性审核提供了一种方法来揭示模型对具有挑战性的现实世界成像条件的敏感性，这些条件会显著降低 DNN 在实际环境中的性能。此类条件通常是环境、传感器或处理管道中固有的多个因素共同作用的结果，并且可能导致难以分类的复杂图像失真。当稳健性审核仅限于一组预先确定的成像效果或失真时，结果无法（轻松）转移到图像损坏可能更复杂或细微差别更大的实际条件。为了应对这一挑战，我们提出了一种新的替代稳健性审核方法，该方法使用因果推理来衡量 DNN 对导致复杂失真的成像过程因素的敏感性。我们的方法使用因果模型来明确编码有关领域相关因素及其相互作用的假设。然后，通过对跨多个视觉任务的自然和渲染图像进行广泛的实验，我们表明我们的方法使用观测域数据可靠地估计了每个因素对 DNN 性能的因果效应。这些因果效应将 DNN 敏感性直接与感兴趣域中成像管道的可观察属性联系起来，以降低在该域中部署时意外 DNN 故障的风险。", "author": "Nathan Drenkow et.al.", "authors": "Nathan Drenkow, Chris Ribaudo, Mathias Unberath", "id": "2410.23494v1", "paper_url": "http://arxiv.org/abs/2410.23494v1", "repo": "null"}}