{"2501.09426": {"publish_time": "2025-01-16", "title": "AutoCBT: An Autonomous Multi-agent Framework for Cognitive Behavioral Therapy in Psychological Counseling", "paper_summary": "Traditional in-person psychological counseling remains primarily niche, often\nchosen by individuals with psychological issues, while online automated\ncounseling offers a potential solution for those hesitant to seek help due to\nfeelings of shame. Cognitive Behavioral Therapy (CBT) is an essential and\nwidely used approach in psychological counseling. The advent of large language\nmodels (LLMs) and agent technology enables automatic CBT diagnosis and\ntreatment. However, current LLM-based CBT systems use agents with a fixed\nstructure, limiting their self-optimization capabilities, or providing hollow,\nunhelpful suggestions due to redundant response patterns. In this work, we\nutilize Quora-like and YiXinLi single-round consultation models to build a\ngeneral agent framework that generates high-quality responses for single-turn\npsychological consultation scenarios. We use a bilingual dataset to evaluate\nthe quality of single-response consultations generated by each framework. Then,\nwe incorporate dynamic routing and supervisory mechanisms inspired by real\npsychological counseling to construct a CBT-oriented autonomous multi-agent\nframework, demonstrating its general applicability. Experimental results\nindicate that AutoCBT can provide higher-quality automated psychological\ncounseling services.", "paper_summary_zh": "傳統面對面的心理諮商仍主要屬於利基市場，通常由有心理問題的個人選擇，而線上自動化諮商為那些因羞恥感而猶豫尋求幫助的人提供了一個潛在的解決方案。認知行為療法 (CBT) 是一種心理諮商中不可或缺且廣泛使用的方法。大型語言模型 (LLM) 和代理技術的出現，實現了自動 CBT 診斷和治療。然而，目前的基於 LLM 的 CBT 系統使用具有固定結構的代理，限制了它們的自我優化能力，或由於重複的回應模式而提供空洞、無益的建議。在這項工作中，我們利用 Quora 類似和易信理單輪諮詢模型，構建了一個通用代理框架，為單輪心理諮詢場景生成高品質的回應。我們使用雙語數據集來評估每個框架生成的單一回應諮詢的品質。然後，我們結合了受真實心理諮商啟發的動態路由和監督機制，構建了一個面向 CBT 的自主多代理框架，展示了其通用適用性。實驗結果表明，AutoCBT 可以提供更高品質的自動化心理諮商服務。", "author": "Ancheng Xu et.al.", "authors": "Ancheng Xu, Di Yang, Renhao Li, Jingwei Zhu, Minghuan Tan, Min Yang, Wanxin Qiu, Mingchen Ma, Haihong Wu, Bingyu Li, Feng Sha, Chengming Li, Xiping Hu, Qiang Qu, Derek F. Wong, Ruifeng Xu", "id": "2501.09426v1", "paper_url": "http://arxiv.org/abs/2501.09426v1", "repo": "null"}}