{"2410.17566": {"publish_time": "2024-10-23", "title": "Differentially Private Learning Needs Better Model Initialization and Self-Distillation", "paper_summary": "Differentially private SGD (DPSGD) enables privacy-preserving training of\nlanguage models, but often reduces utility, diversity, and linguistic quality.\nWe introduce DPRefine, a three-phase method that initializes a model using data\nsynthesis from a small pre-trained LM with rigorous filtering, applies DP\nfinetuning on private data, and performs self-distillation to refine outputs.\nThis approach significantly outperforms vanilla DPSGD, with AlpacaEval\npreferring DPRefine's generations in 78.4% of cases across all datasets. Our\nanalysis reveals that DPRefine reduces linguistic errors in generated text by\n84.0%, mitigating grammar and spelling errors, commonly associated with DPSGD.\nIt also reduces inconsistencies of non-private models, such as hallucinated\ndetails and misattributed quotes. We find that small models like GPT-2 can be\neffective for initialization and distillation, highlighting their potential in\nenabling scalable and efficient deployment of privacy-preserving language.", "paper_summary_zh": "差分私有 SGD（DPSGD）可實現語言模型的隱私保護訓練，但通常會降低效用、多樣性和語言品質。\n我們引入了 DPRefine，這是一種三階段方法，它使用經過嚴格過濾的小型預訓練 LM 的資料合成來初始化模型，對私有資料應用 DP 微調，並執行自我蒸餾以改善輸出。\n這種方法明顯優於香草 DPSGD，在所有資料集中的 78.4% 的案例中，AlpacaEval 偏好 DPRefine 的生成。我們的分析表明，DPRefine 將生成文字中的語言錯誤減少了 84.0%，減輕了語法和拼寫錯誤，這些錯誤通常與 DPSGD 相關。\n它還減少了非私有模型的不一致性，例如幻覺細節和錯誤歸因的引號。我們發現像 GPT-2 這樣的小模型可以有效用於初始化和蒸餾，突出了它們在實現隱私保護語言的可擴充且有效部署方面的潛力。", "author": "Ivoline C. Ngong et.al.", "authors": "Ivoline C. Ngong, Joseph P. Near, Niloofar Mireshghallah", "id": "2410.17566v1", "paper_url": "http://arxiv.org/abs/2410.17566v1", "repo": "null"}}