{"2407.15708": {"publish_time": "2024-07-22", "title": "SwinSF: Image Reconstruction from Spatial-Temporal Spike Streams", "paper_summary": "The spike camera, with its high temporal resolution, low latency, and high\ndynamic range, addresses high-speed imaging challenges like motion blur. It\ncaptures photons at each pixel independently, creating binary spike streams\nrich in temporal information but challenging for image reconstruction. Current\nalgorithms, both traditional and deep learning-based, still need to be improved\nin the utilization of the rich temporal detail and the restoration of the\ndetails of the reconstructed image. To overcome this, we introduce Swin\nSpikeformer (SwinSF), a novel model for dynamic scene reconstruction from spike\nstreams. SwinSF is composed of Spike Feature Extraction, Spatial-Temporal\nFeature Extraction, and Final Reconstruction Module. It combines shifted window\nself-attention and proposed temporal spike attention, ensuring a comprehensive\nfeature extraction that encapsulates both spatial and temporal dynamics,\nleading to a more robust and accurate reconstruction of spike streams.\nFurthermore, we build a new synthesized dataset for spike image reconstruction\nwhich matches the resolution of the latest spike camera, ensuring its relevance\nand applicability to the latest developments in spike camera imaging.\nExperimental results demonstrate that the proposed network SwinSF sets a new\nbenchmark, achieving state-of-the-art performance across a series of datasets,\nincluding both real-world and synthesized data across various resolutions. Our\ncodes and proposed dataset will be available soon.", "paper_summary_zh": "尖峰相機以其高時間解析度、低延遲和高動態範圍，解決了運動模糊等高速影像挑戰。它獨立捕捉每個畫素的光子，產生富含時間資訊的二進位尖峰串流，但對於影像重建而言卻是項挑戰。目前的演算法，無論是傳統的還是基於深度學習的，在利用豐富的時間細節和重建影像的細節方面仍需要改進。為了克服這個問題，我們引入了 Swin Spikeformer (SwinSF)，這是一個從尖峰串流重建動態場景的新穎模型。SwinSF 由尖峰特徵提取、時空特徵提取和最終重建模組組成。它結合了位移視窗自注意力和提出的時序尖峰注意力，確保全面的特徵提取，涵蓋空間和時間動態，從而對尖峰串流進行更強健且準確的重建。此外，我們建立了一個新的合成資料集，用於尖峰影像重建，其解析度與最新的尖峰相機相符，確保其與尖峰相機影像的最新發展相關且適用。實驗結果表明，所提出的 SwinSF 網路樹立了一個新的基準，在各種資料集（包括各種解析度的真實世界和合成資料）中實現了最先進的效能。我們的程式碼和提出的資料集將很快提供。", "author": "Liangyan Jiang et.al.", "authors": "Liangyan Jiang, Chuang Zhu, Yanxu Chen", "id": "2407.15708v1", "paper_url": "http://arxiv.org/abs/2407.15708v1", "repo": "null"}}