{"2503.03724": {"publish_time": "2025-03-05", "title": "Deep Causal Behavioral Policy Learning: Applications to Healthcare", "paper_summary": "We present a deep learning-based approach to studying dynamic clinical\nbehavioral regimes in diverse non-randomized healthcare settings. Our proposed\nmethodology - deep causal behavioral policy learning (DC-BPL) - uses deep\nlearning algorithms to learn the distribution of high-dimensional clinical\naction paths, and identifies the causal link between these action paths and\npatient outcomes. Specifically, our approach: (1) identifies the causal effects\nof provider assignment on clinical outcomes; (2) learns the distribution of\nclinical actions a given provider would take given evolving patient\ninformation; (3) and combines these steps to identify the optimal provider for\na given patient type and emulate that provider's care decisions. Underlying\nthis strategy, we train a large clinical behavioral model (LCBM) on electronic\nhealth records data using a transformer architecture, and demonstrate its\nability to estimate clinical behavioral policies. We propose a novel\ninterpretation of a behavioral policy learned using the LCBM: that it is an\nefficient encoding of complex, often implicit, knowledge used to treat a\npatient. This allows us to learn a space of policies that are critical to a\nwide range of healthcare applications, in which the vast majority of clinical\nknowledge is acquired tacitly through years of practice and only a tiny\nfraction of information relevant to patient care is written down (e.g. in\ntextbooks, studies or standardized guidelines).", "paper_summary_zh": "我們提出了一種基於深度學習的方法，用於研究不同非隨機醫療環境中的動態臨床行為模式。我們提出的方法——深度因果行為策略學習 (DC-BPL)——使用深度學習算法來學習高維臨床行動路徑的分佈，並識別這些行動路徑與患者結果之間的因果關係。具體來說，我們的方法：(1) 確定醫療提供者分配對臨床結果的因果影響；(2) 了解特定醫療提供者在不斷變化的患者信息下會採取的臨床行動分佈；(3) 結合這些步驟，為給定的患者類型確定最佳醫療提供者，並模擬該提供者的護理決策。在此策略的基礎上，我們使用 Transformer 架構，根據電子健康記錄數據訓練一個大型臨床行為模型 (LCBM)，並展示其估計臨床行為策略的能力。我們對使用 LCBM 學習到的行為策略提出了一種新的解釋：它是對用於治療患者的複雜（通常是隱性）知識的有效編碼。這使我們能夠學習一系列對廣泛醫療應用至關重要的策略，在這些應用中，絕大多數臨床知識是通過多年的實踐默會獲得的，只有極少數與患者護理相關的信息被記錄下來（例如，在教科書、研究或標準化指南中）。\n", "author": "Jonas Knecht et.al.", "authors": "Jonas Knecht, Anna Zink, Jonathan Kolstad, Maya Petersen", "id": "2503.03724v1", "paper_url": "http://arxiv.org/abs/2503.03724v1", "repo": "null"}}