{"2409.11253": {"publish_time": "2024-09-17", "title": "Norm of Mean Contextualized Embeddings Determines their Variance", "paper_summary": "Contextualized embeddings vary by context, even for the same token, and form\na distribution in the embedding space. To analyze this distribution, we focus\non the norm of the mean embedding and the variance of the embeddings. In this\nstudy, we first demonstrate that these values follow the well-known formula for\nvariance in statistics and provide an efficient sequential computation method.\nThen, by observing embeddings from intermediate layers of several Transformer\nmodels, we found a strong trade-off relationship between the norm and the\nvariance: as the mean embedding becomes closer to the origin, the variance\nincreases. This trade-off is likely influenced by the layer normalization\nmechanism used in Transformer models. Furthermore, when the sets of token\nembeddings are treated as clusters, we show that the variance of the entire\nembedding set can theoretically be decomposed into the within-cluster variance\nand the between-cluster variance. We found experimentally that as the layers of\nTransformer models deepen, the embeddings move farther from the origin, the\nbetween-cluster variance relatively decreases, and the within-cluster variance\nrelatively increases. These results are consistent with existing studies on the\nanisotropy of the embedding spaces across layers.", "paper_summary_zh": "上下文嵌入會因上下文而異，即使是同一個標記，也會在嵌入空間中形成一個分佈。為了分析此分佈，我們專注於平均嵌入的範數和嵌入的變異數。在此研究中，我們首先證明這些值遵循統計學中眾所周知的變異數公式，並提供一種有效的順序計算方法。然後，通過觀察幾個 Transformer 模型的中間層嵌入，我們發現範數和變異數之間存在強烈的折衷關係：隨著平均嵌入越來越接近原點，變異數就會增加。此折衷可能受 Transformer 模型中使用的層正規化機制影響。此外，當將標記嵌入集合視為叢集時，我們證明整個嵌入集合的變異數在理論上可以分解為叢集內變異數和叢集間變異數。我們透過實驗發現，隨著 Transformer 模型的層數加深，嵌入會遠離原點，叢集間變異數相對減少，而叢集內變異數相對增加。這些結果與現有關於跨層嵌入空間各向異性的研究一致。", "author": "Hiroaki Yamagiwa et.al.", "authors": "Hiroaki Yamagiwa, Hidetoshi Shimodaira", "id": "2409.11253v1", "paper_url": "http://arxiv.org/abs/2409.11253v1", "repo": "null"}}