{"2410.15897": {"publish_time": "2024-10-21", "title": "IGMaxHS -- An Incremental MaxSAT Solver with Support for XOR Clauses", "paper_summary": "Recently, a novel, MaxSAT-based method for error correction in quantum\ncomputing has been proposed that requires both incremental MaxSAT solving\ncapabilities and support for XOR constraints, but no dedicated MaxSAT solver\nfulfilling these criteria existed yet. We alleviate that and introduce IGMaxHS,\nwhich is based on the existing solvers iMaxHS and GaussMaxHS, but poses fewer\nrestrictions on the XOR constraints than GaussMaxHS. IGMaxHS is fuzz tested\nwith xwcnfuzz, an extension of wcnfuzz that can directly output XOR\nconstraints. As a result, IGMaxHS is the only solver that reported neither\nincorrect unsatisfiability verdicts nor invalid models nor incoherent cost\nmodel combinations in a final fuzz testing comparison of all three solvers with\n10000 instances. We detail the steps required for implementing Gaussian\nelimination on XOR constraints in CDCL SAT solvers, and extend the recently\nproposed re-entrant incremental MaxSAT solver application program interface to\nallow for incremental addition of XOR constraints. Finally, we show that\nIGMaxHS is capable of decoding quantum color codes through simulation with the\nMunich Quantum Toolkit.", "paper_summary_zh": "最近，提出了一种基于 MaxSAT 的量子计算纠错新方法，该方法需要增量式 MaxSAT 求解能力和对 XOR 约束的支持，但还没有专门的 MaxSAT 求解器满足这些标准。我们缓解了这个问题，并引入了 IGMaxHS，它基于现有的求解器 iMaxHS 和 GaussMaxHS，但对 XOR 约束的限制比 GaussMaxHS 少。IGMaxHS 使用 xwcnfuzz 进行模糊测试，xwcnfuzz 是 wcnfuzz 的扩展，可以直接输出 XOR 约束。因此，IGMaxHS 是唯一一个在所有三个求解器的最终模糊测试比较中既没有报告不正确的不可满足性结果，也没有报告无效模型或不连贯的成本模型组合的求解器，测试实例为 10000 个。我们详细介绍了在 CDCL SAT 求解器中对 XOR 约束实现高斯消元所需的步骤，并扩展了最近提出的可重入增量 MaxSAT 求解器应用程序编程接口，以允许增量添加 XOR 约束。最后，我们展示了 IGMaxHS 能够通过使用慕尼黑量子工具包进行模拟来解码量子颜色码。", "author": "Ole Lübke et.al.", "authors": "Ole Lübke", "id": "2410.15897v1", "paper_url": "http://arxiv.org/abs/2410.15897v1", "repo": "null"}}