{"2409.15861": {"publish_time": "2024-09-24", "title": "A Zero-Shot Open-Vocabulary Pipeline for Dialogue Understanding", "paper_summary": "Dialogue State Tracking (DST) is crucial for understanding user needs and\nexecuting appropriate system actions in task-oriented dialogues. Majority of\nexisting DST methods are designed to work within predefined ontologies and\nassume the availability of gold domain labels, struggling with adapting to new\nslots values. While Large Language Models (LLMs)-based systems show promising\nzero-shot DST performance, they either require extensive computational\nresources or they underperform existing fully-trained systems, limiting their\npracticality. To address these limitations, we propose a zero-shot,\nopen-vocabulary system that integrates domain classification and DST in a\nsingle pipeline. Our approach includes reformulating DST as a\nquestion-answering task for less capable models and employing self-refining\nprompts for more adaptable ones. Our system does not rely on fixed slot values\ndefined in the ontology allowing the system to adapt dynamically. We compare\nour approach with existing SOTA, and show that it provides up to 20% better\nJoint Goal Accuracy (JGA) over previous methods on datasets like Multi-WOZ 2.1,\nwith up to 90% fewer requests to the LLM API.", "paper_summary_zh": "對話狀態追蹤 (DST) 對於理解使用者需求和在任務導向對話中執行適當的系統動作至關重要。大多數現有的 DST 方法都是設計在預定義的本体中運作，並假設有黃金領域標籤可用，難以適應新的槽值。雖然基於大型語言模型 (LLM) 的系統顯示出有希望的零次學習 DST 效能，但它們需要大量的計算資源或效能低於現有的完全訓練系統，限制了它們的實用性。為了解決這些限制，我們提出了一個零次學習、開放詞彙系統，它將領域分類和 DST 整合在一個單一的管線中。我們的做法包括將 DST 重新表述為一個問題回答任務，以適用於能力較弱的模型，並採用自我精進提示，以適用於適應性較強的模型。我們的系統不依賴本体中定義的固定槽值，允許系統動態適應。我們將我們的做法與現有的 SOTA 進行比較，並顯示它在 Multi-WOZ 2.1 等資料集上提供比先前方法高達 20% 的聯合目標準確度 (JGA)，對 LLM API 的請求減少了 90%。", "author": "Abdulfattah Safa et.al.", "authors": "Abdulfattah Safa, Gözde Gül Şahin", "id": "2409.15861v1", "paper_url": "http://arxiv.org/abs/2409.15861v1", "repo": "https://github.com/gglab-ku/open-vocab-dialogue-understanding"}}