{"2408.15512": {"publish_time": "2024-08-28", "title": "Towards Fully Autonomous Research Powered by LLMs: Case Study on Simulations", "paper_summary": "The advent of Large Language Models (LLMs) has created new opportunities for\nthe automation of scientific research, spanning both experimental processes and\ncomputational simulations. This study explores the feasibility of constructing\nan autonomous simulation agent (ASA) powered by LLM, through sophisticated API\nintegration, to automate the entire research process, from experimental design,\nremote upload and simulation execution, data analysis, to report compilation.\nUsing a simulation problem of polymer chain conformations as a case study, we\nassessed the performance of ASAs powered by different LLMs including\nGPT-4-Turbo. Our findings revealed that ASA-GPT-4o achieved near-flawless\nexecution on designated research missions, underscoring the potential of LLMs\nto manage complete scientific investigations autonomously. The outlined\nautomation can be iteratively performed up to twenty cycles without human\nintervention, illustrating the potential of LLMs for large-scale autonomous\nresearch endeavors. Additionally, we discussed the intrinsic traits of ASAs in\nmanaging extensive tasks, focusing on self-validation mechanisms and the\nbalance between local attention and global oversight.", "paper_summary_zh": "大型語言模型 (LLM) 的出現為科學研究的自動化創造了新機會，涵蓋實驗過程和計算模擬。本研究探討了構建由 LLM 驅動的自主模擬代理 (ASA) 的可行性，通過複雜的 API 整合，自動化整個研究過程，從實驗設計、遠程上傳和模擬執行、數據分析到報告編譯。使用聚合物鏈構象的模擬問題作為案例研究，我們評估了由 GPT-4-Turbo 等不同 LLM 驅動的 ASA 的性能。我們的研究結果表明，ASA-GPT-4o 在指定的研究任務中實現了近乎完美的執行，強調了 LLM 自主管理完整科學調查的潛力。概述的自動化可以在沒有人工干預的情況下反覆執行多達 20 個週期，說明了 LLM 在大規模自主研究工作中的潛力。此外，我們討論了 ASA 在管理廣泛任務中的內在特徵，重點關注自我驗證機制以及局部關注與全局監督之間的平衡。", "author": "Zhihan Liu et.al.", "authors": "Zhihan Liu, Yubo Chai, Jianfeng Li", "id": "2408.15512v1", "paper_url": "http://arxiv.org/abs/2408.15512v1", "repo": "https://github.com/zokaraa/autonomous_simulation_agent"}}