{"2409.06280": {"publish_time": "2024-09-10", "title": "Catch Me if You Can: Detecting Unauthorized Data Use in Deep Learning Models", "paper_summary": "The rise of deep learning (DL) has led to a surging demand for training data,\nwhich incentivizes the creators of DL models to trawl through the Internet for\ntraining materials. Meanwhile, users often have limited control over whether\ntheir data (e.g., facial images) are used to train DL models without their\nconsent, which has engendered pressing concerns.\n  This work proposes MembershipTracker, a practical data provenance tool that\ncan empower ordinary users to take agency in detecting the unauthorized use of\ntheir data in training DL models. We view tracing data provenance through the\nlens of membership inference (MI). MembershipTracker consists of a lightweight\ndata marking component to mark the target data with small and targeted changes,\nwhich can be strongly memorized by the model trained on them; and a specialized\nMI-based verification process to audit whether the model exhibits strong\nmemorization on the target samples.\n  Overall, MembershipTracker only requires the users to mark a small fraction\nof data (0.005% to 0.1% in proportion to the training set), and it enables the\nusers to reliably detect the unauthorized use of their data (average 0%\nFPR@100% TPR). We show that MembershipTracker is highly effective across\nvarious settings, including industry-scale training on the full-size\nImageNet-1k dataset. We finally evaluate MembershipTracker under multiple\nclasses of countermeasures.", "paper_summary_zh": "深度學習 (DL) 的興起導致對訓練資料的需求激增，這激勵了 DL 模型的創建者在網路上搜尋訓練資料。同時，使用者通常無法控制他們的資料（例如：人臉影像）是否在未經他們同意的情況下被用來訓練 DL 模型，這引起了迫切的關注。\n這項工作提出了 MembershipTracker，一個實用的資料來源工具，可以讓一般使用者在偵測他們的資料在訓練 DL 模型時被未經授權使用時，採取行動。我們透過成員推論 (MI) 的角度來追蹤資料來源。MembershipTracker 包含一個輕量級資料標記元件，用小而有針對性的變更來標記目標資料，這些變更可以被訓練在這些資料上的模型牢記；以及一個專門的基於 MI 的驗證程序，用來稽核模型是否對目標樣本展現強烈的記憶。\n總體而言，MembershipTracker 只需要使用者標記一小部分資料（相對於訓練集，比例為 0.005% 到 0.1%），它讓使用者能夠可靠地偵測到他們的資料被未經授權使用（平均 0% FPR@100% TPR）。我們展示了 MembershipTracker 在各種設定中都非常有效，包括在全尺寸 ImageNet-1k 資料集上進行產業規模的訓練。最後，我們在多種對策類別下評估了 MembershipTracker。", "author": "Zitao Chen et.al.", "authors": "Zitao Chen, Karthik Pattabiraman", "id": "2409.06280v1", "paper_url": "http://arxiv.org/abs/2409.06280v1", "repo": "null"}}