{"2412.18299": {"publish_time": "2024-12-24", "title": "M-Ped: Multi-Prompt Ensemble Decoding for Large Language Models", "paper_summary": "With the widespread application of Large Language Models (LLMs) in the field\nof Natural Language Processing (NLP), enhancing their performance has become a\nresearch hotspot. This paper presents a novel multi-prompt ensemble decoding\napproach designed to bolster the generation quality of LLMs by leveraging the\naggregation of outcomes from multiple prompts. Given a unique input $X$, we\nsubmit $n$ variations of prompts with $X$ to LLMs in batch mode to decode and\nderive probability distributions. For each token prediction, we calculate the\nensemble probability by averaging the $n$ probability distributions within the\nbatch, utilizing this aggregated probability to generate the token. This\ntechnique is dubbed Inner-Batch Ensemble. To facilitate efficient batch\ninference, we implement a Left-Padding strategy to maintain uniform input\nlengths across the n prompts. Through extensive experimentation on diverse NLP\ntasks, including machine translation, code generation, and text simplification,\nwe demonstrate the efficacy of our method in enhancing LLM performance. The\nresults show substantial improvements in BLEU scores, pass@$k$ rates, and LENS\nmetrics over conventional methods.", "paper_summary_zh": "隨著大型語言模型 (LLM) 在自然語言處理 (NLP) 領域的廣泛應用，提升其效能已成為研究熱點。本文提出了一種新穎的多提示集合解碼方法，旨在透過利用多個提示結果的聚合來提升 LLM 的生成品質。給定一個獨特的輸入 $X$，我們會以批次模式將 $X$ 的 $n$ 個提示變形提交給 LLM 以進行解碼並推導機率分布。對於每個標記預測，我們會計算批次中 $n$ 個機率分布的平均值來計算集合機率，並利用這個聚合機率來生成標記。此技術稱為批次內集合。為了促進有效批次推論，我們實作了一個左邊補齊策略，以維護 $n$ 個提示間的輸入長度一致。透過對各種 NLP 任務（包括機器翻譯、程式碼生成和文字簡化）進行廣泛的實驗，我們證明了我們的方法在提升 LLM 效能方面的效力。結果顯示，與傳統方法相比，BLEU 分數、pass@$k$ 率和 LENS 指標均有顯著提升。", "author": "Jiaxin Guo et.al.", "authors": "Jiaxin Guo, Daimeng Wei, Yuanchang Luo, Shimin Tao, Hengchao Shang, Zongyao Li, Shaojun Li, Jinlong Yang, Zhanglin Wu, Zhiqiang Rao, Hao Yang", "id": "2412.18299v1", "paper_url": "http://arxiv.org/abs/2412.18299v1", "repo": "null"}}