{"2502.13606": {"publish_time": "2025-02-19", "title": "LaVCa: LLM-assisted Visual Cortex Captioning", "paper_summary": "Understanding the property of neural populations (or voxels) in the human\nbrain can advance our comprehension of human perceptual and cognitive\nprocessing capabilities and contribute to developing brain-inspired computer\nmodels. Recent encoding models using deep neural networks (DNNs) have\nsuccessfully predicted voxel-wise activity. However, interpreting the\nproperties that explain voxel responses remains challenging because of the\nblack-box nature of DNNs. As a solution, we propose LLM-assisted Visual Cortex\nCaptioning (LaVCa), a data-driven approach that uses large language models\n(LLMs) to generate natural-language captions for images to which voxels are\nselective. By applying LaVCa for image-evoked brain activity, we demonstrate\nthat LaVCa generates captions that describe voxel selectivity more accurately\nthan the previously proposed method. Furthermore, the captions generated by\nLaVCa quantitatively capture more detailed properties than the existing method\nat both the inter-voxel and intra-voxel levels. Furthermore, a more detailed\nanalysis of the voxel-specific properties generated by LaVCa reveals\nfine-grained functional differentiation within regions of interest (ROIs) in\nthe visual cortex and voxels that simultaneously represent multiple distinct\nconcepts. These findings offer profound insights into human visual\nrepresentations by assigning detailed captions throughout the visual cortex\nwhile highlighting the potential of LLM-based methods in understanding brain\nrepresentations. Please check out our webpage at\nhttps://sites.google.com/view/lavca-llm/", "paper_summary_zh": "理解人類大腦中神經元群（或體素）的特性，有助於我們進一步了解人類知覺和認知處理能力，並有助於開發受大腦啟發的電腦模型。最近使用深度神經網路（DNN）的編碼模型已成功預測體素活動。然而，由於 DNN 的黑箱性質，解釋說明體素反應的特性仍然具有挑戰性。作為解決方案，我們提出 LLM 輔助視覺皮層字幕（LaVCa），這是一種資料驅動的方法，使用大型語言模型（LLM）為體素選擇的影像產生自然語言字幕。透過將 LaVCa 應用於影像引發的大腦活動，我們證明 LaVCa 產生的字幕比先前提出的方法更準確地描述體素選擇性。此外，LaVCa 產生的字幕在體素間和體素內層級上，比現有方法量化捕捉到更多詳細的特性。此外，對 LaVCa 產生的體素特定特性的更詳細分析揭示了視覺皮層中感興趣區域（ROI）內的細緻功能區分，以及同時表示多個不同概念的體素。這些發現透過在整個視覺皮層中指定詳細的字幕，提供了人類視覺表徵的深刻見解，同時強調了基於 LLM 的方法在理解大腦表徵方面的潛力。請查看我們的網頁：\nhttps://sites.google.com/view/lavca-llm/", "author": "Takuya Matsuyama et.al.", "authors": "Takuya Matsuyama, Shinji Nishimoto, Yu Takagi", "id": "2502.13606v1", "paper_url": "http://arxiv.org/abs/2502.13606v1", "repo": "null"}}