{"2501.16361": {"publish_time": "2025-01-21", "title": "Large Language Models Meet Graph Neural Networks for Text-Numeric Graph Reasoning", "paper_summary": "In real-world scientific discovery, human beings always make use of the\naccumulated prior knowledge with imagination pick select one or a few most\npromising hypotheses from large and noisy data analysis results. In this study,\nwe introduce a new type of graph structure, the text-numeric graph (TNG), which\nis defined as graph entities and associations have both text-attributed\ninformation and numeric information. The TNG is an ideal data structure model\nfor novel scientific discovery via graph reasoning because it integrates\nhuman-understandable textual annotations or prior knowledge, with numeric\nvalues that represent the observed or activation levels of graph entities or\nassociations in different samples. Together both the textual information and\nnumeric values determine the importance of graph entities and associations in\ngraph reasoning for novel scientific knowledge discovery. We further propose\nintegrating large language models (LLMs) and graph neural networks (GNNs) to\nanalyze the TNGs for graph understanding and reasoning. To demonstrate the\nutility, we generated the text-omic(numeric) signaling graphs (TOSG), as one\ntype of TNGs, in which all graphs have the same entities, associations and\nannotations, but have sample-specific entity numeric (omic) values using single\ncell RNAseq (scRNAseq) datasets of different diseases. We proposed joint\nLLM-GNN models for key entity mining and signaling pathway mining on the TOSGs.\nThe evaluation results showed the LLM-GNN and TNGs models significantly improve\nclassification accuracy and network inference. In conclusion, the TNGs and\njoint LLM-GNN models are important approaches for scientific discovery.", "paper_summary_zh": "<paragraph>在現實世界的科學發現中，人類總是利用累積的先驗知識，並運用想像力從大量且雜訊的資料分析結果中挑選出一個或幾個最有希望的假設。在本研究中，我們介紹了一種新型態的圖形結構，稱為文字數值圖 (TNG)，定義為圖形實體和關聯具有文字屬性資訊和數值資訊。TNG 是透過圖形推理進行新科學發現的理想資料結構模型，因為它整合了人類可理解的文字註解或先驗知識，以及代表圖形實體或不同樣本中關聯的觀察值或活化程度的數值。文字資訊和數值一起決定了圖形實體和關聯在圖形推理中對於新科學知識發現的重要性。我們進一步提出整合大型語言模型 (LLM) 和圖形神經網路 (GNN) 來分析 TNG，以進行圖形理解和推理。為了展示其效用，我們生成了文字組學（數值）訊號圖 (TOSG)，作為一種 TNG，其中所有圖形都具有相同的實體、關聯和註解，但具有特定於樣本的實體數值（組學）值，使用不同疾病的單細胞 RNAseq (scRNAseq) 資料集。我們針對 TOSG 提出聯合 LLM-GNN 模型，用於關鍵實體探勘和訊號路徑探勘。評估結果顯示，LLM-GNN 和 TNG 模型顯著提升了分類準確度和網路推論。結論而言，TNG 和聯合 LLM-GNN 模型是科學發現的重要方法。</paragraph>", "author": "Haoran Song et.al.", "authors": "Haoran Song, Jiarui Feng, Guangfu Li, Michael Province, Philip Payne, Yixin Chen, Fuhai Li", "id": "2501.16361v1", "paper_url": "http://arxiv.org/abs/2501.16361v1", "repo": "null"}}