{"2410.08855": {"publish_time": "2024-10-11", "title": "MATCH: Model-Aware TVM-based Compilation for Heterogeneous Edge Devices", "paper_summary": "Streamlining the deployment of Deep Neural Networks (DNNs) on heterogeneous\nedge platforms, coupling within the same micro-controller unit (MCU)\ninstruction processors and hardware accelerators for tensor computations, is\nbecoming one of the crucial challenges of the TinyML field.\n  The best-performing DNN compilation toolchains are usually deeply customized\nfor a single MCU family, and porting to a different heterogeneous MCU family\nimplies labor-intensive re-development of almost the entire compiler. On the\nopposite side, retargetable toolchains, such as TVM, fail to exploit the\ncapabilities of custom accelerators, resulting in the generation of general but\nunoptimized code. To overcome this duality, we introduce MATCH, a novel\nTVM-based DNN deployment framework designed for easy agile retargeting across\ndifferent MCU processors and accelerators, thanks to a customizable model-based\nhardware abstraction.\n  We show that a general and retargetable mapping framework enhanced with\nhardware cost models can compete with and even outperform custom toolchains on\ndiverse targets while only needing the definition of an abstract hardware model\nand a SoC-specific API.\n  We tested MATCH on two state-of-the-art heterogeneous MCUs, GAP9 and DIANA.\n  On the four DNN models of the MLPerf Tiny suite MATCH reduces inference\nlatency by up to 60.88 times on DIANA, compared to using the plain TVM, thanks\nto the exploitation of the on-board HW accelerator. Compared to HTVM, a fully\ncustomized toolchain for DIANA, we still reduce the latency by 16.94%. On GAP9,\nusing the same benchmarks, we improve the latency by 2.15 times compared to the\ndedicated DORY compiler, thanks to our heterogeneous DNN mapping approach that\nsynergically exploits the DNN accelerator and the eight-cores cluster available\non board.", "paper_summary_zh": "<paragraph>優化異質邊緣平台上的深度神經網路 (DNN) 部署，在同一個微控制器單元 (MCU) 內結合指令處理器和硬體加速器進行張量運算，正成為 TinyML 領域的關鍵挑戰之一。\n執行效能最佳的 DNN 編譯工具鏈通常針對單一 MCU 家族進行深度客製化，而移植到不同的異質 MCU 家族表示幾乎整個編譯器都需要進行耗費大量人力的重新開發。另一方面，可重新定位的工具鏈（例如 TVM）無法利用自訂加速器的功能，導致產生通用但未最佳化的程式碼。為了克服這種二元性，我們引進 MATCH，一個基於 TVM 的新穎 DNN 部署架構，由於可自訂的基於模型的硬體抽象化，因此設計用於在不同的 MCU 處理器和加速器之間進行輕鬆敏捷的重新定位。\n我們展示了一個增強硬體成本模型的通用且可重新定位的對應架構，能夠與自訂工具鏈在各種目標上競爭，甚至表現得更好，同時只需要定義一個抽象硬體模型和一個 SoC 特定的 API。\n我們在兩個最先進的異質 MCU，GAP9 和 DIANA 上測試了 MATCH。\n在 MLPerf Tiny 組合的四個 DNN 模型上，MATCH 將 DIANA 上的推論延遲減少了多達 60.88 倍，這要歸功於利用了板載 HW 加速器。與 HTVM（一個完全自訂的 DIANA 工具鏈）相比，我們仍然將延遲減少了 16.94%。在 GAP9 上，使用相同的基準，我們將延遲改善了 2.15 倍，這要歸功於我們的異質 DNN 對應方法，該方法協同利用了 DNN 加速器和板上可用的八核叢集。</paragraph>", "author": "Mohamed Amine Hamdi et.al.", "authors": "Mohamed Amine Hamdi, Francesco Daghero, Giuseppe Maria Sarda, Josse Van Delm, Arne Symons, Luca Benini, Marian Verhelst, Daniele Jahier Pagliari, Alessio Burrello", "id": "2410.08855v1", "paper_url": "http://arxiv.org/abs/2410.08855v1", "repo": "null"}}