{"2410.22884": {"publish_time": "2024-10-30", "title": "Stealing User Prompts from Mixture of Experts", "paper_summary": "Mixture-of-Experts (MoE) models improve the efficiency and scalability of\ndense language models by routing each token to a small number of experts in\neach layer. In this paper, we show how an adversary that can arrange for their\nqueries to appear in the same batch of examples as a victim's queries can\nexploit Expert-Choice-Routing to fully disclose a victim's prompt. We\nsuccessfully demonstrate the effectiveness of this attack on a two-layer\nMixtral model, exploiting the tie-handling behavior of the torch.topk CUDA\nimplementation. Our results show that we can extract the entire prompt using\n$O({VM}^2)$ queries (with vocabulary size $V$ and prompt length $M$) or 100\nqueries on average per token in the setting we consider. This is the first\nattack to exploit architectural flaws for the purpose of extracting user\nprompts, introducing a new class of LLM vulnerabilities.", "paper_summary_zh": "混合专家 (MoE) 模型透過將每個符號路由到每一層的少數專家，進而提升密集語言模型的效率和可擴充性。在本文中，我們展示了一個對手如何安排他們的查詢出現在與受害者查詢相同的範例批次中，可以利用專家選擇路由來完全揭露受害者的提示。我們成功展示了這種攻擊在雙層 Mixtral 模型上的有效性，利用了火炬 topk CUDA 實作的平手處理行為。我們的結果顯示，我們可以使用 $O({VM}^2)$ 個查詢（詞彙量大小為 $V$，提示長度為 $M$）或在我們考慮的設定中平均每個符號 100 個查詢來提取整個提示。這是第一個利用架構缺陷來提取使用者提示的攻擊，引入了 LLM 漏洞的新類別。", "author": "Itay Yona et.al.", "authors": "Itay Yona, Ilia Shumailov, Jamie Hayes, Nicholas Carlini", "id": "2410.22884v1", "paper_url": "http://arxiv.org/abs/2410.22884v1", "repo": "null"}}