{"2411.04822": {"publish_time": "2024-11-07", "title": "When Does Classical Chinese Help? Quantifying Cross-Lingual Transfer in Hanja and Kanbun", "paper_summary": "Historical and linguistic connections within the Sinosphere have led\nresearchers to use Classical Chinese resources for cross-lingual transfer when\nprocessing historical documents from Korea and Japan. In this paper, we\nquestion the assumption of cross-lingual transferability from Classical Chinese\nto Hanja and Kanbun, the ancient written languages of Korea and Japan,\nrespectively. Our experiments across machine translation, named entity\nrecognition, and punctuation restoration tasks show minimal impact of Classical\nChinese datasets on language model performance for ancient Korean documents\nwritten in Hanja, with performance differences within $\\pm{}0.0068$ F1-score\nfor sequence labeling tasks and up to $+0.84$ BLEU score for translation. These\nlimitations persist consistently across various model sizes, architectures, and\ndomain-specific datasets. Our analysis reveals that the benefits of Classical\nChinese resources diminish rapidly as local language data increases for Hanja,\nwhile showing substantial improvements only in extremely low-resource scenarios\nfor both Korean and Japanese historical documents. These mixed results\nemphasize the need for careful empirical validation rather than assuming\nbenefits from indiscriminate cross-lingual transfer.", "paper_summary_zh": "歷史和語言在漢語圈內的聯繫，導致研究人員在處理韓國和日本的歷史文件時，使用古典中文資源進行跨語言轉移。在本文中，我們質疑了從古典中文到韓文和日文的古代書面語言韓文和漢文，在跨語言可轉移性的假設。我們在機器翻譯、命名實體辨識和標點符號還原任務中的實驗，顯示古典中文資料集對用韓文寫成的古代韓文文件的語言模型效能影響很小，序列標籤任務的效能差異在 $\\pm{}0.0068$ F1 分數內，而翻譯的 BLEU 分數最高可達 $+0.84$。這些限制在各種模型大小、架構和特定領域資料集上持續存在。我們的分析顯示，隨著韓文的在地語言資料增加，古典中文資源的優勢迅速下降，而只在韓文和日文歷史文件的極低資源場景中，才顯示出顯著的改善。這些混合的結果強調了仔細實證驗證的必要性，而不是假設不加區別的跨語言轉移的優點。", "author": "Seyoung Song et.al.", "authors": "Seyoung Song, Haneul Yoo, Jiho Jin, Kyunghyun Cho, Alice Oh", "id": "2411.04822v1", "paper_url": "http://arxiv.org/abs/2411.04822v1", "repo": "null"}}