{"2501.08712": {"publish_time": "2025-01-15", "title": "Self-supervised Transformation Learning for Equivariant Representations", "paper_summary": "Unsupervised representation learning has significantly advanced various\nmachine learning tasks. In the computer vision domain, state-of-the-art\napproaches utilize transformations like random crop and color jitter to achieve\ninvariant representations, embedding semantically the same inputs despite\ntransformations. However, this can degrade performance in tasks requiring\nprecise features, such as localization or flower classification. To address\nthis, recent research incorporates equivariant representation learning, which\ncaptures transformation-sensitive information. However, current methods depend\non transformation labels and thus struggle with interdependency and complex\ntransformations. We propose Self-supervised Transformation Learning (STL),\nreplacing transformation labels with transformation representations derived\nfrom image pairs. The proposed method ensures transformation representation is\nimage-invariant and learns corresponding equivariant transformations, enhancing\nperformance without increased batch complexity. We demonstrate the approach's\neffectiveness across diverse classification and detection tasks, outperforming\nexisting methods in 7 out of 11 benchmarks and excelling in detection. By\nintegrating complex transformations like AugMix, unusable by prior equivariant\nmethods, this approach enhances performance across tasks, underscoring its\nadaptability and resilience. Additionally, its compatibility with various base\nmodels highlights its flexibility and broad applicability. The code is\navailable at https://github.com/jaemyung-u/stl.", "paper_summary_zh": "無監督表示學習已大幅提升各種機器學習任務。在電腦視覺領域中，最先進的方法利用隨機裁剪和色彩抖動等轉換，以達成不變表示，即使經過轉換，語意上相同的輸入仍會嵌入。然而，這可能會降低需要精確特徵的任務效能，例如定位或花卉分類。為了解決此問題，最近的研究納入了等變表示學習，這擷取了對轉換敏感的資訊。然而，目前的方法依賴於轉換標籤，因此難以處理相互依賴性和複雜的轉換。我們提出自監督轉換學習 (STL)，以從影像對中衍生的轉換表示取代轉換標籤。所提出的方法確保轉換表示是影像不變的，並學習對應的等變轉換，在不增加批次複雜度的情況下提升效能。我們展示了此方法在各種分類和偵測任務中的有效性，在 11 個基準中的 7 個表現優於現有方法，且在偵測方面表現出色。透過整合先前的等變方法無法使用的複雜轉換，例如 AugMix，此方法提升了各種任務的效能，突顯其適應性和韌性。此外，它與各種基礎模型的相容性突顯了其靈活性與廣泛的適用性。程式碼可在 https://github.com/jaemyung-u/stl 取得。", "author": "Jaemyung Yu et.al.", "authors": "Jaemyung Yu, Jaehyun Choi, Dong-Jae Lee, HyeongGwon Hong, Junmo Kim", "id": "2501.08712v1", "paper_url": "http://arxiv.org/abs/2501.08712v1", "repo": "https://github.com/jaemyung-u/stl"}}