{"2410.23692": {"publish_time": "2024-10-31", "title": "Instruction-Tuning Llama-3-8B Excels in City-Scale Mobility Prediction", "paper_summary": "Human mobility prediction plays a critical role in applications such as\ndisaster response, urban planning, and epidemic forecasting. Traditional\nmethods often rely on designing crafted, domain-specific models, and typically\nfocus on short-term predictions, which struggle to generalize across diverse\nurban environments. In this study, we introduce Llama-3-8B-Mob, a large\nlanguage model fine-tuned with instruction tuning, for long-term citywide\nmobility prediction -- in a Q&A manner. We validate our approach using\nlarge-scale human mobility data from four metropolitan areas in Japan, focusing\non predicting individual trajectories over the next 15 days. The results\ndemonstrate that Llama-3-8B-Mob excels in modeling long-term human mobility --\nsurpassing the state-of-the-art on multiple prediction metrics. It also\ndisplays strong zero-shot generalization capabilities -- effectively\ngeneralizing to other cities even when fine-tuned only on limited samples from\na single city. Source codes are available at\nhttps://github.com/TANGHULU6/Llama3-8B-Mob.", "paper_summary_zh": "人類流動預測在災難應變、都市規劃和疫情預測等應用中扮演著至關重要的角色。傳統方法通常依賴於設計精心製作的特定領域模型，並且通常專注於短期預測，難以概括到不同的城市環境中。在這項研究中，我們引入了 Llama-3-8B-Mob，這是一個使用指令調整進行微調的大型語言模型，用於長期全市流動預測——以問答的方式。我們使用來自日本四個大都市地區的大規模人類流動數據驗證了我們的做法，重點預測未來 15 天的個人軌跡。結果表明，Llama-3-8B-Mob 在建模長期人類流動方面表現出色——在多項預測指標上超越了最先進的技術。它還展現了強大的零次學習概括能力——即使僅根據單一城市中的有限樣本進行微調，也能有效地概括到其他城市。原始碼可在 https://github.com/TANGHULU6/Llama3-8B-Mob 取得。", "author": "Peizhi Tang et.al.", "authors": "Peizhi Tang, Chuang Yang, Tong Xing, Xiaohang Xu, Renhe Jiang, Kaoru Sezaki", "id": "2410.23692v1", "paper_url": "http://arxiv.org/abs/2410.23692v1", "repo": "https://github.com/tanghulu6/llama3-8b-mob"}}