{"2411.14982": {"publish_time": "2024-11-22", "title": "Large Multi-modal Models Can Interpret Features in Large Multi-modal Models", "paper_summary": "Recent advances in Large Multimodal Models (LMMs) lead to significant\nbreakthroughs in both academia and industry. One question that arises is how\nwe, as humans, can understand their internal neural representations. This paper\ntakes an initial step towards addressing this question by presenting a\nversatile framework to identify and interpret the semantics within LMMs.\nSpecifically, 1) we first apply a Sparse Autoencoder(SAE) to disentangle the\nrepresentations into human understandable features. 2) We then present an\nautomatic interpretation framework to interpreted the open-semantic features\nlearned in SAE by the LMMs themselves. We employ this framework to analyze the\nLLaVA-NeXT-8B model using the LLaVA-OV-72B model, demonstrating that these\nfeatures can effectively steer the model's behavior. Our results contribute to\na deeper understanding of why LMMs excel in specific tasks, including EQ tests,\nand illuminate the nature of their mistakes along with potential strategies for\ntheir rectification. These findings offer new insights into the internal\nmechanisms of LMMs and suggest parallels with the cognitive processes of the\nhuman brain.", "paper_summary_zh": "大型多模态模型 (LMM) 的最新进展为学术界和产业界带来了重大突破。一个出现的问题是我们作为人类如何理解其内部神经表征。本文通过提出一个通用的框架来识别和解释 LMM 中的语义，迈出了解决这个问题的第一步。具体来说，1) 我们首先应用稀疏自动编码器 (SAE) 将表征分解为人类可理解的特征。2) 然后，我们提出一个自动解释框架，由 LMM 本身解释在 SAE 中学习的开放语义特征。我们使用 LLaVA-OV-72B 模型分析 LLaVA-NeXT-8B 模型，证明这些特征可以有效地引导模型的行为。我们的研究结果有助于更深入地理解 LMM 在特定任务（包括情商测试）中表现出色的原因，并阐明其错误的本质以及潜在的纠正策略。这些发现为 LMM 的内部机制提供了新的见解，并暗示了与人脑认知过程的相似之处。", "author": "Kaichen Zhang et.al.", "authors": "Kaichen Zhang, Yifei Shen, Bo Li, Ziwei Liu", "id": "2411.14982v1", "paper_url": "http://arxiv.org/abs/2411.14982v1", "repo": "https://github.com/EvolvingLMMs-Lab/multimodal-sae"}}