{"2412.19064": {"publish_time": "2024-12-26", "title": "Hierarchical Multi-agent Meta-Reinforcement Learning for Cross-channel Bidding", "paper_summary": "Real-time bidding (RTB) plays a pivotal role in online advertising\necosystems. Advertisers employ strategic bidding to optimize their advertising\nimpact while adhering to various financial constraints, such as the\nreturn-on-investment (ROI) and cost-per-click (CPC). Primarily focusing on\nbidding with fixed budget constraints, traditional approaches cannot\neffectively manage the dynamic budget allocation problem where the goal is to\nachieve global optimization of bidding performance across multiple channels\nwith a shared budget. In this paper, we propose a hierarchical multi-agent\nreinforcement learning framework for multi-channel bidding optimization. In\nthis framework, the top-level strategy applies a CPC constrained diffusion\nmodel to dynamically allocate budgets among the channels according to their\ndistinct features and complex interdependencies, while the bottom-level\nstrategy adopts a state-action decoupled actor-critic method to address the\nproblem of extrapolation errors in offline learning caused by\nout-of-distribution actions and a context-based meta-channel knowledge learning\nmethod to improve the state representation capability of the policy based on\nthe shared knowledge among different channels. Comprehensive experiments\nconducted on a large scale real-world industrial dataset from the Meituan ad\nbidding platform demonstrate that our method achieves a state-of-the-art\nperformance.", "paper_summary_zh": "<paragraph>即時競價 (RTB) 在線上廣告生態系統中扮演著舉足輕重的角色。廣告商運用策略性競標，在遵守各種財務限制（例如投資報酬率 (ROI) 和每次點擊費用 (CPC)）的同時，最佳化他們的廣告影響力。傳統方法主要著重於在固定預算限制下競標，無法有效管理動態預算分配問題，而動態預算分配問題的目標是跨多個頻道，在共享預算下達成競標成效的整體最佳化。在本文中，我們提出一個階層式多重代理強化學習架構，用於多頻道競標最佳化。在這個架構中，頂層策略套用一個 CPC 約束擴散模型，根據頻道的不同特徵和複雜的相互依賴性，動態分配預算，而底層策略採用一個狀態動作解耦的動作-評論方法，以解決離線學習中因超出分布動作而產生的外推誤差問題，並採用一個基於脈絡的元頻道知識學習方法，根據不同頻道之間的共享知識，提升政策的狀態表徵能力。在美團廣告競標平台上進行的大規模真實世界產業資料集上執行的綜合實驗，證明了我們的方法達到了最先進的成效。</paragraph>", "author": "Shenghong He et.al.", "authors": "Shenghong He, Chao Yu", "id": "2412.19064v1", "paper_url": "http://arxiv.org/abs/2412.19064v1", "repo": "null"}}