{"2406.18765": {"publish_time": "2024-06-26", "title": "WV-Net: A foundation model for SAR WV-mode satellite imagery trained using contrastive self-supervised learning on 10 million images", "paper_summary": "The European Space Agency's Copernicus Sentinel-1 (S-1) mission is a\nconstellation of C-band synthetic aperture radar (SAR) satellites that provide\nunprecedented monitoring of the world's oceans. S-1's wave mode (WV) captures\n20x20 km image patches at 5 m pixel resolution and is unaffected by cloud cover\nor time-of-day. The mission's open data policy has made SAR data easily\naccessible for a range of applications, but the need for manual image\nannotations is a bottleneck that hinders the use of machine learning methods.\nThis study uses nearly 10 million WV-mode images and contrastive\nself-supervised learning to train a semantic embedding model called WV-Net. In\nmultiple downstream tasks, WV-Net outperforms a comparable model that was\npre-trained on natural images (ImageNet) with supervised learning. Experiments\nshow improvements for estimating wave height (0.50 vs 0.60 RMSE using linear\nprobing), estimating near-surface air temperature (0.90 vs 0.97 RMSE), and\nperforming multilabel-classification of geophysical and atmospheric phenomena\n(0.96 vs 0.95 micro-averaged AUROC). WV-Net embeddings are also superior in an\nunsupervised image-retrieval task and scale better in data-sparse settings.\nTogether, these results demonstrate that WV-Net embeddings can support\ngeophysical research by providing a convenient foundation model for a variety\nof data analysis and exploration tasks.", "paper_summary_zh": "<paragraph>歐洲太空總署的哥白尼 Sentinel-1 (S-1) 任務是一組 C 波段合成孔徑雷達 (SAR) 衛星，可提供前所未有的全球海洋監測。S-1 的波浪模式 (WV) 以 5 公尺像素解析度擷取 20x20 公里影像區塊，不受雲層覆蓋或時間影響。這項任務的開放資料政策讓 SAR 資料容易取得，可應用於各種應用程式，但手動影像註解的需求是阻礙機器學習方法使用的瓶頸。本研究使用近 1 千萬張 WV 模式影像和對比自我監督學習，訓練一個名為 WV-Net 的語意嵌入模型。在多個下游任務中，WV-Net 優於使用監督學習在自然影像 (ImageNet) 上預先訓練的類似模型。實驗顯示，在估計波浪高度 (使用線性探測時，0.50 對上 0.60 RMSE)、估計近地表空氣溫度 (0.90 對上 0.97 RMSE) 和執行地球物理和氣象現象的多標籤分類 (0.96 對上 0.95 微平均 AUROC) 方面都有所進步。WV-Net 嵌入在無監督影像檢索任務中也較為出色，且在資料稀疏的設定中具有更好的擴充性。總而言之，這些結果證明 WV-Net 嵌入可透過為各種資料分析和探索任務提供便利基礎模型，來支援地球物理研究。</paragraph>", "author": "Yannik Glaser et.al.", "authors": "Yannik Glaser, Justin E. Stopa, Linnea M. Wolniewicz, Ralph Foster, Doug Vandemark, Alexis Mouche, Bertrand Chapron, Peter Sadowski", "id": "2406.18765v1", "paper_url": "http://arxiv.org/abs/2406.18765v1", "repo": "null"}}