{"2411.07340": {"publish_time": "2024-11-11", "title": "Warmstarting for Scaling Language Models", "paper_summary": "Scaling model sizes to scale performance has worked remarkably well for the\ncurrent large language models paradigm. The research and empirical findings of\nvarious scaling studies led to novel scaling results and laws that guides\nsubsequent research. High training costs for contemporary scales of data and\nmodels result in a lack of thorough understanding of how to tune and arrive at\nsuch training setups. One direction to ameliorate the cost of pretraining large\nmodels is to warmstart the large-scale training from smaller models that are\ncheaper to tune. In this work, we attempt to understand if the behavior of\noptimal hyperparameters can be retained under warmstarting for scaling. We\nexplore simple operations that allow the application of theoretically motivated\nmethods of zero-shot transfer of optimal hyperparameters using {\\mu}Transfer.\nWe investigate the aspects that contribute to the speedup in convergence and\nthe preservation of stable training dynamics under warmstarting with\n{\\mu}Transfer. We find that shrinking smaller model weights, zero-padding, and\nperturbing the resulting larger model with scaled initialization from {\\mu}P\nenables effective warmstarting of $\\mut{}$.", "paper_summary_zh": "將模型規模擴展到擴展效能對於目前的巨量語言模型範例而言運作得非常好。各種規模研究的研究和經驗結果導致新穎的規模結果和定律，這些定律指導後續的研究。當代資料和模型的高訓練成本導致缺乏對如何調整和達成此類訓練設定的透徹理解。改善大型模型預訓練成本的一個方向是從較小的模型開始進行大規模訓練，較小的模型調整成本較低。在這項工作中，我們嘗試了解最佳超參數的行為是否可以在擴展的熱啟動下保留。我們探索允許應用理論激勵的最佳超參數零次轉移方法的簡單操作，使用 {\\mu}Transfer。我們研究了有助於加速收斂和在使用 {\\mu}Transfer 熱啟動時維持穩定訓練動態的方面。我們發現縮小較小的模型權重、零填充以及使用來自 {\\mu}P 的縮放初始化擾動產生的較大模型，能夠有效地熱啟動 $\\mut{}$。", "author": "Neeratyoy Mallik et.al.", "authors": "Neeratyoy Mallik, Maciej Janowski, Johannes Hog, Herilalaina Rakotoarison, Aaron Klein, Josif Grabocka, Frank Hutter", "id": "2411.07340v1", "paper_url": "http://arxiv.org/abs/2411.07340v1", "repo": "null"}}