{"2501.05966": {"publish_time": "2025-01-10", "title": "Towards Early Prediction of Self-Supervised Speech Model Performance", "paper_summary": "In Self-Supervised Learning (SSL), pre-training and evaluation are resource\nintensive. In the speech domain, current indicators of the quality of SSL\nmodels during pre-training, such as the loss, do not correlate well with\ndownstream performance. Consequently, it is often difficult to gauge the final\ndownstream performance in a cost efficient manner during pre-training. In this\nwork, we propose unsupervised efficient methods that give insights into the\nquality of the pre-training of SSL speech models, namely, measuring the cluster\nquality and rank of the embeddings of the SSL model. Results show that measures\nof cluster quality and rank correlate better with downstream performance than\nthe pre-training loss with only one hour of unlabeled audio, reducing the need\nfor GPU hours and labeled data in SSL model evaluation.", "paper_summary_zh": "在自監督學習 (SSL) 中，預訓練和評估需要大量資源。在語音領域，預訓練期間 SSL 模型品質的當前指標（例如損失）與下游效能並無良好的關聯性。因此，在預訓練期間，通常難以以成本效益的方式評估最終的下游效能。在這項工作中，我們提出非監督的有效方法，可深入了解 SSL 語音模型預訓練的品質，即測量 SSL 模型的嵌入叢集品質和等級。結果顯示，與僅有一小時未標記音訊的預訓練損失相比，叢集品質和等級的測量與下游效能有更好的關聯性，減少了 SSL 模型評估中對 GPU 小時和標記資料的需求。", "author": "Ryan Whetten et.al.", "authors": "Ryan Whetten, Lucas Maison, Titouan Parcollet, Marco Dinarelli, Yannick Estève", "id": "2501.05966v1", "paper_url": "http://arxiv.org/abs/2501.05966v1", "repo": "null"}}