{"2410.21169": {"publish_time": "2024-10-28", "title": "Document Parsing Unveiled: Techniques, Challenges, and Prospects for Structured Information Extraction", "paper_summary": "Document parsing is essential for converting unstructured and semi-structured\ndocuments-such as contracts, academic papers, and invoices-into structured,\nmachine-readable data. Document parsing extract reliable structured data from\nunstructured inputs, providing huge convenience for numerous applications.\nEspecially with recent achievements in Large Language Models, document parsing\nplays an indispensable role in both knowledge base construction and training\ndata generation. This survey presents a comprehensive review of the current\nstate of document parsing, covering key methodologies, from modular pipeline\nsystems to end-to-end models driven by large vision-language models. Core\ncomponents such as layout detection, content extraction (including text,\ntables, and mathematical expressions), and multi-modal data integration are\nexamined in detail. Additionally, this paper discusses the challenges faced by\nmodular document parsing systems and vision-language models in handling complex\nlayouts, integrating multiple modules, and recognizing high-density text. It\nemphasizes the importance of developing larger and more diverse datasets and\noutlines future research directions.", "paper_summary_zh": "文件解析對於將非結構化和半結構化文件（例如合約、學術論文和發票）轉換為結構化、機器可讀取的資料至關重要。文件解析從非結構化輸入中萃取出可靠的結構化資料，為許多應用程式帶來極大的便利性。特別是隨著大型語言模型的最新進展，文件解析在知識庫建構和訓練資料產生中扮演著不可或缺的角色。這份調查提供了一份對文件解析現況的全面回顧，涵蓋了關鍵方法，從模組化管道系統到由大型視覺語言模型驅動的端到端模型。核心元件，例如版面偵測、內容萃取（包括文字、表格和數學表達式）和多模式資料整合，都得到了詳細的探討。此外，本文討論了模組化文件解析系統和視覺語言模型在處理複雜版面、整合多個模組和辨識高密度文字時所面臨的挑戰。它強調了開發更大、更多樣化的資料集的重要性，並概述了未來的研究方向。", "author": "Qintong Zhang et.al.", "authors": "Qintong Zhang, Victor Shea-Jay Huang, Bin Wang, Junyuan Zhang, Zhengren Wang, Hao Liang, Shawn Wang, Matthieu Lin, Wentao Zhang, Conghui He", "id": "2410.21169v1", "paper_url": "http://arxiv.org/abs/2410.21169v1", "repo": "null"}}