{"2412.10185": {"publish_time": "2024-12-13", "title": "Solving Robust Markov Decision Processes: Generic, Reliable, Efficient", "paper_summary": "Markov decision processes (MDP) are a well-established model for sequential\ndecision-making in the presence of probabilities. In robust MDP (RMDP), every\naction is associated with an uncertainty set of probability distributions,\nmodelling that transition probabilities are not known precisely. Based on the\nknown theoretical connection to stochastic games, we provide a framework for\nsolving RMDPs that is generic, reliable, and efficient. It is *generic* both\nwith respect to the model, allowing for a wide range of uncertainty sets,\nincluding but not limited to intervals, $L^1$- or $L^2$-balls, and polytopes;\nand with respect to the objective, including long-run average reward,\nundiscounted total reward, and stochastic shortest path. It is *reliable*, as\nour approach not only converges in the limit, but provides precision guarantees\nat any time during the computation. It is *efficient* because -- in contrast to\nstate-of-the-art approaches -- it avoids explicitly constructing the underlying\nstochastic game. Consequently, our prototype implementation outperforms\nexisting tools by several orders of magnitude and can solve RMDPs with a\nmillion states in under a minute.", "paper_summary_zh": "馬可夫決策過程 (MDP) 是一種在機率存在的情況下進行順序決策的既定模型。在強健 MDP (RMDP) 中，每個動作都與機率分佈的不確定性集合相關，建模為轉移機率並非精確已知。根據已知的與隨機博弈的理論連結，我們提供了一個解決 RMDP 的架構，它具有通用性、可靠性與效率。它在模型方面是「通用的」，允許使用廣泛的不確定性集合，包括但不限於區間、$L^1$ 或 $L^2$ 球體和多面體；在目標方面也是通用的，包括長期平均獎勵、未貼現總獎勵和隨機最短路徑。它很「可靠」，因為我們的做法不僅會在極限中收斂，還會在運算過程中隨時提供精確度保證。它很「有效」，因為與最先進的做法相反，它避免明確建構基礎隨機博弈。因此，我們的原型實作在幾個數量級上都優於現有工具，而且可以在不到一分鐘的時間內解決擁有數百萬個狀態的 RMDP。", "author": "Tobias Meggendorfer et.al.", "authors": "Tobias Meggendorfer, Maximilian Weininger, Patrick Wienhöft", "id": "2412.10185v1", "paper_url": "http://arxiv.org/abs/2412.10185v1", "repo": "null"}}