{"2411.10000": {"publish_time": "2024-11-15", "title": "DuSEGO: Dual Second-order Equivariant Graph Ordinary Differential Equation", "paper_summary": "Graph Neural Networks (GNNs) with equivariant properties have achieved\nsignificant success in modeling complex dynamic systems and molecular\nproperties. However, their expressiveness ability is limited by: (1) Existing\nmethods often overlook the over-smoothing issue caused by traditional GNN\nmodels, as well as the gradient explosion or vanishing problems in deep GNNs.\n(2) Most models operate on first-order information, neglecting that the real\nworld often consists of second-order systems, which further limits the model's\nrepresentation capabilities. To address these issues, we propose the\n\\textbf{Du}al \\textbf{S}econd-order \\textbf{E}quivariant \\textbf{G}raph\n\\textbf{O}rdinary Differential Equation (\\method{}) for equivariant\nrepresentation. Specifically, \\method{} apply the dual second-order equivariant\ngraph ordinary differential equations (Graph ODEs) on graph embeddings and node\ncoordinates, simultaneously. Theoretically, we first prove that \\method{}\nmaintains the equivariant property. Furthermore, we provide theoretical\ninsights showing that \\method{} effectively alleviates the over-smoothing\nproblem in both feature representation and coordinate update. Additionally, we\ndemonstrate that the proposed \\method{} mitigates the exploding and vanishing\ngradients problem, facilitating the training of deep multi-layer GNNs.\nExtensive experiments on benchmark datasets validate the superiority of the\nproposed \\method{} compared to baselines.", "paper_summary_zh": "<paragraph>具有等變性質的圖神經網路 (GNN) 已在建模複雜動態系統和分子性質方面取得顯著成功。然而，它們的表現能力受到以下因素限制：(1) 現有方法經常忽略傳統 GNN 模型造成的過度平滑問題，以及深度 GNN 中的梯度爆炸或消失問題。(2) 大多數模型運作於一階資訊，忽略了現實世界通常由二階系統組成，這進一步限制了模型的表示能力。為了解決這些問題，我們提出了等變表示的**雙**二階**S**econd-order **E**quivariant **G**raph **O**rdinary Differential Equation (\\method{})。具體來說，\\method{} 同時在圖嵌入和節點坐標上應用二階等變圖常微分方程式 (Graph ODE)。理論上，我們首先證明 \\method{} 保持等變性質。此外，我們提供了理論見解，表明 \\method{} 有效地緩解了特徵表示和座標更新中的過度平滑問題。此外，我們證明了所提出的 \\method{} 減輕了爆炸和消失梯度問題，促进了多層深度 GNN 的訓練。在基準資料集上的大量實驗驗證了所提出的 \\method{} 與基準相比的優越性。</paragraph>", "author": "Yingxu Wang et.al.", "authors": "Yingxu Wang, Nan Yin, Mingyan Xiao, Xinhao Yi, Siwei Liu, Shangsong Liang", "id": "2411.10000v1", "paper_url": "http://arxiv.org/abs/2411.10000v1", "repo": "null"}}