{"2409.17691": {"publish_time": "2024-09-26", "title": "Efficient Bias Mitigation Without Privileged Information", "paper_summary": "Deep neural networks trained via empirical risk minimisation often exhibit\nsignificant performance disparities across groups, particularly when group and\ntask labels are spuriously correlated (e.g., \"grassy background\" and \"cows\").\nExisting bias mitigation methods that aim to address this issue often either\nrely on group labels for training or validation, or require an extensive\nhyperparameter search. Such data and computational requirements hinder the\npractical deployment of these methods, especially when datasets are too large\nto be group-annotated, computational resources are limited, and models are\ntrained through already complex pipelines. In this paper, we propose Targeted\nAugmentations for Bias Mitigation (TAB), a simple hyperparameter-free framework\nthat leverages the entire training history of a helper model to identify\nspurious samples, and generate a group-balanced training set from which a\nrobust model can be trained. We show that TAB improves worst-group performance\nwithout any group information or model selection, outperforming existing\nmethods while maintaining overall accuracy.", "paper_summary_zh": "透過經驗風險最小化訓練的深度神經網路通常展現出不同群組之間的顯著效能差異，特別是在群組和任務標籤具有虛假相關性（例如「草地背景」和「牛」）時。現有的偏差緩解方法旨在解決此問題，通常依賴群組標籤進行訓練或驗證，或需要廣泛的超參數搜尋。此類資料和計算需求阻礙了這些方法的實際部署，特別是在資料集太大而無法群組註解、計算資源有限，且模型透過已經複雜的管道進行訓練時。在本文中，我們提出用於偏差緩解的目標擴充（TAB），這是一個簡單的無超參數架構，利用輔助模型的整個訓練歷程來識別虛假樣本，並從中產生一個群組平衡的訓練集，進而訓練出穩健的模型。我們展示了 TAB 在沒有任何群組資訊或模型選擇的情況下改善最差群組效能，在維持整體準確度的同時，優於現有方法。", "author": "Mateo Espinosa Zarlenga et.al.", "authors": "Mateo Espinosa Zarlenga, Swami Sankaranarayanan, Jerone T. A. Andrews, Zohreh Shams, Mateja Jamnik, Alice Xiang", "id": "2409.17691v1", "paper_url": "http://arxiv.org/abs/2409.17691v1", "repo": "null"}}