{"2504.20997": {"publish_time": "2025-04-29", "title": "Toward Efficient Exploration by Large Language Model Agents", "paper_summary": "A burgeoning area within reinforcement learning (RL) is the design of\nsequential decision-making agents centered around large language models (LLMs).\nWhile autonomous decision-making agents powered by modern LLMs could facilitate\nnumerous real-world applications, such successes demand agents that are capable\nof data-efficient RL. One key obstacle to achieving data efficiency in RL is\nexploration, a challenge that we demonstrate many recent proposals for LLM\nagent designs struggle to contend with. Meanwhile, classic algorithms from the\nRL literature known to gracefully address exploration require technical\nmachinery that can be challenging to operationalize in purely natural language\nsettings. In this work, rather than relying on finetuning or in-context\nlearning to coax LLMs into implicitly imitating a RL algorithm, we illustrate\nhow LLMs can be used to explicitly implement an existing RL algorithm\n(Posterior Sampling for Reinforcement Learning) whose capacity for\nstatistically-efficient exploration is already well-studied. We offer empirical\nresults demonstrating how our LLM-based implementation of a known,\ndata-efficient RL algorithm can be considerably more effective in natural\nlanguage tasks that demand prudent exploration.", "paper_summary_zh": "<paragraph>強化學習 (RL) 中一個蓬勃發展的領域，是以大型語言模型 (LLM) 為中心的序列決策代理設計。 雖然由現代 LLM 驅動的自主決策代理可以促進許多實際應用，但這些成功需要能夠進行數據高效 RL 的代理。 實現 RL 中數據效率的一個主要障礙是探索，我們證明了許多最近提出的 LLM 代理設計方案都難以應對這一挑戰。 同時，已知可以優雅地解決探索問題的經典 RL 演算法需要一些技術機制，而這些機制在純自然語言環境中難以操作。 在這項工作中，我們沒有依靠微調或上下文學習來誘導 LLM 隱式地模仿 RL 演算法，而是說明了如何使用 LLM 來顯式地實現現有的 RL 演算法（強化學習的後驗抽樣），其統計高效探索的能力已經得到了充分研究。 我們提供了經驗結果，證明我們基於 LLM 的已知數據高效 RL 演算法的實現如何在需要謹慎探索的自然語言任務中更加有效。</paragraph>\n", "author": "Dilip Arumugam et.al.", "authors": "Dilip Arumugam, Thomas L. Griffiths", "id": "2504.20997v1", "paper_url": "http://arxiv.org/abs/2504.20997v1", "repo": "null"}}