{"2502.11926": {"publish_time": "2025-02-17", "title": "BRIGHTER: BRIdging the Gap in Human-Annotated Textual Emotion Recognition Datasets for 28 Languages", "paper_summary": "People worldwide use language in subtle and complex ways to express emotions.\nWhile emotion recognition -- an umbrella term for several NLP tasks --\nsignificantly impacts different applications in NLP and other fields, most work\nin the area is focused on high-resource languages. Therefore, this has led to\nmajor disparities in research and proposed solutions, especially for\nlow-resource languages that suffer from the lack of high-quality datasets. In\nthis paper, we present BRIGHTER-- a collection of multilabeled\nemotion-annotated datasets in 28 different languages. BRIGHTER covers\npredominantly low-resource languages from Africa, Asia, Eastern Europe, and\nLatin America, with instances from various domains annotated by fluent\nspeakers. We describe the data collection and annotation processes and the\nchallenges of building these datasets. Then, we report different experimental\nresults for monolingual and crosslingual multi-label emotion identification, as\nwell as intensity-level emotion recognition. We investigate results with and\nwithout using LLMs and analyse the large variability in performance across\nlanguages and text domains. We show that BRIGHTER datasets are a step towards\nbridging the gap in text-based emotion recognition and discuss their impact and\nutility.", "paper_summary_zh": "全球各地的人們都以微妙且複雜的方式使用語言來表達情感。\n雖然情緒辨識——幾個 NLP 任務的總稱——\n顯著影響 NLP 及其他領域中的不同應用，但該領域中的大部分工作\n都集中於高資源語言。因此，這導致研究和提出的解決方案出現重大差異，特別是\n對於缺乏高品質資料集的低資源語言。在本文中，我們提出 BRIGHTER——一個\n由 28 種不同語言組成的多標記情緒標註資料集。BRIGHTER 主要涵蓋來自非洲、亞洲、東歐和\n拉丁美洲的低資源語言，其中包含由流利講者標註的來自不同領域的實例。我們描述了資料收集和標註流程以及\n建立這些資料集的挑戰。然後，我們報告了單語和跨語言多標籤情緒識別的不同實驗結果，以及\n強度級別的情緒識別。我們研究了使用和不使用 LLM 的結果，並分析了跨語言和文字領域的性能的巨大變異。我們表明，BRIGHTER 資料集是縮小基於文字的情緒識別差距的一步，並討論了它們的影響和\n效用。", "author": "Shamsuddeen Hassan Muhammad et.al.", "authors": "Shamsuddeen Hassan Muhammad, Nedjma Ousidhoum, Idris Abdulmumin, Jan Philip Wahle, Terry Ruas, Meriem Beloucif, Christine de Kock, Nirmal Surange, Daniela Teodorescu, Ibrahim Said Ahmad, David Ifeoluwa Adelani, Alham Fikri Aji, Felermino D. M. A. Ali, Ilseyar Alimova, Vladimir Araujo, Nikolay Babakov, Naomi Baes, Ana-Maria Bucur, Andiswa Bukula, Guanqun Cao, Rodrigo Tufino Cardenas, Rendi Chevi, Chiamaka Ijeoma Chukwuneke, Alexandra Ciobotaru, Daryna Dementieva, Murja Sani Gadanya, Robert Geislinger, Bela Gipp, Oumaima Hourrane, Oana Ignat, Falalu Ibrahim Lawan, Rooweither Mabuya, Rahmad Mahendra, Vukosi Marivate, Andrew Piper, Alexander Panchenko, Charles Henrique Porto Ferreira, Vitaly Protasov, Samuel Rutunda, Manish Shrivastava, Aura Cristina Udrea, Lilian Diana Awuor Wanzare, Sophie Wu, Florian Valentin Wunderlich, Hanif Muhammad Zhafran, Tianhui Zhang, Yi Zhou, Saif M. Mohammad", "id": "2502.11926v1", "paper_url": "http://arxiv.org/abs/2502.11926v1", "repo": "null"}}