{"2408.07531": {"publish_time": "2024-08-14", "title": "Development of a Large Language Model-based Multi-Agent Clinical Decision Support System for Korean Triage and Acuity Scale (KTAS)-Based Triage and Treatment Planning in Emergency Departments", "paper_summary": "Emergency department (ED) overcrowding and the complexity of rapid\ndecision-making in critical care settings pose significant challenges to\nhealthcare systems worldwide. While clinical decision support systems (CDSS)\nhave shown promise, the integration of large language models (LLMs) offers new\npossibilities for enhancing triage accuracy and clinical decision-making. This\nstudy presents an LLM-driven CDSS designed to assist ED physicians and nurses\nin patient triage, treatment planning, and overall emergency care management.\n  We developed a multi-agent CDSS utilizing Llama-3-70b as the base LLM,\norchestrated by CrewAI and Langchain. The system comprises four AI agents\nemulating key ED roles: Triage Nurse, Emergency Physician, Pharmacist, and ED\nCoordinator. It incorporates the Korean Triage and Acuity Scale (KTAS) for\ntriage assessment and integrates with the RxNorm API for medication management.\n  The model was evaluated using the Asclepius dataset, with performance\nassessed by a clinical emergency medicine specialist. The CDSS demonstrated\nhigh accuracy in triage decision-making compared to the baseline of a\nsingle-agent system. Furthermore, the system exhibited strong performance in\ncritical areas, including primary diagnosis, critical findings identification,\ndisposition decision-making, treatment planning, and resource allocation.\n  Our multi-agent CDSS demonstrates significant potential for supporting\ncomprehensive emergency care management. By leveraging state-of-the-art AI\ntechnologies, this system offers a scalable and adaptable tool that could\nenhance emergency medical care delivery, potentially alleviating ED\novercrowding and improving patient outcomes. This work contributes to the\ngrowing field of AI applications in emergency medicine and offers a promising\ndirection for future research and clinical implementation.", "paper_summary_zh": "<paragraph>急診部門 (ED) 人滿為患，以及在重症照護環境中快速決策的複雜性，對全球的醫療保健系統構成重大挑戰。雖然臨床決策支援系統 (CDSS) 已顯示出前景，但大型語言模型 (LLM) 的整合為提高分流準確度和臨床決策提供了新的可能性。本研究提出了一個由 LLM 驅動的 CDSS，旨在協助急診科醫師和護理師進行病人分流、治療計畫和整體緊急照護管理。\n  我們開發了一個多代理架構的 CDSS，利用 Llama-3-70b 作為基礎 LLM，由 CrewAI 和 Langchain 協調。該系統包含四個模擬關鍵急診科角色的人工智慧代理：分流護理師、急診科醫師、藥劑師和急診科協調員。它結合了韓國分流和嚴重程度量表 (KTAS) 進行分流評估，並與 RxNorm API 整合進行藥物管理。\n  該模型使用 Asclepius 資料集進行評估，由臨床急診醫學專家評估績效。與單一代理系統的基準相比，CDSS 在分流決策方面表現出很高的準確性。此外，該系統在主要診斷、關鍵發現識別、處置決策、治療計畫和資源分配等關鍵領域表現出色。\n  我們的多代理架構 CDSS 展示了在全面緊急照護管理中提供顯著支援的潛力。透過利用最先進的人工智慧技術，此系統提供了一個可擴充且可適應的工具，可以加強緊急醫療照護的提供，潛在減輕急診科人滿為患的情況並改善病人預後。這項工作有助於緊急醫學中的人工智慧應用領域的成長，並為未來的研究和臨床實作提供了有前景的方向。</paragraph>", "author": "Seungjun Han et.al.", "authors": "Seungjun Han, Wongyung Choi", "id": "2408.07531v2", "paper_url": "http://arxiv.org/abs/2408.07531v2", "repo": "null"}}