{"2407.16521": {"publish_time": "2024-07-23", "title": "AMONGAGENTS: Evaluating Large Language Models in the Interactive Text-Based Social Deduction Game", "paper_summary": "Strategic social deduction games serve as valuable testbeds for evaluating\nthe understanding and inference skills of language models, offering crucial\ninsights into social science, artificial intelligence, and strategic gaming.\nThis paper focuses on creating proxies of human behavior in simulated\nenvironments, with \\textit{Among Us} utilized as a tool for studying simulated\nhuman behavior.\n  The study introduces a text-based game environment, named AmongAgent, that\nmirrors the dynamics of \\textit{Among Us}. Players act as crew members aboard a\nspaceship, tasked with identifying impostors who are sabotaging the ship and\neliminating the crew. Within this environment, the behavior of simulated\nlanguage agents is analyzed. The experiments involve diverse game sequences\nfeaturing different configurations of Crewmates and Impostor personality\narchetypes. Our work demonstrates that state-of-the-art large language models\n(LLMs) can effectively grasp the game rules and make decisions based on the\ncurrent context. This work aims to promote further exploration of LLMs in\ngoal-oriented games with incomplete information and complex action spaces, as\nthese settings offer valuable opportunities to assess language model\nperformance in socially driven scenarios.", "paper_summary_zh": "策略性社交推理遊戲可作為評估語言模型理解和推理技能的寶貴測試平台，提供對社會科學、人工智慧和策略遊戲的重要見解。本文重點在於在模擬環境中建立人類行為的代理，並以《Among Us》作為研究模擬人類行為的工具。本研究引入一個名為 AmongAgent 的文字遊戲環境，它反映了《Among Us》的動態。玩家扮演太空船上的船員，任務是找出破壞船隻並消滅船員的冒名頂替者。在這個環境中，分析模擬語言代理的行為。實驗涉及不同的遊戲序列，其中包含船員和冒名頂替者人格原型的不同配置。我們的研究表明，最先進的大型語言模型 (LLM) 可以有效掌握遊戲規則，並根據當前背景做出決策。這項工作旨在促進進一步探索 LLM 在具有不完整資訊和複雜動作空間的目標導向遊戲中的應用，因為這些設定提供了在社會驅動情境中評估語言模型效能的寶貴機會。", "author": "Yizhou Chi et.al.", "authors": "Yizhou Chi, Lingjun Mao, Zineng Tang", "id": "2407.16521v1", "paper_url": "http://arxiv.org/abs/2407.16521v1", "repo": "null"}}