{"2408.06634": {"publish_time": "2024-08-13", "title": "Harnessing Earnings Reports for Stock Predictions: A QLoRA-Enhanced LLM Approach", "paper_summary": "Accurate stock market predictions following earnings reports are crucial for\ninvestors. Traditional methods, particularly classical machine learning models,\nstruggle with these predictions because they cannot effectively process and\ninterpret extensive textual data contained in earnings reports and often\noverlook nuances that influence market movements. This paper introduces an\nadvanced approach by employing Large Language Models (LLMs) instruction\nfine-tuned with a novel combination of instruction-based techniques and\nquantized low-rank adaptation (QLoRA) compression. Our methodology integrates\n'base factors', such as financial metric growth and earnings transcripts, with\n'external factors', including recent market indices performances and analyst\ngrades, to create a rich, supervised dataset. This comprehensive dataset\nenables our models to achieve superior predictive performance in terms of\naccuracy, weighted F1, and Matthews correlation coefficient (MCC), especially\nevident in the comparison with benchmarks such as GPT-4. We specifically\nhighlight the efficacy of the llama-3-8b-Instruct-4bit model, which showcases\nsignificant improvements over baseline models. The paper also discusses the\npotential of expanding the output capabilities to include a 'Hold' option and\nextending the prediction horizon, aiming to accommodate various investment\nstyles and time frames. This study not only demonstrates the power of\nintegrating cutting-edge AI with fine-tuned financial data but also paves the\nway for future research in enhancing AI-driven financial analysis tools.", "paper_summary_zh": "對於投資人而言，在收益報告後進行準確的股市預測至關重要。傳統方法，特別是經典機器學習模型，在這些預測中面臨挑戰，因為它們無法有效處理和詮釋收益報告中包含的廣泛文字資料，並且常常忽略影響市場波動的細微差別。本文介紹一種先進的方法，採用大型語言模型 (LLM) 指令，並結合基於指令的技術和量化低秩適應 (QLoRA) 壓縮進行微調。我們的技術整合了「基本因素」，例如財務指標成長和收益紀錄，以及「外部因素」，包括近期市場指數表現和分析師評級，以建立一個豐富的監督式資料集。這個全面的資料集讓我們的模型在準確度、加權 F1 和馬修斯相關係數 (MCC) 方面，達到優異的預測效能，特別是在與 GPT-4 等基準進行比較時，更為明顯。我們特別強調 llama-3-8b-Instruct-4bit 模型的效能，它展示出比基準模型有顯著的進步。本文也探討了將輸出能力擴展到包含「持有」選項，並延伸預測範圍的可能性，旨在容納各種投資風格和時間框架。本研究不僅展示了整合尖端 AI 與微調財務資料的力量，也為未來增強 AI 驅動的財務分析工具的研究鋪路。", "author": "Haowei Ni et.al.", "authors": "Haowei Ni, Shuchen Meng, Xupeng Chen, Ziqing Zhao, Andi Chen, Panfeng Li, Shiyao Zhang, Qifu Yin, Yuanqing Wang, Yuxi Chan", "id": "2408.06634v1", "paper_url": "http://arxiv.org/abs/2408.06634v1", "repo": "null"}}