{"2412.07273": {"publish_time": "2024-12-10", "title": "Temporal-Aware Evaluation and Learning for Temporal Graph Neural Networks", "paper_summary": "Temporal Graph Neural Networks (TGNNs) are a family of graph neural networks\ndesigned to model and learn dynamic information from temporal graphs. Given\ntheir substantial empirical success, there is an escalating interest in TGNNs\nwithin the research community. However, the majority of these efforts have been\nchannelled towards algorithm and system design, with the evaluation metrics\nreceiving comparatively less attention. Effective evaluation metrics are\ncrucial for providing detailed performance insights, particularly in the\ntemporal domain. This paper investigates the commonly used evaluation metrics\nfor TGNNs and illustrates the failure mechanisms of these metrics in capturing\nessential temporal structures in the predictive behaviour of TGNNs. We provide\na mathematical formulation of existing performance metrics and utilize an\ninstance-based study to underscore their inadequacies in identifying volatility\nclustering (the occurrence of emerging errors within a brief interval). This\nphenomenon has profound implications for both algorithm and system design in\nthe temporal domain. To address this deficiency, we introduce a new\nvolatility-aware evaluation metric (termed volatility cluster statistics),\ndesigned for a more refined analysis of model temporal performance.\nAdditionally, we demonstrate how this metric can serve as a\ntemporal-volatility-aware training objective to alleviate the clustering of\ntemporal errors. Through comprehensive experiments on various TGNN models, we\nvalidate our analysis and the proposed approach. The empirical results offer\nrevealing insights: 1) existing TGNNs are prone to making errors with\nvolatility clustering, and 2) TGNNs with different mechanisms to capture\ntemporal information exhibit distinct volatility clustering patterns. Our\nempirical findings demonstrate that our proposed training objective effectively\nreduces volatility clusters in error.", "paper_summary_zh": "時序圖神經網路 (TGNN) 是一系列圖神經網路，旨在建模和學習時序圖中的動態資訊。由於其顯著的實證成功，研究社群對 TGNN 的興趣與日俱增。然而，這些努力大多集中在演算法和系統設計上，評估指標相對較少受到關注。有效的評估指標對於提供詳細的效能見解至關重要，特別是在時序領域。本文探討了 TGNN 常用的評估指標，並說明了這些指標在捕捉 TGNN 預測行為中基本時序結構時的失效機制。我們提供了現有效能指標的數學公式，並利用基於實例的研究來強調它們在識別波動性叢集（在短時間內出現新興錯誤）方面的不足。這種現象對時序領域中的演算法和系統設計都有深遠的影響。為了解決這個缺陷，我們引入了一個新的波動性感知評估指標（稱為波動性叢集統計），旨在更精細地分析模型時序效能。此外，我們展示了此指標如何作為時序波動感知訓練目標，以減輕時序錯誤的叢集。透過對各種 TGNN 模型進行全面的實驗，我們驗證了我們的分析和提出的方法。實證結果提供了有啟發性的見解：1) 現有的 TGNN 容易產生具有波動性叢集的錯誤，以及 2) 具有不同機制來捕捉時序資訊的 TGNN 展現出不同的波動性叢集模式。我們的實證結果證明了我們提出的訓練目標有效地減少了錯誤中的波動性叢集。", "author": "Junwei Su et.al.", "authors": "Junwei Su, Shan Wu", "id": "2412.07273v1", "paper_url": "http://arxiv.org/abs/2412.07273v1", "repo": "null"}}