{"2406.19686": {"publish_time": "2024-06-28", "title": "Enhancing Radiological Diagnosis: A Collaborative Approach Integrating AI and Human Expertise for Visual Miss Correction", "paper_summary": "Human-AI collaboration to identify and correct perceptual errors in chest\nradiographs has not been previously explored. This study aimed to develop a\ncollaborative AI system, CoRaX, which integrates eye gaze data and radiology\nreports to enhance diagnostic accuracy in chest radiology by pinpointing\nperceptual errors and refining the decision-making process. Using public\ndatasets REFLACX and EGD-CXR, the study retrospectively developed CoRaX,\nemploying a large multimodal model to analyze image embeddings, eye gaze data,\nand radiology reports. The system's effectiveness was evaluated based on its\nreferral-making process, the quality of referrals, and performance in\ncollaborative diagnostic settings. CoRaX was tested on a simulated error\ndataset of 271 samples with 28% (93 of 332) missed abnormalities. The system\ncorrected 21% (71 of 332) of these errors, leaving 7% (22 of 312) unresolved.\nThe Referral-Usefulness score, indicating the accuracy of predicted regions for\nall true referrals, was 0.63 (95% CI 0.59, 0.68). The Total-Usefulness score,\nreflecting the diagnostic accuracy of CoRaX's interactions with radiologists,\nshowed that 84% (237 of 280) of these interactions had a score above 0.40. In\nconclusion, CoRaX efficiently collaborates with radiologists to address\nperceptual errors across various abnormalities, with potential applications in\nthe education and training of novice radiologists.", "paper_summary_zh": "人類與 AI 合作識別並修正胸部 X 光檢查中的感知錯誤，這在過去尚未被探討過。本研究旨在開發一套協作式 AI 系統 CoRaX，它整合了視線注視資料和放射科報告，藉由找出感知錯誤並改善決策流程，以提升胸部放射科的診斷準確度。本研究使用公開的資料集 REFLACX 和 EGD-CXR，回溯式地開發出 CoRaX，並採用大型的多模態模型來分析影像嵌入、視線注視資料和放射科報告。該系統的有效性是根據其轉診流程、轉診品質和協作診斷設定中的表現來評估。CoRaX 在一套模擬錯誤的資料集上進行測試，該資料集包含 271 個樣本，其中有 28%（332 個中的 93 個）漏失異常。系統修正了其中 21%（332 個中的 71 個）的錯誤，留下 7%（312 個中的 22 個）未解決。轉診實用性分數表示所有真正轉診預測區域的準確性，為 0.63（95% CI 0.59、0.68）。總實用性分數反映 CoRaX 與放射科醫師互動的診斷準確性，顯示這些互動中有 84%（280 個中的 237 個）的分數高於 0.40。結論是，CoRaX 能有效地與放射科醫師合作，處理各種異常的感知錯誤，並具有在新手放射科醫師的教育和訓練中應用的潛力。", "author": "Akash Awasthi et.al.", "authors": "Akash Awasthi, Ngan Le, Zhigang Deng, Carol C. Wu, Hien Van Nguyen", "id": "2406.19686v1", "paper_url": "http://arxiv.org/abs/2406.19686v1", "repo": "null"}}