{"2410.01227": {"publish_time": "2024-10-02", "title": "See Me and Believe Me: Causality and Intersectionality in Testimonial Injustice in Healthcare", "paper_summary": "In medical settings, it is critical that all who are in need of care are\ncorrectly heard and understood. When this is not the case due to prejudices a\nlistener has, the speaker is experiencing \\emph{testimonial injustice}, which,\nbuilding upon recent work, we quantify by the presence of several categories of\nunjust vocabulary in medical notes. In this paper, we use FCI, a causal\ndiscovery method, to study the degree to which certain demographic features\ncould lead to marginalization (e.g., age, gender, and race) by way of\ncontributing to testimonial injustice. To achieve this, we review physicians'\nnotes for each patient, where we identify occurrences of unjust vocabulary,\nalong with the demographic features present, and use causal discovery to build\na Structural Causal Model (SCM) relating those demographic features to\ntestimonial injustice. We analyze and discuss the resulting SCMs to show the\ninteraction of these factors and how they influence the experience of\ninjustice. Despite the potential presence of some confounding variables, we\nobserve how one contributing feature can make a person more prone to\nexperiencing another contributor of testimonial injustice. There is no single\nroot of injustice and thus intersectionality cannot be ignored. These results\ncall for considering more than singular or equalized attributes of who a person\nis when analyzing and improving their experiences of bias and injustice. This\nwork is thus a first foray at using causal discovery to understand the nuanced\nexperiences of patients in medical settings, and its insights could be used to\nguide design principles throughout healthcare, to build trust and promote\nbetter patient care.", "paper_summary_zh": "在醫療場景中，所有需要照護的人都能被正確地聆聽和理解至關重要。當這因為聽者的偏見而無法發生時，說話者便會經歷「見證不正義」，而我們根據近期的研究，透過醫療紀錄中出現的不公正詞彙類別來量化見證不正義。在本文中，我們使用因果發現方法 FCI 來研究某些人口特徵可能透過促成見證不正義，進而導致邊緣化（例如年齡、性別和種族）的程度。為達成此目的，我們檢視每位病患的醫師紀錄，找出不公正詞彙出現的時機以及存在的人口特徵，並使用因果發現建立結構因果模型 (SCM)，將這些人口特徵與見證不正義關聯起來。我們分析並討論產生的 SCM，以顯示這些因素的交互作用，以及它們如何影響不正義的體驗。儘管存在一些潛在的混淆變因，我們觀察到一個促成因素如何讓一個人更容易經歷另一個見證不正義的促成因素。不正義沒有單一根源，因此無法忽視交叉性。這些結果呼籲在分析和改善人們的偏見和不正義體驗時，考量的不只是個人的單一或平等屬性。因此，這項研究是使用因果發現來了解醫療場景中病患細微體驗的首次嘗試，而其見解可用於引導整個醫療保健的設計原則，建立信任並促進更好的病患照護。", "author": "Kenya S. Andrews et.al.", "authors": "Kenya S. Andrews, Mesrob I. Ohannessian, Elena Zheleva", "id": "2410.01227v1", "paper_url": "http://arxiv.org/abs/2410.01227v1", "repo": "null"}}