{"2411.16679": {"publish_time": "2024-11-25", "title": "Do Large Language Models Perform Latent Multi-Hop Reasoning without Exploiting Shortcuts?", "paper_summary": "We evaluate how well Large Language Models (LLMs) latently recall and compose\nfacts to answer multi-hop queries like \"In the year Scarlett Johansson was\nborn, the Summer Olympics were hosted in the country of\". One major challenge\nin evaluating this ability is that LLMs may have developed shortcuts by\nencounters of the head entity \"Scarlett Johansson\" and the answer entity\n\"United States\" in the same training sequences or merely guess the answer based\non frequency-based priors. To prevent shortcuts, we exclude test queries where\nthe head and answer entities co-appear in pretraining corpora. Through careful\nselection of relations and facts and systematic removal of cases where models\nmight guess answers or exploit partial matches, we construct an evaluation\ndataset SOCRATES (ShOrtCut-fRee lATent rEaSoning). We observe that LLMs\ndemonstrate promising latent multi-hop reasoning abilities without exploiting\nshortcuts, but only for certain types of queries. For queries requiring latent\nrecall of countries as the intermediate answer, the best models achieve 80%\nlatent composability, but this drops to just 5% for the recall of years.\nComparisons with Chain-of-Thought composability highlight a significant gap\nbetween the ability of models to reason latently versus explicitly. Analysis\nreveals that latent representations of the intermediate answer are constructed\nmore often in queries with higher latent composability, and shows the emergence\nof latent multi-hop reasoning during pretraining.", "paper_summary_zh": "我們評估大型語言模型 (LLM) 在潛在回憶和組合事實方面表現如何，以回答多重跳躍查詢，例如「史嘉蕾喬韓森出生的那一年，夏季奧運會在國家舉辦」。評估此能力的一項重大挑戰在於，LLM 可能透過在相同的訓練序列中遭遇頭部實體「史嘉蕾喬韓森」和答案實體「美國」而開發出捷徑，或僅根據基於頻率的先驗猜測答案。為了防止捷徑，我們排除了頭部和答案實體在預訓練語料庫中共同出現的測試查詢。透過仔細選擇關係和事實，並系統性地移除模型可能猜測答案或利用部分匹配的案例，我們建構了一個評估資料集 SOCRATES（ShOrtCut-fRee lATent rEaSoning）。我們觀察到，LLM 在不利用捷徑的情況下展現出潛在的多重跳躍推理能力，但僅限於特定類型的查詢。對於需要潛在回憶國家作為中間答案的查詢，最佳模型達到 80% 的潛在可組合性，但這對於回憶年份來說僅下降到 5%。與思考鏈可組合性的比較突顯了模型潛在推理與明確推理能力之間的顯著差距。分析顯示，在潛在可組合性較高的查詢中，中間答案的潛在表示更常被建構，並顯示在預訓練期間出現潛在的多重跳躍推理。", "author": "Sohee Yang et.al.", "authors": "Sohee Yang, Nora Kassner, Elena Gribovskaya, Sebastian Riedel, Mor Geva", "id": "2411.16679v1", "paper_url": "http://arxiv.org/abs/2411.16679v1", "repo": "null"}}