{"2410.07908": {"publish_time": "2024-10-10", "title": "ONCOPILOT: A Promptable CT Foundation Model For Solid Tumor Evaluation", "paper_summary": "Carcinogenesis is a proteiform phenomenon, with tumors emerging in various\nlocations and displaying complex, diverse shapes. At the crucial intersection\nof research and clinical practice, it demands precise and flexible assessment.\nHowever, current biomarkers, such as RECIST 1.1's long and short axis\nmeasurements, fall short of capturing this complexity, offering an approximate\nestimate of tumor burden and a simplistic representation of a more intricate\nprocess. Additionally, existing supervised AI models face challenges in\naddressing the variability in tumor presentations, limiting their clinical\nutility. These limitations arise from the scarcity of annotations and the\nmodels' focus on narrowly defined tasks.\n  To address these challenges, we developed ONCOPILOT, an interactive\nradiological foundation model trained on approximately 7,500 CT scans covering\nthe whole body, from both normal anatomy and a wide range of oncological cases.\nONCOPILOT performs 3D tumor segmentation using visual prompts like point-click\nand bounding boxes, outperforming state-of-the-art models (e.g., nnUnet) and\nachieving radiologist-level accuracy in RECIST 1.1 measurements. The key\nadvantage of this foundation model is its ability to surpass state-of-the-art\nperformance while keeping the radiologist in the loop, a capability that\nprevious models could not achieve. When radiologists interactively refine the\nsegmentations, accuracy improves further. ONCOPILOT also accelerates\nmeasurement processes and reduces inter-reader variability, facilitating\nvolumetric analysis and unlocking new biomarkers for deeper insights.\n  This AI assistant is expected to enhance the precision of RECIST 1.1\nmeasurements, unlock the potential of volumetric biomarkers, and improve\npatient stratification and clinical care, while seamlessly integrating into the\nradiological workflow.", "paper_summary_zh": "<paragraph>致癌作用是一種變形現象，腫瘤出現在各種位置，並呈現出複雜多樣的形狀。在研究和臨床實務的重要交會點，它需要精確且彈性的評估。然而，目前的生物標記，例如 RECIST 1.1 的長軸和短軸測量，並無法捕捉到這種複雜性，只能提供腫瘤負擔的近似估計，以及對更複雜過程的簡化表示。此外，現有的監督式 AI 模型在處理腫瘤表現的可變性時面臨挑戰，限制了它們的臨床效用。這些限制來自於註解的稀少性，以及模型專注於狹義定義的任務。\n為了應對這些挑戰，我們開發了 ONCOPILOT，這是一個互動式放射學基礎模型，訓練於涵蓋全身的約 7,500 個電腦斷層掃描，包括正常解剖結構和廣泛的腫瘤病例。ONCOPILOT 使用視覺提示（例如點選和邊界框）執行 3D 腫瘤分割，優於最先進的模型（例如 nnUnet），並在 RECIST 1.1 測量中達到放射科醫師等級的準確度。這個基礎模型的主要優點是它能夠超越最先進的效能，同時讓放射科醫師參與其中，這是以前的模型無法達到的功能。當放射科醫師互動式地優化分割時，準確度會進一步提高。ONCOPILOT 還加速了測量過程，並減少了讀者間的變異性，促进了體積分析，並解鎖了新的生物標記，以獲得更深入的見解。\n預計這個 AI 助理將提高 RECIST 1.1 測量的準確度，釋放體積生物標記的潛力，並改善患者分層和臨床照護，同時無縫整合到放射學工作流程中。</paragraph>", "author": "Léo Machado et.al.", "authors": "Léo Machado, Hélène Philippe, Élodie Ferreres, Julien Khlaut, Julie Dupuis, Korentin Le Floch, Denis Habip Gatenyo, Pascal Roux, Jules Grégory, Maxime Ronot, Corentin Dancette, Daniel Tordjman, Pierre Manceron, Paul Hérent", "id": "2410.07908v1", "paper_url": "http://arxiv.org/abs/2410.07908v1", "repo": "null"}}