{"2405.09794": {"publish_time": "2024-05-16", "title": "Human-AI Safety: A Descendant of Generative AI and Control Systems Safety", "paper_summary": "Generative artificial intelligence (AI) is interacting with people at an\nunprecedented scale, offering new avenues for immense positive impact, but also\nraising widespread concerns around the potential for individual and societal\nharm. Today, the predominant paradigm for human-AI safety focuses on\nfine-tuning the generative model's outputs to better agree with human-provided\nexamples or feedback. In reality, however, the consequences of an AI model's\noutputs cannot be determined in an isolated context: they are tightly entangled\nwith the responses and behavior of human users over time. In this position\npaper, we argue that meaningful safety assurances for these AI technologies can\nonly be achieved by reasoning about how the feedback loop formed by the AI's\noutputs and human behavior may drive the interaction towards different\noutcomes. To this end, we envision a high-value window of opportunity to bridge\nthe rapidly growing capabilities of generative AI and the dynamical safety\nframeworks from control theory, laying a new foundation for human-centered AI\nsafety in the coming decades.", "paper_summary_zh": "生成式人工智慧 (AI) 正以前所未有的規模與人類互動，為帶來巨大正面影響提供了新途徑，但也對個人和社會潛在危害引發了廣泛的擔憂。當今，人類與人工智慧安全的主要模式著重於微調生成模型的輸出，以更好地符合人類提供的範例或回饋。然而，在現實中，人工智慧模型輸出的後果無法在孤立的環境中確定：它們與人類使用者的回應和行為緊密交織。在本文中，我們認為對這些人工智慧技術有意義的安全保證只能透過推理人工智慧輸出和人類行為形成的回饋迴路如何驅動互動走向不同的結果來實現。為此，我們預見了一個高價值的機會之窗，可以彌合生成式人工智慧快速增長的機能和控制理論中的動態安全架構，為未來數十年以人類為中心的人工智慧安全奠定新的基礎。", "author": "Andrea Bajcsy et.al.", "authors": "Andrea Bajcsy, Jaime F. Fisac", "id": "2405.09794v1", "paper_url": "http://arxiv.org/abs/2405.09794v1", "repo": "null"}}