{"2410.10802": {"publish_time": "2024-10-14", "title": "Boosting Camera Motion Control for Video Diffusion Transformers", "paper_summary": "Recent advancements in diffusion models have significantly enhanced the\nquality of video generation. However, fine-grained control over camera pose\nremains a challenge. While U-Net-based models have shown promising results for\ncamera control, transformer-based diffusion models (DiT)-the preferred\narchitecture for large-scale video generation - suffer from severe degradation\nin camera motion accuracy. In this paper, we investigate the underlying causes\nof this issue and propose solutions tailored to DiT architectures. Our study\nreveals that camera control performance depends heavily on the choice of\nconditioning methods rather than camera pose representations that is commonly\nbelieved. To address the persistent motion degradation in DiT, we introduce\nCamera Motion Guidance (CMG), based on classifier-free guidance, which boosts\ncamera control by over 400%. Additionally, we present a sparse camera control\npipeline, significantly simplifying the process of specifying camera poses for\nlong videos. Our method universally applies to both U-Net and DiT models,\noffering improved camera control for video generation tasks.", "paper_summary_zh": "最近在扩散模型上的进步已经显著提升了视频生成的质量。然而，对摄像机姿势的精细控制仍然是一个挑战。虽然基于 U-Net 的模型在摄像机控制方面显示出了有希望的结果，但基于 transformer 的扩散模型 (DiT) - 用于大规模视频生成的首选架构 - 在摄像机运动准确性方面遭受严重的下降。在本文中，我们调查了这个问题的根本原因，并提出了针对 DiT 架构的解决方案。我们的研究表明，摄像机控制性能很大程度上取决于调节方法的选择，而不是通常认为的摄像机姿势表示。为了解决 DiT 中持续的运动退化问题，我们引入了基于无分类器引导的摄像机运动引导 (CMG)，它将摄像机控制提升了 400% 以上。此外，我们提出了一个稀疏摄像机控制管道，极大地简化了为长视频指定摄像机姿势的过程。我们的方法普遍适用于 U-Net 和 DiT 模型，为视频生成任务提供了改进的摄像机控制。", "author": "Soon Yau Cheong et.al.", "authors": "Soon Yau Cheong, Duygu Ceylan, Armin Mustafa, Andrew Gilbert, Chun-Hao Paul Huang", "id": "2410.10802v1", "paper_url": "http://arxiv.org/abs/2410.10802v1", "repo": "null"}}