{"2405.16879": {"publish_time": "2024-05-27", "title": "Unsupervised Generative Feature Transformation via Graph Contrastive Pre-training and Multi-objective Fine-tuning", "paper_summary": "Feature transformation is to derive a new feature set from original features\nto augment the AI power of data. In many science domains such as material\nperformance screening, while feature transformation can model material formula\ninteractions and compositions and discover performance drivers, supervised\nlabels are collected from expensive and lengthy experiments. This issue\nmotivates an Unsupervised Feature Transformation Learning (UFTL) problem. Prior\nliterature, such as manual transformation, supervised feedback guided search,\nand PCA, either relies on domain knowledge or expensive supervised feedback, or\nsuffers from large search space, or overlooks non-linear feature-feature\ninteractions. UFTL imposes a major challenge on existing methods: how to design\na new unsupervised paradigm that captures complex feature interactions and\navoids large search space? To fill this gap, we connect graph, contrastive, and\ngenerative learning to develop a measurement-pretrain-finetune paradigm for\nUFTL. For unsupervised feature set utility measurement, we propose a feature\nvalue consistency preservation perspective and develop a mean discounted\ncumulative gain like unsupervised metric to evaluate feature set utility. For\nunsupervised feature set representation pretraining, we regard a feature set as\na feature-feature interaction graph, and develop an unsupervised graph\ncontrastive learning encoder to embed feature sets into vectors. For generative\ntransformation finetuning, we regard a feature set as a feature cross sequence\nand feature transformation as sequential generation. We develop a deep\ngenerative feature transformation model that coordinates the pretrained feature\nset encoder and the gradient information extracted from a feature set utility\nevaluator to optimize a transformed feature generator.", "paper_summary_zh": "特徵轉換是從原始特徵中衍生一套新的特徵，以增強資料的 AI 能力。在許多科學領域中，例如材料效能篩選，特徵轉換可以建模材料配方交互作用和組成，並找出效能驅動因素，但監督標籤是從昂貴且漫長的實驗中收集而來的。此問題促成了無監督特徵轉換學習 (UFTL) 問題。先前的文獻，例如手動轉換、監督回饋引導搜尋和 PCA，依賴於領域知識或昂貴的監督回饋，或因搜尋空間過大而受苦，或忽略非線性特徵與特徵之間的交互作用。UFTL 對現有方法提出了重大挑戰：如何設計一個新的無監督範例，以捕捉複雜的特徵交互作用並避免大的搜尋空間？為了解決這個問題，我們將圖形、對比和生成式學習聯繫起來，為 UFTL 開發一個測量預訓練微調範例。對於無監督特徵集效用測量，我們提出特徵值一致性保存觀點，並開發一個類似於無監督指標的平均折現累積增益，以評估特徵集效用。對於無監督特徵集表示預訓練，我們將特徵集視為特徵與特徵交互作用圖，並開發一個無監督圖形對比學習編碼器，將特徵集嵌入到向量中。對於生成式轉換微調，我們將特徵集視為特徵交叉序列，並將特徵轉換視為序列生成。我們開發了一個深度生成式特徵轉換模型，該模型協調預訓練的特徵集編碼器和從特徵集效用評估器中提取的梯度資訊，以最佳化轉換的特徵產生器。", "author": "Wangyang Ying et.al.", "authors": "Wangyang Ying, Dongjie Wang, Xuanming Hu, Yuanchun Zhou, Charu C. Aggarwal, Yanjie Fu", "id": "2405.16879v1", "paper_url": "http://arxiv.org/abs/2405.16879v1", "repo": "null"}}