{"2410.17735": {"publish_time": "2024-10-23", "title": "New Insight in Cervical Cancer Diagnosis Using Convolution Neural Network Architecture", "paper_summary": "The Pap smear is a screening method for early cervical cancer diagnosis. The\nselection of the right optimizer in the convolutional neural network (CNN)\nmodel is key to the success of the CNN in image classification, including the\nclassification of cervical cancer Pap smear images. In this study, stochastic\ngradient descent (SGD), RMSprop, Adam, AdaGrad, AdaDelta, Adamax, and Nadam\noptimizers were used to classify cervical cancer Pap smear images from the\nSipakMed dataset. Resnet-18, Resnet-34, and VGG-16 are the CNN architectures\nused in this study, and each architecture uses a transfer-learning model. Based\non the test results, we conclude that the transfer learning model performs\nbetter on all CNNs and optimization techniques and that in the transfer\nlearning model, the optimization has little influence on the training of the\nmodel. Adamax, with accuracy values of 72.8% and 66.8%, had the best accuracy\nfor the VGG-16 and Resnet-18 architectures, respectively. Resnet-34 had 54.0%.\nThis is 0.034% lower than Nadam. Overall, Adamax is a suitable optimizer for\nCNN in cervical cancer classification on Resnet-18, Resnet-34, and VGG-16\narchitectures. This study provides new insights into the configuration of CNN\nmodels for Pap smear image analysis.", "paper_summary_zh": "子宮頸抹片檢查是早期子宮頸癌診斷的篩檢方法。在卷積神經網路 (CNN) 模型中選擇正確的最佳化器是 CNN 在影像分類中成功的關鍵，包括子宮頸抹片檢查影像的分類。在這項研究中，隨機梯度下降 (SGD)、RMSprop、Adam、AdaGrad、AdaDelta、Adamax 和 Nadam 最佳化器用於從 SipakMed 資料集分類子宮頸抹片檢查影像。Resnet-18、Resnet-34 和 VGG-16 是本研究中使用的 CNN 架構，每個架構都使用遷移學習模型。根據測試結果，我們得出結論，遷移學習模型在所有 CNN 和最佳化技術上表現得更好，並且在遷移學習模型中，最佳化對模型的訓練影響不大。Adamax，準確度值分別為 72.8% 和 66.8%，在 VGG-16 和 Resnet-18 架構中具有最佳準確度。Resnet-34 為 54.0%。這比 Nadam 低 0.034%。總體而言，Adamax 是 Resnet-18、Resnet-34 和 VGG-16 架構中子宮頸癌分類中 CNN 的合適最佳化器。這項研究為子宮頸抹片檢查影像分析的 CNN 模型配置提供了新的見解。", "author": "Ach. Khozaimi et.al.", "authors": "Ach. Khozaimi, Wayan Firdaus Mahmudy", "id": "2410.17735v1", "paper_url": "http://arxiv.org/abs/2410.17735v1", "repo": "null"}}