{"2504.02458": {"publish_time": "2025-04-03", "title": "Retrieval-Augmented Purifier for Robust LLM-Empowered Recommendation", "paper_summary": "Recently, Large Language Model (LLM)-empowered recommender systems have\nrevolutionized personalized recommendation frameworks and attracted extensive\nattention. Despite the remarkable success, existing LLM-empowered RecSys have\nbeen demonstrated to be highly vulnerable to minor perturbations. To mitigate\nthe negative impact of such vulnerabilities, one potential solution is to\nemploy collaborative signals based on item-item co-occurrence to purify the\nmalicious collaborative knowledge from the user's historical interactions\ninserted by attackers. On the other hand, due to the capabilities to expand\ninsufficient internal knowledge of LLMs, Retrieval-Augmented Generation (RAG)\ntechniques provide unprecedented opportunities to enhance the robustness of\nLLM-empowered recommender systems by introducing external collaborative\nknowledge. Therefore, in this paper, we propose a novel framework (RETURN) by\nretrieving external collaborative signals to purify the poisoned user profiles\nand enhance the robustness of LLM-empowered RecSys in a plug-and-play manner.\nSpecifically, retrieval-augmented perturbation positioning is proposed to\nidentify potential perturbations within the users' historical sequences by\nretrieving external knowledge from collaborative item graphs. After that, we\nfurther retrieve the collaborative knowledge to cleanse the perturbations by\nusing either deletion or replacement strategies and introduce a robust ensemble\nrecommendation strategy to generate final robust predictions. Extensive\nexperiments on three real-world datasets demonstrate the effectiveness of the\nproposed RETURN.", "paper_summary_zh": "<paragraph>近年來，大型語言模型 (LLM) 賦能的推薦系統徹底改變了個人化推薦框架，並引起了廣泛關注。儘管取得了顯著的成功，但現有的 LLM 賦能的推薦系統已被證明非常容易受到輕微擾動的影響。為了減輕此類漏洞的負面影響，一種可能的解決方案是利用基於項目共現的協同訊號，從攻擊者插入的用戶歷史互動中淨化惡意協同知識。另一方面，由於能夠擴展 LLM 不足的內部知識，檢索增強生成 (RAG) 技術通過引入外部協同知識，為增強 LLM 賦能推薦系統的穩健性提供了前所未有的機會。因此，在本文中，我們提出了一個新的框架 (RETURN)，透過檢索外部協同訊號來淨化中毒的用戶配置文件，並以即插即用的方式增強 LLM 賦能推薦系統的穩健性。具體來說，我們提出了檢索增強擾動定位，透過從協同項目圖中檢索外部知識來識別用戶歷史序列中的潛在擾動。之後，我們進一步檢索協同知識，透過使用刪除或替換策略來清除擾動，並引入穩健的集成推薦策略來生成最終的穩健預測。在三個真實世界數據集上的大量實驗證明了所提出的 RETURN 的有效性。</paragraph>\n", "author": "Liangbo Ning et.al.", "authors": "Liangbo Ning, Wenqi Fan, Qing Li", "id": "2504.02458v1", "paper_url": "http://arxiv.org/abs/2504.02458v1", "repo": "null"}}