{"2502.11741": {"publish_time": "2025-02-17", "title": "SQL-o1: A Self-Reward Heuristic Dynamic Search Method for Text-to-SQL", "paper_summary": "The Text-to-SQL(Text2SQL) task aims to convert natural language queries into\nexecutable SQL queries. Thanks to the application of large language models\n(LLMs), significant progress has been made in this field. However, challenges\nsuch as model scalability, limited generation space, and coherence issues in\nSQL generation still persist. To address these issues, we propose SQL-o1, a\nSelf-Reward-based heuristic search method designed to enhance the reasoning\nability of LLMs in SQL query generation. SQL-o1 combines Monte Carlo Tree\nSearch (MCTS) for heuristic process-level search and constructs a Schema-Aware\ndataset to help the model better understand database schemas. Extensive\nexperiments on the Bird and Spider datasets demonstrate that SQL-o1 improves\nexecution accuracy by 10.8\\% on the complex Bird dataset compared to the latest\nbaseline methods, even outperforming GPT-4-based approaches. Additionally,\nSQL-o1 excels in few-shot learning scenarios and shows strong cross-model\ntransferability. Our code is publicly available\nat:https://github.com/ShuaiLyu0110/SQL-o1.", "paper_summary_zh": "文本转 SQL（Text2SQL）任务旨在将自然语言查询转换为可执行的 SQL 查询。得益于大型语言模型（LLM）的应用，该领域取得了显著进展。然而，模型可扩展性、生成空间受限和 SQL 生成的连贯性问题等挑战仍然存在。为了解决这些问题，我们提出了 SQL-o1，这是一种基于自我奖励的启发式搜索方法，旨在增强 LLM 在 SQL 查询生成中的推理能力。SQL-o1 结合了蒙特卡罗树搜索（MCTS）用于启发式过程级搜索，并构建了一个模式感知数据集，以帮助模型更好地理解数据库模式。在 Bird 和 Spider 数据集上的大量实验表明，与最新的基准方法相比，SQL-o1 将复杂 Bird 数据集上的执行准确率提高了 10.8%，甚至优于基于 GPT-4 的方法。此外，SQL-o1 在少样本学习场景中表现出色，并显示出强大的跨模型可迁移性。我们的代码已公开发布在：https://github.com/ShuaiLyu0110/SQL-o1。", "author": "Shuai Lyu et.al.", "authors": "Shuai Lyu, Haoran Luo, Zhonghong Ou, Yifan Zhu, Xiaoran Shang, Yang Qin, Meina Song", "id": "2502.11741v1", "paper_url": "http://arxiv.org/abs/2502.11741v1", "repo": "null"}}