{"2405.10745": {"publish_time": "2024-05-17", "title": "Empowering Small-Scale Knowledge Graphs: A Strategy of Leveraging General-Purpose Knowledge Graphs for Enriched Embeddings", "paper_summary": "Knowledge-intensive tasks pose a significant challenge for Machine Learning\n(ML) techniques. Commonly adopted methods, such as Large Language Models\n(LLMs), often exhibit limitations when applied to such tasks. Nevertheless,\nthere have been notable endeavours to mitigate these challenges, with a\nsignificant emphasis on augmenting LLMs through Knowledge Graphs (KGs). While\nKGs provide many advantages for representing knowledge, their development costs\ncan deter extensive research and applications. Addressing this limitation, we\nintroduce a framework for enriching embeddings of small-scale domain-specific\nKnowledge Graphs with well-established general-purpose KGs. Adopting our\nmethod, a modest domain-specific KG can benefit from a performance boost in\ndownstream tasks when linked to a substantial general-purpose KG. Experimental\nevaluations demonstrate a notable enhancement, with up to a 44% increase\nobserved in the Hits@10 metric. This relatively unexplored research direction\ncan catalyze more frequent incorporation of KGs in knowledge-intensive tasks,\nresulting in more robust, reliable ML implementations, which hallucinates less\nthan prevalent LLM solutions.\n  Keywords: knowledge graph, knowledge graph completion, entity alignment,\nrepresentation learning, machine learning", "paper_summary_zh": "知識密集型任務對機器學習 (ML) 技術構成重大挑戰。常見採用的方法，例如大型語言模型 (LLM)，在應用於此類任務時，通常會表現出限制。儘管如此，已經有顯著的努力來減輕這些挑戰，重點在於透過知識圖譜 (KG) 來擴充 LLM。雖然 KG 在表示知識方面提供了許多優點，但其開發成本可能會阻礙廣泛的研究和應用。為了解決這個限制，我們引入了一個架構，用完善的通用 KG 來豐富小規模特定領域知識圖譜的嵌入。採用我們的這個方法，一個適度的特定領域 KG 可以從與一個大量的通用 KG 連結時，在下游任務中受益於效能提升。實驗評估證明了顯著的改進，在 Hits@10 指標中觀察到高達 44% 的提升。這個相對未開發的研究方向可以催化在知識密集型任務中更頻繁地納入 KG，從而產生更強大、更可靠的 ML 實作，其產生的幻覺少於普遍的 LLM 解决方案。\n關鍵字：知識圖譜、知識圖譜完成功能、實體對齊、表示學習、機器學習", "author": "Albert Sawczyn et.al.", "authors": "Albert Sawczyn, Jakub Binkowski, Piotr Bielak, Tomasz Kajdanowicz", "id": "2405.10745v1", "paper_url": "http://arxiv.org/abs/2405.10745v1", "repo": "null"}}