{"2407.03104": {"publish_time": "2024-07-03", "title": "KeyVideoLLM: Towards Large-scale Video Keyframe Selection", "paper_summary": "Recently, with the rise of web videos, managing and understanding large-scale\nvideo datasets has become increasingly important. Video Large Language Models\n(VideoLLMs) have emerged in recent years due to their strong video\nunderstanding capabilities. However, training and inference processes for\nVideoLLMs demand vast amounts of data, presenting significant challenges to\ndata management, particularly regarding efficiency, robustness, and\neffectiveness. In this work, we present KeyVideoLLM, a text-video frame\nsimilarity-based keyframe selection method designed to manage VideoLLM data\nefficiently, robustly, and effectively. Specifically, KeyVideoLLM achieves a\nremarkable data compression rate of up to 60.9 times, substantially lowering\ndisk space requirements, which proves its high efficiency. Additionally, it\nmaintains a 100% selection success rate across all video formats and scales,\nenhances processing speed by up to 200 times compared to existing keyframe\nselection methods, and does not require hyperparameter tuning. Beyond its\noutstanding efficiency and robustness, KeyVideoLLM further improves model\nperformance in video question-answering tasks during both training and\ninference stages. Notably, it consistently achieved the state-of-the-art (SoTA)\nexperimental results on diverse datasets.", "paper_summary_zh": "<paragraph>最近，随着网络视频的兴起，管理和理解大规模视频数据集变得越来越重要。视频大语言模型 (VideoLLM) 近年来因其强大的视频理解能力而兴起。然而，VideoLLM 的训练和推理过程需要大量数据，对数据管理提出了重大挑战，尤其是在效率、鲁棒性和有效性方面。在这项工作中，我们提出了 KeyVideoLLM，这是一种基于文本-视频帧相似性的关键帧选择方法，旨在高效、鲁棒且有效地管理 VideoLLM 数据。具体来说，KeyVideoLLM 实现了高达 60.9 倍的显着数据压缩率，大幅降低了磁盘空间需求，这证明了其高效率。此外，它在所有视频格式和规模上保持 100% 的选择成功率，与现有的关键帧选择方法相比，处理速度提高了 200 倍，并且不需要超参数调整。除了出色的效率和鲁棒性之外，KeyVideoLLM 还在训练和推理阶段进一步提高了模型在视频问答任务中的性能。值得注意的是，它在不同的数据集上持续取得了最先进 (SoTA) 的实验结果。</paragraph>", "author": "Hao Liang et.al.", "authors": "Hao Liang, Jiapeng Li, Tianyi Bai, Chong Chen, Conghui He, Bin Cui, Wentao Zhang", "id": "2407.03104v1", "paper_url": "http://arxiv.org/abs/2407.03104v1", "repo": "null"}}