{"2406.07288": {"publish_time": "2024-06-11", "title": "Fine-tuning with HED-IT: The impact of human post-editing for dialogical language models", "paper_summary": "Automatic methods for generating and gathering linguistic data have proven\neffective for fine-tuning Language Models (LMs) in languages less resourced\nthan English. Still, while there has been emphasis on data quantity, less\nattention has been given to its quality. In this work, we investigate the\nimpact of human intervention on machine-generated data when fine-tuning\ndialogical models. In particular, we study (1) whether post-edited dialogues\nexhibit higher perceived quality compared to the originals that were\nautomatically generated; (2) whether fine-tuning with post-edited dialogues\nresults in noticeable differences in the generated outputs; and (3) whether\npost-edited dialogues influence the outcomes when considering the parameter\nsize of the LMs. To this end we created HED-IT, a large-scale dataset where\nmachine-generated dialogues are paired with the version post-edited by humans.\nUsing both the edited and unedited portions of HED-IT, we fine-tuned three\ndifferent sizes of an LM. Results from both human and automatic evaluation show\nthat the different quality of training data is clearly perceived and it has an\nimpact also on the models trained on such data. Additionally, our findings\nindicate that larger models are less sensitive to data quality, whereas this\nhas a crucial impact on smaller models. These results enhance our comprehension\nof the impact of human intervention on training data in the development of\nhigh-quality LMs.", "paper_summary_zh": "自動化方法用於產生和收集語言資料，已被證明有效適用於調整資源少於英語的語言模型 (LM)。儘管如此，雖然強調資料數量，但對其品質的關注卻較少。在這項工作中，我們探討了在調整對話模型時，人類介入對機器產生資料的影響。具體而言，我們研究 (1) 後編輯對話是否展現出比自動產生的原始對話更高的感知品質；(2) 使用後編輯對話進行調整是否會導致產出產生明顯差異；以及 (3) 後編輯對話是否會在考量 LM 參數大小時影響結果。為此，我們建立了 HED-IT，一個大型資料集，其中機器產生的對話與人類後編輯的版本配對。使用 HED-IT 的已編輯和未編輯部分，我們微調了 LM 的三種不同大小。來自人類和自動評估的結果顯示，訓練資料的不同品質明顯被感知，並且也會影響在這些資料上訓練的模型。此外，我們的研究結果表明，較大的模型對資料品質的敏感度較低，而這對較小的模型有至關重要的影響。這些結果增強了我們對在開發高品質 LM 時，人類介入對訓練資料影響的理解。", "author": "Daniela Occhipinti et.al.", "authors": "Daniela Occhipinti, Michele Marchi, Irene Mondella, Huiyuan Lai, Felice Dell'Orletta, Malvina Nissim, Marco Guerini", "id": "2406.07288v1", "paper_url": "http://arxiv.org/abs/2406.07288v1", "repo": "null"}}