{"2408.03834": {"publish_time": "2024-08-07", "title": "Target Prompting for Information Extraction with Vision Language Model", "paper_summary": "The recent trend in the Large Vision and Language model has brought a new\nchange in how information extraction systems are built. VLMs have set a new\nbenchmark with their State-of-the-art techniques in understanding documents and\nbuilding question-answering systems across various industries. They are\nsignificantly better at generating text from document images and providing\naccurate answers to questions. However, there are still some challenges in\neffectively utilizing these models to build a precise conversational system.\nGeneral prompting techniques used with large language models are often not\nsuitable for these specially designed vision language models. The output\ngenerated by such generic input prompts is ordinary and may contain information\ngaps when compared with the actual content of the document. To obtain more\naccurate and specific answers, a well-targeted prompt is required by the vision\nlanguage model, along with the document image. In this paper, a technique is\ndiscussed called Target prompting, which focuses on explicitly targeting parts\nof document images and generating related answers from those specific regions\nonly. The paper also covers the evaluation of response for each prompting\ntechnique using different user queries and input prompts.", "paper_summary_zh": "近期大型視覺與語言模型的趨勢為資訊萃取系統的建置方式帶來了新的變化。VLMs 以其在理解文件和建立跨產業問答系統的最新技術樹立了新的基準。它們在從文件影像產生文字和提供準確的答案方面顯著地更出色。然而，在有效利用這些模型來建立精確的對話系統方面仍有一些挑戰。與大型語言模型一起使用的一般提示技術通常不適合這些特別設計的視覺語言模型。此類一般輸入提示產生的輸出很普通，與文件的實際內容相比時可能會包含資訊差距。為了獲得更準確且具體的答案，視覺語言模型需要一個明確的目標提示，以及文件影像。在本文中，討論了一種稱為目標提示的技術，其專注於明確鎖定文件影像的部分，並僅從那些特定區域產生相關答案。本文還涵蓋了使用不同的使用者查詢和輸入提示對每種提示技術的回應評估。", "author": "Dipankar Medhi et.al.", "authors": "Dipankar Medhi", "id": "2408.03834v1", "paper_url": "http://arxiv.org/abs/2408.03834v1", "repo": "null"}}