{"2410.04699": {"publish_time": "2024-10-07", "title": "The LLM Effect: Are Humans Truly Using LLMs, or Are They Being Influenced By Them Instead?", "paper_summary": "Large Language Models (LLMs) have shown capabilities close to human\nperformance in various analytical tasks, leading researchers to use them for\ntime and labor-intensive analyses. However, their capability to handle highly\nspecialized and open-ended tasks in domains like policy studies remains in\nquestion. This paper investigates the efficiency and accuracy of LLMs in\nspecialized tasks through a structured user study focusing on Human-LLM\npartnership. The study, conducted in two stages-Topic Discovery and Topic\nAssignment-integrates LLMs with expert annotators to observe the impact of LLM\nsuggestions on what is usually human-only analysis. Results indicate that\nLLM-generated topic lists have significant overlap with human generated topic\nlists, with minor hiccups in missing document-specific topics. However, LLM\nsuggestions may significantly improve task completion speed, but at the same\ntime introduce anchoring bias, potentially affecting the depth and nuance of\nthe analysis, raising a critical question about the trade-off between increased\nefficiency and the risk of biased analysis.", "paper_summary_zh": "大型語言模型 (LLM) 在各種分析任務中展現出接近人類表現的能力，促使研究人員將其用於耗時且費力的分析。然而，它們在處理政策研究等領域中高度專業化且開放式任務的能力仍有待質疑。本文透過專注於人機合作的結構化使用者研究，探討 LLM 在專業任務中的效率和準確性。這項研究分為兩個階段進行，主題發現和主題分配，將 LLM 與專家註解人員整合，觀察 LLM 建議對通常僅限人類進行的分析的影響。結果顯示，LLM 生成的主題清單與人類生成的主題清單有顯著重疊，僅在遺漏特定於文件的主题時出現小問題。然而，LLM 建議可能會顯著提高任務完成速度，但同時也會引入錨定偏誤，可能影響分析的深度和細微差別，引發了一個關於提高效率與有偏分析風險之間權衡的關鍵問題。", "author": "Alexander S. Choi et.al.", "authors": "Alexander S. Choi, Syeda Sabrina Akter, JP Singh, Antonios Anastasopoulos", "id": "2410.04699v1", "paper_url": "http://arxiv.org/abs/2410.04699v1", "repo": "null"}}