{"2406.04143": {"publish_time": "2024-06-06", "title": "Do Language Models Understand Morality? Towards a Robust Detection of Moral Content", "paper_summary": "The task of detecting moral values in text has significant implications in\nvarious fields, including natural language processing, social sciences, and\nethical decision-making. Previously proposed supervised models often suffer\nfrom overfitting, leading to hyper-specialized moral classifiers that struggle\nto perform well on data from different domains. To address this issue, we\nintroduce novel systems that leverage abstract concepts and common-sense\nknowledge acquired from Large Language Models and Natural Language Inference\nmodels during previous stages of training on multiple data sources. By doing\nso, we aim to develop versatile and robust methods for detecting moral values\nin real-world scenarios. Our approach uses the GPT 3.5 model as a zero-shot\nready-made unsupervised multi-label classifier for moral values detection,\neliminating the need for explicit training on labeled data. We compare it with\na smaller NLI-based zero-shot model. The results show that the NLI approach\nachieves competitive results compared to the Davinci model. Furthermore, we\nconduct an in-depth investigation of the performance of supervised systems in\nthe context of cross-domain multi-label moral value detection. This involves\ntraining supervised models on different domains to explore their effectiveness\nin handling data from different sources and comparing their performance with\nthe unsupervised methods. Our contributions encompass a thorough analysis of\nboth supervised and unsupervised methodologies for cross-domain value\ndetection. We introduce the Davinci model as a state-of-the-art zero-shot\nunsupervised moral values classifier, pushing the boundaries of moral value\ndetection without the need for explicit training on labeled data. Additionally,\nwe perform a comparative evaluation of our approach with the supervised models,\nshedding light on their respective strengths and weaknesses.", "paper_summary_zh": "<paragraph>偵測文字中的道德價值這項任務在各種領域都有重要的影響，包括自然語言處理、社會科學和道德決策制定。先前提出的監督式模型常常會過度擬合，導致高度專業化的道德分類器難以在不同領域的資料上表現良好。為了解決這個問題，我們引進了創新的系統，它利用了大型語言模型和自然語言推論模型在先前訓練階段從多個資料來源中獲得的抽象概念和常識知識。透過這樣做，我們旨在開發出多功能且強健的方法，用於偵測現實世界中的道德價值。我們的做法是使用 GPT 3.5 模型作為道德價值偵測的零次學習現成非監督式多標籤分類器，無需對標籤資料進行明確的訓練。我們將它與一個較小的基於 NLI 的零次學習模型進行比較。結果顯示，與 Davinci 模型相比，NLI 方法達到了競爭性的結果。此外，我們對監督式系統在跨領域多標籤道德價值偵測中的表現進行了深入調查。這包括在不同領域訓練監督式模型，以探索它們在處理來自不同來源的資料時的有效性，並將它們的表現與非監督式方法進行比較。我們的貢獻包括對跨領域價值偵測的監督式和非監督式方法進行徹底的分析。我們引進 Davinci 模型作為最先進的零次學習非監督式道德價值分類器，在無需對標籤資料進行明確訓練的情況下，推動了道德價值偵測的界限。此外，我們對我們的做法與監督式模型進行了比較評估，說明了它們各自的優缺點。</paragraph>", "author": "Luana Bulla et.al.", "authors": "Luana Bulla, Aldo Gangemi, Misael Mongiovì", "id": "2406.04143v1", "paper_url": "http://arxiv.org/abs/2406.04143v1", "repo": "null"}}