{"2502.13055": {"publish_time": "2025-02-18", "title": "LAMD: Context-driven Android Malware Detection and Classification with LLMs", "paper_summary": "The rapid growth of mobile applications has escalated Android malware\nthreats. Although there are numerous detection methods, they often struggle\nwith evolving attacks, dataset biases, and limited explainability. Large\nLanguage Models (LLMs) offer a promising alternative with their zero-shot\ninference and reasoning capabilities. However, applying LLMs to Android malware\ndetection presents two key challenges: (1)the extensive support code in Android\napplications, often spanning thousands of classes, exceeds LLMs' context limits\nand obscures malicious behavior within benign functionality; (2)the structural\ncomplexity and interdependencies of Android applications surpass LLMs'\nsequence-based reasoning, fragmenting code analysis and hindering malicious\nintent inference. To address these challenges, we propose LAMD, a practical\ncontext-driven framework to enable LLM-based Android malware detection. LAMD\nintegrates key context extraction to isolate security-critical code regions and\nconstruct program structures, then applies tier-wise code reasoning to analyze\napplication behavior progressively, from low-level instructions to high-level\nsemantics, providing final prediction and explanation. A well-designed factual\nconsistency verification mechanism is equipped to mitigate LLM hallucinations\nfrom the first tier. Evaluation in real-world settings demonstrates LAMD's\neffectiveness over conventional detectors, establishing a feasible basis for\nLLM-driven malware analysis in dynamic threat landscapes.", "paper_summary_zh": "隨著行動應用程式快速成長，Android 惡意軟體威脅也隨之升級。雖然有許多偵測方法，但它們經常難以應付不斷演進的攻擊、資料集偏差和有限的可解釋性。大型語言模型 (LLM) 提供了一個有前途的替代方案，具備零次學習推理和推理能力。然而，將 LLM 應用於 Android 惡意軟體偵測會出現兩個主要挑戰：(1) Android 應用程式中大量的支援程式碼，通常橫跨數千個類別，超過 LLM 的上下文限制，並模糊了良性功能中的惡意行為；(2) Android 應用程式的結構複雜性和相互依賴性超過 LLM 的基於序列的推理，會造成程式碼分析破碎，並阻礙惡意意圖推論。為了應對這些挑戰，我們提出了 LAMD，一個實用的脈絡驅動架構，以支援基於 LLM 的 Android 惡意軟體偵測。LAMD 整合了關鍵脈絡萃取，以隔離與安全性至關重要的程式碼區域並建構程式結構，然後套用分層式程式碼推理，逐步分析應用程式行為，從低階指令到高階語意，提供最終預測和說明。一個設計良好的事實一致性驗證機制具備減輕 LLM 從第一層產生的幻覺的能力。在真實環境中的評估顯示，LAMD 優於傳統偵測器，為動態威脅環境中的 LLM 驅動惡意軟體分析建立了一個可行的基礎。", "author": "Xingzhi Qian et.al.", "authors": "Xingzhi Qian, Xinran Zheng, Yiling He, Shuo Yang, Lorenzo Cavallaro", "id": "2502.13055v1", "paper_url": "http://arxiv.org/abs/2502.13055v1", "repo": "null"}}