{"2410.04727": {"publish_time": "2024-10-07", "title": "Forgetting Curve: A Reliable Method for Evaluating Memorization Capability for Long-context Models", "paper_summary": "Numerous recent works target to extend effective context length for language\nmodels and various methods, tasks and benchmarks exist to measure model's\neffective memorization length. However, through thorough investigations, we\nfind limitations for currently existing evaluations on model's memorization\ncapability. We provide an extensive survey for limitations in this work and\npropose a new method called forgetting curve to measure the memorization\ncapability of long-context models. We show that forgetting curve has the\nadvantage of being robust to the tested corpus and the experimental settings,\nof not relying on prompts and can be applied to any model size.\n  We apply our forgetting curve to a large variety of models involving both\ntransformer and RNN/SSM based architectures. Our measurement provides empirical\nevidence for the effectiveness of transformer extension techniques while raises\nquestions for the effective length of RNN/SSM based models. We also examine the\ndifference between our measurement and existing benchmarks as well as popular\nmetrics for various models. Our code and results can be found at\nhttps://github.com/1azybug/ForgettingCurve.", "paper_summary_zh": "許多近期作品目標擴展語言模型的有效內容長度，並且有各種方法、任務和基準來衡量模型的有效記憶長度。然而，經過徹底調查，我們發現目前現有的評估對於模型的記憶能力有其限制。我們在這項工作中提供了限制的廣泛調查，並提出了一種稱為遺忘曲線的新方法來衡量長內容模型的記憶能力。我們展示了遺忘曲線具有對測試語料和實驗設定穩健、不依賴提示，且可應用於任何模型大小的優點。\n  我們將我們的遺忘曲線應用於各種模型，包括Transformer和基於 RNN/SSM 的架構。我們的測量提供了Transformer擴充技術有效性的實證證據，同時也對基於 RNN/SSM 的模型的有效長度提出疑問。我們還檢查了我們的測量與現有基準以及各種模型的熱門指標之間的差異。我們的程式碼和結果可以在 https://github.com/1azybug/ForgettingCurve 中找到。", "author": "Xinyu Liu et.al.", "authors": "Xinyu Liu, Runsong Zhao, Pengcheng Huang, Chunyang Xiao, Bei Li, Jingang Wang, Tong Xiao, Jingbo Zhu", "id": "2410.04727v1", "paper_url": "http://arxiv.org/abs/2410.04727v1", "repo": "https://github.com/1azybug/forgettingcurve"}}