{"2411.16832": {"publish_time": "2024-11-25", "title": "Edit Away and My Face Will not Stay: Personal Biometric Defense against Malicious Generative Editing", "paper_summary": "Recent advancements in diffusion models have made generative image editing\nmore accessible, enabling creative edits but raising ethical concerns,\nparticularly regarding malicious edits to human portraits that threaten privacy\nand identity security. Existing protection methods primarily rely on\nadversarial perturbations to nullify edits but often fail against diverse\nediting requests. We propose FaceLock, a novel approach to portrait protection\nthat optimizes adversarial perturbations to destroy or significantly alter\nbiometric information, rendering edited outputs biometrically unrecognizable.\nFaceLock integrates facial recognition and visual perception into perturbation\noptimization to provide robust protection against various editing attempts. We\nalso highlight flaws in commonly used evaluation metrics and reveal how they\ncan be manipulated, emphasizing the need for reliable assessments of\nprotection. Experiments show FaceLock outperforms baselines in defending\nagainst malicious edits and is robust against purification techniques. Ablation\nstudies confirm its stability and broad applicability across diffusion-based\nediting algorithms. Our work advances biometric defense and sets the foundation\nfor privacy-preserving practices in image editing. The code is available at:\nhttps://github.com/taco-group/FaceLock.", "paper_summary_zh": "擴散模型的最新進展使生成式影像編輯更易於使用，能進行具創意的編輯，但也引發了道德問題，特別是針對人像的惡意編輯，威脅到隱私和身分安全。現有的保護方法主要依賴對抗性擾動來消除編輯，但對於不同的編輯請求常常會失敗。我們提出 FaceLock，一種新穎的人像保護方法，可以最佳化對抗性擾動來破壞或顯著改變生物特徵資訊，使編輯後的輸出在生物特徵上無法辨識。FaceLock 將臉部辨識和視覺感知整合到擾動最佳化中，以提供對各種編輯嘗試的強大保護。我們也強調了常用評估指標的缺陷，並揭示它們如何被操縱，強調對保護進行可靠評估的必要性。實驗顯示，FaceLock 在防禦惡意編輯方面優於基準，並且對淨化技術具有魯棒性。消融研究證實了其穩定性和在基於擴散的編輯演算法中的廣泛適用性。我們的研究推動了生物特徵防禦，並為影像編輯中的隱私保護實務奠定了基礎。程式碼可在以下網址取得：https://github.com/taco-group/FaceLock。", "author": "Hanhui Wang et.al.", "authors": "Hanhui Wang, Yihua Zhang, Ruizheng Bai, Yue Zhao, Sijia Liu, Zhengzhong Tu", "id": "2411.16832v1", "paper_url": "http://arxiv.org/abs/2411.16832v1", "repo": "null"}}