{"2406.19354": {"publish_time": "2024-06-27", "title": "Fundamental Problems With Model Editing: How Should Rational Belief Revision Work in LLMs?", "paper_summary": "The model editing problem concerns how language models should learn new facts\nabout the world over time. While empirical research on model editing has drawn\nwidespread attention, the conceptual foundations of model editing remain shaky\n-- perhaps unsurprisingly, since model editing is essentially belief revision,\na storied problem in philosophy that has eluded succinct solutions for decades.\nModel editing nonetheless demands a solution, since we need to be able to\ncontrol the knowledge within language models. With this goal in mind, this\npaper critiques the standard formulation of the model editing problem and\nproposes a formal testbed for model editing research. We first describe 12 open\nproblems with model editing, based on challenges with (1) defining the problem,\n(2) developing benchmarks, and (3) assuming LLMs have editable beliefs in the\nfirst place. Many of these challenges are extremely difficult to address, e.g.\ndetermining far-reaching consequences of edits, labeling probabilistic\nentailments between facts, and updating beliefs of agent simulators. Next, we\nintroduce a semi-synthetic dataset for model editing based on Wikidata, where\nwe can evaluate edits against labels given by an idealized Bayesian agent. This\nenables us to say exactly how belief revision in language models falls short of\na desirable epistemic standard. We encourage further research exploring\nsettings where such a gold standard can be compared against. Our code is\npublicly available at: https://github.com/peterbhase/LLM-belief-revision", "paper_summary_zh": "模型編輯問題探討語言模型應如何隨著時間推移學習有關世界的新事實。儘管模型編輯的實證研究已引起廣泛關注，但模型編輯的概念基礎仍然不穩固——這或許不足為奇，因為模型編輯本質上是信念修正，這是一個哲學中的老生常談的問題，數十年來一直沒有簡潔的解決方案。儘管如此，模型編輯還是需要解決方案，因為我們需要能夠控制語言模型中的知識。本著這一目標，本文批判了模型編輯問題的標準表述，並提出了模型編輯研究的正式測試平台。我們首先描述了模型編輯的 12 個開放問題，這些問題基於以下挑戰：(1) 定義問題，(2) 開發基準，以及 (3) 假設 LLM 首先具有可編輯的信念。其中許多挑戰極難解決，例如確定編輯的深遠後果、標記事實之間的概率蘊涵，以及更新代理模擬器的信念。接下來，我們基於 Wikidata 介紹了一個用於模型編輯的半合成數據集，在其中我們可以根據理想貝葉斯代理給出的標籤來評估編輯。這使我們能夠確切地說明語言模型中的信念修正如何達不到理想的認識論標準。我們鼓勵進一步的研究探索可以將這種黃金標準與之進行比較的情況。我們的代碼已公開發布在：https://github.com/peterbhase/LLM-belief-revision", "author": "Peter Hase et.al.", "authors": "Peter Hase, Thomas Hofweber, Xiang Zhou, Elias Stengel-Eskin, Mohit Bansal", "id": "2406.19354v1", "paper_url": "http://arxiv.org/abs/2406.19354v1", "repo": "null"}}