{"2410.24198": {"publish_time": "2024-10-31", "title": "SelfCodeAlign: Self-Alignment for Code Generation", "paper_summary": "Instruction tuning is a supervised fine-tuning approach that significantly\nimproves the ability of large language models (LLMs) to follow human\ninstructions. We propose SelfCodeAlign, the first fully transparent and\npermissive pipeline for self-aligning code LLMs without extensive human\nannotations or distillation. SelfCodeAlign employs the same base model for\ninference throughout the data generation process. It first extracts diverse\ncoding concepts from high-quality seed snippets to generate new tasks. It then\nsamples multiple responses per task, pairs each with test cases, and validates\nthem in a sandbox environment. Finally, passing examples are selected for\ninstruction tuning. In our primary experiments, we use SelfCodeAlign with\nCodeQwen1.5-7B to generate a dataset of 74k instruction-response pairs.\nFinetuning on this dataset leads to a model that achieves a 67.1 pass@1 on\nHumanEval+, surpassing CodeLlama-70B-Instruct despite being ten times smaller.\nAcross all benchmarks, this finetuned model consistently outperforms the\noriginal version trained with OctoPack, the previous state-of-the-art method\nfor instruction tuning without human annotations or distillation. Additionally,\nwe show that SelfCodeAlign is effective across LLMs of various sizes, from 3B\nto 33B, and that the base models can benefit more from alignment with their own\ndata distribution. We further validate each component's effectiveness in our\npipeline, showing that SelfCodeAlign outperforms both direct distillation from\nGPT-4o and leading GPT-3.5-based distillation methods, such as OSS-Instruct and\nEvol-Instruct. SelfCodeAlign has also led to the creation of\nStarCoder2-Instruct, the first fully transparent, permissively licensed, and\nself-aligned code LLM that achieves state-of-the-art coding performance.", "paper_summary_zh": "指令微調是一種受監督的微調方法，它顯著提升了大型語言模型 (LLM) 遵循人類指令的能力。我們提出了 SelfCodeAlign，這是第一個完全透明且允許的管道，用於自我對齊程式碼 LLM，而無需大量的標註或萃取。SelfCodeAlign 在整個資料產生過程中採用相同的基礎模型進行推理。它首先從高品質種子片段中提取多樣的編碼概念，以產生新任務。然後，它對每個任務抽樣多個回應，將每個回應與測試用例配對，並在沙盒環境中驗證它們。最後，選擇通過範例進行指令微調。在我們的基礎實驗中，我們使用 SelfCodeAlign 搭配 CodeQwen1.5-7B 來產生一個包含 74k 條指令回應配對的資料集。針對此資料集進行微調會產生一個模型，在 HumanEval+ 上達到 67.1 pass@1，儘管它比 CodeLlama-70B-Instruct 小十倍，但卻超越了它。在所有基準測試中，這個微調模型始終優於使用 OctoPack 訓練的原始版本，OctoPack 是之前在沒有人工標註或萃取的情況下進行指令微調的最新方法。此外，我們展示了 SelfCodeAlign 對各種規模的 LLM 都很有效，從 3B 到 33B，而且基礎模型可以從與它們自己的資料分佈對齊中受益更多。我們進一步驗證了管道中每個組件的有效性，顯示 SelfCodeAlign 優於直接從 GPT-4o 萃取以及領先的基於 GPT-3.5 的萃取方法，例如 OSS-Instruct 和 Evol-Instruct。SelfCodeAlign 也導致了 StarCoder2-Instruct 的建立，這是第一個完全透明、許可寬鬆且自我對齊的程式碼 LLM，達到了最先進的編碼效能。", "author": "Yuxiang Wei et.al.", "authors": "Yuxiang Wei, Federico Cassano, Jiawei Liu, Yifeng Ding, Naman Jain, Zachary Mueller, Harm de Vries, Leandro von Werra, Arjun Guha, Lingming Zhang", "id": "2410.24198v2", "paper_url": "http://arxiv.org/abs/2410.24198v2", "repo": "https://github.com/bigcode-project/selfcodealign"}}