{"2502.14820": {"publish_time": "2025-02-20", "title": "eC-Tab2Text: Aspect-Based Text Generation from e-Commerce Product Tables", "paper_summary": "Large Language Models (LLMs) have demonstrated exceptional versatility across\ndiverse domains, yet their application in e-commerce remains underexplored due\nto a lack of domain-specific datasets. To address this gap, we introduce\neC-Tab2Text, a novel dataset designed to capture the intricacies of e-commerce,\nincluding detailed product attributes and user-specific queries. Leveraging\neC-Tab2Text, we focus on text generation from product tables, enabling LLMs to\nproduce high-quality, attribute-specific product reviews from structured\ntabular data. Fine-tuned models were rigorously evaluated using standard\nTable2Text metrics, alongside correctness, faithfulness, and fluency\nassessments. Our results demonstrate substantial improvements in generating\ncontextually accurate reviews, highlighting the transformative potential of\ntailored datasets and fine-tuning methodologies in optimizing e-commerce\nworkflows. This work highlights the potential of LLMs in e-commerce workflows\nand the essential role of domain-specific datasets in tailoring them to\nindustry-specific challenges.", "paper_summary_zh": "大型語言模型 (LLM) 在各種領域展現出非凡的多功能性，但由於缺乏特定領域的資料集，因此它們在電子商務中的應用仍未得到充分探索。為了解決這個差距，我們引入了 eC-Tab2Text，這是一個新穎的資料集，旨在捕捉電子商務的複雜性，包括詳細的產品屬性和使用者特定的查詢。利用 eC-Tab2Text，我們專注於從產品表格中產生文字，使 LLM 能夠從結構化的表格資料中產生高品質、特定屬性的產品評論。微調模型使用標準的 Table2Text 指標，以及正確性、忠實度和流利度評估進行嚴格評估。我們的結果證明在產生符合語境的準確評論方面有顯著的進步，突顯了客製化資料集和微調方法在最佳化電子商務工作流程中的轉型潛力。這項工作突顯了 LLM 在電子商務工作流程中的潛力，以及特定領域資料集在因應產業特定挑戰中至關重要的角色。", "author": "Luis Antonio Gutiérrez Guanilo et.al.", "authors": "Luis Antonio Gutiérrez Guanilo, Mir Tafseer Nayeem, Cristian López, Davood Rafiei", "id": "2502.14820v1", "paper_url": "http://arxiv.org/abs/2502.14820v1", "repo": "null"}}