{"2407.08196": {"publish_time": "2024-07-11", "title": "SoupLM: Model Integration in Large Language and Multi-Modal Models", "paper_summary": "Training large language models (LLMs) and multimodal LLMs necessitates\nsignificant computing resources, and existing publicly available LLMs are\ntypically pre-trained on diverse, privately curated datasets spanning various\ntasks. For instance, LLaMA, Vicuna, and LLaVA are three LLM variants trained\nwith LLaMA base models using very different training recipes, tasks, and data\nmodalities. The training cost and complexity for such LLM variants grow\nrapidly. In this study, we propose to use a soup strategy to assemble these LLM\nvariants into a single well-generalized multimodal LLM (SoupLM) in a\ncost-efficient manner. Assembling these LLM variants efficiently brings\nknowledge and specialities trained from different domains and data modalities\ninto an integrated one (e.g., chatbot speciality from user-shared conversations\nfor Vicuna, and visual capacity from vision-language data for LLaVA),\ntherefore, to avoid computing costs of repetitive training on several different\ndomains. We propose series of soup strategies to systematically benchmark\nperformance gains across various configurations, and probe the soup behavior\nacross base models in the interpolation space.", "paper_summary_zh": "訓練大型語言模型 (LLM) 和多模態 LLM 需要大量的運算資源，而現有的公開 LLM 通常使用多元且私有策展的資料集進行預先訓練，涵蓋各種任務。例如，LLaMA、Vicuna 和 LLaVA 是三個 LLM 變體，使用 LLaMA 基礎模型進行訓練，採用非常不同的訓練配方、任務和資料模式。此類 LLM 變體的訓練成本和複雜度會快速增加。在本研究中，我們建議使用湯策略將這些 LLM 變體組裝成一個單一的良好泛化多模態 LLM (SoupLM)，以一種具有成本效益的方式進行。有效地組裝這些 LLM 變體，將從不同領域和資料模式訓練而來的知識和專長帶入一個整合的模式（例如，Vicuna 的使用者共享對話中的聊天機器人專長，以及 LLaVA 的視覺語言資料中的視覺能力），因此，可以避免在多個不同領域進行重複訓練的運算成本。我們提出了一系列湯策略，以系統性地比較各種組態的效能提升，並探討插值空間中基礎模型之間的湯行為。", "author": "Yue Bai et.al.", "authors": "Yue Bai, Zichen Zhang, Jiasen Lu, Yun Fu", "id": "2407.08196v1", "paper_url": "http://arxiv.org/abs/2407.08196v1", "repo": "null"}}