{"2405.05904": {"publish_time": "2024-05-09", "title": "Does Fine-Tuning LLMs on New Knowledge Encourage Hallucinations?", "paper_summary": "When large language models are aligned via supervised fine-tuning, they may\nencounter new factual information that was not acquired through pre-training.\nIt is often conjectured that this can teach the model the behavior of\nhallucinating factually incorrect responses, as the model is trained to\ngenerate facts that are not grounded in its pre-existing knowledge. In this\nwork, we study the impact of such exposure to new knowledge on the capability\nof the fine-tuned model to utilize its pre-existing knowledge. To this end, we\ndesign a controlled setup, focused on closed-book QA, where we vary the\nproportion of the fine-tuning examples that introduce new knowledge. We\ndemonstrate that large language models struggle to acquire new factual\nknowledge through fine-tuning, as fine-tuning examples that introduce new\nknowledge are learned significantly slower than those consistent with the\nmodel's knowledge. However, we also find that as the examples with new\nknowledge are eventually learned, they linearly increase the model's tendency\nto hallucinate. Taken together, our results highlight the risk in introducing\nnew factual knowledge through fine-tuning, and support the view that large\nlanguage models mostly acquire factual knowledge through pre-training, whereas\nfine-tuning teaches them to use it more efficiently.", "paper_summary_zh": "當大型語言模型透過監督式微調來對齊時，可能會遇到在預訓練中未獲得的新事實資訊。人們經常猜測，這可能會教導模型虛構事實上不正確的回應的行為，因為該模型經過訓練可以產生不基於其既有知識的事實。在這項工作中，我們研究了這種接觸新知識對微調模型利用其既有知識的能力的影響。為此，我們設計了一個受控的設定，專注於閉卷問答，其中我們改變了引入新知識的微調範例的比例。我們證明了大型語言模型難以透過微調來獲得新的事實知識，因為引入新知識的微調範例的學習速度顯著低於與模型知識一致的範例。然而，我們也發現，隨著具有新知識的範例最終被學習，它們會線性增加模型虛構的趨勢。綜合起來，我們的結果突顯了透過微調引入新的事實知識的風險，並支持這樣一種觀點，即大型語言模型主要透過預訓練來獲得事實知識，而微調則教導它們更有效地使用它。", "author": "Zorik Gekhman et.al.", "authors": "Zorik Gekhman, Gal Yona, Roee Aharoni, Matan Eyal, Amir Feder, Roi Reichart, Jonathan Herzig", "id": "2405.05904v1", "paper_url": "http://arxiv.org/abs/2405.05904v1", "repo": "null"}}