{"2411.03957": {"publish_time": "2024-11-06", "title": "Fine-Grained Guidance for Retrievers: Leveraging LLMs' Feedback in Retrieval-Augmented Generation", "paper_summary": "Retrieval-Augmented Generation (RAG) has proven to be an effective method for\nmitigating hallucination issues inherent in large language models (LLMs).\nPrevious approaches typically train retrievers based on semantic similarity,\nlacking optimization for RAG. More recent works have proposed aligning\nretrievers with the preference signals of LLMs. However, these preference\nsignals are often difficult for dense retrievers, which typically have weaker\nlanguage capabilities, to understand and learn effectively. Drawing inspiration\nfrom pedagogical theories like Guided Discovery Learning, we propose a novel\nframework, FiGRet (Fine-grained Guidance for Retrievers), which leverages the\nlanguage capabilities of LLMs to construct examples from a more granular,\ninformation-centric perspective to guide the learning of retrievers.\nSpecifically, our method utilizes LLMs to construct easy-to-understand examples\nfrom samples where the retriever performs poorly, focusing on three learning\nobjectives highly relevant to the RAG scenario: relevance, comprehensiveness,\nand purity. These examples serve as scaffolding to ultimately align the\nretriever with the LLM's preferences. Furthermore, we employ a dual curriculum\nlearning strategy and leverage the reciprocal feedback between LLM and\nretriever to further enhance the performance of the RAG system. A series of\nexperiments demonstrate that our proposed framework enhances the performance of\nRAG systems equipped with different retrievers and is applicable to various\nLLMs.", "paper_summary_zh": "檢索增強生成 (RAG) 已被證明是一種有效的方法，可減輕大型語言模型 (LLM) 中固有的幻覺問題。\n先前的做法通常根據語義相似性訓練檢索器，缺少針對 RAG 的最佳化。最近的研究已提議將檢索器與 LLM 的偏好信號對齊。然而，這些偏好信號通常難以讓通常具有較弱語言能力的稠密檢索器理解並有效學習。從指導發現學習等教學理論中汲取靈感，我們提出了一個新框架 FiGRet（檢索器的細粒度指導），它利用 LLM 的語言能力從更精細、以資訊為中心的角度構建範例，以指導檢索器的學習。\n具體而言，我們的方法利用 LLM 從檢索器表現不佳的範例中構建易於理解的範例，專注於與 RAG 情境高度相關的三個學習目標：相關性、全面性和純度。這些範例作為腳手架，最終將檢索器與 LLM 的偏好對齊。此外，我們採用雙課程學習策略，並利用 LLM 和檢索器之間的相互回饋，進一步增強 RAG 系統的效能。一系列實驗證明，我們提出的框架增強了配備不同檢索器的 RAG 系統的效能，並且適用於各種 LLM。", "author": "Yuhang Liu et.al.", "authors": "Yuhang Liu, Xueyu Hu, Shengyu Zhang, Jingyuan Chen, Fan Wu, Fei Wu", "id": "2411.03957v1", "paper_url": "http://arxiv.org/abs/2411.03957v1", "repo": "null"}}