{"2408.03907": {"publish_time": "2024-08-07", "title": "Decoding Biases: Automated Methods and LLM Judges for Gender Bias Detection in Language Models", "paper_summary": "Large Language Models (LLMs) have excelled at language understanding and\ngenerating human-level text. However, even with supervised training and human\nalignment, these LLMs are susceptible to adversarial attacks where malicious\nusers can prompt the model to generate undesirable text. LLMs also inherently\nencode potential biases that can cause various harmful effects during\ninteractions. Bias evaluation metrics lack standards as well as consensus and\nexisting methods often rely on human-generated templates and annotations which\nare expensive and labor intensive. In this work, we train models to\nautomatically create adversarial prompts to elicit biased responses from target\nLLMs. We present LLM- based bias evaluation metrics and also analyze several\nexisting automatic evaluation methods and metrics. We analyze the various\nnuances of model responses, identify the strengths and weaknesses of model\nfamilies, and assess where evaluation methods fall short. We compare these\nmetrics to human evaluation and validate that the LLM-as-a-Judge metric aligns\nwith human judgement on bias in response generation.", "paper_summary_zh": "大型語言模型 (LLM) 在語言理解和產生人類層級文字方面表現出色。然而，即使經過監督式訓練和人類校準，這些 LLM 仍容易受到對抗性攻擊，惡意使用者可以提示模型產生不良文字。LLM 本身也編碼了潛在偏見，可能在互動過程中造成各種有害影響。偏見評估指標缺乏標準和共識，現有方法通常依賴於人工產生的範本和註解，這些範本和註解昂貴且耗費人力。在這項工作中，我們訓練模型自動建立對抗性提示，從目標 LLM 引出有偏見的回應。我們提出基於 LLM 的偏見評估指標，並分析了幾種現有的自動評估方法和指標。我們分析模型回應的各種細微差別，找出模型系列的優缺點，並評估評估方法的不足之處。我們將這些指標與人類評估進行比較，並驗證 LLM 作為評判指標與人類對回應中偏見的判斷一致。", "author": "Shachi H Kumar et.al.", "authors": "Shachi H Kumar, Saurav Sahay, Sahisnu Mazumder, Eda Okur, Ramesh Manuvinakurike, Nicole Beckage, Hsuan Su, Hung-yi Lee, Lama Nachman", "id": "2408.03907v1", "paper_url": "http://arxiv.org/abs/2408.03907v1", "repo": "null"}}