{"2411.11206": {"publish_time": "2024-11-17", "title": "Capturing Sparks of Abstraction for the ARC Challenge", "paper_summary": "Excellent progress has been made recently in solving ARC Challenge problems.\nHowever, it seems that new techniques may be required to push beyond 60%\naccuracy. Even commercial Large Language Models (LLMs) struggle to 'understand'\nmany of the problems (when given the input and output grids), which makes\ndiscovering solutions by LLM-lead program search somewhat futile.\n  In this work, LLM 'understanding' is attempted from a stronger starting\nposition : An LLM is given complete solutions to tasks in code, and then asked\nto explain how the task is being solved at various levels of abstraction.\nSpecifically, the LLM was given code solutions implemented in arc-dsl-llm (an\nLLM-legible version of Hodel's arc-dsl to obtain: (a) commented code; (b) code\nrefactored into reusable functional chunks; (c) problem solution steps; and (d)\nhigh-level problem-solving tactics.\n  We demonstrate that 'Sparks of Abstraction' can be extracted from the LLM\noutput - in a form that could be used in downstream tasks with Local LLMs\neligible to enter the ARC Prize.\n  Both the arc-dsl-llm DSL framework (with the re-engineered solutions) and the\nGemini LLM-generated data (along with the generation code) are made Open\nSource.", "paper_summary_zh": "最近在解決 ARC Challenge 問題方面取得了顯著進展。\n然而，似乎需要新的技術才能將準確率提升至 60% 以上。\n即使是商用大型語言模型 (LLM) 也難以「理解」許多問題（在提供輸入和輸出網格時），這使得透過 LLM 引導的程式搜尋來發現解決方案有些徒勞無功。\n在這項工作中，嘗試從更強的起點來「理解」LLM：給予 LLM 任務的完整程式碼解決方案，然後要求它說明任務是如何在不同的抽象層級中獲得解決的。\n具體來說，LLM 被給予使用 arc-dsl-llm（Hodel 的 arc-dsl 的 LLM 可讀版本）實作的程式碼解決方案，以取得：(a) 附註程式碼；(b) 重構為可重複使用的函數區塊的程式碼；(c) 問題解決步驟；以及 (d) 高階問題解決策略。\n我們證明了「抽象火花」可以從 LLM 輸出中萃取出來，其形式可用於下游任務，而符合資格進入 ARC 獎項的在地 LLM。\narc-dsl-llm DSL 架構（包含重新設計的解決方案）和 Gemini LLM 生成的資料（連同產生程式碼）都是開放原始碼。", "author": "Martin Andrews et.al.", "authors": "Martin Andrews", "id": "2411.11206v1", "paper_url": "http://arxiv.org/abs/2411.11206v1", "repo": "null"}}