{"2411.02142": {"publish_time": "2024-11-04", "title": "Training Compute-Optimal Protein Language Models", "paper_summary": "We explore optimally training protein language models, an area of significant\ninterest in biological research where guidance on best practices is limited.\nMost models are trained with extensive compute resources until performance\ngains plateau, focusing primarily on increasing model sizes rather than\noptimizing the efficient compute frontier that balances performance and compute\nbudgets. Our investigation is grounded in a massive dataset consisting of 939\nmillion protein sequences. We trained over 300 models ranging from 3.5 million\nto 10.7 billion parameters on 5 to 200 billion unique tokens, to investigate\nthe relations between model sizes, training token numbers, and objectives.\nFirst, we observed the effect of diminishing returns for the Causal Language\nModel (CLM) and that of overfitting for the Masked Language Model~(MLM) when\nrepeating the commonly used Uniref database. To address this, we included\nmetagenomic protein sequences in the training set to increase the diversity and\navoid the plateau or overfitting effects. Second, we obtained the scaling laws\nof CLM and MLM on Transformer, tailored to the specific characteristics of\nprotein sequence data. Third, we observe a transfer scaling phenomenon from CLM\nto MLM, further demonstrating the effectiveness of transfer through scaling\nbehaviors based on estimated Effectively Transferred Tokens. Finally, to\nvalidate our scaling laws, we compare the large-scale versions of ESM-2 and\nPROGEN2 on downstream tasks, encompassing evaluations of protein generation as\nwell as structure- and function-related tasks, all within less or equivalent\npre-training compute budgets.", "paper_summary_zh": "<paragraph>我們探討最佳訓練蛋白質語言模型，這是生物研究中一個重要的領域，但最佳實務的指導方針有限。\n大多數模型都使用大量的運算資源進行訓練，直到效能增益達到平穩期，主要著重於增加模型規模，而不是最佳化平衡效能與運算預算的有效運算前緣。我們的調查是基於一個包含 9.39 億個蛋白質序列的龐大資料集。我們訓練了 300 多個模型，範圍從 350 萬到 107 億個參數，使用 50 億到 2000 億個獨特符號，來探討模型規模、訓練符號數量和目標之間的關係。\n首先，我們觀察到因果語言模型 (CLM) 的報酬遞減效應，以及重複使用常見的 Uniref 資料庫時，遮蔽語言模型 (MLM) 的過度擬合效應。為了解決這個問題，我們在訓練集中加入了宏基因組蛋白質序列，以增加多樣性並避免平穩期或過度擬合的效應。其次，我們獲得了針對蛋白質序列資料的特定特徵調整的 Transformer 上的 CLM 和 MLM 的縮放定律。第三，我們觀察到從 CLM 到 MLM 的傳輸縮放現象，進一步證明了基於估計的有效傳輸符號的縮放行為的傳輸效能。最後，為了驗證我們的縮放定律，我們比較了 ESM-2 和 PROGEN2 的大型版本在下游任務上的表現，包括蛋白質生成的評估以及與結構和功能相關的任務，所有這些都在較少或相當的預訓練運算預算內。</paragraph>", "author": "Xingyi Cheng et.al.", "authors": "Xingyi Cheng, Bo Chen, Pan Li, Jing Gong, Jie Tang, Le Song", "id": "2411.02142v1", "paper_url": "http://arxiv.org/abs/2411.02142v1", "repo": "https://github.com/cxysteven/scalingproteinlm"}}