{"2411.10746": {"publish_time": "2024-11-16", "title": "LTCXNet: Advancing Chest X-Ray Analysis with Solutions for Long-Tailed Multi-Label Classification and Fairness Challenges", "paper_summary": "Chest X-rays (CXRs) often display various diseases with disparate class\nfrequencies, leading to a long-tailed, multi-label data distribution. In\nresponse to this challenge, we explore the Pruned MIMIC-CXR-LT dataset, a\ncurated collection derived from the MIMIC-CXR dataset, specifically designed to\nrepresent a long-tailed and multi-label data scenario. We introduce LTCXNet, a\nnovel framework that integrates the ConvNeXt model, ML-Decoder, and strategic\ndata augmentation, further enhanced by an ensemble approach. We demonstrate\nthat LTCXNet improves the performance of CXR interpretation across all classes,\nespecially enhancing detection in rarer classes like `Pneumoperitoneum' and\n`Pneumomediastinum' by 79\\% and 48\\%, respectively. Beyond performance metrics,\nour research extends into evaluating fairness, highlighting that some methods,\nwhile improving model accuracy, could inadvertently affect fairness across\ndifferent demographic groups negatively. This work contributes to advancing the\nunderstanding and management of long-tailed, multi-label data distributions in\nmedical imaging, paving the way for more equitable and effective diagnostic\ntools.", "paper_summary_zh": "胸部 X 光片 (CXR) 通常會顯示各種疾病，且各類別的頻率不同，導致長尾的多標籤資料分佈。為了應對這項挑戰，我們探討了精簡的 MIMIC-CXR-LT 資料集，這是一個從 MIMIC-CXR 資料集衍生的精選集合，專門設計用於表示長尾和多標籤資料情境。我們引入了 LTCXNet，這是一個整合了 ConvNeXt 模型、ML-Decoder 和策略性資料擴充的新架構，並透過整體方法進一步增強。我們證明 LTCXNet 可提升所有類別的 CXR 解釋效能，特別是將較罕見類別（如「氣腹」和「縱膈氣腫」）的偵測功能分別提升了 79% 和 48%。除了效能指標之外，我們的研究還擴展到評估公平性，強調一些方法在提升模型準確度的同時，可能會無意間對不同人口群體的公平性產生負面影響。這項工作有助於促進對醫學影像中長尾、多標籤資料分佈的理解和管理，為更公平、有效的診斷工具鋪路。", "author": "Chin-Wei Huang et.al.", "authors": "Chin-Wei Huang, Mu-Yi Shen, Kuan-Chang Shih, Shih-Chih Lin, Chi-Yu Chen, Po-Chih Kuo", "id": "2411.10746v1", "paper_url": "http://arxiv.org/abs/2411.10746v1", "repo": "null"}}