{"2406.15252": {"publish_time": "2024-06-21", "title": "MantisScore: Building Automatic Metrics to Simulate Fine-grained Human Feedback for Video Generation", "paper_summary": "The recent years have witnessed great advances in video generation. However,\nthe development of automatic video metrics is lagging significantly behind.\nNone of the existing metric is able to provide reliable scores over generated\nvideos. The main barrier is the lack of large-scale human-annotated dataset. In\nthis paper, we release VideoFeedback, the first large-scale dataset containing\nhuman-provided multi-aspect score over 37.6K synthesized videos from 11\nexisting video generative models. We train MantisScore (initialized from\nMantis) based on VideoFeedback to enable automatic video quality assessment.\nExperiments show that the Spearman correlation between MantisScore and humans\ncan reach 77.1 on VideoFeedback-test, beating the prior best metrics by about\n50 points. Further result on other held-out EvalCrafter, GenAI-Bench, and\nVBench show that MantisScore has consistently much higher correlation with\nhuman judges than other metrics. Due to these results, we believe MantisScore\ncan serve as a great proxy for human raters to (1) rate different video models\nto track progress (2) simulate fine-grained human feedback in Reinforcement\nLearning with Human Feedback (RLHF) to improve current video generation models.", "paper_summary_zh": "近年来，视频生成领域取得了巨大进展。然而，自动视频指标的发展却远远落后。现有的指标都无法对生成的视频提供可靠的分数。主要障碍是缺乏大规模的人工标注数据集。在本文中，我们发布了 VideoFeedback，这是第一个包含来自 11 个现有视频生成模型的 37.6K 合成视频的人工提供的多方面分数的大规模数据集。我们基于 VideoFeedback 训练 MantisScore（从 Mantis 初始化），以实现自动视频质量评估。实验表明，MantisScore 与人类之间的 Spearman 相关性在 VideoFeedback-test 上可以达到 77.1，比之前的最佳指标高出约 50 个点。在其他保留的 EvalCrafter、GenAI-Bench 和 VBench 上的进一步结果表明，MantisScore 与人类评委的一致性始终远高于其他指标。根据这些结果，我们相信 MantisScore 可以作为人类评估者的一个很好的代理，以 (1) 对不同的视频模型进行评分以跟踪进度 (2) 在人类反馈强化学习 (RLHF) 中模拟细粒度的人类反馈以改进当前的视频生成模型。", "author": "Xuan He et.al.", "authors": "Xuan He, Dongfu Jiang, Ge Zhang, Max Ku, Achint Soni, Sherman Siu, Haonan Chen, Abhranil Chandra, Ziyan Jiang, Aaran Arulraj, Kai Wang, Quy Duc Do, Yuansheng Ni, Bohan Lyu, Yaswanth Narsupalli, Rongqi Fan, Zhiheng Lyu, Yuchen Lin, Wenhu Chen", "id": "2406.15252v1", "paper_url": "http://arxiv.org/abs/2406.15252v1", "repo": "null"}}