{"2502.00063": {"publish_time": "2025-01-30", "title": "A Multi-Layered Large Language Model Framework for Disease Prediction", "paper_summary": "Social telehealth has revolutionized healthcare by enabling patients to share\nsymptoms and receive medical consultations remotely. Users frequently post\nsymptoms on social media and online health platforms, generating a vast\nrepository of medical data that can be leveraged for disease classification and\nsymptom severity assessment. Large language models (LLMs), such as LLAMA3,\nGPT-3.5 Turbo, and BERT, process complex medical data to enhance disease\nclassification. This study explores three Arabic medical text preprocessing\ntechniques: text summarization, text refinement, and Named Entity Recognition\n(NER). Evaluating CAMeL-BERT, AraBERT, and Asafaya-BERT with LoRA, the best\nperformance was achieved using CAMeL-BERT with NER-augmented text (83% type\nclassification, 69% severity assessment). Non-fine-tuned models performed\npoorly (13%-20% type classification, 40%-49% severity assessment). Integrating\nLLMs into social telehealth systems enhances diagnostic accuracy and treatment\noutcomes.", "paper_summary_zh": "社交遠距醫療透過讓患者可以遠距分享症狀並接受醫療諮詢，徹底改變了醫療保健。使用者經常在社群媒體和線上健康平台上發布症狀，產生了龐大的醫療資料庫，可利用於疾病分類和症狀嚴重性評估。大型語言模型 (LLM)，例如 LLAMA3、GPT-3.5 Turbo 和 BERT，處理複雜的醫療資料以增強疾病分類。本研究探討了三種阿拉伯語醫療文字前處理技術：文字摘要、文字精煉和命名實體辨識 (NER)。使用 LoRA 評估 CAMeL-BERT、AraBERT 和 Asafaya-BERT，使用具 NER 增強文字的 CAMeL-BERT 獲得最佳效能（83% 類型分類，69% 嚴重性評估）。未經過微調的模型效能不佳（13%-20% 類型分類，40%-49% 嚴重性評估）。將 LLM 整合到社交遠距醫療系統中可增強診斷準確性和治療結果。", "author": "Malak Mohamed et.al.", "authors": "Malak Mohamed, Rokaia Emad, Ali Hamdi", "id": "2502.00063v1", "paper_url": "http://arxiv.org/abs/2502.00063v1", "repo": "null"}}