{"2501.02564": {"publish_time": "2025-01-05", "title": "Balanced Multi-view Clustering", "paper_summary": "Multi-view clustering (MvC) aims to integrate information from different\nviews to enhance the capability of the model in capturing the underlying data\nstructures. The widely used joint training paradigm in MvC is potentially not\nfully leverage the multi-view information, since the imbalanced and\nunder-optimized view-specific features caused by the uniform learning objective\nfor all views. For instance, particular views with more discriminative\ninformation could dominate the learning process in the joint training paradigm,\nleading to other views being under-optimized. To alleviate this issue, we first\nanalyze the imbalanced phenomenon in the joint-training paradigm of multi-view\nclustering from the perspective of gradient descent for each view-specific\nfeature extractor. Then, we propose a novel balanced multi-view clustering\n(BMvC) method, which introduces a view-specific contrastive regularization\n(VCR) to modulate the optimization of each view. Concretely, VCR preserves the\nsample similarities captured from the joint features and view-specific ones\ninto the clustering distributions corresponding to view-specific features to\nenhance the learning process of view-specific feature extractors. Additionally,\na theoretical analysis is provided to illustrate that VCR adaptively modulates\nthe magnitudes of gradients for updating the parameters of view-specific\nfeature extractors to achieve a balanced multi-view learning procedure. In such\na manner, BMvC achieves a better trade-off between the exploitation of\nview-specific patterns and the exploration of view-invariance patterns to fully\nlearn the multi-view information for the clustering task. Finally, a set of\nexperiments are conducted to verify the superiority of the proposed method\ncompared with state-of-the-art approaches both on eight benchmark MvC datasets\nand two spatially resolved transcriptomics datasets.", "paper_summary_zh": "多視圖聚類 (MvC) 旨在整合來自不同視圖的資訊，以增強模型擷取基礎資料結構的能力。MvC 中廣泛使用的聯合訓練範例可能無法充分利用多視圖資訊，因為統一的學習目標導致所有視圖產生不平衡且最佳化不足的視圖特定特徵。例如，在聯合訓練範例中，具有較多區辨資訊的特定視圖可能會主導學習過程，導致其他視圖最佳化不足。為了緩解此問題，我們首先從每個視圖特定特徵萃取器的梯度下降角度分析多視圖聚類聯合訓練範例中的不平衡現象。然後，我們提出了一種新穎的平衡多視圖聚類 (BMvC) 方法，它引入了視圖特定對比正規化 (VCR) 來調節每個視圖的最佳化。具體來說，VCR 保留從聯合特徵和視圖特定特徵擷取的樣本相似性，並將其納入對應於視圖特定特徵的聚類分佈中，以增強視圖特定特徵萃取器的學習過程。此外，我們提供了理論分析來說明，VCR 能夠自適應地調節視圖特定特徵萃取器參數更新的梯度幅度，以達成平衡的多視圖學習程序。藉由這種方式，BMvC 在利用視圖特定模式和探索視圖不變模式之間取得了更好的折衷，以充分學習多視圖資訊，並進行聚類任務。最後，我們進行了一系列實驗，在八個基準 MvC 資料集和兩個空間解析轉錄體資料集上，驗證了所提出的方法優於現有技術。", "author": "Zhenglai Li et.al.", "authors": "Zhenglai Li, Jun Wang, Chang Tang, Xinzhong Zhu, Wei Zhang, Xinwang Liu", "id": "2501.02564v1", "paper_url": "http://arxiv.org/abs/2501.02564v1", "repo": "null"}}