{"2411.00036": {"publish_time": "2024-10-29", "title": "Coupling quantum-like cognition with the neuronal networks within generalized probability theory", "paper_summary": "The recent years are characterized by intensive applications of the\nmethodology and mathematical apparatus of quantum theory, quantum-like\nmodeling, in cognition, psychology, and decision making. In spite of the\nsuccessful applications of this approach to a variety of psychological effects,\ne.g., the order, conjunction, disjunction, and response replicability effects,\none may (but need not) feel dissatisfaction due to the absence of clear\ncoupling to the neurophysiological processes in the brain. For the moment, this\nis just a phenomenological approach. In this paper we construct the\nquantum-like representation of the networks of communicating neurons. It is\nbased not on standard quantum theory, but on generalized probability theory\n(GPT) with the emphasis of the operational measurement approach. We employ\nGPT's version which is based on ordered linear state space (instead of complex\nHilbert space). A network of communicating neurons is described as a weighted\nordered graph that in turn is encoded by its weight matrix. The state space of\nweight matrices is embedded in GPT with effect-observables and state updates\nwithin measurement instruments theory. The latter plays the crucial role. This\nGPT based model shows the basic quantum-like effects, as e.g. the order,\nnon-repeatability, and disjunction effects; the latter is also known as\ninterference of decisions. This GPT coupling also supports quantum-like\nmodeling in medical diagnostic for neurological diseases, as depression and\nepilepsy. Although the paper is concentrated on cognition and neuronal\nnetworks, the formalism and methodology can be straightforwardly applied to a\nvariety of biological and social networks.", "paper_summary_zh": "近年來，量子理論、類量子模型在認知、心理學和決策制定中的方法論和數學裝置得到廣泛應用。儘管這種方法成功應用於各種心理效應，例如順序、合取、析取和反應可複製效應，但由於缺乏與大腦神經生理過程的明確聯繫，人們可能會（但不必）感到不滿。目前，這只是一種現象學方法。在本文中，我們構建了通信神經元網路的類量子表示。它不是基於標準量子理論，而是基於廣義概率論 (GPT)，並強調運算測量方法。我們採用基於有序線性狀態空間（而不是複雜希爾伯特空間）的 GPT 版本。通信神經元網路被描述為一個加權有序圖，而加權有序圖又由其權重矩陣編碼。權重矩陣的狀態空間嵌入 GPT 中，其中效應觀測值和狀態更新在測量儀器理論中。後者發揮著至關重要的作用。這個基於 GPT 的模型展示了基本的類量子效應，例如順序、不可重複性和析取效應；後者也被稱為決策干擾。這種 GPT 耦合還支援神經疾病（如抑鬱症和癲癇症）的醫療診斷中的類量子建模。儘管本文集中於認知和神經元網路，但形式主義和方法論可以直接應用於各種生物和社會網路。", "author": "Andrei Khrennikov et.al.", "authors": "Andrei Khrennikov, Masanao Ozawa, Felix Benninger, Oded Shor", "id": "2411.00036v1", "paper_url": "http://arxiv.org/abs/2411.00036v1", "repo": "null"}}