{"2406.16983": {"publish_time": "2024-06-23", "title": "On Instabilities of Unsupervised Denoising Diffusion Models in Magnetic Resonance Imaging Reconstruction", "paper_summary": "Denoising diffusion models offer a promising approach to accelerating\nmagnetic resonance imaging (MRI) and producing diagnostic-level images in an\nunsupervised manner. However, our study demonstrates that even tiny worst-case\npotential perturbations transferred from a surrogate model can cause these\nmodels to generate fake tissue structures that may mislead clinicians. The\ntransferability of such worst-case perturbations indicates that the robustness\nof image reconstruction may be compromised due to MR system imperfections or\nother sources of noise. Moreover, at larger perturbation strengths, diffusion\nmodels exhibit Gaussian noise-like artifacts that are distinct from those\nobserved in supervised models and are more challenging to detect. Our results\nhighlight the vulnerability of current state-of-the-art diffusion-based\nreconstruction models to possible worst-case perturbations and underscore the\nneed for further research to improve their robustness and reliability in\nclinical settings.", "paper_summary_zh": "去噪擴散模型提供了一種有前景的方法，可以加速磁共振成像 (MRI) 並以無監督的方式產生診斷級別的影像。然而，我們的研究表明，即使是從代理模型傳輸的極小最壞情況潛在擾動，也會導致這些模型產生可能誤導臨床醫生的假組織結構。這種最壞情況擾動的可傳遞性表明，由於 MR 系統缺陷或其他雜訊來源，影像重建的穩健性可能會受到損害。此外，在較大的擾動強度下，擴散模型會表現出與監督模型中觀察到的不同的高斯雜訊樣式的人工製品，並且更難以檢測。我們的結果突顯了當前最先進的基於擴散的重建模型對可能的最壞情況擾動的脆弱性，並強調需要進一步研究以提高其在臨床環境中的穩健性和可靠性。", "author": "Tianyu Han et.al.", "authors": "Tianyu Han, Sven Nebelung, Firas Khader, Jakob Nikolas Kather, Daniel Truhn", "id": "2406.16983v1", "paper_url": "http://arxiv.org/abs/2406.16983v1", "repo": "null"}}