{"2501.07502": {"publish_time": "2025-01-13", "title": "RbRL2.0: Integrated Reward and Policy Learning for Rating-based Reinforcement Learning", "paper_summary": "Reinforcement learning (RL), a common tool in decision making, learns\npolicies from various experiences based on the associated cumulative\nreturn/rewards without treating them differently. On the contrary, humans often\nlearn to distinguish from different levels of performance and extract the\nunderlying trends towards improving their decision making for best performance.\nMotivated by this, this paper proposes a novel RL method that mimics humans'\ndecision making process by differentiating among collected experiences for\neffective policy learning. The main idea is to extract important directional\ninformation from experiences with different performance levels, named ratings,\nso that policies can be updated towards desired deviation from these\nexperiences with different ratings. Specifically, we propose a new policy loss\nfunction that penalizes distribution similarities between the current policy\nand failed experiences with different ratings, and assign different weights to\nthe penalty terms based on the rating classes. Meanwhile, reward learning from\nthese rated samples can be integrated with the new policy loss towards an\nintegrated reward and policy learning from rated samples. Optimizing the\nintegrated reward and policy loss function will lead to the discovery of\ndirections for policy improvement towards maximizing cumulative rewards and\npenalizing most from the lowest performance level while least from the highest\nperformance level. To evaluate the effectiveness of the proposed method, we\npresent results for experiments on a few typical environments that show\nimproved convergence and overall performance over the existing rating-based\nreinforcement learning method with only reward learning.", "paper_summary_zh": "強化學習 (RL) 是決策制定中常見的工具，它根據相關的累積回報/獎勵從各種經驗中學習策略，而不會對它們進行不同的處理。相反，人類通常學會區分不同的表現層級，並提取改善決策制定以獲得最佳表現的潛在趨勢。受此啟發，本文提出了一種新的 RL 方法，它模擬人類的決策制定過程，通過區分收集的經驗來進行有效的策略學習。其主要思想是從具有不同表現層級的經驗中提取重要的方向性資訊，稱為評分，以便可以針對這些具有不同評分的經驗更新策略，朝著所需的偏差方向發展。具體來說，我們提出了一種新的策略損失函數，它懲罰當前策略與具有不同評分的失敗經驗之間的分配相似性，並根據評分類別為懲罰項分配不同的權重。同時，從這些評分樣本中學習獎勵可以與新的策略損失整合，從而從評分樣本中獲得整合的獎勵和策略學習。最佳化整合的獎勵和策略損失函數將導致發現策略改進的方向，朝著最大化累積獎勵和對最低表現層級進行最嚴厲的懲罰，而對最高表現層級進行最輕微的懲罰。為了評估所提出方法的有效性，我們展示了在幾個典型環境中進行的實驗結果，這些結果顯示出比僅使用獎勵學習的現有基於評分的強化學習方法有更好的收斂性和整體表現。", "author": "Mingkang Wu et.al.", "authors": "Mingkang Wu, Devin White, Vernon Lawhern, Nicholas R. Waytowich, Yongcan Cao", "id": "2501.07502v1", "paper_url": "http://arxiv.org/abs/2501.07502v1", "repo": "null"}}