{"2412.18151": {"publish_time": "2024-12-24", "title": "CoAM: Corpus of All-Type Multiword Expressions", "paper_summary": "Multiword expressions (MWEs) refer to idiomatic sequences of multiple words.\nMWE identification, i.e., detecting MWEs in text, can play a key role in\ndownstream tasks such as machine translation. Existing datasets for MWE\nidentification are inconsistently annotated, limited to a single type of MWE,\nor limited in size. To enable reliable and comprehensive evaluation, we created\nCoAM: Corpus of All-Type Multiword Expressions, a dataset of 1.3K sentences\nconstructed through a multi-step process to enhance data quality consisting of\nhuman annotation, human review, and automated consistency checking. MWEs in\nCoAM are tagged with MWE types, such as Noun and Verb, to enable fine-grained\nerror analysis. Annotations for CoAM were collected using a new interface\ncreated with our interface generator, which allows easy and flexible annotation\nof MWEs in any form, including discontinuous ones. Through experiments using\nCoAM, we find that a fine-tuned large language model outperforms the current\nstate-of-the-art approach for MWE identification. Furthermore, analysis using\nour MWE type tagged data reveals that Verb MWEs are easier than Noun MWEs to\nidentify across approaches.", "paper_summary_zh": "多字詞表達（MWE）指的是多個單字的慣用語序列。\nMWE 識別，即在文字中偵測 MWE，可以在機器翻譯等下游任務中扮演關鍵角色。現有的 MWE 識別資料集標註不一致，僅限於單一類型的 MWE，或規模有限。為了進行可靠且全面的評估，我們建立了 CoAM：全類型多字詞表達語料庫，這是一個包含 1.3K 個句子的資料集，透過多步驟流程建構而成，以提升資料品質，包括人工標註、人工審查和自動化一致性檢查。CoAM 中的 MWE 標註有 MWE 類型，例如名詞和動詞，以進行細緻的錯誤分析。CoAM 的標註是使用我們介面產生器建立的新介面收集而來，它允許輕鬆且彈性地標註任何形式的 MWE，包括不連續的 MWE。透過使用 CoAM 進行實驗，我們發現經過微調的大語言模型優於 MWE 識別的現有最新方法。此外，使用我們標註的 MWE 類型資料進行分析顯示，動詞 MWE 比名詞 MWE 更容易透過各種方法識別。", "author": "Yusuke Ide et.al.", "authors": "Yusuke Ide, Joshua Tanner, Adam Nohejl, Jacob Hoffman, Justin Vasselli, Hidetaka Kamigaito, Taro Watanabe", "id": "2412.18151v1", "paper_url": "http://arxiv.org/abs/2412.18151v1", "repo": "null"}}