{"2410.07095": {"publish_time": "2024-10-09", "title": "MLE-bench: Evaluating Machine Learning Agents on Machine Learning Engineering", "paper_summary": "We introduce MLE-bench, a benchmark for measuring how well AI agents perform\nat machine learning engineering. To this end, we curate 75 ML\nengineering-related competitions from Kaggle, creating a diverse set of\nchallenging tasks that test real-world ML engineering skills such as training\nmodels, preparing datasets, and running experiments. We establish human\nbaselines for each competition using Kaggle's publicly available leaderboards.\nWe use open-source agent scaffolds to evaluate several frontier language models\non our benchmark, finding that the best-performing setup--OpenAI's o1-preview\nwith AIDE scaffolding--achieves at least the level of a Kaggle bronze medal in\n16.9% of competitions. In addition to our main results, we investigate various\nforms of resource scaling for AI agents and the impact of contamination from\npre-training. We open-source our benchmark code (github.com/openai/mle-bench/)\nto facilitate future research in understanding the ML engineering capabilities\nof AI agents.", "paper_summary_zh": "我們推出 MLE-bench，一個用於衡量 AI 代理在機器學習工程方面的表現的基準測試。為此，我們從 Kaggle 精選了 75 個與 ML 工程相關的競賽，建立了一組多樣化的挑戰性任務，用於測試實際的 ML 工程技能，例如訓練模型、準備資料集和執行實驗。我們使用 Kaggle 公開提供的排行榜為每個競賽建立人類基準。我們使用開源代理架構在我們的基準測試中評估了幾個前沿語言模型，發現表現最佳的設置——OpenAI 的 o1-preview 與 AIDE 架構——在 16.9% 的競賽中至少達到 Kaggle 銅牌水準。除了我們的主要結果之外，我們還研究了 AI 代理資源擴充的各種形式以及預訓練造成的污染影響。我們開源了我們的基準測試程式碼 (github.com/openai/mle-bench/)，以利於未來研究了解 AI 代理的 ML 工程能力。", "author": "Jun Shern Chan et.al.", "authors": "Jun Shern Chan, Neil Chowdhury, Oliver Jaffe, James Aung, Dane Sherburn, Evan Mays, Giulio Starace, Kevin Liu, Leon Maksin, Tejal Patwardhan, Lilian Weng, Aleksander Mądry", "id": "2410.07095v1", "paper_url": "http://arxiv.org/abs/2410.07095v1", "repo": "https://github.com/openai/mle-bench"}}