{"2504.11454": {"publish_time": "2025-04-15", "title": "Elucidating the Design Space of Multimodal Protein Language Models", "paper_summary": "Multimodal protein language models (PLMs) integrate sequence and token-based\nstructural information, serving as a powerful foundation for protein modeling,\ngeneration, and design. However, the reliance on tokenizing 3D structures into\ndiscrete tokens causes substantial loss of fidelity about fine-grained\nstructural details and correlations. In this paper, we systematically elucidate\nthe design space of multimodal PLMs to overcome their limitations. We identify\ntokenization loss and inaccurate structure token predictions by the PLMs as\nmajor bottlenecks. To address these, our proposed design space covers improved\ngenerative modeling, structure-aware architectures and representation learning,\nand data exploration. Our advancements approach finer-grained supervision,\ndemonstrating that token-based multimodal PLMs can achieve robust structural\nmodeling. The effective design methods dramatically improve the structure\ngeneration diversity, and notably, folding abilities of our 650M model by\nreducing the RMSD from 5.52 to 2.36 on PDB testset, even outperforming 3B\nbaselines and on par with the specialized folding models.", "paper_summary_zh": "<paragraph>多模態蛋白質語言模型 (PLM) 整合了序列和基於標記的結構信息，為蛋白質建模、生成和設計提供了強大的基礎。然而，將 3D 結構標記化為離散標記的做法會導致關於精細結構細節和相關性的保真度大幅下降。在本文中，我們系統地闡述了多模態 PLM 的設計空間，以克服其局限性。我們將標記化損失和 PLM 對結構標記的不準確預測確定為主要瓶頸。為了應對這些問題，我們提出的設計空間涵蓋了改進的生成模型、結構感知架構和表示學習以及數據探索。我們的進展方法採用了更精細的監督，證明了基於標記的多模態 PLM 可以實現穩健的結構建模。這些有效的設計方法顯著提高了結構生成的豐富性，並且值得注意的是，通過將 PDB 測試集上的 RMSD 從 5.52 降低到 2.36，我們 650M 模型的摺疊能力得到了顯著提升，甚至超過了 3B 基線模型，並與專門的摺疊模型不相上下。</paragraph>\n", "author": "Cheng-Yen Hsieh et.al.", "authors": "Cheng-Yen Hsieh, Xinyou Wang, Daiheng Zhang, Dongyu Xue, Fei Ye, Shujian Huang, Zaixiang Zheng, Quanquan Gu", "id": "2504.11454v2", "paper_url": "http://arxiv.org/abs/2504.11454v2", "repo": "null"}}