{"2501.11335": {"publish_time": "2025-01-20", "title": "Few-shot Policy (de)composition in Conversational Question Answering", "paper_summary": "The task of policy compliance detection (PCD) is to determine if a scenario\nis in compliance with respect to a set of written policies. In a conversational\nsetting, the results of PCD can indicate if clarifying questions must be asked\nto determine compliance status. Existing approaches usually claim to have\nreasoning capabilities that are latent or require a large amount of annotated\ndata. In this work, we propose logical decomposition for policy compliance\n(LDPC): a neuro-symbolic framework to detect policy compliance using large\nlanguage models (LLMs) in a few-shot setting. By selecting only a few exemplars\nalongside recently developed prompting techniques, we demonstrate that our\napproach soundly reasons about policy compliance conversations by extracting\nsub-questions to be answered, assigning truth values from contextual\ninformation, and explicitly producing a set of logic statements from the given\npolicies. The formulation of explicit logic graphs can in turn help answer\nPCDrelated questions with increased transparency and explainability. We apply\nthis approach to the popular PCD and conversational machine reading benchmark,\nShARC, and show competitive performance with no task-specific finetuning. We\nalso leverage the inherently interpretable architecture of LDPC to understand\nwhere errors occur, revealing ambiguities in the ShARC dataset and highlighting\nthe challenges involved with reasoning for conversational question answering.", "paper_summary_zh": "策略合規偵測 (PCD) 的任務是確定場景是否符合一組書面策略。在對話設定中，PCD 的結果可以指出是否必須提出澄清問題以確定合規狀態。現有的方法通常聲稱具有潛在的推理能力，或需要大量的註釋資料。在這項工作中，我們提出策略合規的邏輯分解 (LDPC)：一種使用大型語言模型 (LLM) 在少次嘗試中偵測策略合規的神經符號框架。透過僅選擇少數範例以及最近開發的提示技術，我們證明我們的做法透過提取要回答的子問題、從脈絡資訊指派真值，以及從給定的策略明確產生一組邏輯陳述，對策略合規對話進行合理的推理。明確邏輯圖表的制定反過來可以幫助回答 PCD 相關問題，並提高透明度和可解釋性。我們將此方法應用於熱門的 PCD 和對話式機器閱讀基準 ShARC，並在沒有特定任務微調的情況下展現出競爭力。我們也利用 LDPC 固有的可解釋架構來了解錯誤發生在哪裡，揭露 ShARC 資料集中的歧義，並強調對話式問題解答推理的挑戰。", "author": "Kyle Erwin et.al.", "authors": "Kyle Erwin, Guy Axelrod, Maria Chang, Achille Fokoue, Maxwell Crouse, Soham Dan, Tian Gao, Rosario Uceda-Sosa, Ndivhuwo Makondo, Naweed Khan, Alexander Gray", "id": "2501.11335v1", "paper_url": "http://arxiv.org/abs/2501.11335v1", "repo": "null"}}