{"2412.06654": {"publish_time": "2024-12-09", "title": "GEAR: A Simple GENERATE, EMBED, AVERAGE AND RANK Approach for Unsupervised Reverse Dictionary", "paper_summary": "Reverse Dictionary (RD) is the task of obtaining the most relevant word or\nset of words given a textual description or dictionary definition. Effective RD\nmethods have applications in accessibility, translation or writing support\nsystems. Moreover, in NLP research we find RD to be used to benchmark text\nencoders at various granularities, as it often requires word, definition and\nsentence embeddings. In this paper, we propose a simple approach to RD that\nleverages LLMs in combination with embedding models. Despite its simplicity,\nthis approach outperforms supervised baselines in well studied RD datasets,\nwhile also showing less over-fitting. We also conduct a number of experiments\non different dictionaries and analyze how different styles, registers and\ntarget audiences impact the quality of RD systems. We conclude that, on\naverage, untuned embeddings alone fare way below an LLM-only baseline (although\nthey are competitive in highly technical dictionaries), but are crucial for\nboosting performance in combined methods.", "paper_summary_zh": "逆向詞典 (RD) 是一項任務，即根據文字說明或字典定義取得最相關的字詞或字詞組。有效的 RD 方法在無障礙、翻譯或寫作支援系統中都有應用。此外，在 NLP 研究中，我們發現 RD 被用於對不同粒度的文字編碼器進行基準測試，因為它通常需要字詞、定義和句子嵌入。在本文中，我們提出了一個 RD 的簡單方法，它結合了 LLM 和嵌入模型。儘管很簡單，但這種方法在研究良好的 RD 資料集中優於監督式基準，同時也顯示出較少的過度擬合。我們還對不同的字典進行了多項實驗，並分析了不同的風格、註冊和目標受眾如何影響 RD 系統的品質。我們得出結論，平均而言，未調整的嵌入本身遠低於僅 LLM 的基準（儘管它們在高度技術性的字典中具有競爭力），但對於提升組合方法的效能至關重要。", "author": "Fatemah Almeman et.al.", "authors": "Fatemah Almeman, Luis Espinosa-Anke", "id": "2412.06654v1", "paper_url": "http://arxiv.org/abs/2412.06654v1", "repo": "null"}}