{"2407.07311": {"publish_time": "2024-07-10", "title": "ViTime: A Visual Intelligence-Based Foundation Model for Time Series Forecasting", "paper_summary": "The success of large pretrained models in natural language processing (NLP)\nand computer vision (CV) has opened new avenues for constructing foundation\nmodels for time series forecasting (TSF). Traditional TSF foundation models\nrely heavily on numerical data fitting. In contrast, the human brain is\ninherently skilled at processing visual information, prefer predicting future\ntrends by observing visualized sequences. From a biomimetic perspective,\nutilizing models to directly process numerical sequences might not be the most\neffective route to achieving Artificial General Intelligence (AGI). This paper\nproposes ViTime, a novel Visual Intelligence-based foundation model for TSF.\nViTime overcomes the limitations of numerical time series data fitting by\nutilizing visual data processing paradigms and employs a innovative data\nsynthesis method during training, called Real Time Series (RealTS). Experiments\non a diverse set of previously unseen forecasting datasets demonstrate that\nViTime achieves state-of-the-art zero-shot performance, even surpassing the\nbest individually trained supervised models in some situations. These findings\nsuggest that visual intelligence can significantly enhance time series analysis\nand forecasting, paving the way for more advanced and versatile models in the\nfield. The code for our framework is accessible at\nhttps://github.com/IkeYang/ViTime.", "paper_summary_zh": "大型預訓練模型在自然語言處理 (NLP) 和電腦視覺 (CV) 中的成功，為建構時間序列預測 (TSF) 的基礎模型開啟了新途徑。傳統的 TSF 基礎模型嚴重依賴數字資料擬合。相反地，人腦天生擅長處理視覺資訊，偏好透過觀察視覺化序列來預測未來趨勢。從仿生學的角度來看，使用模型直接處理數字序列可能不是實現人工通用智慧 (AGI) 的最有效途徑。本文提出 ViTime，一種基於視覺智慧的新型 TSF 基礎模型。ViTime 透過利用視覺資料處理範例，克服了數字時間序列資料擬合的限制，並在訓練期間採用創新的資料合成方法，稱為 Real Time Series (RealTS)。在各種先前未見過的預測資料集上進行的實驗證明，ViTime 達到了最先進的零次學習效能，甚至在某些情況下超越了個別訓練的最佳監督模型。這些發現表明，視覺智慧可以顯著增強時間序列分析和預測，為該領域更先進且多功能的模型鋪平道路。我們架構的程式碼可於 https://github.com/IkeYang/ViTime 取得。", "author": "Luoxiao Yang et.al.", "authors": "Luoxiao Yang, Yun Wang, Xinqi Fan, Israel Cohen, Yue Zhao, Zijun Zhang", "id": "2407.07311v1", "paper_url": "http://arxiv.org/abs/2407.07311v1", "repo": "https://github.com/ikeyang/vitime"}}