{"2411.05897": {"publish_time": "2024-11-08", "title": "Humans Continue to Outperform Large Language Models in Complex Clinical Decision-Making: A Study with Medical Calculators", "paper_summary": "Although large language models (LLMs) have been assessed for general medical\nknowledge using medical licensing exams, their ability to effectively support\nclinical decision-making tasks, such as selecting and using medical\ncalculators, remains uncertain. Here, we evaluate the capability of both\nmedical trainees and LLMs to recommend medical calculators in response to\nvarious multiple-choice clinical scenarios such as risk stratification,\nprognosis, and disease diagnosis. We assessed eight LLMs, including\nopen-source, proprietary, and domain-specific models, with 1,009\nquestion-answer pairs across 35 clinical calculators and measured human\nperformance on a subset of 100 questions. While the highest-performing LLM,\nGPT-4o, provided an answer accuracy of 74.3% (CI: 71.5-76.9%), human\nannotators, on average, outperformed LLMs with an accuracy of 79.5% (CI:\n73.5-85.0%). With error analysis showing that the highest-performing LLMs\ncontinue to make mistakes in comprehension (56.6%) and calculator knowledge\n(8.1%), our findings emphasize that humans continue to surpass LLMs on complex\nclinical tasks such as calculator recommendation.", "paper_summary_zh": "儘管大型語言模型 (LLM) 已使用醫學執照考試評估其一般醫學知識，但它們有效支援臨床決策任務（例如選擇和使用醫學計算器）的能力仍不確定。在此，我們評估醫學受訓者和 LLM 推薦醫學計算器的能力，以回應各種多選題臨床情境，例如風險分層、預後和疾病診斷。我們評估了八個 LLM，包括開源、專有和特定領域的模型，其中包含 35 個臨床計算器的 1,009 個問答對，並測量了人類在 100 個問題子集上的表現。表現最佳的 LLM GPT-4o 提供了 74.3% 的回答準確度 (CI：71.5-76.9%)，而人類註解者平均表現優於 LLM，準確度為 79.5% (CI：73.5-85.0%)。錯誤分析顯示，表現最佳的 LLM 在理解 (56.6%) 和計算器知識 (8.1%) 方面仍會犯錯，我們的研究結果強調，人類在計算器推薦等複雜臨床任務上仍然優於 LLM。", "author": "Nicholas Wan et.al.", "authors": "Nicholas Wan, Qiao Jin, Joey Chan, Guangzhi Xiong, Serina Applebaum, Aidan Gilson, Reid McMurry, R. Andrew Taylor, Aidong Zhang, Qingyu Chen, Zhiyong Lu", "id": "2411.05897v1", "paper_url": "http://arxiv.org/abs/2411.05897v1", "repo": "null"}}