{"2411.03795": {"publish_time": "2024-11-06", "title": "VQA$^2$:Visual Question Answering for Video Quality Assessment", "paper_summary": "The advent and proliferation of large multi-modal models (LMMs) have\nintroduced a new paradigm to video-related computer vision fields, including\ntraining and inference methods based on visual question answering (VQA). These\nmethods enable models to handle multiple downstream tasks robustly. Video\nQuality Assessment (VQA), a classic field in low-level visual quality\nevaluation, originally focused on quantitative video quality scoring. However,\ndriven by advances in LMMs, it is now evolving towards more comprehensive\nvisual quality understanding tasks. Visual question answering has significantly\nimproved low-level visual evaluation within the image domain recently. However,\nrelated work is almost nonexistent in the video domain, leaving substantial\nroom for improvement. To address this gap, we introduce the VQA2 Instruction\nDataset the first visual question answering instruction dataset entirely\nfocuses on video quality assessment, and based on it, we propose the VQA2\nseries models The VQA2 Instruction Dataset consists of three stages and covers\nvarious video types, containing 157,735 instruction question-answer pairs,\nincluding both manually annotated and synthetic data. We conduct extensive\nexperiments on both video quality scoring and video quality understanding\ntasks. Results demonstrate that the VQA2 series models achieve state-of-the-art\n(SOTA) performance in quality scoring tasks, and their performance in visual\nquality question answering surpasses the renowned GPT-4o. Additionally, our\nfinal model, the VQA2-Assistant, performs well across both scoring and\nquestion-answering tasks, validating its versatility.", "paper_summary_zh": "大型多模态模型 (LMM) 的出现和普及为视频相关的计算机视觉领域引入了一种新范例，包括基于视觉问答 (VQA) 的训练和推理方法。这些方法使模型能够稳健地处理多个下游任务。视频质量评估 (VQA) 是低级视觉质量评估中的一个经典领域，最初专注于定量视频质量评分。然而，在 LMM 的推动下，它现在正朝着更全面的视觉质量理解任务发展。视觉问答最近显着改善了图像域中的低级视觉评估。然而，在视频域中几乎不存在相关工作，留下了很大的改进空间。为了解决这一差距，我们引入了 VQA2 指令数据集，这是第一个完全专注于视频质量评估的视觉问答指令数据集，并在此基础上，我们提出了 VQA2 系列模型。VQA2 指令数据集包含三个阶段，涵盖各种视频类型，包含 157,735 个指令问答对，包括人工注释数据和合成数据。我们对视频质量评分和视频质量理解任务进行了广泛的实验。结果表明，VQA2 系列模型在质量评分任务中实现了最先进 (SOTA) 的性能，并且它们在视觉质量问答中的性能超过了著名的 GPT-4o。此外，我们的最终模型 VQA2-Assistant 在评分和问答任务中都表现良好，验证了它的多功能性。", "author": "Ziheng Jia et.al.", "authors": "Ziheng Jia, Zicheng Zhang, Jiaying Qian, Haoning Wu, Wei Sun, Chunyi Li, Xiaohong Liu, Weisi Lin, Guangtao Zhai, Xiongkuo Min", "id": "2411.03795v1", "paper_url": "http://arxiv.org/abs/2411.03795v1", "repo": "null"}}