{"2408.11288": {"publish_time": "2024-08-21", "title": "Applying and Evaluating Large Language Models in Mental Health Care: A Scoping Review of Human-Assessed Generative Tasks", "paper_summary": "Large language models (LLMs) are emerging as promising tools for mental\nhealth care, offering scalable support through their ability to generate\nhuman-like responses. However, the effectiveness of these models in clinical\nsettings remains unclear. This scoping review aimed to assess the current\ngenerative applications of LLMs in mental health care, focusing on studies\nwhere these models were tested with human participants in real-world scenarios.\nA systematic search across APA PsycNet, Scopus, PubMed, and Web of Science\nidentified 726 unique articles, of which 17 met the inclusion criteria. These\nstudies encompassed applications such as clinical assistance, counseling,\ntherapy, and emotional support. However, the evaluation methods were often\nnon-standardized, with most studies relying on ad hoc scales that limit\ncomparability and robustness. Privacy, safety, and fairness were also\nfrequently underexplored. Moreover, reliance on proprietary models, such as\nOpenAI's GPT series, raises concerns about transparency and reproducibility.\nWhile LLMs show potential in expanding mental health care access, especially in\nunderserved areas, the current evidence does not fully support their use as\nstandalone interventions. More rigorous, standardized evaluations and ethical\noversight are needed to ensure these tools can be safely and effectively\nintegrated into clinical practice.", "paper_summary_zh": "大型語言模型 (LLM) 正作為心理保健的工具浮現，透過產生類人的回應提供可擴充的支持。然而，這些模型在臨床環境中的有效性仍不明確。本範圍探討旨在評估 LLM 在心理保健中的現有生成應用，重點在於在真實世界情境中以人類參與者測試這些模型的研究。系統性搜尋 APA PsycNet、Scopus、PubMed 和 Web of Science 找出 726 篇獨特文章，其中 17 篇符合納入標準。這些研究涵蓋臨床協助、諮詢、治療和情緒支持等應用。然而，評估方法通常未標準化，大多數研究依賴於限制可比較性和穩健性的臨時量表。隱私、安全和公平性也經常未充分探討。此外，依賴於專有模型（例如 OpenAI 的 GPT 系列）會引發對透明度和可複製性的疑慮。雖然 LLM 在擴展心理保健服務方面展現潛力，特別是在服務不足的地區，但目前的證據並不完全支持將其用作獨立干預措施。需要更嚴謹、標準化的評估和倫理監督，以確保這些工具能安全且有效地整合到臨床實務中。", "author": "Yining Hua et.al.", "authors": "Yining Hua, Hongbin Na, Zehan Li, Fenglin Liu, Xiao Fang, David Clifton, John Torous", "id": "2408.11288v1", "paper_url": "http://arxiv.org/abs/2408.11288v1", "repo": "null"}}