{"2408.05618": {"publish_time": "2024-08-10", "title": "UrFound: Towards Universal Retinal Foundation Models via Knowledge-Guided Masked Modeling", "paper_summary": "Retinal foundation models aim to learn generalizable representations from\ndiverse retinal images, facilitating label-efficient model adaptation across\nvarious ophthalmic tasks. Despite their success, current retinal foundation\nmodels are generally restricted to a single imaging modality, such as Color\nFundus Photography (CFP) or Optical Coherence Tomography (OCT), limiting their\nversatility. Moreover, these models may struggle to fully leverage expert\nannotations and overlook the valuable domain knowledge essential for\ndomain-specific representation learning. To overcome these limitations, we\nintroduce UrFound, a retinal foundation model designed to learn universal\nrepresentations from both multimodal retinal images and domain knowledge.\nUrFound is equipped with a modality-agnostic image encoder and accepts either\nCFP or OCT images as inputs. To integrate domain knowledge into representation\nlearning, we encode expert annotation in text supervision and propose a\nknowledge-guided masked modeling strategy for model pre-training. It involves\nreconstructing randomly masked patches of retinal images while predicting\nmasked text tokens conditioned on the corresponding retinal image. This\napproach aligns multimodal images and textual expert annotations within a\nunified latent space, facilitating generalizable and domain-specific\nrepresentation learning. Experimental results demonstrate that UrFound exhibits\nstrong generalization ability and data efficiency when adapting to various\ntasks in retinal image analysis. By training on ~180k retinal images, UrFound\nsignificantly outperforms the state-of-the-art retinal foundation model trained\non up to 1.6 million unlabelled images across 8 public retinal datasets. Our\ncode and data are available at https://github.com/yukkai/UrFound.", "paper_summary_zh": "視網膜基礎模型旨在從多種視網膜影像中學習可概括的表徵，促進各種眼科任務中標籤有效率的模型適應。儘管它們成功，目前的視網膜基礎模型通常僅限於單一影像型態，例如彩色眼底攝影 (CFP) 或光學相干斷層掃描 (OCT)，限制了它們的多功能性。此外，這些模型可能難以充分利用專家註解，並忽略了對特定領域表徵學習至關重要的寶貴領域知識。為了克服這些限制，我們引入了 UrFound，這是一個視網膜基礎模型，旨在從多模式視網膜影像和領域知識中學習通用表徵。UrFound 配備了與型態無關的影像編碼器，並接受 CFP 或 OCT 影像作為輸入。為了將領域知識整合到表徵學習中，我們在文字監督中編碼專家註解，並提出了一種知識引導的遮罩建模策略，用於模型預訓練。它涉及在預測遮罩文字符號（以對應的視網膜影像為條件）的同時，重建視網膜影像的隨機遮罩區塊。此方法在統一的潛在空間中對齊了多模式影像和文字專家註解，促進了可概括且特定於領域的表徵學習。實驗結果表明，UrFound 在適應視網膜影像分析中的各種任務時，展現出強大的概括能力和資料效率。透過訓練約 18 萬張視網膜影像，UrFound 在 8 個公開視網膜資料集上顯著優於訓練超過 160 萬張未標籤影像的最新視網膜基礎模型。我們的程式碼和資料可在 https://github.com/yukkai/UrFound 取得。", "author": "Kai Yu et.al.", "authors": "Kai Yu, Yang Zhou, Yang Bai, Zhi Da Soh, Xinxing Xu, Rick Siow Mong Goh, Ching-Yu Cheng, Yong Liu", "id": "2408.05618v1", "paper_url": "http://arxiv.org/abs/2408.05618v1", "repo": "https://github.com/yukkai/urfound"}}