{"2412.17332": {"publish_time": "2024-12-23", "title": "A Dual-Perspective Metaphor Detection Framework Using Large Language Models", "paper_summary": "Metaphor detection, a critical task in natural language processing, involves\nidentifying whether a particular word in a sentence is used metaphorically.\nTraditional approaches often rely on supervised learning models that implicitly\nencode semantic relationships based on metaphor theories. However, these\nmethods often suffer from a lack of transparency in their decision-making\nprocesses, which undermines the reliability of their predictions. Recent\nresearch indicates that LLMs (large language models) exhibit significant\npotential in metaphor detection. Nevertheless, their reasoning capabilities are\nconstrained by predefined knowledge graphs. To overcome these limitations, we\npropose DMD, a novel dual-perspective framework that harnesses both implicit\nand explicit applications of metaphor theories to guide LLMs in metaphor\ndetection and adopts a self-judgment mechanism to validate the responses from\nthe aforementioned forms of guidance. In comparison to previous methods, our\nframework offers more transparent reasoning processes and delivers more\nreliable predictions. Experimental results prove the effectiveness of DMD,\ndemonstrating state-of-the-art performance across widely-used datasets.", "paper_summary_zh": "隱喻偵測是自然語言處理中的一項重要任務，涉及識別句子中特定單字是否以隱喻方式使用。傳統方法通常依賴監督式學習模型，這些模型根據隱喻理論隱含編碼語義關係。然而，這些方法通常在決策過程中缺乏透明度，這會損害其預測的可靠性。最近的研究表明，LLM（大型語言模型）在隱喻偵測中展現出顯著的潛力。儘管如此，它們的推理能力受到預定義知識圖表的限制。為了克服這些限制，我們提出了 DMD，這是一種新穎的雙重觀點架構，它利用隱喻理論的隱含和明確應用來引導 LLM 進行隱喻偵測，並採用自我判斷機制來驗證上述指導形式的回應。與先前的模型相比，我們的架構提供了更透明的推理過程，並提供了更可靠的預測。實驗結果證明了 DMD 的有效性，證明了在廣泛使用的資料集中的最先進效能。", "author": "Yujie Lin et.al.", "authors": "Yujie Lin, Jingyao Liu, Yan Gao, Ante Wang, Jinsong Su", "id": "2412.17332v2", "paper_url": "http://arxiv.org/abs/2412.17332v2", "repo": "https://github.com/deeplearnxmu/dmd"}}