{"2502.15294": {"publish_time": "2025-02-21", "title": "Round Attention: A Novel Round-Level Attention Mechanism to Accelerate LLM Inference", "paper_summary": "The increasing context window size in large language models (LLMs) has\nimproved their ability to handle complex, long-text tasks. However, as the\nconversation rounds continue, it is required to store a large amount of KV\ncache in GPU memory, which significantly affects the efficiency and even\navailability of the model serving systems. This paper analyzes dialogue data\nfrom real users and discovers that the LLM inference manifests a watershed\nlayer, after which the distribution of round-level attention shows notable\nsimilarity. We propose Round Attention, a novel round-level attention mechanism\nthat only recalls and computes the KV cache of the most relevant rounds. The\nexperiments show that our method saves 55\\% memory usage without compromising\nmodel performance.", "paper_summary_zh": "大型語言模型 (LLM) 中不斷增加的上下文視窗大小已提升其處理複雜、長文本任務的能力。然而，隨著對話回合的持續進行，需要在 GPU 記憶體中儲存大量的 KV 快取，這會顯著影響模型服務系統的效率，甚至可用性。本文分析了來自真實使用者的對話資料，並發現 LLM 推論呈現分水嶺層，在此之後，回合層級注意力的分布顯示出顯著的相似性。我們提出回合注意力，一種新穎的回合層級注意力機制，它只會回溯並計算最相關回合的 KV 快取。實驗顯示，我們的模型在不影響模型效能的情況下，節省了 55% 的記憶體使用量。", "author": "Yaohua Tang et.al.", "authors": "Yaohua Tang, Zhicheng Hu, Kun Cheng, Fan Mo, Qiheng Lv, Hua Wang, Zhi Chen", "id": "2502.15294v1", "paper_url": "http://arxiv.org/abs/2502.15294v1", "repo": "null"}}