{"2407.21151": {"publish_time": "2024-07-30", "title": "Private Collaborative Edge Inference via Over-the-Air Computation", "paper_summary": "We consider collaborative inference at the wireless edge, where each client's\nmodel is trained independently on their local datasets. Clients are queried in\nparallel to make an accurate decision collaboratively. In addition to\nmaximizing the inference accuracy, we also want to ensure the privacy of local\nmodels. To this end, we leverage the superposition property of the multiple\naccess channel to implement bandwidth-efficient multi-user inference methods.\nSpecifically, we propose different methods for ensemble and multi-view\nclassification that exploit over-the-air computation. We show that these\nschemes perform better than their orthogonal counterparts with statistically\nsignificant differences while using fewer resources and providing privacy\nguarantees. We also provide experimental results verifying the benefits of the\nproposed over-the-air multi-user inference approach and perform an ablation\nstudy to demonstrate the effectiveness of our design choices. We share the\nsource code of the framework publicly on Github to facilitate further research\nand reproducibility.", "paper_summary_zh": "我們在無線邊緣考慮協作推論，其中每個客戶端的模型都是獨立在他們的本地資料集上訓練的。客戶端會被平行查詢以協作做出準確的決策。除了最大化推論準確性之外，我們也想要確保本地模型的隱私性。為此，我們利用多重存取通道的疊加屬性來實作頻寬效率高的多使用者推論方法。具體來說，我們提出不同的方法用於整體和多視角分類，利用空中運算。我們展示這些方案比它們的正交對應方案表現得更好，具有統計上的顯著差異，同時使用較少的資源並提供隱私保證。我們還提供實驗結果，驗證所提出的空中多使用者推論方法的優點，並進行消融研究以證明我們的設計選擇的有效性。我們在 Github 上公開分享框架的原始碼，以利於進一步的研究和重現性。", "author": "Selim F. Yilmaz et.al.", "authors": "Selim F. Yilmaz, Burak Hasircioglu, Li Qiao, Deniz Gunduz", "id": "2407.21151v1", "paper_url": "http://arxiv.org/abs/2407.21151v1", "repo": "null"}}