{"2408.11804": {"publish_time": "2024-08-21", "title": "Approaching Deep Learning through the Spectral Dynamics of Weights", "paper_summary": "We propose an empirical approach centered on the spectral dynamics of weights\n-- the behavior of singular values and vectors during optimization -- to unify\nand clarify several phenomena in deep learning. We identify a consistent bias\nin optimization across various experiments, from small-scale ``grokking'' to\nlarge-scale tasks like image classification with ConvNets, image generation\nwith UNets, speech recognition with LSTMs, and language modeling with\nTransformers. We also demonstrate that weight decay enhances this bias beyond\nits role as a norm regularizer, even in practical systems. Moreover, we show\nthat these spectral dynamics distinguish memorizing networks from generalizing\nones, offering a novel perspective on this longstanding conundrum.\nAdditionally, we leverage spectral dynamics to explore the emergence of\nwell-performing sparse subnetworks (lottery tickets) and the structure of the\nloss surface through linear mode connectivity. Our findings suggest that\nspectral dynamics provide a coherent framework to better understand the\nbehavior of neural networks across diverse settings.", "paper_summary_zh": "我們提出一個專注於權重光譜動態的經驗方法，包括最佳化過程中奇異值和向量的行為，以統一和釐清深度學習中的幾個現象。我們在各種實驗中發現最佳化的持續偏差，從小規模的「理解」到使用 ConvNet 的大規模影像分類任務、使用 UNet 的影像產生、使用 LSTM 的語音辨識，以及使用 Transformer 的語言模型。我們也示範權重衰減會強化這種偏差，超越其作為範例正則化的角色，即使在實際的系統中也是如此。此外，我們顯示這些光譜動態將記憶網路與概括網路區分開來，提供了一個關於這個長期難題的新觀點。此外，我們利用光譜動態來探索效能良好的稀疏子網路（樂透券）的出現，以及透過線性模式連通性了解損失曲面的結構。我們的發現表明，光譜動態提供了一個連貫的架構，以便在不同的設定中更好地理解神經網路的行為。", "author": "David Yunis et.al.", "authors": "David Yunis, Kumar Kshitij Patel, Samuel Wheeler, Pedro Savarese, Gal Vardi, Karen Livescu, Michael Maire, Matthew R. Walter", "id": "2408.11804v1", "paper_url": "http://arxiv.org/abs/2408.11804v1", "repo": "https://github.com/dyunis/spectral_dynamics"}}