{"2408.09629": {"publish_time": "2024-08-19", "title": "A Strategy to Combine 1stGen Transformers and Open LLMs for Automatic Text Classification", "paper_summary": "Transformer models have achieved state-of-the-art results, with Large\nLanguage Models (LLMs), an evolution of first-generation transformers (1stTR),\nbeing considered the cutting edge in several NLP tasks. However, the literature\nhas yet to conclusively demonstrate that LLMs consistently outperform 1stTRs\nacross all NLP tasks. This study compares three 1stTRs (BERT, RoBERTa, and\nBART) with two open LLMs (Llama 2 and Bloom) across 11 sentiment analysis\ndatasets. The results indicate that open LLMs may moderately outperform or\nmatch 1stTRs in 8 out of 11 datasets but only when fine-tuned. Given this\nsubstantial cost for only moderate gains, the practical applicability of these\nmodels in cost-sensitive scenarios is questionable. In this context, a\nconfidence-based strategy that seamlessly integrates 1stTRs with open LLMs\nbased on prediction certainty is proposed. High-confidence documents are\nclassified by the more cost-effective 1stTRs, while uncertain cases are handled\nby LLMs in zero-shot or few-shot modes, at a much lower cost than fine-tuned\nversions. Experiments in sentiment analysis demonstrate that our solution not\nonly outperforms 1stTRs, zero-shot, and few-shot LLMs but also competes closely\nwith fine-tuned LLMs at a fraction of the cost.", "paper_summary_zh": "Transformer模型已取得最先進的成果，大型語言模型 (LLM) 作為第一代Transformer (1stTR) 的演進，被認為是多項 NLP 任務的尖端技術。然而，文獻尚未確鑿地證明，LLM 在所有 NLP 任務中都持續優於 1stTR。本研究比較了三個 1stTR（BERT、RoBERTa 和 BART）與兩個開放式 LLM（Llama 2 和 Bloom），涵蓋 11 個情緒分析資料集。結果顯示，開放式 LLM 在 11 個資料集中有 8 個資料集可能適度優於或匹配 1stTR，但僅限於微調時。考量到微調僅能帶來適度的增益，但成本卻相當高，這些模型在成本敏感場景中的實際適用性令人質疑。在此脈絡下，提出了一種基於信心的策略，可根據預測確定性將 1stTR 與開放式 LLM 無縫整合。由較具成本效益的 1stTR 分類高信心文件，而由 LLM 在零次學習或少次學習模式中處理不確定的案例，成本遠低於微調版本。情緒分析的實驗證明，我們的解決方案不僅優於 1stTR、零次學習和少次學習 LLM，而且在成本僅為微調 LLM 的一小部分下，也能與微調 LLM 緊密競爭。", "author": "Claudio M. V. de Andrade et.al.", "authors": "Claudio M. V. de Andrade, Washington Cunha, Davi Reis, Adriana Silvina Pagano, Leonardo Rocha, Marcos André Gonçalves", "id": "2408.09629v1", "paper_url": "http://arxiv.org/abs/2408.09629v1", "repo": "null"}}