{"2410.12757": {"publish_time": "2024-10-16", "title": "StyleDistance: Stronger Content-Independent Style Embeddings with Synthetic Parallel Examples", "paper_summary": "Style representations aim to embed texts with similar writing styles closely\nand texts with different styles far apart, regardless of content. However, the\ncontrastive triplets often used for training these representations may vary in\nboth style and content, leading to potential content leakage in the\nrepresentations. We introduce StyleDistance, a novel approach to training\nstronger content-independent style embeddings. We use a large language model to\ncreate a synthetic dataset of near-exact paraphrases with controlled style\nvariations, and produce positive and negative examples across 40 distinct style\nfeatures for precise contrastive learning. We assess the quality of our\nsynthetic data and embeddings through human and automatic evaluations.\nStyleDistance enhances the content-independence of style embeddings, which\ngeneralize to real-world benchmarks and outperform leading style\nrepresentations in downstream applications. Our model can be found at\nhttps://huggingface.co/StyleDistance/styledistance .", "paper_summary_zh": "風格表示旨在將具有相似寫作風格的文本緊密嵌入，而將具有不同風格的文本遠遠分開，而不管內容如何。然而，通常用於訓練這些表示的對比三元組可能在風格和內容上有所不同，從而導致表示中潛在的內容洩漏。我們引入了 StyleDistance，這是一種訓練更強大的與內容無關的風格嵌入的新方法。我們使用一個大型語言模型來創建一個具有受控風格變化的近似同義詞的合成數據集，並針對 40 個不同的風格特徵產生正例和反例，以進行精確的對比學習。我們通過人工和自動評估來評估我們合成數據和嵌入的質量。StyleDistance 增強了風格嵌入的內容獨立性，它可以推廣到現實世界的基準，並且在下游應用中優於領先的風格表示。我們的模型可以在 https://huggingface.co/StyleDistance/styledistance 找到。", "author": "Ajay Patel et.al.", "authors": "Ajay Patel, Jiacheng Zhu, Justin Qiu, Zachary Horvitz, Marianna Apidianaki, Kathleen McKeown, Chris Callison-Burch", "id": "2410.12757v1", "paper_url": "http://arxiv.org/abs/2410.12757v1", "repo": "null"}}