{"2407.06537": {"publish_time": "2024-07-09", "title": "Efficient and Accurate Memorable Conversation Model using DPO based on sLLM", "paper_summary": "In multi-session dialog system, it is essential to continuously update the\nmemory as the session progresses. Simply accumulating memory can make it\ndifficult to focus on the content of the conversation for inference due to the\nlimited input sentence size. Therefore, efficient and accurate conversation\nmodel that is capable of managing memory to reflect the conversation history\ncontinuously is necessary. This paper presents a conversation model that\nefficiently manages memory as sessions progress and incorporates this into the\nmodel to reflect the conversation history accurately with 3 methodologies: SFT,\nDPO and DPO with SFT model. Our model using DPO algorithm shows an improvement\nabout 0.0591 of BERTScore in memory accuracy, and the rate of responses\nreflecting the memory increased as well. Also, response generation performance\nenhanced about 4.292 in fluency, 3.935 in coherence, and 2.896 in consistency.\nThis paper describes a training method that yields better performance than\nmodels with more than twice the parameter size, even when the model size is\nsmaller. Thus, our model demonstrates efficiency not only in terms of accuracy\nbut also in resource utilization.", "paper_summary_zh": "在多輪對話系統中，隨著對話的進行，持續更新記憶體至關重要。由於輸入句子的長度有限，簡單地累積記憶體會使得在推論時難以專注於對話內容。因此，需要一個有效且準確的對話模型，能夠管理記憶體以持續反映對話記錄。本文提出了一個對話模型，它能有效管理記憶體，隨著對話的進行，並透過 SFT、DPO 和結合 SFT 的 DPO 模型，將其整合到模型中，以準確反映對話記錄。使用 DPO 演算法的模型在記憶體準確度方面顯示出 BERT 分數提升了約 0.0591，並且反映記憶體的回應率也有所提升。此外，回應產生的流暢度提升了約 4.292、連貫性提升了 3.935、一致性提升了 2.896。本文描述了一種訓練方法，即使模型規模較小，也能產生比參數規模大兩倍以上的模型更好的效能。因此，我們的模型不僅在準確性方面展現了效率，在資源利用方面也展現了效率。", "author": "Youngkyung Seo et.al.", "authors": "Youngkyung Seo, Yoonseok Heo, Jun-Seok Koh, Du-Seoung Chang", "id": "2407.06537v1", "paper_url": "http://arxiv.org/abs/2407.06537v1", "repo": "null"}}