{"2404.05587": {"publish_time": "2024-04-08", "title": "Enhancing Software-Related Information Extraction via Single-Choice Question Answering with Large Language Models", "paper_summary": "This paper describes our participation in the Shared Task on Software\nMentions Disambiguation (SOMD), with a focus on improving relation extraction\nin scholarly texts through generative Large Language Models (LLMs) using\nsingle-choice question-answering. The methodology prioritises the use of\nin-context learning capabilities of GLMs to extract software-related entities\nand their descriptive attributes, such as distributive information. Our\napproach uses Retrieval-Augmented Generation (RAG) techniques and GLMs for\nNamed Entity Recognition (NER) and Attributive NER to identify relationships\nbetween extracted software entities, providing a structured solution for\nanalysing software citations in academic literature. The paper provides a\ndetailed description of our approach, demonstrating how using GLMs in a\nsingle-choice QA paradigm can greatly enhance IE methodologies. Our\nparticipation in the SOMD shared task highlights the importance of precise\nsoftware citation practices and showcases our system's ability to overcome the\nchallenges of disambiguating and extracting relationships between software\nmentions. This sets the groundwork for future research and development in this\nfield.", "paper_summary_zh": "本文描述我們參與軟體提及消歧義（SOMD）的共享任務，重點在於透過單選問答使用生成式大型語言模型（LLM）來改善學術文本中的關係萃取。此方法優先使用 GLM 的脈絡學習能力來萃取與軟體相關的實體及其描述性屬性，例如分佈式資訊。我們的做法使用檢索擴充生成（RAG）技術和 GLM 來進行命名實體辨識（NER）和屬性 NER，以找出萃取的軟體實體之間的關係，為分析學術文獻中的軟體引文提供結構化解決方案。本文詳細說明我們的做法，展示如何在單選問答範例中使用 GLM 可以大幅提升 IE 方法。我們參與 SOMD 共享任務突顯了精確軟體引文實務的重要性，並展示我們的系統克服軟體提及消歧義和關係萃取挑戰的能力。這為此領域的未來研究和發展奠定基礎。", "author": "Wolfgang Otto et.al.", "authors": "Wolfgang Otto, Sharmila Upadhyaya, Stefan Dietze", "id": "2404.05587v2", "paper_url": "http://arxiv.org/abs/2404.05587v2", "repo": "null"}}