{"2407.06189": {"publish_time": "2024-07-08", "title": "Video-STaR: Self-Training Enables Video Instruction Tuning with Any Supervision", "paper_summary": "The performance of Large Vision Language Models (LVLMs) is dependent on the\nsize and quality of their training datasets. Existing video instruction tuning\ndatasets lack diversity as they are derived by prompting large language models\nwith video captions to generate question-answer pairs, and are therefore mostly\ndescriptive. Meanwhile, many labeled video datasets with diverse labels and\nsupervision exist - however, we find that their integration into LVLMs is\nnon-trivial. Herein, we present Video Self-Training with augmented Reasoning\n(Video-STaR), the first video self-training approach. Video-STaR allows the\nutilization of any labeled video dataset for video instruction tuning. In\nVideo-STaR, an LVLM cycles between instruction generation and finetuning, which\nwe show (I) improves general video understanding and (II) adapts LVLMs to novel\ndownstream tasks with existing supervision. During generation, an LVLM is\nprompted to propose an answer. The answers are then filtered only to those that\ncontain the original video labels, and the LVLM is then re-trained on the\ngenerated dataset. By only training on generated answers that contain the\ncorrect video labels, Video-STaR utilizes these existing video labels as weak\nsupervision for video instruction tuning. Our results demonstrate that\nVideo-STaR-enhanced LVLMs exhibit improved performance in (I) general video QA,\nwhere TempCompass performance improved by 10%, and (II) on downstream tasks,\nwhere Video-STaR improved Kinetics700-QA accuracy by 20% and action quality\nassessment on FineDiving by 15%.", "paper_summary_zh": "大型視覺語言模型 (LVLMs) 的效能取決於其訓練資料集的大小和品質。現有的影片說明調整資料集缺乏多樣性，因為它們是透過提示大型語言模型使用影片字幕來產生問答配對而衍生出來的，因此大多是描述性的。同時，存在許多具有多樣化標籤和監督的標籤影片資料集，但我們發現將它們整合到 LVLMs 中並非易事。在此，我們提出帶有擴充推理的影片自訓練（Video-STaR），這是一種首創的影片自訓練方法。Video-STaR 允許利用任何標籤影片資料集進行影片說明調整。在 Video-STaR 中，LVLM 在說明產生和微調之間循環，我們證明這（一）改善了對影片的整體理解，且（二）讓 LVLMs 適應現有監督的新下游任務。在產生過程中，會提示 LVLM 提出答案。然後，答案會過濾，僅保留包含原始影片標籤的答案，接著在產生的資料集上重新訓練 LVLM。Video-STaR 僅訓練包含正確影片標籤的產生答案，利用這些現有的影片標籤作為影片說明調整的弱監督。我們的結果證明，Video-STaR 增強的 LVLMs 在（一）一般影片問答中表現出更好的效能，其中 TempCompass 的效能提升了 10%，以及（二）下游任務中，其中 Video-STaR 將 Kinetics700-QA 的準確度提升了 20%，並將 FineDiving 的動作品質評估提升了 15%。", "author": "Orr Zohar et.al.", "authors": "Orr Zohar, Xiaohan Wang, Yonatan Bitton, Idan Szpektor, Serena Yeung-Levy", "id": "2407.06189v1", "paper_url": "http://arxiv.org/abs/2407.06189v1", "repo": "null"}}