{"2502.13092": {"publish_time": "2025-02-18", "title": "Text2World: Benchmarking Large Language Models for Symbolic World Model Generation", "paper_summary": "Recently, there has been growing interest in leveraging large language models\n(LLMs) to generate symbolic world models from textual descriptions. Although\nLLMs have been extensively explored in the context of world modeling, prior\nstudies encountered several challenges, including evaluation randomness,\ndependence on indirect metrics, and a limited domain scope. To address these\nlimitations, we introduce a novel benchmark, Text2World, based on planning\ndomain definition language (PDDL), featuring hundreds of diverse domains and\nemploying multi-criteria, execution-based metrics for a more robust evaluation.\nWe benchmark current LLMs using Text2World and find that reasoning models\ntrained with large-scale reinforcement learning outperform others. However,\neven the best-performing model still demonstrates limited capabilities in world\nmodeling. Building on these insights, we examine several promising strategies\nto enhance the world modeling capabilities of LLMs, including test-time\nscaling, agent training, and more. We hope that Text2World can serve as a\ncrucial resource, laying the groundwork for future research in leveraging LLMs\nas world models. The project page is available at\nhttps://text-to-world.github.io/.", "paper_summary_zh": "最近，人们越来越有兴趣利用大型语言模型（LLM）从文本描述中生成符号世界模型。尽管 LLM 已在世界建模的背景下得到广泛探索，但先前的研究遇到了若干挑战，包括评估随机性、对间接指标的依赖以及有限的领域范围。为了解决这些限制，我们引入了基于规划域定义语言（PDDL）的新基准 Text2World，该基准包含数百个不同的域，并采用基于执行的多标准指标来进行更稳健的评估。我们使用 Text2World 对当前的 LLM 进行了基准测试，发现使用大规模强化学习训练的推理模型优于其他模型。然而，即使是性能最佳的模型在世界建模方面仍然表现出有限的能力。基于这些见解，我们研究了几种有希望的策略来增强 LLM 的世界建模能力，包括测试时缩放、代理训练等等。我们希望 Text2World 能够作为一项至关重要的资源，为未来利用 LLM 作为世界模型的研究奠定基础。项目页面可在 https://text-to-world.github.io/ 获得。", "author": "Mengkang Hu et.al.", "authors": "Mengkang Hu, Tianxing Chen, Yude Zou, Yuheng Lei, Qiguang Chen, Ming Li, Hongyuan Zhang, Wenqi Shao, Ping Luo", "id": "2502.13092v1", "paper_url": "http://arxiv.org/abs/2502.13092v1", "repo": "null"}}