{"2411.18923": {"publish_time": "2024-11-28", "title": "EzSQL: An SQL intermediate representation for improving SQL-to-text Generation", "paper_summary": "The SQL-to-text generation task traditionally uses template base, Seq2Seq,\ntree-to-sequence, and graph-to-sequence models. Recent models take advantage of\npre-trained generative language models for this task in the Seq2Seq framework.\nHowever, treating SQL as a sequence of inputs to the pre-trained models is not\noptimal. In this work, we put forward a new SQL intermediate representation\ncalled EzSQL to align SQL with the natural language text sequence. EzSQL\nsimplifies the SQL queries and brings them closer to natural language text by\nmodifying operators and keywords, which can usually be described in natural\nlanguage. EzSQL also removes the need for set operators. Our proposed\nSQL-to-text generation model uses EzSQL as the input to a pre-trained\ngenerative language model for generating the text descriptions. We demonstrate\nthat our model is an effective state-of-the-art method to generate text\nnarrations from SQL queries on the WikiSQL and Spider datasets. We also show\nthat by generating pretraining data using our SQL-to-text generation model, we\ncan enhance the performance of Text-to-SQL parsers.", "paper_summary_zh": "SQL 轉文字生成任務傳統上使用範本基礎、Seq2Seq、樹到序列和圖到序列模型。最近的模型利用預訓練生成式語言模型來執行 Seq2Seq 架構中的此項任務。然而，將 SQL 視為預訓練模型輸入序列並非最佳解。在此項工作中，我們提出一個名為 EzSQL 的新式 SQL 中間表示，以將 SQL 與自然語言文字序列對齊。EzSQL 簡化 SQL 查詢，並透過修改運算子與關鍵字（通常可以用自然語言描述），讓它們更接近自然語言文字。EzSQL 也消除了對集合運算子的需求。我們提出的 SQL 轉文字生成模型使用 EzSQL 作為輸入，輸入預訓練生成式語言模型以產生文字描述。我們示範我們的模型是一種有效的最新方法，可以用於從 WikiSQL 與 Spider 資料集中的 SQL 查詢產生文字敘述。我們也展示透過使用我們的 SQL 轉文字生成模型產生預訓練資料，我們可以提升文字轉 SQL 解析器的效能。", "author": "Meher Bhardwaj et.al.", "authors": "Meher Bhardwaj, Hrishikesh Ethari, Dennis Singh Moirangthem", "id": "2411.18923v1", "paper_url": "http://arxiv.org/abs/2411.18923v1", "repo": "null"}}