{"2412.03796": {"publish_time": "2024-12-05", "title": "Automated Multi-Label Annotation for Mental Health Illnesses Using Large Language Models", "paper_summary": "The growing prevalence and complexity of mental health disorders present\nsignificant challenges for accurate diagnosis and treatment, particularly in\nunderstanding the interplay between co-occurring conditions. Mental health\ndisorders, such as depression and Anxiety, often co-occur, yet current datasets\nderived from social media posts typically focus on single-disorder labels,\nlimiting their utility in comprehensive diagnostic analyses. This paper\naddresses this critical gap by proposing a novel methodology for cleaning,\nsampling, labeling, and combining data to create versatile multi-label\ndatasets. Our approach introduces a synthetic labeling technique to transform\nsingle-label datasets into multi-label annotations, capturing the complexity of\noverlapping mental health conditions. To achieve this, two single-label\ndatasets are first merged into a foundational multi-label dataset, enabling\nrealistic analyses of co-occurring diagnoses. We then design and evaluate\nvarious prompting strategies for large language models (LLMs), ranging from\nsingle-label predictions to unrestricted prompts capable of detecting any\npresent disorders. After rigorously assessing multiple LLMs and prompt\nconfigurations, the optimal combinations are identified and applied to label\nsix additional single-disorder datasets from RMHD. The result is SPAADE-DR, a\nrobust, multi-label dataset encompassing diverse mental health conditions. This\nresearch demonstrates the transformative potential of LLM-driven synthetic\nlabeling in advancing mental health diagnostics from social media data, paving\nthe way for more nuanced, data-driven insights into mental health care.", "paper_summary_zh": "隨著心理健康障礙的盛行率和複雜性日益增加，對於準確診斷和治療提出了嚴峻的挑戰，特別是在了解共存疾病之間的相互作用時。心理健康障礙，例如憂鬱症和焦慮症，經常共存，但目前從社群媒體貼文中衍生的資料集通常只關注單一障礙標籤，限制了它們在全面診斷分析中的效用。本文透過提出一個創新的方法來清理、抽樣、標籤和組合資料，以建立多功能的多標籤資料集，來解決這個關鍵的差距。我們的做法引進了一種合成標籤技術，將單標籤資料集轉換為多標籤註解，捕捉重疊心理健康狀況的複雜性。為了達成這個目標，首先將兩個單標籤資料集合併成一個基礎多標籤資料集，以進行共存診斷的實際分析。然後，我們設計並評估大型語言模型 (LLM) 的各種提示策略，從單標籤預測到能夠偵測任何現有障礙的無限制提示。在嚴格評估多個 LLM 和提示配置後，找出最佳組合並應用於標籤來自 RMHD 的六個其他單一障礙資料集。結果是 SPAADE-DR，一個包含各種心理健康狀況的強健多標籤資料集。這項研究展示了 LLM 驅動的合成標籤在推進從社群媒體資料進行心理健康診斷的轉型潛力，為更細緻、資料驅動的心理保健見解鋪路。", "author": "Abdelrahaman A. Hassan et.al.", "authors": "Abdelrahaman A. Hassan, Radwa J. Hanafy, Mohammed E. Fouda", "id": "2412.03796v1", "paper_url": "http://arxiv.org/abs/2412.03796v1", "repo": "null"}}