{"2406.02826": {"publish_time": "2024-06-05", "title": "Exploring Robustness in Doctor-Patient Conversation Summarization: An Analysis of Out-of-Domain SOAP Notes", "paper_summary": "Summarizing medical conversations poses unique challenges due to the\nspecialized domain and the difficulty of collecting in-domain training data. In\nthis study, we investigate the performance of state-of-the-art doctor-patient\nconversation generative summarization models on the out-of-domain data. We\ndivide the summarization model of doctor-patient conversation into two\nconfigurations: (1) a general model, without specifying subjective (S),\nobjective (O), and assessment (A) and plan (P) notes; (2) a SOAP-oriented model\nthat generates a summary with SOAP sections. We analyzed the limitations and\nstrengths of the fine-tuning language model-based methods and GPTs on both\nconfigurations. We also conducted a Linguistic Inquiry and Word Count analysis\nto compare the SOAP notes from different datasets. The results exhibit a strong\ncorrelation for reference notes across different datasets, indicating that\nformat mismatch (i.e., discrepancies in word distribution) is not the main\ncause of performance decline on out-of-domain data. Lastly, a detailed analysis\nof SOAP notes is included to provide insights into missing information and\nhallucinations introduced by the models.", "paper_summary_zh": "摘要醫療對話會因為專業領域和收集領域內訓練資料的困難性而產生獨特的挑戰。在本研究中，我們探討了最先進的醫師-病患對話生成摘要模型在領域外資料的表現。我們將醫師-病患對話的摘要模型分為兩種組態：(1) 一般模型，不指定主觀 (S)、客觀 (O) 和評估 (A) 和計畫 (P) 筆記；(2) 以 SOAP 為導向的模型，生成帶有 SOAP 部分的摘要。我們分析了兩種組態中微調語言模型和 GPT 的限制和優點。我們還進行了語言探討和字數分析，以比較不同資料集的 SOAP 筆記。結果顯示，不同資料集的參考筆記有很強的相關性，這表示格式不匹配（例如，字詞分佈的差異）並非領域外資料效能下降的主要原因。最後，我們納入了 SOAP 筆記的詳細分析，以提供對模型引入的遺漏資訊和幻覺的見解。", "author": "Yu-Wen Chen et.al.", "authors": "Yu-Wen Chen, Julia Hirschberg", "id": "2406.02826v1", "paper_url": "http://arxiv.org/abs/2406.02826v1", "repo": "null"}}