{"2408.10649": {"publish_time": "2024-08-20", "title": "Inferring Underwater Topography with FINN", "paper_summary": "Spatiotemporal partial differential equations (PDEs) find extensive\napplication across various scientific and engineering fields. While numerous\nmodels have emerged from both physics and machine learning (ML) communities,\nthere is a growing trend towards integrating these approaches to develop hybrid\narchitectures known as physics-aware machine learning models. Among these, the\nfinite volume neural network (FINN) has emerged as a recent addition. FINN has\nproven to be particularly efficient in uncovering latent structures in data. In\nthis study, we explore the capabilities of FINN in tackling the shallow-water\nequations, which simulates wave dynamics in coastal regions. Specifically, we\ninvestigate FINN's efficacy to reconstruct underwater topography based on these\nparticular wave equations. Our findings reveal that FINN exhibits a remarkable\ncapacity to infer topography solely from wave dynamics, distinguishing itself\nfrom both conventional ML and physics-aware ML models. Our results underscore\nthe potential of FINN in advancing our understanding of spatiotemporal\nphenomena and enhancing parametrization capabilities in related domains.", "paper_summary_zh": "時空偏微分方程式 (PDE) 在各種科學和工程領域中廣泛應用。雖然物理和機器學習 (ML) 社群都出現了許多模型，但整合這些方法以開發稱為物理感知機器學習模型的混合架構的趨勢正逐漸增長。其中，有限體積神經網路 (FINN) 已成為最近的補充。FINN 已被證明在揭露資料中的潛在結構方面特別有效率。在本研究中，我們探討了 FINN 在處理淺水方程式中的能力，該方程式模擬了沿海地區的波動態。具體來說，我們研究了 FINN 根據這些特定波動方程式重建水下地形的效果。我們的研究結果表明，FINN 表現出僅從波動態推論地形的顯著能力，這使其區別於傳統 ML 和物理感知 ML 模型。我們的結果強調了 FINN 在增進我們對時空現象的理解和增強相關領域中參數化的能力的潛力。", "author": "Coşku Can Horuz et.al.", "authors": "Coşku Can Horuz, Matthias Karlbauer, Timothy Praditia, Sergey Oladyshkin, Wolfgang Nowak, Sebastian Otte", "id": "2408.10649v1", "paper_url": "http://arxiv.org/abs/2408.10649v1", "repo": "null"}}