{"2411.02184": {"publish_time": "2024-11-04", "title": "Double Descent Meets Out-of-Distribution Detection: Theoretical Insights and Empirical Analysis on the role of model complexity", "paper_summary": "While overparameterization is known to benefit generalization, its impact on\nOut-Of-Distribution (OOD) detection is less understood. This paper investigates\nthe influence of model complexity in OOD detection. We propose an expected OOD\nrisk metric to evaluate classifiers confidence on both training and OOD\nsamples. Leveraging Random Matrix Theory, we derive bounds for the expected OOD\nrisk of binary least-squares classifiers applied to Gaussian data. We show that\nthe OOD risk depicts an infinite peak, when the number of parameters is equal\nto the number of samples, which we associate with the double descent\nphenomenon. Our experimental study on different OOD detection methods across\nmultiple neural architectures extends our theoretical insights and highlights a\ndouble descent curve. Our observations suggest that overparameterization does\nnot necessarily lead to better OOD detection. Using the Neural Collapse\nframework, we provide insights to better understand this behavior. To\nfacilitate reproducibility, our code will be made publicly available upon\npublication.", "paper_summary_zh": "儘管過度參數化已知有助於泛化，但它對 Out-Of-Distribution (OOD) 偵測的影響卻鮮為人知。本文探討了模型複雜度對 OOD 偵測的影響。我們提出預期的 OOD 風險量度，以評估分類器對訓練和 OOD 樣本的信心。利用隨機矩陣理論，我們推導出應用於高斯資料的二元最小平方分類器的預期 OOD 風險界線。我們顯示 OOD 風險描繪了一個無限峰值，當參數數量等於樣本數量時，我們將其與雙重下降現象聯繫起來。我們對跨多個神經架構的不同 OOD 偵測方法進行的實驗研究擴展了我們的理論見解，並突出了雙重下降曲線。我們的觀察結果表明，過度參數化不一定會導致更好的 OOD 偵測。使用神經崩潰框架，我們提供見解以更好地理解此行為。為了便於重現，我們的程式碼將在發表後公開。", "author": "Mouïn Ben Ammar et.al.", "authors": "Mouïn Ben Ammar, David Brellmann, Arturo Mendoza, Antoine Manzanera, Gianni Franchi", "id": "2411.02184v1", "paper_url": "http://arxiv.org/abs/2411.02184v1", "repo": "null"}}