{"2411.12713": {"publish_time": "2024-11-19", "title": "CATCH: Complementary Adaptive Token-level Contrastive Decoding to Mitigate Hallucinations in LVLMs", "paper_summary": "Large Vision-Language Model (LVLM) systems have demonstrated impressive\nvision-language reasoning capabilities but suffer from pervasive and severe\nhallucination issues, posing significant risks in critical domains such as\nhealthcare and autonomous systems. Despite previous efforts to mitigate\nhallucinations, a persistent issue remains: visual defect from vision-language\nmisalignment, creating a bottleneck in visual processing capacity. To address\nthis challenge, we develop Complementary Adaptive Token-level Contrastive\nDecoding to Mitigate Hallucinations in LVLMs (CATCH), based on the Information\nBottleneck theory. CATCH introduces Complementary Visual Decoupling (CVD) for\nvisual information separation, Non-Visual Screening (NVS) for hallucination\ndetection, and Adaptive Token-level Contrastive Decoding (ATCD) for\nhallucination mitigation. CATCH addresses issues related to visual defects that\ncause diminished fine-grained feature perception and cumulative hallucinations\nin open-ended scenarios. It is applicable to various visual question-answering\ntasks without requiring any specific data or prior knowledge, and generalizes\nrobustly to new tasks without additional training, opening new possibilities\nfor advancing LVLM in various challenging applications.", "paper_summary_zh": "大型視覺語言模型 (LVLM) 系統已展現出令人印象深刻的視覺語言推理能力，但會遭受普遍且嚴重的幻覺問題，對醫療保健和自主系統等關鍵領域構成重大風險。儘管之前已做出減輕幻覺的努力，但仍存在一個持續的問題：視覺語言錯位造成的視覺缺陷，這會造成視覺處理能力的瓶頸。為了應對這項挑戰，我們根據資訊瓶頸理論，開發了用於減輕 LVLM 中幻覺的互補適應式代幣層級對比解碼 (CATCH)。CATCH 引入了互補視覺解耦 (CVD) 以進行視覺資訊分離、非視覺篩選 (NVS) 以進行幻覺偵測，以及適應式代幣層級對比解碼 (ATCD) 以進行幻覺減輕。CATCH 針對視覺缺陷的問題，這些問題會導致精細特徵感知力下降以及在開放式情境中累積幻覺。它適用於各種視覺問答任務，無需任何特定資料或先備知識，而且在沒有額外訓練的情況下，能穩健地概化到新任務，為在各種具挑戰性的應用中推進 LVLM 開啟新的可能性。", "author": "Zhehan Kan et.al.", "authors": "Zhehan Kan, Ce Zhang, Zihan Liao, Yapeng Tian, Wenming Yang, Junyuan Xiao, Xu Li, Dongmei Jiang, Yaowei Wang, Qingmin Liao", "id": "2411.12713v1", "paper_url": "http://arxiv.org/abs/2411.12713v1", "repo": "null"}}