{"2405.03892": {"publish_time": "2024-05-06", "title": "Out-of-Distribution Adaptation in Offline RL: Counterfactual Reasoning via Causal Normalizing Flows", "paper_summary": "Despite notable successes of Reinforcement Learning (RL), the prevalent use\nof an online learning paradigm prevents its widespread adoption, especially in\nhazardous or costly scenarios. Offline RL has emerged as an alternative\nsolution, learning from pre-collected static datasets. However, this offline\nlearning introduces a new challenge known as distributional shift, degrading\nthe performance when the policy is evaluated on scenarios that are\nOut-Of-Distribution (OOD) from the training dataset. Most existing offline RL\nresolves this issue by regularizing policy learning within the information\nsupported by the given dataset. However, such regularization overlooks the\npotential for high-reward regions that may exist beyond the dataset. This\nmotivates exploring novel offline learning techniques that can make\nimprovements beyond the data support without compromising policy performance,\npotentially by learning causation (cause-and-effect) instead of correlation\nfrom the dataset. In this paper, we propose the MOOD-CRL (Model-based Offline\nOOD-Adapting Causal RL) algorithm, which aims to address the challenge of\nextrapolation for offline policy training through causal inference instead of\npolicy-regularizing methods. Specifically, Causal Normalizing Flow (CNF) is\ndeveloped to learn the transition and reward functions for data generation and\naugmentation in offline policy evaluation and training. Based on the\ndata-invariant, physics-based qualitative causal graph and the observational\ndata, we develop a novel learning scheme for CNF to learn the quantitative\nstructural causal model. As a result, CNF gains predictive and counterfactual\nreasoning capabilities for sequential decision-making tasks, revealing a high\npotential for OOD adaptation. Our CNF-based offline RL approach is validated\nthrough empirical evaluations, outperforming model-free and model-based methods\nby a significant margin.", "paper_summary_zh": "儘管強化學習 (RL) 取得顯著成功，但普遍使用線上學習範例會阻礙其廣泛採用，尤其是在危險或成本高昂的場景中。離線 RL 已成為一種替代方案，從預先收集的靜態資料集學習。然而，這種離線學習會產生一個稱為分佈轉移的新挑戰，當策略在訓練資料集的 Out-Of-Distribution (OOD) 場景中進行評估時，會降低效能。現有的離線 RL 大多透過在給定資料集支援的資訊中規範策略學習來解決此問題。然而，這種規範忽略了資料集之外可能存在的高回報區域。這促使我們探索新的離線學習技術，這些技術可以在不損害策略效能的情況下，超越資料支援進行改進，潛在的做法是從資料集中學習因果關係（因果關係）而不是相關性。在本文中，我們提出 MOOD-CRL（基於模型的離線 OOD 適應因果 RL）演算法，其目標是透過因果推論而不是策略規範化方法來解決離線策略訓練的外推挑戰。具體來說，因果常態化流 (CNF) 被開發出來，用於學習離線策略評估和訓練中的資料生成和擴充的轉換和回報函數。基於資料不變、基於物理的定性因果圖和觀測資料，我們開發了一種新的學習架構，讓 CNF 學習定量結構因果模型。因此，CNF 獲得了用於序貫決策任務的預測和反事實推理能力，顯示出 OOD 適應的高潛力。我們的基於 CNF 的離線 RL 方法已通過經驗評估得到驗證，其效能顯著優於無模型和基於模型的方法。", "author": "Minjae Cho et.al.", "authors": "Minjae Cho, Jonathan P. How, Chuangchuang Sun", "id": "2405.03892v1", "paper_url": "http://arxiv.org/abs/2405.03892v1", "repo": "null"}}