{"2411.13022": {"publish_time": "2024-11-20", "title": "Training Physics-Driven Deep Learning Reconstruction without Raw Data Access for Equitable Fast MRI", "paper_summary": "Physics-driven deep learning (PD-DL) approaches have become popular for\nimproved reconstruction of fast magnetic resonance imaging (MRI) scans. Even\nthough PD-DL offers higher acceleration rates compared to existing clinical\nfast MRI techniques, their use has been limited outside specialized MRI\ncenters. One impediment for their deployment is the difficulties with\ngeneralization to pathologies or population groups that are not\nwell-represented in training sets. This has been noted in several studies, and\nfine-tuning on target populations to improve reconstruction has been suggested.\nHowever, current approaches for PD-DL training require access to raw k-space\nmeasurements, which is typically only available at specialized MRI centers that\nhave research agreements for such data access. This is especially an issue for\nrural and underserved areas, where commercial MRI scanners only provide access\nto a final reconstructed image. To tackle these challenges, we propose\nCompressibility-inspired Unsupervised Learning via Parallel Imaging Fidelity\n(CUPID) for high-quality PD-DL training, using only routine clinical\nreconstructed images exported from an MRI scanner. CUPID evaluates the goodness\nof the output with a compressibility-based approach, while ensuring that the\noutput stays consistent with the clinical parallel imaging reconstruction\nthrough well-designed perturbations. Our results show that CUPID achieves\nsimilar quality compared to well-established PD-DL training strategies that\nrequire raw k-space data access, while outperforming conventional compressed\nsensing (CS) and state-of-the-art generative methods. We also demonstrate its\neffectiveness in a zero-shot training setup for retrospectively and\nprospectively sub-sampled acquisitions, attesting to its minimal training\nburden.", "paper_summary_zh": "<paragraph>物理驅動深度學習 (PD-DL) 方法已廣受歡迎，用於改善快速磁振造影 (MRI) 掃描的重建。儘管與現有的臨床快速 MRI 技術相比，PD-DL 提供了更高的加速率，但其使用已被限制在專門的 MRI 中心之外。部署它們的一個障礙是難以推廣到訓練集中未充分呈現的病理或人群。這已在多項研究中註明，並且建議對目標人群進行微調以改善重建。然而，當前 PD-DL 訓練方法需要存取原始 k-space 量測，而這通常僅在具有此類資料存取研究協議的專門 MRI 中心才可取得。這對於鄉村和服務不足的地區來說尤其成問題，因為商業 MRI 掃描儀僅提供存取最終重建影像。為了應對這些挑戰，我們提出透過平行影像保真度 (CUPID) 進行受壓縮性啟發的非監督式學習，僅使用從 MRI 掃描儀輸出的例行臨床重建影像，以進行高品質 PD-DL 訓練。CUPID 使用基於壓縮性的方法評估輸出的優劣，同時確保輸出透過精心設計的擾動與臨床平行影像重建保持一致。我們的結果顯示，與需要原始 k-space 資料存取的完善 PD-DL 訓練策略相比，CUPID 達到了類似的品質，同時優於傳統的壓縮感測 (CS) 和最先進的生成方法。我們還展示了它在零次學習設定中對回溯性和前瞻性子抽樣擷取的有效性，證明了它的訓練負擔很小。</paragraph>", "author": "Yaşar Utku Alçalar et.al.", "authors": "Yaşar Utku Alçalar, Merve Gülle, Mehmet Akçakaya", "id": "2411.13022v1", "paper_url": "http://arxiv.org/abs/2411.13022v1", "repo": "null"}}