{"2409.02834": {"publish_time": "2024-09-04", "title": "CMM-Math: A Chinese Multimodal Math Dataset To Evaluate and Enhance the Mathematics Reasoning of Large Multimodal Models", "paper_summary": "Large language models (LLMs) have obtained promising results in mathematical\nreasoning, which is a foundational skill for human intelligence. Most previous\nstudies focus on improving and measuring the performance of LLMs based on\ntextual math reasoning datasets (e.g., MATH, GSM8K). Recently, a few\nresearchers have released English multimodal math datasets (e.g., MATHVISTA and\nMATH-V) to evaluate the effectiveness of large multimodal models (LMMs). In\nthis paper, we release a Chinese multimodal math (CMM-Math) dataset, including\nbenchmark and training parts, to evaluate and enhance the mathematical\nreasoning of LMMs. CMM-Math contains over 28,000 high-quality samples,\nfeaturing a variety of problem types (e.g., multiple-choice, fill-in-the-blank,\nand so on) with detailed solutions across 12 grade levels from elementary to\nhigh school in China. Specifically, the visual context may be present in the\nquestions or opinions, which makes this dataset more challenging. Through\ncomprehensive analysis, we discover that state-of-the-art LMMs on the CMM-Math\ndataset face challenges, emphasizing the necessity for further improvements in\nLMM development. We also propose a Multimodal Mathematical LMM (Math-LMM) to\nhandle the problems with mixed input of multiple images and text segments. We\ntrain our model using three stages, including foundational pre-training,\nfoundational fine-tuning, and mathematical fine-tuning. The extensive\nexperiments indicate that our model effectively improves math reasoning\nperformance by comparing it with the SOTA LMMs over three multimodal\nmathematical datasets.", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 在數學推理方面取得了可喜的成果，而數學推理是人類智能的一項基礎技能。大多數先前的研究都專注於改進和評量 LLM 在基於文字數學推理資料集 (例如 MATH、GSM8K) 上的表現。最近，一些研究人員發布了英文多模態數學資料集 (例如 MATHVISTA 和 MATH-V) 來評估大型多模態模型 (LMM) 的效能。在本文中，我們發布了一個中文多模態數學 (CMM-Math) 資料集，包括基準和訓練部分，用於評估和增強 LMM 的數學推理能力。CMM-Math 包含超過 28,000 個高品質範例，具備各種問題類型 (例如多重選擇、填空等)，並提供從中國小學到高中的 12 個年級的詳細解答。具體來說，視覺脈絡可能出現在問題或意見中，這使得這個資料集更具挑戰性。透過全面的分析，我們發現 CMM-Math 資料集上的最新 LMM 面臨挑戰，強調進一步改進 LMM 開發的必要性。我們還提出了一個多模態數學 LMM (Math-LMM) 來處理多個影像和文字片段混合輸入的問題。我們使用三個階段來訓練我們的模型，包括基礎預訓練、基礎微調和數學微調。廣泛的實驗表明，我們的模型透過與三個多模態數學資料集上的 SOTA LMM 比較，有效地改進了數學推理表現。</paragraph>", "author": "Wentao Liu et.al.", "authors": "Wentao Liu, Qianjun Pan, Yi Zhang, Zhuo Liu, Ji Wu, Jie Zhou, Aimin Zhou, Qin Chen, Bo Jiang, Liang He", "id": "2409.02834v2", "paper_url": "http://arxiv.org/abs/2409.02834v2", "repo": "null"}}