{"2501.06025": {"publish_time": "2025-01-10", "title": "How to Tune a Multilingual Encoder Model for Germanic Languages: A Study of PEFT, Full Fine-Tuning, and Language Adapters", "paper_summary": "This paper investigates the optimal use of the multilingual encoder model\nmDeBERTa for tasks in three Germanic languages -- German, Swedish, and\nIcelandic -- representing varying levels of presence and likely data quality in\nmDeBERTas pre-training data. We compare full fine-tuning with the\nparameter-efficient fine-tuning (PEFT) methods LoRA and Pfeiffer bottleneck\nadapters, finding that PEFT is more effective for the higher-resource language,\nGerman. However, results for Swedish and Icelandic are less consistent. We also\nobserve differences between tasks: While PEFT tends to work better for question\nanswering, full fine-tuning is preferable for named entity recognition.\nInspired by previous research on modular approaches that combine task and\nlanguage adapters, we evaluate the impact of adding PEFT modules trained on\nunstructured text, finding that this approach is not beneficial.", "paper_summary_zh": "本文探討多語言編碼器模型 mDeBERTa 在三種日耳曼語系語言（德語、瑞典語和冰島語）中的最佳使用方式，這些語言代表了 mDeBERTa 預訓練數據中存在程度和可能數據品質的不同層級。我們將全微調與參數有效微調 (PEFT) 方法 LoRA 和 Pfeiffer 瓶頸適配器進行比較，發現 PEFT 對資源較多的語言德語更有效。然而，瑞典語和冰島語的結果較不一致。我們也觀察到任務之間的差異：雖然 PEFT 傾向於在問答中表現得更好，但全微調則較適合命名實體辨識。受先前結合任務和語言適配器之模組化方法研究的啟發，我們評估了在非結構化文字上訓練的 PEFT 模組加入後的影響，發現此方法並無益處。", "author": "Romina Oji et.al.", "authors": "Romina Oji, Jenny Kunz", "id": "2501.06025v1", "paper_url": "http://arxiv.org/abs/2501.06025v1", "repo": "https://github.com/rominaoji/german-language-adapter"}}