{"2504.05305": {"publish_time": "2025-04-07", "title": "URECA: Unique Region Caption Anything", "paper_summary": "Region-level captioning aims to generate natural language descriptions for\nspecific image regions while highlighting their distinguishing features.\nHowever, existing methods struggle to produce unique captions across\nmulti-granularity, limiting their real-world applicability. To address the need\nfor detailed region-level understanding, we introduce URECA dataset, a\nlarge-scale dataset tailored for multi-granularity region captioning. Unlike\nprior datasets that focus primarily on salient objects, URECA dataset ensures a\nunique and consistent mapping between regions and captions by incorporating a\ndiverse set of objects, parts, and background elements. Central to this is a\nstage-wise data curation pipeline, where each stage incrementally refines\nregion selection and caption generation. By leveraging Multimodal Large\nLanguage Models (MLLMs) at each stage, our pipeline produces distinctive and\ncontextually grounded captions with improved accuracy and semantic diversity.\nBuilding upon this dataset, we present URECA, a novel captioning model designed\nto effectively encode multi-granularity regions. URECA maintains essential\nspatial properties such as position and shape through simple yet impactful\nmodifications to existing MLLMs, enabling fine-grained and semantically rich\nregion descriptions. Our approach introduces dynamic mask modeling and a\nhigh-resolution mask encoder to enhance caption uniqueness. Experiments show\nthat URECA achieves state-of-the-art performance on URECA dataset and\ngeneralizes well to existing region-level captioning benchmarks.", "paper_summary_zh": "<paragraph>區域級別的圖說生成旨在為特定圖像區域生成自然語言描述，同時突出它們的顯著特徵。然而，現有方法難以在多粒度上生成獨特的圖說，限制了它們在現實世界的應用。為了滿足對詳細區域級別理解的需求，我們引入了 URECA 資料集，這是一個專為多粒度區域圖說生成而設計的大規模資料集。與先前主要關注顯著物件的資料集不同，URECA 資料集通過整合一組不同的物件、部分和背景元素，確保區域和圖說之間獨特且一致的映射關係。其核心是一個階段式資料策劃流程，每個階段都逐步完善區域選擇和圖說生成。通過在每個階段利用多模態大型語言模型 (MLLM)，我們的流程可以生成獨特且基於上下文的圖說，並提高準確性和語義多樣性。基於此資料集，我們提出了 URECA，這是一個旨在有效編碼多粒度區域的新穎圖說模型。URECA 通過對現有 MLLM 進行簡單但有效的修改來維持必要的空間屬性，例如位置和形狀，從而實現細粒度且語義豐富的區域描述。我們的方法引入了動態遮罩建模和高解析度遮罩編碼器，以增強圖說的獨特性。實驗表明，URECA 在 URECA 資料集上達到了最先進的性能，並且可以很好地泛化到現有的區域級別圖說生成基準測試。</paragraph>\n", "author": "Sangbeom Lim et.al.", "authors": "Sangbeom Lim, Junwan Kim, Heeji Yoon, Jaewoo Jung, Seungryong Kim", "id": "2504.05305v1", "paper_url": "http://arxiv.org/abs/2504.05305v1", "repo": "null"}}