{"2406.02974": {"publish_time": "2024-06-05", "title": "Readability-guided Idiom-aware Sentence Simplification (RISS) for Chinese", "paper_summary": "Chinese sentence simplification faces challenges due to the lack of\nlarge-scale labeled parallel corpora and the prevalence of idioms. To address\nthese challenges, we propose Readability-guided Idiom-aware Sentence\nSimplification (RISS), a novel framework that combines data augmentation\ntechniques with lexcial simplification. RISS introduces two key components: (1)\nReadability-guided Paraphrase Selection (RPS), a method for mining high-quality\nsentence pairs, and (2) Idiom-aware Simplification (IAS), a model that enhances\nthe comprehension and simplification of idiomatic expressions. By integrating\nRPS and IAS using multi-stage and multi-task learning strategies, RISS\noutperforms previous state-of-the-art methods on two Chinese sentence\nsimplification datasets. Furthermore, RISS achieves additional improvements\nwhen fine-tuned on a small labeled dataset. Our approach demonstrates the\npotential for more effective and accessible Chinese text simplification.", "paper_summary_zh": "中文句子簡化面臨缺乏大規模標記平行語料庫和成語盛行的挑戰。為了應對這些挑戰，我們提出了可讀性引導的成語感知句子簡化 (RISS)，這是一種結合數據擴充技術與詞彙簡化的創新架構。RISS 引入了兩個關鍵組成部分：(1) 可讀性引導的同義詞選擇 (RPS)，一種用於挖掘高品質句子對的方法，以及 (2) 成語感知簡化 (IAS)，一種增強成語表達理解和簡化的模型。透過使用多階段和多任務學習策略整合 RPS 和 IAS，RISS 在兩個中文句子簡化數據集上優於先前的最新方法。此外，RISS 在一個小型標記數據集上進行微調時獲得了額外的改進。我們的做法展示了更有效和可存取的中文文本簡化的潛力。", "author": "Jingshen Zhang et.al.", "authors": "Jingshen Zhang, Xinglu Chen, Xinying Qiu, Zhimin Wang, Wenhe Feng", "id": "2406.02974v1", "paper_url": "http://arxiv.org/abs/2406.02974v1", "repo": "null"}}