{"2412.13178": {"publish_time": "2024-12-17", "title": "SafeAgentBench: A Benchmark for Safe Task Planning of Embodied LLM Agents", "paper_summary": "With the integration of large language models (LLMs), embodied agents have\nstrong capabilities to execute complicated instructions in natural language,\npaving a way for the potential deployment of embodied robots. However, a\nforeseeable issue is that those embodied agents can also flawlessly execute\nsome hazardous tasks, potentially causing damages in real world. To study this\nissue, we present SafeAgentBench -- a new benchmark for safety-aware task\nplanning of embodied LLM agents. SafeAgentBench includes: (1) a new dataset\nwith 750 tasks, covering 10 potential hazards and 3 task types; (2)\nSafeAgentEnv, a universal embodied environment with a low-level controller,\nsupporting multi-agent execution with 17 high-level actions for 8\nstate-of-the-art baselines; and (3) reliable evaluation methods from both\nexecution and semantic perspectives. Experimental results show that the\nbest-performing baseline gets 69% success rate for safe tasks, but only 5%\nrejection rate for hazardous tasks, indicating significant safety risks. More\ndetails and codes are available at\nhttps://github.com/shengyin1224/SafeAgentBench.", "paper_summary_zh": "隨著大型語言模型 (LLM) 的整合，具象代理擁有以自然語言執行複雜指令的強大能力，為具象機器人的潛在部署鋪平了道路。然而，一個可預見的問題是，這些具象代理也可以完美執行一些危險的任務，潛在地對現實世界造成損害。為了研究這個問題，我們提出了 SafeAgentBench——一個新的基準，用於具象 LLM 代理的安全感知任務規劃。SafeAgentBench 包括：(1) 一個擁有 750 個任務的新數據集，涵蓋 10 個潛在危害和 3 個任務類型；(2) SafeAgentEnv，一個帶有低級控制器的通用具象環境，支持使用 17 個高級動作對 8 個最先進的基準進行多代理執行；以及 (3) 來自執行和語義角度的可靠評估方法。實驗結果表明，表現最佳的基準在安全任務中獲得了 69% 的成功率，但在危險任務中的拒絕率僅為 5%，表明存在顯著的安全風險。更多詳細信息和代碼可在 https://github.com/shengyin1224/SafeAgentBench 中找到。", "author": "Sheng Yin et.al.", "authors": "Sheng Yin, Xianghe Pang, Yuanzhuo Ding, Menglan Chen, Yutong Bi, Yichen Xiong, Wenhao Huang, Zhen Xiang, Jing Shao, Siheng Chen", "id": "2412.13178v1", "paper_url": "http://arxiv.org/abs/2412.13178v1", "repo": "https://github.com/shengyin1224/safeagentbench"}}