{"2501.17449": {"publish_time": "2025-01-29", "title": "Cross-Language Approach for Quranic QA", "paper_summary": "Question answering systems face critical limitations in languages with\nlimited resources and scarce data, making the development of robust models\nespecially challenging. The Quranic QA system holds significant importance as\nit facilitates a deeper understanding of the Quran, a Holy text for over a\nbillion people worldwide. However, these systems face unique challenges,\nincluding the linguistic disparity between questions written in Modern Standard\nArabic and answers found in Quranic verses written in Classical Arabic, and the\nsmall size of existing datasets, which further restricts model performance. To\naddress these challenges, we adopt a cross-language approach by (1) Dataset\nAugmentation: expanding and enriching the dataset through machine translation\nto convert Arabic questions into English, paraphrasing questions to create\nlinguistic diversity, and retrieving answers from an English translation of the\nQuran to align with multilingual training requirements; and (2) Language Model\nFine-Tuning: utilizing pre-trained models such as BERT-Medium, RoBERTa-Base,\nDeBERTa-v3-Base, ELECTRA-Large, Flan-T5, Bloom, and Falcon to address the\nspecific requirements of Quranic QA. Experimental results demonstrate that this\ncross-language approach significantly improves model performance, with\nRoBERTa-Base achieving the highest MAP@10 (0.34) and MRR (0.52), while\nDeBERTa-v3-Base excels in Recall@10 (0.50) and Precision@10 (0.24). These\nfindings underscore the effectiveness of cross-language strategies in\novercoming linguistic barriers and advancing Quranic QA systems", "paper_summary_zh": "<paragraph>問答系統在資源有限且資料稀少的語言中面臨嚴重的限制，這使得建立穩健模型特別具有挑戰性。古蘭經問答系統具有重要的意義，因為它促進了對古蘭經的深入理解，而古蘭經是全球超過十億人的神聖文本。然而，這些系統面臨著獨特的挑戰，包括以現代標準阿拉伯語寫成的問題與以古典阿拉伯語寫成的古蘭經經文中發現的答案之間的語言差異，以及現有資料集規模小，進一步限制了模型的效能。為了應對這些挑戰，我們採用跨語言方法，包括：(1) 資料集擴充：透過機器翻譯將阿拉伯語問題轉換成英語、改寫問題以創造語言多樣性，以及從古蘭經的英文翻譯中擷取答案以符合多語言訓練需求，來擴充和豐富資料集；以及 (2) 語言模型微調：利用預先訓練的模型，例如 BERT-Medium、RoBERTa-Base、DeBERTa-v3-Base、ELECTRA-Large、Flan-T5、Bloom 和 Falcon，來滿足古蘭經問答的特定需求。實驗結果表明，這種跨語言方法顯著提升了模型效能，其中 RoBERTa-Base 在 MAP@10 (0.34) 和 MRR (0.52) 方面取得最高成就，而 DeBERTa-v3-Base 則在 Recall@10 (0.50) 和 Precision@10 (0.24) 方面表現出色。這些發現強調了跨語言策略在克服語言障礙和推進古蘭經問答系統方面的有效性</paragraph>", "author": "Islam Oshallah et.al.", "authors": "Islam Oshallah, Mohamed Basem, Ali Hamdi, Ammar Mohammed", "id": "2501.17449v1", "paper_url": "http://arxiv.org/abs/2501.17449v1", "repo": "null"}}