{"2410.23261": {"publish_time": "2024-10-30", "title": "$100K or 100 Days: Trade-offs when Pre-Training with Academic Resources", "paper_summary": "Pre-training is notoriously compute-intensive and academic researchers are\nnotoriously under-resourced. It is, therefore, commonly assumed that academics\ncan't pre-train models. In this paper, we seek to clarify this assumption. We\nfirst survey academic researchers to learn about their available compute and\nthen empirically measure the time to replicate models on such resources. We\nintroduce a benchmark to measure the time to pre-train models on given GPUs and\nalso identify ideal settings for maximizing training speed. We run our\nbenchmark on a range of models and academic GPUs, spending 2,000 GPU-hours on\nour experiments. Our results reveal a brighter picture for academic\npre-training: for example, although Pythia-1B was originally trained on 64 GPUs\nfor 3 days, we find it is also possible to replicate this model (with the same\nhyper-parameters) in 3x fewer GPU-days: i.e. on 4 GPUs in 18 days. We conclude\nwith a cost-benefit analysis to help clarify the trade-offs between price and\npre-training time. We believe our benchmark will help academic researchers\nconduct experiments that require training larger models on more data. We fully\nrelease our codebase at: https://github.com/apoorvkh/academic-pretraining.", "paper_summary_zh": "預訓練出了名的需要大量運算，而學術研究人員出了名的資源不足。因此，普遍認為學術界無法預訓練模型。在本文中，我們試圖釐清這個假設。我們首先調查學術研究人員，以了解他們可用的運算，然後根據這些資源實證測量複製模型的時間。我們引入一個基準，用來測量在給定的 GPU 上預訓練模型的時間，並找出最大化訓練速度的理想設定。我們在各種模型和學術 GPU 上執行基準，在我們的實驗中耗費了 2,000 個 GPU 小時。我們的結果對學術預訓練揭示了一個更光明的圖像：例如，儘管 Pythia-1B 最初在 64 個 GPU 上訓練了 3 天，但我們發現也可以用更少的 3 倍 GPU 天數複製這個模型（使用相同的超參數）：即在 4 個 GPU 上訓練 18 天。我們以成本效益分析作為結論，以幫助釐清價格和預訓練時間之間的權衡。我們相信我們的基準將有助於學術研究人員進行需要在更多資料上訓練更大模型的實驗。我們在 https://github.com/apoorvkh/academic-pretraining 完整釋出我們的程式碼庫。", "author": "Apoorv Khandelwal et.al.", "authors": "Apoorv Khandelwal, Tian Yun, Nihal V. Nayak, Jack Merullo, Stephen H. Bach, Chen Sun, Ellie Pavlick", "id": "2410.23261v1", "paper_url": "http://arxiv.org/abs/2410.23261v1", "repo": "https://github.com/apoorvkh/academic-pretraining"}}