{"2410.24024": {"publish_time": "2024-10-31", "title": "AndroidLab: Training and Systematic Benchmarking of Android Autonomous Agents", "paper_summary": "Autonomous agents have become increasingly important for interacting with the\nreal world. Android agents, in particular, have been recently a\nfrequently-mentioned interaction method. However, existing studies for training\nand evaluating Android agents lack systematic research on both open-source and\nclosed-source models. In this work, we propose AndroidLab as a systematic\nAndroid agent framework. It includes an operation environment with different\nmodalities, action space, and a reproducible benchmark. It supports both large\nlanguage models (LLMs) and multimodal models (LMMs) in the same action space.\nAndroidLab benchmark includes predefined Android virtual devices and 138 tasks\nacross nine apps built on these devices. By using the AndroidLab environment,\nwe develop an Android Instruction dataset and train six open-source LLMs and\nLMMs, lifting the average success rates from 4.59\\% to 21.50\\% for LLMs and\nfrom 1.93\\% to 13.28\\% for LMMs. AndroidLab is open-sourced and publicly\navailable at \\url{https://github.com/THUDM/Android-Lab}.", "paper_summary_zh": "自主代理已變得越來越重要，用於與現實世界互動。特別是 Android 代理，最近已成為一種常被提及的互動方法。然而，現有的訓練和評估 Android 代理的研究，缺乏對開源和閉源模型的系統性研究。在這項工作中，我們提出 AndroidLab 作為一個系統性的 Android 代理框架。它包含一個具有不同模態、動作空間和可重現基準的運作環境。它在相同的動作空間中支援大型語言模型 (LLM) 和多模態模型 (LMM)。AndroidLab 基準包括預定義的 Android 虛擬裝置，以及建立在這些裝置上的 138 個任務，涵蓋九個應用程式。透過使用 AndroidLab 環境，我們開發了一個 Android 指令資料集，並訓練了六個開源 LLM 和 LMM，將 LLM 的平均成功率從 4.59% 提升到 21.50%，將 LMM 的平均成功率從 1.93% 提升到 13.28%。AndroidLab 是開源的，並公開於 \\url{https://github.com/THUDM/Android-Lab}。", "author": "Yifan Xu et.al.", "authors": "Yifan Xu, Xiao Liu, Xueqiao Sun, Siyi Cheng, Hao Yu, Hanyu Lai, Shudan Zhang, Dan Zhang, Jie Tang, Yuxiao Dong", "id": "2410.24024v1", "paper_url": "http://arxiv.org/abs/2410.24024v1", "repo": "null"}}