{"2501.01827": {"publish_time": "2025-01-03", "title": "The Proof is in the Almond Cookies", "paper_summary": "This paper presents a case study on how to process cooking recipes (and more\ngenerally, how-to instructions) in a way that makes it possible for a robot or\nartificial cooking assistant to support human chefs in the kitchen. Such AI\nassistants would be of great benefit to society, as they can help to sustain\nthe autonomy of aging adults or people with a physical impairment, or they may\nreduce the stress in a professional kitchen. We propose a novel approach to\ncomputational recipe understanding that mimics the human sense-making process,\nwhich is narrative-based. Using an English recipe for almond crescent cookies\nas illustration, we show how recipes can be modelled as rich narrative\nstructures by integrating various knowledge sources such as language\nprocessing, ontologies, and mental simulation. We show how such narrative\nstructures can be used for (a) dealing with the challenges of recipe language,\nsuch as zero anaphora, (b) optimizing a robot's planning process, (c) measuring\nhow well an AI system understands its current tasks, and (d) allowing recipe\nannotations to become language-independent.", "paper_summary_zh": "本文介紹了一個案例研究，探討如何處理烹飪食譜（更廣義地說，如何操作說明），讓機器人或人工烹飪助理可以在廚房協助人類廚師。此類人工智慧助理對社會有極大的好處，因為它們可以幫助維持年長者或身體障礙者的自主性，或減輕專業廚房的壓力。我們提出了一個新穎的計算食譜理解方法，模擬人類基於敘事的理解過程。我們以英文杏仁新月餅乾食譜為例，說明如何將食譜建模為豐富的敘事結構，方法是整合語言處理、本体和心智模擬等各種知識來源。我們說明如何使用此類敘事結構來：(a) 應對食譜語言的挑戰，例如零代名詞；(b) 優化機器人的規劃流程；(c) 衡量人工智慧系統了解其當前任務的程度；以及 (d) 讓食譜註解與語言無關。", "author": "Remi van Trijp et.al.", "authors": "Remi van Trijp, Katrien Beuls, Paul Van Eecke", "id": "2501.01827v1", "paper_url": "http://arxiv.org/abs/2501.01827v1", "repo": "null"}}