{"2412.09370": {"publish_time": "2024-12-12", "title": "Word Sense Linking: Disambiguating Outside the Sandbox", "paper_summary": "Word Sense Disambiguation (WSD) is the task of associating a word in a given\ncontext with its most suitable meaning among a set of possible candidates.\nWhile the task has recently witnessed renewed interest, with systems achieving\nperformances above the estimated inter-annotator agreement, at the time of\nwriting it still struggles to find downstream applications. We argue that one\nof the reasons behind this is the difficulty of applying WSD to plain text.\nIndeed, in the standard formulation, models work under the assumptions that a)\nall the spans to disambiguate have already been identified, and b) all the\npossible candidate senses of each span are provided, both of which are\nrequirements that are far from trivial. In this work, we present a new task\ncalled Word Sense Linking (WSL) where, given an input text and a reference\nsense inventory, systems have to both identify which spans to disambiguate and\nthen link them to their most suitable meaning.We put forward a\ntransformer-based architecture for the task and thoroughly evaluate both its\nperformance and those of state-of-the-art WSD systems scaled to WSL,\niteratively relaxing the assumptions of WSD. We hope that our work will foster\neasier integration of lexical semantics into downstream applications.", "paper_summary_zh": "詞義消歧 (WSD) 的任務是將特定語境中的詞彙與一組可能的候選詞彙中最合適的意義關聯起來。儘管這項任務最近引起新的興趣，系統達成的效能高於估計的標註者間一致性，但在撰寫本文時，它仍難以找出下游應用程式。我們認為，原因之一是將 WSD 應用於純文字的難度。事實上，在標準制定中，模型在以下假設下運作：a) 所有要消歧的範圍都已識別出來，以及 b) 提供每個範圍的所有可能的候選詞義，這兩個都是遠非微不足道的需求。在這項工作中，我們提出一個稱為詞義連結 (WSL) 的新任務，在給定輸入文字和參考詞義清單的情況下，系統必須同時識別要消歧的範圍，然後將它們連結到最合適的意義。我們提出一個基於轉換器的架構來執行這項任務，並徹底評估其效能和縮放到 WSL 的最先進 WSD 系統，反覆放寬 WSD 的假設。我們希望我們的這項工作能促進將詞彙語義更輕鬆地整合到下游應用程式中。", "author": "Andrei Stefan Bejgu et.al.", "authors": "Andrei Stefan Bejgu, Edoardo Barba, Luigi Procopio, Alberte Fernández-Castro, Roberto Navigli", "id": "2412.09370v1", "paper_url": "http://arxiv.org/abs/2412.09370v1", "repo": "null"}}