{"2411.04573": {"publish_time": "2024-11-07", "title": "Multistage Fine-tuning Strategies for Automatic Speech Recognition in Low-resource Languages", "paper_summary": "This paper presents a novel multistage fine-tuning strategy designed to\nenhance automatic speech recognition (ASR) performance in low-resource\nlanguages using OpenAI's Whisper model. In this approach we aim to build ASR\nmodel for languages with limited digital resources by sequentially adapting the\nmodel across linguistically similar languages. We experimented this on the\nMalasar language, a Dravidian language spoken by approximately ten thousand\npeople in the Western Ghats of South India. Malasar language faces critical\nchallenges for technological intervention due to its lack of a native script\nand absence of digital or spoken data resources. Working in collaboration with\nWycliffe India and Malasar community members, we created a spoken Malasar\ncorpus paired with transcription in Tamil script, a closely related major\nlanguage. In our approach to build ASR model for Malasar, we first build an\nintermediate Tamil ASR, leveraging higher data availability for Tamil annotated\nspeech. This intermediate model is subsequently fine-tuned on Malasar data,\nallowing for more effective ASR adaptation despite limited resources. The\nmultistage fine-tuning strategy demonstrated significant improvements over\ndirect fine-tuning on Malasar data alone, achieving a word error rate (WER) of\n51.9%, which is 4.5% absolute reduction when compared to the direct fine-tuning\nmethod. Further a WER reduction to 47.3% was achieved through punctuation\nremoval in post-processing, which addresses formatting inconsistencies that\nimpact evaluation. Our results underscore the effectiveness of sequential\nmultistage fine-tuning combined with targeted post-processing as a scalable\nstrategy for ASR system development in low-resource languages, especially where\nlinguistic similarities can be leveraged to bridge gaps in training data.", "paper_summary_zh": "<paragraph>本文提出了一種新穎的多階段微調策略，旨在使用 OpenAI 的 Whisper 模型增強低資源語言中的自動語音識別 (ASR) 效能。在此方法中，我們旨在透過跨語言相似語言循序漸幅度地調整模型，為資源有限的語言建立 ASR 模型。我們在馬拉薩爾語上進行了實驗，馬拉薩爾語是一種德拉威語，由南印度西高止山脈約一萬人使用。由於馬拉薩爾語缺乏原生文字，且沒有數位或口語資料資源，因此面臨技術介入的嚴峻挑戰。我們與 Wycliffe India 和馬拉薩爾社區成員合作，建立了一個口語馬拉薩爾語語料庫，並配上以泰米爾文（一種密切相關的主要語言）書寫的轉錄。在我們建立馬拉薩爾語 ASR 模型的方法中，我們首先建立一個中間泰米爾語 ASR，利用泰米爾語標註語音較高的資料可用性。這個中間模型隨後在馬拉薩爾語資料上進行微調，儘管資源有限，仍能更有效地調整 ASR。多階段微調策略證明了與僅對馬拉薩爾語資料進行直接微調相比，有顯著的改善，達到 51.9% 的詞語錯誤率 (WER)，與直接微調方法相比，絕對降低了 4.5%。此外，透過後處理中的標點符號移除，WER 進一步降低至 47.3%，這解決了影響評估的格式不一致問題。我們的結果強調了循序多階段微調結合目標後處理作為低資源語言中 ASR 系統開發的可擴充策略的有效性，特別是在語言相似性可用於彌合訓練資料差距的情況下。</paragraph>", "author": "Leena G Pillai et.al.", "authors": "Leena G Pillai, Kavya Manohar, Basil K Raju, Elizabeth Sherly", "id": "2411.04573v1", "paper_url": "http://arxiv.org/abs/2411.04573v1", "repo": "null"}}