{"2410.18836": {"publish_time": "2024-10-24", "title": "From English-Centric to Effective Bilingual: LLMs with Custom Tokenizers for Underrepresented Languages", "paper_summary": "In this paper, we propose a model-agnostic cost-effective approach to\ndeveloping bilingual base large language models (LLMs) to support English and\nany target language. The method includes vocabulary expansion, initialization\nof new embeddings, model training and evaluation. We performed our experiments\nwith three languages, each using a non-Latin script - Ukrainian, Arabic, and\nGeorgian.\n  Our approach demonstrates improved language performance while reducing\ncomputational costs. It mitigates the disproportionate penalization of\nunderrepresented languages, promoting fairness and minimizing adverse phenomena\nsuch as code-switching and broken grammar. Additionally, we introduce new\nmetrics to evaluate language quality, revealing that vocabulary size\nsignificantly impacts the quality of generated text.", "paper_summary_zh": "在本文中，我們提出了一種與模型無關且經濟高效的方法來開發雙語基礎大型語言模型 (LLM)，以支援英語和任何目標語言。該方法包括詞彙擴充、新嵌入初始化、模型訓練和評估。我們使用三種語言進行了實驗，每種語言都使用非拉丁文字 - 烏克蘭語、阿拉伯語和格魯吉亞語。\n我們的做法證明了語言效能的提升，同時降低了運算成本。它減輕了對少數語言的不成比例懲罰，促進公平性並最大程度地減少代碼轉換和語法錯誤等不良現象。此外，我們引入了新的指標來評估語言品質，結果顯示詞彙量對生成文字的品質有顯著影響。", "author": "Artur Kiulian et.al.", "authors": "Artur Kiulian, Anton Polishko, Mykola Khandoga, Yevhen Kostiuk, Guillermo Gabrielli, Łukasz Gagała, Fadi Zaraket, Qusai Abu Obaida, Hrishikesh Garud, Wendy Wing Yee Mak, Dmytro Chaplynskyi, Selma Belhadj Amor, Grigol Peradze", "id": "2410.18836v1", "paper_url": "http://arxiv.org/abs/2410.18836v1", "repo": "null"}}