{"2408.03319": {"publish_time": "2024-08-06", "title": "Training LLMs to Recognize Hedges in Spontaneous Narratives", "paper_summary": "Hedges allow speakers to mark utterances as provisional, whether to signal\nnon-prototypicality or \"fuzziness\", to indicate a lack of commitment to an\nutterance, to attribute responsibility for a statement to someone else, to\ninvite input from a partner, or to soften critical feedback in the service of\nface-management needs. Here we focus on hedges in an experimentally\nparameterized corpus of 63 Roadrunner cartoon narratives spontaneously produced\nfrom memory by 21 speakers for co-present addressees, transcribed to text\n(Galati and Brennan, 2010). We created a gold standard of hedges annotated by\nhuman coders (the Roadrunner-Hedge corpus) and compared three LLM-based\napproaches for hedge detection: fine-tuning BERT, and zero and few-shot\nprompting with GPT-4o and LLaMA-3. The best-performing approach was a\nfine-tuned BERT model, followed by few-shot GPT-4o. After an error analysis on\nthe top performing approaches, we used an LLM-in-the-Loop approach to improve\nthe gold standard coding, as well as to highlight cases in which hedges are\nambiguous in linguistically interesting ways that will guide future research.\nThis is the first step in our research program to train LLMs to interpret and\ngenerate collateral signals appropriately and meaningfully in conversation.", "paper_summary_zh": "<paragraph>對沖允許說話者將言論標記為暫定的，無論是要標示非原型或「模糊性」，表示對言論缺乏承諾，將聲明的責任歸咎於他人，邀請夥伴提供意見，或在面子管理需求的服務中軟化批評性的回饋。在這裡，我們專注於 21 位說話者為共同出席的受話者自發性地從記憶中產生 63 個 Roadrunner 卡通敘事的實驗性參數化語料庫中的對沖，並轉錄成文字（Galati 和 Brennan，2010 年）。我們建立了由人類編碼器註釋的對沖黃金標準（Roadrunner-Hedge 語料庫），並比較了三種基於 LLM 的對沖偵測方法：微調 BERT，以及使用 GPT-4o 和 LLaMA-3 進行零次和少次提示。表現最佳的方法是微調後的 BERT 模型，其次是少次提示的 GPT-4o。在對表現最佳的方法進行錯誤分析後，我們使用 LLM-in-the-Loop 方法來改進黃金標準編碼，並強調對沖在語言學上有趣的方面中模稜兩可的情況，這將指導未來的研究。這是我們研究計畫的第一步，目的是訓練 LLM 在對話中適當地且有意義地解釋和產生附帶信號。</paragraph>", "author": "Amie J. Paige et.al.", "authors": "Amie J. Paige, Adil Soubki, John Murzaku, Owen Rambow, Susan E. Brennan", "id": "2408.03319v1", "paper_url": "http://arxiv.org/abs/2408.03319v1", "repo": "null"}}