{"2406.16638": {"publish_time": "2024-06-24", "title": "Feature Fusion for Human Activity Recognition using Parameter-Optimized Multi-Stage Graph Convolutional Network and Transformer Models", "paper_summary": "Human activity recognition (HAR) is a crucial area of research that involves\nunderstanding human movements using computer and machine vision technology.\nDeep learning has emerged as a powerful tool for this task, with models such as\nConvolutional Neural Networks (CNNs) and Transformers being employed to capture\nvarious aspects of human motion. One of the key contributions of this work is\nthe demonstration of the effectiveness of feature fusion in improving HAR\naccuracy by capturing spatial and temporal features, which has important\nimplications for the development of more accurate and robust activity\nrecognition systems. The study uses sensory data from HuGaDB, PKU-MMD, LARa,\nand TUG datasets. Two model, the PO-MS-GCN and a Transformer were trained and\nevaluated, with PO-MS-GCN outperforming state-of-the-art models. HuGaDB and TUG\nachieved high accuracies and f1-scores, while LARa and PKU-MMD had lower\nscores. Feature fusion improved results across datasets.", "paper_summary_zh": "人類活動辨識 (HAR) 是研究領域中至關重要的一環，涉及使用電腦與機器視覺技術來理解人類動作。深度學習已成為此項任務中強大的工具，其中卷積神經網路 (CNN) 和 Transformer 等模型被用來擷取人類動作的各種面向。本研究的主要貢獻之一，是展示特徵融合在提升 HAR 精確度方面的效用，方法是擷取空間與時間特徵，這對於開發更精確且穩健的活動辨識系統具有重要的意義。本研究使用來自 HuGaDB、PKU-MMD、LARa 和 TUG 資料集的感測資料。兩個模型，PO-MS-GCN 和 Transformer 經過訓練和評估，其中 PO-MS-GCN 優於現有的最先進模型。HuGaDB 和 TUG 達到高準確度和 f1 分數，而 LARa 和 PKU-MMD 則有較低的分數。特徵融合改善了跨資料集的結果。", "author": "Mohammad Belal et.al.", "authors": "Mohammad Belal, Taimur Hassan, Abdelfatah Ahmed, Ahmad Aljarah, Nael Alsheikh, Irfan Hussain", "id": "2406.16638v1", "paper_url": "http://arxiv.org/abs/2406.16638v1", "repo": "null"}}