{"2502.03692": {"publish_time": "2025-02-06", "title": "DocMIA: Document-Level Membership Inference Attacks against DocVQA Models", "paper_summary": "Document Visual Question Answering (DocVQA) has introduced a new paradigm for\nend-to-end document understanding, and quickly became one of the standard\nbenchmarks for multimodal LLMs. Automating document processing workflows,\ndriven by DocVQA models, presents significant potential for many business\nsectors. However, documents tend to contain highly sensitive information,\nraising concerns about privacy risks associated with training such DocVQA\nmodels. One significant privacy vulnerability, exploited by the membership\ninference attack, is the possibility for an adversary to determine if a\nparticular record was part of the model's training data. In this paper, we\nintroduce two novel membership inference attacks tailored specifically to\nDocVQA models. These attacks are designed for two different adversarial\nscenarios: a white-box setting, where the attacker has full access to the model\narchitecture and parameters, and a black-box setting, where only the model's\noutputs are available. Notably, our attacks assume the adversary lacks access\nto auxiliary datasets, which is more realistic in practice but also more\nchallenging. Our unsupervised methods outperform existing state-of-the-art\nmembership inference attacks across a variety of DocVQA models and datasets,\ndemonstrating their effectiveness and highlighting the privacy risks in this\ndomain.", "paper_summary_zh": "文件視覺問答 (DocVQA) 引進了一種新的範例，用於端對端文件理解，並迅速成為多模態 LLM 的標準基準之一。由 DocVQA 模型驅動的自動化文件處理工作流程，對許多商業領域具有顯著的潛力。然而，文件往往包含高度敏感的資訊，引發了與訓練此類 DocVQA 模型相關的隱私風險的疑慮。一個重大的隱私漏洞，由成員資格推論攻擊所利用，是對手有可能確定特定記錄是否為模型訓練資料的一部分。在本文中，我們介紹了兩個針對 DocVQA 模型量身打造的新穎成員資格推論攻擊。這些攻擊被設計用於兩種不同的對抗場景：白盒設定，其中攻擊者可以完全存取模型架構和參數，以及黑盒設定，其中只能使用模型的輸出。值得注意的是，我們的攻擊假設對手無法存取輔助資料集，這在實務上更為實際，但挑戰性也更高。我們的無監督方法在各種 DocVQA 模型和資料集上勝過現有的最先進成員資格推論攻擊，證明了它們的有效性，並突顯了此領域的隱私風險。", "author": "Khanh Nguyen et.al.", "authors": "Khanh Nguyen, Raouf Kerkouche, Mario Fritz, Dimosthenis Karatzas", "id": "2502.03692v1", "paper_url": "http://arxiv.org/abs/2502.03692v1", "repo": "null"}}