{"2412.02987": {"publish_time": "2024-12-04", "title": "Advancing Conversational Psychotherapy: Integrating Privacy, Dual-Memory, and Domain Expertise with Large Language Models", "paper_summary": "Mental health has increasingly become a global issue that reveals the\nlimitations of traditional conversational psychotherapy, constrained by\nlocation, time, expense, and privacy concerns. In response to these challenges,\nwe introduce SoulSpeak, a Large Language Model (LLM)-enabled chatbot designed\nto democratize access to psychotherapy. SoulSpeak improves upon the\ncapabilities of standard LLM-enabled chatbots by incorporating a novel\ndual-memory component that combines short-term and long-term context via\nRetrieval Augmented Generation (RAG) to offer personalized responses while\nensuring the preservation of user privacy and intimacy through a dedicated\nprivacy module. In addition, it leverages a counseling chat dataset of\ntherapist-client interactions and various prompting techniques to align the\ngenerated responses with psychotherapeutic methods. We introduce two fine-tuned\nBERT models to evaluate the system against existing LLMs and human therapists:\nthe Conversational Psychotherapy Preference Model (CPPM) to simulate human\npreference among responses and another to assess response relevance to user\ninput. CPPM is useful for training and evaluating psychotherapy-focused\nlanguage models independent from SoulSpeak, helping with the constrained\nresources available for psychotherapy. Furthermore, the effectiveness of the\ndual-memory component and the robustness of the privacy module are also\nexamined. Our findings highlight the potential and challenge of enhancing\nmental health care by offering an alternative that combines the expertise of\ntraditional therapy with the advantages of LLMs, providing a promising way to\naddress the accessibility and personalization gap in current mental health\nservices.", "paper_summary_zh": "心理健康已日益成為全球問題，暴露了傳統對話式心理治療的限制，受到地點、時間、費用和隱私問題的約束。為了應對這些挑戰，我們推出了 SoulSpeak，這是一款大型語言模型 (LLM) 啟用的聊天機器人，旨在實現心理治療的民主化。SoulSpeak 通過結合短期和長期語境的創新雙重記憶組件，通過檢索增強生成 (RAG) 來改進標準 LLM 啟用聊天機器人的能力，以提供個性化的回應，同時通過專用的隱私模組確保使用者隱私和親密性的保護。此外，它利用治療師與客戶互動的諮詢聊天資料集和各種提示技術，使生成的回應與心理治療方法保持一致。我們引入了兩個微調的 BERT 模型，以針對現有的 LLM 和人類治療師評估系統：對話式心理治療偏好模型 (CPPM) 用於模擬人類對回應的偏好，另一個用於評估對使用者輸入的回應相關性。CPPM 可用於訓練和評估與心理治療為重點的語言模型，而與 SoulSpeak 無關，有助於應對心理治療的受限資源。此外，還檢驗了雙重記憶組件的有效性及隱私模組的穩健性。我們的研究結果突出了通過提供結合傳統療法專業知識和 LLM 優勢的替代方案來增強心理保健的潛力和挑戰，為解決當前心理健康服務的可及性和個人化差距提供了一個有希望的方法。", "author": "XiuYu Zhang et.al.", "authors": "XiuYu Zhang, Zening Luo", "id": "2412.02987v1", "paper_url": "http://arxiv.org/abs/2412.02987v1", "repo": "null"}}