{"2406.10118": {"publish_time": "2024-06-14", "title": "SEACrowd: A Multilingual Multimodal Data Hub and Benchmark Suite for Southeast Asian Languages", "paper_summary": "Southeast Asia (SEA) is a region rich in linguistic diversity and cultural\nvariety, with over 1,300 indigenous languages and a population of 671 million\npeople. However, prevailing AI models suffer from a significant lack of\nrepresentation of texts, images, and audio datasets from SEA, compromising the\nquality of AI models for SEA languages. Evaluating models for SEA languages is\nchallenging due to the scarcity of high-quality datasets, compounded by the\ndominance of English training data, raising concerns about potential cultural\nmisrepresentation. To address these challenges, we introduce SEACrowd, a\ncollaborative initiative that consolidates a comprehensive resource hub that\nfills the resource gap by providing standardized corpora in nearly 1,000 SEA\nlanguages across three modalities. Through our SEACrowd benchmarks, we assess\nthe quality of AI models on 36 indigenous languages across 13 tasks, offering\nvaluable insights into the current AI landscape in SEA. Furthermore, we propose\nstrategies to facilitate greater AI advancements, maximizing potential utility\nand resource equity for the future of AI in SEA.", "paper_summary_zh": "東南亞 (SEA) 是個語言多元且文化多樣的地區，擁有超過 1,300 種原住民語言和 6.71 億人口。然而，現有的 AI 模型嚴重缺乏來自東南亞的文字、影像和音訊資料集，影響了東南亞語言 AI 模型的品質。由於缺乏高品質的資料集，加上英文訓練資料的影響，評估東南亞語言的模型具有挑戰性，也引發了潛在文化誤解的疑慮。為了應對這些挑戰，我們推出了 SEACrowd，這是一個合作計畫，整合了一個全面的資源中心，透過提供近 1,000 種東南亞語言的三種模式的標準語料庫，填補了資源缺口。透過我們的 SEACrowd 基準測試，我們評估了 36 種原住民語言在 13 個任務上的 AI 模型品質，提供了對東南亞當前 AI 發展的寶貴見解。此外，我們提出了促進 AI 進一步發展的策略，最大化東南亞 AI 未來的潛在效益和資源公平性。", "author": "Holy Lovenia et.al.", "authors": "Holy Lovenia, Rahmad Mahendra, Salsabil Maulana Akbar, Lester James V. Miranda, Jennifer Santoso, Elyanah Aco, Akhdan Fadhilah, Jonibek Mansurov, Joseph Marvin Imperial, Onno P. Kampman, Joel Ruben Antony Moniz, Muhammad Ravi Shulthan Habibi, Frederikus Hudi, Railey Montalan, Ryan Ignatius, Joanito Agili Lopo, William Nixon, Börje F. Karlsson, James Jaya, Ryandito Diandaru, Yuze Gao, Patrick Amadeus, Bin Wang, Jan Christian Blaise Cruz, Chenxi Whitehouse, Ivan Halim Parmonangan, Maria Khelli, Wenyu Zhang, Lucky Susanto, Reynard Adha Ryanda, Sonny Lazuardi Hermawan, Dan John Velasco, Muhammad Dehan Al Kautsar, Willy Fitra Hendria, Yasmin Moslem, Noah Flynn, Muhammad Farid Adilazuarda, Haochen Li, Johanes Lee, R. Damanhuri, Shuo Sun, Muhammad Reza Qorib, Amirbek Djanibekov, Wei Qi Leong, Quyet V. Do, Niklas Muennighoff, Tanrada Pansuwan, Ilham Firdausi Putra, Yan Xu, Ngee Chia Tai, Ayu Purwarianti, Sebastian Ruder, William Tjhi, Peerat Limkonchotiwat, Alham Fikri Aji, Sedrick Keh, Genta Indra Winata, Ruochen Zhang, Fajri Koto, Zheng-Xin Yong, Samuel Cahyawijaya", "id": "2406.10118v1", "paper_url": "http://arxiv.org/abs/2406.10118v1", "repo": "null"}}