{"2411.06786": {"publish_time": "2024-11-11", "title": "ScaleKD: Strong Vision Transformers Could Be Excellent Teachers", "paper_summary": "In this paper, we question if well pre-trained vision transformer (ViT)\nmodels could be used as teachers that exhibit scalable properties to advance\ncross architecture knowledge distillation (KD) research, in the context of\nusing large-scale datasets for evaluation. To make this possible, our analysis\nunderlines the importance of seeking effective strategies to align (1) feature\ncomputing paradigm differences, (2) model scale differences, and (3) knowledge\ndensity differences. By combining three coupled components namely cross\nattention projector, dual-view feature mimicking and teacher parameter\nperception tailored to address the above problems, we present a simple and\neffective KD method, called ScaleKD. Our method can train student backbones\nthat span across a variety of convolutional neural network (CNN), multi-layer\nperceptron (MLP), and ViT architectures on image classification datasets,\nachieving state-of-the-art distillation performance. For instance, taking a\nwell pre-trained Swin-L as the teacher model, our method gets\n75.15%|82.03%|84.16%|78.63%|81.96%|83.93%|83.80%|85.53% top-1 accuracies for\nMobileNet-V1|ResNet-50|ConvNeXt-T|Mixer-S/16|Mixer-B/16|ViT-S/16|Swin-T|ViT-B/16\nmodels trained on ImageNet-1K dataset from scratch, showing\n3.05%|3.39%|2.02%|4.61%|5.52%|4.03%|2.62%|3.73% absolute gains to the\nindividually trained counterparts. Intriguingly, when scaling up the size of\nteacher models or their pre-training datasets, our method showcases the desired\nscalable properties, bringing increasingly larger gains to student models. The\nstudent backbones trained by our method transfer well on downstream MS-COCO and\nADE20K datasets. More importantly, our method could be used as a more efficient\nalternative to the time-intensive pre-training paradigm for any target student\nmodel if a strong pre-trained ViT is available, reducing the amount of viewed\ntraining samples up to 195x.", "paper_summary_zh": "<paragraph>在本文中，我们质疑经过良好预训练的视觉转换器 (ViT) 模型是否可用作教师，在评估中使用大规模数据集时，展示可扩展属性以推进跨架构知识蒸馏 (KD) 研究。为了实现这一目标，我们的分析强调了寻求有效策略以对齐 (1) 特征计算范例差异、(2) 模型规模差异和 (3) 知识密度差异的重要性。通过结合三个耦合组件，即跨注意力投影仪、双视图特征模拟和针对上述问题量身定制的教师参数感知，我们提出了一种简单有效的 KD 方法，称为 ScaleKD。我们的方法可以训练跨越各种卷积神经网络 (CNN)、多层感知器 (MLP) 和 ViT 架构的学生主干在图像分类数据集上，实现最先进的蒸馏性能。例如，以经过良好预训练的 Swin-L 作为教师模型，我们的方法获得了 75.15%|82.03%|84.16%|78.63%|81.96%|83.93%|83.80%|85.53% 的 top-1 准确率，用于在 ImageNet-1K 数据集上从头开始训练的 MobileNet-V1|ResNet-50|ConvNeXt-T|Mixer-S/16|Mixer-B/16|ViT-S/16|Swin-T|ViT-B/16 模型，显示出 3.05%|3.39%|2.02%|4.61%|5.52%|4.03%|2.62%|3.73% 的绝对增益，高于单独训练的对应模型。有趣的是，当扩大教师模型或其预训练数据集的规模时，我们的方法展示了所需的可扩展属性，为学生模型带来了越来越大的收益。由我们的方法训练的学生主干很好地转移到下游 MS-COCO 和 ADE20K 数据集上。更重要的是，如果可以使用经过良好预训练的 ViT，我们的方法可以用作任何目标学生模型的时间密集型预训练范例的更有效替代方案，从而将查看的训练样本数量减少多达 195 倍。</paragraph>", "author": "Jiawei Fan et.al.", "authors": "Jiawei Fan, Chao Li, Xiaolong Liu, Anbang Yao", "id": "2411.06786v1", "paper_url": "http://arxiv.org/abs/2411.06786v1", "repo": "https://github.com/deep-optimization/scalekd"}}