{"2406.16000": {"publish_time": "2024-06-23", "title": "Predicting Individual Depression Symptoms from Acoustic Features During Speech", "paper_summary": "Current automatic depression detection systems provide predictions directly\nwithout relying on the individual symptoms/items of depression as denoted in\nthe clinical depression rating scales. In contrast, clinicians assess each item\nin the depression rating scale in a clinical setting, thus implicitly providing\na more detailed rationale for a depression diagnosis. In this work, we make a\nfirst step towards using the acoustic features of speech to predict individual\nitems of the depression rating scale before obtaining the final depression\nprediction. For this, we use convolutional (CNN) and recurrent (long short-term\nmemory (LSTM)) neural networks. We consider different approaches to learning\nthe temporal context of speech. Further, we analyze two variants of voting\nschemes for individual item prediction and depression detection. We also\ninclude an animated visualization that shows an example of item prediction over\ntime as the speech progresses.", "paper_summary_zh": "現有的自動憂鬱症偵測系統會直接提供預測，而不依賴臨床憂鬱症評分量表中所表示的個別症狀/項目。相較之下，臨床醫生會在臨床環境中評估憂鬱症評分量表中的每個項目，因此會隱含提供憂鬱症診斷的更詳細依據。在這項工作中，我們踏出第一步，使用語音的音訊特徵來預測憂鬱症評分量表的個別項目，然後再取得最終的憂鬱症預測。為此，我們使用卷積 (CNN) 和遞迴 (長短期記憶 (LSTM)) 神經網路。我們考慮不同的方法來學習語音的時間脈絡。此外，我們分析兩種投票方案的變體，用於個別項目預測和憂鬱症偵測。我們也包含一個動畫視覺化，顯示隨著語音進展，項目預測的一個範例。", "author": "Sebastian Rodriguez et.al.", "authors": "Sebastian Rodriguez, Sri Harsha Dumpala, Katerina Dikaios, Sheri Rempel, Rudolf Uher, Sageev Oore", "id": "2406.16000v1", "paper_url": "http://arxiv.org/abs/2406.16000v1", "repo": "null"}}