{"2410.19599": {"publish_time": "2024-10-25", "title": "Take Caution in Using LLMs as Human Surrogates: Scylla Ex Machina", "paper_summary": "Recent studies suggest large language models (LLMs) can exhibit human-like\nreasoning, aligning with human behavior in economic experiments, surveys, and\npolitical discourse. This has led many to propose that LLMs can be used as\nsurrogates for humans in social science research. However, LLMs differ\nfundamentally from humans, relying on probabilistic patterns, absent the\nembodied experiences or survival objectives that shape human cognition. We\nassess the reasoning depth of LLMs using the 11-20 money request game. Almost\nall advanced approaches fail to replicate human behavior distributions across\nmany models, except in one case involving fine-tuning using a substantial\namount of human behavior data. Causes of failure are diverse, relating to input\nlanguage, roles, and safeguarding. These results caution against using LLMs to\nstudy human behaviors or as human surrogates.", "paper_summary_zh": "近期研究表明大型語言模型（LLM）可以表現出類人的推理能力，在經濟實驗、調查和政治論述中與人類行為一致。這導致許多人提出 LLM 可以作為社會科學研究中人類的替代品。然而，LLM 與人類有根本上的不同，它們依賴於機率模式，缺乏塑造人類認知的具體經驗或生存目標。我們使用 11-20 美元請求遊戲評估 LLM 的推理深度。除了在一個涉及使用大量人類行為數據進行微調的情況外，幾乎所有先進的方法都無法複製多個模型中的人類行為分佈。失敗的原因是多方面的，涉及輸入語言、角色和保障。這些結果警告我們不要使用 LLM 來研究人類行為或作為人類的替代品。", "author": "Yuan Gao et.al.", "authors": "Yuan Gao, Dokyun Lee, Gordon Burtch, Sina Fazelpour", "id": "2410.19599v1", "paper_url": "http://arxiv.org/abs/2410.19599v1", "repo": "null"}}