{"2411.02426": {"publish_time": "2024-10-28", "title": "Diagnostic Performance of Deep Learning for Predicting Gliomas' IDH and 1p/19q Status in MRI: A Systematic Review and Meta-Analysis", "paper_summary": "Gliomas, the most common primary brain tumors, show high heterogeneity in\nhistological and molecular characteristics. Accurate molecular profiling, like\nisocitrate dehydrogenase (IDH) mutation and 1p/19q codeletion, is critical for\ndiagnosis, treatment, and prognosis. This review evaluates MRI-based deep\nlearning (DL) models' efficacy in predicting these biomarkers. Following PRISMA\nguidelines, we systematically searched major databases (PubMed, Scopus, Ovid,\nand Web of Science) up to February 2024, screening studies that utilized DL to\npredict IDH and 1p/19q codeletion status from MRI data of glioma patients. We\nassessed the quality and risk of bias using the radiomics quality score and\nQUADAS-2 tool. Our meta-analysis used a bivariate model to compute pooled\nsensitivity, specificity, and meta-regression to assess inter-study\nheterogeneity. Of the 565 articles, 57 were selected for qualitative synthesis,\nand 52 underwent meta-analysis. The pooled estimates showed high diagnostic\nperformance, with validation sensitivity, specificity, and area under the curve\n(AUC) of 0.84 [prediction interval (PI): 0.67-0.93, I2=51.10%, p < 0.05], 0.87\n[PI: 0.49-0.98, I2=82.30%, p < 0.05], and 0.89 for IDH prediction, and 0.76\n[PI: 0.28-0.96, I2=77.60%, p < 0.05], 0.85 [PI: 0.49-0.97, I2=80.30%, p <\n0.05], and 0.90 for 1p/19q prediction, respectively. Meta-regression analyses\nrevealed significant heterogeneity influenced by glioma grade, data source,\ninclusion of non-radiomics data, MRI sequences, segmentation and feature\nextraction methods, and validation techniques. DL models demonstrate strong\npotential in predicting molecular biomarkers from MRI scans, with significant\nvariability influenced by technical and clinical factors. Thorough external\nvalidation is necessary to increase clinical utility.", "paper_summary_zh": "膠質瘤是最常見的原發性腦腫瘤，在組織學和分子特徵上表現出高度異質性。準確的分子分析，如異檸檬酸脫氫酶 (IDH) 突變和 1p/19q 共缺失，對於診斷、治療和預後至關重要。本綜述評估了基於 MRI 的深度學習 (DL) 模型在預測這些生物標誌物方面的效能。按照 PRISMA 指南，我們系統地搜尋了主要資料庫（PubMed、Scopus、Ovid 和 Web of Science），時間截至 2024 年 2 月，篩選了利用 DL 從膠質瘤患者的 MRI 資料中預測 IDH 和 1p/19q 共缺失狀態的研究。我們使用放射組學品質評分和 QUADAS-2 工具評估了品質和偏差風險。我們的後設分析使用雙變數模型來計算合併敏感性、特異性和後設迴歸，以評估研究間異質性。在 565 篇文章中，有 57 篇被選用進行定性綜合，52 篇進行了後設分析。合併估計值顯示出很高的診斷效能，驗證敏感性、特異性和曲線下面積 (AUC) 分別為 0.84 [預測區間 (PI)：0.67-0.93，I2=51.10%，p < 0.05]、0.87 [PI：0.49-0.98，I2=82.30%，p < 0.05] 和 0.89，用於 IDH 預測；0.76 [PI：0.28-0.96，I2=77.60%，p < 0.05]、0.85 [PI：0.49-0.97，I2=80.30%，p < 0.05] 和 0.90，用於 1p/19q 預測。後設迴歸分析顯示，膠質瘤分級、資料來源、是否包含非放射組學資料、MRI 序列、分割和特徵提取方法以及驗證技術等因素會造成顯著的異質性。DL 模型展示了從 MRI 掃描中預測分子生物標誌物的強大潛力，但技術和臨床因素會造成顯著的變異性。徹底的外部分驗證對於提高臨床效用是必要的。", "author": "Somayeh Farahani et.al.", "authors": "Somayeh Farahani, Marjaneh Hejazi, Mehnaz Tabassum, Antonio Di Ieva, Neda Mahdavifar, Sidong Liu", "id": "2411.02426v1", "paper_url": "http://arxiv.org/abs/2411.02426v1", "repo": "null"}}