{"2405.19184": {"publish_time": "2024-05-29", "title": "Promoting Two-sided Fairness in Dynamic Vehicle Routing Problem", "paper_summary": "Dynamic Vehicle Routing Problem (DVRP), is an extension of the classic\nVehicle Routing Problem (VRP), which is a fundamental problem in logistics and\ntransportation. Typically, DVRPs involve two stakeholders: service providers\nthat deliver services to customers and customers who raise requests from\ndifferent locations. Many real-world applications can be formulated as DVRP\nsuch as ridesharing and non-compliance capture. Apart from original objectives\nlike optimising total utility or efficiency, DVRP should also consider fairness\nfor all parties. Unfairness can induce service providers and customers to give\nup on the systems, leading to negative financial and social impacts. However,\nmost existing DVRP-related applications focus on improving fairness from a\nsingle side, and there have been few works considering two-sided fairness and\nutility optimisation concurrently. To this end, we propose a novel framework, a\nTwo-sided Fairness-aware Genetic Algorithm (named 2FairGA), which expands the\ngenetic algorithm from the original objective solely focusing on utility to\nmulti-objectives that incorporate two-sided fairness. Subsequently, the impact\nof injecting two fairness definitions into the utility-focused model and the\ncorrelation between any pair of the three objectives are explored. Extensive\nexperiments demonstrate the superiority of our proposed framework compared to\nthe state-of-the-art.", "paper_summary_zh": "動態車輛路線問題 (DVRP) 是經典車輛路線問題 (VRP) 的延伸，而 VRP 是物流和運輸中的基本問題。通常，DVRP 涉及兩個利害關係人：向客戶提供服務的服務提供者和提出不同地點要求的客戶。許多真實世界的應用程式可以表述為 DVRP，例如共乘和非順從性擷取。除了優化總效用或效率等原始目標之外，DVRP 還應考慮所有方的公平性。不公平會導致服務提供者和客戶放棄系統，進而造成負面的財務和社會影響。然而，大多數現有的 DVRP 相關應用程式都專注於從單方面改善公平性，而且很少有同時考慮雙邊公平性和效用最佳化的研究。為此，我們提出了一個新的框架，一個雙邊公平感知遺傳演算法（稱為 2FairGA），它將遺傳演算法從原本僅關注效用的目標擴展到包含雙邊公平性的多目標。隨後，探討將兩個公平性定義注入以效用為中心的模型的影響，以及三個目標之間任何一對的相關性。廣泛的實驗證明了我們提出的框架優於最先進的技術。", "author": "Yufan Kang et.al.", "authors": "Yufan Kang, Rongsheng Zhang, Wei Shao, Flora D. Salim, Jeffrey Chan", "id": "2405.19184v1", "paper_url": "http://arxiv.org/abs/2405.19184v1", "repo": "null"}}