{"2409.11756": {"publish_time": "2024-09-18", "title": "Synthesizing Evolving Symbolic Representations for Autonomous Systems", "paper_summary": "Recently, AI systems have made remarkable progress in various tasks. Deep\nReinforcement Learning(DRL) is an effective tool for agents to learn policies\nin low-level state spaces to solve highly complex tasks. Researchers have\nintroduced Intrinsic Motivation(IM) to the RL mechanism, which simulates the\nagent's curiosity, encouraging agents to explore interesting areas of the\nenvironment. This new feature has proved vital in enabling agents to learn\npolicies without being given specific goals. However, even though DRL\nintelligence emerges through a sub-symbolic model, there is still a need for a\nsort of abstraction to understand the knowledge collected by the agent. To this\nend, the classical planning formalism has been used in recent research to\nexplicitly represent the knowledge an autonomous agent acquires and effectively\nreach extrinsic goals. Despite classical planning usually presents limited\nexpressive capabilities, PPDDL demonstrated usefulness in reviewing the\nknowledge gathered by an autonomous system, making explicit causal\ncorrelations, and can be exploited to find a plan to reach any state the agent\nfaces during its experience. This work presents a new architecture implementing\nan open-ended learning system able to synthesize from scratch its experience\ninto a PPDDL representation and update it over time. Without a predefined set\nof goals and tasks, the system integrates intrinsic motivations to explore the\nenvironment in a self-directed way, exploiting the high-level knowledge\nacquired during its experience. The system explores the environment and\niteratively: (a) discover options, (b) explore the environment using options,\n(c) abstract the knowledge collected and (d) plan. This paper proposes an\nalternative approach to implementing open-ended learning architectures\nexploiting low-level and high-level representations to extend its knowledge in\na virtuous loop.", "paper_summary_zh": "<paragraph>最近，AI 系統在各種任務上取得了顯著進展。深度強化學習 (DRL) 是一種有效的工具，可用於代理學習低層級狀態空間中的策略，以解決高度複雜的任務。研究人員已將內在動機 (IM) 引入 RL 機制中，模擬代理的好奇心，鼓勵代理探索環境中有趣的地方。此新功能已被證明對於讓代理學習策略至關重要，而無需給予具體目標。然而，儘管 DRL 智慧是透過次符號模型產生的，但仍需要一種抽象化來理解代理收集的知識。為此，最近的研究中使用了經典規劃形式主義，以明確表示自主代理獲得的知識，並有效地達成外在目標。儘管經典規劃通常表現出有限的表達能力，但 PPDDL 已證明在檢視自主系統收集的知識、明確因果關係方面很有用，並且可用於尋找計畫，以達成代理在經驗中面臨的任何狀態。這項工作提出了一種新的架構，實作一個開放式學習系統，能夠從頭開始將其經驗合成到 PPDDL 表示中，並隨著時間推移更新它。在沒有預定義的目標和任務的情況下，系統整合內在動機，以自導方式探索環境，利用其經驗中獲得的高層級知識。系統探索環境並反覆：(a) 發現選項，(b) 使用選項探索環境，(c) 抽象收集的知識，以及 (d) 規劃。本文提出了一種替代方法，用於實作開放式學習架構，利用低層級和高層級表示來擴展其知識，形成良性循環。</paragraph>", "author": "Gabriele Sartor et.al.", "authors": "Gabriele Sartor, Angelo Oddi, Riccardo Rasconi, Vieri Giuliano Santucci, Rosa Meo", "id": "2409.11756v1", "paper_url": "http://arxiv.org/abs/2409.11756v1", "repo": "https://github.com/gabrielesartor/discover_plan_act"}}