{"2502.09814": {"publish_time": "2025-02-13", "title": "INJONGO: A Multicultural Intent Detection and Slot-filling Dataset for 16 African Languages", "paper_summary": "Slot-filling and intent detection are well-established tasks in\nConversational AI. However, current large-scale benchmarks for these tasks\noften exclude evaluations of low-resource languages and rely on translations\nfrom English benchmarks, thereby predominantly reflecting Western-centric\nconcepts. In this paper, we introduce Injongo -- a multicultural, open-source\nbenchmark dataset for 16 African languages with utterances generated by native\nspeakers across diverse domains, including banking, travel, home, and dining.\nThrough extensive experiments, we benchmark the fine-tuning multilingual\ntransformer models and the prompting large language models (LLMs), and show the\nadvantage of leveraging African-cultural utterances over Western-centric\nutterances for improving cross-lingual transfer from the English language.\nExperimental results reveal that current LLMs struggle with the slot-filling\ntask, with GPT-4o achieving an average performance of 26 F1-score. In contrast,\nintent detection performance is notably better, with an average accuracy of\n70.6%, though it still falls behind the fine-tuning baselines. Compared to the\nEnglish language, GPT-4o and fine-tuning baselines perform similarly on intent\ndetection, achieving an accuracy of approximately 81%. Our findings suggest\nthat the performance of LLMs is still behind for many low-resource African\nlanguages, and more work is needed to further improve their downstream\nperformance.", "paper_summary_zh": "插槽填補和意圖偵測是對話式 AI 中的既定任務。然而，這些任務的現行大型基準測試通常會排除低資源語言的評估，並依賴於從英文基準測試的翻譯，因此主要反映以西方為中心的觀念。在本文中，我們介紹 Injongo - 一個多文化、開放原始碼基準測試資料集，包含 16 種非洲語言，由母語人士在不同領域（包括銀行、旅遊、家庭和用餐）中產生的語句。透過廣泛的實驗，我們對微調多語言變形金剛模型和提示大型語言模型 (LLM) 進行基準測試，並展示了利用非洲文化語句優於以西方為中心的語句來改善從英文進行跨語言轉移的優勢。實驗結果顯示，目前的 LLM 難以應付插槽填補任務，GPT-4o 的平均表現為 26 F1 分數。相比之下，意圖偵測表現顯著較佳，平均準確度為 70.6%，儘管仍落後於微調基準。與英文相比，GPT-4o 和微調基準在意圖偵測方面表現類似，準確度約為 81%。我們的發現表明，LLM 的表現對於許多低資源的非洲語言來說仍然落後，需要更多的工作來進一步改善它們的下游表現。", "author": "Hao Yu et.al.", "authors": "Hao Yu, Jesujoba O. Alabi, Andiswa Bukula, Jian Yun Zhuang, En-Shiun Annie Lee, Tadesse Kebede Guge, Israel Abebe Azime, Happy Buzaaba, Blessing Kudzaishe Sibanda, Godson K. Kalipe, Jonathan Mukiibi, Salomon Kabongo Kabenamualu, Mmasibidi Setaka, Lolwethu Ndolela, Nkiruka Odu, Rooweither Mabuya, Shamsuddeen Hassan Muhammad, Salomey Osei, Sokhar Samb, Juliet W. Murage, Dietrich Klakow, David Ifeoluwa Adelani", "id": "2502.09814v1", "paper_url": "http://arxiv.org/abs/2502.09814v1", "repo": "null"}}