{"2412.20694": {"publish_time": "2024-12-30", "title": "UBER: Uncertainty-Based Evolution with Large Language Models for Automatic Heuristic Design", "paper_summary": "NP-hard problem-solving traditionally relies on heuristics, but manually\ncrafting effective heuristics for complex problems remains challenging. While\nrecent work like FunSearch has demonstrated that large language models (LLMs)\ncan be leveraged for heuristic design in evolutionary algorithm (EA)\nframeworks, their potential is not fully realized due to its deficiency in\nexploitation and exploration. We present UBER (Uncertainty-Based Evolution for\nRefinement), a method that enhances LLM+EA methods for automatic heuristic\ndesign by integrating uncertainty on top of the FunSearch framework. UBER\nintroduces two key innovations: an Uncertainty-Inclusive Evolution Process\n(UIEP) for adaptive exploration-exploitation balance, and a principled\nUncertainty-Inclusive Island Reset (UIIS) strategy for maintaining population\ndiversity. Through extensive experiments on challenging NP-complete problems,\nUBER demonstrates significant improvements over FunSearch. Our work provides a\nnew direction for the synergy of LLMs and EA, advancing the field of automatic\nheuristic design.", "paper_summary_zh": "NP 難度問題求解傳統上依賴啟發法，但人工製作複雜問題的有效啟發法仍然具有挑戰性。雖然像 FunSearch 這樣的近期工作已經證明，大型語言模型 (LLM) 可以用於演化演算法 (EA) 框架中的啟發式設計，但由於其在利用和探索方面的不足，它們的潛力並未得到充分發揮。我們提出了 UBER（基於不確定性的精煉演化），這是一種通過在 FunSearch 框架之上整合不確定性來增強 LLM+EA 方法以進行自動啟發式設計的方法。UBER 引入了兩項關鍵創新：用於自適應探索-利用平衡的不確定性包容演化過程 (UIEP)，以及用於維持種群多樣性的基於原則的不確定性包容島嶼重置 (UIIS) 策略。通過對具有挑戰性的 NP 完全問題進行廣泛的實驗，UBER 展示了比 FunSearch 更顯著的改進。我們的研究為 LLM 和 EA 的協同作用提供了新的方向，推動了自動啟發式設計領域的發展。", "author": "Zijie Chen et.al.", "authors": "Zijie Chen, Zhanchao Zhou, Yu Lu, Renjun Xu, Lili Pan, Zhenzhong Lan", "id": "2412.20694v1", "paper_url": "http://arxiv.org/abs/2412.20694v1", "repo": "null"}}