{"2405.10523": {"publish_time": "2024-05-17", "title": "Smart Expert System: Large Language Models as Text Classifiers", "paper_summary": "Text classification is a fundamental task in Natural Language Processing\n(NLP), and the advent of Large Language Models (LLMs) has revolutionized the\nfield. This paper introduces the Smart Expert System, a novel approach that\nleverages LLMs as text classifiers. The system simplifies the traditional text\nclassification workflow, eliminating the need for extensive preprocessing and\ndomain expertise. The performance of several LLMs, machine learning (ML)\nalgorithms, and neural network (NN) based structures is evaluated on four\ndatasets. Results demonstrate that certain LLMs surpass traditional methods in\nsentiment analysis, spam SMS detection and multi-label classification.\nFurthermore, it is shown that the system's performance can be further enhanced\nthrough few-shot or fine-tuning strategies, making the fine-tuned model the top\nperformer across all datasets. Source code and datasets are available in this\nGitHub repository: https://github.com/yeyimilk/llm-zero-shot-classifiers.", "paper_summary_zh": "文本分類是自然語言處理 (NLP) 中的一項基本任務，而大型語言模型 (LLM) 的出現已經徹底改變了這個領域。本文介紹了智慧專家系統，這是一種新穎的方法，它利用 LLM 作為文本分類器。該系統簡化了傳統的文本分類工作流程，消除了對廣泛預處理和領域專業知識的需求。在四個資料集上評估了幾個 LLM、機器學習 (ML) 演算法和基於神經網路 (NN) 的結構的效能。結果表明，某些 LLM 在情緒分析、垃圾簡訊偵測和多標籤分類中優於傳統方法。此外，結果顯示，該系統的效能可以透過少量樣本學習或微調策略進一步增強，使微調模型在所有資料集中的表現都最佳。原始碼和資料集可在這個 GitHub 儲存庫中取得：https://github.com/yeyimilk/llm-zero-shot-classifiers。", "author": "Zhiqiang Wang et.al.", "authors": "Zhiqiang Wang, Yiran Pang, Yanbin Lin", "id": "2405.10523v1", "paper_url": "http://arxiv.org/abs/2405.10523v1", "repo": "https://github.com/yeyimilk/llm-zero-shot-classifiers"}}