{"2503.04176": {"publish_time": "2025-03-06", "title": "TIMER: Temporal Instruction Modeling and Evaluation for Longitudinal Clinical Records", "paper_summary": "Large language models (LLMs) have emerged as promising tools for assisting in\nmedical tasks, yet processing Electronic Health Records (EHRs) presents unique\nchallenges due to their longitudinal nature. While LLMs' capabilities to\nperform medical tasks continue to improve, their ability to reason over\ntemporal dependencies across multiple patient visits and time frames remains\nunexplored. We introduce TIMER (Temporal Instruction Modeling and Evaluation\nfor Longitudinal Clinical Records), a framework that incorporate\ninstruction-response pairs grounding to different parts of a patient's record\nas a critical dimension in both instruction evaluation and tuning for\nlongitudinal clinical records. We develop TIMER-Bench, the first time-aware\nbenchmark that evaluates temporal reasoning capabilities over longitudinal\nEHRs, as well as TIMER-Instruct, an instruction-tuning methodology for LLMs to\nlearn reasoning over time. We demonstrate that models fine-tuned with\nTIMER-Instruct improve performance by 7.3% on human-generated benchmarks and\n9.2% on TIMER-Bench, indicating that temporal instruction-tuning improves model\nperformance for reasoning over EHR.", "paper_summary_zh": "大型語言模型 (LLM) 已成為協助醫療任務的潛力工具，但由於電子健康記錄 (EHR) 的縱向性質，處理 EHR 仍存在獨特的挑戰。雖然 LLM 執行醫療任務的能力不斷提高，但它們在跨多個病人就診和時間範圍內對時間依賴性進行推理的能力仍有待探索。我們引入了 TIMER（縱向臨床記錄的時間指令建模和評估），這是一個框架，它將指令-響應對與患者記錄的不同部分聯繫起來，作為縱向臨床記錄的指令評估和調整的關鍵維度。我們開發了 TIMER-Bench，這是第一個具有時間感知的基準測試，用於評估縱向 EHR 的時間推理能力，以及 TIMER-Instruct，這是一種用於 LLM 的指令調整方法，用於學習隨時間推移的推理。我們證明，使用 TIMER-Instruct 微調的模型在人工生成的基準測試中性能提高了 7.3%，在 TIMER-Bench 中提高了 9.2%，這表明時間指令調整提高了模型對 EHR 推理的性能。\n", "author": "Hejie Cui et.al.", "authors": "Hejie Cui, Alyssa Unell, Bowen Chen, Jason Alan Fries, Emily Alsentzer, Sanmi Koyejo, Nigam Shah", "id": "2503.04176v1", "paper_url": "http://arxiv.org/abs/2503.04176v1", "repo": "null"}}