{"2503.21435": {"publish_time": "2025-03-27", "title": "Graph-to-Vision: Multi-graph Understanding and Reasoning using Vision-Language Models", "paper_summary": "Graph Neural Networks (GNNs), as the dominant paradigm for graph-structured\nlearning, have long faced dual challenges of exponentially escalating\ncomputational complexity and inadequate cross-scenario generalization\ncapability. With the rapid advancement of multimodal learning, Vision-Language\nModels (VLMs) have demonstrated exceptional cross-modal relational reasoning\ncapabilities and generalization capacities, thereby opening up novel pathways\nfor overcoming the inherent limitations of conventional graph learning\nparadigms. However, current research predominantly concentrates on\ninvestigating the single-graph reasoning capabilities of VLMs, which\nfundamentally fails to address the critical requirement for coordinated\nreasoning across multiple heterogeneous graph data in real-world application\nscenarios. To address these limitations, we propose the first multi-graph joint\nreasoning benchmark for VLMs. Our benchmark encompasses four graph categories:\nknowledge graphs, flowcharts, mind maps, and route maps,with each graph group\naccompanied by three progressively challenging instruction-response pairs.\nLeveraging this benchmark, we conducted comprehensive capability assessments of\nstate-of-the-art VLMs and performed fine-tuning on open-source models. This\nstudy not only addresses the underexplored evaluation gap in multi-graph\nreasoning for VLMs but also empirically validates their generalization\nsuperiority in graph-structured learning.", "paper_summary_zh": "<paragraph>圖神經網路 (GNNs) 作為圖結構學習的主流範式，長期以來一直面臨著計算複雜度呈指數級增長和跨場景泛化能力不足的雙重挑戰。隨著多模態學習的快速發展，視覺語言模型 (VLMs) 展現出卓越的跨模態關係推理能力和泛化能力，從而為克服傳統圖學習範式的固有局限性開闢了新的途徑。然而，目前的研究主要集中在探討 VLM 的單圖推理能力，這根本未能滿足現實應用場景中跨多個異構圖數據進行協同推理的關鍵需求。為了克服這些限制，我們提出了第一個針對 VLM 的多圖聯合推理基準測試。我們的基準測試涵蓋四種類型的圖：知識圖譜、流程圖、思維導圖和路線圖，每個圖組都伴隨著三組逐步提升難度的指令-回應對。利用這個基準測試，我們對最先進的 VLM 進行了全面的能力評估，並對開源模型進行了微調。這項研究不僅彌補了 VLM 在多圖推理方面未被充分探索的評估缺口，而且以經驗驗證了它們在圖結構學習中的泛化優勢。</paragraph>\n", "author": "Ruizhou Li et.al.", "authors": "Ruizhou Li, Haiyun Jiang", "id": "2503.21435v1", "paper_url": "http://arxiv.org/abs/2503.21435v1", "repo": "null"}}