{"2405.14490": {"publish_time": "2024-05-23", "title": "Impact of Non-Standard Unicode Characters on Security and Comprehension in Large Language Models", "paper_summary": "The advancement of large language models has significantly improved natural\nlanguage processing. However, challenges such as jailbreaks (prompt injections\nthat cause an LLM to follow instructions contrary to its intended use),\nhallucinations (generating incorrect or misleading information), and\ncomprehension errors remain prevalent. In this report, we present a comparative\nanalysis of the performance of fifteen distinct models, with each model\nundergoing a standardized test comprising 38 queries across three key metrics:\njailbreaks, hallucinations, and comprehension errors. The models are assessed\nbased on the total occurrences of jailbreaks, hallucinations, and comprehension\nerrors. Our work exposes these models' inherent vulnerabilities and challenges\nthe notion of human-level language comprehension of these models. We have\nempirically analysed the impact of non-standard Unicode characters on LLMs and\ntheir safeguarding mechanisms on the best-performing LLMs, including GPT-4,\nGemini 1.5 Pro, LlaMA-3-70B, and Claude 3 Opus. By incorporating alphanumeric\nsymbols from Unicode outside the standard Latin block and variants of\ncharacters in other languages, we observed a reduction in the efficacy of\nguardrails implemented through Reinforcement Learning Human Feedback (RLHF).\nConsequently, these models exhibit heightened vulnerability to content policy\nbreaches and prompt leakage. Our study also suggests a need to incorporate\nnon-standard Unicode text in LLM training data to enhance the capabilities of\nthese models.", "paper_summary_zh": "大型語言模型的進步顯著地改善了自然語言處理。然而，挑戰仍然普遍存在，例如越獄（提示注入導致 LLM 遵循與其預期用途相反的指令）、幻覺（產生不正確或誤導性的資訊）和理解錯誤。在此報告中，我們提出對 15 個不同模型的效能進行比較分析，每個模型都接受一項標準化測試，其中包含 38 個查詢，橫跨三個關鍵指標：越獄、幻覺和理解錯誤。這些模型的評估基礎是越獄、幻覺和理解錯誤的總發生次數。我們的研究揭露了這些模型固有的脆弱性，並挑戰了這些模型具有人類語言理解層級的概念。我們已根據經驗分析非標準 Unicode 字元對 LLM 的影響，以及其對包括 GPT-4、Gemini 1.5 Pro、LlaMA-3-70B 和 Claude 3 Opus 在內的效能最佳 LLM 的防護機制。透過納入標準拉丁區塊和其它語言中字元變體之外的 Unicode 字母數字符號，我們觀察到透過強化學習人類回饋 (RLHF) 實施的護欄效能降低。因此，這些模型對內容政策違規和提示外洩表現出更高的脆弱性。我們的研究還表明需要在 LLM 訓練資料中納入非標準 Unicode 文字，以增強這些模型的能力。", "author": "Johan S Daniel et.al.", "authors": "Johan S Daniel, Anand Pal", "id": "2405.14490v1", "paper_url": "http://arxiv.org/abs/2405.14490v1", "repo": "https://github.com/raidedcluster/non-standard_unicode_jailbreaks"}}