{"2410.23684": {"publish_time": "2024-10-31", "title": "Improbable Bigrams Expose Vulnerabilities of Incomplete Tokens in Byte-Level Tokenizers", "paper_summary": "Tokenization is a crucial step that bridges human-readable text with\nmodel-readable discrete tokens. However, recent studies have revealed that\ntokenizers can be exploited to elicit unwanted model behaviors. In this work,\nwe investigate incomplete tokens, i.e., undecodable tokens with stray bytes\nresulting from byte-level byte-pair encoding (BPE) tokenization. We hypothesize\nthat such tokens are heavily reliant on their adjacent tokens and are fragile\nwhen paired with unfamiliar tokens. To demonstrate this vulnerability, we\nintroduce improbable bigrams: out-of-distribution combinations of incomplete\ntokens designed to exploit their dependency. Our experiments show that\nimprobable bigrams are significantly prone to hallucinatory behaviors.\nSurprisingly, alternative tokenizations of the same phrases result in\ndrastically lower rates of hallucination (93% reduction in Llama3.1). We\ncaution against the potential vulnerabilities introduced by byte-level BPE\ntokenizers, which may impede the development of trustworthy language models.", "paper_summary_zh": "符號化是將人類可讀文字與模型可讀離散符號之間的橋樑，這是一個至關重要的步驟。然而，最近的研究表明，符號化器可被利用來引發模型的非預期行為。在這項工作中，我們研究了不完整的符號，也就是說，由於位元組層級位元組對編碼 (BPE) 符號化而產生的具有雜散位元組的不可解碼符號。我們假設此類符號極度依賴其相鄰符號，並且在與不熟悉的符號配對時很脆弱。為了證明此漏洞，我們引入了不可能的雙字組：不完整的符號的離散分佈組合，旨在利用其依賴性。我們的實驗表明，不可能的雙字組極易出現幻覺行為。令人驚訝的是，相同短語的替代符號化導致幻覺發生的機率大幅降低 (Llama3.1 降低 93%)。我們警告，位元組層級 BPE 符號化器引入的潛在漏洞可能會阻礙可信賴語言模型的發展。", "author": "Eugene Jang et.al.", "authors": "Eugene Jang, Kimin Lee, Jin-Woo Chung, Keuntae Park, Seungwon Shin", "id": "2410.23684v1", "paper_url": "http://arxiv.org/abs/2410.23684v1", "repo": "null"}}