{"2406.12806": {"publish_time": "2024-06-18", "title": "Identifying Performance-Sensitive Configurations in Software Systems through Code Analysis with LLM Agents", "paper_summary": "Configuration settings are essential for tailoring software behavior to meet\nspecific performance requirements. However, incorrect configurations are\nwidespread, and identifying those that impact system performance is challenging\ndue to the vast number and complexity of possible settings. In this work, we\npresent PerfSense, a lightweight framework that leverages Large Language Models\n(LLMs) to efficiently identify performance-sensitive configurations with\nminimal overhead. PerfSense employs LLM agents to simulate interactions between\ndevelopers and performance engineers using advanced prompting techniques such\nas prompt chaining and retrieval-augmented generation (RAG). Our evaluation of\nseven open-source Java systems demonstrates that PerfSense achieves an average\naccuracy of 64.77% in classifying performance-sensitive configurations,\noutperforming both our LLM baseline (50.36%) and the previous state-of-the-art\nmethod (61.75%). Notably, our prompt chaining technique improves recall by 10%\nto 30% while maintaining similar precision levels. Additionally, a manual\nanalysis of 362 misclassifications reveals common issues, including LLMs'\nmisunderstandings of requirements (26.8%). In summary, PerfSense significantly\nreduces manual effort in classifying performance-sensitive configurations and\noffers valuable insights for future LLM-based code analysis research.", "paper_summary_zh": "設定組態對於調整軟體行為以符合特定效能需求至關重要。然而，不正確的組態很普遍，且由於可能的設定數量龐大且複雜，因此找出影響系統效能的設定具有挑戰性。在這項工作中，我們提出 PerfSense，一個輕量級的架構，它利用大型語言模型 (LLM) 以最小的開銷有效地找出效能敏感的組態。PerfSense 使用 LLM 代理程式來模擬開發人員和效能工程師之間的互動，使用進階提示技術，例如提示鏈接和檢索增強生成 (RAG)。我們對七個開源 Java 系統的評估顯示，PerfSense 在分類效能敏感組態方面達到了 64.77% 的平均準確度，優於我們的 LLM 基準 (50.36%) 和先前的最先進方法 (61.75%)。值得注意的是，我們的提示鏈接技術將召回率提高了 10% 至 30%，同時維持類似的精確度水準。此外，對 362 個錯誤分類的手動分析揭露了常見的問題，包括 LLM 對需求的誤解 (26.8%)。總之，PerfSense 大幅減少了分類效能敏感組態的手動工作，並為未來的基於 LLM 的程式碼分析研究提供了寶貴的見解。", "author": "Zehao Wang et.al.", "authors": "Zehao Wang, Dong Jae Kim, Tse-Hsun Chen", "id": "2406.12806v1", "paper_url": "http://arxiv.org/abs/2406.12806v1", "repo": "null"}}