{"2411.14672": {"publish_time": "2024-11-22", "title": "Multiverse of Greatness: Generating Story Branches with LLMs", "paper_summary": "This paper presents Dynamic Context Prompting/Programming (DCP/P), a novel\nframework for interacting with LLMs to generate graph-based content with a\ndynamic context window history. While there is an existing study utilizing LLMs\nto generate a visual novel game, the previous study involved a manual process\nof output extraction and did not provide flexibility in generating a longer,\ncoherent story. We evaluate DCP/P against our baseline, which does not provide\ncontext history to an LLM and only relies on the initial story data. Through\nobjective evaluation, we show that simply providing the LLM with a summary\nleads to a subpar story compared to additionally providing the LLM with the\nproper context of the story. We also provide an extensive qualitative analysis\nand discussion. We qualitatively examine the quality of the objectively\nbest-performing generated game from each approach. In addition, we examine\nbiases in word choices and word sentiment of the generated content. We find a\nconsistent observation with previous studies that LLMs are biased towards\ncertain words, even with a different LLM family. Finally, we provide a\ncomprehensive discussion on opportunities for future studies.", "paper_summary_zh": "本文提出動態內容提示/程式設計 (DCP/P)，這是一個互動式 LLM 新架構，可產生具有動態內容視窗歷程記錄的圖形化內容。儘管現有研究利用 LLM 產生視覺小說遊戲，但先前的研究涉及手動輸出擷取過程，且無法靈活產生較長、連貫的故事。我們評估 DCP/P 與我們的基準，基準未提供 LLM 內容歷程記錄，且僅依賴於初始故事資料。透過客觀評估，我們顯示僅提供 LLM 摘要，會產生次佳故事，相較於額外提供 LLM 適當的故事內容。我們也提供廣泛的定性分析與討論。我們定性地檢視每種方法產生的遊戲中，客觀最佳表現的品質。此外，我們檢視產生內容中字詞選擇和字詞情緒的偏誤。我們發現一項與先前研究一致的觀察，即 LLM 偏向特定字詞，即使使用不同的 LLM 家族。最後，我們提供有關未來研究機會的全面討論。", "author": "Pittawat Taveekitworachai et.al.", "authors": "Pittawat Taveekitworachai, Chollakorn Nimpattanavong, Mustafa Can Gursesli, Antonio Lanata, Andrea Guazzini, Ruck Thawonmas", "id": "2411.14672v1", "paper_url": "http://arxiv.org/abs/2411.14672v1", "repo": "null"}}