{"2406.11634": {"publish_time": "2024-06-17", "title": "The Base-Rate Effect on LLM Benchmark Performance: Disambiguating Test-Taking Strategies from Benchmark Performance", "paper_summary": "Cloze testing is a common method for measuring the behavior of large language\nmodels on a number of benchmark tasks. Using the MMLU dataset, we show that the\nbase-rate probability (BRP) differences across answer tokens are significant\nand affect task performance ie. guess A if uncertain. We find that\ncounterfactual prompting does sufficiently mitigate the BRP effect. The BRP\neffect is found to have a similar effect to test taking strategies employed by\nhumans leading to the conflation of task performance and test-taking ability.\nWe propose the Nvr-X-MMLU task, a variation of MMLU, which helps to\ndisambiguate test-taking ability from task performance and reports the latter.", "paper_summary_zh": "完形填空測試是一種常見的方法，用於衡量大型語言模型在許多基準任務上的行為。使用 MMLU 資料集，我們展示了答案符號之間的基礎機率 (BRP) 差異具有顯著意義，並影響任務執行，例如在不確定時猜測 A。我們發現反事實提示確實可以充分減輕 BRP 效應。發現 BRP 效應對人類採用的應試策略具有類似的效應，導致任務執行和應試能力混淆。我們提出了 Nvr-X-MMLU 任務，這是 MMLU 的一種變體，有助於消除應試能力與任務執行之間的歧義，並報告後者。", "author": "Kyle Moore et.al.", "authors": "Kyle Moore, Jesse Roberts, Thao Pham, Oseremhen Ewaleifoh, Doug Fisher", "id": "2406.11634v1", "paper_url": "http://arxiv.org/abs/2406.11634v1", "repo": "null"}}