{"2406.07876": {"publish_time": "2024-06-12", "title": "Small Scale Data-Free Knowledge Distillation", "paper_summary": "Data-free knowledge distillation is able to utilize the knowledge learned by\na large teacher network to augment the training of a smaller student network\nwithout accessing the original training data, avoiding privacy, security, and\nproprietary risks in real applications. In this line of research, existing\nmethods typically follow an inversion-and-distillation paradigm in which a\ngenerative adversarial network on-the-fly trained with the guidance of the\npre-trained teacher network is used to synthesize a large-scale sample set for\nknowledge distillation. In this paper, we reexamine this common data-free\nknowledge distillation paradigm, showing that there is considerable room to\nimprove the overall training efficiency through a lens of ``small-scale\ninverted data for knowledge distillation\". In light of three empirical\nobservations indicating the importance of how to balance class distributions in\nterms of synthetic sample diversity and difficulty during both data inversion\nand distillation processes, we propose Small Scale Data-free Knowledge\nDistillation SSD-KD. In formulation, SSD-KD introduces a modulating function to\nbalance synthetic samples and a priority sampling function to select proper\nsamples, facilitated by a dynamic replay buffer and a reinforcement learning\nstrategy. As a result, SSD-KD can perform distillation training conditioned on\nan extremely small scale of synthetic samples (e.g., 10X less than the original\ntraining data scale), making the overall training efficiency one or two orders\nof magnitude faster than many mainstream methods while retaining superior or\ncompetitive model performance, as demonstrated on popular image classification\nand semantic segmentation benchmarks. The code is available at\nhttps://github.com/OSVAI/SSD-KD.", "paper_summary_zh": "無資料知識萃取能夠利用大型教師網路學習到的知識，在不存取原始訓練資料的情況下擴充較小型學生網路的訓練，避免實際應用中的隱私、安全和專有風險。在這個研究領域中，現有方法通常遵循反演和萃取範例，其中生成式對抗網路在預訓練教師網路的指導下進行即時訓練，用於合成大規模樣本集以進行知識萃取。在本文中，我們重新審視這個常見的無資料知識萃取範例，顯示透過「用於知識萃取的小規模反轉資料」的觀點，有相當大的空間可以改善整體訓練效率。根據三個經驗觀察結果，指出在資料反演和萃取過程中，平衡類別分佈在合成樣本多樣性和難度方面的重要性，我們提出小規模無資料知識萃取 SSD-KD。在公式化中，SSD-KD 導入一個調節函數來平衡合成樣本，並導入一個優先取樣函數來選擇適當的樣本，並透過動態重播緩衝區和強化學習策略來協助。因此，SSD-KD 可以執行萃取訓練，條件是合成樣本的規模極小（例如，比原始訓練資料規模小 10 倍），使整體訓練效率比許多主流方法快一到兩個數量級，同時保有優異或有競爭力的模型效能，如在流行的影像分類和語意分割基準中所展示的。程式碼可在 https://github.com/OSVAI/SSD-KD 取得。", "author": "He Liu et.al.", "authors": "He Liu, Yikai Wang, Huaping Liu, Fuchun Sun, Anbang Yao", "id": "2406.07876v1", "paper_url": "http://arxiv.org/abs/2406.07876v1", "repo": "null"}}