{"2412.20584": {"publish_time": "2024-12-29", "title": "Towards Neural No-Resource Language Translation: A Comparative Evaluation of Approaches", "paper_summary": "No-resource languages - those with minimal or no digital representation -\npose unique challenges for machine translation (MT). Unlike low-resource\nlanguages, which rely on limited but existent corpora, no-resource languages\noften have fewer than 100 sentences available for training. This work explores\nthe problem of no-resource translation through three distinct workflows:\nfine-tuning of translation-specific models, in-context learning with large\nlanguage models (LLMs) using chain-of-reasoning prompting, and direct prompting\nwithout reasoning. Using Owens Valley Paiute as a case study, we demonstrate\nthat no-resource translation demands fundamentally different approaches from\nlow-resource scenarios, as traditional approaches to machine translation, such\nas those that work for low-resource languages, fail. Empirical results reveal\nthat, although traditional approaches fail, the in-context learning\ncapabilities of general-purpose large language models enable no-resource\nlanguage translation that outperforms low-resource translation approaches and\nrivals human translations (BLEU 0.45-0.6); specifically, chain-of-reasoning\nprompting outperforms other methods for larger corpora, while direct prompting\nexhibits advantages in smaller datasets. As these approaches are\nlanguage-agnostic, they have potential to be generalized to translation tasks\nfrom a wide variety of no-resource languages without expert input. These\nfindings establish no-resource translation as a distinct paradigm requiring\ninnovative solutions, providing practical and theoretical insights for language\npreservation.", "paper_summary_zh": "<paragraph>沒有資源的語言（即數位呈現極少或沒有的語言）對機器翻譯 (MT) 構成獨特的挑戰。與依賴有限但存在的語料庫的低資源語言不同，沒有資源的語言通常只有不到 100 個可供訓練的句子。這項工作透過三個不同的工作流程探討沒有資源的翻譯問題：微調翻譯特定模型、使用推理鏈提示的大型語言模型 (LLM) 進行情境學習，以及沒有推理的直接提示。我們以歐文斯谷派尤特語為案例研究，證明沒有資源的翻譯需要與低資源場景截然不同的方法，因為傳統的機器翻譯方法（例如適用於低資源語言的方法）會失敗。實證結果顯示，儘管傳統方法會失敗，但通用大型語言模型的情境學習能力讓沒有資源的語言翻譯能夠超越低資源翻譯方法，並與人工翻譯相媲美（BLEU 0.45-0.6）；特別是，推理鏈提示在較大的語料庫中優於其他方法，而直接提示在較小的資料集中展現優勢。由於這些方法與語言無關，因此它們有可能推廣到各種沒有資源的語言的翻譯任務，而無需專家輸入。這些發現將沒有資源的翻譯確立為一個需要創新解決方案的不同範例，為語言保存提供實用和理論見解。</paragraph>", "author": "Madhavendra Thakur et.al.", "authors": "Madhavendra Thakur", "id": "2412.20584v1", "paper_url": "http://arxiv.org/abs/2412.20584v1", "repo": "null"}}