{"2412.07183": {"publish_time": "2024-12-10", "title": "Exploring What Why and How: A Multifaceted Benchmark for Causation Understanding of Video Anomaly", "paper_summary": "Recent advancements in video anomaly understanding (VAU) have opened the door\nto groundbreaking applications in various fields, such as traffic monitoring\nand industrial automation. While the current benchmarks in VAU predominantly\nemphasize the detection and localization of anomalies. Here, we endeavor to\ndelve deeper into the practical aspects of VAU by addressing the essential\nquestions: \"what anomaly occurred?\", \"why did it happen?\", and \"how severe is\nthis abnormal event?\". In pursuit of these answers, we introduce a\ncomprehensive benchmark for Exploring the Causation of Video Anomalies (ECVA).\nOur benchmark is meticulously designed, with each video accompanied by detailed\nhuman annotations. Specifically, each instance of our ECVA involves three sets\nof human annotations to indicate \"what\", \"why\" and \"how\" of an anomaly,\nincluding 1) anomaly type, start and end times, and event descriptions, 2)\nnatural language explanations for the cause of an anomaly, and 3) free text\nreflecting the effect of the abnormality. Building upon this foundation, we\npropose a novel prompt-based methodology that serves as a baseline for tackling\nthe intricate challenges posed by ECVA. We utilize \"hard prompt\" to guide the\nmodel to focus on the critical parts related to video anomaly segments, and\n\"soft prompt\" to establish temporal and spatial relationships within these\nanomaly segments. Furthermore, we propose AnomEval, a specialized evaluation\nmetric crafted to align closely with human judgment criteria for ECVA. This\nmetric leverages the unique features of the ECVA dataset to provide a more\ncomprehensive and reliable assessment of various video large language models.\nWe demonstrate the efficacy of our approach through rigorous experimental\nanalysis and delineate possible avenues for further investigation into the\ncomprehension of video anomaly causation.", "paper_summary_zh": "<paragraph>影片異常理解 (VAU) 的最新進展為各種領域開創了突破性的應用，例如交通監控和工業自動化。儘管 VAU 中目前的基準主要強調異常的偵測和定位。在此，我們努力深入探討 VAU 的實際面向，探討以下基本問題：「發生什麼異常？」、「為什麼會發生？」和「這個異常事件有多嚴重？」。為了找出這些答案，我們引進了一個探索影片異常因果關係 (ECVA) 的全面基準。我們的基準經過精心設計，每部影片都附有詳細的人工標註。具體來說，ECVA 的每個實例都包含三組人工標註，用於指出異常的「是什麼」、「為什麼」和「如何」，包括 1) 異常類型、開始和結束時間，以及事件描述，2) 異常原因的自然語言說明，以及 3) 反映異常影響的自由文字。在此基礎上，我們提出了一種新穎的基於提示的方法，作為應對 ECVA 複雜挑戰的基準。我們利用「硬提示」引導模型專注於與影片異常片段相關的重要部分，並利用「軟提示」在這些異常片段中建立時間和空間關係。此外，我們提出了 AnomEval，這是一個專門的評估指標，旨在與人類對 ECVA 的判斷標準緊密結合。此指標利用 ECVA 資料集的獨特特徵，對各種影片大型語言模型提供更全面且可靠的評估。我們透過嚴謹的實驗分析證明了我們方法的有效性，並描述了進一步探討影片異常因果關係理解的可能途徑。</paragraph>", "author": "Hang Du et.al.", "authors": "Hang Du, Guoshun Nan, Jiawen Qian, Wangchenhui Wu, Wendi Deng, Hanqing Mu, Zhenyan Chen, Pengxuan Mao, Xiaofeng Tao, Jun Liu", "id": "2412.07183v1", "paper_url": "http://arxiv.org/abs/2412.07183v1", "repo": "null"}}