{"2408.12055": {"publish_time": "2024-08-22", "title": "Aligning (Medical) LLMs for (Counterfactual) Fairness", "paper_summary": "Large Language Models (LLMs) have emerged as promising solutions for a\nvariety of medical and clinical decision support applications. However, LLMs\nare often subject to different types of biases, which can lead to unfair\ntreatment of individuals, worsening health disparities, and reducing trust in\nAI-augmented medical tools. Aiming to address this important issue, in this\nstudy, we present a new model alignment approach for aligning LLMs using a\npreference optimization method within a knowledge distillation framework. Prior\nto presenting our proposed method, we first use an evaluation framework to\nconduct a comprehensive (largest to our knowledge) empirical evaluation to\nreveal the type and nature of existing biases in LLMs used for medical\napplications. We then offer a bias mitigation technique to reduce the unfair\npatterns in LLM outputs across different subgroups identified by the protected\nattributes. We show that our mitigation method is effective in significantly\nreducing observed biased patterns. Our code is publicly available at\n\\url{https://github.com/healthylaife/FairAlignmentLLM}.", "paper_summary_zh": "大型語言模型 (LLM) 已成為各種醫療和臨床決策支援應用程式中極具前景的解決方案。然而，LLM 通常會受到不同類型的偏見影響，這可能會導致對個人不公平的待遇、加劇健康差距，並降低對 AI 增強醫療工具的信任。為了解決這個重要問題，我們在這項研究中提出了一種新的模型對齊方法，使用知識提煉架構中的偏好最佳化方法來對齊 LLM。在提出我們建議的方法之前，我們首先使用評估架構進行全面（據我們所知最大規模）的實證評估，以揭示用於醫療應用程式的 LLM 中現有偏見的類型和性質。然後，我們提供一種偏見緩解技術，以減少受保護屬性識別的不同子群組中 LLM 輸出的不公平模式。我們表明，我們的緩解方法可以有效顯著減少觀察到的偏見模式。我們的程式碼可在 \\url{https://github.com/healthylaife/FairAlignmentLLM} 公開取得。", "author": "Raphael Poulain et.al.", "authors": "Raphael Poulain, Hamed Fayyaz, Rahmatollah Beheshti", "id": "2408.12055v1", "paper_url": "http://arxiv.org/abs/2408.12055v1", "repo": "https://github.com/healthylaife/fairalignmentllm"}}