{"2412.06181": {"publish_time": "2024-12-09", "title": "Enhancing Adversarial Resistance in LLMs with Recursion", "paper_summary": "The increasing integration of Large Language Models (LLMs) into society\nnecessitates robust defenses against vulnerabilities from jailbreaking and\nadversarial prompts. This project proposes a recursive framework for enhancing\nthe resistance of LLMs to manipulation through the use of prompt simplification\ntechniques. By increasing the transparency of complex and confusing adversarial\nprompts, the proposed method enables more reliable detection and prevention of\nmalicious inputs. Our findings attempt to address a critical problem in AI\nsafety and security, providing a foundation for the development of systems able\nto distinguish harmless inputs from prompts containing malicious intent. As\nLLMs continue to be used in diverse applications, the importance of such\nsafeguards will only grow.", "paper_summary_zh": "大型語言模型 (LLM) 與社會的整合日益增加，因此需要健全的防禦措施來應對越獄和對抗性提示所帶來的漏洞。此專案提出一個遞迴架構，透過使用提示簡化技術來增強 LLM 對操縱的抵抗力。透過增加複雜且令人困惑的對抗性提示的透明度，所提出的方法能夠更可靠地偵測和預防惡意輸入。我們的研究結果試圖解決人工智慧安全性和安全性中的關鍵問題，為開發能夠區分無害輸入和包含惡意意圖的提示的系統奠定基礎。隨著 LLM 持續用於各種應用程式，此類防護措施的重要性只會與日俱增。", "author": "Bryan Li et.al.", "authors": "Bryan Li, Sounak Bagchi, Zizhan Wang", "id": "2412.06181v1", "paper_url": "http://arxiv.org/abs/2412.06181v1", "repo": "null"}}