{"2410.13852": {"publish_time": "2024-10-17", "title": "Retrospective Learning from Interactions", "paper_summary": "Multi-turn interactions between large language models (LLMs) and users\nnaturally include implicit feedback signals. If an LLM responds in an\nunexpected way to an instruction, the user is likely to signal it by rephrasing\nthe request, expressing frustration, or pivoting to an alternative task. Such\nsignals are task-independent and occupy a relatively constrained subspace of\nlanguage, allowing the LLM to identify them even if it fails on the actual\ntask. This creates an avenue for continually learning from interactions without\nadditional annotations. We introduce ReSpect, a method to learn from such\nsignals in past interactions via retrospection. We deploy ReSpect in a new\nmultimodal interaction scenario, where humans instruct an LLM to solve an\nabstract reasoning task with a combinatorial solution space. Through thousands\nof interactions with humans, we show how ReSpect gradually improves task\ncompletion rate from 31% to 82%, all without any external annotation.", "paper_summary_zh": "大型語言模型 (LLM) 和使用者之間的多輪互動\n自然會包含隱含的回饋訊號。如果 LLM 對指令的回應出乎意料，使用者可能會透過重新表述請求、表達沮喪或轉向替代任務來發出訊號。此類訊號與任務無關，且佔據語言中相對受限的子空間，即使 LLM 在實際任務中失敗，也能識別這些訊號。這為持續從互動中學習創造了一條途徑，而無需額外的註解。我們引入了 ReSpect，這是一種透過回顧從過去互動中學習此類訊號的方法。我們在新的多模態互動場景中部署了 ReSpect，人類在其中指示 LLM 解決具有組合解決空間的抽象推理任務。透過與人類進行數千次互動，我們展示了 ReSpect 如何逐漸將任務完成率從 31% 提高到 82%，而這一切都不需要任何外部註解。", "author": "Zizhao Chen et.al.", "authors": "Zizhao Chen, Mustafa Omer Gul, Yiwei Chen, Gloria Geng, Anne Wu, Yoav Artzi", "id": "2410.13852v1", "paper_url": "http://arxiv.org/abs/2410.13852v1", "repo": "null"}}