{"2410.07708": {"publish_time": "2024-10-10", "title": "Learning Tree Pattern Transformations", "paper_summary": "Explaining why and how a tree $t$ structurally differs from another tree\n$t^*$ is a question that is encountered throughout computer science, including\nin understanding tree-structured data such as XML or JSON data. In this\narticle, we explore how to learn explanations for structural differences\nbetween pairs of trees from sample data: suppose we are given a set $\\{(t_1,\nt_1^*),\\dots, (t_n, t_n^*)\\}$ of pairs of labelled, ordered trees; is there a\nsmall set of rules that explains the structural differences between all pairs\n$(t_i, t_i^*)$? This raises two research questions: (i) what is a good notion\nof \"rule\" in this context?; and (ii) how can sets of rules explaining a data\nset be learnt algorithmically?\n  We explore these questions from the perspective of database theory by (1)\nintroducing a pattern-based specification language for tree transformations;\n(2) exploring the computational complexity of variants of the above algorithmic\nproblem, e.g. showing NP-hardness for very restricted variants; and (3)\ndiscussing how to solve the problem for data from CS education research using\nSAT solvers.", "paper_summary_zh": "<paragraph>解釋樹 $t$ 在結構上與另一棵樹 $t^*$ 有何不同，以及原因為何，是電腦科學領域中經常遇到的問題，包括在理解樹狀結構資料（例如 XML 或 JSON 資料）時。在本文中，我們探討如何從範例資料中學習樹對之間結構差異的解釋：假設我們給定一組標籤、有序樹對 $\\{(t_1, t_1^*),\\dots, (t_n, t_n^*)\\}$；是否存在一組小規則，可以解釋所有對 $(t_i, t_i^*)$ 之間的結構差異？這提出了兩個研究問題：(i) 在這個脈絡中，「規則」的良好概念是什麼？(ii) 如何演算法學習解釋資料集的規則集？\n我們從資料庫理論的角度探討這些問題，方法是：(1) 介紹樹狀轉換的基於模式的規範語言；(2) 探討上述演算法問題變體的計算複雜度，例如顯示非常受限變體的 NP 難度；以及 (3) 討論如何使用 SAT 求解器解決來自電腦科學教育研究的資料問題。</paragraph>", "author": "Daniel Neider et.al.", "authors": "Daniel Neider, Leif Sabellek, Johannes Schmidt, Fabian Vehlken, Thomas Zeume", "id": "2410.07708v1", "paper_url": "http://arxiv.org/abs/2410.07708v1", "repo": "null"}}