{"2412.04857": {"publish_time": "2024-12-06", "title": "Neuro-Symbolic Data Generation for Math Reasoning", "paper_summary": "A critical question about Large Language Models (LLMs) is whether their\napparent deficiency in mathematical reasoning is inherent, or merely a result\nof insufficient exposure to high-quality mathematical data. To explore this, we\ndeveloped an automated method for generating high-quality, supervised\nmathematical datasets. The method carefully mutates existing math problems,\nensuring both diversity and validity of the newly generated problems. This is\nachieved by a neuro-symbolic data generation framework combining the intuitive\ninformalization strengths of LLMs, and the precise symbolic reasoning of math\nsolvers along with projected Markov chain Monte Carlo sampling in the\nhighly-irregular symbolic space. Empirical experiments demonstrate the high\nquality of data generated by the proposed method, and that the LLMs,\nspecifically LLaMA-2 and Mistral, when realigned with the generated data,\nsurpass their state-of-the-art counterparts.", "paper_summary_zh": "大型語言模型 (LLM) 的一個關鍵問題是它們在數學推理上的明顯缺陷是固有的，還是僅僅是接觸高品質數學資料不足的結果。為了探討這一點，我們開發了一種自動化方法來生成高品質、有監督的數學資料集。此方法仔細地變異現有的數學問題，確保新生成問題的多樣性和有效性。這是透過神經符號資料生成架構來實現的，結合了 LLM 直觀的非正規化優勢，以及數學求解器的精確符號推理，以及在高度不規則的符號空間中預測的馬可夫鏈蒙地卡羅抽樣。實證實驗證明了所提出的方法生成資料的高品質，以及 LLM，特別是 LLaMA-2 和 Mistral，在與生成資料重新對齊後，超越了它們最先進的對應模型。", "author": "Zenan Li et.al.", "authors": "Zenan Li, Zhi Zhou, Yuan Yao, Yu-Feng Li, Chun Cao, Fan Yang, Xian Zhang, Xiaoxing Ma", "id": "2412.04857v1", "paper_url": "http://arxiv.org/abs/2412.04857v1", "repo": "null"}}