{"2410.06932": {"publish_time": "2024-10-09", "title": "Reproducing and Extending Experiments in Behavioral Strategy with Large Language Models", "paper_summary": "In this study, we propose LLM agents as a novel approach in behavioral\nstrategy research, complementing simulations and laboratory experiments to\nadvance our understanding of cognitive processes in decision-making.\nSpecifically, we reproduce a human laboratory experiment in behavioral strategy\nusing large language model (LLM) generated agents and investigate how LLM\nagents compare to observed human behavior. Our results show that LLM agents\neffectively reproduce search behavior and decision-making comparable to humans.\nExtending our experiment, we analyze LLM agents' simulated \"thoughts,\"\ndiscovering that more forward-looking thoughts correlate with favoring\nexploitation over exploration to maximize wealth. We show how this new approach\ncan be leveraged in behavioral strategy research and address limitations.", "paper_summary_zh": "本研究中，我們提出 LLM 代理作為行為策略研究的新方法，以補充模擬和實驗室實驗，以增進我們對決策過程中認知過程的了解。具體來說，我們使用大型語言模型 (LLM) 生成的代理重新製作行為策略的人類實驗室實驗，並探討 LLM 代理與觀察到的行為有何不同。我們的結果顯示，LLM 代理有效地重現了與人類相當的搜尋行為和決策。擴展我們的實驗，我們分析了 LLM 代理模擬的「思考」，發現更具前瞻性的思考與偏好利用而非探索以最大化財富有關。我們展示了這種新方法如何運用於行為策略研究並解決限制。", "author": "Daniel Albert et.al.", "authors": "Daniel Albert, Stephan Billinger", "id": "2410.06932v1", "paper_url": "http://arxiv.org/abs/2410.06932v1", "repo": "null"}}