{"2406.11945": {"publish_time": "2024-06-17", "title": "GAugLLM: Improving Graph Contrastive Learning for Text-Attributed Graphs with Large Language Models", "paper_summary": "This work studies self-supervised graph learning for text-attributed graphs\n(TAGs) where nodes are represented by textual attributes. Unlike traditional\ngraph contrastive methods that perturb the numerical feature space and alter\nthe graph's topological structure, we aim to improve view generation through\nlanguage supervision. This is driven by the prevalence of textual attributes in\nreal applications, which complement graph structures with rich semantic\ninformation. However, this presents challenges because of two major reasons.\nFirst, text attributes often vary in length and quality, making it difficulty\nto perturb raw text descriptions without altering their original semantic\nmeanings. Second, although text attributes complement graph structures, they\nare not inherently well-aligned. To bridge the gap, we introduce GAugLLM, a\nnovel framework for augmenting TAGs. It leverages advanced large language\nmodels like Mistral to enhance self-supervised graph learning. Specifically, we\nintroduce a mixture-of-prompt-expert technique to generate augmented node\nfeatures. This approach adaptively maps multiple prompt experts, each of which\nmodifies raw text attributes using prompt engineering, into numerical feature\nspace. Additionally, we devise a collaborative edge modifier to leverage\nstructural and textual commonalities, enhancing edge augmentation by examining\nor building connections between nodes. Empirical results across five benchmark\ndatasets spanning various domains underscore our framework's ability to enhance\nthe performance of leading contrastive methods as a plug-in tool. Notably, we\nobserve that the augmented features and graph structure can also enhance the\nperformance of standard generative methods, as well as popular graph neural\nnetworks. The open-sourced implementation of our GAugLLM is available at\nGithub.", "paper_summary_zh": "<paragraph>本研究探討了文字屬性圖 (TAG) 的自我監督圖學習，其中節點由文字屬性表示。與擾動數值特徵空間和改變圖形拓撲結構的傳統圖形對比方法不同，我們旨在透過語言監督來改善視圖生成。這是因為文字屬性在實際應用中很普遍，它以豐富的語義資訊補充圖形結構。然而，這會帶來挑戰，原因有兩個。首先，文字屬性通常長度和品質不同，這使得在不改變原始語義意義的情況下擾動原始文字描述變得困難。其次，儘管文字屬性補充了圖形結構，但它們並非天生就很好地對齊。為了彌合差距，我們引入了 GAugLLM，這是一個用於擴充 TAG 的新框架。它利用了 Mistral 等先進的大型語言模型來增強自我監督圖形學習。具體來說，我們引入了一種混合提示專家的技術來生成擴充的節點特徵。這種方法自適應地將多個提示專家映射到數值特徵空間，每個提示專家都使用提示工程修改原始文字屬性。此外，我們設計了一個協作邊緣修改器來利用結構和文字的共性，通過檢查或建立節點之間的連接來增強邊緣擴充。跨越各種領域的五個基準資料集的經驗結果強調了我們的框架作為外掛工具增強領先對比方法效能的能力。值得注意的是，我們觀察到擴充的特徵和圖形結構也可以增強標準生成方法以及流行的圖形神經網路的效能。我們的 GAugLLM 的開源實現可以在 Github 上找到。</paragraph>", "author": "Yi Fang et.al.", "authors": "Yi Fang, Dongzhe Fan, Daochen Zha, Qiaoyu Tan", "id": "2406.11945v1", "paper_url": "http://arxiv.org/abs/2406.11945v1", "repo": "null"}}