{"2408.15549": {"publish_time": "2024-08-28", "title": "WildFeedback: Aligning LLMs With In-situ User Interactions And Feedback", "paper_summary": "As large language models (LLMs) continue to advance, aligning these models\nwith human preferences has emerged as a critical challenge. Traditional\nalignment methods, relying on human or LLM annotated datasets, are limited by\ntheir resource-intensive nature, inherent subjectivity, and the risk of\nfeedback loops that amplify model biases. To overcome these limitations, we\nintroduce WildFeedback, a novel framework that leverages real-time, in-situ\nuser interactions to create preference datasets that more accurately reflect\nauthentic human values. WildFeedback operates through a three-step process:\nfeedback signal identification, preference data construction, and user-guided\nevaluation. We applied this framework to a large corpus of user-LLM\nconversations, resulting in a rich preference dataset that reflects genuine\nuser preferences. This dataset captures the nuances of user preferences by\nidentifying and classifying feedback signals within natural conversations,\nthereby enabling the construction of more representative and context-sensitive\nalignment data. Our extensive experiments demonstrate that LLMs fine-tuned on\nWildFeedback exhibit significantly improved alignment with user preferences, as\nevidenced by both traditional benchmarks and our proposed user-guided\nevaluation. By incorporating real-time feedback from actual users, WildFeedback\naddresses the scalability, subjectivity, and bias challenges that plague\nexisting approaches, marking a significant step toward developing LLMs that are\nmore responsive to the diverse and evolving needs of their users. In summary,\nWildFeedback offers a robust, scalable solution for aligning LLMs with true\nhuman values, setting a new standard for the development and evaluation of\nuser-centric language models.", "paper_summary_zh": "隨著大型語言模型 (LLM) 持續進步，將這些模型與人類偏好相符已成為一項關鍵挑戰。傳統比對方法仰賴人工或 LLM 標註資料集，其限制在於耗費大量資源、固有主觀性，以及放大模型偏誤的回饋迴路風險。為了解決這些限制，我們引進 WildFeedback，這是一個創新的架構，它利用即時、原地的使用者互動來建立偏好資料集，更準確地反映真實的人類價值觀。WildFeedback 透過一個三步驟流程運作：回饋訊號識別、偏好資料建構，以及使用者引導評估。我們將這個架構套用於大量使用者-LLM 對話語料庫，產生一個豐富的偏好資料集，反映真實的使用者偏好。這個資料集透過在自然對話中識別和分類回饋訊號，捕捉使用者偏好的細微差別，進而建構更具代表性且對脈絡敏感的比對資料。我們廣泛的實驗證明，使用 WildFeedback 微調的 LLM 與使用者偏好有顯著提升的比對，傳統基準和我們提出的使用者引導評估都證實了這一點。透過納入實際使用者的即時回饋，WildFeedback 解決了現有方法中普遍存在的可擴充性、主觀性和偏誤挑戰，標誌著朝開發對使用者多元且不斷變化的需求更具回應性的 LLM 邁出了一大步。總之，WildFeedback 提供了一個強健、可擴充的解決方案，將 LLM 與真實的人類價值觀相符，為以使用者為中心的語言模型的開發和評估樹立了新標準。", "author": "Taiwei Shi et.al.", "authors": "Taiwei Shi, Zhuoer Wang, Longqi Yang, Ying-Chun Lin, Zexue He, Mengting Wan, Pei Zhou, Sujay Jauhar, Xiaofeng Xu, Xia Song, Jennifer Neville", "id": "2408.15549v1", "paper_url": "http://arxiv.org/abs/2408.15549v1", "repo": "null"}}