{"2501.11428": {"publish_time": "2025-01-20", "title": "Enhancing Coronary Artery Calcium Scoring via Multi-Organ Segmentation on Non-Contrast Cardiac Computed Tomography", "paper_summary": "Despite coronary artery calcium scoring being considered a largely solved\nproblem within the realm of medical artificial intelligence, this paper argues\nthat significant improvements can still be made. By shifting the focus from\npathology detection to a deeper understanding of anatomy, the novel algorithm\nproposed in the paper both achieves high accuracy in coronary artery calcium\nscoring and offers enhanced interpretability of the results. This approach not\nonly aids in the precise quantification of calcifications in coronary arteries,\nbut also provides valuable insights into the underlying anatomical structures.\nThrough this anatomically-informed methodology, the paper shows how a nuanced\nunderstanding of the heart's anatomy can lead to more accurate and\ninterpretable results in the field of cardiovascular health. We demonstrate the\nsuperior accuracy of the proposed method by evaluating it on an open-source\nmulti-vendor dataset, where we obtain results at the inter-observer level,\nsurpassing the current state of the art. Finally, the qualitative analyses show\nthe practical value of the algorithm in such tasks as labeling coronary artery\ncalcifications, identifying aortic calcifications, and filtering out false\npositive detections due to noise.", "paper_summary_zh": "儘管冠狀動脈鈣化評分在醫學人工智慧領域被認為是一個已解決的問題，但本文論證仍有顯著進步的空間。透過將焦點從病理檢測轉移到對解剖結構的更深入理解，本文提出的新演算法在冠狀動脈鈣化評分中獲得高準確度，並提供了增強的結果可解釋性。這種方法不僅有助於精確量化冠狀動脈的鈣化，還提供了對底層解剖結構的寶貴見解。透過這種解剖學方法，本文展示了對心臟解剖結構的細緻理解如何能導致心血管健康領域更準確且可解釋的結果。我們透過在開放原始碼的多廠商資料集上評估所提出的方法，證明了其優越的準確度，我們在觀察者間層級獲得的結果超越了目前的技術水準。最後，定性分析顯示了該演算法在標記冠狀動脈鈣化、識別主動脈鈣化以及過濾掉因雜訊而產生的假陽性偵測等任務中的實用價值。", "author": "Jakub Nalepa et.al.", "authors": "Jakub Nalepa, Tomasz Bartczak, Mariusz Bujny, Jarosław Gośliński, Katarzyna Jesionek, Wojciech Malara, Filip Malawski, Karol Miszalski-Jamka, Patrycja Rewa, Marcin Kostur", "id": "2501.11428v1", "paper_url": "http://arxiv.org/abs/2501.11428v1", "repo": "null"}}