{"2408.06150": {"publish_time": "2024-08-12", "title": "LipidBERT: A Lipid Language Model Pre-trained on METiS de novo Lipid Library", "paper_summary": "In this study, we generate and maintain a database of 10 million virtual\nlipids through METiS's in-house de novo lipid generation algorithms and lipid\nvirtual screening techniques. These virtual lipids serve as a corpus for\npre-training, lipid representation learning, and downstream task knowledge\ntransfer, culminating in state-of-the-art LNP property prediction performance.\nWe propose LipidBERT, a BERT-like model pre-trained with the Masked Language\nModel (MLM) and various secondary tasks. Additionally, we compare the\nperformance of embeddings generated by LipidBERT and PhatGPT, our GPT-like\nlipid generation model, on downstream tasks. The proposed bilingual LipidBERT\nmodel operates in two languages: the language of ionizable lipid pre-training,\nusing in-house dry-lab lipid structures, and the language of LNP fine-tuning,\nutilizing in-house LNP wet-lab data. This dual capability positions LipidBERT\nas a key AI-based filter for future screening tasks, including new versions of\nMETiS de novo lipid libraries and, more importantly, candidates for in vivo\ntesting for orgran-targeting LNPs. To the best of our knowledge, this is the\nfirst successful demonstration of the capability of a pre-trained language\nmodel on virtual lipids and its effectiveness in downstream tasks using web-lab\ndata. This work showcases the clever utilization of METiS's in-house de novo\nlipid library as well as the power of dry-wet lab integration.", "paper_summary_zh": "在這項研究中，我們透過 METiS 內部的新生脂質生成演算法和脂質虛擬篩選技術，產生並維護一個包含 1000 萬種虛擬脂質的資料庫。這些虛擬脂質作為預先訓練、脂質表徵學習和下游任務知識轉移的語料庫，最終實現了最先進的 LNP 屬性預測效能。我們提出了 LipidBERT，這是一個使用遮罩語言模型 (MLM) 和各種次要任務預先訓練的類 BERT 模型。此外，我們比較了 LipidBERT 和 PhatGPT（我們的類 GPT 脂質生成模型）產生的嵌入在下游任務上的效能。所提出的雙語 LipidBERT 模型使用兩種語言：可電離脂質預先訓練的語言（使用內部乾式實驗室脂質結構）和 LNP 微調的語言（使用內部 LNP 濕式實驗室資料）。這種雙重能力將 LipidBERT 定位為未來篩選任務（包括 METiS 新生脂質庫的新版本，更重要的是，針對器官靶向 LNP 的體內測試候選藥物）的關鍵 AI 篩選器。據我們所知，這是預先訓練語言模型在虛擬脂質上的能力首次成功展示，以及它在使用網路實驗室資料執行下游任務的有效性。這項工作展示了巧妙利用 METiS 內部的新生脂質庫，以及乾濕實驗室整合的力量。", "author": "Tianhao Yu et.al.", "authors": "Tianhao Yu, Cai Yao, Zhuorui Sun, Feng Shi, Lin Zhang, Kangjie Lyu, Xuan Bai, Andong Liu, Xicheng Zhang, Jiali Zou, Wenshou Wang, Chris Lai, Kai Wang", "id": "2408.06150v1", "paper_url": "http://arxiv.org/abs/2408.06150v1", "repo": "null"}}