{"2409.19839": {"publish_time": "2024-09-30", "title": "ForecastBench: A Dynamic Benchmark of AI Forecasting Capabilities", "paper_summary": "Forecasts of future events are essential inputs into informed\ndecision-making. Machine learning (ML) systems have the potential to deliver\nforecasts at scale, but there is no framework for evaluating the accuracy of ML\nsystems on a standardized set of forecasting questions. To address this gap, we\nintroduce ForecastBench: a dynamic benchmark that evaluates the accuracy of ML\nsystems on an automatically generated and regularly updated set of 1,000\nforecasting questions. To avoid any possibility of data leakage, ForecastBench\nis comprised solely of questions about future events that have no known answer\nat the time of submission. We quantify the ability of current ML systems by\ncollecting forecasts from expert (human) forecasters, the general public, and\nLLMs on a random subset of questions from the benchmark (N = 200). While LLMs\nhave achieved super-human performance on many benchmarks, they perform less\nwell here: expert forecasters outperform the top-performing LLM (p-values <=\n0.01). We display system and human scores in a public leaderboard at\nwww.forecastbench.org.", "paper_summary_zh": "未來事件預測是明智決策制定中的重要輸入。機器學習 (ML) 系統有潛力大規模提供預測，但沒有框架可以在標準化的預測問題集上評估 ML 系統的準確性。為了解決這個差距，我們引入了 ForecastBench：一個動態基準，它在自動生成並定期更新的 1,000 個預測問題集上評估 ML 系統的準確性。為了避免任何資料外洩的可能性，ForecastBench 僅包含關於未來事件的問題，這些問題在提交時沒有已知的答案。我們透過從專家（人類）預測員、一般大眾和 LLM 中收集預測，在基準中的隨機問題子集中（N = 200）量化當前 ML 系統的能力。雖然 LLM 在許多基準上都達到了超人類的表現，但它們在此表現不佳：專家預測員優於表現最佳的 LLM（p 值 <= 0.01）。我們在 www.forecastbench.org 上的公開排行榜中顯示系統和人類分數。", "author": "Ezra Karger et.al.", "authors": "Ezra Karger, Houtan Bastani, Chen Yueh-Han, Zachary Jacobs, Danny Halawi, Fred Zhang, Philip E. Tetlock", "id": "2409.19839v1", "paper_url": "http://arxiv.org/abs/2409.19839v1", "repo": "null"}}