{"2502.18864": {"publish_time": "2025-02-26", "title": "Towards an AI co-scientist", "paper_summary": "Scientific discovery relies on scientists generating novel hypotheses that\nundergo rigorous experimental validation. To augment this process, we introduce\nan AI co-scientist, a multi-agent system built on Gemini 2.0. The AI\nco-scientist is intended to help uncover new, original knowledge and to\nformulate demonstrably novel research hypotheses and proposals, building upon\nprior evidence and aligned to scientist-provided research objectives and\nguidance. The system's design incorporates a generate, debate, and evolve\napproach to hypothesis generation, inspired by the scientific method and\naccelerated by scaling test-time compute. Key contributions include: (1) a\nmulti-agent architecture with an asynchronous task execution framework for\nflexible compute scaling; (2) a tournament evolution process for self-improving\nhypotheses generation. Automated evaluations show continued benefits of\ntest-time compute, improving hypothesis quality. While general purpose, we\nfocus development and validation in three biomedical areas: drug repurposing,\nnovel target discovery, and explaining mechanisms of bacterial evolution and\nanti-microbial resistance. For drug repurposing, the system proposes candidates\nwith promising validation findings, including candidates for acute myeloid\nleukemia that show tumor inhibition in vitro at clinically applicable\nconcentrations. For novel target discovery, the AI co-scientist proposed new\nepigenetic targets for liver fibrosis, validated by anti-fibrotic activity and\nliver cell regeneration in human hepatic organoids. Finally, the AI\nco-scientist recapitulated unpublished experimental results via a parallel in\nsilico discovery of a novel gene transfer mechanism in bacterial evolution.\nThese results, detailed in separate, co-timed reports, demonstrate the\npotential to augment biomedical and scientific discovery and usher an era of AI\nempowered scientists.", "paper_summary_zh": "<paragraph>科學發現依賴於科學家們提出新穎的假說，並經過嚴格的實驗驗證。為了增強這一過程，我們引入了一位 AI 科學家，這是一個基於 Gemini 2.0 構建的多代理系統。AI 科學家的目的是幫助發現新的、原創的知識，並根據先前的證據，並與科學家提供的研究目標和指導方針相一致，制定可證明的、新穎的研究假說和提案。該系統的設計採用了「生成、辯論和進化」的方法來生成假說，其靈感來自科學方法，並通過擴展測試時間計算來加速。主要貢獻包括：(1) 具有異步任務執行框架的多代理架構，以實現靈活的計算擴展；(2) 用於自我改進假說生成的錦標賽進化過程。自動評估顯示了測試時間計算的持續優勢，提高了假說的質量。雖然用途廣泛，但我們將開發和驗證的重點放在三個生物醫學領域：藥物再利用、新靶點發現以及解釋細菌進化和抗藥性的機制。對於藥物再利用，該系統提出了具有良好驗證結果的候選藥物，包括用於急性骨髓性白血病的候選藥物，這些藥物在臨床適用濃度下在體外顯示出腫瘤抑制作用。對於新靶點發現，AI 科學家提出了新的肝纖維化表觀遺傳靶點，並通過抗纖維化活性和人類肝臟類器官中的肝細胞再生進行了驗證。最後，AI 科學家通過在計算機模擬中平行發現細菌進化中的一種新的基因轉移機制，重現了未發表的實驗結果。這些結果在單獨的、同時發布的報告中有詳細說明，證明了增強生物醫學和科學發現的潛力，並開啟了 AI 賦能科學家的時代。</paragraph>\n", "author": "Juraj Gottweis et.al.", "authors": "Juraj Gottweis, Wei-Hung Weng, Alexander Daryin, Tao Tu, Anil Palepu, Petar Sirkovic, Artiom Myaskovsky, Felix Weissenberger, Keran Rong, Ryutaro Tanno, Khaled Saab, Dan Popovici, Jacob Blum, Fan Zhang, Katherine Chou, Avinatan Hassidim, Burak Gokturk, Amin Vahdat, Pushmeet Kohli, Yossi Matias, Andrew Carroll, Kavita Kulkarni, Nenad Tomasev, Yuan Guan, Vikram Dhillon, Eeshit Dhaval Vaishnav, Byron Lee, Tiago R D Costa, José R Penadés, Gary Peltz, Yunhan Xu, Annalisa Pawlosky, Alan Karthikesalingam, Vivek Natarajan", "id": "2502.18864v1", "paper_url": "http://arxiv.org/abs/2502.18864v1", "repo": "null"}}