{"2410.17555": {"publish_time": "2024-10-23", "title": "FairDgcl: Fairness-aware Recommendation with Dynamic Graph Contrastive Learning", "paper_summary": "As trustworthy AI continues to advance, the fairness issue in recommendations\nhas received increasing attention. A recommender system is considered unfair\nwhen it produces unequal outcomes for different user groups based on\nuser-sensitive attributes (e.g., age, gender). Some researchers have proposed\ndata augmentation-based methods aiming at alleviating user-level unfairness by\naltering the skewed distribution of training data among various user groups.\nDespite yielding promising results, they often rely on fairness-related\nassumptions that may not align with reality, potentially reducing the data\nquality and negatively affecting model effectiveness. To tackle this issue, in\nthis paper, we study how to implement high-quality data augmentation to improve\nrecommendation fairness. Specifically, we propose FairDgcl, a dynamic graph\nadversarial contrastive learning framework aiming at improving fairness in\nrecommender system. First, FairDgcl develops an adversarial contrastive network\nwith a view generator and a view discriminator to learn generating fair\naugmentation strategies in an adversarial style. Then, we propose two dynamic,\nlearnable models to generate contrastive views within contrastive learning\nframework, which automatically fine-tune the augmentation strategies.\nMeanwhile, we theoretically show that FairDgcl can simultaneously generate\nenhanced representations that possess both fairness and accuracy. Lastly,\ncomprehensive experiments conducted on four real-world datasets demonstrate the\neffectiveness of the proposed FairDgcl.", "paper_summary_zh": "隨著值得信賴的人工智慧持續進步，推薦的公平性問題\n越來越受到關注。推薦系統被認為是不公平的\n當它根據\n用戶敏感屬性（例如年齡、性別）為不同的用戶群體產生不平等的結果時。一些研究人員提出\n基於數據增強的方法旨在通過\n改變不同用戶組之間訓練數據的偏態分佈來緩解用戶級別的不公平性。\n儘管產生了有希望的結果，但他們通常依賴於可能與現實不符的與公平性相關的\n假設，可能會降低數據\n質量並對模型有效性產生負面影響。為了解決這個問題，在\n本文中，我們研究如何實施高質量的數據增強以提高\n推薦公平性。具體來說，我們提出了 FairDgcl，一個動態圖形\n對抗對比學習框架，旨在提高公平性\n推薦系統。首先，FairDgcl 開發了一個對抗對比網絡\n使用視圖生成器和視圖判別器以對抗方式學習生成公平\n增強策略。然後，我們提出了兩個動態的，\n可學習模型在對比學習\n框架內生成對比視圖，這會自動微調增強策略。\n同時，我們在理論上表明 FairDgcl 可以同時生成\n增強表示，既具有公平性又具有準確性。最後，\n在四個真實世界數據集上進行的綜合實驗證明了\n提出的 FairDgcl 的有效性。", "author": "Wei Chen et.al.", "authors": "Wei Chen, Meng Yuan, Zhao Zhang, Ruobing Xie, Fuzhen Zhuang, Deqing Wang, Rui Liu", "id": "2410.17555v1", "paper_url": "http://arxiv.org/abs/2410.17555v1", "repo": "https://github.com/cwei01/fairdgcl"}}