{"2405.10436": {"publish_time": "2024-05-16", "title": "Positional encoding is not the same as context: A study on positional encoding for Sequential recommendation", "paper_summary": "The expansion of streaming media and e-commerce has led to a boom in\nrecommendation systems, including Sequential recommendation systems, which\nconsider the user's previous interactions with items. In recent years, research\nhas focused on architectural improvements such as transformer blocks and\nfeature extraction that can augment model information. Among these features are\ncontext and attributes. Of particular importance is the temporal footprint,\nwhich is often considered part of the context and seen in previous publications\nas interchangeable with positional information. Other publications use\npositional encodings with little attention to them. In this paper, we analyse\npositional encodings, showing that they provide relative information between\nitems that are not inferable from the temporal footprint. Furthermore, we\nevaluate different encodings and how they affect metrics and stability using\nAmazon datasets. We added some new encodings to help with these problems along\nthe way. We found that we can reach new state-of-the-art results by finding the\ncorrect positional encoding, but more importantly, certain encodings stabilise\nthe training.", "paper_summary_zh": "串流媒體和電子商務的擴張導致推薦系統的蓬勃發展，包括順序推薦系統，它會考量使用者先前與商品的互動。近年來，研究專注於架構的改善，例如Transformer區塊和可以擴充模型資訊的特徵萃取。這些特徵包括脈絡和屬性。其中特別重要的是時間足跡，它通常被視為脈絡的一部分，在先前的出版物中被視為與位置資訊可以互換。其他出版物使用位置編碼，但鮮少關注它們。在本文中，我們分析位置編碼，證明它們提供了商品之間的相對資訊，而時間足跡無法推論出這些資訊。此外，我們評估不同的編碼以及它們如何影響指標和穩定性，並使用 Amazon 資料集。在此過程中，我們新增了一些新的編碼來協助解決這些問題。我們發現，透過找出正確的位置編碼，我們可以達到新的最先進結果，但更重要的是，某些編碼可以穩定訓練。", "author": "Alejo Lopez-Avila et.al.", "authors": "Alejo Lopez-Avila, Jinhua Du, Abbas Shimary, Ze Li", "id": "2405.10436v1", "paper_url": "http://arxiv.org/abs/2405.10436v1", "repo": "null"}}