{"2406.13625": {"publish_time": "2024-06-19", "title": "Enhance the Image: Super Resolution using Artificial Intelligence in MRI", "paper_summary": "This chapter provides an overview of deep learning techniques for improving\nthe spatial resolution of MRI, ranging from convolutional neural networks,\ngenerative adversarial networks, to more advanced models including\ntransformers, diffusion models, and implicit neural representations. Our\nexploration extends beyond the methodologies to scrutinize the impact of\nsuper-resolved images on clinical and neuroscientific assessments. We also\ncover various practical topics such as network architectures, image evaluation\nmetrics, network loss functions, and training data specifics, including\ndownsampling methods for simulating low-resolution images and dataset\nselection. Finally, we discuss existing challenges and potential future\ndirections regarding the feasibility and reliability of deep learning-based MRI\nsuper-resolution, with the aim to facilitate its wider adoption to benefit\nvarious clinical and neuroscientific applications.", "paper_summary_zh": "本章概述了用於改善 MRI 空間解析度的深度學習技術，涵蓋了從卷積神經網路、生成對抗網路到更先進的模型，包括Transformer、擴散模型和隱式神經表示。我們的探討不僅限於方法論，還審查了超解析影像對臨床和神經科學評估的影響。我們也涵蓋了各種實務主題，例如網路架構、影像評估指標、網路損失函數和訓練資料規範，包括用於模擬低解析度影像的下採樣方法和資料集選擇。最後，我們討論了基於深度學習的 MRI 超解析技術的可行性和可靠性方面的現有挑戰和潛在未來方向，目的是促進其更廣泛的採用，以造福各種臨床和神經科學應用。", "author": "Ziyu Li et.al.", "authors": "Ziyu Li, Zihan Li, Haoxiang Li, Qiuyun Fan, Karla L. Miller, Wenchuan Wu, Akshay S. Chaudhari, Qiyuan Tian", "id": "2406.13625v1", "paper_url": "http://arxiv.org/abs/2406.13625v1", "repo": "null"}}