{"2407.11409": {"publish_time": "2024-07-16", "title": "Representation Bias in Political Sample Simulations with Large Language Models", "paper_summary": "This study seeks to identify and quantify biases in simulating political\nsamples with Large Language Models, specifically focusing on vote choice and\npublic opinion. Using the GPT-3.5-Turbo model, we leverage data from the\nAmerican National Election Studies, German Longitudinal Election Study, Zuobiao\nDataset, and China Family Panel Studies to simulate voting behaviors and public\nopinions. This methodology enables us to examine three types of representation\nbias: disparities based on the the country's language, demographic groups, and\npolitical regime types. The findings reveal that simulation performance is\ngenerally better for vote choice than for public opinions, more accurate in\nEnglish-speaking countries, more effective in bipartisan systems than in\nmulti-partisan systems, and stronger in democratic settings than in\nauthoritarian regimes. These results contribute to enhancing our understanding\nand developing strategies to mitigate biases in AI applications within the\nfield of computational social science.", "paper_summary_zh": "本研究旨在識別和量化使用大型語言模型模擬政治樣本中的偏差，特別關注投票選擇和民意。使用 GPT-3.5-Turbo 模型，我們利用美國國家選舉研究、德國縱向選舉研究、座標數據集和中國家庭追蹤調查的數據來模擬投票行為和民意。這種方法使我們能夠檢查三種類型的代表性偏差：基於國家語言、人口群體和政治制度類型的差異。研究結果表明，模擬效能通常在投票選擇方面優於民意，在英語國家更準確，在兩黨制系統中比在多黨制系統中更有效，在民主環境中比在威權政權中更強。這些結果有助於加深我們對計算社會科學領域內人工智能應用偏差的理解，並制定策略來減輕偏差。", "author": "Weihong Qi et.al.", "authors": "Weihong Qi, Hanjia Lyu, Jiebo Luo", "id": "2407.11409v1", "paper_url": "http://arxiv.org/abs/2407.11409v1", "repo": "null"}}