{"2406.17615": {"publish_time": "2024-06-25", "title": "Aligning Programming Language and Natural Language: Exploring Design Choices in Multi-Modal Transformer-Based Embedding for Bug Localization", "paper_summary": "Bug localization refers to the identification of source code files which is\nin a programming language and also responsible for the unexpected behavior of\nsoftware using the bug report, which is a natural language. As bug localization\nis labor-intensive, bug localization models are employed to assist software\ndevelopers. Due to the domain difference between source code files and bug\nreports, modern bug-localization systems, based on deep learning models, rely\nheavily on embedding techniques that project bug reports and source code files\ninto a shared vector space. The creation of an embedding involves several\ndesign choices, but the impact of these choices on the quality of embedding and\nthe performance of bug localization models remains unexplained in current\nresearch.\n  To address this gap, our study evaluated 14 distinct embedding models to gain\ninsights into the effects of various design choices. Subsequently, we developed\nbug localization models utilizing these embedding models to assess the\ninfluence of these choices on the performance of the localization models. Our\nfindings indicate that the pre-training strategies significantly affect the\nquality of the embedding. Moreover, we discovered that the familiarity of the\nembedding models with the data has a notable impact on the bug localization\nmodel's performance. Notably, when the training and testing data are collected\nfrom different projects, the performance of the bug localization models\nexhibits substantial fluctuations.", "paper_summary_zh": "錯誤定位是指識別程式碼檔案，這些檔案使用錯誤報告（一種自然語言）以程式語言撰寫，並負責軟體的異常行為。由於錯誤定位需要大量人力，因此採用錯誤定位模型來協助軟體開發人員。由於原始碼檔案和錯誤報告之間的領域差異，基於深度學習模型的現代錯誤定位系統，極度依賴將錯誤報告和原始碼檔案投射到共享向量空間的嵌入技術。建立嵌入涉及多項設計選擇，但這些選擇對嵌入品質和錯誤定位模型效能的影響，在目前的研究所中仍未獲得解釋。\n為了解決這個差距，我們的研究評估了 14 個不同的嵌入模型，以深入了解各種設計選擇的影響。隨後，我們開發了利用這些嵌入模型的錯誤定位模型，以評估這些選擇對定位模型效能的影響。我們的研究結果指出，預訓練策略會顯著影響嵌入品質。此外，我們發現嵌入模型對資料的熟悉度，對錯誤定位模型的效能有顯著影響。值得注意的是，當訓練和測試資料從不同的專案收集時，錯誤定位模型的效能會出現大幅波動。", "author": "Partha Chakraborty et.al.", "authors": "Partha Chakraborty, Venkatraman Arumugam, Meiyappan Nagappan", "id": "2406.17615v1", "paper_url": "http://arxiv.org/abs/2406.17615v1", "repo": "https://zenodo.org/record/10519746"}}