{"2412.14485": {"publish_time": "2024-12-19", "title": "Towards Projected and Incremental Pseudo-Boolean Model Counting", "paper_summary": "Model counting is a fundamental task that involves determining the number of\nsatisfying assignments to a logical formula, typically in conjunctive normal\nform (CNF). While CNF model counting has received extensive attention over\nrecent decades, interest in Pseudo-Boolean (PB) model counting is just emerging\npartly due to the greater flexibility of PB formulas. As such, we observed\nfeature gaps in existing PB counters such as a lack of support for projected\nand incremental settings, which could hinder adoption.\n  In this work, our main contribution is the introduction of the PB model\ncounter PBCount2, the first exact PB model counter with support for projected\nand incremental model counting. Our counter, PBCount2, uses our Least\nOccurrence Weighted Min Degree (LOW-MD) computation ordering heuristic to\nsupport projected model counting and a cache mechanism to enable incremental\nmodel counting. In our evaluations, PBCount2 completed at least 1.40x the\nnumber of benchmarks of competing methods for projected model counting and at\nleast 1.18x of competing methods in incremental model counting.", "paper_summary_zh": "模型計數是一項基本任務，涉及確定滿足邏輯公式的指派數量，通常以合取範式 (CNF) 形式表示。雖然 CNF 模型計數在最近幾十年受到廣泛關注，但對偽布林 (PB) 模型計數的興趣才剛開始浮現，部分原因是 PB 公式具有更大的靈活性。因此，我們觀察到現有 PB 計數器中的功能差距，例如缺乏對投影和遞增設定的支持，這可能會阻礙採用。\n在這項工作中，我們的貢獻在於引入了 PB 模型計數器 PBCount2，這是第一個支援投影和遞增模型計數的精確 PB 模型計數器。我們的計數器 PBCount2 使用我們的最小出現加權最小度數 (LOW-MD) 計算排序啟發法來支援投影模型計數，並使用快取機制來啟用遞增模型計數。在我們的評估中，PBCount2 完成的基準數量至少是投影模型計數競爭方法的 1.40 倍，並且至少是遞增模型計數競爭方法的 1.18 倍。", "author": "Suwei Yang et.al.", "authors": "Suwei Yang, Kuldeep S. Meel", "id": "2412.14485v1", "paper_url": "http://arxiv.org/abs/2412.14485v1", "repo": "null"}}