{"2407.04117": {"publish_time": "2024-07-04", "title": "Predictive Coding Networks and Inference Learning: Tutorial and Survey", "paper_summary": "Recent years have witnessed a growing call for renewed emphasis on\nneuroscience-inspired approaches in artificial intelligence research, under the\nbanner of $\\textit{NeuroAI}$. This is exemplified by recent attention gained by\npredictive coding networks (PCNs) within machine learning (ML). PCNs are based\non the neuroscientific framework of predictive coding (PC), which views the\nbrain as a hierarchical Bayesian inference model that minimizes prediction\nerrors from feedback connections. PCNs trained with inference learning (IL)\nhave potential advantages to traditional feedforward neural networks (FNNs)\ntrained with backpropagation. While historically more computationally\nintensive, recent improvements in IL have shown that it can be more efficient\nthan backpropagation with sufficient parallelization, making PCNs promising\nalternatives for large-scale applications and neuromorphic hardware. Moreover,\nPCNs can be mathematically considered as a superset of traditional FNNs, which\nsubstantially extends the range of possible architectures for both supervised\nand unsupervised learning. In this work, we provide a comprehensive review as\nwell as a formal specification of PCNs, in particular placing them in the\ncontext of modern ML methods, and positioning PC as a versatile and promising\nframework worthy of further study by the ML community.", "paper_summary_zh": "近年来，在人工智能研究中，人们越来越呼吁重新重视受神经科学启发的方法，并将其称为$\\textit{NeuroAI}$。机器学习（ML）中预测编码网络（PCN）最近受到的关注就是一个例子。PCN 基于预测编码（PC）的神经科学框架，该框架将大脑视为一个分层的贝叶斯推理模型，该模型最小化反馈连接的预测误差。使用推理学习（IL）训练的 PCN 具有传统前馈神经网络（FNN）所没有的潜在优势，后者使用反向传播进行训练。虽然在历史上计算量更大，但 IL 的最新改进表明，如果并行化充分，它可以比反向传播更有效，这使得 PCN 成为大规模应用程序和神经形态硬件的有前途的替代方案。此外，PCN 在数学上可以被视为传统 FNN 的超集，这大大扩展了有监督学习和无监督学习的可能架构范围。在这项工作中，我们提供了 PCN 的全面综述以及正式规范，特别是将它们置于现代 ML 方法的背景下，并将 PC 定位为一个通用且有前途的框架，值得 ML 社区进一步研究。", "author": "Björn van Zwol et.al.", "authors": "Björn van Zwol, Ro Jefferson, Egon L. van den Broek", "id": "2407.04117v1", "paper_url": "http://arxiv.org/abs/2407.04117v1", "repo": "null"}}