{"2405.20974": {"publish_time": "2024-05-31", "title": "SaySelf: Teaching LLMs to Express Confidence with Self-Reflective Rationales", "paper_summary": "Large language models (LLMs) often generate inaccurate or fabricated\ninformation and generally fail to indicate their confidence, which limits their\nbroader applications. Previous work elicits confidence from LLMs by direct or\nself-consistency prompting, or constructing specific datasets for supervised\nfinetuning. The prompting-based approaches have inferior performance, and the\ntraining-based approaches are limited to binary or inaccurate group-level\nconfidence estimates. In this work, we present the advanced SaySelf, a training\nframework that teaches LLMs to express more accurate fine-grained confidence\nestimates. In addition, beyond the confidence scores, SaySelf initiates the\nprocess of directing LLMs to produce self-reflective rationales that clearly\nidentify gaps in their parametric knowledge and explain their uncertainty. This\nis achieved by using an LLM to automatically summarize the uncertainties in\nspecific knowledge via natural language. The summarization is based on the\nanalysis of the inconsistency in multiple sampled reasoning chains, and the\nresulting data is utilized for supervised fine-tuning. Moreover, we utilize\nreinforcement learning with a meticulously crafted reward function to calibrate\nthe confidence estimates, motivating LLMs to deliver accurate, high-confidence\npredictions and to penalize overconfidence in erroneous outputs. Experimental\nresults in both in-distribution and out-of-distribution datasets demonstrate\nthe effectiveness of SaySelf in reducing the confidence calibration error and\nmaintaining the task performance. We show that the generated self-reflective\nrationales are reasonable and can further contribute to the calibration. The\ncode is made public at \\url{https://github.com/xu1868/SaySelf}.", "paper_summary_zh": "大型語言模型（LLM）經常產生不準確或虛構的資訊，且通常無法指出其信心，這限制了其廣泛的應用。先前的研究透過直接或自我一致的提示，或建構特定資料集以進行監督式微調，從 LLM 中引出信心。基於提示的方法效能較差，而基於訓練的方法則僅限於二元或不準確的群組層級信心估計。在這項研究中，我們提出了進階的 SaySelf，這是一種訓練架構，用於教導 LLM 表達更準確的細粒度信心估計。此外，除了信心分數之外，SaySelf 還啟動了引導 LLM 產生自我反省的依據的程序，清楚地找出其參數知識中的差距並解釋其不確定性。這透過使用 LLM 以自然語言自動摘要特定知識中的不確定性來實現。摘要基於對多個取樣推理鏈中不一致性的分析，而產生的資料用於監督式微調。此外，我們利用經過精心設計的獎勵函數進行強化學習，以校準信心估計，促使 LLM 提供準確、高信心的預測，並懲罰對錯誤輸出的過度自信。無論是在分佈內還是分佈外資料集中的實驗結果，都證明了 SaySelf 在減少信心校準誤差和維持任務效能方面的有效性。我們證明了產生的自我反省的依據是合理的，並且可以進一步有助於校準。程式碼已公開於\\url{https://github.com/xu1868/SaySelf}。", "author": "Tianyang Xu et.al.", "authors": "Tianyang Xu, Shujin Wu, Shizhe Diao, Xiaoze Liu, Xingyao Wang, Yangyi Chen, Jing Gao", "id": "2405.20974v1", "paper_url": "http://arxiv.org/abs/2405.20974v1", "repo": "https://github.com/xu1868/sayself"}}