{"2407.09283": {"publish_time": "2024-07-12", "title": "DAHRS: Divergence-Aware Hallucination-Remediated SRL Projection", "paper_summary": "Semantic role labeling (SRL) enriches many downstream applications, e.g.,\nmachine translation, question answering, summarization, and stance/belief\ndetection. However, building multilingual SRL models is challenging due to the\nscarcity of semantically annotated corpora for multiple languages. Moreover,\nstate-of-the-art SRL projection (XSRL) based on large language models (LLMs)\nyields output that is riddled with spurious role labels. Remediation of such\nhallucinations is not straightforward due to the lack of explainability of\nLLMs. We show that hallucinated role labels are related to naturally occurring\ndivergence types that interfere with initial alignments. We implement\nDivergence-Aware Hallucination-Remediated SRL projection (DAHRS), leveraging\nlinguistically-informed alignment remediation followed by greedy First-Come\nFirst-Assign (FCFA) SRL projection. DAHRS improves the accuracy of SRL\nprojection without additional transformer-based machinery, beating XSRL in both\nhuman and automatic comparisons, and advancing beyond headwords to accommodate\nphrase-level SRL projection (e.g., EN-FR, EN-ES). Using CoNLL-2009 as our\nground truth, we achieve a higher word-level F1 over XSRL: 87.6% vs. 77.3%\n(EN-FR) and 89.0% vs. 82.7% (EN-ES). Human phrase-level assessments yield 89.1%\n(EN-FR) and 91.0% (EN-ES). We also define a divergence metric to adapt our\napproach to other language pairs (e.g., English-Tagalog).", "paper_summary_zh": "<paragraph>語義角色標註 (SRL) 豐富了許多下游應用，例如機器翻譯、問題解答、摘要和立場/信念偵測。然而，由於缺乏多種語言的語義標註語料庫，建立多語言 SRL 模型具有挑戰性。此外，基於大型語言模型 (LLM) 的最先進 SRL 投影 (XSRL) 產生的輸出充斥著虛假的角色標籤。由於 LLM 缺乏可解釋性，因此無法直接修復此類幻覺。我們發現，幻覺的角色標籤與自然發生的分歧類型有關，這些分歧類型會干擾初始對齊。我們實作了 Divergence-Aware Hallucination-Remediated SRL 投影 (DAHRS)，利用語言知識對齊修復，然後進行貪婪的先到先分配 (FCFA) SRL 投影。DAHRS 提高了 SRL 投影的準確度，而無需額外的基於轉換器的機制，在人工和自動比較中都優於 XSRL，並超越了詞首，以容納詞組級 SRL 投影 (例如，EN-FR、EN-ES)。使用 CoNLL-2009 作為我們的基本事實，我們實現了比 XSRL 更高的詞級 F1：87.6% 對比 77.3% (EN-FR) 和 89.0% 對比 82.7% (EN-ES)。人工詞組級評估產生 89.1% (EN-FR) 和 91.0% (EN-ES)。我們還定義了一個分歧指標，以將我們的做法調整到其他語言對（例如英語-他加祿語）。</paragraph>", "author": "Sangpil Youm et.al.", "authors": "Sangpil Youm, Brodie Mather, Chathuri Jayaweera, Juliana Prada, Bonnie Dorr", "id": "2407.09283v1", "paper_url": "http://arxiv.org/abs/2407.09283v1", "repo": "null"}}