{"2410.02498": {"publish_time": "2024-10-03", "title": "Dynamic Gradient Alignment for Online Data Mixing", "paper_summary": "The composition of training data mixtures is critical for effectively\ntraining large language models (LLMs), as it directly impacts their performance\non downstream tasks. Our goal is to identify an optimal data mixture to\nspecialize an LLM for a specific task with access to only a few examples.\nTraditional approaches to this problem include ad-hoc reweighting methods,\nimportance sampling, and gradient alignment techniques. This paper focuses on\ngradient alignment and introduces Dynamic Gradient Alignment (DGA), a scalable\nonline gradient alignment algorithm. DGA dynamically estimates the pre-training\ndata mixture on which the models' gradients align as well as possible with\nthose of the model on the specific task. DGA is the first gradient alignment\napproach that incurs minimal overhead compared to standard pre-training and\noutputs a competitive model, eliminating the need for retraining the model.\nExperimentally, we demonstrate significant improvements over importance\nsampling in two key scenarios: (i) when the pre-training set is small and\nimportance sampling overfits due to limited data; and (ii) when there is\ninsufficient specialized data, trapping importance sampling on narrow pockets\nof data. Our findings underscore the effectiveness of gradient alignment\nmethods in optimizing training data mixtures, particularly in data-constrained\nenvironments, and offer a practical solution for enhancing LLM performance on\nspecific tasks with limited data availability.", "paper_summary_zh": "訓練資料混合物的組成對於有效訓練大型語言模型 (LLM) 至關重要，因為它直接影響其在下游任務的表現。我們的目標是找出最佳資料混合物，以使用特定任務的少數範例，針對特定任務專門化 LLM。解決此問題的傳統方法包括臨時重新加權方法、重要性取樣和梯度對齊技術。本文重點在梯度對齊，並介紹動態梯度對齊 (DGA)，一種可擴充的線上梯度對齊演算法。DGA 動態估計預訓練資料混合物，模型的梯度與特定任務模型的梯度在此混合物上對齊得最好。DGA 是第一個梯度對齊方法，與標準預訓練相比，產生的開銷最小，且輸出具競爭力的模型，消除了重新訓練模型的需要。透過實驗，我們展示了在兩個關鍵情境中，相較於重要性取樣，有顯著的進步：(i) 當預訓練集很小，且重要性取樣因資料有限而過度擬合時；(ii) 當沒有足夠的專業化資料時，將重要性取樣限制在狹窄的資料區塊中。我們的研究結果強調了梯度對齊方法在最佳化訓練資料混合物上的有效性，特別是在資料受限的環境中，並為在資料可用性有限的情況下，提升特定任務的 LLM 表現，提供了實用的解決方案。", "author": "Simin Fan et.al.", "authors": "Simin Fan, David Grangier, Pierre Ablin", "id": "2410.02498v1", "paper_url": "http://arxiv.org/abs/2410.02498v1", "repo": "null"}}