{"2405.16856": {"publish_time": "2024-05-27", "title": "Can We Trust LLMs? Mitigate Overconfidence Bias in LLMs through Knowledge Transfer", "paper_summary": "The study explores mitigating overconfidence bias in LLMs to improve their\nreliability. We introduce a knowledge transfer (KT) method utilizing chain of\nthoughts, where \"big\" LLMs impart knowledge to \"small\" LLMs via detailed,\nsequential reasoning paths. This method uses advanced reasoning of larger\nmodels to fine-tune smaller models, enabling them to produce more accurate\npredictions with calibrated confidence. Experimental evaluation using\nmultiple-choice questions and sentiment analysis across diverse datasets\ndemonstrated the KT method's superiority over the vanilla and question-answer\npair (QA) fine-tuning methods. The most significant improvement in three key\nmetrics, where the KT method outperformed the vanilla and QA methods by an\naverage of 55.3% and 43.1%, respectively. These findings underscore the KT\nmethod's potential in enhancing model trustworthiness and accuracy, offering\nprecise outputs with well-matched confidence levels across various contexts.", "paper_summary_zh": "本研究探討如何減輕大型語言模型 (LLM) 中的過度自信偏差，以提升其可靠性。我們提出了一種利用思考鏈的知識轉移 (KT) 方法，其中「大型」LLM 透過詳細的順序推理路徑，將知識傳授給「小型」LLM。此方法使用較大型模型的高階推理，微調較小型模型，讓它們能夠產生更準確的預測，並校準信心。透過使用多項選擇題和跨不同資料集的情緒分析進行實驗評估，證明 KT 方法優於傳統和問答 (QA) 微調方法。在三個關鍵指標中，KT 方法的進步最顯著，平均分別優於傳統和 QA 方法 55.3% 和 43.1%。這些發現強調了 KT 方法在增強模型可信度和準確度方面的潛力，提供在各種情境中具有良好匹配信心水準的精確輸出。", "author": "Haoyan Yang et.al.", "authors": "Haoyan Yang, Yixuan Wang, Xingyin Xu, Hanyuan Zhang, Yirong Bian", "id": "2405.16856v1", "paper_url": "http://arxiv.org/abs/2405.16856v1", "repo": "null"}}