{"2405.14430": {"publish_time": "2024-05-23", "title": "PipeFusion: Displaced Patch Pipeline Parallelism for Inference of Diffusion Transformer Models", "paper_summary": "This paper introduces PipeFusion, a novel approach that harnesses multi-GPU\nparallelism to address the high computational and latency challenges of\ngenerating high-resolution images with diffusion transformers (DiT) models.\nPipeFusion splits images into patches and distributes the network layers across\nmultiple devices. It employs a pipeline parallel manner to orchestrate\ncommunication and computations. By leveraging the high similarity between the\ninput from adjacent diffusion steps, PipeFusion eliminates the waiting time in\nthe pipeline by reusing the one-step stale feature maps to provide context for\nthe current step. Our experiments demonstrate that it can generate higher image\nresolution where existing DiT parallel approaches meet OOM. PipeFusion\nsignificantly reduces the required communication bandwidth, enabling DiT\ninference to be hosted on GPUs connected via PCIe rather than the more costly\nNVLink infrastructure, which substantially lowers the overall operational\nexpenses for serving DiT models. Our code is publicly available at\nhttps://github.com/PipeFusion/PipeFusion.", "paper_summary_zh": "本文介紹 PipeFusion，一種新穎的方法，它利用多 GPU 並行運算來解決使用擴散Transformer (DiT) 模型產生高解析度影像時所面臨的高運算和延遲挑戰。\nPipeFusion 將影像分割成區塊，並將網路層分佈在多個裝置上。它採用流水線並行方式來協調通訊和運算。透過利用相鄰擴散步驟之間輸入的高相似性，PipeFusion 透過重複使用一步舊的特徵圖來提供當前步驟的背景，從而消除了流水線中的等待時間。我們的實驗表明，它可以在現有 DiT 並行方法遇到 OOM 的情況下產生更高的影像解析度。PipeFusion 大幅降低了所需的通訊頻寬，使 DiT 推論能夠在透過 PCIe 連接的 GPU 上執行，而不是成本更高的 NVLink 基礎架構，這大幅降低了服務 DiT 模型的整體營運開銷。我們的程式碼已公開於 https://github.com/PipeFusion/PipeFusion。", "author": "Jiannan Wang et.al.", "authors": "Jiannan Wang, Jiarui Fang, Aoyu Li, PengCheng Yang", "id": "2405.14430v1", "paper_url": "http://arxiv.org/abs/2405.14430v1", "repo": "null"}}