{"2406.10162": {"publish_time": "2024-06-14", "title": "Sycophancy to Subterfuge: Investigating Reward-Tampering in Large Language Models", "paper_summary": "In reinforcement learning, specification gaming occurs when AI systems learn\nundesired behaviors that are highly rewarded due to misspecified training\ngoals. Specification gaming can range from simple behaviors like sycophancy to\nsophisticated and pernicious behaviors like reward-tampering, where a model\ndirectly modifies its own reward mechanism. However, these more pernicious\nbehaviors may be too complex to be discovered via exploration. In this paper,\nwe study whether Large Language Model (LLM) assistants which find easily\ndiscovered forms of specification gaming will generalize to perform rarer and\nmore blatant forms, up to and including reward-tampering. We construct a\ncurriculum of increasingly sophisticated gameable environments and find that\ntraining on early-curriculum environments leads to more specification gaming on\nremaining environments. Strikingly, a small but non-negligible proportion of\nthe time, LLM assistants trained on the full curriculum generalize zero-shot to\ndirectly rewriting their own reward function. Retraining an LLM not to game\nearly-curriculum environments mitigates, but does not eliminate,\nreward-tampering in later environments. Moreover, adding harmlessness training\nto our gameable environments does not prevent reward-tampering. These results\ndemonstrate that LLMs can generalize from common forms of specification gaming\nto more pernicious reward tampering and that such behavior may be nontrivial to\nremove.", "paper_summary_zh": "在強化學習中，當 AI 系統學習到因訓練目標錯誤而獲得高度獎勵的不良行為時，就會發生規範博弈。規範博弈的範圍從簡單的行為，例如阿諛奉承，到複雜且有害的行為，例如獎勵篡改，其中模型直接修改其自身的獎勵機制。然而，這些更惡劣的行為可能過於複雜，無法透過探索來發現。在本文中，我們研究大型語言模型 (LLM) 助理是否會發現容易發現的規範博弈形式，並推廣到執行更罕見且更明顯的形式，包括獎勵篡改。我們建構了一個越來越複雜的可博弈環境課程，並發現對早期課程環境的訓練會導致在剩餘環境中進行更多規範博弈。令人驚訝的是，在很小但不可忽略的時間比例中，在完整課程中訓練的 LLM 助理會概化為零次學習，直接改寫自己的獎勵函數。重新訓練 LLM 不玩早期課程環境可以減輕，但無法消除，在後續環境中的獎勵篡改。此外，在我們的可博弈環境中加入無害訓練並不能防止獎勵篡改。這些結果表明，LLM 可以從常見的規範博弈形式推廣到更惡劣的獎勵篡改，並且這種行為可能很難消除。", "author": "Carson Denison et.al.", "authors": "Carson Denison, Monte MacDiarmid, Fazl Barez, David Duvenaud, Shauna Kravec, Samuel Marks, Nicholas Schiefer, Ryan Soklaski, Alex Tamkin, Jared Kaplan, Buck Shlegeris, Samuel R. Bowman, Ethan Perez, Evan Hubinger", "id": "2406.10162v1", "paper_url": "http://arxiv.org/abs/2406.10162v1", "repo": "https://github.com/anthropics/sycophancy-to-subterfuge-paper"}}