{"2406.09855": {"publish_time": "2024-06-14", "title": "On the Encoding of Gender in Transformer-based ASR Representations", "paper_summary": "While existing literature relies on performance differences to uncover gender\nbiases in ASR models, a deeper analysis is essential to understand how gender\nis encoded and utilized during transcript generation. This work investigates\nthe encoding and utilization of gender in the latent representations of two\ntransformer-based ASR models, Wav2Vec2 and HuBERT. Using linear erasure, we\ndemonstrate the feasibility of removing gender information from each layer of\nan ASR model and show that such an intervention has minimal impacts on the ASR\nperformance. Additionally, our analysis reveals a concentration of gender\ninformation within the first and last frames in the final layers, explaining\nthe ease of erasing gender in these layers. Our findings suggest the prospect\nof creating gender-neutral embeddings that can be integrated into ASR\nframeworks without compromising their efficacy.", "paper_summary_zh": "現有文獻依賴於表現差異來揭露 ASR 模型中的性別偏見，深入的分析對於了解在轉錄產生過程中如何編碼和利用性別至關重要。這項研究探討了基於Transformer的兩個 ASR 模型，Wav2Vec2 和 HuBERT 的潛在表示中性別的編碼和利用。使用線性擦除，我們證明了從 ASR 模型的每一層中移除性別資訊的可行性，並表明這種介入對 ASR 效能的影響很小。此外，我們的分析揭示了在最後一層的第一幀和最後一幀中性別資訊的集中，這解釋了在這些層中擦除性別的容易性。我們的發現表明了創造性別中立嵌入的可能性，這些嵌入可以整合到 ASR 框架中，而不會損害其效能。", "author": "Aravind Krishnan et.al.", "authors": "Aravind Krishnan, Badr M. Abdullah, Dietrich Klakow", "id": "2406.09855v1", "paper_url": "http://arxiv.org/abs/2406.09855v1", "repo": "null"}}