{"2502.01772": {"publish_time": "2025-02-03", "title": "On Bob Dylan: A Computational Perspective", "paper_summary": "Cass Sunstein's essay 'On Bob Dylan' describes Dylan's 'dishabituating' style\n-- a constant refusal to conform to expectation and a penchant for reinventing\nhis musical and lyrical identity. In this paper, I extend Sunstein's\nobservations through a large-scale computational analysis of Dylan's lyrics\nfrom 1962 to 2012. Using o3-mini-high (a large language model), I extract\nconcept-to-concept relationships from the lyrics and construct directed\nknowledge graphs that capture Dylan's thematic structure. I then quantify\nshifts in sentiment, metaphorical expression, thematic diversity, and network\ncomplexity over time. The results indicate that Dylan's lyrics increasingly\nrely on metaphor, display an evolving sentiment profile, and exhibit heightened\ndishabituation -- measured here as a growing variance in the network centrality\nof key concepts. I also find that references to movement, protest, and mythic\nimagery fluctuate in ways that align with well-known phases of Dylan's career,\nreflecting the dynamic and unpredictable quality of his art. These findings not\nonly deepen our empirical understanding of Sunstein's thesis but also introduce\na novel computational method for analyzing an artist's evolution-offering\nbroader applicability to the study of cultural and creative change.", "paper_summary_zh": "卡斯·桑斯坦的論文「論鮑伯·迪倫」描述了迪倫「去習慣化」的風格\n-- 這種風格不斷拒絕符合預期，並熱衷於重新塑造他的音樂和歌詞認同。在本文中，我透過對迪倫 1962 年至 2012 年歌詞進行大規模的運算分析，來延伸桑斯坦的觀察。使用 o3-mini-high（一個大型語言模型），我從歌詞中提取概念對概念的關係，並建構有向知識圖，以捕捉迪倫的主題結構。然後，我量化情緒、隱喻表達、主題多樣性和網路複雜性隨時間的變化。結果顯示，迪倫的歌詞越來越依賴隱喻，展現出不斷演化的情緒輪廓，並表現出高度的去習慣化 -- 在這裡測量為關鍵概念的網路中心性的變異增加。我也發現，對運動、抗議和神話意象的引用，會以與迪倫職業生涯中眾所周知階段一致的方式波動，反映了他藝術的動態和不可預測的品質。這些發現不僅加深了我們對桑斯坦論文的經驗理解，也引入了分析藝術家演變的新穎運算方法，為文化和創造性變化的研究提供了更廣泛的適用性。", "author": "Prashant Garg et.al.", "authors": "Prashant Garg", "id": "2502.01772v1", "paper_url": "http://arxiv.org/abs/2502.01772v1", "repo": "null"}}