{"2407.08219": {"publish_time": "2024-07-11", "title": "Generating Contextually-Relevant Navigation Instructions for Blind and Low Vision People", "paper_summary": "Navigating unfamiliar environments presents significant challenges for blind\nand low-vision (BLV) individuals. In this work, we construct a dataset of\nimages and goals across different scenarios such as searching through kitchens\nor navigating outdoors. We then investigate how grounded instruction generation\nmethods can provide contextually-relevant navigational guidance to users in\nthese instances. Through a sighted user study, we demonstrate that large\npretrained language models can produce correct and useful instructions\nperceived as beneficial for BLV users. We also conduct a survey and interview\nwith 4 BLV users and observe useful insights on preferences for different\ninstructions based on the scenario.", "paper_summary_zh": "對於視障人士 (BLV) 來說，在陌生的環境中移動會造成重大的挑戰。在這項工作中，我們建立了一個資料集，其中包含不同情境中的影像和目標，例如在廚房中搜尋或在戶外導航。接著，我們探討如何運用基礎指令產生方法，在這些情況下為使用者提供與情境相關的導航指南。透過一項明眼使用者研究，我們證明大型預訓練語言模型可以產生正確且有用的指令，這些指令被視為對 BLV 使用者有益。我們也進行了一項調查，並訪談了 4 位 BLV 使用者，並觀察到基於情境的不同指令偏好方面的有用見解。", "author": "Zain Merchant et.al.", "authors": "Zain Merchant, Abrar Anwar, Emily Wang, Souti Chattopadhyay, Jesse Thomason", "id": "2407.08219v1", "paper_url": "http://arxiv.org/abs/2407.08219v1", "repo": "null"}}