{"2405.09600": {"publish_time": "2024-05-15", "title": "Aggregate Representation Measure for Predictive Model Reusability", "paper_summary": "In this paper, we propose a predictive quantifier to estimate the retraining\ncost of a trained model in distribution shifts. The proposed Aggregated\nRepresentation Measure (ARM) quantifies the change in the model's\nrepresentation from the old to new data distribution. It provides, before\nactually retraining the model, a single concise index of resources - epochs,\nenergy, and carbon emissions - required for the retraining. This enables reuse\nof a model with a much lower cost than training a new model from scratch. The\nexperimental results indicate that ARM reasonably predicts retraining costs for\nvarying noise intensities and enables comparisons among multiple model\narchitectures to determine the most cost-effective and sustainable option.", "paper_summary_zh": "在本文中，我们提出了一种预测量化器，以估计分布变化中训练模型的重新训练成本。所提出的聚合表示度量（ARM）量化了模型表示从旧数据分布到新数据分布的变化。它在实际重新训练模型之前，提供了重新训练所需资源（时代、能源和碳排放）的单一简洁指标。这使得以比从头开始训练新模型低得多的成本重新使用模型成为可能。实验结果表明，ARM 合理地预测了不同噪声强度下的重新训练成本，并能够在多个模型架构之间进行比较，以确定最具成本效益和可持续性的选项。", "author": "Vishwesh Sangarya et.al.", "authors": "Vishwesh Sangarya, Richard Bradford, Jung-Eun Kim", "id": "2405.09600v1", "paper_url": "http://arxiv.org/abs/2405.09600v1", "repo": "null"}}