{"2409.20429": {"publish_time": "2024-09-30", "title": "HELPD: Mitigating Hallucination of LVLMs by Hierarchical Feedback Learning with Vision-enhanced Penalty Decoding", "paper_summary": "Large Vision-Language Models (LVLMs) have shown remarkable performance on\nmany visual-language tasks. However, these models still suffer from multimodal\nhallucination, which means the generation of objects or content that violates\nthe images. Many existing work detects hallucination by directly judging\nwhether an object exists in an image, overlooking the association between the\nobject and semantics. To address this issue, we propose Hierarchical Feedback\nLearning with Vision-enhanced Penalty Decoding (HELPD). This framework\nincorporates hallucination feedback at both object and sentence semantic\nlevels. Remarkably, even with a marginal degree of training, this approach can\nalleviate over 15% of hallucination. Simultaneously, HELPD penalizes the output\nlogits according to the image attention window to avoid being overly affected\nby generated text. HELPD can be seamlessly integrated with any LVLMs. Our\nexperiments demonstrate that the proposed framework yields favorable results\nacross multiple hallucination benchmarks. It effectively mitigates\nhallucination for different LVLMs and concurrently improves their text\ngeneration quality.", "paper_summary_zh": "大型視覺語言模型 (LVLMs) 在許多視覺語言任務中表現出色。然而，這些模型仍然存在多模態幻覺，這表示產生的物件或內容違反了影像。許多現有工作透過直接判斷物件是否存在於影像中來偵測幻覺，忽略了物件與語義之間的關聯。為了解決這個問題，我們提出了具有視覺增強懲罰解碼的階層式回饋學習 (HELPD)。此架構在物件和句子語義層級中都納入了幻覺回饋。值得注意的是，即使訓練程度很低，這種方法也能減輕超過 15% 的幻覺。同時，HELPD 會根據影像注意力視窗懲罰輸出 logit，以避免受到生成文字過度影響。HELPD 可以與任何 LVLMs 無縫整合。我們的實驗證明，所提出的架構在多個幻覺基準中產生了良好的結果。它有效地減輕了不同 LVLMs 的幻覺，並同時提升其文字生成品質。", "author": "Fan Yuan et.al.", "authors": "Fan Yuan, Chi Qin, Xiaogang Xu, Piji Li", "id": "2409.20429v1", "paper_url": "http://arxiv.org/abs/2409.20429v1", "repo": "null"}}