{"2407.12470": {"publish_time": "2024-07-17", "title": "Continual Learning for Temporal-Sensitive Question Answering", "paper_summary": "In this study, we explore an emerging research area of Continual Learning for\nTemporal Sensitive Question Answering (CLTSQA). Previous research has primarily\nfocused on Temporal Sensitive Question Answering (TSQA), often overlooking the\nunpredictable nature of future events. In real-world applications, it's crucial\nfor models to continually acquire knowledge over time, rather than relying on a\nstatic, complete dataset. Our paper investigates strategies that enable models\nto adapt to the ever-evolving information landscape, thereby addressing the\nchallenges inherent in CLTSQA. To support our research, we first create a novel\ndataset, divided into five subsets, designed specifically for various stages of\ncontinual learning. We then propose a training framework for CLTSQA that\nintegrates temporal memory replay and temporal contrastive learning. Our\nexperimental results highlight two significant insights: First, the CLTSQA task\nintroduces unique challenges for existing models. Second, our proposed\nframework effectively navigates these challenges, resulting in improved\nperformance.", "paper_summary_zh": "在本研究中，我们探讨了一个新兴的研究领域，即针对时间敏感问题解答 (CLTSQA) 的持续学习。以往的研究主要集中在时间敏感问题解答 (TSQA) 上，往往忽略了未来事件的不可预测性。在实际应用中，至关重要的是，模型能够随着时间的推移不断获取知识，而不是依赖于静态的、完整的数据集。我们的论文研究了使模型能够适应不断变化的信息环境的策略，从而解决了 CLTSQA 中固有的挑战。为了支持我们的研究，我们首先创建了一个新颖的数据集，将其分为五个子集，专门针对持续学习的不同阶段而设计。然后，我们提出了一个用于 CLTSQA 的训练框架，该框架集成了时间记忆重放和时间对比学习。我们的实验结果突出了两个重要的见解：首先，CLTSQA 任务给现有模型带来了独特的挑战。其次，我们提出的框架有效地解决了这些挑战，从而提高了性能。", "author": "Wanqi Yang et.al.", "authors": "Wanqi Yang, Yunqiu Xu, Yanda Li, Kunze Wang, Binbin Huang, Ling Chen", "id": "2407.12470v1", "paper_url": "http://arxiv.org/abs/2407.12470v1", "repo": "null"}}