{"2504.13597": {"publish_time": "2025-04-18", "title": "FocusNet: Transformer-enhanced Polyp Segmentation with Local and Pooling Attention", "paper_summary": "Colonoscopy is vital in the early diagnosis of colorectal polyps. Regular\nscreenings can effectively prevent benign polyps from progressing to CRC. While\ndeep learning has made impressive strides in polyp segmentation, most existing\nmodels are trained on single-modality and single-center data, making them less\neffective in real-world clinical environments. To overcome these limitations,\nwe propose FocusNet, a Transformer-enhanced focus attention network designed to\nimprove polyp segmentation. FocusNet incorporates three essential modules: the\nCross-semantic Interaction Decoder Module (CIDM) for generating coarse\nsegmentation maps, the Detail Enhancement Module (DEM) for refining shallow\nfeatures, and the Focus Attention Module (FAM), to balance local detail and\nglobal context through local and pooling attention mechanisms. We evaluate our\nmodel on PolypDB, a newly introduced dataset with multi-modality and\nmulti-center data for building more reliable segmentation methods. Extensive\nexperiments showed that FocusNet consistently outperforms existing\nstate-of-the-art approaches with a high dice coefficients of 82.47% on the BLI\nmodality, 88.46% on FICE, 92.04% on LCI, 82.09% on the NBI and 93.42% on WLI\nmodality, demonstrating its accuracy and robustness across five different\nmodalities. The source code for FocusNet is available at\nhttps://github.com/JunZengz/FocusNet.", "paper_summary_zh": "<paragraph>結腸鏡檢查在早期診斷大腸息肉方面至關重要。定期篩檢可以有效防止良性息肉發展成大腸癌 (CRC)。雖然深度學習在息肉分割方面取得了令人矚目的進展，但大多數現有模型都是利用單模態和單中心數據訓練的，這使得它們在現實臨床環境中的效果較差。為了克服這些限制，我們提出了 FocusNet，一個用 Transformer 增強的聚焦注意力網絡，旨在改進息肉分割。FocusNet 包含三個基本模塊：用於生成粗略分割圖的跨語義交互解碼器模塊 (CIDM)、用於細化淺層特徵的細節增強模塊 (DEM) 以及用於通過局部和池化注意力機制平衡局部細節和全局上下文的聚焦注意力模塊 (FAM)。我們在 PolypDB 上評估了我們的模型，PolypDB 是一個新引入的具有多模態和多中心數據的數據集，用於構建更可靠的分割方法。大量實驗表明，FocusNet 的表現一直優於現有的最先進方法，在 BLI 模態上的 dice 係數高達 82.47%，在 FICE 上為 88.46%，在 LCI 上為 92.04%，在 NBI 上為 82.09%，在 WLI 模態上為 93.42%，證明了其在五種不同模態下的準確性和穩健性。FocusNet 的源代碼可在 https://github.com/JunZengz/FocusNet 獲得。 </paragraph>\n", "author": "Jun Zeng et.al.", "authors": "Jun Zeng, KC Santosh, Deepak Rajan Nayak, Thomas de Lange, Jonas Varkey, Tyler Berzin, Debesh Jha", "id": "2504.13597v1", "paper_url": "http://arxiv.org/abs/2504.13597v1", "repo": "null"}}