{"2407.13244": {"publish_time": "2024-07-18", "title": "PM-LLM-Benchmark: Evaluating Large Language Models on Process Mining Tasks", "paper_summary": "Large Language Models (LLMs) have the potential to semi-automate some process\nmining (PM) analyses. While commercial models are already adequate for many\nanalytics tasks, the competitive level of open-source LLMs in PM tasks is\nunknown. In this paper, we propose PM-LLM-Benchmark, the first comprehensive\nbenchmark for PM focusing on domain knowledge (process-mining-specific and\nprocess-specific) and on different implementation strategies. We focus also on\nthe challenges in creating such a benchmark, related to the public availability\nof the data and on evaluation biases by the LLMs. Overall, we observe that most\nof the considered LLMs can perform some process mining tasks at a satisfactory\nlevel, but tiny models that would run on edge devices are still inadequate. We\nalso conclude that while the proposed benchmark is useful for identifying LLMs\nthat are adequate for process mining tasks, further research is needed to\novercome the evaluation biases and perform a more thorough ranking of the\ncompetitive LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 有潛力半自動化一些流程\n探勘 (PM) 分析。儘管商業模型已足夠應付許多\n分析任務，但開放原始碼 LLM 在 PM 任務中的競爭力仍\n未知。在本文中，我們提出 PM-LLM-Benchmark，這是第一個針對 PM 的全面性基準測試，著重於領域知識（流程探勘專用和流程專用）和不同的實作策略。我們也專注於建立此類基準測試的挑戰，這與資料的公開可用性及 LLM 的評量偏差有關。整體而言，我們觀察到大多數考慮的 LLM 都能以令人滿意的水準執行一些流程探勘任務，但會在邊緣裝置上執行的微小模型仍不足夠。我們也總結，儘管建議的基準測試有助於找出適合流程探勘任務的 LLM，但需要進一步的研究來克服評量偏差並對具競爭力的 LLM 執行更徹底的排名。", "author": "Alessandro Berti et.al.", "authors": "Alessandro Berti, Humam Kourani, Wil M. P. van der Aalst", "id": "2407.13244v1", "paper_url": "http://arxiv.org/abs/2407.13244v1", "repo": "null"}}