{"2502.13811": {"publish_time": "2025-02-19", "title": "On the Duality between Gradient Transformations and Adapters", "paper_summary": "We study memory-efficient optimization of neural networks with linear\ngradient transformations, where the gradients are linearly mapped to a lower\ndimensional space than the full parameter space, thus saving memory required\nfor gradient accumulation and optimizer state persistence. The model parameters\nare updated by first performing an optimization step in the lower dimensional\nspace and then going back into the original parameter space via the linear\nmap's transpose. We show that optimizing the model in this transformed space is\nequivalent to reparameterizing the original model through a linear adapter that\nadditively modifies the model parameters, and then only optimizing the\nadapter's parameters. When the transformation is Kronecker-factored, this\nestablishes an equivalence between GaLore and one-sided LoRA. We show that this\nduality between gradient transformations and adapter-based reparameterizations\nunifies existing approaches to memory-efficient training and suggests new\ntechniques for improving training efficiency and memory use.", "paper_summary_zh": "我們研究具有線性梯度轉換的神經網路的記憶體高效最佳化，其中梯度被線性映射到比完整參數空間更低維度的空間，從而節省了梯度累積和最佳化器狀態持續性所需的記憶體。模型參數會先在低維度空間執行最佳化步驟，再透過線性映射的轉置返回到原始參數空間來進行更新。我們說明在這個轉換空間最佳化模型等於透過線性轉接器重新參數化原始模型，這個轉接器會累加修改模型參數，然後僅最佳化轉接器的參數。當轉換是 Kronecker 分解時，這會在 GaLore 和單邊 LoRA 之間建立等效性。我們說明梯度轉換和基於轉接器的重新參數化之間的這種對偶性統一了現有的記憶體高效訓練方法，並建議新的技術來改善訓練效率和記憶體使用。", "author": "Lucas Torroba-Hennigen et.al.", "authors": "Lucas Torroba-Hennigen, Hunter Lang, Han Guo, Yoon Kim", "id": "2502.13811v1", "paper_url": "http://arxiv.org/abs/2502.13811v1", "repo": "null"}}