{"2408.13006": {"publish_time": "2024-08-23", "title": "Systematic Evaluation of LLM-as-a-Judge in LLM Alignment Tasks: Explainable Metrics and Diverse Prompt Templates", "paper_summary": "Alignment approaches such as RLHF and DPO are actively investigated to align\nlarge language models (LLMs) with human preferences. Commercial large language\nmodels (LLMs) like GPT-4 have been recently employed to evaluate and compare\ndifferent LLM alignment approaches. These models act as surrogates for human\nevaluators due to their promising abilities to approximate human preferences\nwith remarkably faster feedback and lower costs. This methodology is referred\nto as LLM-as-a-judge. However, concerns regarding its reliability have emerged,\nattributed to LLM judges' biases and inconsistent decision-making. Previous\nresearch has sought to develop robust evaluation frameworks for assessing the\nreliability of LLM judges and their alignment with human preferences. However,\nthe employed evaluation metrics often lack adequate explainability and fail to\naddress the internal inconsistency of LLMs. Additionally, existing studies\ninadequately explore the impact of various prompt templates when applying\nLLM-as-a-judge methods, which leads to potentially inconsistent comparisons\nbetween different alignment algorithms. In this work, we systematically\nevaluate LLM judges on alignment tasks (e.g. summarization) by defining\nevaluation metrics with improved theoretical interpretability and disentangling\nreliability metrics with LLM internal inconsistency. We develop a framework to\nevaluate, compare, and visualize the reliability and alignment of LLM judges to\nprovide informative observations that help choose LLM judges for alignment\ntasks. Our results indicate a significant impact of prompt templates on LLM\njudge performance, as well as a mediocre alignment level between the tested LLM\njudges and human evaluators.", "paper_summary_zh": "對齊方法，例如 RLHF 和 DPO，正積極地用於將大型語言模型 (LLM) 與人類偏好對齊。商業大型語言模型 (LLM)，例如 GPT-4，最近已被用於評估和比較不同的 LLM 對齊方法。這些模型由於近似人類偏好的能力強大，且反饋速度顯著加快，成本更低，因此充當人類評估者的替代者。這種方法稱為 LLM 作為評判者。然而，由於 LLM 評判者的偏見和不一致的決策，對其可靠性的擔憂已經浮現。先前的研究試圖開發健全的評估架構，用於評估 LLM 評判者的可靠性及其與人類偏好的對齊程度。然而，所採用的評估指標通常缺乏充分的可解釋性，且無法解決 LLM 的內部不一致性。此外，現有研究在應用 LLM 作為評判者方法時，並未充分探討各種提示範本的影響，這導致在不同的對齊演算法之間進行比較時可能會不一致。在這項工作中，我們透過定義具有改進的理論可解釋性，並將可靠性指標與 LLM 內部不一致性區分開來，系統性地評估對齊任務（例如摘要）中的 LLM 評判者。我們開發了一個架構來評估、比較和視覺化 LLM 評判者的可靠性和對齊程度，以提供有助於選擇 LLM 評判者進行對齊任務的見解。我們的結果表明，提示範本對 LLM 評判者表現有顯著影響，且在測試的 LLM 評判者與人類評估者之間的對齊程度普通。", "author": "Hui Wei et.al.", "authors": "Hui Wei, Shenghua He, Tian Xia, Andy Wong, Jingyang Lin, Mei Han", "id": "2408.13006v1", "paper_url": "http://arxiv.org/abs/2408.13006v1", "repo": "null"}}