{"2408.03849": {"publish_time": "2024-08-07", "title": "Hate Speech Detection and Classification in Amharic Text with Deep Learning", "paper_summary": "Hate speech is a growing problem on social media. It can seriously impact\nsociety, especially in countries like Ethiopia, where it can trigger conflicts\namong diverse ethnic and religious groups. While hate speech detection in\nresource rich languages are progressing, for low resource languages such as\nAmharic are lacking. To address this gap, we develop Amharic hate speech data\nand SBi-LSTM deep learning model that can detect and classify text into four\ncategories of hate speech: racial, religious, gender, and non-hate speech. We\nhave annotated 5k Amharic social media post and comment data into four\ncategories. The data is annotated using a custom annotation tool by a total of\n100 native Amharic speakers. The model achieves a 94.8 F1-score performance.\nFuture improvements will include expanding the dataset and develop state-of-the\nart models.\n  Keywords: Amharic hate speech detection, classification, Amharic dataset,\nDeep Learning, SBi-LSTM", "paper_summary_zh": "仇恨言論是社群媒體上日益嚴重的問題。它會嚴重影響社會，特別是在像衣索比亞這樣的國家，它會引發不同種族和宗教團體之間的衝突。雖然資源豐富的語言仇恨言論偵測正在進展中，但像阿姆哈拉語這樣的低資源語言卻缺乏。為了解決這個差距，我們開發了阿姆哈拉語仇恨言論資料和 SBi-LSTM 深度學習模型，可以偵測並將文字分類為四種類別的仇恨言論：種族、宗教、性別和非仇恨言論。我們已將 5 千個阿姆哈拉語社群媒體貼文和留言資料註解為四種類別。資料是由總共 100 位母語為阿姆哈拉語的講者使用自訂註解工具進行註解。該模型達到了 94.8 的 F1 分數表現。未來的改進將包括擴充資料集和開發最先進的模型。\n關鍵字：阿姆哈拉語仇恨言論偵測、分類、阿姆哈拉語資料集、深度學習、SBi-LSTM", "author": "Samuel Minale Gashe et.al.", "authors": "Samuel Minale Gashe, Seid Muhie Yimam, Yaregal Assabie", "id": "2408.03849v1", "paper_url": "http://arxiv.org/abs/2408.03849v1", "repo": "null"}}