{"2411.18162": {"publish_time": "2024-11-27", "title": "SentiXRL: An advanced large language Model Framework for Multilingual Fine-Grained Emotion Classification in Complex Text Environment", "paper_summary": "With strong expressive capabilities in Large Language Models(LLMs),\ngenerative models effectively capture sentiment structures and deep semantics,\nhowever, challenges remain in fine-grained sentiment classification across\nmulti-lingual and complex contexts. To address this, we propose the Sentiment\nCross-Lingual Recognition and Logic Framework (SentiXRL), which incorporates\ntwo modules,an emotion retrieval enhancement module to improve sentiment\nclassification accuracy in complex contexts through historical dialogue and\nlogical reasoning,and a self-circulating analysis negotiation mechanism\n(SANM)to facilitates autonomous decision-making within a single model for\nclassification tasks.We have validated SentiXRL's superiority on multiple\nstandard datasets, outperforming existing models on CPED and CH-SIMS,and\nachieving overall better performance on MELD,Emorynlp and IEMOCAP. Notably, we\nunified labels across several fine-grained sentiment annotation datasets and\nconducted category confusion experiments, revealing challenges and impacts of\nclass imbalance in standard datasets.", "paper_summary_zh": "藉由大型語言模型 (LLM) 強大的表達能力，\n生成模型有效地捕捉情緒結構和深層語義，\n然而，跨多語言和複雜情境中的細粒度情緒分類仍有挑戰。為了解決這個問題，我們提出情緒跨語言識別和邏輯框架 (SentiXRL)，其中包含兩個模組，一個情緒檢索增強模組，透過歷史對話和邏輯推理來改善複雜情境中的情緒分類準確度，以及一個自我循環分析協商機制 (SANM)，以利於在單一模型中針對分類任務進行自主決策。我們已在多個標準資料集驗證 SentiXRL 的優越性，在 CPED 和 CH-SIMS 上優於現有模型，且在 MELD、Emorynlp 和 IEMOCAP 上達成整體更好的效能。值得注意的是，我們統一了幾個細粒度情緒標註資料集中的標籤，並進行了類別混淆實驗，揭示了標準資料集中類別不平衡的挑戰和影響。", "author": "Jie Wang et.al.", "authors": "Jie Wang, Yichen Wang, Zhilin Zhang, Jianhao Zeng, Kaidi Wang, Zhiyang Chen", "id": "2411.18162v1", "paper_url": "http://arxiv.org/abs/2411.18162v1", "repo": "null"}}