{"2412.00372": {"publish_time": "2024-11-30", "title": "2-Factor Retrieval for Improved Human-AI Decision Making in Radiology", "paper_summary": "Human-machine teaming in medical AI requires us to understand to what degree\na trained clinician should weigh AI predictions. While previous work has shown\nthe potential of AI assistance at improving clinical predictions, existing\nclinical decision support systems either provide no explainability of their\npredictions or use techniques like saliency and Shapley values, which do not\nallow for physician-based verification. To address this gap, this study\ncompares previously used explainable AI techniques with a newly proposed\ntechnique termed '2-factor retrieval (2FR)', which is a combination of\ninterface design and search retrieval that returns similarly labeled data\nwithout processing this data. This results in a 2-factor security blanket\nwhere: (a) correct images need to be retrieved by the AI; and (b) humans should\nassociate the retrieved images with the current pathology under test. We find\nthat when tested on chest X-ray diagnoses, 2FR leads to increases in clinician\naccuracy, with particular improvements when clinicians are radiologists and\nhave low confidence in their decision. Our results highlight the importance of\nunderstanding how different modes of human-AI decision making may impact\nclinician accuracy in clinical decision support systems.", "paper_summary_zh": "人機協作在醫療 AI 中，需要我們理解受過訓練的臨床醫生在多大程度上應重視 AI 預測。雖然先前的研究顯示 AI 輔助在改善臨床預測方面的潛力，但現有的臨床決策支援系統，要不就沒有提供預測的可解釋性，要不就是使用像顯著性和 Shapley 值之類的技術，這些技術不允許基於醫生的驗證。為了解決這個差距，本研究將先前使用的可解釋 AI 技術與一種新提出的稱為「2 因子檢索 (2FR)」的技術進行比較，後者是一種介面設計和搜尋檢索的組合，它會傳回標籤相似的資料，而不會處理這些資料。這會產生一個 2 因子安全機制，其中：(a) 正確的影像需要由 AI 檢索；(b) 人類應將檢索的影像與正在測試中的病理聯想起來。我們發現，當在胸部 X 光診斷上進行測試時，2FR 會提高臨床醫生的準確度，特別是在臨床醫生是放射科醫生且對其決策信心不足時，會有顯著的改善。我們的結果強調了理解人機決策的不同模式如何影響臨床醫生在臨床決策支援系統中的準確性的重要性。", "author": "Jim Solomon et.al.", "authors": "Jim Solomon, Laleh Jalilian, Alexander Vilesov, Meryl Mathew, Tristan Grogan, Arash Bedayat, Achuta Kadambi", "id": "2412.00372v1", "paper_url": "http://arxiv.org/abs/2412.00372v1", "repo": "null"}}