{"2412.06239": {"publish_time": "2024-12-09", "title": "Unseen Attack Detection in Software-Defined Networking Using a BERT-Based Large Language Model", "paper_summary": "Software defined networking (SDN) represents a transformative shift in\nnetwork architecture by decoupling the control plane from the data plane,\nenabling centralized and flexible management of network resources. However,\nthis architectural shift introduces significant security challenges, as SDN's\ncentralized control becomes an attractive target for various types of attacks.\nWhile current research has yielded valuable insights into attack detection in\nSDN, critical gaps remain. Addressing challenges in feature selection,\nbroadening the scope beyond DDoS attacks, strengthening attack decisions based\non multi flow analysis, and building models capable of detecting unseen attacks\nthat they have not been explicitly trained on are essential steps toward\nadvancing security in SDN. In this paper, we introduce a novel approach that\nleverages Natural Language Processing (NLP) and the pre trained BERT base model\nto enhance attack detection in SDN. Our approach transforms network flow data\ninto a format interpretable by language models, allowing BERT to capture\nintricate patterns and relationships within network traffic. By using Random\nForest for feature selection, we optimize model performance and reduce\ncomputational overhead, ensuring accurate detection. Attack decisions are made\nbased on several flows, providing stronger and more reliable detection of\nmalicious traffic. Furthermore, our approach is specifically designed to detect\npreviously unseen attacks, offering a solution for identifying threats that the\nmodel was not explicitly trained on. To rigorously evaluate our approach, we\nconducted experiments in two scenarios: one focused on detecting known attacks,\nachieving 99.96% accuracy, and another on detecting unseen attacks, where our\nmodel achieved 99.96% accuracy, demonstrating the robustness of our approach in\ndetecting evolving threats to improve the security of SDN networks.", "paper_summary_zh": "軟體定義網路 (SDN) 藉由將控制平面與資料平面分離，代表網路架構的轉型變革，讓網路資源能以集中且彈性的方式進行管理。不過，這種架構轉變引入了顯著的安全挑戰，因為 SDN 的集中式控制機制對於各種類型的攻擊而言，是一個有吸引力的目標。雖然目前的研究已對 SDN 中的攻擊偵測產生了寶貴的見解，但仍存在關鍵的差距。解決特徵選取中的挑戰、擴大 DDoS 攻擊以外的範圍、根據多流程分析強化攻擊決策，以及建立能夠偵測未見過且未明確訓練過的攻擊的模型，是提升 SDN 安全性的必要步驟。在本文中，我們介紹一種新穎的方法，它利用自然語言處理 (NLP) 和預先訓練的 BERT 基礎模型來增強 SDN 中的攻擊偵測。我們的做法將網路流程資料轉換成語言模型可以解譯的格式，讓 BERT 能夠擷取網路流量中的複雜模式和關係。藉由使用隨機森林進行特徵選取，我們最佳化模型效能並減少運算負擔，確保精確的偵測。攻擊決策是根據多個流程做出的，提供更強大且更可靠的惡意流量偵測。此外，我們的方法特別設計用來偵測先前未見過的攻擊，提供一個解決方案來識別模型未明確訓練過的威脅。為了嚴謹評估我們的方法，我們在兩個情境中進行了實驗：一個專注於偵測已知的攻擊，達到了 99.96% 的準確度；另一個專注於偵測未見過的攻擊，我們的模型達到了 99.96% 的準確度，證明了我們的方法在偵測不斷演化的威脅以提升 SDN 網路安全性方面的強健性。", "author": "Mohammed N. Swileh et.al.", "authors": "Mohammed N. Swileh, Shengli Zhang", "id": "2412.06239v1", "paper_url": "http://arxiv.org/abs/2412.06239v1", "repo": "null"}}