{"2501.18270": {"publish_time": "2025-01-30", "title": "The iToBoS dataset: skin region images extracted from 3D total body photographs for lesion detection", "paper_summary": "Artificial intelligence has significantly advanced skin cancer diagnosis by\nenabling rapid and accurate detection of malignant lesions. In this domain,\nmost publicly available image datasets consist of single, isolated skin lesions\npositioned at the center of the image. While these lesion-centric datasets have\nbeen fundamental for developing diagnostic algorithms, they lack the context of\nthe surrounding skin, which is critical for improving lesion detection. The\niToBoS dataset was created to address this challenge. It includes 16,954 images\nof skin regions from 100 participants, captured using 3D total body\nphotography. Each image roughly corresponds to a $7 \\times 9$ cm section of\nskin with all suspicious lesions annotated using bounding boxes. Additionally,\nthe dataset provides metadata such as anatomical location, age group, and sun\ndamage score for each image. This dataset aims to facilitate training and\nbenchmarking of algorithms, with the goal of enabling early detection of skin\ncancer and deployment of this technology in non-clinical environments.", "paper_summary_zh": "人工智慧透過快速且準確偵測惡性病灶，大幅提升皮膚癌的診斷。在這個領域中，大多數公開的影像資料集都包含單一、孤立的皮膚病灶，置於影像的中央。儘管這些以病灶為中心的資料集對於開發診斷演算法至關重要，但它們卻缺乏周圍皮膚的背景，這對於改善病灶偵測至關重要。iToBoS 資料集的建立就是為了應對這個挑戰。它包含 100 位參與者的 16,954 張皮膚區域影像，使用 3D 全身攝影技術擷取。每張影像大致對應於 $7 \\times 9$ 公分的皮膚區域，所有可疑病灶都使用邊界框標註。此外，該資料集還提供每張影像的元資料，例如解剖位置、年齡組和日曬損傷評分。此資料集旨在促進演算法的訓練和基準測試，目標是實現皮膚癌的早期偵測，並將此技術部署在非臨床環境中。", "author": "Anup Saha et.al.", "authors": "Anup Saha, Joseph Adeola, Nuria Ferrera, Adam Mothershaw, Gisele Rezze, Séraphin Gaborit, Brian D'Alessandro, James Hudson, Gyula Szabó, Balazs Pataki, Hayat Rajani, Sana Nazari, Hassan Hayat, Clare Primiero, H. Peter Soyer, Josep Malvehy, Rafael Garcia", "id": "2501.18270v1", "paper_url": "http://arxiv.org/abs/2501.18270v1", "repo": "null"}}