{"2501.10017": {"publish_time": "2025-01-17", "title": "Enhancing Crash Frequency Modeling Based on Augmented Multi-Type Data by Hybrid VAE-Diffusion-Based Generative Neural Networks", "paper_summary": "Crash frequency modelling analyzes the impact of factors like traffic volume,\nroad geometry, and environmental conditions on crash occurrences. Inaccurate\npredictions can distort our understanding of these factors, leading to\nmisguided policies and wasted resources, which jeopardize traffic safety. A key\nchallenge in crash frequency modelling is the prevalence of excessive zero\nobservations, caused by underreporting, the low probability of crashes, and\nhigh data collection costs. These zero observations often reduce model accuracy\nand introduce bias, complicating safety decision making. While existing\napproaches, such as statistical methods, data aggregation, and resampling,\nattempt to address this issue, they either rely on restrictive assumptions or\nresult in significant information loss, distorting crash data. To overcome\nthese limitations, we propose a hybrid VAE-Diffusion neural network, designed\nto reduce zero observations and handle the complexities of multi-type tabular\ncrash data (count, ordinal, nominal, and real-valued variables). We assess the\nsynthetic data quality generated by this model through metrics like similarity,\naccuracy, diversity, and structural consistency, and compare its predictive\nperformance against traditional statistical models. Our findings demonstrate\nthat the hybrid VAE-Diffusion model outperforms baseline models across all\nmetrics, offering a more effective approach to augmenting crash data and\nimproving the accuracy of crash frequency predictions. This study highlights\nthe potential of synthetic data to enhance traffic safety by improving crash\nfrequency modelling and informing better policy decisions.", "paper_summary_zh": "車禍頻率模型分析了交通流量、道路幾何形狀和環境條件等因素對車禍發生的影響。不準確的預測會扭曲我們對這些因素的理解，導致錯誤的政策和浪費資源，進而危害交通安全。車禍頻率建模中的關鍵挑戰是過度零觀測的普遍性，這是由於低報、車禍發生的機率低和資料收集成本高所造成的。這些零觀測通常會降低模型準確度並引入偏差，使安全決策制定複雜化。雖然現有的方法，例如統計方法、資料彙總和重新抽樣，嘗試解決這個問題，但它們依賴於限制性假設或導致顯著的資訊損失，扭曲了車禍資料。為了克服這些限制，我們提出一個混合 VAE-Diffusion 神經網路，旨在減少零觀測並處理多種類型表格車禍資料（計數、序數、名義和實值變數）的複雜性。我們透過類似性、準確度、多樣性和結構一致性等指標評估此模型產生的合成資料品質，並將其預測效能與傳統統計模型進行比較。我們的研究結果表明，混合 VAE-Diffusion 模型在所有指標上都優於基線模型，提供一種更有效的方法來擴充車禍資料並提高車禍頻率預測的準確度。本研究突顯了合成資料在透過改善車禍頻率建模和提供更好的政策決策來增強交通安全方面的潛力。", "author": "Junlan Chen et.al.", "authors": "Junlan Chen, Qijie He, Pei Liu, Wei Ma, Ziyuan Pu", "id": "2501.10017v1", "paper_url": "http://arxiv.org/abs/2501.10017v1", "repo": "null"}}