{"2412.03420": {"publish_time": "2024-12-04", "title": "Automated Test-Case Generation for REST APIs Using Model Inference Search Heuristic", "paper_summary": "The rising popularity of the microservice architectural style has led to a\ngrowing demand for automated testing approaches tailored to these systems.\nEvoMaster is a state-of-the-art tool that uses Evolutionary Algorithms (EAs) to\nautomatically generate test cases for microservices' REST APIs. One limitation\nof these EAs is the use of unit-level search heuristics, such as branch\ndistances, which focus on fine-grained code coverage and may not effectively\ncapture the complex, interconnected behaviors characteristic of system-level\ntesting. To address this limitation, we propose a new search heuristic (MISH)\nthat uses real-time automaton learning to guide the test case generation\nprocess. We capture the sequential call patterns exhibited by a test case by\nlearning an automaton from the stream of log events outputted by different\nmicroservices within the same system. Therefore, MISH learns a representation\nof the systemwide behavior, allowing us to define the fitness of a test case\nbased on the path it traverses within the inferred automaton. We empirically\nevaluate MISH's effectiveness on six real-world benchmark microservice\napplications and compare it against a state-of-the-art technique, MOSA, for\ntesting REST APIs. Our evaluation shows promising results for using MISH to\nguide the automated test case generation within EvoMaster.", "paper_summary_zh": "微服務架構風格日益普及，導致對針對這些系統量身打造的自動化測試方法的需求不斷增長。EvoMaster 是一款最先進的工具，它使用演算法 (EA) 自動產生微服務 REST API 的測試案例。這些 EA 的一個限制是使用單元層級的搜尋啟發法，例如分支距離，這種方法專注於精細的程式碼覆蓋率，可能無法有效捕捉系統層級測試特有的複雜、相互關聯的行為。為了解決這個限制，我們提出一個新的搜尋啟發法 (MISH)，它使用即時自動機學習來引導測試案例產生程序。我們透過從同一個系統中不同微服務輸出的日誌事件串流學習自動機，來捕捉測試案例展現的順序呼叫模式。因此，MISH 會學習系統範圍行為的表示，讓我們可以根據測試案例在推論的自動機中所走訪的路徑來定義其適應度。我們對六個真實世界的基準微服務應用程式實證評估了 MISH 的有效性，並將其與最先進的 REST API 測試技術 MOSA 進行比較。我們的評估顯示，使用 MISH 來引導 EvoMaster 中的自動化測試案例產生，具有令人振奮的結果。", "author": "Clinton Cao et.al.", "authors": "Clinton Cao, Annibale Panichella, Sicco Verwer", "id": "2412.03420v1", "paper_url": "http://arxiv.org/abs/2412.03420v1", "repo": "null"}}