{"2406.09103": {"publish_time": "2024-06-13", "title": "Chain-of-Though (CoT) prompting strategies for medical error detection and correction", "paper_summary": "This paper describes our submission to the MEDIQA-CORR 2024 shared task for\nautomatically detecting and correcting medical errors in clinical notes. We\nreport results for three methods of few-shot In-Context Learning (ICL)\naugmented with Chain-of-Thought (CoT) and reason prompts using a large language\nmodel (LLM). In the first method, we manually analyse a subset of train and\nvalidation dataset to infer three CoT prompts by examining error types in the\nclinical notes. In the second method, we utilise the training dataset to prompt\nthe LLM to deduce reasons about their correctness or incorrectness. The\nconstructed CoTs and reasons are then augmented with ICL examples to solve the\ntasks of error detection, span identification, and error correction. Finally,\nwe combine the two methods using a rule-based ensemble method. Across the three\nsub-tasks, our ensemble method achieves a ranking of 3rd for both sub-task 1\nand 2, while securing 7th place in sub-task 3 among all submissions.", "paper_summary_zh": "本文描述了我們對 MEDIQA-CORR 2024 共享任務的提交，該任務是自動檢測和更正臨床筆記中的醫療錯誤。我們報告了使用大型語言模型 (LLM) 擴充的少次數情境學習 (ICL) 三種方法的結果，並採用思考鏈 (CoT) 和原因提示。在第一種方法中，我們手動分析訓練和驗證資料集的子集，藉由檢查臨床筆記中的錯誤類型來推斷三個 CoT 提示。在第二種方法中，我們利用訓練資料集提示 LLM 推斷其正確性或不正確性的原因。然後將建構的 CoT 和原因與 ICL 範例合併，以解決錯誤檢測、範圍識別和錯誤更正的任務。最後，我們使用基於規則的整體方法結合這兩種方法。在三個子任務中，我們的整體方法在子任務 1 和 2 中都取得第 3 名的排名，而在子任務 3 中則在所有提交中獲得第 7 名。", "author": "Zhaolong Wu et.al.", "authors": "Zhaolong Wu, Abul Hasan, Jinge Wu, Yunsoo Kim, Jason P. Y. Cheung, Teng Zhang, Honghan Wu", "id": "2406.09103v1", "paper_url": "http://arxiv.org/abs/2406.09103v1", "repo": "null"}}