{"2502.03685": {"publish_time": "2025-02-06", "title": "Controlled LLM Decoding via Discrete Auto-regressive Biasing", "paper_summary": "Controlled text generation allows for enforcing user-defined constraints on\nlarge language model outputs, an increasingly important field as LLMs become\nmore prevalent in everyday life. One common approach uses energy-based\ndecoding, which defines a target distribution through an energy function that\ncombines multiple constraints into a weighted average. However, these methods\noften struggle to balance fluency with constraint satisfaction, even with\nextensive tuning of the energy function's coefficients. In this paper, we\nidentify that this suboptimal balance arises from sampling in continuous space\nrather than the natural discrete space of text tokens. To address this, we\npropose Discrete Auto-regressive Biasing, a controlled decoding algorithm that\nleverages gradients while operating entirely in the discrete text domain.\nSpecifically, we introduce a new formulation for controlled text generation by\ndefining a joint distribution over the generated sequence and an auxiliary bias\nsequence. To efficiently sample from this joint distribution, we propose a\nLangevin-within-Gibbs sampling algorithm using gradient-based discrete MCMC.\nOur method significantly improves constraint satisfaction while maintaining\ncomparable or better fluency, all with even lower computational costs. We\ndemonstrate the advantages of our controlled decoding method on sentiment\ncontrol, language detoxification, and keyword-guided generation.", "paper_summary_zh": "受控文本生成允许對大型語言模型輸出執行使用者定義的約束，隨著大型語言模型在日常生活中變得越來越普遍，這是一個越來越重要的領域。一種常見的方法使用基於能量的解碼，它通過將多個約束組合成加權平均值來定義目標分佈。然而，這些方法通常難以在流暢性和約束滿足之間取得平衡，即使對能量函數的係數進行廣泛調整也是如此。在本文中，我們發現這種次優平衡源於在連續空間中進行採樣，而不是在文本符號的自然離散空間中進行採樣。為了解決這個問題，我們提出了離散自回歸偏差，這是一種受控解碼演算法，它在完全在離散文本域中運作的同時利用梯度。具體來說，我們通過定義生成序列和輔助偏差序列上的聯合分佈來引入受控文本生成的全新公式。為了有效地從這個聯合分佈中進行採樣，我們提出了一個使用基於梯度的離散 MCMC 的 Gibbs 內 Langevin 採樣演算法。我們的模型顯著改善了約束滿足，同時維持了相當或更好的流暢性，而且計算成本更低。我們在情緒控制、語言解毒和關鍵字引導生成方面展示了我們的受控解碼方法的優點。", "author": "Patrick Pynadath et.al.", "authors": "Patrick Pynadath, Ruqi Zhang", "id": "2502.03685v1", "paper_url": "http://arxiv.org/abs/2502.03685v1", "repo": "null"}}