{"2408.08302": {"publish_time": "2024-08-15", "title": "Benchmarking the Capabilities of Large Language Models in Transportation System Engineering: Accuracy, Consistency, and Reasoning Behaviors", "paper_summary": "In this paper, we explore the capabilities of state-of-the-art large language\nmodels (LLMs) such as GPT-4, GPT-4o, Claude 3.5 Sonnet, Claude 3 Opus, Gemini\n1.5 Pro, Llama 3, and Llama 3.1 in solving some selected undergraduate-level\ntransportation engineering problems. We introduce TransportBench, a benchmark\ndataset that includes a sample of transportation engineering problems on a wide\nrange of subjects in the context of planning, design, management, and control\nof transportation systems. This dataset is used by human experts to evaluate\nthe capabilities of various commercial and open-sourced LLMs, especially their\naccuracy, consistency, and reasoning behaviors, in solving transportation\nengineering problems. Our comprehensive analysis uncovers the unique strengths\nand limitations of each LLM, e.g. our analysis shows the impressive accuracy\nand some unexpected inconsistent behaviors of Claude 3.5 Sonnet in solving\nTransportBench problems. Our study marks a thrilling first step toward\nharnessing artificial general intelligence for complex transportation\nchallenges.", "paper_summary_zh": "在本文中，我們探討了最先進大型語言模型 (LLM) 的能力，例如 GPT-4、GPT-4o、Claude 3.5 Sonnet、Claude 3 Opus、Gemini 1.5 Pro、Llama 3 和 Llama 3.1，以解決一些選定的大學部級交通工程問題。我們引入了 TransportBench，這是一個基準數據集，其中包含在規劃、設計、管理和交通系統控制的廣泛主題中的一系列交通工程問題範例。此數據集由人類專家用於評估各種商業和開源 LLM 的能力，特別是它們在解決交通工程問題時的準確性、一致性和推理行為。我們的全面分析揭示了每種 LLM 獨特的優勢和限制，例如我們的分析顯示了 Claude 3.5 Sonnet 在解決 TransportBench 問題時令人印象深刻的準確性和一些意外的不一致行為。我們的研究標誌著朝著利用人工通用智慧來應對複雜的交通挑戰邁出的令人興奮的第一步。", "author": "Usman Syed et.al.", "authors": "Usman Syed, Ethan Light, Xingang Guo, Huan Zhang, Lianhui Qin, Yanfeng Ouyang, Bin Hu", "id": "2408.08302v1", "paper_url": "http://arxiv.org/abs/2408.08302v1", "repo": "null"}}