{"2406.16148": {"publish_time": "2024-06-23", "title": "Towards Open Respiratory Acoustic Foundation Models: Pretraining and Benchmarking", "paper_summary": "Respiratory audio, such as coughing and breathing sounds, has predictive\npower for a wide range of healthcare applications, yet is currently\nunder-explored. The main problem for those applications arises from the\ndifficulty in collecting large labeled task-specific data for model\ndevelopment. Generalizable respiratory acoustic foundation models pretrained\nwith unlabeled data would offer appealing advantages and possibly unlock this\nimpasse. However, given the safety-critical nature of healthcare applications,\nit is pivotal to also ensure openness and replicability for any proposed\nfoundation model solution. To this end, we introduce OPERA, an OPEn Respiratory\nAcoustic foundation model pretraining and benchmarking system, as the first\napproach answering this need. We curate large-scale respiratory audio datasets\n(~136K samples, 440 hours), pretrain three pioneering foundation models, and\nbuild a benchmark consisting of 19 downstream respiratory health tasks for\nevaluation. Our pretrained models demonstrate superior performance (against\nexisting acoustic models pretrained with general audio on 16 out of 19 tasks)\nand generalizability (to unseen datasets and new respiratory audio modalities).\nThis highlights the great promise of respiratory acoustic foundation models and\nencourages more studies using OPERA as an open resource to accelerate research\non respiratory audio for health. The system is accessible from\nhttps://github.com/evelyn0414/OPERA.", "paper_summary_zh": "呼吸音訊，例如咳嗽和呼吸聲，對於廣泛的醫療保健應用具有預測能力，但目前仍未得到充分的探討。對於這些應用來說，主要問題在於難以收集用於模型開發的大量標記特定任務資料。使用未標記資料預先訓練的可概化呼吸聲學基礎模型將提供有吸引力的優勢，並有可能打破這種僵局。然而，鑑於醫療保健應用的安全性至關重要，因此對於任何提出的基礎模型解決方案，確保開放性和可複製性也至關重要。為此，我們引入了 OPERA，一個開放的呼吸聲學基礎模型預訓練和基準系統，作為滿足此需求的第一種方法。我們策劃了大規模的呼吸音訊資料集（約 136K 個樣本，440 小時），預先訓練了三個開創性的基礎模型，並建立了一個基準，其中包含 19 個下游呼吸健康任務以供評估。我們的預訓練模型展示出卓越的效能（在 19 個任務中有 16 個任務優於使用一般音訊預先訓練的現有聲學模型）和概化能力（對未見過的資料集和新的呼吸音訊方式）。這突顯了呼吸聲學基礎模型的巨大前景，並鼓勵更多研究使用 OPERA 作為開放資源，以加速呼吸音訊在健康方面的研究。該系統可從 https://github.com/evelyn0414/OPERA 取得。", "author": "Yuwei Zhang et.al.", "authors": "Yuwei Zhang, Tong Xia, Jing Han, Yu Wu, Georgios Rizos, Yang Liu, Mohammed Mosuily, Jagmohan Chauhan, Cecilia Mascolo", "id": "2406.16148v1", "paper_url": "http://arxiv.org/abs/2406.16148v1", "repo": "https://github.com/evelyn0414/opera"}}