{"2411.11795": {"publish_time": "2024-11-18", "title": "Exploring adversarial robustness of JPEG AI: methodology, comparison and new methods", "paper_summary": "Adversarial robustness of neural networks is an increasingly important area\nof research, combining studies on computer vision models, large language models\n(LLMs), and others. With the release of JPEG AI - the first standard for\nend-to-end neural image compression (NIC) methods - the question of its\nrobustness has become critically significant. JPEG AI is among the first\ninternational, real-world applications of neural-network-based models to be\nembedded in consumer devices. However, research on NIC robustness has been\nlimited to open-source codecs and a narrow range of attacks. This paper\nproposes a new methodology for measuring NIC robustness to adversarial attacks.\nWe present the first large-scale evaluation of JPEG AI's robustness, comparing\nit with other NIC models. Our evaluation results and code are publicly\navailable online (link is hidden for a blind review).", "paper_summary_zh": "神經網路對抗攻擊的穩健性是一個日益重要的研究領域，結合了電腦視覺模型、大型語言模型 (LLM) 等方面的研究。隨著 JPEG AI 的發布，JPEG AI 是第一個端到端神經影像壓縮 (NIC) 方法標準，其穩健性問題變得至關重要。JPEG AI 是第一批將基於神經網路的模型應用於國際現實世界並嵌入消費者裝置的應用程式。然而，關於 NIC 穩健性的研究僅限於開源編解碼器和範圍狹窄的攻擊。本文提出了一種新的方法來衡量 NIC 對抗攻擊的穩健性。我們展示了 JPEG AI 穩健性的第一次大規模評估，並將其與其他 NIC 模型進行比較。我們的評估結果和程式碼已公開在網路上（連結因盲審而隱藏）。", "author": "Egor Kovalev et.al.", "authors": "Egor Kovalev, Georgii Bychkov, Khaled Abud, Aleksandr Gushchin, Anna Chistyakova, Sergey Lavrushkin, Dmitriy Vatolin, Anastasia Antsiferova", "id": "2411.11795v1", "paper_url": "http://arxiv.org/abs/2411.11795v1", "repo": "null"}}