{"2408.02927": {"publish_time": "2024-08-06", "title": "HARMONIC: Harnessing LLMs for Tabular Data Synthesis and Privacy Protection", "paper_summary": "Data serves as the fundamental foundation for advancing deep learning,\nparticularly tabular data presented in a structured format, which is highly\nconducive to modeling. However, even in the era of LLM, obtaining tabular data\nfrom sensitive domains remains a challenge due to privacy or copyright\nconcerns. Hence, exploring how to effectively use models like LLMs to generate\nrealistic and privacy-preserving synthetic tabular data is urgent. In this\npaper, we take a step forward to explore LLMs for tabular data synthesis and\nprivacy protection, by introducing a new framework HARMONIC for tabular data\ngeneration and evaluation. In the tabular data generation of our framework,\nunlike previous small-scale LLM-based methods that rely on continued\npre-training, we explore the larger-scale LLMs with fine-tuning to generate\ntabular data and enhance privacy. Based on idea of the k-nearest neighbors\nalgorithm, an instruction fine-tuning dataset is constructed to inspire LLMs to\ndiscover inter-row relationships. Then, with fine-tuning, LLMs are trained to\nremember the format and connections of the data rather than the data itself,\nwhich reduces the risk of privacy leakage. In the evaluation part of our\nframework, we develop specific privacy risk metrics DLT for LLM synthetic data\ngeneration, as well as performance evaluation metrics LLE for downstream LLM\ntasks. Our experiments find that this tabular data generation framework\nachieves equivalent performance to existing methods with better privacy, which\nalso demonstrates our evaluation framework for the effectiveness of synthetic\ndata and privacy risks in LLM scenarios.", "paper_summary_zh": "<paragraph>資料作為推動深度學習的基礎，\n特別是結構化呈現的表格資料，非常適合建模。然而，即使在 LLM 時代，由於隱私或版權問題，從敏感領域取得表格資料仍然是一項挑戰。因此，探討如何有效使用 LLM 等模型來產生逼真且保護隱私的合成表格資料非常迫切。在本文中，我們進一步探討 LLM 在表格資料合成和隱私保護方面的應用，並介紹一個新的表格資料產生和評估框架 HARMONIC。在我們框架的表格資料產生中，與依賴持續預訓練的先前小規模基於 LLM 的方法不同，我們探討使用微調的大規模 LLM 來產生表格資料並增強隱私。基於 k 最近鄰演算法的想法，構建了一個指令微調資料集，以激勵 LLM 發現列間關係。然後，透過微調，訓練 LLM 記住資料的格式和關聯性，而不是資料本身，這降低了隱私洩露的風險。在我們框架的評估部分，我們開發了針對 LLM 合成資料產生的特定隱私風險指標 DLT，以及下游 LLM 任務的效能評估指標 LLE。我們的實驗發現，此表格資料產生框架在具有更好隱私性的情況下，達到了與現有方法相當的效能，這也證明了我們評估框架在 LLM 場景中合成資料和隱私風險的有效性。</paragraph>", "author": "Yuxin Wang et.al.", "authors": "Yuxin Wang, Duanyu Feng, Yongfu Dai, Zhengyu Chen, Jimin Huang, Sophia Ananiadou, Qianqian Xie, Hao Wang", "id": "2408.02927v1", "paper_url": "http://arxiv.org/abs/2408.02927v1", "repo": "null"}}