{"2405.11880": {"publish_time": "2024-05-20", "title": "Quantifying In-Context Reasoning Effects and Memorization Effects in LLMs", "paper_summary": "In this study, we propose an axiomatic system to define and quantify the\nprecise memorization and in-context reasoning effects used by the large\nlanguage model (LLM) for language generation. These effects are formulated as\nnon-linear interactions between tokens/words encoded by the LLM. Specifically,\nthe axiomatic system enables us to categorize the memorization effects into\nfoundational memorization effects and chaotic memorization effects, and further\nclassify in-context reasoning effects into enhanced inference patterns,\neliminated inference patterns, and reversed inference patterns. Besides, the\ndecomposed effects satisfy the sparsity property and the universal matching\nproperty, which mathematically guarantee that the LLM's confidence score can be\nfaithfully decomposed into the memorization effects and in-context reasoning\neffects. Experiments show that the clear disentanglement of memorization\neffects and in-context reasoning effects enables a straightforward examination\nof detailed inference patterns encoded by LLMs.", "paper_summary_zh": "在本研究中，我們提出一個公理系統，用來定義和量化大型語言模型 (LLM) 用於語言生成的精確記憶和語境推理效果。這些效果被表述為 LLM 編碼的記號/字詞之間的非線性交互。具體來說，公理系統使我們能夠將記憶效果分類為基礎記憶效果和混亂記憶效果，並進一步將語境推理效果分類為增強推理模式、消除推理模式和反向推理模式。此外，分解的效果滿足稀疏性屬性和通用匹配屬性，這在數學上保證了 LLM 的置信度分數可以忠實地分解為記憶效果和語境推理效果。實驗表明，記憶效果和語境推理效果的清楚區分，能夠對 LLM 編碼的詳細推理模式進行直接檢查。", "author": "Siyu Lou et.al.", "authors": "Siyu Lou, Yuntian Chen, Xiaodan Liang, Liang Lin, Quanshi Zhang", "id": "2405.11880v1", "paper_url": "http://arxiv.org/abs/2405.11880v1", "repo": "null"}}