{"2407.12730": {"publish_time": "2024-07-17", "title": "RoDE: Linear Rectified Mixture of Diverse Experts for Food Large Multi-Modal Models", "paper_summary": "Large Multi-modal Models (LMMs) have significantly advanced a variety of\nvision-language tasks. The scalability and availability of high-quality\ntraining data play a pivotal role in the success of LMMs. In the realm of food,\nwhile comprehensive food datasets such as Recipe1M offer an abundance of\ningredient and recipe information, they often fall short of providing ample\ndata for nutritional analysis. The Recipe1M+ dataset, despite offering a subset\nfor nutritional evaluation, is limited in the scale and accuracy of nutrition\ninformation. To bridge this gap, we introduce Uni-Food, a unified food dataset\nthat comprises over 100,000 images with various food labels, including\ncategories, ingredients, recipes, and ingredient-level nutritional information.\nUni-Food is designed to provide a more holistic approach to food data analysis,\nthereby enhancing the performance and capabilities of LMMs in this domain. To\nmitigate the conflicts arising from multi-task supervision during fine-tuning\nof LMMs, we introduce a novel Linear Rectification Mixture of Diverse Experts\n(RoDE) approach. RoDE utilizes a diverse array of experts to address tasks of\nvarying complexity, thereby facilitating the coordination of trainable\nparameters, i.e., it allocates more parameters for more complex tasks and,\nconversely, fewer parameters for simpler tasks. RoDE implements linear\nrectification union to refine the router's functionality, thereby enhancing the\nefficiency of sparse task allocation. These design choices endow RoDE with\nfeatures that ensure GPU memory efficiency and ease of optimization. Our\nexperimental results validate the effectiveness of our proposed approach in\naddressing the inherent challenges of food-related multitasking.", "paper_summary_zh": "大型多模态模型 (LMM) 在各种视觉语言任务中取得了重大进展。可扩展性和高质量训练数据的可用性在 LMM 的成功中发挥着至关重要的作用。在食品领域，虽然 Recipe1M 等全面的食品数据集提供了丰富的成分和食谱信息，但它们往往无法为营养分析提供足够的数据。Recipe1M+ 数据集虽然提供了一个用于营养评估的子集，但其营养信息的规模和准确性受到限制。为了弥合这一差距，我们引入了 Uni-Food，这是一个统一的食品数据集，包含超过 100,000 张带有各种食品标签的图像，包括类别、成分、食谱和成分级别的营养信息。Uni-Food 旨在为食品数据分析提供一种更全面的方法，从而增强 LMM 在该领域的性能和能力。为了减轻在 LMM 微调过程中多任务监督所产生的冲突，我们引入了一种新颖的线性校正多元专家 (RoDE) 方法。RoDE 利用各种专家来解决不同复杂程度的任务，从而促进可训练参数的协调，即为更复杂的任务分配更多参数，反之，为更简单的任务分配更少参数。RoDE 实施线性校正联合来优化路由器的功能，从而提高稀疏任务分配的效率。这些设计选择赋予 RoDE 确保 GPU 内存效率和易于优化的特性。我们的实验结果验证了我们提出的方法在解决与食品相关的多任务处理固有挑战方面的有效性。", "author": "Pengkun Jiao et.al.", "authors": "Pengkun Jiao, Xinlan Wu, Bin Zhu, Jingjing Chen, Chong-Wah Ngo, Yugang Jiang", "id": "2407.12730v1", "paper_url": "http://arxiv.org/abs/2407.12730v1", "repo": "null"}}