{"2410.04691": {"publish_time": "2024-10-07", "title": "Deeper Insights Without Updates: The Power of In-Context Learning Over Fine-Tuning", "paper_summary": "Fine-tuning and in-context learning (ICL) are two prevalent methods in\nimbuing large language models with task-specific knowledge. It is commonly\nbelieved that fine-tuning can surpass ICL given sufficient training samples as\nit allows the model to adjust its internal parameters based on the data.\nHowever, this paper presents a counterintuitive finding: For tasks with\nimplicit patterns, ICL captures these patterns significantly better than\nfine-tuning. We developed several datasets featuring implicit patterns, such as\nsequences determining answers through parity or identifying reducible terms in\ncalculations. We then evaluated the models' understanding of these patterns\nunder both fine-tuning and ICL across models ranging from 0.5B to 7B\nparameters. The results indicate that models employing ICL can quickly grasp\ndeep patterns and significantly improve accuracy. In contrast, fine-tuning,\ndespite utilizing thousands of times more training samples than ICL, achieved\nonly limited improvements. We also proposed circuit shift theory from a\nmechanistic interpretability's view to explain why ICL wins.", "paper_summary_zh": "微调和情境学习 (ICL) 是两种普遍用于赋予大型语言模型任务特定知识的方法。人们普遍认为，微调可以通过足够的训练样本超越 ICL，因为它允许模型根据数据调整其内部参数。然而，本文提出了一个反直觉的发现：对于具有隐式模式的任务，ICL 捕捉这些模式明显优于微调。我们开发了几个具有隐式模式的数据集，例如通过奇偶性确定答案或识别计算中可约项的序列。然后，我们评估了模型在从 0.5B 到 7B 参数的各种模型中对这些模式的理解，包括微调和 ICL。结果表明，采用 ICL 的模型可以快速掌握深度模式并显着提高准确性。相比之下，微调尽管使用了比 ICL 多数千倍的训练样本，但仅取得了有限的改进。我们还从机制可解释性的角度提出了电路转换理论，以解释 ICL 获胜的原因。", "author": "Qingyu Yin et.al.", "authors": "Qingyu Yin, Xuzheng He, Luoao Deng, Chak Tou Leong, Fan Wang, Yanzhao Yan, Xiaoyu Shen, Qiang Zhang", "id": "2410.04691v1", "paper_url": "http://arxiv.org/abs/2410.04691v1", "repo": "null"}}