{"2405.17358": {"publish_time": "2024-05-27", "title": "Rethinking Transformers in Solving POMDPs", "paper_summary": "Sequential decision-making algorithms such as reinforcement learning (RL) in\nreal-world scenarios inevitably face environments with partial observability.\nThis paper scrutinizes the effectiveness of a popular architecture, namely\nTransformers, in Partially Observable Markov Decision Processes (POMDPs) and\nreveals its theoretical limitations. We establish that regular languages, which\nTransformers struggle to model, are reducible to POMDPs. This poses a\nsignificant challenge for Transformers in learning POMDP-specific inductive\nbiases, due to their lack of inherent recurrence found in other models like\nRNNs. This paper casts doubt on the prevalent belief in Transformers as\nsequence models for RL and proposes to introduce a point-wise recurrent\nstructure. The Deep Linear Recurrent Unit (LRU) emerges as a well-suited\nalternative for Partially Observable RL, with empirical results highlighting\nthe sub-optimal performance of the Transformer and considerable strength of\nLRU.", "paper_summary_zh": "在現實世界的場景中，諸如強化學習 (RL) 等順序決策演算法不可避免地面臨具有部分可觀察性的環境。本文審視了在部分可觀察馬可夫決策過程 (POMDP) 中一種流行的架構，即 Transformer 的有效性，並揭示其理論限制。我們建立了 Transformer 難以建模的正則語言可簡化為 POMDP。由於 Transformer 缺乏在其他模型（如 RNN）中發現的固有遞迴，因此這對 Transformer 在學習 POMDP 特定的歸納偏差方面構成重大挑戰。本文對 Transformer 作為 RL 的序列模型普遍存在的信念提出質疑，並建議引入點狀遞迴結構。深度線性遞迴單元 (LRU) 成為部分可觀察 RL 的合適替代方案，實證結果突顯了 Transformer 的次優性能和 LRU 的顯著優勢。", "author": "Chenhao Lu et.al.", "authors": "Chenhao Lu, Ruizhe Shi, Yuyao Liu, Kaizhe Hu, Simon S. Du, Huazhe Xu", "id": "2405.17358v1", "paper_url": "http://arxiv.org/abs/2405.17358v1", "repo": "https://github.com/ctp314/tfporl"}}