{"2407.21149": {"publish_time": "2024-07-30", "title": "Domain Shift Analysis in Chest Radiographs Classification in a Veterans Healthcare Administration Population", "paper_summary": "Objectives: This study aims to assess the impact of domain shift on chest\nX-ray classification accuracy and to analyze the influence of ground truth\nlabel quality and demographic factors such as age group, sex, and study year.\nMaterials and Methods: We used a DenseNet121 model pretrained MIMIC-CXR dataset\nfor deep learning-based multilabel classification using ground truth labels\nfrom radiology reports extracted using the CheXpert and CheXbert Labeler. We\ncompared the performance of the 14 chest X-ray labels on the MIMIC-CXR and\nVeterans Healthcare Administration chest X-ray dataset (VA-CXR). The VA-CXR\ndataset comprises over 259k chest X-ray images spanning between the years 2010\nand 2022. Results: The validation of ground truth and the assessment of\nmulti-label classification performance across various NLP extraction tools\nrevealed that the VA-CXR dataset exhibited lower disagreement rates than the\nMIMIC-CXR datasets. Additionally, there were notable differences in AUC scores\nbetween models utilizing CheXpert and CheXbert. When evaluating multi-label\nclassification performance across different datasets, minimal domain shift was\nobserved in unseen datasets, except for the label \"Enlarged Cardiomediastinum.\"\nThe study year's subgroup analyses exhibited the most significant variations in\nmulti-label classification model performance. These findings underscore the\nimportance of considering domain shifts in chest X-ray classification tasks,\nparticularly concerning study years. Conclusion: Our study reveals the\nsignificant impact of domain shift and demographic factors on chest X-ray\nclassification, emphasizing the need for improved transfer learning and\nequitable model development. Addressing these challenges is crucial for\nadvancing medical imaging and enhancing patient care.", "paper_summary_zh": "<paragraph>目標：本研究旨在評估領域轉移對胸部 X 光分類精度的影響，並分析基本事實標籤品質和年齡組、性別和研究年份等人口因素的影響。\n材料和方法：我們使用 DenseNet121 模型預訓練 MIMIC-CXR 資料集，使用從使用 CheXpert 和 CheXbert 標籤器從放射科報告中提取的基本事實標籤進行基於深度學習的多標籤分類。我們比較了 MIMIC-CXR 和退伍軍人健康管理局胸部 X 光資料集 (VA-CXR) 上 14 個胸部 X 光標籤的性能。VA-CXR 資料集包含超過 259k 張胸部 X 光影像，時間跨度為 2010 年至 2022 年。結果：基本事實的驗證和對各種 NLP 提取工具的多標籤分類性能的評估顯示，VA-CXR 資料集表現出的分歧率低於 MIMIC-CXR 資料集。此外，使用 CheXpert 和 CheXbert 的模型之間的 AUC 得分存在顯著差異。在評估不同資料集上的多標籤分類性能時，除了標籤「心縱隔增大」之外，在未見資料集中觀察到的領域轉移很小。研究年份的子群分析顯示，多標籤分類模型性能變化最大。這些發現強調了在胸部 X 光分類任務中考慮領域轉移的重要性，特別是關於研究年份。結論：我們的研究揭示了領域轉移和人口因素對胸部 X 光分類的顯著影響，強調了改進遷移學習和公平模型開發的必要性。應對這些挑戰對於推進醫學影像和加強患者護理至關重要。</paragraph>", "author": "Mayanka Chandrashekar et.al.", "authors": "Mayanka Chandrashekar, Ian Goethert, Md Inzamam Ul Haque, Benjamin McMahon, Sayera Dhaubhadel, Kathryn Knight, Joseph Erdos, Donna Reagan, Caroline Taylor, Peter Kuzmak, John Michael Gaziano, Eileen McAllister, Lauren Costa, Yuk-Lam Ho, Kelly Cho, Suzanne Tamang, Samah Fodeh-Jarad, Olga S. Ovchinnikova, Amy C. Justice, Jacob Hinkle, Ioana Danciu", "id": "2407.21149v1", "paper_url": "http://arxiv.org/abs/2407.21149v1", "repo": "null"}}