{"2405.15329": {"publish_time": "2024-05-24", "title": "Decompose and Aggregate: A Step-by-Step Interpretable Evaluation Framework", "paper_summary": "The acceleration of Large Language Models (LLMs) research has opened up new\npossibilities for evaluating generated texts. They serve as scalable and\neconomical evaluators, but the question of how reliable these evaluators are\nhas emerged as a crucial research question. Prior research efforts in the\nmeta-evaluation of LLMs as judges limit the prompting of an LLM to a single use\nto obtain a final evaluation decision. They then compute the agreement between\nLLMs' outputs and human labels. This lacks interpretability in understanding\nthe evaluation capability of LLMs. In light of this challenge, we propose\nDecompose and Aggregate, which breaks down the evaluation process into\ndifferent stages based on pedagogical practices. Our experiments illustrate\nthat it not only provides a more interpretable window for how well LLMs\nevaluate, but also leads to improvements up to 39.6% for different LLMs on a\nvariety of meta-evaluation benchmarks.", "paper_summary_zh": "大型語言模型 (LLM) 研究的加速為評估生成的文字開啟了新的可能性。它們作為可擴充且經濟的評估器，但這些評估器有多可靠的問題已成為一項重要的研究課題。先前針對 LLM 作為評審進行元評估的研究工作，將 LLM 的提示限制為單一用途，以取得最終的評估決定。接著，他們計算 LLM 的輸出與人類標籤之間的一致性。這在理解 LLM 的評估能力方面缺乏可解釋性。有鑑於此挑戰，我們提出分解與彙總，它根據教學實務將評估流程分解為不同的階段。我們的實驗說明，它不僅為 LLM 的評估表現提供了更具可解釋性的視窗，還讓不同 LLM 在各種元評估基準上獲得高達 39.6% 的進步。", "author": "Minzhi Li et.al.", "authors": "Minzhi Li, Zhengyuan Liu, Shumin Deng, Shafiq Joty, Nancy F. Chen, Min-Yen Kan", "id": "2405.15329v1", "paper_url": "http://arxiv.org/abs/2405.15329v1", "repo": "null"}}