{"2405.18415": {"publish_time": "2024-05-28", "title": "Why are Visually-Grounded Language Models Bad at Image Classification?", "paper_summary": "Image classification is one of the most fundamental capabilities of machine\nvision intelligence. In this work, we revisit the image classification task\nusing visually-grounded language models (VLMs) such as GPT-4V and LLaVA. We\nfind that existing proprietary and public VLMs, despite often using CLIP as a\nvision encoder and having many more parameters, significantly underperform CLIP\non standard image classification benchmarks like ImageNet. To understand the\nreason, we explore several hypotheses concerning the inference algorithms,\ntraining objectives, and data processing in VLMs. Our analysis reveals that the\nprimary cause is data-related: critical information for image classification is\nencoded in the VLM's latent space but can only be effectively decoded with\nenough training data. Specifically, there is a strong correlation between the\nfrequency of class exposure during VLM training and instruction-tuning and the\nVLM's performance in those classes; when trained with sufficient data, VLMs can\nmatch the accuracy of state-of-the-art classification models. Based on these\nfindings, we enhance a VLM by integrating classification-focused datasets into\nits training, and demonstrate that the enhanced classification performance of\nthe VLM transfers to its general capabilities, resulting in an improvement of\n11.8% on the newly collected ImageWikiQA dataset.", "paper_summary_zh": "影像分類是機器視覺智能最基本的技能之一。在這項工作中，我們使用視覺基礎語言模型（VLM），例如 GPT-4V 和 LLaVA，重新探討影像分類任務。我們發現現有的專有和公開 VLM，儘管經常使用 CLIP 作為視覺編碼器，且具有更多參數，但在 ImageNet 等標準影像分類基準上卻明顯不如 CLIP。為了了解原因，我們探討了關於 VLM 中的推論演算法、訓練目標和資料處理的幾個假設。我們的分析顯示，主要原因與資料有關：影像分類的關鍵資訊編碼在 VLM 的潛在空間中，但只有在有足夠的訓練資料時才能有效解碼。具體來說，VLM 訓練期間類別曝光的頻率與指令微調，以及 VLM 在這些類別中的表現之間存在很強的相關性；當使用足夠的資料訓練時，VLM 可以達到最先進分類模型的準確度。根據這些發現，我們透過將以分類為重點的資料集整合到訓練中來增強 VLM，並證明 VLM 增強的分類效能轉移到其一般能力，進而使新收集的 ImageWikiQA 資料集提升了 11.8%。", "author": "Yuhui Zhang et.al.", "authors": "Yuhui Zhang, Alyssa Unell, Xiaohan Wang, Dhruba Ghosh, Yuchang Su, Ludwig Schmidt, Serena Yeung-Levy", "id": "2405.18415v1", "paper_url": "http://arxiv.org/abs/2405.18415v1", "repo": "https://github.com/yuhui-zh15/vlmclassifier"}}