{"2406.16851": {"publish_time": "2024-06-24", "title": "Losing Visual Needles in Image Haystacks: Vision Language Models are Easily Distracted in Short and Long Contexts", "paper_summary": "We present LoCoVQA, a dynamic benchmark generator for evaluating long-context\nextractive reasoning in vision language models (VLMs). LoCoVQA augments test\nexamples for mathematical reasoning, VQA, and character recognition tasks with\nincreasingly long visual contexts composed of both in-distribution and\nout-of-distribution distractor images.\n  Across these tasks, a diverse set of VLMs rapidly lose performance as the\nvisual context length grows, often exhibiting a striking exponential decay\ntrend. This test assesses how well VLMs can ignore irrelevant information when\nanswering queries -- a task that is quite easy for language models (LMs) in the\ntext domain -- demonstrating that current state-of-the-art VLMs lack this\nessential capability for many long-context applications.", "paper_summary_zh": "我們提出 LoCoVQA，一個用於評估視覺語言模型 (VLM) 中的長語境抽取式推理的動態基準生成器。LoCoVQA 擴充了數學推理、VQA 和字元辨識任務的測試範例，其中包含越來越長的視覺語境，由分佈內和分佈外干擾影像組成。\n在這些任務中，隨著視覺語境長度的增加，各種 VLM 的效能快速下降，通常表現出顯著的指數衰減趨勢。此測試評估 VLM 在回答查詢時忽略無關資訊的能力，這項任務對於文字領域的語言模型 (LM) 來說相當容易，這表示目前的最新 VLM 缺乏許多長語境應用所需的這項基本能力。", "author": "Aditya Sharma et.al.", "authors": "Aditya Sharma, Michael Saxon, William Yang Wang", "id": "2406.16851v1", "paper_url": "http://arxiv.org/abs/2406.16851v1", "repo": "null"}}