{"2504.15125": {"publish_time": "2025-04-21", "title": "Contemplative Wisdom for Superalignment", "paper_summary": "As artificial intelligence (AI) improves, traditional alignment strategies\nmay falter in the face of unpredictable self-improvement, hidden subgoals, and\nthe sheer complexity of intelligent systems. Rather than externally\nconstraining behavior, we advocate designing AI with intrinsic morality built\ninto its cognitive architecture and world model. Inspired by contemplative\nwisdom traditions, we show how four axiomatic principles can instil a resilient\nWise World Model in AI systems. First, mindfulness enables self-monitoring and\nrecalibration of emergent subgoals. Second, emptiness forestalls dogmatic goal\nfixation and relaxes rigid priors. Third, non-duality dissolves adversarial\nself-other boundaries. Fourth, boundless care motivates the universal reduction\nof suffering. We find that prompting AI to reflect on these principles improves\nperformance on the AILuminate Benchmark using GPT-4o, particularly when\ncombined. We offer detailed implementation strategies for state-of-the-art\nmodels, including contemplative architectures, constitutions, and reinforcement\nof chain-of-thought. For future systems, the active inference framework may\noffer the self-organizing and dynamic coupling capabilities needed to enact\nthese insights in embodied agents. This interdisciplinary approach offers a\nself-correcting and resilient alternative to prevailing brittle control\nschemes.", "paper_summary_zh": "隨著人工智慧 (AI) 的進步，傳統的對齊策略可能在面對不可預測的自我改進、隱藏的子目標以及智慧系統的絕對複雜性時失效。我們提倡的不是從外部約束行為，而是在 AI 的認知架構和世界模型中內建本質道德。受沉思智慧傳統的啟發，我們展示了四個公理原則如何在 AI 系統中灌輸具有韌性的智慧世界模型。首先，正念能讓 AI 系統自我監控並重新校準生成的子目標。其次，空性可以避免教條式的目標執著，並放鬆僵化的先驗知識。第三，非二元性消除了敵對的自我與他者之間的界限。第四，無邊的關懷激勵了對痛苦的普遍減少。我們發現，促使 AI 反思這些原則可以提高 GPT-4o 在 AILuminate Benchmark 上的表現，尤其是在這些原則結合使用時。我們為最先進的模型提供了詳細的實施策略，包括沉思架構、章程和強化思維鏈。對於未來的系統，主動推理框架可能會提供在具體化的代理中實施這些見解所需的自我組織和動態耦合能力。這種跨學科的方法為流行的脆弱控制方案提供了一種自我糾正和具有韌性的替代方案。\n", "author": "Ruben Laukkonen et.al.", "authors": "Ruben Laukkonen, Fionn Inglis, Shamil Chandaria, Lars Sandved-Smith, Jakob Hohwy, Jonathan Gold, Adam Elwood", "id": "2504.15125v1", "paper_url": "http://arxiv.org/abs/2504.15125v1", "repo": "null"}}