{"2408.06527": {"publish_time": "2024-08-12", "title": "Chain-of-Strategy Planning with LLMs: Aligning the Generation of Psychotherapy Dialogue with Strategy in Motivational Interviewing", "paper_summary": "Recent advancements in large language models (LLMs) have shown promise in\ngenerating psychotherapeutic dialogues, especially in Motivational Interviewing\n(MI). However, how to employ strategies, a set of motivational interviewing\n(MI) skills, to generate therapeutic-adherent conversations with explainability\nis underexplored. We propose an approach called strategy-aware dialogue\ngeneration with Chain-of-Strategy (CoS) planning, which first predicts MI\nstrategies as reasoning and utilizes these strategies to guide the subsequent\ndialogue generation. It brings the potential for controllable and explainable\ngeneration in psychotherapy by aligning the generated MI dialogues with\ntherapeutic strategies. Extensive experiments including automatic and human\nevaluations are conducted to validate the effectiveness of the MI strategy. Our\nfindings demonstrate the potential of LLMs in producing strategically aligned\ndialogues and suggest directions for practical applications in\npsychotherapeutic settings.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展已顯示出在產生心理治療對話方面的前景，特別是在動機性訪談 (MI) 中。然而，如何運用策略（一組動機性訪談 (MI) 技能）來產生具有解釋性的治療性對話尚未得到充分探討。我們提出了一種稱為策略感知對話生成的方法，採用策略鏈 (CoS) 規劃，該方法首先預測 MI 策略作為推理，並利用這些策略來指導後續的對話生成。它通過將生成的 MI 對話與治療策略保持一致，帶來了心理治療中可控且可解釋的生成潛力。進行了包括自動和人工評估在內的廣泛實驗，以驗證 MI 策略的有效性。我們的研究結果證明了 LLM 在產生策略一致對話方面的潛力，並提出了心理治療環境中實際應用的方向。", "author": "Xin Sun et.al.", "authors": "Xin Sun, Xiao Tang, Abdallah El Ali, Zhuying Li, Xiaoyu Shen, Pengjie Ren, Jan de Wit, Jiahuan Pei, Jos A. Bosch", "id": "2408.06527v1", "paper_url": "http://arxiv.org/abs/2408.06527v1", "repo": "null"}}