{"2409.15915": {"publish_time": "2024-09-24", "title": "Planning in the Dark: LLM-Symbolic Planning Pipeline without Experts", "paper_summary": "Large Language Models (LLMs) have shown promise in solving natural\nlanguage-described planning tasks, but their direct use often leads to\ninconsistent reasoning and hallucination. While hybrid LLM-symbolic planning\npipelines have emerged as a more robust alternative, they typically require\nextensive expert intervention to refine and validate generated action schemas.\nIt not only limits scalability but also introduces a potential for biased\ninterpretation, as a single expert's interpretation of ambiguous natural\nlanguage descriptions might not align with the user's actual intent. To address\nthis, we propose a novel approach that constructs an action schema library to\ngenerate multiple candidates, accounting for the diverse possible\ninterpretations of natural language descriptions. We further introduce a\nsemantic validation and ranking module that automatically filter and rank the\ngenerated schemas and plans without expert-in-the-loop. The experiments showed\nour pipeline maintains superiority in planning over the direct LLM planning\napproach. These findings demonstrate the feasibility of a fully automated\nend-to-end LLM-symbolic planner that requires no expert intervention, opening\nup the possibility for a broader audience to engage with AI planning with less\nprerequisite of domain expertise.", "paper_summary_zh": "大型語言模型 (LLM) 在解決自然語言描述的規劃任務方面展現了前景，但其直接使用通常會導致不一致的推理和幻覺。雖然混合 LLM-符號規劃管道已成為一種更強健的替代方案，但它們通常需要廣泛的專家介入來優化和驗證產生的動作綱要。這不僅限制了可擴充性，還引入了偏差解釋的可能性，因為單一專家對模棱兩可的自然語言描述的解釋可能與使用者的實際意圖不符。為了解決這個問題，我們提出了一種新穎的方法，該方法構建了一個動作綱要庫，以產生多個候選者，並考慮自然語言描述的各種可能解釋。我們進一步引入了一個語義驗證和排名模組，該模組自動過濾和排名產生的綱要和計畫，而無需專家參與。實驗表明，我們的管道在規劃中保持了優於直接 LLM 規劃方法的優勢。這些發現證明了完全自動化的端到端 LLM-符號規劃器的可行性，該規劃器不需要專家介入，這為更廣泛的受眾參與 AI 規劃提供了可能性，而無需具備領域專業知識的先決條件。", "author": "Sukai Huang et.al.", "authors": "Sukai Huang, Nir Lipovetzky, Trevor Cohn", "id": "2409.15915v1", "paper_url": "http://arxiv.org/abs/2409.15915v1", "repo": "null"}}