{"2405.17139": {"publish_time": "2024-05-27", "title": "Synergy and Diversity in CLIP: Enhancing Performance Through Adaptive Backbone Ensembling", "paper_summary": "Contrastive Language-Image Pretraining (CLIP) stands out as a prominent\nmethod for image representation learning. Various architectures, from vision\ntransformers (ViTs) to convolutional networks (ResNets) have been trained with\nCLIP to serve as general solutions to diverse vision tasks. This paper explores\nthe differences across various CLIP-trained vision backbones. Despite using the\nsame data and training objective, we find that these architectures have notably\ndifferent representations, different classification performance across\ndatasets, and different robustness properties to certain types of image\nperturbations. Our findings indicate a remarkable possible synergy across\nbackbones by leveraging their respective strengths. In principle,\nclassification accuracy could be improved by over 40 percentage with an\ninformed selection of the optimal backbone per test example.Using this insight,\nwe develop a straightforward yet powerful approach to adaptively ensemble\nmultiple backbones. The approach uses as few as one labeled example per class\nto tune the adaptive combination of backbones. On a large collection of\ndatasets, the method achieves a remarkable increase in accuracy of up to 39.1%\nover the best single backbone, well beyond traditional ensembles", "paper_summary_zh": "對比語言影像預訓練 (CLIP) 作為影像表徵學習的顯著方法而備受矚目。從視覺轉換器 (ViT) 到卷積網路 (ResNet) 等各種架構都已針對 CLIP 進行訓練，以作為解決各種視覺任務的通用方案。本文探討各種 CLIP 訓練視覺主幹的差異。儘管使用相同的資料和訓練目標，我們發現這些架構具有顯著不同的表徵、在不同資料集上的不同分類效能，以及對特定類型影像擾動的不同穩健性。我們的研究結果表明，透過利用各自的優勢，主幹之間有顯著的可能協同效應。原則上，透過明智地針對每個測試範例選擇最佳主幹，可以將分類準確度提升 40% 以上。利用此洞見，我們開發出一種直接但強大的方法來適應性地整合多個主幹。此方法每類別使用少至一個標籤範例來調整主幹的適應性組合。在大量資料集上，此方法的準確度顯著提升，比最佳單一主幹高出 39.1%，遠遠超過傳統的整合", "author": "Cristian Rodriguez-Opazo et.al.", "authors": "Cristian Rodriguez-Opazo, Ehsan Abbasnejad, Damien Teney, Edison Marrese-Taylor, Hamed Damirchi, Anton van den Hengel", "id": "2405.17139v1", "paper_url": "http://arxiv.org/abs/2405.17139v1", "repo": "null"}}