{"2504.06987": {"publish_time": "2025-04-09", "title": "Enhancing Metabolic Syndrome Prediction with Hybrid Data Balancing and Counterfactuals", "paper_summary": "Metabolic Syndrome (MetS) is a cluster of interrelated risk factors that\nsignificantly increases the risk of cardiovascular diseases and type 2\ndiabetes. Despite its global prevalence, accurate prediction of MetS remains\nchallenging due to issues such as class imbalance, data scarcity, and\nmethodological inconsistencies in existing studies. In this paper, we address\nthese challenges by systematically evaluating and optimizing machine learning\n(ML) models for MetS prediction, leveraging advanced data balancing techniques\nand counterfactual analysis. Multiple ML models, including XGBoost, Random\nForest, TabNet, etc., were trained and compared under various data balancing\ntechniques such as random oversampling (ROS), SMOTE, ADASYN, and CTGAN.\nAdditionally, we introduce MetaBoost, a novel hybrid framework that integrates\nSMOTE, ADASYN, and CTGAN, optimizing synthetic data generation through weighted\naveraging and iterative weight tuning to enhance the model's performance\n(achieving a 1.14% accuracy improvement over individual balancing techniques).\nA comprehensive counterfactual analysis is conducted to quantify feature-level\nchanges required to shift individuals from high-risk to low-risk categories.\nThe results indicate that blood glucose (50.3%) and triglycerides (46.7%) were\nthe most frequently modified features, highlighting their clinical significance\nin MetS risk reduction. Additionally, probabilistic analysis shows elevated\nblood glucose (85.5% likelihood) and triglycerides (74.9% posterior\nprobability) as the strongest predictors. This study not only advances the\nmethodological rigor of MetS prediction but also provides actionable insights\nfor clinicians and researchers, highlighting the potential of ML in mitigating\nthe public health burden of metabolic syndrome.", "paper_summary_zh": "<paragraph>代謝症候群 (MetS) 是一組相互關聯的危險因子，會顯著增加心血管疾病和第 2 型糖尿病的風險。儘管代謝症候群在全球普遍存在，但由於現有研究中存在類別不平衡、數據稀缺和方法不一致等問題，準確預測代謝症候群仍然具有挑戰性。在本文中，我們透過系統地評估和優化用於預測代謝症候群的機器學習 (ML) 模型，並利用先進的數據平衡技術和反事實分析來應對這些挑戰。我們在各種數據平衡技術（例如隨機過採樣 (ROS)、SMOTE、ADASYN 和 CTGAN）下訓練和比較了多種機器學習模型，包括 XGBoost、隨機森林、TabNet 等。此外，我們還介紹了 MetaBoost，這是一種整合了 SMOTE、ADASYN 和 CTGAN 的新型混合框架，它透過加權平均和迭代權重調整來優化合成數據生成，從而提高模型的性能（準確度比單個平衡技術提高了 1.14%）。我們進行了全面的反事實分析，以量化將個人從高風險類別轉移到低風險類別所需的特徵級別變化。結果表明，血糖 (50.3%) 和三酸甘油酯 (46.7%) 是最常被修改的特徵，突顯了它們在降低代謝症候群風險方面的臨床意義。此外，概率分析顯示，血糖升高（可能性為 85.5%）和三酸甘油酯（後驗概率為 74.9%）是最強的預測指標。這項研究不僅提高了代謝症候群預測的方法學嚴謹性，還為臨床醫生和研究人員提供了可操作的見解，突顯了機器學習在減輕代謝症候群的公共衛生負擔方面的潛力。</paragraph>\n", "author": "Sanyam Paresh Shah et.al.", "authors": "Sanyam Paresh Shah, Abdullah Mamun, Shovito Barua Soumma, Hassan Ghasemzadeh", "id": "2504.06987v1", "paper_url": "http://arxiv.org/abs/2504.06987v1", "repo": "null"}}