{"2502.11770": {"publish_time": "2025-02-17", "title": "Cognitive-Aligned Document Selection for Retrieval-augmented Generation", "paper_summary": "Large language models (LLMs) inherently display hallucinations since the\nprecision of generated texts cannot be guaranteed purely by the parametric\nknowledge they include. Although retrieval-augmented generation (RAG) systems\nenhance the accuracy and reliability of generative models by incorporating\nexternal documents, these retrieved documents often fail to adequately support\nthe model's responses in practical applications. To address this issue, we\npropose GGatrieval (Fine-\\textbf{G}rained \\textbf{G}rounded \\textbf{A}lignment\nRe\\textbf{trieval} for verifiable generation), which leverages an LLM to\ndynamically update queries and filter high-quality, reliable retrieval\ndocuments. Specifically, we parse the user query into its syntactic components\nand perform fine-grained grounded alignment with the retrieved documents. For\nquery components that cannot be individually aligned, we propose a dynamic\nsemantic compensation mechanism that iteratively refines and rewrites the query\nwhile continuously updating the retrieval results. This iterative process\ncontinues until the retrieved documents sufficiently support the query's\nresponse. Our approach introduces a novel criterion for filtering retrieved\ndocuments, closely emulating human strategies for acquiring targeted\ninformation. This ensures that the retrieved content effectively supports and\nverifies the generated outputs. On the ALCE benchmark, our method significantly\nsurpasses a wide range of baselines, achieving state-of-the-art performance.", "paper_summary_zh": "大型語言模型 (LLM) 本質上會出現幻覺，因為生成的文本的準確性無法僅透過它們包含的參數化知識來保證。儘管檢索增強生成 (RAG) 系統透過納入外部文件來提升生成模型的準確性和可靠性，但這些檢索的文件在實際應用中常常無法充分支援模型的回應。為了解決這個問題，我們提出 GGatrieval（用於可驗證生成的精細化粒度化基礎對齊檢索），它利用 LLM 來動態更新查詢並過濾高品質、可靠的檢索文件。具體來說，我們將使用者查詢分析成其語法組成部分，並對檢索文件執行精細化粒度化基礎對齊。對於無法個別對齊的查詢組成部分，我們提出一個動態語義補償機制，在持續更新檢索結果的同時，反覆修正和重寫查詢。這個反覆的程序會持續到檢索的文件充分支援查詢的回應為止。我們的做法引進了一個新的檢索文件過濾標準，嚴密地模擬人類獲取目標資訊的策略。這確保檢索的內容有效地支援和驗證生成的輸出。在 ALCE 基準測試中，我們的做法顯著超越各種基線，達成最先進的效能。", "author": "Bingyu Wan et.al.", "authors": "Bingyu Wan, Fuxi Zhang, Zhongpeng Qi, Jiayi Ding, Jijun Li, Baoshi Fan, Yijia Zhang, Jun Zhang", "id": "2502.11770v1", "paper_url": "http://arxiv.org/abs/2502.11770v1", "repo": "null"}}