{"2410.13780": {"publish_time": "2024-10-17", "title": "Optimal Quantization for Matrix Multiplication", "paper_summary": "Recent work in machine learning community proposed multiple methods for\nperforming lossy compression (quantization) of large matrices. This\nquantization is important for accelerating matrix multiplication (main\ncomponent of large language models), which is often bottlenecked by the speed\nof loading these matrices from memory. Unlike classical vector quantization and\nrate-distortion theory, the goal of these new compression algorithms is to be\nable to approximate not the matrices themselves, but their matrix product.\nSpecifically, given a pair of real matrices $A,B$ an encoder (compressor) is\napplied to each of them independently producing descriptions with $R$ bits per\nentry. These representations subsequently are used by the decoder to estimate\nmatrix product $A^\\top B$. In this work, we provide a non-asymptotic lower\nbound on the mean squared error of this approximation (as a function of rate\n$R$) for the case of matrices $A,B$ with iid Gaussian entries. Algorithmically,\nwe construct a universal quantizer based on nested lattices with an explicit\nguarantee of approximation error for any (non-random) pair of matrices $A$, $B$\nin terms of only Frobenius norms $\\|A\\|_F, \\|B\\|_F$ and $\\|A^\\top B\\|_F$. For\niid Gaussian matrices our quantizer achieves the lower bound and is, thus,\nasymptotically optimal. A practical low-complexity version of our quantizer\nachieves performance quite close to optimal. In information-theoretic terms we\nderive rate-distortion function for matrix multiplication of iid Gaussian\nmatrices.", "paper_summary_zh": "機器學習社群最近提出的多種方法，用於執行大型矩陣的失真壓縮（量化）。此量化對於加速矩陣乘法（大型語言模型的主要組成部分）很重要，而矩陣乘法通常會受到從記憶體載入這些矩陣的速度限制。與經典向量量化和率失真理論不同，這些新壓縮演算法的目標並非近似矩陣本身，而是近似其矩陣乘積。具體來說，給定一對實矩陣 $A,B$，將編碼器（壓縮器）套用於它們每一個，獨立產生每個條目的 $R$ 位元描述。這些表示式隨後由解碼器用於估計矩陣乘積 $A^\\top B$。在這項工作中，我們提供了此近似的均方誤差的非漸近下界（作為速率 $R$ 的函數），適用於具有 iid 高斯項目的矩陣 $A,B$。在演算法方面，我們根據嵌套格架構建一個通用量化器，並明確保證對於任何（非隨機）矩陣對 $A$、$B$ 的近似誤差，僅根據弗羅貝尼烏斯範數 $\\|A\\|_F$、$\\|B\\|_F$ 和 $\\|A^\\top B\\|_F$。對於 iid 高斯矩陣，我們的量化器可以達到下界，因此在漸近上是最佳的。我們的量化器的實用低複雜度版本可以實現非常接近最佳的效能。在資訊理論術語中，我們推導了 iid 高斯矩陣矩陣乘法的率失真函數。", "author": "Or Ordentlich et.al.", "authors": "Or Ordentlich, Yury Polyanskiy", "id": "2410.13780v1", "paper_url": "http://arxiv.org/abs/2410.13780v1", "repo": "null"}}