{"2501.03681": {"publish_time": "2025-01-07", "title": "SLAM: Towards Efficient Multilingual Reasoning via Selective Language Alignment", "paper_summary": "Despite the significant improvements achieved by large language models (LLMs)\nin English reasoning tasks, these models continue to struggle with multilingual\nreasoning. Recent studies leverage a full-parameter and two-stage training\nparadigm to teach models to first understand non-English questions and then\nreason. However, this method suffers from both substantial computational\nresource computing and catastrophic forgetting. The fundamental cause is that,\nwith the primary goal of enhancing multilingual comprehension, an excessive\nnumber of irrelevant layers and parameters are tuned during the first stage.\nGiven our findings that the representation learning of languages is merely\nconducted in lower-level layers, we propose an efficient multilingual reasoning\nalignment approach that precisely identifies and fine-tunes the layers\nresponsible for handling multilingualism. Experimental results show that our\nmethod, SLAM, only tunes 6 layers' feed-forward sub-layers including 6.5-8% of\nall parameters within 7B and 13B LLMs, achieving superior average performance\nthan all strong baselines across 10 languages. Meanwhile, SLAM only involves\none training stage, reducing training time by 4.1-11.9 compared to the\ntwo-stage method.", "paper_summary_zh": "儘管大型語言模型 (LLM) 在英文推理任務中取得顯著進展，這些模型在多語言推理中仍面臨挑戰。最近的研究利用全參數和兩階段訓練範例，教導模型先理解非英文問題，然後推理。然而，此方法既需要大量的運算資源，又會發生災難性遺忘。根本原因在於，由於主要目標是增強多語言理解，因此在第一階段調整了過多的無關層和參數。鑑於我們的研究結果表明，語言的表徵學習僅在較低層級進行，我們提出了一種高效的多語言推理對齊方法，可以精確識別並微調負責處理多語言的層級。實驗結果顯示，我們的 SLAM 方法僅微調 6 個層級的前饋子層，包括 7B 和 13B LLM 中 6.5-8% 的所有參數，在 10 種語言中達到優於所有強大基準的平均效能。與此同時，SLAM 只涉及一個訓練階段，與兩階段方法相比，訓練時間減少了 4.1-11.9 倍。", "author": "Yuchun Fan et.al.", "authors": "Yuchun Fan, Yongyu Mu, Yilin Wang, Lei Huang, Junhao Ruan, Bei Li, Tong Xiao, Shujian Huang, Xiaocheng Feng, Jingbo Zhu", "id": "2501.03681v1", "paper_url": "http://arxiv.org/abs/2501.03681v1", "repo": "null"}}