{"2408.02651": {"publish_time": "2024-08-05", "title": "Can Reinforcement Learning Unlock the Hidden Dangers in Aligned Large Language Models?", "paper_summary": "Large Language Models (LLMs) have demonstrated impressive capabilities in\nnatural language tasks, but their safety and morality remain contentious due to\ntheir training on internet text corpora. To address these concerns, alignment\ntechniques have been developed to improve the public usability and safety of\nLLMs. Yet, the potential for generating harmful content through these models\nseems to persist. This paper explores the concept of jailbreaking\nLLMs-reversing their alignment through adversarial triggers. Previous methods,\nsuch as soft embedding prompts, manually crafted prompts, and gradient-based\nautomatic prompts, have had limited success on black-box models due to their\nrequirements for model access and for producing a low variety of manually\ncrafted prompts, making them susceptible to being blocked. This paper\nintroduces a novel approach using reinforcement learning to optimize\nadversarial triggers, requiring only inference API access to the target model\nand a small surrogate model. Our method, which leverages a BERTScore-based\nreward function, enhances the transferability and effectiveness of adversarial\ntriggers on new black-box models. We demonstrate that this approach improves\nthe performance of adversarial triggers on a previously untested language\nmodel.", "paper_summary_zh": "大型語言模型 (LLM) 在自然語言任務中展現出令人印象深刻的能力，但由於它們在網際網路文字語料庫上訓練，安全性與道德性仍有爭議。為了解決這些問題，已開發出校準技術來改善 LLM 的公開可用性和安全性。然而，透過這些模型產生有害內容的可能性似乎仍然存在。本文探討了越獄 LLM 的概念，透過對抗性觸發器來逆轉它們的校準。先前的技術，例如軟嵌入提示、手動製作提示和基於梯度的自動提示，由於需要存取模型和產生少量手動製作提示，導致在黑箱模型上成功有限，使其容易受到封鎖。本文介紹了一種使用強化學習來最佳化對抗性觸發器的新方法，只需要推論 API 存取目標模型和一個小型代理模型。我們的技術利用基於 BERTScore 的獎勵函數，增強了對抗性觸發器在新黑箱模型上的可傳遞性和有效性。我們證明了這種方法改善了對抗性觸發器在先前未測試過的語言模型上的效能。", "author": "Mohammad Bahrami Karkevandi et.al.", "authors": "Mohammad Bahrami Karkevandi, Nishant Vishwamitra, Peyman Najafirad", "id": "2408.02651v1", "paper_url": "http://arxiv.org/abs/2408.02651v1", "repo": "null"}}