{"2412.16768": {"publish_time": "2024-12-21", "title": "A Comparative Study on Machine Learning Models to Classify Diseases Based on Patient Behaviour and Habits", "paper_summary": "In recent years, ML algorithms have been shown to be useful for predicting\ndiseases based on health data and posed a potential application area for these\nalgorithms such as modeling of diseases. The majority of these applications\nemploy supervised rather than unsupervised ML algorithms. In addition, each\nyear, the amount of data in medical science grows rapidly. Moreover, these data\ninclude clinical and Patient-Related Factors (PRF), such as height, weight,\nage, other physical characteristics, blood sugar, lipids, insulin, etc., all of\nwhich will change continually over time. Analysis of historical data can help\nidentify disease risk factors and their interactions, which is useful for\ndisease diagnosis and prediction. This wealth of valuable information in these\ndata will help doctors diagnose accurately and people can become more aware of\nthe risk factors and key indicators to act proactively. The purpose of this\nstudy is to use six supervised ML approaches to fill this gap by conducting a\ncomprehensive experiment to investigate the correlation between PRF and\nDiabetes, Stroke, Heart Disease (HD), and Kidney Disease (KD). Moreover, it\nwill investigate the link between Diabetes, Stroke, and KD and PRF with HD.\nFurther, the research aims to compare and evaluate various ML algorithms for\nclassifying diseases based on the PRF. Additionally, it aims to compare and\nevaluate ML algorithms for classifying HD based on PRF as well as Diabetes,\nStroke, Asthma, Skin Cancer, and KD as attributes. Lastly, HD predictions will\nbe provided through a Web-based application on the most accurate classifier,\nwhich allows the users to input their values and predict the output.", "paper_summary_zh": "近年來，已證明 ML 演算法可根據健康資料預測疾病，並為這些演算法提出了潛在應用領域，例如疾病建模。這些應用程式大多數採用有監督式而非無監督式的 ML 演算法。此外，每年醫學科學中的資料量都快速成長。而且，這些資料包括臨床和患者相關因素 (PRF)，例如身高、體重、年齡、其他身體特徵、血糖、脂質、胰島素等，所有這些都會隨著時間持續變化。分析歷史資料有助於找出疾病風險因子及其交互作用，這對於疾病診斷和預測很有用。這些資料中豐富的寶貴資訊將有助於醫生準確診斷，而人們可以更了解風險因子和關鍵指標，以採取積極行動。本研究的目的是使用六種有監督式 ML 方法，透過執行全面實驗來填補此差距，以探討 PRF 與糖尿病、中風、心臟病 (HD) 和腎臟病 (KD) 之間的關聯性。此外，它將探討糖尿病、中風和 KD 與 PRF 與 HD 之間的關聯性。此外，該研究旨在比較和評估各種 ML 演算法，以根據 PRF 對疾病進行分類。此外，它旨在比較和評估 ML 演算法，以根據 PRF 對 HD 進行分類，以及將糖尿病、中風、氣喘、皮膚癌和 KD 作為屬性。最後，將透過最準確分類器的網路應用程式提供 HD 預測，使用戶可以輸入其數值並預測輸出。", "author": "Elham Musaaed et.al.", "authors": "Elham Musaaed, Nabil Hewahi, Abdulla Alasaadi", "id": "2412.16768v1", "paper_url": "http://arxiv.org/abs/2412.16768v1", "repo": "null"}}