{"2405.20588": {"publish_time": "2024-05-31", "title": "DAFNet: Dynamic Auxiliary Fusion for Sequential Model Editing in Large Language Models", "paper_summary": "Recently, while large language models (LLMs) have demonstrated impressive\nresults, they still suffer from hallucination, i.e., the generation of false\ninformation. Model editing is the task of fixing factual mistakes in LLMs; yet,\nmost previous works treat it as a one-time task, paying little attention to\never-emerging mistakes generated by LLMs. We address the task of sequential\nmodel editing (SME) that aims to rectify mistakes continuously. A Dynamic\nAuxiliary Fusion Network (DAFNet) is designed to enhance the semantic\ninteraction among the factual knowledge within the entire sequence, preventing\ncatastrophic forgetting during the editing process of multiple knowledge\ntriples. Specifically, (1) for semantic fusion within a relation triple, we\naggregate the intra-editing attention flow into auto-regressive self-attention\nwith token-level granularity in LLMs. We further leverage multi-layer diagonal\ninter-editing attention flow to update the weighted representations of the\nentire sequence-level granularity. (2) Considering that auxiliary parameters\nare required to store the knowledge for sequential editing, we construct a new\ndataset named \\textbf{DAFSet}, fulfilling recent, popular, long-tail and robust\nproperties to enhance the generality of sequential editing. Experiments show\nDAFNet significantly outperforms strong baselines in single-turn and sequential\nediting. The usage of DAFSet also consistently improves the performance of\nother auxiliary network-based methods in various scenarios", "paper_summary_zh": "<paragraph>近期，虽然大型语言模型 (LLM) 已展示出令人印象深刻的结果，但它们仍饱受幻觉困扰，即生成虚假信息。模型编辑是修复 LLM 中事实错误的任务；然而，大多数以前的作品将其视为一次性任务，很少关注 LLM 生成的不断出现的错误。我们解决顺序模型编辑 (SME) 的任务，旨在持续纠正错误。动态辅助融合网络 (DAFNet) 被设计用于增强整个序列中事实知识之间的语义交互，防止在编辑多个知识三元组的过程中发生灾难性遗忘。具体来说，(1) 对于关系三元组内的语义融合，我们将内部编辑注意力流聚合到 LLM 中具有标记级别粒度的自回归自注意力中。我们进一步利用多层对角线互编辑注意力流来更新整个序列级别粒度的加权表示。(2) 考虑到需要辅助参数来存储顺序编辑的知识，我们构建了一个名为 \\textbf{DAFSet} 的新数据集，满足最新、流行、长尾和鲁棒属性以增强顺序编辑的通用性。实验表明，DAFNet 在单轮和顺序编辑中明显优于强大的基线。DAFSet 的使用也持续提高了其他基于辅助网络的方法在各种场景中的性能</paragraph>", "author": "Taolin Zhang et.al.", "authors": "Taolin Zhang, Qizhou Chen, Dongyang Li, Chengyu Wang, Xiaofeng He, Longtao Huang, Hui Xue, Jun Huang", "id": "2405.20588v1", "paper_url": "http://arxiv.org/abs/2405.20588v1", "repo": "null"}}