{"2409.18877": {"publish_time": "2024-09-27", "title": "UniEmoX: Cross-modal Semantic-Guided Large-Scale Pretraining for Universal Scene Emotion Perception", "paper_summary": "Visual emotion analysis holds significant research value in both computer\nvision and psychology. However, existing methods for visual emotion analysis\nsuffer from limited generalizability due to the ambiguity of emotion perception\nand the diversity of data scenarios. To tackle this issue, we introduce\nUniEmoX, a cross-modal semantic-guided large-scale pretraining framework.\nInspired by psychological research emphasizing the inseparability of the\nemotional exploration process from the interaction between individuals and\ntheir environment, UniEmoX integrates scene-centric and person-centric\nlow-level image spatial structural information, aiming to derive more nuanced\nand discriminative emotional representations. By exploiting the similarity\nbetween paired and unpaired image-text samples, UniEmoX distills rich semantic\nknowledge from the CLIP model to enhance emotional embedding representations\nmore effectively. To the best of our knowledge, this is the first large-scale\npretraining framework that integrates psychological theories with contemporary\ncontrastive learning and masked image modeling techniques for emotion analysis\nacross diverse scenarios. Additionally, we develop a visual emotional dataset\ntitled Emo8. Emo8 samples cover a range of domains, including cartoon, natural,\nrealistic, science fiction and advertising cover styles, covering nearly all\ncommon emotional scenes. Comprehensive experiments conducted on six benchmark\ndatasets across two downstream tasks validate the effectiveness of UniEmoX. The\nsource code is available at https://github.com/chincharles/u-emo.", "paper_summary_zh": "視覺情緒分析在電腦視覺和心理學中具有重要的研究價值。然而，現有的視覺情緒分析方法由於情緒感知的模糊性和資料場景的多樣性，而難以進行廣泛的概括。為了解決這個問題，我們引入了 UniEmoX，一個跨模態語義引導的大規模預訓練框架。受到心理學研究強調情緒探索過程與個人與其環境互動之間不可分離性的啟發，UniEmoX 整合了場景為中心和以人為中心的低階影像空間結構資訊，旨在推導出更細緻且具有區辨力的情緒表徵。透過利用配對和未配對影像文字範例之間的相似性，UniEmoX 從 CLIP 模型中萃取出豐富的語義知識，以更有效地增強情緒嵌入表徵。據我們所知，這是第一個將心理學理論與當代對比學習和遮罩影像建模技術整合起來的大規模預訓練框架，用於跨不同場景進行情緒分析。此外，我們開發了一個名為 Emo8 的視覺情緒資料集。Emo8 範例涵蓋了各種領域，包括卡通、自然、寫實、科幻和廣告封面風格，涵蓋了幾乎所有常見的情緒場景。在六個基準資料集上進行的綜合實驗，跨兩個下游任務驗證了 UniEmoX 的有效性。原始程式碼可在 https://github.com/chincharles/u-emo 取得。", "author": "Chuang Chen et.al.", "authors": "Chuang Chen, Xiao Sun, Zhi Liu", "id": "2409.18877v1", "paper_url": "http://arxiv.org/abs/2409.18877v1", "repo": "null"}}