{"2408.11227": {"publish_time": "2024-08-20", "title": "OCTCube: A 3D foundation model for optical coherence tomography that improves cross-dataset, cross-disease, cross-device and cross-modality analysis", "paper_summary": "Optical coherence tomography (OCT) has become critical for diagnosing retinal\ndiseases as it enables 3D images of the retina and optic nerve. OCT acquisition\nis fast, non-invasive, affordable, and scalable. Due to its broad\napplicability, massive numbers of OCT images have been accumulated in routine\nexams, making it possible to train large-scale foundation models that can\ngeneralize to various diagnostic tasks using OCT images. Nevertheless, existing\nfoundation models for OCT only consider 2D image slices, overlooking the rich\n3D structure. Here, we present OCTCube, a 3D foundation model pre-trained on\n26,605 3D OCT volumes encompassing 1.62 million 2D OCT images. OCTCube is\ndeveloped based on 3D masked autoencoders and exploits FlashAttention to reduce\nthe larger GPU memory usage caused by modeling 3D volumes. OCTCube outperforms\n2D models when predicting 8 retinal diseases in both inductive and\ncross-dataset settings, indicating that utilizing the 3D structure in the model\ninstead of 2D data results in significant improvement. OCTCube further shows\nsuperior performance on cross-device prediction and when predicting systemic\ndiseases, such as diabetes and hypertension, further demonstrating its strong\ngeneralizability. Finally, we propose a\ncontrastive-self-supervised-learning-based OCT-IR pre-training framework (COIP)\nfor cross-modality analysis on OCT and infrared retinal (IR) images, where the\nOCT volumes are embedded using OCTCube. We demonstrate that COIP enables\naccurate alignment between OCT and IR en face images. Collectively, OCTCube, a\n3D OCT foundation model, demonstrates significantly better performance against\n2D models on 27 out of 29 tasks and comparable performance on the other two\ntasks, paving the way for AI-based retinal disease diagnosis.", "paper_summary_zh": "光學相干斷層掃描 (OCT) 已成為診斷視網膜疾病的重要工具，因為它可以提供視網膜和視神經的 3D 影像。OCT 獲取快速、非侵入性、負擔得起且可擴充。由於其廣泛的適用性，大量 OCT 影像已在例行檢查中累積，使得訓練大型基礎模型成為可能，這些模型可以使用 OCT 影像推廣到各種診斷任務。儘管如此，現有的 OCT 基礎模型只考慮 2D 影像切片，忽略了豐富的 3D 結構。在此，我們提出 OCTCube，這是一個 3D 基礎模型，預先訓練於 26,605 個 3D OCT 體積，包含 162 萬個 2D OCT 影像。OCTCube 是基於 3D 蒙版自動編碼器開發的，並利用 FlashAttention 來減少建模 3D 體積所造成的較大 GPU 記憶體使用量。OCTCube 在預測 8 種視網膜疾病時優於 2D 模型，無論是在歸納式還是跨資料集設定中，這表示在模型中使用 3D 結構，而不是 2D 資料，會帶來顯著的改進。OCTCube 在跨裝置預測和預測全身性疾病（例如糖尿病和高血壓）時進一步展現出優異的效能，進一步證明了其強大的泛化能力。最後，我們提出一個基於對比自監督學習的 OCT-IR 預訓練架構 (COIP)，用於 OCT 和紅外線視網膜 (IR) 影像的跨模態分析，其中 OCT 體積使用 OCTCube 嵌入。我們證明 COIP 能夠在 OCT 和 IR 正面影像之間進行準確的對齊。總的來說，OCTCube 是一個 3D OCT 基礎模型，在 29 項任務中的 27 項任務中展現出明顯優於 2D 模型的效能，而在其他兩項任務中展現出相當的效能，為基於 AI 的視網膜疾病診斷鋪路。", "author": "Zixuan Liu et.al.", "authors": "Zixuan Liu, Hanwen Xu, Addie Woicik, Linda G. Shapiro, Marian Blazes, Yue Wu, Cecilia S. Lee, Aaron Y. Lee, Sheng Wang", "id": "2408.11227v1", "paper_url": "http://arxiv.org/abs/2408.11227v1", "repo": "null"}}