{"2409.17928": {"publish_time": "2024-09-26", "title": "Pioneering Reliable Assessment in Text-to-Image Knowledge Editing: Leveraging a Fine-Grained Dataset and an Innovative Criterion", "paper_summary": "During pre-training, the Text-to-Image (T2I) diffusion models encode factual\nknowledge into their parameters. These parameterized facts enable realistic\nimage generation, but they may become obsolete over time, thereby\nmisrepresenting the current state of the world. Knowledge editing techniques\naim to update model knowledge in a targeted way. However, facing the dual\nchallenges posed by inadequate editing datasets and unreliable evaluation\ncriterion, the development of T2I knowledge editing encounter difficulties in\neffectively generalizing injected knowledge. In this work, we design a T2I\nknowledge editing framework by comprehensively spanning on three phases: First,\nwe curate a dataset \\textbf{CAKE}, comprising paraphrase and multi-object test,\nto enable more fine-grained assessment on knowledge generalization. Second, we\npropose a novel criterion, \\textbf{adaptive CLIP threshold}, to effectively\nfilter out false successful images under the current criterion and achieve\nreliable editing evaluation. Finally, we introduce \\textbf{MPE}, a simple but\neffective approach for T2I knowledge editing. Instead of tuning parameters, MPE\nprecisely recognizes and edits the outdated part of the conditioning\ntext-prompt to accommodate the up-to-date knowledge. A straightforward\nimplementation of MPE (Based on in-context learning) exhibits better overall\nperformance than previous model editors. We hope these efforts can further\npromote faithful evaluation of T2I knowledge editing methods.", "paper_summary_zh": "<paragraph>在預訓練期間，文字轉圖像 (T2I) 擴散模型將事實知識編碼到其參數中。這些參數化事實能產生逼真的圖像，但它們可能會隨著時間變得過時，從而錯誤地表示世界的當前狀態。知識編輯技術旨在以有針對性的方式更新模型知識。然而，面對不充分的編輯資料集和不可靠的評估標準所帶來的雙重挑戰，T2I 知識編輯的開發在有效概括注入知識方面遇到困難。在這項工作中，我們設計了一個 T2I 知識編輯框架，全面涵蓋三個階段：首先，我們策劃了一個資料集 \\textbf{CAKE}，包含同義詞改寫和多物件測試，以對知識概括進行更細緻的評估。其次，我們提出了一個新的標準，\\textbf{適應性 CLIP 閥值}，以在當前標準下有效地過濾掉錯誤的成功圖像，並實現可靠的編輯評估。最後，我們介紹了 \\textbf{MPE}，一種簡單但有效的 T2I 知識編輯方法。MPE 不調整參數，而是精確地識別和編輯條件文字提示的過時部分，以容納最新的知識。MPE 的一個簡單實現（基於情境學習）表現出比以前模型編輯器更好的整體性能。我們希望這些努力能進一步促進對 T2I 知識編輯方法的忠實評估。</paragraph>", "author": "Hengrui Gu et.al.", "authors": "Hengrui Gu, Kaixiong Zhou, Yili Wang, Ruobing Wang, Xin Wang", "id": "2409.17928v1", "paper_url": "http://arxiv.org/abs/2409.17928v1", "repo": "null"}}