{"2406.07155": {"publish_time": "2024-06-11", "title": "Scaling Large-Language-Model-based Multi-Agent Collaboration", "paper_summary": "Pioneering advancements in large language model-powered agents have\nunderscored the design pattern of multi-agent collaboration, demonstrating that\ncollective intelligence can surpass the capabilities of each individual.\nInspired by the neural scaling law, which posits that increasing neurons leads\nto emergent abilities, this study investigates whether a similar principle\napplies to increasing agents in multi-agent collaboration. Technically, we\npropose multi-agent collaboration networks (MacNet), which utilize directed\nacyclic graphs to organize agents and streamline their interactive reasoning\nvia topological ordering, with solutions derived from their dialogues.\nExtensive experiments show that MacNet consistently outperforms baseline\nmodels, enabling effective agent collaboration across various network\ntopologies and supporting cooperation among more than a thousand agents.\nNotably, we observed a small-world collaboration phenomenon, where topologies\nresembling small-world properties achieved superior performance. Additionally,\nwe identified a collaborative scaling law, indicating that normalized solution\nquality follows a logistic growth pattern as scaling agents, with collaborative\nemergence occurring much earlier than previously observed instances of neural\nemergence. The code and data will be available at\nhttps://github.com/OpenBMB/ChatDev.", "paper_summary_zh": "<paragraph>大型语言模型驱动的代理的开创性进步强调了多代理协作的设计模式，证明了集体智能可以超越每个个体的能力。受神经网络扩展定律的启发，该定律认为增加神经元会导致能力的涌现，本研究调查了类似的原理是否适用于增加多代理协作中的代理。在技术上，我们提出了多代理协作网络（MacNet），它利用有向无环图来组织代理并通过拓扑排序简化它们的交互推理，解决方案来自它们的对话。广泛的实验表明，MacNet 始终优于基线模型，能够在各种网络拓扑中实现有效的代理协作，并支持一千多个代理之间的合作。值得注意的是，我们观察到了一种小世界协作现象，其中类似于小世界属性的拓扑结构取得了卓越的性能。此外，我们确定了一个协作扩展定律，表明归一化解决方案质量遵循逻辑增长模式作为扩展代理，协作涌现比先前观察到的神经涌现实例发生得更早。代码和数据将可在 https://github.com/OpenBMB/ChatDev 获得。</paragraph>", "author": "Chen Qian et.al.", "authors": "Chen Qian, Zihao Xie, Yifei Wang, Wei Liu, Yufan Dang, Zhuoyun Du, Weize Chen, Cheng Yang, Zhiyuan Liu, Maosong Sun", "id": "2406.07155v1", "paper_url": "http://arxiv.org/abs/2406.07155v1", "repo": "https://github.com/openbmb/chatdev"}}