{"2410.23234": {"publish_time": "2024-10-30", "title": "EMOTION: Expressive Motion Sequence Generation for Humanoid Robots with In-Context Learning", "paper_summary": "This paper introduces a framework, called EMOTION, for generating expressive\nmotion sequences in humanoid robots, enhancing their ability to engage in\nhumanlike non-verbal communication. Non-verbal cues such as facial expressions,\ngestures, and body movements play a crucial role in effective interpersonal\ninteractions. Despite the advancements in robotic behaviors, existing methods\noften fall short in mimicking the diversity and subtlety of human non-verbal\ncommunication. To address this gap, our approach leverages the in-context\nlearning capability of large language models (LLMs) to dynamically generate\nsocially appropriate gesture motion sequences for human-robot interaction. We\nuse this framework to generate 10 different expressive gestures and conduct\nonline user studies comparing the naturalness and understandability of the\nmotions generated by EMOTION and its human-feedback version, EMOTION++, against\nthose by human operators. The results demonstrate that our approach either\nmatches or surpasses human performance in generating understandable and natural\nrobot motions under certain scenarios. We also provide design implications for\nfuture research to consider a set of variables when generating expressive\nrobotic gestures.", "paper_summary_zh": "本文介紹了一個名為 EMOTION 的框架，可用於在類人機器人中生成表達性的動作序列，增強其參與類人非語言溝通的能力。非語言線索（例如面部表情、手勢和身體動作）在有效的人際互動中扮演著至關重要的角色。儘管機器人行為有進步，但現有方法在模仿人類非語言溝通的多樣性和微妙性方面往往做得不夠。為了解決這個差距，我們的方法利用大型語言模型 (LLM) 的情境學習能力，動態生成適應社交場合的手勢動作序列，用於人機互動。我們使用這個框架生成了 10 種不同的表達性手勢，並進行線上使用者研究，比較 EMOTION 及其人類回饋版本 EMOTION++ 所生成動作的自然性和可理解性，以及人類操作員所做的動作。結果表明，在某些場景下，我們的方法在生成可理解且自然的機器人動作方面達到或超過人類表現。我們還為未來的研究提供了設計含義，以考慮在生成表達性機器人手勢時的一組變數。", "author": "Peide Huang et.al.", "authors": "Peide Huang, Yuhan Hu, Nataliya Nechyporenko, Daehwa Kim, Walter Talbott, Jian Zhang", "id": "2410.23234v1", "paper_url": "http://arxiv.org/abs/2410.23234v1", "repo": "null"}}