{"2405.18014": {"publish_time": "2024-05-28", "title": "Coupled Mamba: Enhanced Multi-modal Fusion with Coupled State Space Model", "paper_summary": "The essence of multi-modal fusion lies in exploiting the complementary\ninformation inherent in diverse modalities. However, prevalent fusion methods\nrely on traditional neural architectures and are inadequately equipped to\ncapture the dynamics of interactions across modalities, particularly in\npresence of complex intra- and inter-modality correlations. Recent advancements\nin State Space Models (SSMs), notably exemplified by the Mamba model, have\nemerged as promising contenders. Particularly, its state evolving process\nimplies stronger modality fusion paradigm, making multi-modal fusion on SSMs an\nappealing direction. However, fusing multiple modalities is challenging for\nSSMs due to its hardware-aware parallelism designs. To this end, this paper\nproposes the Coupled SSM model, for coupling state chains of multiple\nmodalities while maintaining independence of intra-modality state processes.\nSpecifically, in our coupled scheme, we devise an inter-modal hidden states\ntransition scheme, in which the current state is dependent on the states of its\nown chain and that of the neighbouring chains at the previous time-step. To\nfully comply with the hardware-aware parallelism, we devise an expedite coupled\nstate transition scheme and derive its corresponding global convolution kernel\nfor parallelism. Extensive experiments on CMU-MOSEI, CH-SIMS, CH-SIMSV2 through\nmulti-domain input verify the effectiveness of our model compared to current\nstate-of-the-art methods, improved F1-Score by 0.4\\%, 0.9\\%, and 2.3\\% on the\nthree datasets respectively, 49\\% faster inference and 83.7\\% GPU memory save.\nThe results demonstrate that Coupled Mamba model is capable of enhanced\nmulti-modal fusion.", "paper_summary_zh": "多模態融合的精髓在於利用不同模態中固有的互補資訊。然而，現行的融合方法依賴於傳統的神經架構，並且無法充分捕捉模態間互動的動態，特別是在存在複雜的模態內部和模態間關聯的情況下。狀態空間模型 (SSM) 的最新進展，特別是以 Mamba 模型為例，已成為有希望的競爭者。具體而言，它的狀態演化過程意味著更強大的模態融合範例，使 SSM 上的多模態融合成為一個有吸引力的方向。然而，由於其硬體感知並行設計，對 SSM 融合多個模態具有挑戰性。為此，本文提出了耦合 SSM 模型，用於耦合多個模態的狀態鏈，同時保持模態內部狀態過程的獨立性。具體來說，在我們的耦合方案中，我們設計了一個模態間隱藏狀態轉換方案，其中當前狀態依賴於其自身鏈的狀態和前一時間步中相鄰鏈的狀態。為了完全符合硬體感知並行性，我們設計了一個加速耦合狀態轉換方案，並推導了其對應的全局卷積核以實現並行性。通過多領域輸入對 CMU-MOSEI、CH-SIMS、CH-SIMSV2 的廣泛實驗驗證了我們模型與當前最先進方法相比的有效性，分別在三個數據集上改進了 F1 分數 0.4%、0.9% 和 2.3%，推理速度提高了 49%，GPU 記憶體節省了 83.7%。結果表明，耦合 Mamba 模型能夠增強多模態融合。", "author": "Wenbing Li et.al.", "authors": "Wenbing Li, Hang Zhou, Junqing Yu, Zikai Song, Wei Yang", "id": "2405.18014v2", "paper_url": "http://arxiv.org/abs/2405.18014v2", "repo": "null"}}