{"2410.03278": {"publish_time": "2024-10-04", "title": "What do Large Language Models Need for Machine Translation Evaluation?", "paper_summary": "Leveraging large language models (LLMs) for various natural language\nprocessing tasks has led to superlative claims about their performance. For the\nevaluation of machine translation (MT), existing research shows that LLMs are\nable to achieve results comparable to fine-tuned multilingual pre-trained\nlanguage models. In this paper, we explore what translation information, such\nas the source, reference, translation errors and annotation guidelines, is\nneeded for LLMs to evaluate MT quality. In addition, we investigate prompting\ntechniques such as zero-shot, Chain of Thought (CoT) and few-shot prompting for\neight language pairs covering high-, medium- and low-resource languages,\nleveraging varying LLM variants. Our findings indicate the importance of\nreference translations for an LLM-based evaluation. While larger models do not\nnecessarily fare better, they tend to benefit more from CoT prompting, than\nsmaller models. We also observe that LLMs do not always provide a numerical\nscore when generating evaluations, which poses a question on their reliability\nfor the task. Our work presents a comprehensive analysis for\nresource-constrained and training-less LLM-based evaluation of machine\ntranslation. We release the accrued prompt templates, code and data publicly\nfor reproducibility.", "paper_summary_zh": "<paragraph>利用大型語言模型 (LLM) 執行各種自然語言處理任務，對其效能已產生極佳的評價。針對機器翻譯 (MT) 的評估，現有研究顯示，LLM 能夠達成與微調多語言預訓練語言模型相當的結果。在這篇論文中，我們探討 LLM 評估 MT 品質所需的翻譯資訊，例如來源、參考、翻譯錯誤和註解指南。此外，我們研究提示技術，例如零次學習、思考鏈 (CoT) 和少次學習提示，涵蓋高、中和低資源語言的八種語言對，並利用各種 LLM 變體。我們的研究結果顯示參考翻譯對基於 LLM 的評估非常重要。雖然較大的模型不見得表現較好，但它們往往比較小的模型更能受益於 CoT 提示。我們也觀察到，LLM 在產生評估時並不總是提供數字分數，這對其任務可靠性提出了疑問。我們的研究針對資源受限和無需訓練的基於 LLM 的機器翻譯評估，提出全面的分析。我們公開發布累積的提示範本、程式碼和資料，以利重現。</paragraph>", "author": "Shenbin Qian et.al.", "authors": "Shenbin Qian, Archchana Sindhujan, Minnie Kabra, Diptesh Kanojia, Constantin Orăsan, Tharindu Ranasinghe, Frédéric Blain", "id": "2410.03278v1", "paper_url": "http://arxiv.org/abs/2410.03278v1", "repo": "null"}}