{"2408.15119": {"publish_time": "2024-08-27", "title": "Urdu Digital Text Word Optical Character Recognition Using Permuted Auto Regressive Sequence Modeling", "paper_summary": "This research paper presents a novel word-level Optical Character Recognition\n(OCR) model developed specifically for digital Urdu text. The model utilizes\ntransformer-based architectures and attention mechanisms to address the unique\nchallenges of recognizing Urdu script, which includes handling a diverse range\nof text styles, fonts, and variations. Trained on a comprehensive dataset of\napproximately 160,000 Urdu text images, the model incorporates a permuted\nautoregressive sequence (PARSeq) architecture. This design enables\ncontext-aware inference and iterative refinement by leveraging bidirectional\ncontext information, significantly enhancing its ability to accurately\nrecognize Urdu characters. The model achieves a character error rate (CER) of\n0.178, highlighting its effectiveness and precision in real-world applications.\nHowever, the model has some limitations, such as difficulties with blurred\nimages, non-horizontal orientations, and the presence of trailing punctuation\nmarks, which can introduce noise into the recognition process. Addressing these\nchallenges will be a key focus of future work. Future research will aim to\nfurther refine the model through advanced data augmentation techniques,\noptimization of hyperparameters, and the integration of context-aware language\nmodels, ultimately enhancing the model's performance and robustness in Urdu\ntext recognition.", "paper_summary_zh": "這篇研究論文提出了一個新穎的單字層級光學字元辨識 (OCR) 模型，專為數位烏爾都語文字而開發。此模型利用基於轉換器的架構和注意力機制來解決辨識烏爾都語文字的獨特挑戰，包括處理各種文字樣式、字體和變化。在約 160,000 張烏爾都語文字影像的綜合資料集上訓練後，此模型結合了一個排列的自動迴歸序列 (PARSeq) 架構。此設計透過利用雙向脈絡資訊，實現了脈絡感知推論和反覆精煉，大幅提升了其準確辨識烏爾都語字元的能。此模型達到了 0.178 的字元錯誤率 (CER)，突顯了其在實際應用中的效能和精準度。然而，此模型有一些限制，例如難以處理模糊影像、非水平方向和存在尾隨標點符號，這些因素會在辨識過程中產生雜訊。解決這些挑戰將是未來工作的重點。未來的研究將旨在透過進階資料擴充技術、超參數最佳化和整合脈絡感知語言模型，進一步精煉此模型，最終提升此模型在烏爾都語文字辨識中的效能和穩健性。", "author": "Ahmed Mustafa et.al.", "authors": "Ahmed Mustafa, Muhammad Tahir Rafique, Muhammad Ijlal Baig, Hasan Sajid, Muhammad Jawad Khan, Karam Dad Kallu", "id": "2408.15119v2", "paper_url": "http://arxiv.org/abs/2408.15119v2", "repo": "null"}}