{"2501.01291": {"publish_time": "2025-01-02", "title": "Change Detection-Based Procedures for Piecewise Stationary MABs: A Modular Approach", "paper_summary": "Conventional Multi-Armed Bandit (MAB) algorithms are designed for stationary\nenvironments, where the reward distributions associated with the arms do not\nchange with time. In many applications, however, the environment is more\naccurately modeled as being nonstationary. In this work, piecewise stationary\nMAB (PS-MAB) environments are investigated, in which the reward distributions\nassociated with a subset of the arms change at some change-points and remain\nstationary between change-points. Our focus is on the asymptotic analysis of\nPS-MABs, for which practical algorithms based on change detection (CD) have\nbeen previously proposed. Our goal is to modularize the design and analysis of\nsuch CD-based Bandit (CDB) procedures. To this end, we identify the\nrequirements for stationary bandit algorithms and change detectors in a CDB\nprocedure that are needed for the modularization. We assume that the rewards\nare sub-Gaussian. Under this assumption and a condition on the separation of\nthe change-points, we show that the analysis of CDB procedures can indeed be\nmodularized, so that regret bounds can be obtained in a unified manner for\nvarious combinations of change detectors and bandit algorithms. Through this\nanalysis, we develop new modular CDB procedures that are order-optimal. We\ncompare the performance of our modular CDB procedures with various other\nmethods in simulations.", "paper_summary_zh": "傳統的多臂老虎機 (MAB) 演算法是為靜態環境所設計，其中與手臂相關的獎勵分佈不會隨著時間而改變。然而，在許多應用中，環境更精確地被建模為非靜態的。在這項工作中，研究了分段靜態 MAB (PS-MAB) 環境，其中與手臂子集相關的獎勵分佈在某些變動點發生變化，並在變動點之間保持靜態。我們的重點在於 PS-MAB 的漸近分析，其中先前已提出基於變動偵測 (CD) 的實用演算法。我們的目標是將此類基於 CD 的老虎機 (CDB) 程序的設計和分析模組化。為此，我們在 CDB 程序中找出模組化所需的靜態老虎機演算法和變動偵測器的需求。我們假設獎勵是次高斯分佈的。在此假設和變動點分離的條件下，我們證明 CDB 程序的分析確實可以模組化，因此可以統一的方式為變動偵測器和老虎機演算法的各種組合取得遺憾界限。透過此分析，我們開發了新的模組化 CDB 程序，其為次佳。我們在模擬中將我們的模組化 CDB 程序的效能與其他各種方法進行比較。", "author": "Yu-Han Huang et.al.", "authors": "Yu-Han Huang, Argyrios Gerogiannis, Subhonmesh Bose, Venugopal V. Veeravalli", "id": "2501.01291v1", "paper_url": "http://arxiv.org/abs/2501.01291v1", "repo": "null"}}