{"2406.11423": {"publish_time": "2024-06-17", "title": "Dredge Word, Social Media, and Webgraph Networks for Unreliable Website Classification and Identification", "paper_summary": "In an attempt to mimic the complex paths through which unreliable content\nspreads between search engines and social media, we explore the impact of\nincorporating both webgraph and large-scale social media contexts into website\ncredibility classification and discovery systems. We further explore the usage\nof what we define as \\textit{dredge words} on social media -- terms or phrases\nfor which unreliable domains rank highly. Through comprehensive graph neural\nnetwork ablations, we demonstrate that curriculum-based heterogeneous graph\nmodels that leverage context from both webgraphs and social media data\noutperform homogeneous and single-mode approaches. We further demonstrate that\nthe incorporation of dredge words into our model strongly associates unreliable\nwebsites with social media and online commerce platforms. Finally, we show our\nheterogeneous model greatly outperforms competing systems in the top-k\nidentification of unlabeled unreliable websites. We demonstrate the strong\nunreliability signals present in the diverse paths that users follow to uncover\nunreliable content, and we release a novel dataset of dredge words.", "paper_summary_zh": "為了模擬不可靠內容在搜尋引擎和社群媒體之間傳播的複雜路徑，我們探討了將網路圖和大型社群媒體背景納入網站可信度分類和發現系統的影響。我們進一步探討了我們定義為社群媒體上的「撈耙子詞彙」的使用——不可靠網域排名很高的詞彙或片語。透過全面的圖形神經網路消融，我們證明了利用網路圖和社群媒體資料的背景的課程式異質圖形模型，優於同質和單一模式方法。我們進一步證明，將撈耙子詞彙納入我們的模型，將不可靠網站與社群媒體和線上商務平台緊密聯繫在一起。最後，我們展示我們的異質模型在未標記不可靠網站的 top-k 識別中，大幅優於競爭系統。我們展示了使用者追蹤以揭露不可靠內容時，各種路徑中存在強烈的不可靠信號，並釋出一個新穎的撈耙子詞彙資料集。", "author": "Evan M. Williams et.al.", "authors": "Evan M. Williams, Peter Carragher, Kathleen M. Carley", "id": "2406.11423v1", "paper_url": "http://arxiv.org/abs/2406.11423v1", "repo": "null"}}