{"2503.02476": {"publish_time": "2025-03-04", "title": "BioD2C: A Dual-level Semantic Consistency Constraint Framework for Biomedical VQA", "paper_summary": "Biomedical visual question answering (VQA) has been widely studied and has\ndemonstrated significant application value and potential in fields such as\nassistive medical diagnosis. Despite their success, current biomedical VQA\nmodels perform multimodal information interaction only at the model level\nwithin large language models (LLMs), leading to suboptimal multimodal semantic\nalignment when dealing with complex tasks. To address this issue, we propose\nBioD2C: a novel Dual-level Semantic Consistency Constraint Framework for\nBiomedical VQA, which achieves dual-level semantic interaction alignment at\nboth the model and feature levels, enabling the model to adaptively learn\nvisual features based on the question. Specifically, we firstly integrate\ntextual features into visual features via an image-text fusion mechanism as\nfeature-level semantic interaction, obtaining visual features conditioned on\nthe given text; and then introduce a text-queue-based cross-modal soft semantic\nloss function to further align the image semantics with the question semantics.\nSpecifically, in this work, we establish a new dataset, BioVGQ, to address\ninherent biases in prior datasets by filtering manually-altered images and\naligning question-answer pairs with multimodal context, and train our model on\nthis dataset. Extensive experimental results demonstrate that BioD2C achieves\nstate-of-the-art (SOTA) performance across multiple downstream datasets,\nshowcasing its robustness, generalizability, and potential to advance\nbiomedical VQA research.", "paper_summary_zh": "<paragraph>生物醫學視覺問答 (VQA) 已被廣泛研究，並在輔助醫療診斷等領域展現出顯著的應用價值和潛力。儘管取得了成功，但目前的生物醫學 VQA 模型僅在大語言模型 (LLM) 的模型層級進行多模態資訊交互，導致在處理複雜任務時，多模態語義對齊效果欠佳。為了應對此問題，我們提出了 BioD2C：一種用於生物醫學 VQA 的新型雙層級語義一致性約束框架，它在模型和特徵層級都實現了雙層級語義交互對齊，使模型能夠根據問題自適應地學習視覺特徵。具體來說，我們首先透過圖文融合機制將文本特徵整合到視覺特徵中，作為特徵層級的語義交互，獲得基於給定文本的視覺特徵；然後引入基於文本佇列的跨模態軟語義損失函數，以進一步將圖像語義與問題語義對齊。具體而言，在這項工作中，我們建立了一個新的數據集 BioVGQ，透過過濾人工修改的圖像並將問答對與多模態上下文對齊，來解決先前數據集中固有的偏差，並在此數據集上訓練我們的模型。大量的實驗結果表明，BioD2C 在多個下游數據集中達到了最先進 (SOTA) 的性能，展現了其穩健性、泛化性和推進生物醫學 VQA 研究的潛力。</paragraph>\n", "author": "Zhengyang Ji et.al.", "authors": "Zhengyang Ji, Shang Gao, Li Liu, Yifan Jia, Yutao Yue", "id": "2503.02476v1", "paper_url": "http://arxiv.org/abs/2503.02476v1", "repo": "null"}}