{"2404.15946": {"publish_time": "2024-04-24", "title": "Mammo-CLIP: Leveraging Contrastive Language-Image Pre-training (CLIP) for Enhanced Breast Cancer Diagnosis with Multi-view Mammography", "paper_summary": "Although fusion of information from multiple views of mammograms plays an\nimportant role to increase accuracy of breast cancer detection, developing\nmulti-view mammograms-based computer-aided diagnosis (CAD) schemes still faces\nchallenges and no such CAD schemes have been used in clinical practice. To\novercome the challenges, we investigate a new approach based on Contrastive\nLanguage-Image Pre-training (CLIP), which has sparked interest across various\nmedical imaging tasks. By solving the challenges in (1) effectively adapting\nthe single-view CLIP for multi-view feature fusion and (2) efficiently\nfine-tuning this parameter-dense model with limited samples and computational\nresources, we introduce Mammo-CLIP, the first multi-modal framework to process\nmulti-view mammograms and corresponding simple texts. Mammo-CLIP uses an early\nfeature fusion strategy to learn multi-view relationships in four mammograms\nacquired from the CC and MLO views of the left and right breasts. To enhance\nlearning efficiency, plug-and-play adapters are added into CLIP image and text\nencoders for fine-tuning parameters and limiting updates to about 1% of the\nparameters. For framework evaluation, we assembled two datasets\nretrospectively. The first dataset, comprising 470 malignant and 479 benign\ncases, was used for few-shot fine-tuning and internal evaluation of the\nproposed Mammo-CLIP via 5-fold cross-validation. The second dataset, including\n60 malignant and 294 benign cases, was used to test generalizability of\nMammo-CLIP. Study results show that Mammo-CLIP outperforms the state-of-art\ncross-view transformer in AUC (0.841 vs. 0.817, 0.837 vs. 0.807) on both\ndatasets. It also surpasses previous two CLIP-based methods by 20.3% and 14.3%.\nThis study highlights the potential of applying the finetuned vision-language\nmodels for developing next-generation, image-text-based CAD schemes of breast\ncancer.", "paper_summary_zh": "<paragraph>儘管融合多視角乳房攝影的資訊在提升乳癌偵測準確度上扮演重要角色，但開發基於多視角乳房攝影的電腦輔助診斷 (CAD) 架構仍面臨挑戰，且目前尚未有此類 CAD 架構用於臨床實務。為克服這些挑戰，我們研究了一種基於對比式語言影像預訓練 (CLIP) 的新方法，這已在各種醫學影像任務中引起興趣。透過解決 (1) 有效調整單視角 CLIP 以進行多視角特徵融合，以及 (2) 有效微調此參數密集模型，且僅使用有限樣本和運算資源的挑戰，我們引入了 Mammo-CLIP，這是一個處理多視角乳房攝影和對應簡短文字的第一個多模式架構。Mammo-CLIP 使用早期特徵融合策略來學習從左右乳房的 CC 和 MLO 視角取得的四個乳房攝影的多視角關係。為提升學習效率，將即插即用適配器加入 CLIP 影像和文字編碼器中，以微調參數，並將更新限制在約 1% 的參數。為進行架構評估，我們回溯性地彙整了兩個資料集。第一個資料集包含 470 個惡性和 479 個良性病例，用於少量微調和透過 5 倍交叉驗證對所提出的 Mammo-CLIP 進行內部評估。第二個資料集包含 60 個惡性和 294 個良性病例，用於測試 Mammo-CLIP 的概括性。研究結果顯示，Mammo-CLIP 在兩個資料集上都優於最先進的跨視角Transformer，AUC 分別為 (0.841 對 0.817、0.837 對 0.807)。它也比先前的兩種基於 CLIP 的方法高出 20.3% 和 14.3%。本研究突顯了應用微調視覺語言模型來開發乳癌新一代影像文字型 CAD 架構的潛力。</paragraph>", "author": "Xuxin Chen et.al.", "authors": "Xuxin Chen, Yuheng Li, Mingzhe Hu, Ella Salari, Xiaoqian Chen, Richard L. J. Qiu, Bin Zheng, Xiaofeng Yang", "id": "2404.15946v1", "paper_url": "http://arxiv.org/abs/2404.15946v1", "repo": "null"}}