{"2502.04295": {"publish_time": "2025-02-06", "title": "Beyond Prompt Content: Enhancing LLM Performance via Content-Format Integrated Prompt Optimization", "paper_summary": "Large Language Models (LLMs) have shown significant capability across various\ntasks, with their real-world effectiveness often driven by prompt design. While\nrecent research has focused on optimizing prompt content, the role of prompt\nformatting, a critical but often overlooked dimension, has received limited\nsystematic investigation. In this paper, we introduce Content-Format Integrated\nPrompt Optimization (CFPO), an innovative methodology that jointly optimizes\nboth prompt content and formatting through an iterative refinement process.\nCFPO leverages natural language mutations to explore content variations and\nemploys a dynamic format exploration strategy that systematically evaluates\ndiverse format options. Our extensive evaluations across multiple tasks and\nopen-source LLMs demonstrate that CFPO demonstrates measurable performance\nimprovements compared to content-only optimization methods. This highlights the\nimportance of integrated content-format optimization and offers a practical,\nmodel-agnostic approach to enhancing LLM performance. Code will be available at\nhttps://github.com/HenryLau7/CFPO.", "paper_summary_zh": "大型語言模型 (LLM) 已展現出各種任務的顯著能力，其在現實世界中的有效性通常取決於提示設計。儘管最近的研究專注於最佳化提示內容，但提示格式化的角色是一個關鍵但經常被忽視的層面，尚未獲得系統性的研究。在本文中，我們介紹了內容格式整合提示最佳化 (CFPO)，這是一種創新的方法，可透過反覆改善程序，同時最佳化提示內容和格式。CFPO 利用自然語言變異來探索內容變化，並採用動態格式探索策略，系統性地評估各種格式選項。我們在多項任務和開源 LLM 中進行的廣泛評估證明，與僅內容最佳化方法相比，CFPO 表現出可衡量的效能改善。這突顯了整合內容格式最佳化的重要性，並提供了一種實用的、與模型無關的方法來提升 LLM 效能。程式碼將於 https://github.com/HenryLau7/CFPO 提供。", "author": "Yuanye Liu et.al.", "authors": "Yuanye Liu, Jiahang Xu, Li Lyna Zhang, Qi Chen, Xuan Feng, Yang Chen, Zhongxin Guo, Yuqing Yang, Cheng Peng", "id": "2502.04295v1", "paper_url": "http://arxiv.org/abs/2502.04295v1", "repo": "null"}}