{"2409.09944": {"publish_time": "2024-09-16", "title": "Fault Analysis And Predictive Maintenance Of Induction Motor Using Machine Learning", "paper_summary": "Induction motors are one of the most crucial electrical equipment and are\nextensively used in industries in a wide range of applications. This paper\npresents a machine learning model for the fault detection and classification of\ninduction motor faults by using three phase voltages and currents as inputs.\nThe aim of this work is to protect vital electrical components and to prevent\nabnormal event progression through early detection and diagnosis. This work\npresents a fast forward artificial neural network model to detect some of the\ncommonly occurring electrical faults like overvoltage, under voltage, single\nphasing, unbalanced voltage, overload, ground fault. A separate model free\nmonitoring system wherein the motor itself acts like a sensor is presented and\nthe only monitored signals are the input given to the motor. Limits for current\nand voltage values are set for the faulty and healthy conditions, which is done\nby a classifier. Real time data from a 0.33 HP induction motor is used to train\nand test the neural network. The model so developed analyses the voltage and\ncurrent values given at a particular instant and classifies the data into no\nfault or the specific fault. The model is then interfaced with a real motor to\naccurately detect and classify the faults so that further necessary action can\nbe taken.", "paper_summary_zh": "感應馬達是最重要的電氣設備之一，廣泛用於各種產業應用。本文提出一個機器學習模型，使用三相電壓和電流作為輸入，用於感應馬達故障的故障偵測和分類。這項工作的目的是保護重要的電氣元件，並透過早期偵測和診斷來防止異常事件的發生。這項工作提出了一個快速前饋人工神經網路模型，用於偵測一些常見的電氣故障，例如過電壓、欠電壓、單相、電壓不平衡、過載、接地故障。提出了一個單獨的模型自由監控系統，其中馬達本身就像一個感測器，而唯一監控的訊號是輸入給馬達的訊號。電流和電壓值的限制設定為故障和健康狀況，這是由分類器完成的。來自 0.33 HP 感應馬達的即時資料用於訓練和測試神經網路。如此開發的模型會分析特定時刻給定的電壓和電流值，並將資料分類為無故障或特定故障。然後將模型與真實馬達介接，以準確偵測和分類故障，以便採取進一步必要的措施。", "author": "Kavana Venkatesh et.al.", "authors": "Kavana Venkatesh, Neethi M", "id": "2409.09944v1", "paper_url": "http://arxiv.org/abs/2409.09944v1", "repo": "null"}}