{"2410.19572": {"publish_time": "2024-10-25", "title": "ChunkRAG: Novel LLM-Chunk Filtering Method for RAG Systems", "paper_summary": "Retrieval-Augmented Generation (RAG) systems using large language models\n(LLMs) often generate inaccurate responses due to the retrieval of irrelevant\nor loosely related information. Existing methods, which operate at the document\nlevel, fail to effectively filter out such content. We propose LLM-driven chunk\nfiltering, ChunkRAG, a framework that enhances RAG systems by evaluating and\nfiltering retrieved information at the chunk level. Our approach employs\nsemantic chunking to divide documents into coherent sections and utilizes\nLLM-based relevance scoring to assess each chunk's alignment with the user's\nquery. By filtering out less pertinent chunks before the generation phase, we\nsignificantly reduce hallucinations and improve factual accuracy. Experiments\nshow that our method outperforms existing RAG models, achieving higher accuracy\non tasks requiring precise information retrieval. This advancement enhances the\nreliability of RAG systems, making them particularly beneficial for\napplications like fact-checking and multi-hop reasoning.", "paper_summary_zh": "檢索增強生成（RAG）系統使用大型語言模型（LLM），通常會因檢索到不相關或關聯性較低資訊而產生不準確的回應。現有方法在文件層級運作，無法有效濾除此類內容。我們提出 LLM 驅動的區塊過濾，ChunkRAG，一個透過在區塊層級評估和過濾檢索資訊來增強 RAG 系統的架構。我們的做法使用語意區塊化將文件分割成連貫的區段，並利用基於 LLM 的相關性評分來評估每個區塊與使用者查詢的一致性。透過在生成階段之前過濾掉較不相關的區塊，我們大幅減少幻覺並提升事實準確性。實驗顯示，我們的做法優於現有的 RAG 模型，在需要精確資訊檢索的任務中達成更高的準確性。這項進展增強了 RAG 系統的可靠性，使其特別有利於事實查核和多跳推理等應用。", "author": "Ritvik Aggarwal Ishneet Sukhvinder Singh Ibrahim Allahverdiyev et.al.", "authors": "Ritvik Aggarwal Ishneet Sukhvinder Singh Ibrahim Allahverdiyev, Muhammad Taha, Aslihan Akalin, Kevin Zhu", "id": "2410.19572v1", "paper_url": "http://arxiv.org/abs/2410.19572v1", "repo": "null"}}