{"2412.15797": {"publish_time": "2024-12-20", "title": "Ensembling Large Language Models with Process Reward-Guided Tree Search for Better Complex Reasoning", "paper_summary": "Despite recent advances in large language models, open-source models often\nstruggle to consistently perform well on complex reasoning tasks. Existing\nensemble methods, whether applied at the token or output levels, fail to\naddress these challenges. In response, we present Language model Ensemble with\nMonte Carlo Tree Search (LE-MCTS), a novel framework for process-level\nensembling of language models. LE-MCTS formulates step-by-step reasoning with\nan ensemble of language models as a Markov decision process. In this framework,\nstates represent intermediate reasoning paths, while actions consist of\ngenerating the next reasoning step using one of the language models selected\nfrom a predefined pool. Guided by a process-based reward model, LE-MCTS\nperforms a tree search over the reasoning steps generated by different language\nmodels, identifying the most accurate reasoning chain. Experimental results on\nfive mathematical reasoning benchmarks demonstrate that our approach\noutperforms both single language model decoding algorithms and language model\nensemble methods. Notably, LE-MCTS improves performance by 3.6% and 4.3% on the\nMATH and MQA datasets, respectively, highlighting its effectiveness in solving\ncomplex reasoning problems.", "paper_summary_zh": "儘管大型語言模型近期有長足進展，但開放原始碼模型在複雜推理任務中常無法持續表現良好。現有的整體方法，無論應用於符號或輸出層級，都無法應對這些挑戰。為了解決此問題，我們提出了語言模型整體與蒙地卡羅樹狀搜尋 (LE-MCTS)，這是一個創新的框架，用於語言模型的流程層級整體。LE-MCTS 將使用語言模型整體進行逐步推理，制定為馬可夫決策流程。在此框架中，狀態代表中間推理路徑，而動作則包含使用從預定義池中選取的語言模型之一來產生下一個推理步驟。在基於流程的獎勵模型的指導下，LE-MCTS 會針對不同語言模型產生的推理步驟執行樹狀搜尋，找出最準確的推理鏈。在五個數學推理基準上的實驗結果顯示，我們的做法優於單一語言模型解碼演算法和語言模型整體方法。值得注意的是，LE-MCTS 分別在 MATH 和 MQA 資料集上將效能提升了 3.6% 和 4.3%，突顯其在解決複雜推理問題上的有效性。", "author": "Sungjin Park et.al.", "authors": "Sungjin Park, Xiao Liu, Yeyun Gong, Edward Choi", "id": "2412.15797v1", "paper_url": "http://arxiv.org/abs/2412.15797v1", "repo": "null"}}