{"2502.15503": {"publish_time": "2025-02-21", "title": "BAN: Neuroanatomical Aligning in Auditory Recognition between Artificial Neural Network and Human Cortex", "paper_summary": "Drawing inspiration from neurosciences, artificial neural networks (ANNs)\nhave evolved from shallow architectures to highly complex, deep structures,\nyielding exceptional performance in auditory recognition tasks. However,\ntraditional ANNs often struggle to align with brain regions due to their\nexcessive depth and lack of biologically realistic features, like recurrent\nconnection. To address this, a brain-like auditory network (BAN) is introduced,\nwhich incorporates four neuroanatomically mapped areas and recurrent\nconnection, guided by a novel metric called the brain-like auditory score\n(BAS). BAS serves as a benchmark for evaluating the similarity between BAN and\nhuman auditory recognition pathway. We further propose that specific areas in\nthe cerebral cortex, mainly the middle and medial superior temporal (T2/T3)\nareas, correspond to the designed network structure, drawing parallels with the\nbrain's auditory perception pathway. Our findings suggest that the\nneuroanatomical similarity in the cortex and auditory classification abilities\nof the ANN are well-aligned. In addition to delivering excellent performance on\na music genre classification task, the BAN demonstrates a high BAS score. In\nconclusion, this study presents BAN as a recurrent, brain-inspired ANN,\nrepresenting the first model that mirrors the cortical pathway of auditory\nrecognition.", "paper_summary_zh": "<paragraph>從神經科學中汲取靈感，人工神經網路 (ANN) 已從淺層架構演變成高度複雜的深度結構，在聽覺辨識任務中產生了非凡的表現。然而，傳統的 ANN 往往因為深度過深且缺乏生物學上真實的特徵（例如遞迴連接），而難以與大腦區域對齊。為了解決這個問題，引入了類腦聽覺網路 (BAN)，它結合了四個神經解剖學對應區域和遞迴連接，並由一種稱為類腦聽覺評分 (BAS) 的新指標所引導。BAS 用於評估 BAN 和人類聽覺辨識路徑之間的相似性。我們進一步提出，大腦皮層中的特定區域（主要是中上顳葉 (T2/T3) 區域）與設計的網路結構相應，與大腦的聽覺感知路徑產生了類比。我們的發現表明，皮層中的神經解剖學相似性與 ANN 的聽覺分類能力是高度一致的。除了在音樂類型分類任務中表現優異之外，BAN 還展示了很高的 BAS 分數。總之，本研究將 BAN 呈現為一種遞迴的、受大腦啟發的 ANN，代表了第一個反映聽覺辨識皮質路徑的模型。</paragraph>", "author": "Haidong Wang et.al.", "authors": "Haidong Wang, Pengfei Xiao, Ao Liu, Jianhua Zhang, Qia Shan", "id": "2502.15503v1", "paper_url": "http://arxiv.org/abs/2502.15503v1", "repo": "null"}}