{"2407.15399": {"publish_time": "2024-07-22", "title": "Imposter.AI: Adversarial Attacks with Hidden Intentions towards Aligned Large Language Models", "paper_summary": "With the development of large language models (LLMs) like ChatGPT, both their\nvast applications and potential vulnerabilities have come to the forefront.\nWhile developers have integrated multiple safety mechanisms to mitigate their\nmisuse, a risk remains, particularly when models encounter adversarial inputs.\nThis study unveils an attack mechanism that capitalizes on human conversation\nstrategies to extract harmful information from LLMs. We delineate three pivotal\nstrategies: (i) decomposing malicious questions into seemingly innocent\nsub-questions; (ii) rewriting overtly malicious questions into more covert,\nbenign-sounding ones; (iii) enhancing the harmfulness of responses by prompting\nmodels for illustrative examples. Unlike conventional methods that target\nexplicit malicious responses, our approach delves deeper into the nature of the\ninformation provided in responses. Through our experiments conducted on\nGPT-3.5-turbo, GPT-4, and Llama2, our method has demonstrated a marked efficacy\ncompared to conventional attack methods. In summary, this work introduces a\nnovel attack method that outperforms previous approaches, raising an important\nquestion: How to discern whether the ultimate intent in a dialogue is\nmalicious?", "paper_summary_zh": "隨著大型語言模型 (LLM) 如 ChatGPT 的發展，其廣泛應用和潛在漏洞都已浮出檯面。雖然開發人員已整合多種安全機制來減輕其被濫用的風險，但風險仍然存在，特別是當模型遇到對抗性輸入時。本研究揭示了一種攻擊機制，利用人類對話策略從 LLM 中提取有害資訊。我們描繪出三個關鍵策略：(i) 將惡意問題分解成看似無害的子問題；(ii) 將明顯惡意的問題改寫成更隱蔽、聽起來良性的問題；(iii) 透過提示模型提供說明性範例，來提升回應的危害性。與針對明確惡意回應的傳統方法不同，我們的做法更深入探討回應中提供的資訊的本質。透過我們在 GPT-3.5-turbo、GPT-4 和 Llama2 上進行的實驗，我們的做法已展現出顯著的功效，優於傳統的攻擊方法。總之，這項工作引進了一種新穎的攻擊方法，其效能優於先前的做法，並提出了一個重要的問題：如何辨別對話中的最終意圖是否惡意？", "author": "Xiao Liu et.al.", "authors": "Xiao Liu, Liangzhi Li, Tong Xiang, Fuying Ye, Lu Wei, Wangyue Li, Noa Garcia", "id": "2407.15399v1", "paper_url": "http://arxiv.org/abs/2407.15399v1", "repo": "null"}}