{"2412.10182": {"publish_time": "2024-12-13", "title": "Multi-Head Encoding for Extreme Label Classification", "paper_summary": "The number of categories of instances in the real world is normally huge, and\neach instance may contain multiple labels. To distinguish these massive labels\nutilizing machine learning, eXtreme Label Classification (XLC) has been\nestablished. However, as the number of categories increases, the number of\nparameters and nonlinear operations in the classifier also rises. This results\nin a Classifier Computational Overload Problem (CCOP). To address this, we\npropose a Multi-Head Encoding (MHE) mechanism, which replaces the vanilla\nclassifier with a multi-head classifier. During the training process, MHE\ndecomposes extreme labels into the product of multiple short local labels, with\neach head trained on these local labels. During testing, the predicted labels\ncan be directly calculated from the local predictions of each head. This\nreduces the computational load geometrically. Then, according to the\ncharacteristics of different XLC tasks, e.g., single-label, multi-label, and\nmodel pretraining tasks, three MHE-based implementations, i.e., Multi-Head\nProduct, Multi-Head Cascade, and Multi-Head Sampling, are proposed to more\neffectively cope with CCOP. Moreover, we theoretically demonstrate that MHE can\nachieve performance approximately equivalent to that of the vanilla classifier\nby generalizing the low-rank approximation problem from Frobenius-norm to\nCross-Entropy. Experimental results show that the proposed methods achieve\nstate-of-the-art performance while significantly streamlining the training and\ninference processes of XLC tasks. The source code has been made public at\nhttps://github.com/Anoise/MHE.", "paper_summary_zh": "<paragraph>現實世界中實例類別的數量通常龐大，且每個實例可能包含多個標籤。為了利用機器學習來區分這些大量的標籤，已建立極端標籤分類 (XLC)。然而，隨著類別數量的增加，分類器中的參數和非線性運算數量也會增加。這導致分類器計算過載問題 (CCOP)。為了解決這個問題，我們提出了一個多頭編碼 (MHE) 機制，它以一個多頭分類器取代了香草分類器。在訓練過程中，MHE 將極端標籤分解為多個較短的局部標籤的乘積，每個頭部都在這些局部標籤上進行訓練。在測試期間，可以根據每個頭部的局部預測直接計算預測標籤。這在幾何上減少了計算負載。然後，根據不同的 XLC 任務的特徵，例如單標籤、多標籤和模型預訓練任務，提出了三種基於 MHE 的實現，即多頭乘積、多頭串聯和多頭抽樣，以更有效地應對 CCOP。此外，我們從理論上證明了 MHE 可以通過將低秩逼近問題從 Frobenius 範數推廣到交叉熵來實現與香草分類器近似的性能。實驗結果表明，所提出的方法在顯著簡化 XLC 任務的訓練和推理過程的同時，實現了最先進的性能。源代碼已公開在 https://github.com/Anoise/MHE。</paragraph>", "author": "Daojun Liang et.al.", "authors": "Daojun Liang, Haixia Zhang, Dongfeng Yuan, Minggao Zhang", "id": "2412.10182v1", "paper_url": "http://arxiv.org/abs/2412.10182v1", "repo": "https://github.com/anoise/mhe"}}