{"2502.15418": {"publish_time": "2025-02-21", "title": "MHQA: A Diverse, Knowledge Intensive Mental Health Question Answering Challenge for Language Models", "paper_summary": "Mental health remains a challenging problem all over the world, with issues\nlike depression, anxiety becoming increasingly common. Large Language Models\n(LLMs) have seen a vast application in healthcare, specifically in answering\nmedical questions. However, there is a lack of standard benchmarking datasets\nfor question answering (QA) in mental health. Our work presents a novel\nmultiple choice dataset, MHQA (Mental Health Question Answering), for\nbenchmarking Language models (LMs). Previous mental health datasets have\nfocused primarily on text classification into specific labels or disorders.\nMHQA, on the other hand, presents question-answering for mental health focused\non four key domains: anxiety, depression, trauma, and obsessive/compulsive\nissues, with diverse question types, namely, factoid, diagnostic, prognostic,\nand preventive. We use PubMed abstracts as the primary source for QA. We\ndevelop a rigorous pipeline for LLM-based identification of information from\nabstracts based on various selection criteria and converting it into QA pairs.\nFurther, valid QA pairs are extracted based on post-hoc validation criteria.\nOverall, our MHQA dataset consists of 2,475 expert-verified gold standard\ninstances called MHQA-gold and ~56.1k pairs pseudo labeled using external\nmedical references. We report F1 scores on different LLMs along with few-shot\nand supervised fine-tuning experiments, further discussing the insights for the\nscores.", "paper_summary_zh": "<paragraph>心理健康仍然是全球一個具有挑戰性的問題，其中抑鬱、焦慮等問題正變得越來越普遍。大型語言模型 (LLM) 已在醫療保健領域獲得廣泛應用，特別是在回答醫療問題方面。然而，心理健康領域的問題解答 (QA) 缺乏標準基準數據集。我們的研究提供了一個新的多選項數據集 MHQA（心理健康問題解答），用於基準測試語言模型 (LM)。以前的心理健康數據集主要集中於將文本分類為具體標籤或疾病。另一方面，MHQA 針對心理健康提供問題解答，重點關注四個關鍵領域：焦慮、抑鬱、創傷和強迫症問題，並具有多樣化的問題類型，即事實、診斷、預後和預防。我們使用 PubMed 摘要作為 QA 的主要來源。我們開發了一個嚴謹的管道，用於基於 LLM 從摘要中識別信息，基於各種選擇標準並將其轉換為 QA 對。此外，根據事後驗證標準提取有效的 QA 對。總體而言，我們的 MHQA 數據集包含 2,475 個由專家驗證的金標準實例，稱為 MHQA-gold，以及使用外部醫療參考文獻偽標記的約 56.1k 對。我們報告了不同 LLM 上的 F1 分數以及少次和監督微調實驗，進一步討論了對分數的見解。</paragraph>", "author": "Suraj Racha et.al.", "authors": "Suraj Racha, Prashant Joshi, Anshika Raman, Nikita Jangid, Mridul Sharma, Ganesh Ramakrishnan, Nirmal Punjabi", "id": "2502.15418v1", "paper_url": "http://arxiv.org/abs/2502.15418v1", "repo": "null"}}