{"2408.04226": {"publish_time": "2024-08-08", "title": "Evaluating Language Model Math Reasoning via Grounding in Educational Curricula", "paper_summary": "Our work presents a novel angle for evaluating language models' (LMs)\nmathematical abilities, by investigating whether they can discern skills and\nconcepts enabled by math content. We contribute two datasets: one consisting of\n385 fine-grained descriptions of K-12 math skills and concepts, or standards,\nfrom Achieve the Core (ATC), and another of 9.9K problems labeled with these\nstandards (MathFish). Working with experienced teachers, we find that LMs\nstruggle to tag and verify standards linked to problems, and instead predict\nlabels that are close to ground truth, but differ in subtle ways. We also show\nthat LMs often generate problems that do not fully align with standards\ndescribed in prompts. Finally, we categorize problems in GSM8k using math\nstandards, allowing us to better understand why some problems are more\ndifficult to solve for models than others.", "paper_summary_zh": "我們的研究提出了一個評估語言模型 (LM) 數學能力的新角度，方法是調查它們是否能辨別數學內容所啟用的技能和概念。我們貢獻了兩個數據集：一個包含 385 個 K-12 數學技能和概念或標準的細緻描述，來自 Achieve the Core (ATC)，另一個包含 9.9K 個標記了這些標準的問題 (MathFish)。與經驗豐富的老師合作，我們發現 LM 很難標記和驗證與問題相關的標準，而是預測接近真實情況但以微妙方式不同的標籤。我們還展示了 LM 通常會產生與提示中描述的標準完全不一致的問題。最後，我們使用數學標準對 GSM8k 中的問題進行分類，讓我們能更好地了解為什麼某些問題對模型來說比其他問題更難解決。", "author": "Li Lucy et.al.", "authors": "Li Lucy, Tal August, Rose E. Wang, Luca Soldaini, Courtney Allison, Kyle Lo", "id": "2408.04226v1", "paper_url": "http://arxiv.org/abs/2408.04226v1", "repo": "https://github.com/allenai/mathfish"}}