{"2502.06828": {"publish_time": "2025-02-05", "title": "Fine-Tuning Strategies for Continual Online EEG Motor Imagery Decoding: Insights from a Large-Scale Longitudinal Study", "paper_summary": "This study investigates continual fine-tuning strategies for deep learning in\nonline longitudinal electroencephalography (EEG) motor imagery (MI) decoding\nwithin a causal setting involving a large user group and multiple sessions per\nparticipant. We are the first to explore such strategies across a large user\ngroup, as longitudinal adaptation is typically studied in the single-subject\nsetting with a single adaptation strategy, which limits the ability to\ngeneralize findings. First, we examine the impact of different fine-tuning\napproaches on decoder performance and stability. Building on this, we integrate\nonline test-time adaptation (OTTA) to adapt the model during deployment,\ncomplementing the effects of prior fine-tuning. Our findings demonstrate that\nfine-tuning that successively builds on prior subject-specific information\nimproves both performance and stability, while OTTA effectively adapts the\nmodel to evolving data distributions across consecutive sessions, enabling\ncalibration-free operation. These results offer valuable insights and\nrecommendations for future research in longitudinal online MI decoding and\nhighlight the importance of combining domain adaptation strategies for\nimproving BCI performance in real-world applications. Clinical Relevance: Our\ninvestigation enables more stable and efficient long-term motor imagery\ndecoding, which is critical for neurorehabilitation and assistive technologies.", "paper_summary_zh": "本研究探討在因果關係設定中涉及大量使用者群組和每個參與者多個階段的線上縱向腦電圖 (EEG) 運動想像 (MI) 解碼中，深度學習的持續微調策略。我們是第一個在大量使用者群組中探討此類策略，因為縱向適應通常在單一主體設定中研究，並使用單一適應策略，這限制了推廣研究結果的能力。首先，我們探討不同微調方法對解碼器效能和穩定性的影響。在此基礎上，我們整合線上測試時間適應 (OTTA) 以在部署期間適應模型，補充先前微調的效果。我們的研究結果表明，連續建立在先前特定主體資訊上的微調可以同時改善效能和穩定性，而 OTTA 可以有效地適應連續階段中不斷變化的資料分佈，從而實現無需校準的操作。這些結果為縱向線上 MI 解碼的未來研究提供了有價值的見解和建議，並強調了結合領域適應策略以改善實際應用中 BCI 效能的重要性。臨床相關性：我們的研究可以實現更穩定、更有效的長期運動想像解碼，這對於神經復健和輔助技術至關重要。", "author": "Martin Wimpff et.al.", "authors": "Martin Wimpff, Bruno Aristimunha, Sylvain Chevallier, Bin Yang", "id": "2502.06828v1", "paper_url": "http://arxiv.org/abs/2502.06828v1", "repo": "null"}}