{"2407.15621": {"publish_time": "2024-07-22", "title": "RadioRAG: Factual Large Language Models for Enhanced Diagnostics in Radiology Using Dynamic Retrieval Augmented Generation", "paper_summary": "Large language models (LLMs) have advanced the field of artificial\nintelligence (AI) in medicine. However LLMs often generate outdated or\ninaccurate information based on static training datasets. Retrieval augmented\ngeneration (RAG) mitigates this by integrating outside data sources. While\nprevious RAG systems used pre-assembled, fixed databases with limited\nflexibility, we have developed Radiology RAG (RadioRAG) as an end-to-end\nframework that retrieves data from authoritative radiologic online sources in\nreal-time. RadioRAG is evaluated using a dedicated radiologic\nquestion-and-answer dataset (RadioQA). We evaluate the diagnostic accuracy of\nvarious LLMs when answering radiology-specific questions with and without\naccess to additional online information via RAG. Using 80 questions from RSNA\nCase Collection across radiologic subspecialties and 24 additional\nexpert-curated questions, for which the correct gold-standard answers were\navailable, LLMs (GPT-3.5-turbo, GPT-4, Mistral-7B, Mixtral-8x7B, and Llama3 [8B\nand 70B]) were prompted with and without RadioRAG. RadioRAG retrieved\ncontext-specific information from www.radiopaedia.org in real-time and\nincorporated them into its reply. RadioRAG consistently improved diagnostic\naccuracy across all LLMs, with relative improvements ranging from 2% to 54%. It\nmatched or exceeded question answering without RAG across radiologic\nsubspecialties, particularly in breast imaging and emergency radiology.\nHowever, degree of improvement varied among models; GPT-3.5-turbo and\nMixtral-8x7B-instruct-v0.1 saw notable gains, while Mistral-7B-instruct-v0.2\nshowed no improvement, highlighting variability in its effectiveness. LLMs\nbenefit when provided access to domain-specific data beyond their training\ndata. For radiology, RadioRAG establishes a robust framework that substantially\nimproves diagnostic accuracy and factuality in radiological question answering.", "paper_summary_zh": "大型語言模型 (LLM) 提升了人工智慧 (AI) 在醫學領域的進展。然而，LLM 經常根據靜態訓練資料集產生過時或不準確的資訊。檢索擴增生成 (RAG) 透過整合外部資料來源來減輕這個問題。雖然先前的 RAG 系統使用預先組裝、具有有限彈性的固定資料庫，但我們已開發放射科 RAG (RadioRAG) 作為一個端對端架構，可從權威的線上放射科來源即時檢索資料。RadioRAG 使用專門的放射科問答資料集 (RadioQA) 進行評估。我們評估各種 LLM 在回答放射科特定問題時的診斷準確性，無論是否透過 RAG 存取額外的線上資訊。使用來自 RSNA 案例彙編的 80 個涵蓋放射科次專科的問題和 24 個額外的專家策劃問題（有正確的金標準答案），提示 LLM（GPT-3.5-turbo、GPT-4、Mistral-7B、Mixtral-8x7B 和 Llama3 [8B 和 70B]），無論是否使用 RadioRAG。RadioRAG 從 www.radiopaedia.org 即時檢索特定於脈絡的資訊，並將其納入回覆中。RadioRAG 持續改善所有 LLM 的診斷準確性，相對改善幅度從 2% 到 54%。它在放射科次專科中達到或超過沒有 RAG 的問答準確性，特別是在乳房影像和急診放射科中。然而，不同模型之間的改善程度有所不同；GPT-3.5-turbo 和 Mixtral-8x7B-instruct-v0.1 有顯著的進步，而 Mistral-7B-instruct-v0.2 沒有改善，突顯其有效性的變異性。LLM 在獲得超出其訓練資料的特定領域資料時會受益。對於放射科，RadioRAG 建立了一個強大的架構，可大幅改善放射科問答中的診斷準確性和真實性。", "author": "Soroosh Tayebi Arasteh et.al.", "authors": "Soroosh Tayebi Arasteh, Mahshad Lotfinia, Keno Bressem, Robert Siepmann, Dyke Ferber, Christiane Kuhl, Jakob Nikolas Kather, Sven Nebelung, Daniel Truhn", "id": "2407.15621v1", "paper_url": "http://arxiv.org/abs/2407.15621v1", "repo": "null"}}