{"2412.07197": {"publish_time": "2024-12-10", "title": "Hierarchical Split Federated Learning: Convergence Analysis and System Optimization", "paper_summary": "As AI models expand in size, it has become increasingly challenging to deploy\nfederated learning (FL) on resource-constrained edge devices. To tackle this\nissue, split federated learning (SFL) has emerged as an FL framework with\nreduced workload on edge devices via model splitting; it has received extensive\nattention from the research community in recent years. Nevertheless, most prior\nworks on SFL focus only on a two-tier architecture without harnessing\nmulti-tier cloudedge computing resources. In this paper, we intend to analyze\nand optimize the learning performance of SFL under multi-tier systems.\nSpecifically, we propose the hierarchical SFL (HSFL) framework and derive its\nconvergence bound. Based on the theoretical results, we formulate a joint\noptimization problem for model splitting (MS) and model aggregation (MA). To\nsolve this rather hard problem, we then decompose it into MS and MA subproblems\nthat can be solved via an iterative descending algorithm. Simulation results\ndemonstrate that the tailored algorithm can effectively optimize MS and MA for\nSFL within virtually any multi-tier system.", "paper_summary_zh": "隨著 AI 模型規模的擴大，在資源受限的邊緣裝置上部署聯合學習（FL）變得越來越困難。為了解決這個問題，拆分聯合學習（SFL）作為一種 FL 框架出現，透過模型拆分減少邊緣裝置上的工作負載；近年來它受到了研究社群廣泛的關注。儘管如此，大多數先前關於 SFL 的研究僅專注於二層架構，而沒有利用多層雲端邊緣運算資源。在本文中，我們打算分析和最佳化多層系統下 SFL 的學習效能。具體來說，我們提出了階層式 SFL（HSFL）框架並推導其收斂界限。根據理論結果，我們制定了一個模型拆分（MS）和模型聚合（MA）的聯合最佳化問題。為了解決這個相當困難的問題，我們接著將其分解成 MS 和 MA 子問題，這些子問題可以用反覆遞降演算法來解決。模擬結果證明，量身打造的演算法可以在幾乎任何多層系統中有效最佳化 SFL 的 MS 和 MA。", "author": "Zheng Lin et.al.", "authors": "Zheng Lin, Wei Wei, Zhe Chen, Chan-Tong Lam, Xianhao Chen, Yue Gao, Jun Luo", "id": "2412.07197v1", "paper_url": "http://arxiv.org/abs/2412.07197v1", "repo": "null"}}