{"2407.11676": {"publish_time": "2024-07-16", "title": "SKADA-Bench: Benchmarking Unsupervised Domain Adaptation Methods with Realistic Validation", "paper_summary": "Unsupervised Domain Adaptation (DA) consists of adapting a model trained on a\nlabeled source domain to perform well on an unlabeled target domain with some\ndata distribution shift. While many methods have been proposed in the\nliterature, fair and realistic evaluation remains an open question,\nparticularly due to methodological difficulties in selecting hyperparameters in\nthe unsupervised setting. With SKADA-Bench, we propose a framework to evaluate\nDA methods and present a fair evaluation of existing shallow algorithms,\nincluding reweighting, mapping, and subspace alignment. Realistic\nhyperparameter selection is performed with nested cross-validation and various\nunsupervised model selection scores, on both simulated datasets with controlled\nshifts and real-world datasets across diverse modalities, such as images, text,\nbiomedical, and tabular data with specific feature extraction. Our benchmark\nhighlights the importance of realistic validation and provides practical\nguidance for real-life applications, with key insights into the choice and\nimpact of model selection approaches. SKADA-Bench is open-source, reproducible,\nand can be easily extended with novel DA methods, datasets, and model selection\ncriteria without requiring re-evaluating competitors. SKADA-Bench is available\non GitHub at https://github.com/scikit-adaptation/skada-bench.", "paper_summary_zh": "無監督域適應 (DA) 是將在標籤來源域上訓練的模型調整為在具有某些資料分佈轉移的未標籤目標域上表現良好。雖然文獻中已提出許多方法，但公平且現實的評估仍然是一個公開的問題，特別是因為在無監督環境中選擇超參數的方法論困難。有了 SKADA-Bench，我們提出了一個評估 DA 方法的架構，並對現有的淺層演算法進行公平的評估，包括重新加權、對應和子空間對齊。在模擬資料集（具有受控轉移）和跨不同模式（例如影像、文字、生物醫學和具有特定特徵萃取的表格資料）的真實世界資料集上，使用嵌套交叉驗證和各種無監督模型選擇評分來執行現實的超參數選擇。我們的基準強調了現實驗證的重要性，並為實際應用提供實用的指導，深入了解模型選擇方法的選擇和影響。SKADA-Bench 是開源的、可複製的，並且可以輕鬆地擴充新的 DA 方法、資料集和模型選擇標準，而不需要重新評估競爭者。SKADA-Bench 可在 GitHub 上的 https://github.com/scikit-adaptation/skada-bench 取得。", "author": "Yanis Lalou et.al.", "authors": "Yanis Lalou, Théo Gnassounou, Antoine Collas, Antoine de Mathelin, Oleksii Kachaiev, Ambroise Odonnat, Alexandre Gramfort, Thomas Moreau, Rémi Flamary", "id": "2407.11676v1", "paper_url": "http://arxiv.org/abs/2407.11676v1", "repo": "https://github.com/scikit-adaptation/skada-bench"}}