{"2408.16326": {"publish_time": "2024-08-29", "title": "Critic-CoT: Boosting the reasoning abilities of large language model via Chain-of-thoughts Critic", "paper_summary": "Self-critic has become an important mechanism for enhancing the reasoning\nperformance of LLMs. However, current approaches mainly involve basic prompts\nwithout further training, which tend to be over-simplified, leading to limited\naccuracy.Moreover, there is a lack of in-depth investigation of the\nrelationship between LLM's ability to criticism and its task-solving\nperformance.To address these issues, we propose Critic-CoT, a novel framework\nthat pushes LLMs toward System-2-like critic capability, via step-wise CoT\nreasoning format and distant-supervision data construction, without the need\nfor human annotation. Experiments on GSM8K and MATH show that via filtering out\ninvalid solutions or iterative refinement, our enhanced model boosts\ntask-solving performance, which demonstrates the effectiveness of our method.\nFurther, we find that training on critique and refinement alone improves the\ngeneration. We hope our work could shed light on future research on improving\nthe reasoning and critic ability of LLMs.", "paper_summary_zh": "自我批評已成為增強 LLM 推理效能的重要機制。然而，目前的做法主要涉及基本提示，而無需進一步訓練，這往往過於簡化，導致準確性有限。此外，對於 LLM 批評能力與其任務解決效能之間的關係，缺乏深入探討。為了解決這些問題，我們提出了 Critic-CoT，一個新穎的框架，透過逐步 CoT 推理格式和遠程監督數據建構，將 LLM 推向類似系統 2 的批評能力，而無需人工註解。在 GSM8K 和 MATH 上的實驗表明，透過過濾無效解或迭代改進，我們增強的模型提升了任務解決效能，這證明了我們方法的有效性。此外，我們發現僅針對批評和改進進行訓練就能改善生成。我們希望我們的研究成果能為未來關於改善 LLM 推理和批評能力的研究提供啟發。", "author": "Xin Zheng et.al.", "authors": "Xin Zheng, Jie Lou, Boxi Cao, Xueru Wen, Yuqiu Ji, Hongyu Lin, Yaojie Lu, Xianpei Han, Debing Zhang, Le Sun", "id": "2408.16326v1", "paper_url": "http://arxiv.org/abs/2408.16326v1", "repo": "null"}}