{"2407.12197": {"publish_time": "2024-07-16", "title": "Towards Interpretable Visuo-Tactile Predictive Models for Soft Robot Interactions", "paper_summary": "Autonomous systems face the intricate challenge of navigating unpredictable\nenvironments and interacting with external objects. The successful integration\nof robotic agents into real-world situations hinges on their perception\ncapabilities, which involve amalgamating world models and predictive skills.\nEffective perception models build upon the fusion of various sensory modalities\nto probe the surroundings. Deep learning applied to raw sensory modalities\noffers a viable option. However, learning-based perceptive representations\nbecome difficult to interpret. This challenge is particularly pronounced in\nsoft robots, where the compliance of structures and materials makes prediction\neven harder. Our work addresses this complexity by harnessing a generative\nmodel to construct a multi-modal perception model for soft robots and to\nleverage proprioceptive and visual information to anticipate and interpret\ncontact interactions with external objects. A suite of tools to interpret the\nperception model is furnished, shedding light on the fusion and prediction\nprocesses across multiple sensory inputs after the learning phase. We will\ndelve into the outlooks of the perception model and its implications for\ncontrol purposes.", "paper_summary_zh": "自主系統面臨在不可預測的環境中導航和與外部物體互動的複雜挑戰。機器人代理成功整合到現實世界的情況取決於它們的感知能力，這涉及融合世界模型和預測技能。有效的感知模型建立在融合各種感官模式以探測周圍環境的基礎上。應用於原始感官模式的深度學習提供了一個可行的選項。然而，基於學習的感知表徵難以解釋。這個挑戰在軟機器人中尤為明顯，其中結構和材料的柔順性使得預測更加困難。我們的研究通過利用生成模型來構建軟機器人的多模式感知模型，並利用本体感覺和視覺信息來預測和解釋與外部物體的接觸交互，從而解決了這種複雜性。提供了一套解釋感知模型的工具，在學習階段後闡明了跨多個感官輸入的融合和預測過程。我們將深入探討感知模型的前景及其對控制目的的影響。", "author": "Enrico Donato et.al.", "authors": "Enrico Donato, Thomas George Thuruthel, Egidio Falotico", "id": "2407.12197v1", "paper_url": "http://arxiv.org/abs/2407.12197v1", "repo": "null"}}