{"2409.15971": {"publish_time": "2024-09-24", "title": "Creating Healthy Friction: Determining Stakeholder Requirements of Job Recommendation Explanations", "paper_summary": "The increased use of information retrieval in recruitment, primarily through\njob recommender systems (JRSs), can have a large impact on job seekers,\nrecruiters, and companies. As a result, such systems have been determined to be\nhigh-risk in recent legislature. This requires JRSs to be trustworthy and\ntransparent, allowing stakeholders to understand why specific recommendations\nwere made. To fulfill this requirement, the stakeholders' exact preferences and\nneeds need to be determined. To do so, we evaluated an explainable job\nrecommender system using a realistic, task-based, mixed-design user study\n(n=30) in which stakeholders had to make decisions based on the model's\nexplanations. This mixed-methods evaluation consisted of two objective metrics\n- correctness and efficiency, along with three subjective metrics - trust,\ntransparency, and usefulness. These metrics were evaluated twice per\nparticipant, once using real explanations and once using random explanations.\nThe study included a qualitative analysis following a think-aloud protocol\nwhile performing tasks adapted to each stakeholder group. We find that\nproviding stakeholders with real explanations does not significantly improve\ndecision-making speed and accuracy. Our results showed a non-significant trend\nfor the real explanations to outperform the random ones on perceived trust,\nusefulness, and transparency of the system for all stakeholder types. We\ndetermine that stakeholders benefit more from interacting with explanations as\ndecision support capable of providing healthy friction, rather than as\npreviously-assumed persuasive tools.", "paper_summary_zh": "資訊檢索在招募中的使用日益增加，主要是透過工作推薦系統 (JRS)，這可能會對求職者、招募人員和公司產生重大影響。因此，此類系統在最近的立法中已被認定為高風險。這要求 JRS 值得信賴且透明，讓利害關係人了解為何提出特定建議。為滿足此要求，需要確定利害關係人的確切偏好和需求。為此，我們使用一個現實的、基於任務的、混合設計使用者研究 (n=30) 來評估一個可解釋的工作推薦系統，其中利害關係人必須根據模型的解釋做出決策。這種混合方法評估包含兩個客觀指標 - 正確性和效率，以及三個主觀指標 - 信任、透明度和有用性。這些指標每位參與者評估兩次，一次使用真實解釋，一次使用隨機解釋。該研究包括在執行適應每個利害關係人組別的任務時遵循思考出聲協定的定性分析。我們發現，向利害關係人提供真實解釋並未顯著提高決策速度和準確性。我們的結果顯示，對於所有利害關係人類型，真實解釋在系統的感知信任度、有用性和透明度方面優於隨機解釋的趨勢不顯著。我們確定，利害關係人從與解釋互動中受益更多，因為解釋作為決策支援能夠提供有益的摩擦，而不是先前假設的說服工具。", "author": "Roan Schellingerhout et.al.", "authors": "Roan Schellingerhout, Francesco Barile, Nava Tintarev", "id": "2409.15971v1", "paper_url": "http://arxiv.org/abs/2409.15971v1", "repo": "https://github.com/roan-schellingerhout/evaluating_job_recommendations"}}