{"2406.06572": {"publish_time": "2024-06-03", "title": "Graph Neural Network Enhanced Retrieval for Question Answering of LLMs", "paper_summary": "Retrieval augmented generation has revolutionized large language model (LLM)\noutputs by providing factual supports. Nevertheless, it struggles to capture\nall the necessary knowledge for complex reasoning questions. Existing retrieval\nmethods typically divide reference documents into passages, treating them in\nisolation. These passages, however, are often interrelated, such as passages\nthat are contiguous or share the same keywords. Therefore, recognizing the\nrelatedness is crucial for enhancing the retrieval process. In this paper, we\npropose a novel retrieval method, called GNN-Ret, which leverages graph neural\nnetworks (GNNs) to enhance retrieval by considering the relatedness between\npassages. Specifically, we first construct a graph of passages by connecting\npassages that are structure-related and keyword-related. A graph neural network\n(GNN) is then leveraged to exploit the relationships between passages and\nimprove the retrieval of supporting passages. Furthermore, we extend our method\nto handle multi-hop reasoning questions using a recurrent graph neural network\n(RGNN), named RGNN-Ret. At each step, RGNN-Ret integrates the graphs of\npassages from previous steps, thereby enhancing the retrieval of supporting\npassages. Extensive experiments on benchmark datasets demonstrate that GNN-Ret\nachieves higher accuracy for question answering with a single query of LLMs\nthan strong baselines that require multiple queries, and RGNN-Ret further\nimproves accuracy and achieves state-of-the-art performance, with up to 10.4%\naccuracy improvement on the 2WikiMQA dataset.", "paper_summary_zh": "<paragraph>檢索增強生成已透過提供事實支援，革新了大型語言模型 (LLM) 輸出。儘管如此，它仍難以擷取複雜推理問題所需的所有知識。現有的檢索方法通常將參考文件分成段落，並將它們孤立處理。然而，這些段落通常是相互關聯的，例如連續的段落或共用相同關鍵字的段落。因此，識別相關性對於增強檢索程序至關重要。在本文中，我們提出了一種名為 GNN-Ret 的新檢索方法，它利用圖神經網路 (GNN) 來增強檢索，方法是考慮段落之間的相關性。具體來說，我們首先透過連接結構相關和關鍵字相關的段落來建構段落的圖形。然後利用圖神經網路 (GNN) 來利用段落之間的關係，並改善支援段落的檢索。此外，我們擴充了我們的模型，以使用名為 RGNN-Ret 的遞迴圖神經網路來處理多跳推理問題。在每一步驟中，RGNN-Ret 都會整合前一步驟中段落的圖形，從而增強支援段落的檢索。在基準資料集上的廣泛實驗證明，GNN-Ret 在使用 LLM 的單一查詢來回答問題時，比需要多個查詢的強大基準線獲得更高的準確度，而 RGNN-Ret 進一步提高了準確度，並達到了最先進的效能，在 2WikiMQA 資料集上準確度提升了 10.4%。</paragraph>", "author": "Zijian Li et.al.", "authors": "Zijian Li, Qingyan Guo, Jiawei Shao, Lei Song, Jiang Bian, Jun Zhang, Rui Wang", "id": "2406.06572v1", "paper_url": "http://arxiv.org/abs/2406.06572v1", "repo": "null"}}