{"2407.05705": {"publish_time": "2024-07-08", "title": "Fast and Continual Knowledge Graph Embedding via Incremental LoRA", "paper_summary": "Continual Knowledge Graph Embedding (CKGE) aims to efficiently learn new\nknowledge and simultaneously preserve old knowledge. Dominant approaches\nprimarily focus on alleviating catastrophic forgetting of old knowledge but\nneglect efficient learning for the emergence of new knowledge. However, in\nreal-world scenarios, knowledge graphs (KGs) are continuously growing, which\nbrings a significant challenge to fine-tuning KGE models efficiently. To\naddress this issue, we propose a fast CKGE framework (\\model), incorporating an\nincremental low-rank adapter (\\mec) mechanism to efficiently acquire new\nknowledge while preserving old knowledge. Specifically, to mitigate\ncatastrophic forgetting, \\model\\ isolates and allocates new knowledge to\nspecific layers based on the fine-grained influence between old and new KGs.\nSubsequently, to accelerate fine-tuning, \\model\\ devises an efficient \\mec\\\nmechanism, which embeds the specific layers into incremental low-rank adapters\nwith fewer training parameters. Moreover, \\mec\\ introduces adaptive rank\nallocation, which makes the LoRA aware of the importance of entities and\nadjusts its rank scale adaptively. We conduct experiments on four public\ndatasets and two new datasets with a larger initial scale. Experimental results\ndemonstrate that \\model\\ can reduce training time by 34\\%-49\\% while still\nachieving competitive link prediction performance against state-of-the-art\nmodels on four public datasets (average MRR score of 21.0\\% vs.\n21.1\\%).Meanwhile, on two newly constructed datasets, \\model\\ saves 51\\%-68\\%\ntraining time and improves link prediction performance by 1.5\\%.", "paper_summary_zh": "連續知識圖表嵌入 (CKGE) 旨在有效學習新知識，並同時保留舊知識。主要的作法主要專注於減輕舊知識的災難性遺忘，但忽略了對新知識出現的有效學習。然而，在現實世界的場景中，知識圖表 (KG) 不斷增長，這為有效微調 KGE 模型帶來了重大挑戰。為了解決這個問題，我們提出了一個快速的 CKGE 框架 (\\model)，結合了一個增量低秩適配器 (\\mec) 機制，以在保留舊知識的同時有效獲取新知識。具體來說，為了減輕災難性遺忘，\\model\\ 基於舊 KG 和新 KG 之間的細粒度影響，將新知識隔離並分配到特定層。隨後，為了加速微調，\\model\\ 設計了一個有效的 \\mec\\ 機制，它將特定層嵌入到具有較少訓練參數的增量低秩適配器中。此外，\\mec\\ 引入了自適應秩分配，這使得 LoRA 了解實體的重要性並自適應地調整其秩尺度。我們在四個公共數據集和兩個具有更大初始規模的新數據集上進行了實驗。實驗結果表明，\\model\\ 可以將訓練時間縮短 34%-49%，同時在四個公共數據集上仍能達到與最先進模型相比具有競爭力的鏈路預測性能（平均 MRR 分數為 21.0% 對比 21.1%）。同時，在兩個新構建的數據集上，\\model\\ 節省了 51%-68% 的訓練時間，並將鏈路預測性能提高了 1.5%。", "author": "Jiajun Liu et.al.", "authors": "Jiajun Liu, Wenjun Ke, Peng Wang, Jiahao Wang, Jinhua Gao, Ziyu Shang, Guozheng Li, Zijie Xu, Ke Ji, Yining Li", "id": "2407.05705v1", "paper_url": "http://arxiv.org/abs/2407.05705v1", "repo": "https://github.com/seukgcode/fastkge"}}