{"2411.16993": {"publish_time": "2024-11-25", "title": "Tree Transformers are an Ineffective Model of Syntactic Constituency", "paper_summary": "Linguists have long held that a key aspect of natural language syntax is the\nrecursive organization of language units into constituent structures, and\nresearch has suggested that current state-of-the-art language models lack an\ninherent bias towards this feature. A number of alternative models have been\nproposed to provide inductive biases towards constituency, including the Tree\nTransformer, which utilizes a modified attention mechanism to organize tokens\ninto constituents.\n  We investigate Tree Transformers to study whether they utilize meaningful\nand/or useful constituent structures. We pretrain a large Tree Transformer on\nlanguage modeling in order to investigate the learned constituent tree\nrepresentations of sentences, finding little evidence for meaningful\nstructures. Next, we evaluate Tree Transformers with similar transformer models\non error detection tasks requiring constituent structure. We find that while\nthe Tree Transformer models may slightly outperform at these tasks, there is\nlittle evidence to suggest a meaningful improvement. In general, we conclude\nthat there is little evidence to support Tree Transformer as an effective model\nof syntactic constituency.", "paper_summary_zh": "語言學家長期以來認為自然語言句法的關鍵方面是語言單位遞迴組織成組成結構，而研究表明，當前最先進的語言模型缺乏對此特徵的內在偏見。已經提出了許多替代模型來提供對組成成分的歸納偏見，包括 Tree Transformer，它利用修改後的注意力機制將令牌組織成組成成分。\n我們研究 Tree Transformer 以研究它們是否利用有意義和/或有用的組成結構。我們在語言建模中預訓練一個大型 Tree Transformer，以研究句子的學習組成樹表示，發現很少有有意義的結構證據。接下來，我們使用類似的Transformer模型對 Tree Transformer 進行評估，對需要組成結構的錯誤檢測任務進行評估。我們發現，雖然 Tree Transformer 模型在這些任務上可能表現略好，但幾乎沒有證據表明有意義的改進。總的來說，我們得出結論，幾乎沒有證據支持 Tree Transformer 作為句法組成的有效模型。", "author": "Michael Ginn et.al.", "authors": "Michael Ginn", "id": "2411.16993v1", "paper_url": "http://arxiv.org/abs/2411.16993v1", "repo": "null"}}