{"2410.19134": {"publish_time": "2024-10-24", "title": "AlignCap: Aligning Speech Emotion Captioning to Human Preferences", "paper_summary": "Speech Emotion Captioning (SEC) has gradually become an active research task.\nThe emotional content conveyed through human speech are often complex, and\nclassifying them into fixed categories may not be enough to fully capture\nspeech emotions. Describing speech emotions through natural language may be a\nmore effective approach. However, existing SEC methods often produce\nhallucinations and lose generalization on unseen speech. To overcome these\nproblems, we propose AlignCap, which Aligning Speech Emotion Captioning to\nHuman Preferences based on large language model (LLM) with two properties: 1)\nSpeech-Text Alignment, which minimizing the divergence between the LLM's\nresponse prediction distributions for speech and text inputs using knowledge\ndistillation (KD) Regularization. 2) Human Preference Alignment, where we\ndesign Preference Optimization (PO) Regularization to eliminate factuality and\nfaithfulness hallucinations. We also extract emotional clues as a prompt for\nenriching fine-grained information under KD-Regularization. Experiments\ndemonstrate that AlignCap presents stronger performance to other\nstate-of-the-art methods on Zero-shot SEC task.", "paper_summary_zh": "語音情緒標題 (SEC) 已逐漸成為一項活躍的研究任務。\n人類言語傳達的情緒內容通常很複雜，\n將其分類為固定類別可能不足以完全捕捉\n言語情緒。透過自然語言描述言語情緒可能是\n一種更有效的方法。然而，現有的 SEC 方法經常產生\n幻覺，並在未見過的言語上失去概括性。為了克服這些\n問題，我們提出了 AlignCap，它基於具有兩個特性的\n大型語言模型 (LLM) 將言語情緒標題與人類偏好對齊：1)\n言語文字對齊，它使用知識提煉 (KD) 正則化最小化 LLM\n的回應預測分佈與言語和文字輸入之間的差異。2) 人類偏好對齊，\n我們設計了偏好最佳化 (PO) 正則化來消除事實性和\n忠實度幻覺。我們還提取情緒線索作為提示，以豐富\nKD 正則化下的細粒度資訊。實驗證明，AlignCap 在\n零次 SEC 任務上表現出比其他最先進方法更強的效能。", "author": "Ziqi Liang et.al.", "authors": "Ziqi Liang, Haoxiang Shi, Hanhui Chen", "id": "2410.19134v1", "paper_url": "http://arxiv.org/abs/2410.19134v1", "repo": "null"}}