{"2407.13993": {"publish_time": "2024-07-19", "title": "LLAssist: Simple Tools for Automating Literature Review Using Large Language Models", "paper_summary": "This paper introduces LLAssist, an open-source tool designed to streamline\nliterature reviews in academic research. In an era of exponential growth in\nscientific publications, researchers face mounting challenges in efficiently\nprocessing vast volumes of literature. LLAssist addresses this issue by\nleveraging Large Language Models (LLMs) and Natural Language Processing (NLP)\ntechniques to automate key aspects of the review process. Specifically, it\nextracts important information from research articles and evaluates their\nrelevance to user-defined research questions. The goal of LLAssist is to\nsignificantly reduce the time and effort required for comprehensive literature\nreviews, allowing researchers to focus more on analyzing and synthesizing\ninformation rather than on initial screening tasks. By automating parts of the\nliterature review workflow, LLAssist aims to help researchers manage the\ngrowing volume of academic publications more efficiently.", "paper_summary_zh": "本文介紹 LLAssist，這是一款開放原始碼工具，旨在簡化學術研究中的文獻回顧。在科學出版物呈指數增長的時代，研究人員在有效處理大量文獻方面面臨著越來越大的挑戰。LLAssist 透過利用大型語言模型 (LLM) 和自然語言處理 (NLP) 技術自動化回顧過程中的關鍵方面，來解決這個問題。具體來說，它從研究文章中萃取出重要資訊，並評估其與使用者定義的研究問題相關性。LLAssist 的目標是大幅減少全面文獻回顧所需的時間和精力，讓研究人員能更專注於分析和綜合資訊，而非初始篩選任務。透過自動化文獻回顧工作流程的一部分，LLAssist 旨在幫助研究人員更有效地管理日益增長的學術出版物數量。", "author": "Christoforus Yoga Haryanto et.al.", "authors": "Christoforus Yoga Haryanto", "id": "2407.13993v1", "paper_url": "http://arxiv.org/abs/2407.13993v1", "repo": "https://github.com/cyharyanto/llassist"}}