{"2409.16668": {"publish_time": "2024-09-25", "title": "Topic-aware Causal Intervention for Counterfactual Detection", "paper_summary": "Counterfactual statements, which describe events that did not or cannot take\nplace, are beneficial to numerous NLP applications. Hence, we consider the\nproblem of counterfactual detection (CFD) and seek to enhance the CFD models.\nPrevious models are reliant on clue phrases to predict counterfactuality, so\nthey suffer from significant performance drop when clue phrase hints do not\nexist during testing. Moreover, these models tend to predict\nnon-counterfactuals over counterfactuals. To address these issues, we propose\nto integrate neural topic model into the CFD model to capture the global\nsemantics of the input statement. We continue to causally intervene the hidden\nrepresentations of the CFD model to balance the effect of the class labels.\nExtensive experiments show that our approach outperforms previous\nstate-of-the-art CFD and bias-resolving methods in both the CFD and other\nbias-sensitive tasks.", "paper_summary_zh": "反事實陳述描述了未發生或無法發生的事件，對許多 NLP 應用有益。因此，我們考慮反事實檢測 (CFD) 的問題，並尋求增強 CFD 模型。先前的模型依賴於線索短語來預測反事實，因此在測試期間沒有線索短語提示時，它們的效能會大幅下降。此外，這些模型傾向於預測非反事實而不是反事實。為了解決這些問題，我們建議將神經主題模型整合到 CFD 模型中，以擷取輸入陳述的整體語義。我們繼續因果干預 CFD 模型的隱藏表示，以平衡類別標籤的影響。廣泛的實驗表明，我們的做法在 CFD 和其他偏見敏感任務中都優於先前的最先進 CFD 和偏見解決方法。", "author": "Thong Nguyen et.al.", "authors": "Thong Nguyen, Truc-My Nguyen", "id": "2409.16668v1", "paper_url": "http://arxiv.org/abs/2409.16668v1", "repo": "null"}}