{"2407.05963": {"publish_time": "2024-07-08", "title": "6GSoft: Software for Edge-to-Cloud Continuum", "paper_summary": "In the era of 6G, developing and managing software requires cutting-edge\nsoftware engineering (SE) theories and practices tailored for such complexity\nacross a vast number of connected edge devices. Our project aims to lead the\ndevelopment of sustainable methods and energy-efficient orchestration models\nspecifically for edge environments, enhancing architectural support driven by\nAI for contemporary edge-to-cloud continuum computing. This initiative seeks to\nposition Finland at the forefront of the 6G landscape, focusing on\nsophisticated edge orchestration and robust software architectures to optimize\nthe performance and scalability of edge networks. Collaborating with leading\nFinnish universities and companies, the project emphasizes deep\nindustry-academia collaboration and international expertise to address critical\nchallenges in edge orchestration and software architecture, aiming to drive\nsignificant advancements in software productivity and market impact.", "paper_summary_zh": "在 6G 時代，開發和管理軟體需要最先進的軟體工程 (SE) 理論和實務，針對大量連接的邊緣裝置量身打造，以應付如此複雜性。我們的專案旨在領導永續方法和節能協調模型的開發，專門針對邊緣環境，進一步提升由 AI 推動的架構支援，以利於當代邊緣到雲端連續運算。此計畫尋求讓芬蘭在 6G 領域居於領先地位，專注於精密的邊緣協調和強健的軟體架構，以最佳化邊緣網路的效能和擴充性。透過與芬蘭領先大學和公司合作，此專案強調深度的產學合作和國際專業知識，以解決邊緣協調和軟體架構中的重大挑戰，目標是推動軟體生產力和市場影響力的顯著進展。", "author": "Muhammad Azeem Akbar et.al.", "authors": "Muhammad Azeem Akbar, Matteo Esposito, Sami Hyrynsalmi, Karthikeyan Dinesh Kumar, Valentina Lenarduzzi, Xiaozhou Li, Ali Mehraj, Tommi Mikkonen, Sergio Moreschini, Niko Mäkitalo, Markku Oivo, Anna-Sofia Paavonen, Risha Parveen, Kari Smolander, Ruoyu Su, Kari Systä, Davide Taibi, Nan Yang, Zheying Zhang, Muhammad Zohaib", "id": "2407.05963v2", "paper_url": "http://arxiv.org/abs/2407.05963v2", "repo": "null"}}