{"2409.09052": {"publish_time": "2024-08-30", "title": "OrthoDoc: Multimodal Large Language Model for Assisting Diagnosis in Computed Tomography", "paper_summary": "Multimodal large language models (MLLMs) have achieved significant success in\nthe general field of image processing. Their emerging task generalization and\nfreeform conversational capabilities can greatly facilitate medical diagnostic\nassistance, helping patients better understand their conditions and enhancing\ndoctor-patient trust. Computed Tomography (CT) is a non-invasive imaging\ntechnique used to capture the internal mechanisms of a patient's condition and\nis widely utilized. However, in past research, the complex textural features of\nthis imaging data have made accurate interpretation by algorithms challenging,\nimpeding the performance of general LLMs in diagnostic assistance. To address\nthis, we developed OrthoDoc, a MLLM designed for CT diagnostics. OrthoDoc is\ntrained on 120,000 CT images and diagnostic reports and includes a\nRetrieval-Augmented Generation (RAG) module capable of effectively mitigating\nmodel hallucinations. This module is informed by extensive medical literature,\ntextbooks, and explanatory data. Thus, OrthoDoc not only processes complex CT\nimages but also stores, understands, and reasons over medical knowledge and\nlanguage. In extensive experiments, OrthoDoc outperforms commercial models led\nby GPT-4, demonstrating superior diagnostic capabilities and accuracy.\nSpecifically, OrthoDoc significantly surpasses existing models in the diagnosis\nof common orthopedic conditions such as fractures, arthritis, and tumors.\nAdditionally, OrthoDoc exhibits robust generalization and stability when\nhandling rare and complex cases.", "paper_summary_zh": "多模態大型語言模型 (MLLM) 已在影像處理的廣泛領域中取得顯著成功。它們新興的任務泛化和自由對話能力可以極大地促進醫療診斷輔助，幫助患者更了解自己的病情並增強醫患信任。電腦斷層掃描 (CT) 是一種非侵入性影像技術，用於捕捉患者病情的內部機制，並被廣泛使用。然而，在過去的研究中，這種影像資料的複雜紋理特徵使得演算法難以準確解讀，阻礙了通用 LLM 在診斷輔助中的表現。為了解決這個問題，我們開發了 OrthoDoc，一種專為 CT 診斷設計的 MLLM。OrthoDoc 在 120,000 張 CT 影像和診斷報告上進行訓練，並包含一個檢索增強生成 (RAG) 模組，能夠有效減輕模型的幻覺。這個模組是根據大量的醫學文獻、教科書和說明性資料而成的。因此，OrthoDoc 不僅可以處理複雜的 CT 影像，還可以儲存、理解和推理醫學知識和語言。在大量的實驗中，OrthoDoc 優於由 GPT-4 領導的商業模型，展示出優異的診斷能力和準確性。具體來說，OrthoDoc 在骨折、關節炎和腫瘤等常見骨科疾病的診斷中顯著超越現有模型。此外，OrthoDoc 在處理罕見和複雜病例時表現出穩健的泛化和穩定性。", "author": "Youzhu Jin et.al.", "authors": "Youzhu Jin, Yichen Zhang", "id": "2409.09052v1", "paper_url": "http://arxiv.org/abs/2409.09052v1", "repo": "null"}}