{"2407.06172": {"publish_time": "2024-07-08", "title": "On Speeding Up Language Model Evaluation", "paper_summary": "Large language models (LLMs) currently dominate the field of natural language\nprocessing (NLP), representing the state-of-the-art across a diverse array of\ntasks. Developing a model of this nature, from training to inference, requires\nmaking numerous decisions which define a combinatorial search problem. For\nexample, selecting the optimal pre-trained LLM, prompt, or hyperparameters to\nattain the best performance for a task often requires evaluating multiple\ncandidates on an entire test set. This exhaustive evaluation can be\ntime-consuming and costly, as both inference and metric computation with LLMs\nare resource-intensive. In this paper, we address the challenge of identifying\nthe best method within a limited budget for evaluating methods on test\nexamples. By leveraging the well-studied multi-armed bandit framework, which\nsequentially selects the next method-example pair to evaluate, our approach,\ncombining multi-armed bandit algorithms with low-rank factorization,\nsignificantly reduces the required resources. Experiments show that our\nalgorithms can identify the top-performing method using only 5-15\\% of the\ntypically needed resources, resulting in an 85-95\\% reduction in cost.", "paper_summary_zh": "大型語言模型 (LLM) 目前主導著自然語言處理 (NLP) 領域，代表著各種任務的最新技術。開發這種性質的模型，從訓練到推理，都需要做出許多定義組合搜尋問題的決策。例如，選擇最佳的預訓練 LLM、提示或超參數以獲得任務的最佳效能，通常需要在整個測試集中評估多個候選者。這種詳盡的評估可能會耗時且昂貴，因為使用 LLM 進行推理和指標計算都是資源密集型的。在本文中，我們探討了在有限預算內找出最佳方法來評估測試範例方法的挑戰。透過利用研究完善的多重拉霸機架構，它會依序選擇下一個要評估的方法範例配對，我們的做法結合了多重拉霸機演算法和低階分解，大幅減少了所需的資源。實驗顯示，我們的演算法僅使用通常所需資源的 5-15%，就能找出效能最佳的方法，進而降低 85-95% 的成本。", "author": "Jin Peng Zhou et.al.", "authors": "Jin Peng Zhou, Christian K. Belardi, Ruihan Wu, Travis Zhang, Carla P. Gomes, Wen Sun, Kilian Q. Weinberger", "id": "2407.06172v1", "paper_url": "http://arxiv.org/abs/2407.06172v1", "repo": "null"}}