{"2410.06392": {"publish_time": "2024-10-08", "title": "Counterfactual Causal Inference in Natural Language with Large Language Models", "paper_summary": "Causal structure discovery methods are commonly applied to structured data\nwhere the causal variables are known and where statistical testing can be used\nto assess the causal relationships. By contrast, recovering a causal structure\nfrom unstructured natural language data such as news articles contains numerous\nchallenges due to the absence of known variables or counterfactual data to\nestimate the causal links. Large Language Models (LLMs) have shown promising\nresults in this direction but also exhibit limitations. This work investigates\nLLM's abilities to build causal graphs from text documents and perform\ncounterfactual causal inference. We propose an end-to-end causal structure\ndiscovery and causal inference method from natural language: we first use an\nLLM to extract the instantiated causal variables from text data and build a\ncausal graph. We merge causal graphs from multiple data sources to represent\nthe most exhaustive set of causes possible. We then conduct counterfactual\ninference on the estimated graph. The causal graph conditioning allows\nreduction of LLM biases and better represents the causal estimands. We use our\nmethod to show that the limitations of LLMs in counterfactual causal reasoning\ncome from prediction errors and propose directions to mitigate them. We\ndemonstrate the applicability of our method on real-world news articles.", "paper_summary_zh": "因果结构发现方法通常应用于结构化数据，其中因果变量是已知的，并且可以使用统计检验来评估因果关系。相比之下，从新闻文章等非结构化的自然语言数据中恢复因果结构由于缺少已知变量或反事实数据来估计因果关系而包含众多挑战。大型语言模型 (LLM) 在这个方向上显示出有希望的结果，但也表现出局限性。这项工作调查了 LLM 从文本文档构建因果图和执行反事实因果推理的能力。我们提出了一种从自然语言中进行端到端因果结构发现和因果推理的方法：我们首先使用 LLM 从文本数据中提取实例化的因果变量并构建因果图。我们合并来自多个数据源的因果图，以表示可能的最详尽的因果集。然后，我们对估计图进行反事实推理。因果图条件允许减少 LLM 偏差并更好地表示因果估计量。我们使用我们的方法表明 LLM 在反事实因果推理中的局限性来自预测误差，并提出减轻它们的措施。我们在现实世界的新闻文章中展示了我们方法的适用性。", "author": "Gaël Gendron et.al.", "authors": "Gaël Gendron, Jože M. Rožanec, Michael Witbrock, Gillian Dobbie", "id": "2410.06392v1", "paper_url": "http://arxiv.org/abs/2410.06392v1", "repo": "null"}}