{"2411.07466": {"publish_time": "2024-11-12", "title": "IdentifyMe: A Challenging Long-Context Mention Resolution Benchmark", "paper_summary": "Recent evaluations of LLMs on coreference resolution have revealed that\ntraditional output formats and evaluation metrics do not fully capture the\nmodels' referential understanding. To address this, we introduce IdentifyMe, a\nnew benchmark for mention resolution presented in a multiple-choice question\n(MCQ) format, commonly used for evaluating LLMs. IdentifyMe features long\nnarratives and employs heuristics to exclude easily identifiable mentions,\ncreating a more challenging task. The benchmark also consists of a curated\nmixture of different mention types and corresponding entities, allowing for a\nfine-grained analysis of model performance. We evaluate both closed- and open\nsource LLMs on IdentifyMe and observe a significant performance gap (20-30%)\nbetween the state-of-the-art sub-10B open models vs. closed ones. We observe\nthat pronominal mentions, which have limited surface information, are typically\nmuch harder for models to resolve than nominal mentions. Additionally, we find\nthat LLMs often confuse entities when their mentions overlap in nested\nstructures. The highest-scoring model, GPT-4o, achieves 81.9% accuracy,\nhighlighting the strong referential capabilities of state-of-the-art LLMs while\nalso indicating room for further improvement.", "paper_summary_zh": "最近對大型語言模型 (LLM) 關於共同指稱消解的評估顯示，傳統的輸出格式和評估指標並未完全掌握模型的指稱理解。為了解決這個問題，我們引入了 IdentifyMe，這是一個以多選題 (MCQ) 格式呈現的提及消解新基準，通常用於評估 LLM。IdentifyMe 採用長篇敘事，並使用啟發法排除容易識別的提及，創造更具挑戰性的任務。此基準還包含經過整理的不同提及類型和對應實體的混合，允許對模型效能進行細緻的分析。我們在 IdentifyMe 上評估閉源和開源 LLM，並觀察到最先進的低於 10B 開放模型與閉源模型之間有顯著的效能差距 (20-30%)。我們觀察到，表面資訊有限的代名詞提及通常比名詞提及更難讓模型解析。此外，我們發現當 LLM 的提及在巢狀結構中重疊時，它們經常會混淆實體。得分最高的模型 GPT-4o 達到了 81.9% 的準確度，突顯了最先進 LLM 強大的指稱能力，同時也表示仍有進步的空間。", "author": "Kawshik Manikantan et.al.", "authors": "Kawshik Manikantan, Makarand Tapaswi, Vineet Gandhi, Shubham Toshniwal", "id": "2411.07466v1", "paper_url": "http://arxiv.org/abs/2411.07466v1", "repo": "null"}}