{"2407.16154": {"publish_time": "2024-07-23", "title": "DDK: Distilling Domain Knowledge for Efficient Large Language Models", "paper_summary": "Despite the advanced intelligence abilities of large language models (LLMs)\nin various applications, they still face significant computational and storage\ndemands. Knowledge Distillation (KD) has emerged as an effective strategy to\nimprove the performance of a smaller LLM (i.e., the student model) by\ntransferring knowledge from a high-performing LLM (i.e., the teacher model).\nPrevailing techniques in LLM distillation typically use a black-box model API\nto generate high-quality pretrained and aligned datasets, or utilize white-box\ndistillation by altering the loss function to better transfer knowledge from\nthe teacher LLM. However, these methods ignore the knowledge differences\nbetween the student and teacher LLMs across domains. This results in excessive\nfocus on domains with minimal performance gaps and insufficient attention to\ndomains with large gaps, reducing overall performance. In this paper, we\nintroduce a new LLM distillation framework called DDK, which dynamically\nadjusts the composition of the distillation dataset in a smooth manner\naccording to the domain performance differences between the teacher and student\nmodels, making the distillation process more stable and effective. Extensive\nevaluations show that DDK significantly improves the performance of student\nmodels, outperforming both continuously pretrained baselines and existing\nknowledge distillation methods by a large margin.", "paper_summary_zh": "儘管大型語言模型 (LLM) 在各種應用中具備先進的智能能力，但它們仍然面臨龐大的運算和儲存需求。知識蒸餾 (KD) 已成為一種有效策略，可透過從高性能 LLM (即教師模型) 傳輸知識，來提升較小型 LLM (即學生模型) 的效能。LLM 蒸餾中普遍採用的技術，通常會使用黑盒模型 API 來產生高品質的預訓練和對齊資料集，或透過改變損失函數來利用白盒蒸餾，以從教師 LLM 更有效地傳輸知識。然而，這些方法忽略了學生和教師 LLM 在不同領域之間的知識差異。這導致過度專注於效能差距最小的領域，而對差距較大的領域關注不足，進而降低整體效能。在本文中，我們介紹一個名為 DDK 的新型 LLM 蒸餾架構，它會根據教師和學生模型之間的領域效能差異，以平穩的方式動態調整蒸餾資料集的組成，讓蒸餾過程更穩定且有效。廣泛的評估顯示，DDK 大幅提升了學生模型的效能，大幅優於持續預訓練的基準和現有的知識蒸餾方法。", "author": "Jiaheng Liu et.al.", "authors": "Jiaheng Liu, Chenchen Zhang, Jinyang Guo, Yuanxing Zhang, Haoran Que, Ken Deng, Zhiqi Bai, Jie Liu, Ge Zhang, Jiakai Wang, Yanan Wu, Congnan Liu, Wenbo Su, Jiamang Wang, Lin Qu, Bo Zheng", "id": "2407.16154v1", "paper_url": "http://arxiv.org/abs/2407.16154v1", "repo": "null"}}