{"2501.08005": {"publish_time": "2025-01-14", "title": "DisCoPatch: Batch Statistics Are All You Need For OOD Detection, But Only If You Can Trust Them", "paper_summary": "Out-of-distribution (OOD) detection holds significant importance across many\napplications. While semantic and domain-shift OOD problems are well-studied,\nthis work focuses on covariate shifts - subtle variations in the data\ndistribution that can degrade machine learning performance. We hypothesize that\ndetecting these subtle shifts can improve our understanding of in-distribution\nboundaries, ultimately improving OOD detection. In adversarial discriminators\ntrained with Batch Normalization (BN), real and adversarial samples form\ndistinct domains with unique batch statistics - a property we exploit for OOD\ndetection. We introduce DisCoPatch, an unsupervised Adversarial Variational\nAutoencoder (VAE) framework that harnesses this mechanism. During inference,\nbatches consist of patches from the same image, ensuring a consistent data\ndistribution that allows the model to rely on batch statistics. DisCoPatch uses\nthe VAE's suboptimal outputs (generated and reconstructed) as negative samples\nto train the discriminator, thereby improving its ability to delineate the\nboundary between in-distribution samples and covariate shifts. By tightening\nthis boundary, DisCoPatch achieves state-of-the-art results in public OOD\ndetection benchmarks. The proposed model not only excels in detecting covariate\nshifts, achieving 95.5% AUROC on ImageNet-1K(-C) but also outperforms all prior\nmethods on public Near-OOD (95.0%) benchmarks. With a compact model size of\n25MB, it achieves high OOD detection performance at notably lower latency than\nexisting methods, making it an efficient and practical solution for real-world\nOOD detection applications. The code will be made publicly available", "paper_summary_zh": "<paragraph>非分布 (OOD) 偵測在許多應用中都非常重要。雖然語意和領域轉移 OOD 問題已廣受探討，但本研究專注於協變數轉移，這是資料分佈中的細微變化，會降低機器學習效能。我們假設偵測這些細微轉移可以改善我們對分佈內邊界的理解，進而改善 OOD 偵測。在使用批次正規化 (BN) 訓練的對抗判別器中，真實樣本和對抗樣本會形成具有獨特批次統計資料的不同領域，我們利用這個特性進行 OOD 偵測。我們提出 DisCoPatch，一個利用此機制的無監督對抗變異自動編碼器 (VAE) 架構。在推理期間，批次包含來自同一影像的區塊，確保一致的資料分佈，讓模型可以依賴批次統計資料。DisCoPatch 使用 VAE 的次佳輸出 (生成和重建) 作為負樣本來訓練判別器，從而提高其描繪分佈內樣本和協變數轉移之間邊界的能力。透過收緊這個邊界，DisCoPatch 在公開 OOD 偵測基準測試中獲得最先進的結果。所提出的模型不僅在偵測協變數轉移方面表現出色，在 ImageNet-1K(-C) 上達到 95.5% 的 AUROC，而且在公開 Near-OOD (95.0%) 基準測試中也優於所有先前方法。模型大小僅 25MB，以顯著低於現有方法的延遲時間實現高 OOD 偵測效能，使其成為現實世界 OOD 偵測應用程式中一種高效且實用的解決方案。程式碼將公開提供</paragraph>", "author": "Francisco Caetano et.al.", "authors": "Francisco Caetano, Christiaan Viviers, Luis A. Zavala-Mondragón, Peter H. N. de With, Fons van der Sommen", "id": "2501.08005v1", "paper_url": "http://arxiv.org/abs/2501.08005v1", "repo": "null"}}