{"2501.04591": {"publish_time": "2025-01-08", "title": "Quantum-inspired Embeddings Projection and Similarity Metrics for Representation Learning", "paper_summary": "Over the last decade, representation learning, which embeds complex\ninformation extracted from large amounts of data into dense vector spaces, has\nemerged as a key technique in machine learning. Among other applications, it\nhas been a key building block for large language models and advanced computer\nvision systems based on contrastive learning. A core component of\nrepresentation learning systems is the projection head, which maps the original\nembeddings into different, often compressed spaces, while preserving the\nsimilarity relationship between vectors.\n  In this paper, we propose a quantum-inspired projection head that includes a\ncorresponding quantum-inspired similarity metric. Specifically, we map\nclassical embeddings onto quantum states in Hilbert space and introduce a\nquantum circuit-based projection head to reduce embedding dimensionality. To\nevaluate the effectiveness of this approach, we extended the BERT language\nmodel by integrating our projection head for embedding compression. We compared\nthe performance of embeddings, which were compressed using our quantum-inspired\nprojection head, with those compressed using a classical projection head on\ninformation retrieval tasks using the TREC 2019 and TREC 2020 Deep Learning\nbenchmarks. The results demonstrate that our quantum-inspired method achieves\ncompetitive performance relative to the classical method while utilizing 32\ntimes fewer parameters. Furthermore, when trained from scratch, it notably\nexcels, particularly on smaller datasets. This work not only highlights the\neffectiveness of the quantum-inspired approach but also emphasizes the utility\nof efficient, ad hoc low-entanglement circuit simulations within neural\nnetworks as a powerful quantum-inspired technique.", "paper_summary_zh": "在過去十年中，表徵學習已成為機器學習中的一項關鍵技術，它將從大量資料中萃取出的複雜資訊嵌入到稠密向量空間中。在其他應用中，它一直是大型語言模型和基於對比學習的高階電腦視覺系統的關鍵組成部分。表徵學習系統的核心組成部分是投影頭，它將原始嵌入映射到不同的、通常是壓縮的空間中，同時保留向量之間的相似性關係。\n在本文中，我們提出一個量子啟發的投影頭，其中包含一個對應的量子啟發相似性度量。具體來說，我們將經典嵌入映射到希爾伯特空間中的量子態，並引入一個基於量子電路的投影頭來降低嵌入維度。為了評估此方法的有效性，我們通過整合我們的投影頭以進行嵌入壓縮來擴充 BERT 語言模型。我們將使用我們的量子啟發投影頭壓縮的嵌入效能與使用經典投影頭壓縮的嵌入效能進行比較，以在使用 TREC 2019 和 TREC 2020 深度學習基準的資訊檢索任務上進行比較。結果表明，我們的量子啟發方法相對於經典方法取得了有競爭力的效能，同時使用的參數減少了 32 倍。此外，當從頭開始訓練時，它特別是在較小的資料集上顯著勝出。這項工作不僅突顯了量子啟發方法的有效性，還強調了在神經網路中使用高效、即席低糾纏電路模擬作為一種強大的量子啟發技術的效用。", "author": "Ivan Kankeu et.al.", "authors": "Ivan Kankeu, Stefan Gerd Fritsch, Gunnar Schönhoff, Elie Mounzer, Paul Lukowicz, Maximilian Kiefer-Emmanouilidis", "id": "2501.04591v1", "paper_url": "http://arxiv.org/abs/2501.04591v1", "repo": "null"}}