{"2405.20172": {"publish_time": "2024-05-30", "title": "Iterative Feature Boosting for Explainable Speech Emotion Recognition", "paper_summary": "In speech emotion recognition (SER), using predefined features without\nconsidering their practical importance may lead to high dimensional datasets,\nincluding redundant and irrelevant information. Consequently, high-dimensional\nlearning often results in decreasing model accuracy while increasing\ncomputational complexity. Our work underlines the importance of carefully\nconsidering and analyzing features in order to build efficient SER systems. We\npresent a new supervised SER method based on an efficient feature engineering\napproach. We pay particular attention to the explainability of results to\nevaluate feature relevance and refine feature sets. This is performed\niteratively through feature evaluation loop, using Shapley values to boost\nfeature selection and improve overall framework performance. Our approach\nallows thus to balance the benefits between model performance and transparency.\nThe proposed method outperforms human-level performance (HLP) and\nstate-of-the-art machine learning methods in emotion recognition on the TESS\ndataset.", "paper_summary_zh": "在語音情緒辨識 (SER) 中，使用預定義特徵而不考慮其實際重要性可能會導致高維度資料集，其中包含冗餘且無關的資訊。因此，高維度學習通常會導致模型準確度下降，同時增加計算複雜度。我們的研究強調仔細考慮和分析特徵以建構有效 SER 系統的重要性。我們提出一個新的監督式 SER 方法，該方法基於有效特徵工程方法。我們特別注意結果的可解釋性，以評估特徵相關性並改善特徵集。這透過特徵評估迴圈反覆執行，使用 Shapley 值來提升特徵選取並改善整體架構效能。因此，我們的做法可以平衡模型效能與透明度之間的優點。所提出的方法在 TESS 資料集上的情緒辨識中優於人類等級效能 (HLP) 和最先進的機器學習方法。", "author": "Alaa Nfissi et.al.", "authors": "Alaa Nfissi, Wassim Bouachir, Nizar Bouguila, Brian Mishara", "id": "2405.20172v1", "paper_url": "http://arxiv.org/abs/2405.20172v1", "repo": "https://github.com/alaaNfissi/Iterative-Feature-Boosting-for-Explainable-Speech-Emotion-Recognition"}}