{"2410.14259": {"publish_time": "2024-10-18", "title": "Beyond Binary: Towards Fine-Grained LLM-Generated Text Detection via Role Recognition and Involvement Measurement", "paper_summary": "The rapid development of large language models (LLMs), like ChatGPT, has\nresulted in the widespread presence of LLM-generated content on social media\nplatforms, raising concerns about misinformation, data biases, and privacy\nviolations, which can undermine trust in online discourse. While detecting\nLLM-generated content is crucial for mitigating these risks, current methods\noften focus on binary classification, failing to address the complexities of\nreal-world scenarios like human-AI collaboration. To move beyond binary\nclassification and address these challenges, we propose a new paradigm for\ndetecting LLM-generated content. This approach introduces two novel tasks: LLM\nRole Recognition (LLM-RR), a multi-class classification task that identifies\nspecific roles of LLM in content generation, and LLM Influence Measurement\n(LLM-IM), a regression task that quantifies the extent of LLM involvement in\ncontent creation. To support these tasks, we propose LLMDetect, a benchmark\ndesigned to evaluate detectors' performance on these new tasks. LLMDetect\nincludes the Hybrid News Detection Corpus (HNDC) for training detectors, as\nwell as DetectEval, a comprehensive evaluation suite that considers five\ndistinct cross-context variations and multi-intensity variations within the\nsame LLM role. This allows for a thorough assessment of detectors'\ngeneralization and robustness across diverse contexts. Our empirical validation\nof 10 baseline detection methods demonstrates that fine-tuned PLM-based models\nconsistently outperform others on both tasks, while advanced LLMs face\nchallenges in accurately detecting their own generated content. Our\nexperimental results and analysis offer insights for developing more effective\ndetection models for LLM-generated content. This research enhances the\nunderstanding of LLM-generated content and establishes a foundation for more\nnuanced detection methodologies.", "paper_summary_zh": "大型語言模型 (LLM) 如 ChatGPT 的快速發展，導致 LLM 生成的內容廣泛出現在社群媒體平台上，引發了關於錯誤資訊、資料偏差和隱私侵犯的疑慮，這可能破壞線上討論的信任感。儘管偵測 LLM 生成的內容對於減輕這些風險至關重要，但目前的方法通常著重於二元分類，未能解決現實世界情境（例如人類與 AI 合作）的複雜性。為了超越二元分類並解決這些挑戰，我們提出了一個偵測 LLM 生成的內容的新範例。此方法引入了兩個新任務：LLM 角色辨識 (LLM-RR)，一個多類別分類任務，用於識別 LLM 在內容產生中的特定角色；以及 LLM 影響力測量 (LLM-IM)，一個回歸任務，用於量化 LLM 在內容創作中的參與程度。為了支援這些任務，我們提出了 LLMDetect，一個基準，用於評估偵測器在這些新任務上的效能。LLMDetect 包含了混合新聞偵測語料庫 (HNDC)，用於訓練偵測器，以及 DetectEval，一個全面的評量套件，它考慮了同一個 LLM 角色中的五種不同的跨情境變化和多強度變化。這允許對偵測器的泛化性和在不同情境中的穩健性進行徹底評估。我們對 10 種基線偵測方法的實證驗證表明，經過微調的基於 PLM 的模型在兩個任務上都持續優於其他模型，而進階的 LLM 在準確偵測其自己產生的內容時面臨挑戰。我們的實驗結果和分析提供了見解，用於開發更有效的 LLM 生成的內容偵測模型。這項研究增強了對 LLM 生成的內容的理解，並為更細緻的偵測方法奠定了基礎。", "author": "Zihao Cheng et.al.", "authors": "Zihao Cheng, Li Zhou, Feng Jiang, Benyou Wang, Haizhou Li", "id": "2410.14259v1", "paper_url": "http://arxiv.org/abs/2410.14259v1", "repo": "null"}}