{"2412.09247": {"publish_time": "2024-12-12", "title": "Make Satire Boring Again: Reducing Stylistic Bias of Satirical Corpus by Utilizing Generative LLMs", "paper_summary": "Satire detection is essential for accurately extracting opinions from textual\ndata and combating misinformation online. However, the lack of diverse corpora\nfor satire leads to the problem of stylistic bias which impacts the models'\ndetection performances. This study proposes a debiasing approach for satire\ndetection, focusing on reducing biases in training data by utilizing generative\nlarge language models. The approach is evaluated in both cross-domain (irony\ndetection) and cross-lingual (English) settings. Results show that the\ndebiasing method enhances the robustness and generalizability of the models for\nsatire and irony detection tasks in Turkish and English. However, its impact on\ncausal language models, such as Llama-3.1, is limited. Additionally, this work\ncurates and presents the Turkish Satirical News Dataset with detailed human\nannotations, with case studies on classification, debiasing, and\nexplainability.", "paper_summary_zh": "諷刺偵測對於從文本資料中準確提取意見和打擊網路上錯誤訊息至關重要。然而，缺乏多樣化的諷刺語料庫導致風格偏誤的問題，這會影響模型的偵測效能。本研究提出了一種諷刺偵測的去偏誤方法，重點在於透過利用生成式大型語言模型減少訓練資料中的偏誤。這種方法在跨領域（諷刺偵測）和跨語言（英語）設定中都得到評估。結果顯示，去偏誤方法增強了模型在土耳其語和英語的諷刺和反諷偵測任務中的穩健性和概括性。然而，它對因果語言模型（例如 Llama-3.1）的影響有限。此外，這項工作策劃並呈現了土耳其諷刺新聞資料集，其中包含詳細的人工註解，以及分類、去偏誤和可解釋性的案例研究。", "author": "Asli Umay Ozturk et.al.", "authors": "Asli Umay Ozturk, Recep Firat Cekinel, Asli Umay Ozturk", "id": "2412.09247v1", "paper_url": "http://arxiv.org/abs/2412.09247v1", "repo": "null"}}