{"2412.07675": {"publish_time": "2024-12-10", "title": "RAZOR: Sharpening Knowledge by Cutting Bias with Unsupervised Text Rewriting", "paper_summary": "Despite the widespread use of LLMs due to their superior performance in\nvarious tasks, their high computational costs often lead potential users to opt\nfor the pretraining-finetuning pipeline. However, biases prevalent in manually\nconstructed datasets can introduce spurious correlations between tokens and\nlabels, creating so-called shortcuts and hindering the generalizability of\nfine-tuned models. Existing debiasing methods often rely on prior knowledge of\nspecific dataset biases, which is challenging to acquire a priori. We propose\nRAZOR (Rewriting And Zero-bias Optimization Refinement), a novel, unsupervised,\nand data-focused debiasing approach based on text rewriting for shortcut\nmitigation. RAZOR leverages LLMs to iteratively rewrite potentially biased text\nsegments by replacing them with heuristically selected alternatives in a\nshortcut space defined by token statistics and positional information. This\nprocess aims to align surface-level text features more closely with diverse\nlabel distributions, thereby promoting the learning of genuine linguistic\npatterns. Compared with unsupervised SoTA models, RAZOR improves by 3.5% on the\nFEVER and 6.5% on MNLI and SNLI datasets according to the F1 score.\nAdditionally, RAZOR effectively mitigates specific known biases, reducing\nbias-related terms by x2 without requiring prior bias information, a result\nthat is on par with SoTA models that leverage prior information. Our work\nprioritizes data manipulation over architectural modifications, emphasizing the\npivotal role of data quality in enhancing model performance and fairness. This\nresearch contributes to developing more robust evaluation benchmarks for\ndebiasing methods by incorporating metrics for bias reduction and overall model\nefficacy.", "paper_summary_zh": "儘管 LLM 因其在各種任務中表現優異而廣泛使用，但其高昂的運算成本通常導致潛在使用者選擇預訓練微調管線。然而，手動建構的資料集中普遍存在的偏差會導致標記和詞彙之間產生虛假的相關性，造成所謂的捷徑，並阻礙微調模型的泛化能力。現有的去偏差方法通常依賴於特定資料集偏差的先驗知識，這在先驗上很難獲得。我們提出 RAZOR（重寫和零偏差最佳化優化），一種基於文字重寫的新穎、無監督和以資料為中心的去偏差方法，用於捷徑緩解。RAZR 利用 LLM 迭代重寫潛在有偏差的文字片段，藉由在由標記統計和位置資訊定義的捷徑空間中以啟發式選擇的替代方案取代它們。此程序旨在使表面文字特徵更緊密地與多樣化的標籤分佈保持一致，從而促進真正語言模式的學習。與無監督的 SoTA 模型相比，根據 F1 分數，RAZR 在 FEVER 上提高了 3.5%，在 MNLI 和 SNLI 資料集上提高了 6.5%。此外，RAZR 有效地減輕了已知的特定偏差，將與偏差相關的術語減少了 x2，而不需要先前的偏差資訊，這項結果與利用先驗資訊的 SoTA 模型相當。我們的研究優先考慮資料處理而非架構修改，強調資料品質在提升模型效能和公平性方面的關鍵作用。這項研究有助於開發更穩健的去偏差方法評估基準，方法是納入偏差減少和整體模型效能的指標。", "author": "Shuo Yang et.al.", "authors": "Shuo Yang, Bardh Prenkaj, Gjergji Kasneci", "id": "2412.07675v1", "paper_url": "http://arxiv.org/abs/2412.07675v1", "repo": "null"}}