{"2501.01540": {"publish_time": "2025-01-02", "title": "BoxingGym: Benchmarking Progress in Automated Experimental Design and Model Discovery", "paper_summary": "Understanding the world and explaining it with scientific theories is a\ncentral aspiration of artificial intelligence research. Proposing theories,\ndesigning experiments to test them, and then revising them based on data are\nfundamental to scientific discovery. Despite the significant promise of\nLLM-based scientific agents, no benchmarks systematically test LLM's ability to\npropose scientific models, collect experimental data, and revise them in light\nof new data. We introduce BoxingGym, a benchmark with 10 environments for\nsystematically evaluating both experimental design (e.g. collecting data to\ntest a scientific theory) and model discovery (e.g. proposing and revising\nscientific theories). To enable tractable and quantitative evaluation, we\nimplement each environment as a generative probabilistic model with which a\nscientific agent can run interactive experiments. These probabilistic models\nare drawn from various real-world scientific domains ranging from psychology to\necology. To quantitatively evaluate a scientific agent's ability to collect\ninformative experimental data, we compute the expected information gain (EIG),\nan information-theoretic quantity which measures how much an experiment reduces\nuncertainty about the parameters of a generative model. A good scientific\ntheory is a concise and predictive explanation. Therefore, to quantitatively\nevaluate model discovery, we ask a scientific agent to explain their model and\nthen assess whether this explanation enables another scientific agent to make\nreliable predictions about this environment. In addition to this\nexplanation-based evaluation, we compute standard model evaluation metrics such\nas prediction errors. We find that current LLMs, such as GPT-4o, struggle with\nboth experimental design and model discovery. We find that augmenting the\nLLM-based agent with an explicit statistical model does not reliably improve\nthese results.", "paper_summary_zh": "<paragraph>理解世界并用科学理论解释世界是人工智能研究的核心追求。提出理论、设计实验来测试它们，然后根据数据修改它们是科学发现的基础。尽管基于 LLM 的科学代理具有显著的前景，但没有基准系统地测试 LLM 提出科学模型、收集实验数据以及根据新数据修改它们的能力。我们引入了 BoxingGym，这是一个包含 10 个环境的基准，用于系统地评估实验设计（例如收集数据来测试科学理论）和模型发现（例如提出和修改科学理论）。为了实现易处理和定量的评估，我们将每个环境实现为一个生成概率模型，科学代理可以使用该模型运行交互式实验。这些概率模型取自从心理学到生态学的各种现实世界科学领域。为了定量评估科学代理收集信息性实验数据的能力，我们计算期望信息增益 (EIG)，这是一个信息论量，用于衡量实验在多大程度上减少了对生成模型参数的不确定性。一个好的科学理论是一个简洁且具有预测性的解释。因此，为了定量评估模型发现，我们要求科学代理解释他们的模型，然后评估这种解释是否使另一个科学代理能够对该环境做出可靠的预测。除了这种基于解释的评估之外，我们还计算标准模型评估指标，例如预测误差。我们发现，当前的 LLM（例如 GPT-4o）在实验设计和模型发现方面都存在困难。我们发现，用显式统计模型增强基于 LLM 的代理并不能可靠地改善这些结果。</paragraph>", "author": "Kanishk Gandhi et.al.", "authors": "Kanishk Gandhi, Michael Y. Li, Lyle Goodyear, Louise Li, Aditi Bhaskar, Mohammed Zaman, Noah D. Goodman", "id": "2501.01540v1", "paper_url": "http://arxiv.org/abs/2501.01540v1", "repo": "null"}}