{"2405.15729": {"publish_time": "2024-05-24", "title": "Optimizing Large Language Models for OpenAPI Code Completion", "paper_summary": "Recent advancements in Large Language Models (LLMs) and their utilization in\ncode generation tasks have significantly reshaped the field of software\ndevelopment. Despite the remarkable efficacy of code completion solutions in\nmainstream programming languages, their performance lags when applied to less\nubiquitous formats such as OpenAPI definitions. This study evaluates the\nOpenAPI completion performance of GitHub Copilot, a prevalent commercial code\ncompletion tool, and proposes a set of task-specific optimizations leveraging\nMeta's open-source model Code Llama. A semantics-aware OpenAPI completion\nbenchmark proposed in this research is used to perform a series of experiments\nthrough which the impact of various prompt-engineering and fine-tuning\ntechniques on the Code Llama model's performance is analyzed. The fine-tuned\nCode Llama model reaches a peak correctness improvement of 55.2% over GitHub\nCopilot despite utilizing 25 times fewer parameters than the commercial\nsolution's underlying Codex model. Additionally, this research proposes an\nenhancement to a widely used code infilling training technique, addressing the\nissue of underperformance when the model is prompted with context sizes smaller\nthan those used during training.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展及其在程式碼產生任務中的應用已大幅改變軟體開發領域。儘管主流程式語言中的程式碼完成解決方案具有顯著的效能，但當應用於較不普遍的格式，例如 OpenAPI 定義時，其效能就會落後。本研究評估了 GitHub Copilot（一種流行的商用程式碼完成工具）的 OpenAPI 完成效能，並提出了一組利用 Meta 開源模型 Code Llama 的特定任務最佳化。本研究中提出的語義感知 OpenAPI 完成基準用於執行一系列實驗，透過這些實驗分析各種提示工程和微調技術對 Code Llama 模型效能的影響。微調後的 Code Llama 模型的正確性提升幅度達到 55.2%，優於 GitHub Copilot，儘管其使用的參數比商用解決方案的基礎 Codex 模型少了 25 倍。此外，本研究提出了一種對廣泛使用的程式碼填補訓練技術的強化，解決了當模型提示的內容大小小於訓練期間使用的內容大小時效能不佳的問題。", "author": "Bohdan Petryshyn et.al.", "authors": "Bohdan Petryshyn, Mantas Lukoševičius", "id": "2405.15729v1", "paper_url": "http://arxiv.org/abs/2405.15729v1", "repo": "null"}}