{"2502.02471": {"publish_time": "2025-02-04", "title": "Mind the Gap: Evaluating Patch Embeddings from General-Purpose and Histopathology Foundation Models for Cell Segmentation and Classification", "paper_summary": "Recent advancements in foundation models have transformed computer vision,\ndriving significant performance improvements across diverse domains, including\ndigital histopathology. However, the advantages of domain-specific\nhistopathology foundation models over general-purpose models for specialized\ntasks such as cell analysis remain underexplored. This study investigates the\nrepresentation learning gap between these two categories by analyzing\nmulti-level patch embeddings applied to cell instance segmentation and\nclassification. We implement an encoder-decoder architecture with a consistent\ndecoder and various encoders. These include convolutional, vision transformer\n(ViT), and hybrid encoders pre-trained on ImageNet-22K or LVD-142M,\nrepresenting general-purpose foundation models. These are compared against ViT\nencoders from the recently released UNI, Virchow2, and Prov-GigaPath foundation\nmodels, trained on patches extracted from hundreds of thousands of\nhistopathology whole-slide images. The decoder integrates patch embeddings from\ndifferent encoder depths via skip connections to generate semantic and distance\nmaps. These maps are then post-processed to create instance segmentation masks\nwhere each label corresponds to an individual cell and to perform cell-type\nclassification. All encoders remain frozen during training to assess their\npre-trained feature extraction capabilities. Using the PanNuke and CoNIC\nhistopathology datasets, and the newly introduced Nissl-stained CytoDArk0\ndataset for brain cytoarchitecture studies, we evaluate instance-level\ndetection, segmentation accuracy, and cell-type classification. This study\nprovides insights into the comparative strengths and limitations of\ngeneral-purpose vs. histopathology foundation models, offering guidance for\nmodel selection in cell-focused histopathology and brain cytoarchitecture\nanalysis workflows.", "paper_summary_zh": "<paragraph>基礎模型的最新進展轉變了電腦視覺，\n在包括數位組織病理學在內的不同領域推動了顯著的效能提升。\n然而，針對特定領域的組織病理學基礎模型在細胞分析等專業任務上，\n相較於通用模型的優勢仍未被充分探討。這項研究透過分析應用於細胞實例分割和分類的多層級區塊嵌入，\n探討這兩類別之間的表徵學習差距。我們實作了一個編碼器-解碼器架構，\n包含一致的解碼器和各種編碼器。這些編碼器包括卷積、視覺轉換器 (ViT) 和混合編碼器，\n預先訓練於 ImageNet-22K 或 LVD-142M，代表通用基礎模型。\n這些編碼器與最近發布的 UNI、Virchow2 和 Prov-GigaPath 基礎模型中的 ViT 編碼器進行比較，\n訓練於從數十萬張組織病理學全切片影像中提取的區塊。解碼器透過跳躍連線整合來自不同編碼器深度的區塊嵌入，\n以產生語義和距離地圖。然後對這些地圖進行後處理，以建立實例分割遮罩，\n其中每個標籤對應一個單一細胞，並執行細胞類型分類。所有編碼器在訓練期間保持凍結，\n以評估其預先訓練好的特徵萃取能力。使用 PanNuke 和 CoNIC 組織病理學資料集，\n以及新推出的 Nissl 染色的 CytoDArk0 資料集進行腦細胞結構研究，我們評估實例層級檢測、分割準確度和細胞類型分類。\n這項研究提供了通用基礎模型與組織病理學基礎模型的比較優勢和限制的見解，\n為細胞為中心的組織病理學和腦細胞結構分析工作流程中的模型選擇提供指導。</paragraph>", "author": "Valentina Vadori et.al.", "authors": "Valentina Vadori, Antonella Peruffo, Jean-Marie Graïc, Livio Finos, Enrico Grisan", "id": "2502.02471v1", "paper_url": "http://arxiv.org/abs/2502.02471v1", "repo": "null"}}