{"2408.12779": {"publish_time": "2024-08-23", "title": "Investigating LLM Applications in E-Commerce", "paper_summary": "The emergence of Large Language Models (LLMs) has revolutionized natural\nlanguage processing in various applications especially in e-commerce. One\ncrucial step before the application of such LLMs in these fields is to\nunderstand and compare the performance in different use cases in such tasks.\nThis paper explored the efficacy of LLMs in the e-commerce domain, focusing on\ninstruction-tuning an open source LLM model with public e-commerce datasets of\nvarying sizes and comparing the performance with the conventional models\nprevalent in industrial applications. We conducted a comprehensive comparison\nbetween LLMs and traditional pre-trained language models across specific tasks\nintrinsic to the e-commerce domain, namely classification, generation,\nsummarization, and named entity recognition (NER). Furthermore, we examined the\neffectiveness of the current niche industrial application of very large LLM,\nusing in-context learning, in e-commerce specific tasks. Our findings indicate\nthat few-shot inference with very large LLMs often does not outperform\nfine-tuning smaller pre-trained models, underscoring the importance of\ntask-specific model optimization.Additionally, we investigated different\ntraining methodologies such as single-task training, mixed-task training, and\nLoRA merging both within domain/tasks and between different tasks. Through\nrigorous experimentation and analysis, this paper offers valuable insights into\nthe potential effectiveness of LLMs to advance natural language processing\ncapabilities within the e-commerce industry.", "paper_summary_zh": "大型語言模型 (LLM) 的出現徹底改變了自然語言處理在各種應用中的應用，特別是在電子商務中。在這些領域應用此類 LLM 之前的一個關鍵步驟是了解並比較在這些任務的不同用例中的性能。本文探討了 LLM 在電子商務領域的功效，重點關注使用不同規模的公開電子商務數據集對開源 LLM 模型進行指令微調，並將其性能與工業應用中流行的傳統模型進行比較。我們對 LLM 和傳統預訓練語言模型在電子商務領域固有的特定任務（即分類、生成、摘要和命名實體識別 (NER)）之間進行了全面比較。此外，我們使用情境學習檢查了當前利基產業應用中非常大的 LLM 的有效性，在電子商務特定任務中。我們的研究結果表明，使用非常大的 LLM 進行的少次推論通常不會優於微調較小的預訓練模型，這突顯了特定任務模型優化的重要性。此外，我們研究了不同的訓練方法，例如單任務訓練、混合任務訓練和 LoRA 在域/任務內和不同任務之間的合併。通過嚴謹的實驗和分析，本文提供了有價值的見解，了解 LLM 在電子商務行業內推進自然語言處理能力的潛在有效性。", "author": "Chester Palen-Michel et.al.", "authors": "Chester Palen-Michel, Ruixiang Wang, Yipeng Zhang, David Yu, Canran Xu, Zhe Wu", "id": "2408.12779v1", "paper_url": "http://arxiv.org/abs/2408.12779v1", "repo": "null"}}