{"2410.11366": {"publish_time": "2024-10-15", "title": "LargePiG: Your Large Language Model is Secretly a Pointer Generator", "paper_summary": "Recent research on query generation has focused on using Large Language\nModels (LLMs), which despite bringing state-of-the-art performance, also\nintroduce issues with hallucinations in the generated queries. In this work, we\nintroduce relevance hallucination and factuality hallucination as a new\ntypology for hallucination problems brought by query generation based on LLMs.\nWe propose an effective way to separate content from form in LLM-generated\nqueries, which preserves the factual knowledge extracted and integrated from\nthe inputs and compiles the syntactic structure, including function words,\nusing the powerful linguistic capabilities of the LLM. Specifically, we\nintroduce a model-agnostic and training-free method that turns the Large\nLanguage Model into a Pointer-Generator (LargePiG), where the pointer attention\ndistribution leverages the LLM's inherent attention weights, and the copy\nprobability is derived from the difference between the vocabulary distribution\nof the model's high layers and the last layer. To validate the effectiveness of\nLargePiG, we constructed two datasets for assessing the hallucination problems\nin query generation, covering both document and video scenarios. Empirical\nstudies on various LLMs demonstrated the superiority of LargePiG on both\ndatasets. Additional experiments also verified that LargePiG could reduce\nhallucination in large vision language models and improve the accuracy of\ndocument-based question-answering and factuality evaluation tasks.", "paper_summary_zh": "近期關於查詢產生的研究，專注於使用大型語言模型 (LLM)，儘管帶來最先進的效能，但也引入了生成查詢中出現幻覺的問題。在這項工作中，我們將相關性幻覺和事實幻覺引入為 LLM 為基礎的查詢產生所帶來的幻覺問題的新類型。我們提出了一個有效的方法，用於將 LLM 生成的查詢中的內容與形式分開，這保留了從輸入中提取和整合的事實知識，並編譯句法結構，包括功能詞，利用 LLM 強大的語言能力。具體來說，我們引入了一個與模型無關且無需訓練的方法，將大型語言模型轉換為指標生成器 (LargePiG)，其中指標注意分配利用了 LLM 固有的注意權重，而複製機率則來自模型高層和最後一層的詞彙分配之間的差異。為了驗證 LargePiG 的有效性，我們構建了兩個用於評估查詢產生中幻覺問題的資料集，涵蓋文件和影片場景。對各種 LLM 的經驗研究證明了 LargePiG 在兩個資料集上的優越性。額外的實驗也驗證了 LargePiG 可以減少大型視覺語言模型中的幻覺，並提高基於文件的問答和事實評估任務的準確性。", "author": "Zhongxiang Sun et.al.", "authors": "Zhongxiang Sun, Zihua Si, Xiaoxue Zang, Kai Zheng, Yang Song, Xiao Zhang, Jun Xu", "id": "2410.11366v1", "paper_url": "http://arxiv.org/abs/2410.11366v1", "repo": "null"}}