{"2411.14459": {"publish_time": "2024-11-16", "title": "Unveiling User Preferences: A Knowledge Graph and LLM-Driven Approach for Conversational Recommendation", "paper_summary": "Conversational Recommender Systems (CRSs) aim to provide personalized\nrecommendations through dynamically capturing user preferences in interactive\nconversations. Conventional CRSs often extract user preferences as hidden\nrepresentations, which are criticized for their lack of interpretability. This\ndiminishes the transparency and trustworthiness of the recommendation process.\nRecent works have explored combining the impressive capabilities of Large\nLanguage Models (LLMs) with the domain-specific knowledge of Knowledge Graphs\n(KGs) to generate human-understandable recommendation explanations. Despite\nthese efforts, the integration of LLMs and KGs for CRSs remains challenging due\nto the modality gap between unstructured dialogues and structured KGs.\nMoreover, LLMs pre-trained on large-scale corpora may not be well-suited for\nanalyzing user preferences, which require domain-specific knowledge. In this\npaper, we propose COMPASS, a plug-and-play framework that synergizes LLMs and\nKGs to unveil user preferences, enhancing the performance and explainability of\nexisting CRSs. To address integration challenges, COMPASS employs a two-stage\ntraining approach: first, it bridges the gap between the structured KG and\nnatural language through an innovative graph entity captioning pre-training\nmechanism. This enables the LLM to transform KG entities into concise natural\nlanguage descriptions, allowing them to comprehend domain-specific knowledge.\nFollowing, COMPASS optimizes user preference modeling via knowledge-aware\ninstruction fine-tuning, where the LLM learns to reason and summarize user\npreferences from both dialogue histories and KG-augmented context. This enables\nCOMPASS to perform knowledge-aware reasoning and generate comprehensive and\ninterpretable user preferences that can seamlessly integrate with existing CRS\nmodels for improving recommendation performance and explainability.", "paper_summary_zh": "對話式推薦系統 (CRS) 旨在透過動態捕捉互動對話中的使用者偏好，提供個人化推薦。傳統的 CRS 通常會將使用者偏好擷取為隱藏式表徵，而其缺點在於缺乏可解釋性，這降低了推薦程式的透明度和可信度。最近的研究探討將大型語言模型 (LLM) 的強大功能與知識圖譜 (KG) 的特定領域知識結合，以產生人類可以理解的推薦說明。儘管有這些努力，由於非結構化對話和結構化 KG 之間的模式差異，LLM 和 KG 在 CRS 中的整合仍然具有挑戰性。此外，針對大型語料庫預先訓練的 LLM 可能不適合分析使用者偏好，因為這需要特定領域的知識。在本文中，我們提出 COMPASS，這是一個即插即用的架構，它協同運用 LLM 和 KG 來揭示使用者偏好，增強現有 CRS 的效能和可解釋性。為了應對整合挑戰，COMPASS 採用了兩階段的訓練方法：首先，它透過創新的圖形實體標題預訓練機制，彌合結構化 KG 和自然語言之間的差距。這讓 LLM 能夠將 KG 實體轉換為簡潔的自然語言描述，讓它們能夠理解特定領域的知識。接下來，COMPASS 透過知識感知指令微調來最佳化使用者偏好建模，其中 LLM 學習從對話記錄和 KG 擴充的內容中推論和總結使用者偏好。這讓 COMPASS 能夠執行知識感知推理，並產生全面且可解釋的使用者偏好，這些偏好可以無縫整合到現有的 CRS 模型中，以改善推薦效能和可解釋性。", "author": "Zhangchi Qiu et.al.", "authors": "Zhangchi Qiu, Linhao Luo, Shirui Pan, Alan Wee-Chung Liew", "id": "2411.14459v1", "paper_url": "http://arxiv.org/abs/2411.14459v1", "repo": "null"}}