{"2411.19548": {"publish_time": "2024-11-29", "title": "ReconDreamer: Crafting World Models for Driving Scene Reconstruction via Online Restoration", "paper_summary": "Closed-loop simulation is crucial for end-to-end autonomous driving. Existing\nsensor simulation methods (e.g., NeRF and 3DGS) reconstruct driving scenes\nbased on conditions that closely mirror training data distributions. However,\nthese methods struggle with rendering novel trajectories, such as lane changes.\nRecent works have demonstrated that integrating world model knowledge\nalleviates these issues. Despite their efficiency, these approaches still\nencounter difficulties in the accurate representation of more complex\nmaneuvers, with multi-lane shifts being a notable example. Therefore, we\nintroduce ReconDreamer, which enhances driving scene reconstruction through\nincremental integration of world model knowledge. Specifically, DriveRestorer\nis proposed to mitigate artifacts via online restoration. This is complemented\nby a progressive data update strategy designed to ensure high-quality rendering\nfor more complex maneuvers. To the best of our knowledge, ReconDreamer is the\nfirst method to effectively render in large maneuvers. Experimental results\ndemonstrate that ReconDreamer outperforms Street Gaussians in the NTA-IoU,\nNTL-IoU, and FID, with relative improvements by 24.87%, 6.72%, and 29.97%.\nFurthermore, ReconDreamer surpasses DriveDreamer4D with PVG during large\nmaneuver rendering, as verified by a relative improvement of 195.87% in the\nNTA-IoU metric and a comprehensive user study.", "paper_summary_zh": "封閉迴路模擬對於端到端的自動駕駛至關重要。現有的感測器模擬方法（例如 NeRF 和 3DGS）根據與訓練資料分佈高度相似的條件重建駕駛場景。然而，這些方法難以呈現新的軌跡，例如變換車道。最近的研究表明，整合世界模型知識可以緩解這些問題。儘管這些方法很有效率，但在準確表示更複雜的機動方面仍然遇到困難，其中多車道變換是一個顯著的例子。因此，我們引入了 ReconDreamer，它透過逐步整合世界模型知識來增強駕駛場景重建。具體來說，提出了 DriveRestorer 以透過線上修復來減輕人工製品。這由進步的資料更新策略所補充，旨在確保更複雜機動的高品質渲染。據我們所知，ReconDreamer 是第一個有效呈現大型機動的方法。實驗結果表明，ReconDreamer 在 NTA-IoU、NTL-IoU 和 FID 中優於 Street Gaussians，相對改進了 24.87%、6.72% 和 29.97%。此外，ReconDreamer 在大型機動渲染期間使用 PVG 超越了 DriveDreamer4D，這由 NTA-IoU 指標中 195.87% 的相對改進和全面的使用者研究所驗證。", "author": "Chaojun Ni et.al.", "authors": "Chaojun Ni, Guosheng Zhao, Xiaofeng Wang, Zheng Zhu, Wenkang Qin, Guan Huang, Chen Liu, Yuyin Chen, Yida Wang, Xueyang Zhang, Yifei Zhan, Kun Zhan, Peng Jia, Xianpeng Lang, Xingang Wang, Wenjun Mei", "id": "2411.19548v1", "paper_url": "http://arxiv.org/abs/2411.19548v1", "repo": "null"}}