{"2412.02371": {"publish_time": "2024-12-03", "title": "TSCheater: Generating High-Quality Tibetan Adversarial Texts via Visual Similarity", "paper_summary": "Language models based on deep neural networks are vulnerable to textual\nadversarial attacks. While rich-resource languages like English are receiving\nfocused attention, Tibetan, a cross-border language, is gradually being studied\ndue to its abundant ancient literature and critical language strategy.\nCurrently, there are several Tibetan adversarial text generation methods, but\nthey do not fully consider the textual features of Tibetan script and\noverestimate the quality of generated adversarial texts. To address this issue,\nwe propose a novel Tibetan adversarial text generation method called TSCheater,\nwhich considers the characteristic of Tibetan encoding and the feature that\nvisually similar syllables have similar semantics. This method can also be\ntransferred to other abugidas, such as Devanagari script. We utilize a\nself-constructed Tibetan syllable visual similarity database called TSVSDB to\ngenerate substitution candidates and adopt a greedy algorithm-based scoring\nmechanism to determine substitution order. After that, we conduct the method on\neight victim language models. Experimentally, TSCheater outperforms existing\nmethods in attack effectiveness, perturbation magnitude, semantic similarity,\nvisual similarity, and human acceptance. Finally, we construct the first\nTibetan adversarial robustness evaluation benchmark called AdvTS, which is\ngenerated by existing methods and proofread by humans.", "paper_summary_zh": "基於深度神經網路的語言模型容易受到文字對抗攻擊。雖然像英語這種資源豐富的語言正受到關注，但藏語作為跨境語言，由於其豐富的古代文獻和重要的語言策略，正逐漸受到研究。目前，有幾種藏語對抗文本生成方法，但它們並未充分考慮藏文文字的特徵，並且高估了生成的對抗文本的質量。為了解決這個問題，我們提出了一種名為 TSCheater 的新型藏語對抗文本生成方法，它考慮了藏文編碼的特徵以及視覺上相似的音節具有相似的語義這一特徵。此方法也可以轉移到其他音節文字，例如天城文。我們利用一個自建的藏文音節視覺相似度資料庫 TSVSDB 來生成替換候選項，並採用基於貪婪演算法的評分機制來確定替換順序。之後，我們對八個受害語言模型執行此方法。實驗表明，TSCheater 在攻擊有效性、擾動幅度、語義相似性、視覺相似性和人類接受度方面優於現有方法。最後，我們構建了第一個藏語對抗魯棒性評估基準，稱為 AdvTS，它是由現有方法生成並由人工校對的。", "author": "Xi Cao et.al.", "authors": "Xi Cao, Quzong Gesang, Yuan Sun, Nuo Qun, Tashi Nyima", "id": "2412.02371v1", "paper_url": "http://arxiv.org/abs/2412.02371v1", "repo": "null"}}