{"2412.09126": {"publish_time": "2024-12-12", "title": "Enhancing Modality Representation and Alignment for Multimodal Cold-start Active Learning", "paper_summary": "Training multimodal models requires a large amount of labeled data. Active\nlearning (AL) aim to reduce labeling costs. Most AL methods employ warm-start\napproaches, which rely on sufficient labeled data to train a well-calibrated\nmodel that can assess the uncertainty and diversity of unlabeled data. However,\nwhen assembling a dataset, labeled data are often scarce initially, leading to\na cold-start problem. Additionally, most AL methods seldom address multimodal\ndata, highlighting a research gap in this field. Our research addresses these\nissues by developing a two-stage method for Multi-Modal Cold-Start Active\nLearning (MMCSAL).\n  Firstly, we observe the modality gap, a significant distance between the\ncentroids of representations from different modalities, when only using\ncross-modal pairing information as self-supervision signals. This modality gap\naffects data selection process, as we calculate both uni-modal and cross-modal\ndistances. To address this, we introduce uni-modal prototypes to bridge the\nmodality gap. Secondly, conventional AL methods often falter in multimodal\nscenarios where alignment between modalities is overlooked. Therefore, we\npropose enhancing cross-modal alignment through regularization, thereby\nimproving the quality of selected multimodal data pairs in AL. Finally, our\nexperiments demonstrate MMCSAL's efficacy in selecting multimodal data pairs\nacross three multimodal datasets.", "paper_summary_zh": "訓練多模態模型需要大量的標籤資料。主動學習 (AL) 旨在降低標籤成本。大多數 AL 方法採用熱啟動方法，依賴於足夠的標籤資料來訓練一個校準良好的模型，該模型可以評估未標籤資料的不確定性和多樣性。然而，在組裝資料集時，標籤資料通常一開始很稀少，導致冷啟動問題。此外，大多數 AL 方法很少處理多模態資料，凸顯了該領域的研究空白。我們的研究透過開發多模態冷啟動主動學習 (MMCSAL) 的兩階段方法來解決這些問題。\n首先，當僅使用跨模態配對資訊作為自我監督訊號時，我們觀察到模態差距，這是來自不同模態的表示之重心的顯著距離。此模態差距會影響資料選取流程，因為我們計算單模態和跨模態距離。為了解決此問題，我們引入單模態原型來彌合模態差距。其次，傳統的 AL 方法通常在忽略模態之間對齊的多模態場景中失敗。因此，我們建議透過正則化增強跨模態對齊，從而提高 AL 中所選多模態資料對的品質。最後，我們的實驗證明了 MMCSAL 在三個多模態資料集中選取多模態資料對的效能。", "author": "Meng Shen et.al.", "authors": "Meng Shen, Yake Wei, Jianxiong Yin, Deepu Rajan, Di Hu, Simon See", "id": "2412.09126v1", "paper_url": "http://arxiv.org/abs/2412.09126v1", "repo": "null"}}