{"2412.04069": {"publish_time": "2024-12-05", "title": "ProtDAT: A Unified Framework for Protein Sequence Design from Any Protein Text Description", "paper_summary": "Protein design has become a critical method in advancing significant\npotential for various applications such as drug development and enzyme\nengineering. However, protein design methods utilizing large language models\nwith solely pretraining and fine-tuning struggle to capture relationships in\nmulti-modal protein data. To address this, we propose ProtDAT, a de novo\nfine-grained framework capable of designing proteins from any descriptive\nprotein text input. ProtDAT builds upon the inherent characteristics of protein\ndata to unify sequences and text as a cohesive whole rather than separate\nentities. It leverages an innovative multi-modal cross-attention, integrating\nprotein sequences and textual information for a foundational level and seamless\nintegration. Experimental results demonstrate that ProtDAT achieves the\nstate-of-the-art performance in protein sequence generation, excelling in\nrationality, functionality, structural similarity, and validity. On 20,000\ntext-sequence pairs from Swiss-Prot, it improves pLDDT by 6%, TM-score by 0.26,\nand reduces RMSD by 1.2 {\\AA}, highlighting its potential to advance protein\ndesign.", "paper_summary_zh": "蛋白設計已成為推進各種應用（如藥物開發和酵素工程）的重大潛力的關鍵方法。然而，利用大型語言模型、僅使用預訓練和微調的蛋白設計方法難以捕捉多模式蛋白數據中的關係。為了解決這個問題，我們提出了 ProtDAT，一個能夠根據任何描述性蛋白文本輸入設計蛋白質的全新細粒度框架。ProtDAT 建構在蛋白質數據的內在特性之上，將序列和文本統一為一個整體，而不是分開的實體。它利用創新的多模式交叉注意力，整合蛋白質序列和文本資訊，作為基礎層級和無縫整合。實驗結果表明，ProtDAT 在蛋白質序列生成中實現了最先進的效能，在合理性、功能性、結構相似性和有效性方面表現出色。在 Swiss-Prot 中的 20,000 個文本序列對中，它將 pLDDT 提高了 6%，TM 分數提高了 0.26，並將 RMSD 降低了 1.2 {\\AA}，突顯了它在推進蛋白質設計方面的潛力。", "author": "Xiao-Yu Guo et.al.", "authors": "Xiao-Yu Guo, Yi-Fan Li, Yuan Liu, Xiaoyong Pan, Hong-Bin Shen", "id": "2412.04069v1", "paper_url": "http://arxiv.org/abs/2412.04069v1", "repo": "null"}}