{"2407.20516": {"publish_time": "2024-07-30", "title": "Machine Unlearning in Generative AI: A Survey", "paper_summary": "Generative AI technologies have been deployed in many places, such as\n(multimodal) large language models and vision generative models. Their\nremarkable performance should be attributed to massive training data and\nemergent reasoning abilities. However, the models would memorize and generate\nsensitive, biased, or dangerous information originated from the training data\nespecially those from web crawl. New machine unlearning (MU) techniques are\nbeing developed to reduce or eliminate undesirable knowledge and its effects\nfrom the models, because those that were designed for traditional\nclassification tasks could not be applied for Generative AI. We offer a\ncomprehensive survey on many things about MU in Generative AI, such as a new\nproblem formulation, evaluation methods, and a structured discussion on the\nadvantages and limitations of different kinds of MU techniques. It also\npresents several critical challenges and promising directions in MU research. A\ncurated list of readings can be found:\nhttps://github.com/franciscoliu/GenAI-MU-Reading.", "paper_summary_zh": "生成式 AI 技術已部署在許多地方，例如（多模態）大型語言模型和視覺生成模型。他們的卓越表現應歸功於大量的訓練資料和新興的推理能力。然而，這些模型會記住並產生來自訓練資料的敏感、有偏見或危險的資訊，特別是來自網路爬蟲的資訊。新的機器遺忘（MU）技術正在開發中，以減少或消除模型中不良的知識及其影響，因為那些專為傳統分類任務而設計的技術無法應用於生成式 AI。我們對生成式 AI 中 MU 的許多事情進行了全面的調查，例如新的問題表述、評估方法，以及對不同種類 MU 技術的優缺點進行結構化討論。它還提出了 MU 研究中的幾個關鍵挑戰和有希望的方向。可以找到精選的閱讀清單：\nhttps://github.com/franciscoliu/GenAI-MU-Reading。", "author": "Zheyuan Liu et.al.", "authors": "Zheyuan Liu, Guangyao Dou, Zhaoxuan Tan, Yijun Tian, Meng Jiang", "id": "2407.20516v1", "paper_url": "http://arxiv.org/abs/2407.20516v1", "repo": "https://github.com/franciscoliu/genai-mu-reading"}}