{"2410.10463": {"publish_time": "2024-10-14", "title": "TABCF: Counterfactual Explanations for Tabular Data Using a Transformer-Based VAE", "paper_summary": "In the field of Explainable AI (XAI), counterfactual (CF) explanations are\none prominent method to interpret a black-box model by suggesting changes to\nthe input that would alter a prediction. In real-world applications, the input\nis predominantly in tabular form and comprised of mixed data types and complex\nfeature interdependencies. These unique data characteristics are difficult to\nmodel, and we empirically show that they lead to bias towards specific feature\ntypes when generating CFs. To overcome this issue, we introduce TABCF, a CF\nexplanation method that leverages a transformer-based Variational Autoencoder\n(VAE) tailored for modeling tabular data. Our approach uses transformers to\nlearn a continuous latent space and a novel Gumbel-Softmax detokenizer that\nenables precise categorical reconstruction while preserving end-to-end\ndifferentiability. Extensive quantitative evaluation on five financial datasets\ndemonstrates that TABCF does not exhibit bias toward specific feature types,\nand outperforms existing methods in producing effective CFs that align with\ncommon CF desiderata.", "paper_summary_zh": "在可解釋 AI (XAI) 領域中，反事實 (CF) 解釋是一種重要的透過建議變更輸入來改變預測的黑箱模型解釋方法。在實際應用中，輸入主要以表格形式呈現，並包含混合資料類型和複雜的特徵相互依賴性。這些獨特資料特徵難以建模，我們實證顯示，在產生 CF 時，它們會導致偏向特定特徵類型。為了克服這個問題，我們引入了 TABCF，這是一種 CF 解釋方法，它利用了為表格資料建模而量身打造的基於變換器的變異自動編碼器 (VAE)。我們的做法使用變換器來學習連續潛在空間和一種新的 Gumbel-Softmax 去標記器，它可以在保留端對端可微分的同時實現精確的分類重建。對五個財務資料集進行的廣泛定量評估表明，TABCF 沒有表現出對特定特徵類型的偏見，並且在產生符合常見 CF 理想條件的有效 CF 方面優於現有方法。", "author": "Emmanouil Panagiotou et.al.", "authors": "Emmanouil Panagiotou, Manuel Heurich, Tim Landgraf, Eirini Ntoutsi", "id": "2410.10463v1", "paper_url": "http://arxiv.org/abs/2410.10463v1", "repo": "https://github.com/panagiotou/tabcf"}}