{"2411.08243": {"publish_time": "2024-11-12", "title": "Beyond the Safety Bundle: Auditing the Helpful and Harmless Dataset", "paper_summary": "In an effort to mitigate the harms of large language models (LLMs), learning\nfrom human feedback (LHF) has been used to steer LLMs towards outputs that are\nintended to be both less harmful and more helpful. Despite the widespread\nadoption of LHF in practice, the quality of this feedback and its effectiveness\nas a safety mitigation technique remain unclear. This study addresses these\nissues by auditing the widely-used Helpful and Harmless (HH) dataset by\nAnthropic. Our work includes: (1) a thorough investigation of the dataset's\ncontent through both manual and automated evaluation; (2) experiments\ndemonstrating the dataset's impact on models' safety; and (3) an analysis of\nthe 100 most influential papers citing this dataset. Through our audit, we\nshowcase how conceptualization failures and quality issues identified in the HH\ndataset can create additional harms by leading to disparate safety behaviors\nacross demographic groups. Our findings highlight the need for more nuanced,\ncontext-sensitive approaches to safety mitigation in LLMs.", "paper_summary_zh": "為了減輕大型語言模型 (LLM) 的危害，從人類回饋 (LHF) 學習已被用於引導 LLM 產生既不那麼有害又有幫助的輸出。儘管 LHF 在實務中被廣泛採用，但此回饋的品質及其作為安全緩解技術的有效性仍不清楚。本研究透過審查 Anthropic 廣泛使用的有益且無害 (HH) 資料集來探討這些問題。我們的研究包括：(1) 透過手動和自動評估徹底調查資料集的內容；(2) 實驗證明資料集對模型安全性的影響；以及 (3) 分析引用此資料集的 100 篇最具影響力的論文。透過我們的審查，我們展示了 HH 資料集中識別出的概念化失敗和品質問題如何透過導致不同人口群體間的安全性行為差異而造成額外的危害。我們的研究結果強調需要針對 LLM 的安全緩解採取更細緻且對情境敏感的方法。", "author": "Khaoula Chehbouni et.al.", "authors": "Khaoula Chehbouni, Jonathan Colaço-Carr, Yash More, Jackie CK Cheung, Golnoosh Farnadi", "id": "2411.08243v1", "paper_url": "http://arxiv.org/abs/2411.08243v1", "repo": "null"}}