{"2501.12273": {"publish_time": "2025-01-21", "title": "Condor: Enhance LLM Alignment with Knowledge-Driven Data Synthesis and Refinement", "paper_summary": "The quality of Supervised Fine-Tuning (SFT) data plays a critical role in\nenhancing the conversational capabilities of Large Language Models (LLMs).\nHowever, as LLMs become more advanced, the availability of high-quality\nhuman-annotated SFT data has become a significant bottleneck, necessitating a\ngreater reliance on synthetic training data. In this work, we introduce Condor,\na novel two-stage synthetic data generation framework that incorporates World\nKnowledge Tree and Self-Reflection Refinement to produce high-quality SFT data\nat scale. Our experimental results demonstrate that a base model fine-tuned on\nonly 20K Condor-generated samples achieves superior performance compared to\ncounterparts. The additional refinement stage in Condor further enables\niterative self-improvement for LLMs at various scales (up to 72B), validating\nthe effectiveness of our approach. Furthermore, our investigation into the\nscaling for synthetic data in post-training reveals substantial unexplored\npotential for performance improvements, opening promising avenues for future\nresearch.", "paper_summary_zh": "監督式微調 (SFT) 資料的品質對於增強大型語言模型 (LLM) 的對話能力發揮關鍵作用。然而，隨著 LLM 變得越來越先進，高品質人工標註 SFT 資料的可用性已成為一個重大的瓶頸，這使得對合成訓練資料的依賴性越來越高。在這項工作中，我們介紹了 Condor，一個新穎的兩階段合成資料生成架構，它結合了世界知識樹和自我反省精煉，以大規模產生高品質的 SFT 資料。我們的實驗結果表明，僅針對 20K 個 Condor 生成的範例進行微調的基本模型，與同類型模型相比，可獲得優越的效能。Condor 中的額外精煉階段進一步讓 LLM 能夠在各種規模（最高 72B）下進行反覆自我改善，驗證了我們方法的有效性。此外，我們對訓練後合成資料的擴展性進行調查，揭示了效能改善的巨大未開發潛力，為未來的研究開闢了有前景的途徑。", "author": "Maosong Cao et.al.", "authors": "Maosong Cao, Taolin Zhang, Mo Li, Chuyu Zhang, Yunxin Liu, Haodong Duan, Songyang Zhang, Kai Chen", "id": "2501.12273v1", "paper_url": "http://arxiv.org/abs/2501.12273v1", "repo": "null"}}