{"2408.12036": {"publish_time": "2024-08-21", "title": "Reasoning and Tools for Human-Level Forecasting", "paper_summary": "Language models (LMs) trained on web-scale datasets are largely successful\ndue to their ability to memorize large amounts of training data, even if only\npresent in a few examples. These capabilities are often desirable in evaluation\non tasks such as question answering but raise questions about whether these\nmodels can exhibit genuine reasoning or succeed only at mimicking patterns from\nthe training data. This distinction is particularly salient in forecasting\ntasks, where the answer is not present in the training data, and the model must\nreason to make logical deductions. We present Reasoning and Tools for\nForecasting (RTF), a framework of reasoning-and-acting (ReAct) agents that can\ndynamically retrieve updated information and run numerical simulation with\nequipped tools. We evaluate our model with questions from competitive\nforecasting platforms and demonstrate that our method is competitive with and\ncan outperform human predictions. This suggests that LMs, with the right tools,\ncan indeed think and adapt like humans, offering valuable insights for\nreal-world decision-making.", "paper_summary_zh": "語言模型 (LM) 在網路規模資料集上訓練後，由於它們能夠記住大量的訓練資料，即使這些資料只出現在少數範例中，因此在很大程度上獲得成功。這些能力通常在問答等任務的評估中是可取的，但引發了這些模型是否能表現出真正的推理或僅成功模仿訓練資料中的模式等問題。這種區別在預測任務中特別明顯，在預測任務中，答案不存在於訓練資料中，而且模型必須推理才能進行邏輯推論。我們提出預測推理和工具 (RTF)，一個推理和行動 (ReAct) 代理架構，它可以動態擷取更新的資訊，並使用已裝備的工具執行數值模擬。我們使用來自競爭預測平台的問題來評估我們的模型，並證明我們的模型具有競爭力，而且可以優於人類預測。這表明 LM 在使用正確的工具後，確實可以像人類一樣思考和適應，為現實世界的決策提供有價值的見解。", "author": "Elvis Hsieh et.al.", "authors": "Elvis Hsieh, Preston Fu, Jonathan Chen", "id": "2408.12036v1", "paper_url": "http://arxiv.org/abs/2408.12036v1", "repo": "null"}}