{"2410.23501": {"publish_time": "2024-10-30", "title": "All or None: Identifiable Linear Properties of Next-token Predictors in Language Modeling", "paper_summary": "We analyze identifiability as a possible explanation for the ubiquity of\nlinear properties across language models, such as the vector difference between\nthe representations of \"easy\" and \"easiest\" being parallel to that between\n\"lucky\" and \"luckiest\". For this, we ask whether finding a linear property in\none model implies that any model that induces the same distribution has that\nproperty, too. To answer that, we first prove an identifiability result to\ncharacterize distribution-equivalent next-token predictors, lifting a diversity\nrequirement of previous results. Second, based on a refinement of relational\nlinearity [Paccanaro and Hinton, 2001; Hernandez et al., 2024], we show how\nmany notions of linearity are amenable to our analysis. Finally, we show that\nunder suitable conditions, these linear properties either hold in all or none\ndistribution-equivalent next-token predictors.", "paper_summary_zh": "我們分析可識別性，作為語言模型中普遍存在線性特性的可能解釋，例如「容易」和「最容易」的表示之間的向量差與「幸運」和「最幸運」之間的向量差平行。為此，我們詢問在一個模型中找到一個線性特徵是否意味著任何誘導出相同分布的模型也具有該特徵。為了回答這個問題，我們首先證明一個可識別性結果，以描述等價於分布的下一代預測器，並解除先前結果的多樣性要求。其次，根據關係線性的改進 [Paccanaro and Hinton, 2001; Hernandez et al., 2024]，我們展示了多少線性概念適用於我們的分析。最後，我們表明在適當的條件下，這些線性特徵在所有或沒有等價於分布的下一代預測器中成立。", "author": "Emanuele Marconato et.al.", "authors": "Emanuele Marconato, Sébastien Lachapelle, Sebastian Weichwald, Luigi Gresele", "id": "2410.23501v1", "paper_url": "http://arxiv.org/abs/2410.23501v1", "repo": "null"}}