{"2406.04873": {"publish_time": "2024-06-07", "title": "Ada-VE: Training-Free Consistent Video Editing Using Adaptive Motion Prior", "paper_summary": "Video-to-video synthesis models face significant challenges, such as ensuring\nconsistent character generation across frames, maintaining smooth temporal\ntransitions, and preserving quality during fast motion. The introduction of\njoint fully cross-frame self-attention mechanisms has improved character\nconsistency, but this comes at the cost of increased computational complexity.\nThis full cross-frame self-attention mechanism also incorporates redundant\ndetails and limits the number of frames that can be jointly edited due to its\ncomputational cost. Moreover, the lack of frames in cross-frame attention\nadversely affects temporal consistency and visual quality. To address these\nlimitations, we propose a new adaptive motion-guided cross-frame attention\nmechanism that drastically reduces complexity while preserving semantic details\nand temporal consistency. Specifically, we selectively incorporate the moving\nregions of successive frames in cross-frame attention and sparsely include\nstationary regions based on optical flow sampling. This technique allows for an\nincreased number of jointly edited frames without additional computational\noverhead. For longer duration of video editing, existing methods primarily\nfocus on frame interpolation or flow-warping from jointly edited keyframes,\nwhich often results in blurry frames or reduced temporal consistency. To\nimprove this, we introduce KV-caching of jointly edited frames and reuse the\nsame KV across all intermediate frames, significantly enhancing both\nintermediate frame quality and temporal consistency. Overall, our\nmotion-sampling method enables the use of around three times more keyframes\nthan existing joint editing methods while maintaining superior prediction\nquality. Ada-VE achieves up to 4x speed-up when using fully-extended\nself-attention across 40 frames for joint editing, without compromising visual\nquality or temporal consistency.", "paper_summary_zh": "影片到影片的合成模型面临着重大的挑战，例如确保整个帧中角色生成的一致性、维持流畅的时间转换，以及在快速移动过程中保持质量。引入联合全帧自注意力机制改善了角色一致性，但这以增加计算复杂性为代价。这种全帧自注意力机制还纳入了冗余的细节，并由于其计算成本而限制了可以联合编辑的帧数。此外，跨帧注意力中缺少帧对时间一致性和视觉质量产生不利影响。为了解决这些限制，我们提出了一种新的自适应运动引导的跨帧注意力机制，该机制大幅降低了复杂性，同时保留了语义细节和时间一致性。具体来说，我们在跨帧注意力中选择性地纳入连续帧的移动区域，并基于光流采样稀疏地包含静止区域。此技术允许增加联合编辑的帧数，而不会增加额外的计算开销。对于较长时间的影片编辑，现有方法主要集中在从联合编辑的关键帧进行帧插值或流变形，这通常会导致模糊的帧或降低的时间一致性。为了改善这一点，我们在联合编辑的帧中引入了 KV 缓存，并在所有中间帧中重复使用相同的 KV，从而显著提高了中间帧质量和时间一致性。总体而言，我们的运动采样方法能够比现有的联合编辑方法使用大约三倍的关键帧，同时保持卓越的预测质量。Ada-VE 在联合编辑 40 帧时使用完全扩展的自注意力时实现了高达 4 倍的加速，而不会损害视觉质量或时间一致性。", "author": "Tanvir Mahmud et.al.", "authors": "Tanvir Mahmud, Mustafa Munir, Radu Marculescu, Diana Marculescu", "id": "2406.04873v1", "paper_url": "http://arxiv.org/abs/2406.04873v1", "repo": "null"}}