{"2502.14558": {"publish_time": "2025-02-20", "title": "FUIA: Model Inversion Attack against Federated Unlearning", "paper_summary": "With the introduction of regulations related to the ``right to be forgotten\",\nfederated learning (FL) is facing new privacy compliance challenges. To address\nthese challenges, researchers have proposed federated unlearning (FU). However,\nexisting FU research has primarily focused on improving the efficiency of\nunlearning, with less attention paid to the potential privacy vulnerabilities\ninherent in these methods. To address this gap, we draw inspiration from\ngradient inversion attacks in FL and propose the federated unlearning inversion\nattack (FUIA). The FUIA is specifically designed for the three types of FU\n(sample unlearning, client unlearning, and class unlearning), aiming to provide\na comprehensive analysis of the privacy leakage risks associated with FU. In\nFUIA, the server acts as an honest-but-curious attacker, recording and\nexploiting the model differences before and after unlearning to expose the\nfeatures and labels of forgotten data. FUIA significantly leaks the privacy of\nforgotten data and can target all types of FU. This attack contradicts the goal\nof FU to eliminate specific data influence, instead exploiting its\nvulnerabilities to recover forgotten data and expose its privacy flaws.\nExtensive experimental results show that FUIA can effectively reveal the\nprivate information of forgotten data. To mitigate this privacy leakage, we\nalso explore two potential defense methods, although these come at the cost of\nreduced unlearning effectiveness and the usability of the unlearned model.", "paper_summary_zh": "隨著「被遺忘權」相關法規的推出，\n聯盟學習 (FL) 面臨新的隱私合規挑戰。為了應對\n這些挑戰，研究人員提出了聯盟取消學習 (FU)。然而，\n現有的 FU 研究主要集中在提高取消學習的效率，較少關注這些方法中固有的潛在隱私漏洞。為了解決這個差距，我們從\nFL 中的梯度反演攻擊中汲取靈感，並提出聯盟取消學習反演\n攻擊 (FUIA)。FUIA 專門設計用於三種類型的 FU\n（樣本取消學習、客戶端取消學習和類別取消學習），旨在提供\n對與 FU 相關的隱私洩露風險的全面分析。在\nFUIA 中，伺服器充當誠實但好奇的攻擊者，記錄並\n利用取消學習前後的模型差異來揭露遺忘資料的功能和標籤。FUIA 大幅洩露遺忘資料的隱私，並且可以針對所有類型的 FU。此攻擊與 FU 消除特定資料影響的目標相矛盾，而是利用其\n漏洞來恢復遺忘資料並揭露其隱私缺陷。廣泛的實驗結果表明 FUIA 可以有效揭露遺忘資料的私人資訊。為了減輕這種隱私洩露，我們\n還探索了兩種潛在的防禦方法，儘管這些方法以降低取消學習的有效性和已取消學習模型的可用性為代價。", "author": "Lei Zhou et.al.", "authors": "Lei Zhou, Youwen Zhu", "id": "2502.14558v1", "paper_url": "http://arxiv.org/abs/2502.14558v1", "repo": "null"}}