{"2409.18857": {"publish_time": "2024-09-27", "title": "Mitigating Selection Bias with Node Pruning and Auxiliary Options", "paper_summary": "Large language models (LLMs) often show unwarranted preference for certain\nchoice options when responding to multiple-choice questions, posing significant\nreliability concerns in LLM-automated systems. To mitigate this selection bias\nproblem, previous solutions utilized debiasing methods to adjust the model's\ninput and/or output. Our work, in contrast, investigates the model's internal\nrepresentation of the selection bias. Specifically, we introduce a novel\ndebiasing approach, Bias Node Pruning (BNP), which eliminates the linear layer\nparameters that contribute to the bias. Furthermore, we present Auxiliary\nOption Injection (AOI), a simple yet effective input modification technique for\ndebiasing, which is compatible even with black-box LLMs. To provide a more\nsystematic evaluation of selection bias, we review existing metrics and\nintroduce Choice Kullback-Leibler Divergence (CKLD), which addresses the\ninsensitivity of the commonly used metrics to label imbalance. Experiments show\nthat our methods are robust and adaptable across various datasets when applied\nto three LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 在回答多選題時，通常會對某些選項展現出不合理的偏好，對 LLM 自動化系統的可靠性造成重大的疑慮。為了減輕這種選擇偏差問題，先前的解決方案利用去偏方法調整模型的輸入和/或輸出。我們的研究則相反，探討模型對選擇偏差的內部表徵。具體來說，我們引入一種新穎的去偏方法，稱為偏差節點剪枝 (BNP)，它會消除導致偏差的線性層參數。此外，我們提出輔助選項注入 (AOI)，這是一種簡單卻有效的去偏輸入修改技術，即使是黑盒 LLM 也相容。為了提供更系統性的選擇偏差評估，我們檢視現有的指標並引入選擇 Kullback-Leibler 距離 (CKLD)，它解決了常用指標對標籤不平衡的遲鈍性。實驗顯示，當應用於三個 LLM 時，我們的模型強健且適用於各種資料集。", "author": "Hyeong Kyu Choi et.al.", "authors": "Hyeong Kyu Choi, Weijie Xu, Chi Xue, Stephanie Eckman, Chandan K. Reddy", "id": "2409.18857v1", "paper_url": "http://arxiv.org/abs/2409.18857v1", "repo": "null"}}