{"2410.03415": {"publish_time": "2024-10-04", "title": "Surgical, Cheap, and Flexible: Mitigating False Refusal in Language Models via Single Vector Ablation", "paper_summary": "Training a language model to be both helpful and harmless requires careful\ncalibration of refusal behaviours: Models should refuse to follow malicious\ninstructions or give harmful advice (e.g. \"how do I kill someone?\"), but they\nshould not refuse safe requests, even if they superficially resemble unsafe\nones (e.g. \"how do I kill a Python process?\"). Avoiding such false refusal, as\nprior work has shown, is challenging even for highly-capable language models.\nIn this paper, we propose a simple and surgical method for mitigating false\nrefusal in language models via single vector ablation. For a given model, we\nextract a false refusal vector and show that ablating this vector reduces false\nrefusal rate without negatively impacting model safety and general model\ncapabilities. We also show that our approach can be used for fine-grained\ncalibration of model safety. Our approach is training-free and model-agnostic,\nmaking it useful for mitigating the problem of false refusal in current and\nfuture language models.", "paper_summary_zh": "訓練語言模型既有幫助又無害，需要仔細校準拒絕行為：模型應拒絕遵循惡意指令或提供有害建議（例如「我如何殺死某人？」），但它們不應拒絕安全請求，即使它們表面上類似不安全的請求（例如「我如何終止 Python 程序？」）。避免這種錯誤拒絕，正如先前的工作所示，即使對於能力很強的語言模型來說也是具有挑戰性的。在本文中，我們提出了一種簡單且有力的方法，透過單一向量消融來減輕語言模型中的錯誤拒絕。對於給定的模型，我們提取一個錯誤拒絕向量，並顯示消除此向量會降低錯誤拒絕率，而不會對模型安全性與一般模型能力產生負面影響。我們也顯示我們的做法可用於模型安全性的細緻校準。我們的做法無需訓練且與模型無關，這使得它對於減輕當前和未來語言模型中錯誤拒絕的問題很有用。", "author": "Xinpeng Wang et.al.", "authors": "Xinpeng Wang, Chengzhi Hu, Paul Röttger, Barbara Plank", "id": "2410.03415v1", "paper_url": "http://arxiv.org/abs/2410.03415v1", "repo": "null"}}