{"2412.12094": {"publish_time": "2024-12-16", "title": "SepLLM: Accelerate Large Language Models by Compressing One Segment into One Separator", "paper_summary": "Large Language Models (LLMs) have exhibited exceptional performance across a\nspectrum of natural language processing tasks. However, their substantial sizes\npose considerable challenges, particularly in computational demands and\ninference speed, due to their quadratic complexity. In this work, we have\nidentified a key pattern: certain seemingly meaningless special tokens (i.e.,\nseparators) contribute disproportionately to attention scores compared to\nsemantically meaningful tokens. This observation suggests that information of\nthe segments between these separator tokens can be effectively condensed into\nthe separator tokens themselves without significant information loss. Guided by\nthis insight, we introduce SepLLM, a plug-and-play framework that accelerates\ninference by compressing these segments and eliminating redundant tokens.\nAdditionally, we implement efficient kernels for training acceleration.\nExperimental results across training-free, training-from-scratch, and\npost-training settings demonstrate SepLLM's effectiveness. Notably, using the\nLlama-3-8B backbone, SepLLM achieves over 50% reduction in KV cache on the\nGSM8K-CoT benchmark while maintaining comparable performance. Furthermore, in\nstreaming settings, SepLLM effectively processes sequences of up to 4 million\ntokens or more while maintaining consistent language modeling capabilities.", "paper_summary_zh": "大型語言模型 (LLM) 在各種自然語言處理任務中表現出色的效能。然而，它們龐大的規模帶來相當大的挑戰，特別是在運算需求和推理速度方面，因為它們的複雜度為二次方。在這項工作中，我們發現了一個關鍵模式：某些看似沒有意義的特殊符號（例如分隔符號）與語義有意義的符號相比，對注意力分數的貢獻不成比例。此觀察結果表明，這些分隔符號之間的區段資訊可以有效地壓縮到分隔符號本身，而不會造成顯著的資訊遺失。根據此見解，我們引入了 SepLLM，這是一個即插即用的架構，透過壓縮這些區段並消除重複的符號來加速推理。此外，我們實作了用於訓練加速的有效核心。跨越免訓練、從頭訓練和訓練後設定的實驗結果證明了 SepLLM 的效能。值得注意的是，使用 Llama-3-8B 主幹，SepLLM 在 GSM8K-CoT 基準測試中將 KV 快取減少了 50% 以上，同時維持了相當的效能。此外，在串流設定中，SepLLM 有效地處理多達 400 萬個符號或更多符號的序列，同時維持一致的語言建模能力。", "author": "Guoxuan Chen et.al.", "authors": "Guoxuan Chen, Han Shi, Jiawei Li, Yihang Gao, Xiaozhe Ren, Yimeng Chen, Xin Jiang, Zhenguo Li, Weiyang Liu, Chao Huang", "id": "2412.12094v1", "paper_url": "http://arxiv.org/abs/2412.12094v1", "repo": "null"}}