{"2406.12564": {"publish_time": "2024-06-18", "title": "Low-Resource Machine Translation through the Lens of Personalized Federated Learning", "paper_summary": "We present a new approach based on the Personalized Federated Learning\nalgorithm MeritFed that can be applied to Natural Language Tasks with\nheterogeneous data. We evaluate it on the Low-Resource Machine Translation\ntask, using the dataset from the Large-Scale Multilingual Machine Translation\nShared Task (Small Track #2) and the subset of Sami languages from the\nmultilingual benchmark for Finno-Ugric languages. In addition to its\neffectiveness, MeritFed is also highly interpretable, as it can be applied to\ntrack the impact of each language used for training. Our analysis reveals that\ntarget dataset size affects weight distribution across auxiliary languages,\nthat unrelated languages do not interfere with the training, and auxiliary\noptimizer parameters have minimal impact. Our approach is easy to apply with a\nfew lines of code, and we provide scripts for reproducing the experiments at\nhttps://github.com/VityaVitalich/MeritFed", "paper_summary_zh": "我們提出一個新的方法，基於個人化聯邦學習演算法 MeritFed，可應用於具有異質性資料的自然語言任務。我們在低資源機器翻譯任務上對其進行評估，使用來自大規模多語言機器翻譯共享任務（小軌道 2）的資料集和芬烏格爾語言多語言基準中的薩米語言子集。除了其有效性之外，MeritFed 的可解釋性也很高，因為它可用於追蹤用於訓練的每種語言的影響。我們的分析表明，目標資料集大小會影響輔助語言中的權重分佈，不相關的語言不會干擾訓練，而輔助優化器參數的影響很小。我們的做法很容易應用，只需幾行程式碼，我們提供了腳本，可在 https://github.com/VityaVitalich/MeritFed 上重現實驗。", "author": "Viktor Moskvoretskii et.al.", "authors": "Viktor Moskvoretskii, Nazarii Tupitsa, Chris Biemann, Samuel Horváth, Eduard Gorbunov, Irina Nikishina", "id": "2406.12564v1", "paper_url": "http://arxiv.org/abs/2406.12564v1", "repo": "https://github.com/vityavitalich/meritfed"}}