{"2405.06239": {"publish_time": "2024-05-10", "title": "SaudiBERT: A Large Language Model Pretrained on Saudi Dialect Corpora", "paper_summary": "In this paper, we introduce SaudiBERT, a monodialect Arabic language model\npretrained exclusively on Saudi dialectal text. To demonstrate the model's\neffectiveness, we compared SaudiBERT with six different multidialect Arabic\nlanguage models across 11 evaluation datasets, which are divided into two\ngroups: sentiment analysis and text classification. SaudiBERT achieved average\nF1-scores of 86.15\\% and 87.86\\% in these groups respectively, significantly\noutperforming all other comparative models. Additionally, we present two novel\nSaudi dialectal corpora: the Saudi Tweets Mega Corpus (STMC), which contains\nover 141 million tweets in Saudi dialect, and the Saudi Forums Corpus (SFC),\nwhich includes 15.2 GB of text collected from five Saudi online forums. Both\ncorpora are used in pretraining the proposed model, and they are the largest\nSaudi dialectal corpora ever reported in the literature. The results confirm\nthe effectiveness of SaudiBERT in understanding and analyzing Arabic text\nexpressed in Saudi dialect, achieving state-of-the-art results in most tasks\nand surpassing other language models included in the study. SaudiBERT model is\npublicly available on \\url{https://huggingface.co/faisalq/SaudiBERT}.", "paper_summary_zh": "<paragraph>在本文中，我們介紹 SaudiBERT，這是一個單方言阿拉伯語語言模型，並專門針對沙烏地方言文本進行預訓練。為了展示模型的有效性，我們將 SaudiBERT 與六個不同的多方言阿拉伯語語言模型進行比較，比較了 11 個評估資料集，這些資料集分為兩組：情緒分析和文本分類。在這些組別中，SaudiBERT 分別達到了 86.15% 和 87.86% 的平均 F1 分數，顯著優於所有其他比較模型。此外，我們還提出了兩個新穎的沙烏地方言語料庫：沙烏地推文巨量語料庫 (STMC)，其中包含超過 1.41 億條沙烏地方言推文，以及沙烏地論壇語料庫 (SFC)，其中包含從五個沙烏地線上論壇收集的 15.2 GB 文字。這兩個語料庫都用於預訓練所提出的模型，而且它們是有史以來在文獻中報告過最大的沙烏地方言語料庫。結果證實了 SaudiBERT 在理解和分析以沙烏地方言表達的阿拉伯語文本方面的有效性，在大部分任務中都達到了最先進的結果，並超越了研究中包含的其他語言模型。SaudiBERT 模型已公開發布於 \\url{https://huggingface.co/faisalq/SaudiBERT}。</paragraph>", "author": "Faisal Qarah et.al.", "authors": "Faisal Qarah", "id": "2405.06239v1", "paper_url": "http://arxiv.org/abs/2405.06239v1", "repo": "null"}}