{"2410.15912": {"publish_time": "2024-10-21", "title": "Bench4Merge: A Comprehensive Benchmark for Merging in Realistic Dense Traffic with Micro-Interactive Vehicles", "paper_summary": "While the capabilities of autonomous driving have advanced rapidly, merging\ninto dense traffic remains a significant challenge, many motion planning\nmethods for this scenario have been proposed but it is hard to evaluate them.\nMost existing closed-loop simulators rely on rule-based controls for other\nvehicles, which results in a lack of diversity and randomness, thus failing to\naccurately assess the motion planning capabilities in highly interactive\nscenarios. Moreover, traditional evaluation metrics are insufficient for\ncomprehensively evaluating the performance of merging in dense traffic. In\nresponse, we proposed a closed-loop evaluation benchmark for assessing motion\nplanning capabilities in merging scenarios. Our approach involves other\nvehicles trained in large scale datasets with micro-behavioral characteristics\nthat significantly enhance the complexity and diversity. Additionally, we have\nrestructured the evaluation mechanism by leveraging large language models to\nassess each autonomous vehicle merging onto the main road. Extensive\nexperiments have demonstrated the advanced nature of this evaluation benchmark.\nThrough this benchmark, we have obtained an evaluation of existing methods and\nidentified common issues. The environment and vehicle motion planning models we\nhave designed can be accessed at\nhttps://anonymous.4open.science/r/Bench4Merge-EB5D", "paper_summary_zh": "儘管自動駕駛的能力進展迅速，但融入密集的交通仍然是一項重大挑戰，針對此情境的許多運動規劃方法已被提出，但很難對它們進行評估。\n現有的封閉迴路模擬器大多依賴於其他車輛的基於規則的控制，這導致缺乏多樣性和隨機性，因此無法準確評估在高度互動情境中的運動規劃能力。\n此外，傳統的評估指標不足以全面評估在密集交通中合併的性能。\n作為回應，我們提出了一個封閉迴路評估基準，用於評估合併情境中的運動規劃能力。\n我們的做法涉及在具有微行為特徵的大規模數據集中訓練的其他車輛，這顯著提高了複雜性和多樣性。\n此外，我們通過利用大型語言模型重新調整了評估機制，以評估每個自主車輛併入主幹道。\n廣泛的實驗證明了這個評估基準的先進性。\n通過這個基準，我們獲得了對現有方法的評估，並找出常見的問題。\n我們設計的環境和車輛運動規劃模型可以在\nhttps://anonymous.4open.science/r/Bench4Merge-EB5D 獲得", "author": "Zhengming Wang et.al.", "authors": "Zhengming Wang, Junli Wang, Pengfei Li, Zhaohan Li, Peng Li, Yilun Chen", "id": "2410.15912v1", "paper_url": "http://arxiv.org/abs/2410.15912v1", "repo": "null"}}