{"2409.11404": {"publish_time": "2024-09-17", "title": "AraDiCE: Benchmarks for Dialectal and Cultural Capabilities in LLMs", "paper_summary": "Arabic, with its rich diversity of dialects, remains significantly\nunderrepresented in Large Language Models, particularly in dialectal\nvariations. We address this gap by introducing seven synthetic datasets in\ndialects alongside Modern Standard Arabic (MSA), created using Machine\nTranslation (MT) combined with human post-editing. We present AraDiCE, a\nbenchmark for Arabic Dialect and Cultural Evaluation. We evaluate LLMs on\ndialect comprehension and generation, focusing specifically on low-resource\nArabic dialects. Additionally, we introduce the first-ever fine-grained\nbenchmark designed to evaluate cultural awareness across the Gulf, Egypt, and\nLevant regions, providing a novel dimension to LLM evaluation. Our findings\ndemonstrate that while Arabic-specific models like Jais and AceGPT outperform\nmultilingual models on dialectal tasks, significant challenges persist in\ndialect identification, generation, and translation. This work contributes ~45K\npost-edited samples, a cultural benchmark, and highlights the importance of\ntailored training to improve LLM performance in capturing the nuances of\ndiverse Arabic dialects and cultural contexts. We will release the dialectal\ntranslation models and benchmarks curated in this study.", "paper_summary_zh": "阿拉伯語擁有豐富多樣的方言，在大型語言模型中仍然顯著不足，特別是在方言變體中。我們通過在方言中引入七個合成數據集以及現代標準阿拉伯語 (MSA) 來解決這個差距，這些數據集是使用機器翻譯 (MT) 結合人工後編輯創建的。我們展示了 AraDiCE，這是阿拉伯方言和文化評估的基準。我們評估了 LLM 對方言理解和生成的表現，特別關注資源較少的阿拉伯方言。此外，我們還引入了有史以來第一個細粒度基準，旨在評估海灣、埃及和黎凡特地區的文化意識，為 LLM 評估提供了新的維度。我們的研究結果表明，儘管像 Jais 和 AceGPT 這樣的阿拉伯語特定模型在方言任務上優於多語言模型，但在方言識別、生成和翻譯中仍然存在重大挑戰。這項工作貢獻了約 45K 個後編輯樣本、一個文化基準，並強調了定制訓練對於提高 LLM 在捕捉不同阿拉伯方言和文化背景的細微差別方面的性能的重要性。我們將發布本研究中策劃的方言翻譯模型和基準。", "author": "Basel Mousi et.al.", "authors": "Basel Mousi, Nadir Durrani, Fatema Ahmad, Md. Arid Hasan, Maram Hasanain, Tameem Kabbani, Fahim Dalvi, Shammur Absar Chowdhury, Firoj Alam", "id": "2409.11404v1", "paper_url": "http://arxiv.org/abs/2409.11404v1", "repo": "null"}}