{"2406.20053": {"publish_time": "2024-06-28", "title": "Covert Malicious Finetuning: Challenges in Safeguarding LLM Adaptation", "paper_summary": "Black-box finetuning is an emerging interface for adapting state-of-the-art\nlanguage models to user needs. However, such access may also let malicious\nactors undermine model safety. To demonstrate the challenge of defending\nfinetuning interfaces, we introduce covert malicious finetuning, a method to\ncompromise model safety via finetuning while evading detection. Our method\nconstructs a malicious dataset where every individual datapoint appears\ninnocuous, but finetuning on the dataset teaches the model to respond to\nencoded harmful requests with encoded harmful responses. Applied to GPT-4, our\nmethod produces a finetuned model that acts on harmful instructions 99% of the\ntime and avoids detection by defense mechanisms such as dataset inspection,\nsafety evaluations, and input/output classifiers. Our findings question whether\nblack-box finetuning access can be secured against sophisticated adversaries.", "paper_summary_zh": "黑盒微調是一個新興的介面，用於調整最先進的語言模型以符合使用者需求。然而，此類存取也可能讓惡意行為者破壞模型安全性。為了展示防禦微調介面的挑戰，我們引入了隱蔽惡意微調，這是一種透過微調危害模型安全性且同時規避偵測的方法。我們的做法建構了一個惡意資料集，其中每個個別資料點看起來無害，但針對資料集進行微調會教導模型以編碼的惡意回應來回應編碼的惡意要求。應用於 GPT-4，我們的做法產生一個微調模型，在 99% 的時間執行惡意指令，並透過資料集檢查、安全性評估和輸入/輸出分類器等防禦機制規避偵測。我們的研究結果質疑黑盒微調存取是否能對抗老練的對手。", "author": "Danny Halawi et.al.", "authors": "Danny Halawi, Alexander Wei, Eric Wallace, Tony T. Wang, Nika Haghtalab, Jacob Steinhardt", "id": "2406.20053v1", "paper_url": "http://arxiv.org/abs/2406.20053v1", "repo": "null"}}