{"2411.10323": {"publish_time": "2024-11-15", "title": "The Dawn of GUI Agent: A Preliminary Case Study with Claude 3.5 Computer Use", "paper_summary": "The recently released model, Claude 3.5 Computer Use, stands out as the first\nfrontier AI model to offer computer use in public beta as a graphical user\ninterface (GUI) agent. As an early beta, its capability in the real-world\ncomplex environment remains unknown. In this case study to explore Claude 3.5\nComputer Use, we curate and organize a collection of carefully designed tasks\nspanning a variety of domains and software. Observations from these cases\ndemonstrate Claude 3.5 Computer Use's unprecedented ability in end-to-end\nlanguage to desktop actions. Along with this study, we provide an\nout-of-the-box agent framework for deploying API-based GUI automation models\nwith easy implementation. Our case studies aim to showcase a groundwork of\ncapabilities and limitations of Claude 3.5 Computer Use with detailed analyses\nand bring to the fore questions about planning, action, and critic, which must\nbe considered for future improvement. We hope this preliminary exploration will\ninspire future research into the GUI agent community. All the test cases in the\npaper can be tried through the project:\nhttps://github.com/showlab/computer_use_ootb.", "paper_summary_zh": "最近發布的模型，Claude 3.5 電腦使用，作為第一個提供電腦使用於公開測試版，作為圖形使用者介面 (GUI) 代理的邊疆 AI 模型而脫穎而出。作為一個早期測試版，它在真實世界複雜環境中的能力仍然未知。在這個案例研究中，我們策劃並組織了一系列精心設計的任務，涵蓋各種領域和軟體，以探索 Claude 3.5 電腦使用。這些案例的觀察結果證明了 Claude 3.5 電腦使用在端對端語言到桌面動作中前所未有的能力。隨著這項研究，我們提供了一個開箱即用的代理架構，用於部署基於 API 的 GUI 自動化模型，並易於實作。我們的案例研究旨在展示 Claude 3.5 電腦使用能力和限制的基礎，並進行詳細分析，並提出關於規劃、行動和批評的問題，這些問題必須考慮在未來的改進中。我們希望這個初步探索能激勵未來對 GUI 代理社群的研究。本文中的所有測試案例都可以透過專案嘗試：\nhttps://github.com/showlab/computer_use_ootb。", "author": "Siyuan Hu et.al.", "authors": "Siyuan Hu, Mingyu Ouyang, Difei Gao, Mike Zheng Shou", "id": "2411.10323v1", "paper_url": "http://arxiv.org/abs/2411.10323v1", "repo": "https://github.com/showlab/computer_use_ootb"}}