{"2406.06027": {"publish_time": "2024-06-10", "title": "HOLMES: Hyper-Relational Knowledge Graphs for Multi-hop Question Answering using LLMs", "paper_summary": "Given unstructured text, Large Language Models (LLMs) are adept at answering\nsimple (single-hop) questions. However, as the complexity of the questions\nincrease, the performance of LLMs degrade. We believe this is due to the\noverhead associated with understanding the complex question followed by\nfiltering and aggregating unstructured information in the raw text. Recent\nmethods try to reduce this burden by integrating structured knowledge triples\ninto the raw text, aiming to provide a structured overview that simplifies\ninformation processing. However, this simplistic approach is query-agnostic and\nthe extracted facts are ambiguous as they lack context. To address these\ndrawbacks and to enable LLMs to answer complex (multi-hop) questions with ease,\nwe propose to use a knowledge graph (KG) that is context-aware and is distilled\nto contain query-relevant information. The use of our compressed distilled KG\nas input to the LLM results in our method utilizing up to $67\\%$ fewer tokens\nto represent the query relevant information present in the supporting\ndocuments, compared to the state-of-the-art (SoTA) method. Our experiments show\nconsistent improvements over the SoTA across several metrics (EM, F1,\nBERTScore, and Human Eval) on two popular benchmark datasets (HotpotQA and\nMuSiQue).", "paper_summary_zh": "給定非結構化文本，大型語言模型 (LLM) 擅長回答簡單（單跳）問題。然而，隨著問題的複雜性增加，LLM 的效能會下降。我們相信這是因為理解複雜問題所伴隨的開銷，接著在原始文本中過濾和彙總非結構化資訊。最近的方法嘗試透過將結構化知識三元組整合到原始文本中來減輕這個負擔，目的是提供一個簡化資訊處理的結構化概觀。然而，這種簡化的方式與查詢無關，而且提取的事實模稜兩可，因為它們缺乏背景。為了解決這些缺點，並使 LLM 能夠輕鬆回答複雜（多跳）問題，我們建議使用一個與背景相關且經過提煉以包含與查詢相關資訊的知識圖譜 (KG)。將我們壓縮提煉的 KG 用作 LLM 的輸入，使得我們的模型使用比最先進 (SoTA) 方法減少多達 $67\\%$ 的標記來表示支援文件中的與查詢相關的資訊。我們的實驗顯示，在兩個流行的基準資料集（HotpotQA 和 MuSiQue）上，我們的模型在多項指標（EM、F1、BERTScore 和人工評估）中都比 SoTA 有顯著的改善。", "author": "Pranoy Panda et.al.", "authors": "Pranoy Panda, Ankush Agarwal, Chaitanya Devaguptapu, Manohar Kaul, Prathosh A P", "id": "2406.06027v1", "paper_url": "http://arxiv.org/abs/2406.06027v1", "repo": "null"}}