{"2412.21036": {"publish_time": "2024-12-30", "title": "GePBench: Evaluating Fundamental Geometric Perception for Multimodal Large Language Models", "paper_summary": "Multimodal large language models (MLLMs) have achieved significant\nadvancements in integrating visual and linguistic understanding. While existing\nbenchmarks evaluate these models in context-rich, real-life scenarios, they\noften overlook fundamental perceptual skills essential for environments\ndeviating from everyday realism. In particular, geometric perception, the\nability to interpret spatial relationships and abstract visual patterns,\nremains underexplored. To address this limitation, we introduce GePBench, a\nnovel benchmark designed to assess the geometric perception capabilities of\nMLLMs. Results from extensive evaluations reveal that current state-of-the-art\nMLLMs exhibit significant deficiencies in such tasks. Additionally, we\ndemonstrate that models trained with data sourced from GePBench show notable\nimprovements on a wide range of downstream tasks, underscoring the importance\nof geometric perception as a foundation for advanced multimodal applications.\nOur code and datasets will be publicly available.", "paper_summary_zh": "多模态大型语言模型 (MMLM) 在整合视觉和语言理解方面取得了重大进展。虽然现有的基准在内容丰富、真实的场景中评估这些模型，但它们常常忽略了对偏离日常现实的环境至关重要的基本感知技能。特别是，几何感知，即解释空间关系和抽象视觉模式的能力，仍然没有得到充分的探索。为了解决这一限制，我们引入了 GePBench，这是一个新颖的基准，旨在评估 MMLM 的几何感知能力。广泛评估的结果表明，当前最先进的 MMLM 在此类任务中表现出明显的缺陷。此外，我们证明了使用从 GePBench 获得的数据训练的模型在广泛的下游任务中显示出显着的改进，这强调了几何感知作为高级多模态应用程序基础的重要性。我们的代码和数据集将公开提供。", "author": "Shangyu Xing et.al.", "authors": "Shangyu Xing, Changhao Xiang, Yuteng Han, Yifan Yue, Zhen Wu, Xinyu Liu, Zhangtai Wu, Fei Zhao, Xinyu Dai", "id": "2412.21036v1", "paper_url": "http://arxiv.org/abs/2412.21036v1", "repo": "null"}}