{"2412.17279": {"publish_time": "2024-12-23", "title": "Learning from Mistakes: Self-correct Adversarial Training for Chinese Unnatural Text Correction", "paper_summary": "Unnatural text correction aims to automatically detect and correct spelling\nerrors or adversarial perturbation errors in sentences. Existing methods\ntypically rely on fine-tuning or adversarial training to correct errors, which\nhave achieved significant success. However, these methods exhibit poor\ngeneralization performance due to the difference in data distribution between\ntraining data and real-world scenarios, known as the exposure bias problem. In\nthis paper, we propose a self-correct adversarial training framework for\n\\textbf{L}earn\\textbf{I}ng from \\textbf{MI}s\\textbf{T}akes (\\textbf{LIMIT}),\nwhich is a task- and model-independent framework to correct unnatural errors or\nmistakes. Specifically, we fully utilize errors generated by the model that are\nactively exposed during the inference phase, i.e., predictions that are\ninconsistent with the target. This training method not only simulates potential\nerrors in real application scenarios, but also mitigates the exposure bias of\nthe traditional training process. Meanwhile, we design a novel decoding\nintervention strategy to maintain semantic consistency. Extensive experimental\nresults on Chinese unnatural text error correction datasets show that our\nproposed method can correct multiple forms of errors and outperforms the\nstate-of-the-art text correction methods. In addition, extensive results on\nChinese and English datasets validate that LIMIT can serve as a plug-and-play\ndefense module and can extend to new models and datasets without further\ntraining.", "paper_summary_zh": "非自然文本修正旨在自動偵測並修正句子中的拼寫錯誤或對抗性擾動錯誤。現有方法通常依賴微調或對抗性訓練來修正錯誤，這已取得重大成功。然而，由於訓練資料與真實世界場景之間的資料分佈差異，這些方法展現出差勁的泛化效能，這稱為曝光偏差問題。在本文中，我們提出一個用於從錯誤中學習的自修正對抗性訓練架構（LIMIT），這是一個與任務和模型無關的架構，用於修正非自然錯誤或失誤。具體來說，我們充分利用模型在推論階段主動暴露的錯誤，也就是與目標不一致的預測。這種訓練方法不僅模擬真實應用場景中的潛在錯誤，還減輕傳統訓練流程的曝光偏差。同時，我們設計一種新穎的解碼介入策略來維持語義一致性。在中文非自然文本錯誤修正資料集上的廣泛實驗結果顯示，我們提出的方法可以修正多種形式的錯誤，並且優於最先進的文本修正方法。此外，在中文和英文資料集上的廣泛結果驗證了 LIMIT 可以作為即插即用防禦模組，並且可以在不進一步訓練的情況下擴展到新的模型和資料集。", "author": "Xuan Feng et.al.", "authors": "Xuan Feng, Tianlong Gu, Xiaoli Liu, Liang Chang", "id": "2412.17279v1", "paper_url": "http://arxiv.org/abs/2412.17279v1", "repo": "null"}}