{"2412.04235": {"publish_time": "2024-12-05", "title": "Addressing Hallucinations with RAG and NMISS in Italian Healthcare LLM Chatbots", "paper_summary": "I combine detection and mitigation techniques to addresses hallucinations in\nLarge Language Models (LLMs). Mitigation is achieved in a question-answering\nRetrieval-Augmented Generation (RAG) framework while detection is obtained by\nintroducing the Negative Missing Information Scoring System (NMISS), which\naccounts for contextual relevance in responses. While RAG mitigates\nhallucinations by grounding answers in external data, NMISS refines the\nevaluation by identifying cases where traditional metrics incorrectly flag\ncontextually accurate responses as hallucinations. I use Italian health news\narticles as context to evaluate LLM performance. Results show that Gemma2 and\nGPT-4 outperform the other models, with GPT-4 producing answers closely aligned\nwith reference responses. Mid-tier models, such as Llama2, Llama3, and Mistral\nbenefit significantly from NMISS, highlighting their ability to provide richer\ncontextual information. This combined approach offers new insights into the\nreduction and more accurate assessment of hallucinations in LLMs, with\napplications in real-world healthcare tasks and other domains.", "paper_summary_zh": "我結合偵測和緩解技術來處理大型語言模型 (LLM) 中的幻覺。緩解是在問答檢索擴增生成 (RAG) 架構中實現的，而偵測則是透過導入負向遺失資訊評分系統 (NMISS) 獲得，該系統考量回應中的脈絡相關性。RAG 透過將答案建立在外部資料中來緩解幻覺，而 NMISS 則透過找出傳統指標錯誤地將脈絡上正確的回應標示為幻覺的情況來改善評估。我使用義大利健康新聞文章作為脈絡來評估 LLM 表現。結果顯示 Gemma2 和 GPT-4 優於其他模型，其中 GPT-4 產生的答案與參考回應最為接近。中階模型，例如 Llama2、Llama3 和 Mistral 從 NMISS 中受益匪淺，突顯出它們提供更豐富脈絡資訊的能力。這種結合方法提供了對 LLM 中幻覺的減少和更準確評估的新見解，並應用於真實世界的醫療保健任務和其他領域。", "author": "Maria Paola Priola et.al.", "authors": "Maria Paola Priola", "id": "2412.04235v1", "paper_url": "http://arxiv.org/abs/2412.04235v1", "repo": "null"}}