{"2412.09385": {"publish_time": "2024-12-12", "title": "AI Predicts AGI: Leveraging AGI Forecasting and Peer Review to Explore LLMs' Complex Reasoning Capabilities", "paper_summary": "We tasked 16 state-of-the-art large language models (LLMs) with estimating\nthe likelihood of Artificial General Intelligence (AGI) emerging by 2030. To\nassess the quality of these forecasts, we implemented an automated peer review\nprocess (LLM-PR). The LLMs' estimates varied widely, ranging from 3% (Reka-\nCore) to 47.6% (GPT-4o), with a median of 12.5%. These estimates closely align\nwith a recent expert survey that projected a 10% likelihood of AGI by 2027,\nunderscoring the relevance of LLMs in forecasting complex, speculative\nscenarios. The LLM-PR process demonstrated strong reliability, evidenced by a\nhigh Intraclass Correlation Coefficient (ICC = 0.79), reflecting notable\nconsistency in scoring across the models. Among the models, Pplx-70b-online\nemerged as the top performer, while Gemini-1.5-pro-api ranked the lowest. A\ncross-comparison with external benchmarks, such as LMSYS Chatbot Arena,\nrevealed that LLM rankings remained consistent across different evaluation\nmethods, suggesting that existing benchmarks may not encapsulate some of the\nskills relevant for AGI prediction. We further explored the use of weighting\nschemes based on external benchmarks, optimizing the alignment of LLMs'\npredictions with human expert forecasts. This analysis led to the development\nof a new, 'AGI benchmark' designed to highlight performance differences in\nAGI-related tasks. Our findings offer insights into LLMs' capabilities in\nspeculative, interdisciplinary forecasting tasks and emphasize the growing need\nfor innovative evaluation frameworks for assessing AI performance in complex,\nuncertain real-world scenarios.", "paper_summary_zh": "<paragraph>我們委託 16 個最先進的大型語言模型 (LLM) 估計人工通用智慧 (AGI) 在 2030 年出現的可能性。為了評估這些預測的品質，我們實施了一項自動化的同儕審查流程 (LLM-PR)。LLM 的估計差異很大，從 3% (Reka-Core) 到 47.6% (GPT-4o) 不等，中位數為 12.5%。這些估計與最近專家調查密切一致，該調查預測 AGI 在 2027 年出現的可能性為 10%，這強調了 LLM 在預測複雜、推測性場景中的相關性。LLM-PR 流程表現出很強的可靠性，這由高類內相關係數 (ICC = 0.79) 證明，反映出模型之間評分的顯著一致性。在這些模型中，Pplx-70b-online 成為表現最佳者，而 Gemini-1.5-pro-api 排名最低。與外部基準（例如 LMSYS Chatbot Arena）的交叉比較顯示，LLM 排名在不同的評估方法中保持一致，這表明現有的基準可能無法概括與 AGI 預測相關的一些技能。我們進一步探討了基於外部基準的加權方案的使用，優化了 LLM 預測與人類專家預測的一致性。此分析導致開發了一個新的「AGI 基準」，旨在強調 AGI 相關任務中的效能差異。我們的研究結果提供了對 LLM 在推測性、跨學科預測任務中的能力的見解，並強調了在複雜、不確定的現實世界場景中評估 AI 效能時，對創新評估框架日益增長的需求。</paragraph>", "author": "Fabrizio Davide et.al.", "authors": "Fabrizio Davide, Pietro Torre, Andrea Gaggioli", "id": "2412.09385v1", "paper_url": "http://arxiv.org/abs/2412.09385v1", "repo": "null"}}