{"2407.18722": {"publish_time": "2024-07-26", "title": "Neurosymbolic AI for Enhancing Instructability in Generative AI", "paper_summary": "Generative AI, especially via Large Language Models (LLMs), has transformed\ncontent creation across text, images, and music, showcasing capabilities in\nfollowing instructions through prompting, largely facilitated by instruction\ntuning. Instruction tuning is a supervised fine-tuning method where LLMs are\ntrained on datasets formatted with specific tasks and corresponding\ninstructions. This method systematically enhances the model's ability to\ncomprehend and execute the provided directives. Despite these advancements,\nLLMs still face challenges in consistently interpreting complex, multi-step\ninstructions and generalizing them to novel tasks, which are essential for\nbroader applicability in real-world scenarios. This article explores why\nneurosymbolic AI offers a better path to enhance the instructability of LLMs.\nWe explore the use a symbolic task planner to decompose high-level instructions\ninto structured tasks, a neural semantic parser to ground these tasks into\nexecutable actions, and a neuro-symbolic executor to implement these actions\nwhile dynamically maintaining an explicit representation of state. We also seek\nto show that neurosymbolic approach enhances the reliability and\ncontext-awareness of task execution, enabling LLMs to dynamically interpret and\nrespond to a wider range of instructional contexts with greater precision and\nflexibility.", "paper_summary_zh": "生成式 AI，特别是通过大型语言模型 (LLM)，已将内容创作转化为文本、图像和音乐，展示了通过提示遵循指令的能力，在很大程度上由指令微调促成。指令微调是一种监督微调方法，其中 LLM 在具有特定任务格式和相应指令的数据集上进行训练。此方法系统地增强了模型理解和执行所提供指令的能力。尽管有这些进步，LLM 在一致地解释复杂的多步骤指令和将其概括为新任务方面仍然面临挑战，这对于在现实世界场景中更广泛的适用性至关重要。本文探讨了神经符号 AI 为什么为增强 LLM 的可指导性提供了更好的途径。我们探索使用符号任务规划器将高级指令分解为结构化任务，使用神经语义解析器将这些任务基础化为可执行动作，以及使用神经符号执行器在动态维护状态的显式表示的同时实施这些动作。我们还试图表明神经符号方法增强了任务执行的可靠性和上下文感知，使 LLM 能够以更高的精度和灵活性动态解释和响应更广泛的指令性上下文。", "author": "Amit Sheth et.al.", "authors": "Amit Sheth, Vishal Pallagani, Kaushik Roy", "id": "2407.18722v1", "paper_url": "http://arxiv.org/abs/2407.18722v1", "repo": "null"}}