{"2410.21012": {"publish_time": "2024-10-28", "title": "FACT: Examining the Effectiveness of Iterative Context Rewriting for Multi-fact Retrieval", "paper_summary": "Large Language Models (LLMs) are proficient at retrieving single facts from\nextended contexts, yet they struggle with tasks requiring the simultaneous\nretrieval of multiple facts, especially during generation. This paper\nidentifies a novel \"lost-in-the-middle\" phenomenon, where LLMs progressively\nlose track of critical information throughout the generation process, resulting\nin incomplete or inaccurate retrieval. To address this challenge, we introduce\nFind All Crucial Texts (FACT), an iterative retrieval method that refines\ncontext through successive rounds of rewriting. This approach enables models to\ncapture essential facts incrementally, which are often overlooked in\nsingle-pass retrieval. Experiments demonstrate that FACT substantially enhances\nmulti-fact retrieval performance across various tasks, though improvements are\nless notable in general-purpose QA scenarios. Our findings shed light on the\nlimitations of LLMs in multi-fact retrieval and underscore the need for more\nresilient long-context retrieval strategies.", "paper_summary_zh": "大型語言模型 (LLM) 擅長從延伸的脈絡中擷取單一事實，但它們在需要同時擷取多個事實的任務中會遇到困難，特別是在生成過程中。此論文指出了一個新穎的「迷失在中間」現象，其中 LLM 在整個生成過程中逐漸失去對關鍵資訊的追蹤，導致擷取不完整或不準確。為了應對這個挑戰，我們引入了「找出所有關鍵文本」(FACT)，一種透過連續多輪改寫來改善脈絡的疊代式擷取方法。此方法讓模型能夠逐步擷取必要的關鍵事實，這些事實通常會在單次擷取中被忽略。實驗證明，FACT 大幅提升了各種任務中的多重事實擷取效能，儘管在一般用途的問答場景中，改進幅度較不顯著。我們的發現闡明了 LLM 在多重事實擷取中的限制，並強調需要更具韌性的長脈絡擷取策略。", "author": "Jinlin Wang et.al.", "authors": "Jinlin Wang, Suyuchen Wang, Ziwen Xia, Sirui Hong, Yun Zhu, Bang Liu, Chenglin Wu", "id": "2410.21012v1", "paper_url": "http://arxiv.org/abs/2410.21012v1", "repo": "null"}}