{"2411.10534": {"publish_time": "2024-11-15", "title": "Chain of Alignment: Integrating Public Will with Expert Intelligence for Language Model Alignment", "paper_summary": "We introduce a method to measure the alignment between public will and\nlanguage model (LM) behavior that can be applied to fine-tuning, online\noversight, and pre-release safety checks. Our `chain of alignment' (CoA)\napproach produces a rule based reward (RBR) by creating model behavior\n$\\textit{rules}$ aligned to normative $\\textit{objectives}$ aligned to\n$\\textit{public will}$. This factoring enables a nonexpert public to directly\nspecify their will through the normative objectives, while expert intelligence\nis used to figure out rules entailing model behavior that best achieves those\nobjectives. We validate our approach by applying it across three different\ndomains of LM prompts related to mental health. We demonstrate a public input\nprocess built on collective dialogues and bridging-based ranking that reliably\nproduces normative objectives supported by at least $96\\% \\pm 2\\%$ of the US\npublic. We then show that rules developed by mental health experts to achieve\nthose objectives enable a RBR that evaluates an LM response's alignment with\nthe objectives similarly to human experts (Pearson's $r=0.841$, $AUC=0.964$).\nBy measuring alignment with objectives that have near unanimous public support,\nthese CoA RBRs provide an approximate measure of alignment between LM behavior\nand public will.", "paper_summary_zh": "<paragraph>我們提出了一種方法來衡量公眾意願與語言模型 (LM) 行為之間的一致性，這種方法可以應用於微調、線上監督和預發佈安全檢查。我們的「一致性鏈」(CoA) 方法透過建立模型行為 $\\textit{規則}$，使其與規範性 $\\textit{目標}$ 保持一致，進而與 $\\textit{公眾意願}$ 保持一致，從而產生基於規則的獎勵 (RBR)。這種分解使非專家公眾能夠透過規範性目標直接表達他們的意願，而專家智慧則用於找出蘊含模型行為的規則，這些規則最能實現這些目標。我們透過將方法應用在與心理健康相關的 LM 提示的三個不同領域來驗證我們的做法。我們展示了一個建立在集體對話和基於橋接的排名上的公眾意見輸入流程，該流程可靠地產生至少有 $96\\% \\pm 2\\%$ 的美國公眾支持的規範性目標。然後我們展示由心理健康專家制定以實現這些目標的規則，使 RBR 能夠評估 LM 回應與目標的一致性，其方式與人類專家類似（Pearson's $r=0.841$，$AUC=0.964$）。透過衡量與獲得近乎一致公眾支持的目標的一致性，這些 CoA RBR 提供了 LM 行為與公眾意願之間一致性的近似衡量標準。</paragraph>", "author": "Andrew Konya et.al.", "authors": "Andrew Konya, Aviv Ovadya, Kevin Feng, Quan Ze Chen, Lisa Schirch, Colin Irwin, Amy X. Zhang", "id": "2411.10534v1", "paper_url": "http://arxiv.org/abs/2411.10534v1", "repo": "null"}}