{"2411.19799": {"publish_time": "2024-11-29", "title": "INCLUDE: Evaluating Multilingual Language Understanding with Regional Knowledge", "paper_summary": "The performance differential of large language models (LLM) between languages\nhinders their effective deployment in many regions, inhibiting the potential\neconomic and societal value of generative AI tools in many communities.\nHowever, the development of functional LLMs in many languages (\\ie,\nmultilingual LLMs) is bottlenecked by the lack of high-quality evaluation\nresources in languages other than English. Moreover, current practices in\nmultilingual benchmark construction often translate English resources, ignoring\nthe regional and cultural knowledge of the environments in which multilingual\nsystems would be used. In this work, we construct an evaluation suite of\n197,243 QA pairs from local exam sources to measure the capabilities of\nmultilingual LLMs in a variety of regional contexts. Our novel resource,\nINCLUDE, is a comprehensive knowledge- and reasoning-centric benchmark across\n44 written languages that evaluates multilingual LLMs for performance in the\nactual language environments where they would be deployed.", "paper_summary_zh": "大型語言模型 (LLM) 在不同語言之間的效能差異，阻礙了它們在許多地區的有效部署，抑制了生成式 AI 工具在許多社群中潛在的經濟和社會價值。然而，多語言 LLM 的發展受到缺乏英語以外語言的高品質評估資源的瓶頸。此外，多語言基準建構的現行做法通常是翻譯英語資源，忽略了多語言系統將被使用的環境中的區域和文化知識。在這項工作中，我們從地方考試來源建構了一個包含 197,243 個問答對的評估套件，以衡量多語言 LLM 在各種區域脈絡中的能力。我們的創新資源 INCLUDE 是一個跨越 44 種書面語言的綜合知識和推理為中心的基準，用於評估多語言 LLM 在實際部署語言環境中的效能。", "author": "Angelika Romanou et.al.", "authors": "Angelika Romanou, Negar Foroutan, Anna Sotnikova, Zeming Chen, Sree Harsha Nelaturu, Shivalika Singh, Rishabh Maheshwary, Micol Altomare, Mohamed A. Haggag, Snegha A, Alfonso Amayuelas, Azril Hafizi Amirudin, Viraat Aryabumi, Danylo Boiko, Michael Chang, Jenny Chim, Gal Cohen, Aditya Kumar Dalmia, Abraham Diress, Sharad Duwal, Daniil Dzenhaliou, Daniel Fernando Erazo Florez, Fabian Farestam, Joseph Marvin Imperial, Shayekh Bin Islam, Perttu Isotalo, Maral Jabbarishiviari, Börje F. Karlsson, Eldar Khalilov, Christopher Klamm, Fajri Koto, Dominik Krzemiński, Gabriel Adriano de Melo, Syrielle Montariol, Yiyang Nan, Joel Niklaus, Jekaterina Novikova, Johan Samir Obando Ceron, Debjit Paul, Esther Ploeger, Jebish Purbey, Swati Rajwal, Selvan Sunitha Ravi, Sara Rydell, Roshan Santhosh, Drishti Sharma, Marjana Prifti Skenduli, Arshia Soltani Moakhar, Bardia Soltani Moakhar, Ran Tamir, Ayush Kumar Tarun, Azmine Toushik Wasi, Thenuka Ovin Weerasinghe, Serhan Yilmaz, Mike Zhang, Imanol Schlag, Marzieh Fadaee, Sara Hooker, Antoine Bosselut", "id": "2411.19799v1", "paper_url": "http://arxiv.org/abs/2411.19799v1", "repo": "null"}}