{"2410.20735": {"publish_time": "2024-10-28", "title": "Murine AI excels at cats and cheese: Structural differences between human and mouse neurons and their implementation in generative AIs", "paper_summary": "Mouse and human brains have different functions that depend on their neuronal\nnetworks. In this study, we analyzed nanometer-scale three-dimensional\nstructures of brain tissues of the mouse medial prefrontal cortex and compared\nthem with structures of the human anterior cingulate cortex. The obtained\nresults indicated that mouse neuronal somata are smaller and neurites are\nthinner than those of human neurons. These structural features allow mouse\nneurons to be integrated in the limited space of the brain, though thin\nneurites should suppress distal connections according to cable theory. We\nimplemented this mouse-mimetic constraint in convolutional layers of a\ngenerative adversarial network (GAN) and a denoising diffusion implicit model\n(DDIM), which were then subjected to image generation tasks using photo\ndatasets of cat faces, cheese, human faces, and birds. The mouse-mimetic GAN\noutperformed a standard GAN in the image generation task using the cat faces\nand cheese photo datasets, but underperformed for human faces and birds. The\nmouse-mimetic DDIM gave similar results, suggesting that the nature of the\ndatasets affected the results. Analyses of the four datasets indicated\ndifferences in their image entropy, which should influence the number of\nparameters required for image generation. The preferences of the mouse-mimetic\nAIs coincided with the impressions commonly associated with mice. The\nrelationship between the neuronal network and brain function should be\ninvestigated by implementing other biological findings in artificial neural\nnetworks.", "paper_summary_zh": "小鼠和人類的大腦具有不同的功能，這取決於它們的神經元網路。在這個研究中，我們分析了小鼠內側前額葉皮質的腦組織奈米等級的三維結構，並將其與人類前扣帶皮質的結構進行比較。所得結果表明，小鼠神經元胞體較小，神經突較細，而人類神經元則較大較粗。這些結構特徵允許小鼠神經元整合在大腦的有限空間中，儘管根據電纜理論，細小的神經突應抑制遠端連接。我們在生成對抗網路 (GAN) 和去噪擴散隱式模型 (DDIM) 的卷積層中實作了這種小鼠模擬約束，然後使用貓臉、起司、人臉和鳥類的照片資料集對其進行影像生成任務。在使用貓臉和起司照片資料集的影像生成任務中，小鼠模擬 GAN 的表現優於標準 GAN，但在人臉和鳥類的表現則較差。小鼠模擬 DDIM 給出了類似的結果，這表明資料集的性質影響了結果。對這四個資料集的分析表明，它們的影像熵不同，這應會影響影像生成所需的參數數量。小鼠模擬 AI 的偏好與一般與小鼠相關的印象一致。神經元網路和腦功能之間的關係應透過在人工神經網路中實作其他生物學發現來加以探討。", "author": "Rino Saiga et.al.", "authors": "Rino Saiga, Kaede Shiga, Yo Maruta, Chie Inomoto, Hiroshi Kajiwara, Naoya Nakamura, Yu Kakimoto, Yoshiro Yamamoto, Masahiro Yasutake, Masayuki Uesugi, Akihisa Takeuchi, Kentaro Uesugi, Yasuko Terada, Yoshio Suzuki, Viktor Nikitin, Vincent De Andrade, Francesco De Carlo, Yuichi Yamashita, Masanari Itokawa, Soichiro Ide, Kazutaka Ikeda, Ryuta Mizutani", "id": "2410.20735v1", "paper_url": "http://arxiv.org/abs/2410.20735v1", "repo": "null"}}