{"2412.05208": {"publish_time": "2024-12-06", "title": "A Survey of Large Language Model-Based Generative AI for Text-to-SQL: Benchmarks, Applications, Use Cases, and Challenges", "paper_summary": "Text-to-SQL systems facilitate smooth interaction with databases by\ntranslating natural language queries into Structured Query Language (SQL),\nbridging the gap between non-technical users and complex database management\nsystems. This survey provides a comprehensive overview of the evolution of\nAI-driven text-to-SQL systems, highlighting their foundational components,\nadvancements in large language model (LLM) architectures, and the critical role\nof datasets such as Spider, WikiSQL, and CoSQL in driving progress. We examine\nthe applications of text-to-SQL in domains like healthcare, education, and\nfinance, emphasizing their transformative potential for improving data\naccessibility. Additionally, we analyze persistent challenges, including domain\ngeneralization, query optimization, support for multi-turn conversational\ninteractions, and the limited availability of datasets tailored for NoSQL\ndatabases and dynamic real-world scenarios. To address these challenges, we\noutline future research directions, such as extending text-to-SQL capabilities\nto support NoSQL databases, designing datasets for dynamic multi-turn\ninteractions, and optimizing systems for real-world scalability and robustness.\nBy surveying current advancements and identifying key gaps, this paper aims to\nguide the next generation of research and applications in LLM-based text-to-SQL\nsystems.", "paper_summary_zh": "文本转 SQL 系统通过将自然语言查询转换为结构化查询语言 (SQL) 来促进与数据库的顺畅交互，弥合非技术用户与复杂数据库管理系统之间的差距。本调查全面概述了 AI 驱动的文本转 SQL 系统的演变，重点介绍了其基础组件、大语言模型 (LLM) 架构的进步以及 Spider、WikiSQL 和 CoSQL 等数据集在推动进步中的关键作用。我们研究了文本转 SQL 在医疗保健、教育和金融等领域的应用，强调了它们在提高数据可访问性方面的变革潜力。此外，我们分析了持续存在的挑战，包括领域泛化、查询优化、对多轮对话交互的支持以及针对 NoSQL 数据库和动态真实世界场景定制的数据集的可用性有限。为了应对这些挑战，我们概述了未来的研究方向，例如扩展文本转 SQL 功能以支持 NoSQL 数据库、为动态多轮交互设计数据集以及优化系统以实现实际世界的可扩展性和鲁棒性。通过调查当前的进步并找出关键差距，本文旨在指导基于 LLM 的文本转 SQL 系统的下一代研究和应用。", "author": "Aditi Singh et.al.", "authors": "Aditi Singh, Akash Shetty, Abul Ehtesham, Saket Kumar, Tala Talaei Khoei", "id": "2412.05208v1", "paper_url": "http://arxiv.org/abs/2412.05208v1", "repo": "null"}}