{"2405.08297": {"publish_time": "2024-05-14", "title": "Distance-Restricted Explanations: Theoretical Underpinnings & Efficient Implementation", "paper_summary": "The uses of machine learning (ML) have snowballed in recent years. In many\ncases, ML models are highly complex, and their operation is beyond the\nunderstanding of human decision-makers. Nevertheless, some uses of ML models\ninvolve high-stakes and safety-critical applications. Explainable artificial\nintelligence (XAI) aims to help human decision-makers in understanding the\noperation of such complex ML models, thus eliciting trust in their operation.\nUnfortunately, the majority of past XAI work is based on informal approaches,\nthat offer no guarantees of rigor. Unsurprisingly, there exists comprehensive\nexperimental and theoretical evidence confirming that informal methods of XAI\ncan provide human-decision makers with erroneous information. Logic-based XAI\nrepresents a rigorous approach to explainability; it is model-based and offers\nthe strongest guarantees of rigor of computed explanations. However, a\nwell-known drawback of logic-based XAI is the complexity of logic reasoning,\nespecially for highly complex ML models. Recent work proposed\ndistance-restricted explanations, i.e. explanations that are rigorous provided\nthe distance to a given input is small enough. Distance-restricted\nexplainability is tightly related with adversarial robustness, and it has been\nshown to scale for moderately complex ML models, but the number of inputs still\nrepresents a key limiting factor. This paper investigates novel algorithms for\nscaling up the performance of logic-based explainers when computing and\nenumerating ML model explanations with a large number of inputs.", "paper_summary_zh": "機器學習 (ML) 的用途在近年來如滾雪球般擴大。在許多情況下，ML 模型非常複雜，而其運作超乎人類決策者的理解範圍。儘管如此，ML 模型的某些用途涉及高風險和安全關鍵的應用。可解釋人工智慧 (XAI) 旨在幫助人類決策者了解此類複雜 ML 模型的運作，進而引發對其運作的信任。不幸的是，過去大部分的 XAI 工作都基於非正式方法，無法保證嚴謹性。毫不意外地，有全面的實驗和理論證據證實，非正式的 XAI 方法可能會為人類決策者提供錯誤的資訊。基於邏輯的 XAI 代表一種嚴謹的可解釋性方法；它是基於模型的，並提供經由計算得出的解釋的最強有力的嚴謹性保證。然而，基於邏輯的 XAI 一個眾所周知的缺點是邏輯推理的複雜性，特別是對於高度複雜的 ML 模型。最近的研究提出了距離受限的解釋，即只要與給定輸入的距離夠小，就是嚴謹的解釋。距離受限的可解釋性與對抗魯棒性密切相關，並且已被證明可以擴展到中等複雜度的 ML 模型，但輸入數量仍然是一個關鍵的限制因素。本文探討了在計算和列舉具有大量輸入的 ML 模型解釋時，用於擴展基於邏輯的解釋器的效能的新演算法。", "author": "Yacine Izza et.al.", "authors": "Yacine Izza, Xuanxiang Huang, Antonio Morgado, Jordi Planes, Alexey Ignatiev, Joao Marques-Silva", "id": "2405.08297v1", "paper_url": "http://arxiv.org/abs/2405.08297v1", "repo": "null"}}