{"2410.06614": {"publish_time": "2024-10-09", "title": "Pair-VPR: Place-Aware Pre-training and Contrastive Pair Classification for Visual Place Recognition with Vision Transformers", "paper_summary": "In this work we propose a novel joint training method for Visual Place\nRecognition (VPR), which simultaneously learns a global descriptor and a pair\nclassifier for re-ranking. The pair classifier can predict whether a given pair\nof images are from the same place or not. The network only comprises Vision\nTransformer components for both the encoder and the pair classifier, and both\ncomponents are trained using their respective class tokens. In existing VPR\nmethods, typically the network is initialized using pre-trained weights from a\ngeneric image dataset such as ImageNet. In this work we propose an alternative\npre-training strategy, by using Siamese Masked Image Modelling as a\npre-training task. We propose a Place-aware image sampling procedure from a\ncollection of large VPR datasets for pre-training our model, to learn visual\nfeatures tuned specifically for VPR. By re-using the Mask Image Modelling\nencoder and decoder weights in the second stage of training, Pair-VPR can\nachieve state-of-the-art VPR performance across five benchmark datasets with a\nViT-B encoder, along with further improvements in localization recall with\nlarger encoders. The Pair-VPR website is:\nhttps://csiro-robotics.github.io/Pair-VPR.", "paper_summary_zh": "在這項工作中，我們提出了一種新的視覺場景識別 (VPR) 聯合訓練方法，它同時學習一個全局描述符和一個用於重新排序的配對分類器。配對分類器可以預測給定的一對影像是否來自同一個場景。網路只包含用於編碼器和配對分類器的視覺轉換器組件，並且兩個組件都使用它們各自的類別代碼進行訓練。在現有的 VPR 方法中，網路通常使用來自通用影像資料集（例如 ImageNet）的預先訓練權重進行初始化。在這項工作中，我們提出了一種替代性的預先訓練策略，使用連體遮罩影像建模作為預先訓練任務。我們提出了一個來自大型 VPR 資料集集合的場景感知影像取樣程序，用於預先訓練我們的模型，以學習專門針對 VPR 調整的視覺特徵。通過在訓練的第二階段重新使用遮罩影像建模編碼器和解碼器權重，Pair-VPR 可以使用 ViT-B 編碼器在五個基準資料集上實現最先進的 VPR 效能，同時隨著編碼器變大，定位召回率進一步提高。Pair-VPR 網站為：\nhttps://csiro-robotics.github.io/Pair-VPR。", "author": "Stephen Hausler et.al.", "authors": "Stephen Hausler, Peyman Moghadam", "id": "2410.06614v1", "paper_url": "http://arxiv.org/abs/2410.06614v1", "repo": "null"}}