{"2501.04142": {"publish_time": "2025-01-07", "title": "BiasGuard: Guardrailing Fairness in Machine Learning Production Systems", "paper_summary": "As machine learning (ML) systems increasingly impact critical sectors such as\nhiring, financial risk assessments, and criminal justice, the imperative to\nensure fairness has intensified due to potential negative implications. While\nmuch ML fairness research has focused on enhancing training data and processes,\naddressing the outputs of already deployed systems has received less attention.\nThis paper introduces 'BiasGuard', a novel approach designed to act as a\nfairness guardrail in production ML systems. BiasGuard leverages Test-Time\nAugmentation (TTA) powered by Conditional Generative Adversarial Network\n(CTGAN), a cutting-edge generative AI model, to synthesize data samples\nconditioned on inverted protected attribute values, thereby promoting equitable\noutcomes across diverse groups. This method aims to provide equal opportunities\nfor both privileged and unprivileged groups while significantly enhancing the\nfairness metrics of deployed systems without the need for retraining. Our\ncomprehensive experimental analysis across diverse datasets reveals that\nBiasGuard enhances fairness by 31% while only reducing accuracy by 0.09%\ncompared to non-mitigated benchmarks. Additionally, BiasGuard outperforms\nexisting post-processing methods in improving fairness, positioning it as an\neffective tool to safeguard against biases when retraining the model is\nimpractical.", "paper_summary_zh": "隨著機器學習 (ML) 系統日益影響招聘、財務風險評估和刑事司法等關鍵部門，由於潛在的負面影響，確保公平性的必要性也隨之加劇。雖然許多 ML 公平性研究都專注於加強訓練資料和流程，但對於已部署系統的輸出，則較少受到關注。本文介紹「BiasGuard」，這是一種新穎的方法，旨在作為生產 ML 系統中的公平性防護措施。BiasGuard 透過條件生成對抗網路 (CTGAN) 驅動的測試時間擴充 (TTA) 來提升效能，CTGAN 是一種尖端的生成式 AI 模型，可根據反向受保護屬性值來合成資料樣本，從而促進不同群體之間的公平結果。此方法旨在為特權和非特權群體提供平等的機會，同時大幅提升已部署系統的公平性指標，而無需重新訓練。我們在各種資料集上進行的全面實驗分析顯示，BiasGuard 可將公平性提升 31%，而與未緩解的基準相比，準確度僅降低 0.09%。此外，BiasGuard 在改善公平性方面優於現有的後處理方法，使其成為在重新訓練模型不切實際時，用於防範偏差的有效工具。", "author": "Nurit Cohen-Inger et.al.", "authors": "Nurit Cohen-Inger, Seffi Cohen, Neomi Rabaev, Lior Rokach, Bracha Shapira", "id": "2501.04142v1", "paper_url": "http://arxiv.org/abs/2501.04142v1", "repo": "null"}}