{"2406.03070": {"publish_time": "2024-06-05", "title": "A-Bench: Are LMMs Masters at Evaluating AI-generated Images?", "paper_summary": "How to accurately and efficiently assess AI-generated images (AIGIs) remains\na critical challenge for generative models. Given the high costs and extensive\ntime commitments required for user studies, many researchers have turned\ntowards employing large multi-modal models (LMMs) as AIGI evaluators, the\nprecision and validity of which are still questionable. Furthermore,\ntraditional benchmarks often utilize mostly natural-captured content rather\nthan AIGIs to test the abilities of LMMs, leading to a noticeable gap for\nAIGIs. Therefore, we introduce A-Bench in this paper, a benchmark designed to\ndiagnose whether LMMs are masters at evaluating AIGIs. Specifically, A-Bench is\norganized under two key principles: 1) Emphasizing both high-level semantic\nunderstanding and low-level visual quality perception to address the intricate\ndemands of AIGIs. 2) Various generative models are utilized for AIGI creation,\nand various LMMs are employed for evaluation, which ensures a comprehensive\nvalidation scope. Ultimately, 2,864 AIGIs from 16 text-to-image models are\nsampled, each paired with question-answers annotated by human experts, and\ntested across 18 leading LMMs. We hope that A-Bench will significantly enhance\nthe evaluation process and promote the generation quality for AIGIs. The\nbenchmark is available at https://github.com/Q-Future/A-Bench.", "paper_summary_zh": "如何準確有效地評估 AI 生成的圖像 (AIGI) 仍然是生成模型的一項重大挑戰。鑑於使用者研究需要高成本和大量時間承諾，許多研究人員已轉向採用大型多模態模型 (LMM) 作為 AIGI 評估器，其準確性和有效性仍有待商榷。此外，傳統基準通常主要利用自然擷取的內容，而非 AIGI 來測試 LMM 的能力，導致 AIGI 出現顯著的差距。因此，我們在本文中介紹 A-Bench，這是一個基準，旨在診斷 LMM 是否是評估 AIGI 的專家。具體來說，A-Bench 是根據兩個關鍵原則組織的：1) 強調高階語義理解和低階視覺品質感知，以滿足 AIGI 的複雜需求。2) 採用各種生成模型來建立 AIGI，並採用各種 LMM 來進行評估，這確保了全面的驗證範圍。最終，從 16 個文字轉圖像模型中抽取 2,864 個 AIGI，每個 AIGI 都配有人類專家註解的問題和答案，並在 18 個領先的 LMM 中進行測試。我們希望 A-Bench 能夠顯著增強評估過程，並促進 AIGI 的生成品質。基準可在 https://github.com/Q-Future/A-Bench 取得。", "author": "Zicheng Zhang et.al.", "authors": "Zicheng Zhang, Haoning Wu, Chunyi Li, Yingjie Zhou, Wei Sun, Xiongkuo Min, Zijian Chen, Xiaohong Liu, Weisi Lin, Guangtao Zhai", "id": "2406.03070v1", "paper_url": "http://arxiv.org/abs/2406.03070v1", "repo": "https://github.com/q-future/a-bench"}}