{"2501.04227": {"publish_time": "2025-01-08", "title": "Agent Laboratory: Using LLM Agents as Research Assistants", "paper_summary": "Historically, scientific discovery has been a lengthy and costly process,\ndemanding substantial time and resources from initial conception to final\nresults. To accelerate scientific discovery, reduce research costs, and improve\nresearch quality, we introduce Agent Laboratory, an autonomous LLM-based\nframework capable of completing the entire research process. This framework\naccepts a human-provided research idea and progresses through three\nstages--literature review, experimentation, and report writing to produce\ncomprehensive research outputs, including a code repository and a research\nreport, while enabling users to provide feedback and guidance at each stage. We\ndeploy Agent Laboratory with various state-of-the-art LLMs and invite multiple\nresearchers to assess its quality by participating in a survey, providing human\nfeedback to guide the research process, and then evaluate the final paper. We\nfound that: (1) Agent Laboratory driven by o1-preview generates the best\nresearch outcomes; (2) The generated machine learning code is able to achieve\nstate-of-the-art performance compared to existing methods; (3) Human\ninvolvement, providing feedback at each stage, significantly improves the\noverall quality of research; (4) Agent Laboratory significantly reduces\nresearch expenses, achieving an 84% decrease compared to previous autonomous\nresearch methods. We hope Agent Laboratory enables researchers to allocate more\neffort toward creative ideation rather than low-level coding and writing,\nultimately accelerating scientific discovery.", "paper_summary_zh": "<paragraph>從歷史上來看，科學發現一直是一個漫長且昂貴的過程，\n從最初的概念到最終的結果都需要大量的時間和資源。為了加速科學發現、降低研究成本並改善\n研究品質，我們引入了 Agent Laboratory，一個基於自主式 LLM 的\n架構，能夠完成整個研究過程。此架構\n接受人類提供的研究構想，並進行三個階段的進展——文獻回顧、實驗和報告撰寫，以產生\n全面的研究成果，包括程式碼儲存庫和研究\n報告，同時讓使用者在每個階段提供回饋和指導。我們\n使用各種最先進的 LLM 部署 Agent Laboratory，並邀請多位\n研究人員透過參與調查、提供人類回饋來指導研究過程，然後評估最終論文的品質。我們\n發現：(1) 由 o1-preview 驅動的 Agent Laboratory 產生了最佳\n研究成果；(2) 生成的機器學習程式碼能夠達到\n與現有方法相比最先進的效能；(3) 人類參與，在每個階段提供回饋，顯著改善\n整體研究品質；(4) Agent Laboratory 大幅降低\n研究開支，與先前的自主研究方法相比，減少了 84%。我們希望 Agent Laboratory 能讓研究人員將更多\n精力分配到創意的構想，而不是低階的編碼和寫作，最終加速科學發現。</paragraph>", "author": "Samuel Schmidgall et.al.", "authors": "Samuel Schmidgall, Yusheng Su, Ze Wang, Ximeng Sun, Jialian Wu, Xiaodong Yu, Jiang Liu, Zicheng Liu, Emad Barsoum", "id": "2501.04227v1", "paper_url": "http://arxiv.org/abs/2501.04227v1", "repo": "null"}}