{"2406.09326": {"publish_time": "2024-06-13", "title": "PianoMotion10M: Dataset and Benchmark for Hand Motion Generation in Piano Performance", "paper_summary": "Recently, artificial intelligence techniques for education have been received\nincreasing attentions, while it still remains an open problem to design the\neffective music instrument instructing systems. Although key presses can be\ndirectly derived from sheet music, the transitional movements among key presses\nrequire more extensive guidance in piano performance. In this work, we\nconstruct a piano-hand motion generation benchmark to guide hand movements and\nfingerings for piano playing. To this end, we collect an annotated dataset,\nPianoMotion10M, consisting of 116 hours of piano playing videos from a\nbird's-eye view with 10 million annotated hand poses. We also introduce a\npowerful baseline model that generates hand motions from piano audios through a\nposition predictor and a position-guided gesture generator. Furthermore, a\nseries of evaluation metrics are designed to assess the performance of the\nbaseline model, including motion similarity, smoothness, positional accuracy of\nleft and right hands, and overall fidelity of movement distribution. Despite\nthat piano key presses with respect to music scores or audios are already\naccessible, PianoMotion10M aims to provide guidance on piano fingering for\ninstruction purposes. The dataset and source code can be accessed at\nhttps://agnjason.github.io/PianoMotion-page.", "paper_summary_zh": "最近，人工智慧技術在教育領域受到越來越多的關注，而設計有效的樂器教學系統仍然是一個開放性的問題。儘管可以從樂譜中直接推演出按鍵，但在鋼琴演奏中，按鍵之間的過渡動作需要更廣泛的指導。在這項工作中，我們構建了一個鋼琴手部動作生成基準，用於指導鋼琴演奏中的手部動作和指法。為此，我們收集了一個帶註釋的數據集 PianoMotion10M，其中包含 116 小時的鋼琴演奏視頻，從鳥瞰視角拍攝，並帶有 1000 萬個帶註釋的手部姿勢。我們還引入了一個強大的基線模型，該模型通過位置預測器和位置引導手勢生成器從鋼琴音頻生成手部動作。此外，還設計了一系列評估指標來評估基線模型的性能，包括動作相似性、平滑性、左右手的定位準確性以及整體動作分佈保真度。儘管已經可以根據樂譜或音頻訪問鋼琴按鍵，但 PianoMotion10M 旨在為鋼琴指法提供指導，以供教學使用。可以在 https://agnjason.github.io/PianoMotion-page 訪問數據集和源代碼。", "author": "Qijun Gan et.al.", "authors": "Qijun Gan, Song Wang, Shengtao Wu, Jianke Zhu", "id": "2406.09326v1", "paper_url": "http://arxiv.org/abs/2406.09326v1", "repo": "null"}}