{"2502.04774": {"publish_time": "2025-02-07", "title": "SeDi-Instruct: Enhancing Alignment of Language Models through Self-Directed Instruction Generation", "paper_summary": "The rapid evolution of Large Language Models (LLMs) has enabled the industry\nto develop various AI-based services. Instruction tuning is considered\nessential in adapting foundation models for target domains to provide\nhigh-quality services to customers. A key challenge in instruction tuning is\nobtaining high-quality instruction data. Self-Instruct, which automatically\ngenerates instruction data using ChatGPT APIs, alleviates the data scarcity\nproblem. To improve the quality of instruction data, Self-Instruct discards\nmany of the instructions generated from ChatGPT, even though it is inefficient\nin terms of cost owing to many useless API calls. To generate high-quality\ninstruction data at a low cost, we propose a novel data generation framework,\nSelf-Direct Instruction generation (SeDi-Instruct), which employs\ndiversity-based filtering and iterative feedback task generation.\nDiversity-based filtering maintains model accuracy without excessively\ndiscarding low-quality generated instructions by enhancing the diversity of\ninstructions in a batch. This reduces the cost of synthesizing instruction\ndata. The iterative feedback task generation integrates instruction generation\nand training tasks and utilizes information obtained during the training to\ncreate high-quality instruction sets. Our results show that SeDi-Instruct\nenhances the accuracy of AI models by 5.2%, compared with traditional methods,\nwhile reducing data generation costs by 36%.", "paper_summary_zh": "大型語言模型 (LLM) 的快速演進讓產業\n能夠開發各種基於 AI 的服務。指令微調被認為\n在調整基礎模型以適應目標領域時至關重要，為客戶提供\n高品質的服務。指令微調中的主要挑戰是\n取得高品質的指令資料。Self-Instruct 自動\n使用 ChatGPT API 產生指令資料，緩解資料短缺\n的問題。為了提升指令資料的品質，Self-Instruct 捨棄\n許多由 ChatGPT 產生的指令，儘管這在成本方面很沒有效率，因為有許多無用的 API 呼叫。為了以低成本產生高品質\n的指令資料，我們提出一個新穎的資料產生架構，\nSelf-Direct 指令產生 (SeDi-Instruct)，它採用\n基於多樣性的過濾和反覆回饋任務產生。\n基於多樣性的過濾維持模型準確性，同時不會過度\n捨棄低品質的產生指令，方法是提升指令在批次中的多樣性。這降低了合成指令\n資料的成本。反覆回饋任務產生整合指令產生\n和訓練任務，並利用在訓練期間取得的資訊來\n建立高品質的指令集。我們的結果顯示 SeDi-Instruct\n提升了 AI 模型的準確性 5.2%，相較於傳統方法，\n同時將資料產生成本降低了 36%。", "author": "Jungwoo Kim et.al.", "authors": "Jungwoo Kim, Minsang Kim, Sungjin Lee", "id": "2502.04774v1", "paper_url": "http://arxiv.org/abs/2502.04774v1", "repo": "null"}}