{"2410.07030": {"publish_time": "2024-10-09", "title": "Clean Evaluations on Contaminated Visual Language Models", "paper_summary": "How to evaluate large language models (LLMs) cleanly has been established as\nan important research era to genuinely report the performance of possibly\ncontaminated LLMs. Yet, how to cleanly evaluate the visual language models\n(VLMs) is an under-studied problem. We propose a novel approach to achieve such\ngoals through data augmentation methods on the visual input information. We\nthen craft a new visual clean evaluation benchmark with thousands of data\ninstances. Through extensive experiments, we found that the traditional visual\ndata augmentation methods are useful, but they are at risk of being used as a\npart of the training data as a workaround. We further propose using BGR\naugmentation to switch the colour channel of the visual information. We found\nthat it is a simple yet effective method for reducing the effect of data\ncontamination and fortunately, it is also harmful to be used as a data\naugmentation method during training. It means that it is hard to integrate such\ndata augmentation into training by malicious trainers and it could be a\npromising technique to cleanly evaluate visual LLMs. Our code, data, and model\nweights will be released upon publication.", "paper_summary_zh": "如何乾淨地評估大型語言模型（LLM）已確立為一個重要的研究時代，以真正報告可能受到污染的 LLM 的效能。然而，如何乾淨地評估視覺語言模型（VLM）是一個研究不足的問題。我們提出一個創新的方法，透過視覺輸入資訊的資料擴充方法來達成這些目標。然後我們製作一個新的視覺乾淨評估基準，其中有數千個資料實例。透過廣泛的實驗，我們發現傳統的視覺資料擴充方法很有用，但它們有風險會被當成訓練資料的一部分作為一種變通方法。我們進一步提出使用 BGR 擴充來切換視覺資訊的色彩通道。我們發現這是一個簡單但有效的方法，可以減少資料污染的影響，而且幸運的是，它也不適合在訓練期間當成資料擴充方法來使用。這表示惡意的訓練員很難將這種資料擴充整合到訓練中，而且這可能是乾淨評估視覺 LLM 的一種有前途的技術。我們的程式碼、資料和模型權重將在發布後釋出。", "author": "Hongyuan Lu et.al.", "authors": "Hongyuan Lu, Shujie Miao, Wai Lam", "id": "2410.07030v1", "paper_url": "http://arxiv.org/abs/2410.07030v1", "repo": "null"}}