{"2502.10526": {"publish_time": "2025-02-14", "title": "Tempo: Helping Data Scientists and Domain Experts Collaboratively Specify Predictive Modeling Tasks", "paper_summary": "Temporal predictive models have the potential to improve decisions in health\ncare, public services, and other domains, yet they often fail to effectively\nsupport decision-makers. Prior literature shows that many misalignments between\nmodel behavior and decision-makers' expectations stem from issues of model\nspecification, namely how, when, and for whom predictions are made. However,\nmodel specifications for predictive tasks are highly technical and difficult\nfor non-data-scientist stakeholders to interpret and critique. To address this\nchallenge we developed Tempo, an interactive system that helps data scientists\nand domain experts collaboratively iterate on model specifications. Using\nTempo's simple yet precise temporal query language, data scientists can quickly\nprototype specifications with greater transparency about pre-processing\nchoices. Moreover, domain experts can assess performance within data subgroups\nto validate that models behave as expected. Through three case studies, we\ndemonstrate how Tempo helps multidisciplinary teams quickly prune infeasible\nspecifications and identify more promising directions to explore.", "paper_summary_zh": "時間預測模型具有改善醫療保健、公共服務和其他領域決策的潛力，但它們通常無法有效支持決策者。先前的文獻表明，模型行為與決策者期望之間的許多不一致源於模型規範問題，即如何、何時以及針對誰進行預測。然而，預測任務的模型規範非常技術化，非數據科學家利益相關者難以解釋和批評。為了應對這一挑戰，我們開發了 Tempo，這是一個互動式系統，可幫助數據科學家和領域專家協作反覆運算模型規範。使用 Tempo 簡單但精確的時間查詢語言，數據科學家可以快速建立規範原型，並更透明地了解預處理選擇。此外，領域專家可以評估資料子群組內的效能，以驗證模型是否按預期執行。透過三個案例研究，我們展示了 Tempo 如何幫助跨領域團隊快速刪除不可行的規範，並找出更有希望探索的方向。", "author": "Venkatesh Sivaraman et.al.", "authors": "Venkatesh Sivaraman, Anika Vaishampayan, Xiaotong Li, Brian R Buck, Ziyong Ma, Richard D Boyce, Adam Perer", "id": "2502.10526v1", "paper_url": "http://arxiv.org/abs/2502.10526v1", "repo": "null"}}