{"2406.02966": {"publish_time": "2024-06-05", "title": "Generative AI and Digital Neocolonialism in Global Education: Towards an Equitable Framework", "paper_summary": "This paper critically discusses how generative artificial intelligence\n(GenAI) might impose Western ideologies on non-Western societies, perpetuating\ndigital neocolonialism in education through its inherent biases. It further\nsuggests strategies for local and global stakeholders to mitigate these\neffects. Our discussions demonstrated that GenAI can foster cultural\nimperialism by generating content that primarily incorporates cultural\nreferences and examples relevant to Western students, thereby alienating\nstudents from non-Western backgrounds. Also, the predominant use of Western\nlanguages by GenAI can marginalize non-dominant languages, making educational\ncontent less accessible to speakers of indigenous languages and potentially\nimpacting their ability to learn in their first language. Additionally, GenAI\noften generates content and curricula that reflect the perspectives of\ntechnologically dominant countries, overshadowing marginalized indigenous\nknowledge and practices. Moreover, the cost of access to GenAI intensifies\neducational inequality and the control of GenAI data could lead to commercial\nexploitation without benefiting local students and their communities. We\npropose human-centric reforms to prioritize cultural diversity and equity in\nGenAI development; a liberatory design to empower educators and students to\nidentify and dismantle the oppressive structures within GenAI applications;\nforesight by design to create an adjustable GenAI system to meet future\neducational needs; and finally, effective prompting skills to reduce the\nretrieval of neocolonial outputs.", "paper_summary_zh": "本文批判性地探討生成式人工智慧 (GenAI) 如何將西方意識形態強加於非西方社會，藉由其內在偏見在教育中延續數位新殖民主義。本文進一步建議在地和全球利害關係人可採取的策略，以減輕這些影響。我們的討論證明，GenAI 可能透過產生主要納入與西方學生相關的文化參考和範例的內容來促進文化帝國主義，從而疏遠非西方背景的學生。此外，GenAI 主要使用西方語言可能會將非主流語言邊緣化，使得教育內容對原住民語言的使用者來說較難取得，並可能影響他們以母語學習的能力。此外，GenAI 經常產生反映技術主導國家觀點的內容和課程，掩蓋了被邊緣化的原住民知識和實務。更甚者，取得 GenAI 的使用權的成本加劇了教育不平等，而對 GenAI 資料的控制可能會導致商業剝削，而無法讓在地學生和他們的社群受益。我們提出以人為中心的改革，以優先考量 GenAI 開發中的文化多元性和公平性；解放設計，以賦能教育工作者和學生，識別並瓦解 GenAI 應用程式中的壓迫性結構；設計前瞻，以建立可調整的 GenAI 系統，以滿足未來的教育需求；最後，有效的提示技巧，以減少新殖民主義輸出的擷取。", "author": "Matthew Nyaaba et.al.", "authors": "Matthew Nyaaba, Alyson Wright, Gyu Lim Choi", "id": "2406.02966v2", "paper_url": "http://arxiv.org/abs/2406.02966v2", "repo": "null"}}