{"2408.08182": {"publish_time": "2024-08-15", "title": "Your Turn: At Home Turning Angle Estimation for Parkinson's Disease Severity Assessment", "paper_summary": "People with Parkinson's Disease (PD) often experience progressively worsening\ngait, including changes in how they turn around, as the disease progresses.\nExisting clinical rating tools are not capable of capturing hour-by-hour\nvariations of PD symptoms, as they are confined to brief assessments within\nclinic settings. Measuring gait turning angles continuously and passively is a\ncomponent step towards using gait characteristics as sensitive indicators of\ndisease progression in PD. This paper presents a deep learning-based approach\nto automatically quantify turning angles by extracting 3D skeletons from videos\nand calculating the rotation of hip and knee joints. We utilise\nstate-of-the-art human pose estimation models, Fastpose and Strided\nTransformer, on a total of 1386 turning video clips from 24 subjects (12 people\nwith PD and 12 healthy control volunteers), trimmed from a PD dataset of\nunscripted free-living videos in a home-like setting (Turn-REMAP). We also\ncurate a turning video dataset, Turn-H3.6M, from the public Human3.6M human\npose benchmark with 3D ground truth, to further validate our method. Previous\ngait research has primarily taken place in clinics or laboratories evaluating\nscripted gait outcomes, but this work focuses on free-living home settings\nwhere complexities exist, such as baggy clothing and poor lighting. Due to\ndifficulties in obtaining accurate ground truth data in a free-living setting,\nwe quantise the angle into the nearest bin $45^\\circ$ based on the manual\nlabelling of expert clinicians. Our method achieves a turning calculation\naccuracy of 41.6%, a Mean Absolute Error (MAE) of 34.7{\\deg}, and a weighted\nprecision WPrec of 68.3% for Turn-REMAP. This is the first work to explore the\nuse of single monocular camera data to quantify turns by PD patients in a home\nsetting.", "paper_summary_zh": "帕金森氏症 (PD) 患者隨著疾病進程，通常會經歷逐漸惡化的步態，包括轉身方式的變化。現有的臨床評分工具無法捕捉 PD 症狀逐小時的變化，因為它們僅限於在臨床環境中進行簡短評估。持續且被動地測量步態轉彎角度是將步態特徵用作 PD 疾病進程敏感指標的組成步驟。本文提出了一種基於深度學習的方法，通過從影片中提取 3D 骨架並計算髖關節和膝關節的旋轉，自動量化轉彎角度。我們在來自 24 個受試者（12 名 PD 患者和 12 名健康對照志工）的總共 1386 個轉彎影片剪輯中，利用了最先進的人體姿勢估計模型 Fastpose 和 Strided Transformer，這些剪輯取自家庭環境中未編寫腳本的自由生活影片的 PD 資料集（Turn-REMAP）。我們還從具有 3D 基本事實的公共 Human3.6M 人體姿勢基準中策劃了一個轉彎影片資料集 Turn-H3.6M，以進一步驗證我們的模型。先前的步態研究主要在評估腳本化步態結果的診所或實驗室中進行，但這項工作重點關注存在複雜性的自由生活家庭環境，例如寬鬆的衣服和昏暗的燈光。由於在自由生活環境中難以獲得準確的基本事實資料，我們根據專家臨床醫生的手動標記，將角度量化為最接近的區間 $45^\\circ$。我們的模型對 Turn-REMAP 的轉彎計算準確度為 41.6%，平均絕對誤差 (MAE) 為 34.7{\\deg}，加權精確度 WPrec 為 68.3%。這是第一個探索使用單一單目相機資料，在家庭環境中量化 PD 患者轉彎的研究。", "author": "Qiushuo Cheng et.al.", "authors": "Qiushuo Cheng, Catherine Morgan, Arindam Sikdar, Alessandro Masullo, Alan Whone, Majid Mirmehdi", "id": "2408.08182v2", "paper_url": "http://arxiv.org/abs/2408.08182v2", "repo": "null"}}