{"2412.10121": {"publish_time": "2024-12-13", "title": "Familiarity: Better Evaluation of Zero-Shot Named Entity Recognition by Quantifying Label Shifts in Synthetic Training Data", "paper_summary": "Zero-shot named entity recognition (NER) is the task of detecting named\nentities of specific types (such as 'Person' or 'Medicine') without any\ntraining examples. Current research increasingly relies on large synthetic\ndatasets, automatically generated to cover tens of thousands of distinct entity\ntypes, to train zero-shot NER models. However, in this paper, we find that\nthese synthetic datasets often contain entity types that are semantically\nhighly similar to (or even the same as) those in standard evaluation\nbenchmarks. Because of this overlap, we argue that reported F1 scores for\nzero-shot NER overestimate the true capabilities of these approaches. Further,\nwe argue that current evaluation setups provide an incomplete picture of\nzero-shot abilities since they do not quantify the label shift (i.e., the\nsimilarity of labels) between training and evaluation datasets. To address\nthese issues, we propose Familiarity, a novel metric that captures both the\nsemantic similarity between entity types in training and evaluation, as well as\ntheir frequency in the training data, to provide an estimate of label shift. It\nallows researchers to contextualize reported zero-shot NER scores when using\ncustom synthetic training datasets. Further, it enables researchers to generate\nevaluation setups of various transfer difficulties for fine-grained analysis of\nzero-shot NER.", "paper_summary_zh": "零次學習命名實體辨識 (NER) 是一項任務，在沒有任何訓練範例的情況下，偵測特定類型的命名實體（例如「人物」或「藥物」）。目前的研究所越來越依賴大型合成資料集，自動產生涵蓋數萬個不同實體類型的資料，來訓練零次學習 NER 模型。然而，在本文中，我們發現這些合成資料集通常包含語義上與標準評量基準中的實體類型高度相似（甚至相同）的實體類型。由於這種重疊，我們認為零次學習 NER 所報告的 F1 分數高估了這些方法的真實能力。此外，我們認為目前的評量設定提供了不完整的零次學習能力，因為它們沒有量化訓練和評量資料集之間的標籤轉移（即標籤的相似性）。為了解決這些問題，我們提出了熟悉度，這是一種新的指標，它同時擷取了訓練和評量中實體類型之間的語義相似性，以及它們在訓練資料中的頻率，以提供標籤轉移的估計值。它允許研究人員在使用自訂合成訓練資料集時，將所報告的零次學習 NER 分數脈絡化。此外，它使研究人員能夠產生各種轉移難度的評量設定，以進行零次學習 NER 的細粒度分析。", "author": "Jonas Golde et.al.", "authors": "Jonas Golde, Patrick Haller, Max Ploner, Fabio Barth, Nicolaas Jedema, Alan Akbik", "id": "2412.10121v1", "paper_url": "http://arxiv.org/abs/2412.10121v1", "repo": "null"}}