{"2405.12486": {"publish_time": "2024-05-21", "title": "Time Matters: Enhancing Pre-trained News Recommendation Models with Robust User Dwell Time Injection", "paper_summary": "Large Language Models (LLMs) have revolutionized text comprehension, leading\nto State-of-the-Art (SOTA) news recommendation models that utilize LLMs for\nin-depth news understanding. Despite this, accurately modeling user preferences\nremains challenging due to the inherent uncertainty of click behaviors.\nTechniques like multi-head attention in Transformers seek to alleviate this by\ncapturing interactions among clicks, yet they fall short in integrating\nexplicit feedback signals. User Dwell Time emerges as a powerful indicator,\noffering the potential to enhance the weak signals emanating from clicks.\nNonetheless, its real-world applicability is questionable, especially when\ndwell time data collection is subject to delays. To bridge this gap, this paper\nproposes two novel and robust dwell time injection strategies, namely Dwell\ntime Weight (DweW) and Dwell time Aware (DweA). Dwe} concentrates on refining\nEffective User Clicks through detailed analysis of dwell time, integrating with\ninitial behavioral inputs to construct a more robust user preference. DweA\nempowers the model with awareness of dwell time information, thereby\nfacilitating autonomous adjustment of attention values in user modeling. This\nenhancement sharpens the model's ability to accurately identify user\npreferences. In our experiment using the real-world news dataset from MSN\nwebsite, we validated that our two strategies significantly improve\nrecommendation performance, favoring high-quality news. Crucially, our\napproaches exhibit robustness to user dwell time information, maintaining their\nability to recommend high-quality content even in extreme cases where dwell\ntime data is entirely missing.", "paper_summary_zh": "大型語言模型 (LLM) 已徹底改變文字理解，進而產生利用 LLM 深入理解新聞的最新推薦模型。儘管如此，由於點擊行為的內在不確定性，精確建模使用者偏好仍然具有挑戰性。Transformer中的多頭注意力等技術試圖透過捕捉點擊之間的互動來減輕這種情況，但它們在整合明確的回饋訊號方面仍有不足。使用者停留時間成為一個強有力的指標，提供增強來自點擊的弱訊號的潛力。儘管如此，它的實際應用性仍有疑問，特別是在停留時間資料收集會延遲時。為了彌補這個差距，本文提出了兩種新穎且強大的停留時間注入策略，即停留時間加權 (DweW) 和停留時間感知 (DweA)。Dwe} 專注於透過詳細分析停留時間來精煉有效的使用者點擊，並與初始行為輸入整合，以建構更強大的使用者偏好。DweA 讓模型具備停留時間資訊的感知，從而促進使用者建模中注意力值的自主調整。這種增強使模型更精準地識別使用者偏好的能力更為敏銳。在我們使用來自 MSN 網站的真實世界新聞資料集進行的實驗中，我們驗證了我們的兩種策略顯著改善了推薦效能，偏好高品質的新聞。至關重要的是，我們的做法展現出對使用者停留時間資訊的穩健性，即使在停留時間資料完全遺失的極端情況下，它們仍能推薦高品質的內容。", "author": "Hao Jiang et.al.", "authors": "Hao Jiang, Chuanzhen Li, Mingxiao An", "id": "2405.12486v1", "paper_url": "http://arxiv.org/abs/2405.12486v1", "repo": "null"}}