{"2406.05307": {"publish_time": "2024-06-08", "title": "DeviceBERT: Applied Transfer Learning With Targeted Annotations and Vocabulary Enrichment to Identify Medical Device and Component Terminology in FDA Recall Summaries", "paper_summary": "FDA Medical Device recalls are critical and time-sensitive events, requiring\nswift identification of impacted devices to inform the public of a recall event\nand ensure patient safety. The OpenFDA device recall dataset contains valuable\ninformation about ongoing device recall actions, but manually extracting\nrelevant device information from the recall action summaries is a\ntime-consuming task. Named Entity Recognition (NER) is a task in Natural\nLanguage Processing (NLP) that involves identifying and categorizing named\nentities in unstructured text. Existing NER models, including domain-specific\nmodels like BioBERT, struggle to correctly identify medical device trade names,\npart numbers and component terms within these summaries. To address this, we\npropose DeviceBERT, a medical device annotation, pre-processing and enrichment\npipeline, which builds on BioBERT to identify and label medical device\nterminology in the device recall summaries with improved accuracy. Furthermore,\nwe demonstrate that our approach can be applied effectively for performing\nentity recognition tasks where training data is limited or sparse.", "paper_summary_zh": "食品藥物管理局醫療器材召回是關鍵且時間敏感的事件，需要迅速找出受影響的器材，以告知大眾召回事件並確保病患安全。OpenFDA 器材召回資料集包含有關持續進行器材召回行動的寶貴資訊，但手動從召回行動摘要中擷取相關器材資訊是一項耗時的任務。命名實體辨識 (NER) 是自然語言處理 (NLP) 中的一項任務，涉及在非結構化文字中辨識和分類命名實體。現有的 NER 模型（包括像 BioBERT 這類特定領域模型）難以正確辨識這些摘要中的醫療器材商品名、零件編號和組成術語。為了解決這個問題，我們提出 DeviceBERT，這是一個醫療器材註解、前處理和豐富處理管線，它建構於 BioBERT 之上，以更高的準確度辨識和標記器材召回摘要中的醫療器材術語。此外，我們證明我們的做法可以有效應用於執行訓練資料受限或稀疏的實體辨識任務。", "author": "Miriam Farrington et.al.", "authors": "Miriam Farrington", "id": "2406.05307v1", "paper_url": "http://arxiv.org/abs/2406.05307v1", "repo": "https://github.com/mmfarrington/devicebert-ner-project"}}