{"2408.04193": {"publish_time": "2024-08-08", "title": "Uncertainty-Aware Crime Prediction With Spatial Temporal Multivariate Graph Neural Networks", "paper_summary": "Crime forecasting is a critical component of urban analysis and essential for\nstabilizing society today. Unlike other time series forecasting problems, crime\nincidents are sparse, particularly in small regions and within specific time\nperiods. Traditional spatial-temporal deep learning models often struggle with\nthis sparsity, as they typically cannot effectively handle the non-Gaussian\nnature of crime data, which is characterized by numerous zeros and\nover-dispersed patterns. To address these challenges, we introduce a novel\napproach termed Spatial Temporal Multivariate Zero-Inflated Negative Binomial\nGraph Neural Networks (STMGNN-ZINB). This framework leverages diffusion and\nconvolution networks to analyze spatial, temporal, and multivariate\ncorrelations, enabling the parameterization of probabilistic distributions of\ncrime incidents. By incorporating a Zero-Inflated Negative Binomial model,\nSTMGNN-ZINB effectively manages the sparse nature of crime data, enhancing\nprediction accuracy and the precision of confidence intervals. Our evaluation\non real-world datasets confirms that STMGNN-ZINB outperforms existing models,\nproviding a more reliable tool for predicting and understanding crime dynamics.", "paper_summary_zh": "犯罪預測是都市分析中的關鍵組成，也是當今社會穩定的必要條件。與其他時間序列預測問題不同，犯罪事件是稀疏的，特別是在小區域和特定時間段內。傳統的時空深度學習模型通常難以處理這種稀疏性，因為它們通常無法有效處理犯罪數據的非高斯性質，而犯罪數據的特徵是零值多且過度分散的模式。為了應對這些挑戰，我們引入了一種新方法，稱為時空多元零膨脹負二項圖神經網路 (STMGNN-ZINB)。此架構利用擴散和卷積網路來分析時空和多元相關性，從而能夠對犯罪事件的機率分佈進行參數化。透過納入零膨脹負二項模型，STMGNN-ZINB 有效地管理犯罪數據的稀疏性質，提升預測準確度和信賴區間的精確度。我們對真實世界資料集的評估確認，STMGNN-ZINB 優於現有模型，提供了一個更可靠的工具來預測和理解犯罪動態。", "author": "Zepu Wang et.al.", "authors": "Zepu Wang, Xiaobo Ma, Huajie Yang, Weimin Lvu, Peng Sun, Sharath Chandra Guntuku", "id": "2408.04193v1", "paper_url": "http://arxiv.org/abs/2408.04193v1", "repo": "null"}}