{"2411.07773": {"publish_time": "2024-11-12", "title": "Likelihood as a Performance Gauge for Retrieval-Augmented Generation", "paper_summary": "Recent work finds that retrieval-augmented generation with large language\nmodels is prone to be influenced by the order of retrieved documents in the\ncontext. However, the lack of in-depth analysis limits the use of this\nphenomenon for prompt engineering in practice. In this study, we posit that\nlikelihoods serve as an effective gauge for language model performance. Through\nexperiments on two question-answering datasets with a variety of\nstate-of-the-art language models, we reveal correlations between answer\naccuracy and the likelihood of the question at both the corpus level and the\ninstance level. In addition, we find that question likelihood can also indicate\nthe position of the task-relevant information in the context. Based on these\nfindings, we propose two methods that use question likelihood as a gauge for\nselecting and constructing prompts that lead to better performance. We\ndemonstrate their effectiveness with experiments. In addition, our\nlikelihood-based methods are efficient, as they only need to compute the\nlikelihood of the input, requiring much fewer language model passes than\nheuristic prompt engineering methods that require generating responses. Our\nanalysis deepens our understanding of how input prompts affect model\nperformance and provides a promising direction for efficient prompt\noptimization.", "paper_summary_zh": "最近的研究发现，使用大型语言模型进行检索增强生成容易受到上下文中检索到的文档顺序的影响。然而，缺乏深入的分析限制了这种现象在实际提示工程中的使用。在本研究中，我们假设似然度可以作为语言模型性能的有效衡量标准。通过对两个问答数据集进行实验，其中包含各种最先进的语言模型，我们揭示了在语料库级别和实例级别上答案准确度与问题似然度之间的相关性。此外，我们发现问题似然度还可以指示上下文中与任务相关的信息的位置。基于这些发现，我们提出了两种方法，它们使用问题似然度作为衡量标准，用于选择和构建提示，从而带来更好的性能。我们通过实验展示了它们的有效性。此外，我们的基于似然度的方法非常有效，因为它们只需要计算输入的似然度，比需要生成响应的启发式提示工程方法需要的语言模型传递要少得多。我们的分析加深了我们对输入提示如何影响模型性能的理解，并为高效提示优化提供了一个有希望的方向。", "author": "Tianyu Liu et.al.", "authors": "Tianyu Liu, Jirui Qi, Paul He, Arianna Bisazza, Mrinmaya Sachan, Ryan Cotterell", "id": "2411.07773v1", "paper_url": "http://arxiv.org/abs/2411.07773v1", "repo": "https://github.com/lyutyuh/poptimizer"}}