{"2501.08549": {"publish_time": "2025-01-15", "title": "The Devil is in Temporal Token: High Quality Video Reasoning Segmentation", "paper_summary": "Existing methods for Video Reasoning Segmentation rely heavily on a single\nspecial token to represent the object in the keyframe or the entire video,\ninadequately capturing spatial complexity and inter-frame motion. To overcome\nthese challenges, we propose VRS-HQ, an end-to-end video reasoning segmentation\napproach that leverages Multimodal Large Language Models (MLLMs) to inject rich\nspatiotemporal features into hierarchical tokens.Our key innovations include a\nTemporal Dynamic Aggregation (TDA) and a Token-driven Keyframe Selection (TKS).\nSpecifically, we design frame-level <SEG> and temporal-level <TAK> tokens that\nutilize MLLM's autoregressive learning to effectively capture both local and\nglobal information. Subsequently, we apply a similarity-based weighted fusion\nand frame selection strategy, then utilize SAM2 to perform keyframe\nsegmentation and propagation. To enhance keyframe localization accuracy, the\nTKS filters keyframes based on SAM2's occlusion scores during inference. VRS-HQ\nachieves state-of-the-art performance on ReVOS, surpassing VISA by\n5.9%/12.5%/9.1% in J&F scores across the three subsets. These results highlight\nthe strong temporal reasoning and segmentation capabilities of our method. Code\nand model weights will be released at VRS-HQ.", "paper_summary_zh": "現有的影片推理分割方法過度依賴單一特殊符號來表示關鍵影格或整個影片中的物件，無法充分捕捉空間複雜度和影格間的動作。為了克服這些挑戰，我們提出 VRS-HQ，一種端對端的影片推理分割方法，利用多模態大型語言模型 (MLLM) 將豐富的時空特徵注入分層符號。我們的關鍵創新包括時序動態聚合 (TDA) 和符號驅動關鍵影格選擇 (TKS)。具體來說，我們設計了影格層級的 <SEG> 和時序層級的 <TAK> 符號，利用 MLLM 的自迴歸學習來有效捕捉局部和全域資訊。隨後，我們應用基於相似性的加權融合和影格選擇策略，然後利用 SAM2 來執行關鍵影格分割和傳播。為了增強關鍵影格定位的準確度，TKS 在推論期間根據 SAM2 的遮擋分數過濾關鍵影格。VRS-HQ 在 ReVOS 上取得最先進的效能，在三個子集中以 J&F 分數超越 VISA 5.9%/12.5%/9.1%。這些結果突顯了我們方法強大的時序推理和分割能力。程式碼和模型權重將在 VRS-HQ 發布。", "author": "Sitong Gong et.al.", "authors": "Sitong Gong, Yunzhi Zhuge, Lu Zhang, Zongxin Yang, Pingping Zhang, Huchuan Lu", "id": "2501.08549v1", "paper_url": "http://arxiv.org/abs/2501.08549v1", "repo": "null"}}