{"2408.05982": {"publish_time": "2024-08-12", "title": "Exploring and Learning Structure: Active Inference Approach in Navigational Agents", "paper_summary": "Drawing inspiration from animal navigation strategies, we introduce a novel\ncomputational model for navigation and mapping, rooted in biologically inspired\nprinciples. Animals exhibit remarkable navigation abilities by efficiently\nusing memory, imagination, and strategic decision-making to navigate complex\nand aliased environments. Building on these insights, we integrate traditional\ncognitive mapping approaches with an Active Inference Framework (AIF) to learn\nan environment structure in a few steps. Through the incorporation of\ntopological mapping for long-term memory and AIF for navigation planning and\nstructure learning, our model can dynamically apprehend environmental\nstructures and expand its internal map with predicted beliefs during\nexploration. Comparative experiments with the Clone-Structured Graph (CSCG)\nmodel highlight our model's ability to rapidly learn environmental structures\nin a single episode, with minimal navigation overlap. this is achieved without\nprior knowledge of the dimensions of the environment or the type of\nobservations, showcasing its robustness and effectiveness in navigating\nambiguous environments.", "paper_summary_zh": "從動物導航策略中汲取靈感，我們引入了一個新的導航和繪製地圖的計算模型，其根植於生物啟發原則。動物通過有效利用記憶、想像力和策略決策來導航複雜的別名環境，從而表現出非凡的導航能力。基於這些見解，我們將傳統的認知繪製地圖方法與主動推理框架 (AIF) 相結合，以便在幾個步驟中學習環境結構。通過將拓撲映射用於長期記憶，以及將 AIF 用於導航規劃和結構學習，我們的模型可以在探索過程中動態地理解環境結構，並通過預測信念擴展其內部地圖。與克隆結構圖 (CSCG) 模型的比較實驗突出了我們模型在單個情節中快速學習環境結構的能力，且導航重疊最少。這是沒有環境維度或觀察類型先驗知識就能實現的，展示了其在導航模棱兩可的環境中的穩健性和有效性。", "author": "Daria de Tinguy et.al.", "authors": "Daria de Tinguy, Tim Verbelen, Bart Dhoedt", "id": "2408.05982v1", "paper_url": "http://arxiv.org/abs/2408.05982v1", "repo": "null"}}