{"2405.19086": {"publish_time": "2024-05-29", "title": "MEMoE: Enhancing Model Editing with Mixture of Experts Adaptors", "paper_summary": "Model editing aims to efficiently alter the behavior of Large Language Models\n(LLMs) within a desired scope, while ensuring no adverse impact on other\ninputs. Recent years have witnessed various model editing methods been\nproposed. However, these methods either exhibit poor overall performance or\nstruggle to strike a balance between generalization and locality. We propose\nMOMoE, a model editing adapter utilizing a Mixture of Experts (MoE)\narchitecture with a knowledge anchor routing strategy. MOMoE updates knowledge\nusing a bypass MoE structure, keeping the original parameters unchanged to\npreserve the general ability of LLMs. And, the knowledge anchor routing ensures\nthat inputs requiring similar knowledge are routed to the same expert, thereby\nenhancing the generalization of the updated knowledge. Experimental results\nshow the superiority of our approach over both batch editing and sequential\nbatch editing tasks, exhibiting exceptional overall performance alongside\noutstanding balance between generalization and locality. Our code will be\navailable.", "paper_summary_zh": "模型編輯旨在有效地改變大型語言模型 (LLM) 在所需範圍內的行為，同時確保不會對其他輸入產生不利影響。近年來見證了各種模型編輯方法的提出。然而，這些方法要么表現出整體性能不佳，要么難以在泛化和局部性之間取得平衡。我們提出 MOMoE，一種利用專家混合 (MoE) 架構和知識錨定路由策略的模型編輯適配器。MOMoE 使用旁路 MoE 結構更新知識，保持原始參數不變以保留 LLM 的一般能力。而且，知識錨定路由確保需要類似知識的輸入被路由到同一個專家，從而增強更新知識的泛化性。實驗結果表明，我們的做法優於批次編輯和順序批次編輯任務，表現出卓越的整體性能以及泛化和局部性之間的出色平衡。我們的代碼將會提供。", "author": "Renzhi Wang et.al.", "authors": "Renzhi Wang, Piji Li", "id": "2405.19086v1", "paper_url": "http://arxiv.org/abs/2405.19086v1", "repo": "null"}}