{"2410.15472": {"publish_time": "2024-10-20", "title": "Multi-Layer Feature Fusion with Cross-Channel Attention-Based U-Net for Kidney Tumor Segmentation", "paper_summary": "Renal tumors, especially renal cell carcinoma (RCC), show significant\nheterogeneity, posing challenges for diagnosis using radiology images such as\nMRI, echocardiograms, and CT scans. U-Net based deep learning techniques are\nemerging as a promising approach for automated medical image segmentation for\nminimally invasive diagnosis of renal tumors. However, current techniques need\nfurther improvements in accuracy to become clinically useful to radiologists.\nIn this study, we present an improved U-Net based model for end-to-end\nautomated semantic segmentation of CT scan images to identify renal tumors. The\nmodel uses residual connections across convolution layers, integrates a\nmulti-layer feature fusion (MFF) and cross-channel attention (CCA) within\nencoder blocks, and incorporates skip connections augmented with additional\ninformation derived using MFF and CCA. We evaluated our model on the KiTS19\ndataset, which contains data from 210 patients. For kidney segmentation, our\nmodel achieves a Dice Similarity Coefficient (DSC) of 0.97 and a Jaccard index\n(JI) of 0.95. For renal tumor segmentation, our model achieves a DSC of 0.96\nand a JI of 0.91. Based on a comparison of available DSC scores, our model\noutperforms the current leading models.", "paper_summary_zh": "腎臟腫瘤，尤其是腎細胞癌 (RCC)，表現出顯著的異質性，對使用磁力共振影像、超音波心動圖和電腦斷層掃描等放射影像進行診斷構成挑戰。基於 U-Net 的深度學習技術正作為一種有前途的方法出現，用於自動化醫學影像分割，以對腎臟腫瘤進行微創診斷。然而，目前的技術需要進一步提高準確性，才能對放射科醫師在臨床上有用。在本研究中，我們提出了一個改進的基於 U-Net 的模型，用於電腦斷層掃描影像的端到端自動語義分割，以識別腎臟腫瘤。該模型使用卷積層之間的殘差連接，整合編碼器塊內的多分層特徵融合 (MFF) 和跨通道注意力 (CCA)，並結合使用 MFF 和 CCA 導出的附加資訊增強的跳躍連接。我們在 KiTS19 資料集上評估了我們的模型，其中包含來自 210 名患者的資料。對於腎臟分割，我們的模型實現了 0.97 的 Dice 相似性係數 (DSC) 和 0.95 的 Jaccard 指數 (JI)。對於腎臟腫瘤分割，我們的模型實現了 0.96 的 DSC 和 0.91 的 JI。根據可用 DSC 分數的比較，我們的模型優於目前的領先模型。", "author": "Fnu Neha et.al.", "authors": "Fnu Neha, Arvind K. Bansal", "id": "2410.15472v2", "paper_url": "http://arxiv.org/abs/2410.15472v2", "repo": "null"}}