{"2411.14842": {"publish_time": "2024-11-22", "title": "Who Can Withstand Chat-Audio Attacks? An Evaluation Benchmark for Large Language Models", "paper_summary": "Adversarial audio attacks pose a significant threat to the growing use of\nlarge language models (LLMs) in voice-based human-machine interactions. While\nexisting research has primarily focused on model-specific adversarial methods,\nreal-world applications demand a more generalizable and universal approach to\naudio adversarial attacks. In this paper, we introduce the Chat-Audio Attacks\n(CAA) benchmark including four distinct types of audio attacks, which aims to\nexplore the the vulnerabilities of LLMs to these audio attacks in\nconversational scenarios. To evaluate the robustness of LLMs, we propose three\nevaluation strategies: Standard Evaluation, utilizing traditional metrics to\nquantify model performance under attacks; GPT-4o-Based Evaluation, which\nsimulates real-world conversational complexities; and Human Evaluation,\noffering insights into user perception and trust. We evaluate six\nstate-of-the-art LLMs with voice interaction capabilities, including\nGemini-1.5-Pro, GPT-4o, and others, using three distinct evaluation methods on\nthe CAA benchmark. Our comprehensive analysis reveals the impact of four types\nof audio attacks on the performance of these models, demonstrating that GPT-4o\nexhibits the highest level of resilience.", "paper_summary_zh": "對抗式音訊攻擊對大型語言模型（LLM）在語音互動中的人機互動中日益廣泛的使用構成重大威脅。雖然現有研究主要集中於特定於模型的對抗方法，但實際應用需要一種更具概括性和普遍性的方法來進行音訊對抗攻擊。在本文中，我們介紹了聊天音訊攻擊（CAA）基準，其中包括四種類型的音訊攻擊，旨在探討 LLM 在對話場景中對這些音訊攻擊的脆弱性。為了評估 LLM 的穩健性，我們提出了三種評估策略：標準評估，利用傳統指標量化攻擊下的模型效能；基於 GPT-4o 的評估，模擬真實世界的對話複雜性；以及人類評估，提供對使用者感知和信任的見解。我們使用三種不同的評估方法在 CAA 基準上評估了六種具有語音互動功能的最新 LLM，包括 Gemini-1.5-Pro、GPT-4o 等。我們的綜合分析揭示了四種類型的音訊攻擊對這些模型效能的影響，證明 GPT-4o 展現出最高程度的韌性。", "author": "Wanqi Yang et.al.", "authors": "Wanqi Yang, Yanda Li, Meng Fang, Yunchao Wei, Tianyi Zhou, Ling Chen", "id": "2411.14842v1", "paper_url": "http://arxiv.org/abs/2411.14842v1", "repo": "null"}}