{"2409.17954": {"publish_time": "2024-09-26", "title": "Enhancing elusive clues in knowledge learning by contrasting attention of language models", "paper_summary": "Causal language models acquire vast amount of knowledge from general text\ncorpus during pretraining, but the efficiency of knowledge learning is known to\nbe unsatisfactory, especially when learning from knowledge-dense and\nsmall-sized corpora. The deficiency can come from long-distance dependencies\nwhich are hard to capture by language models, and overfitting to co-occurrence\npatterns and distracting clues in the training text. To address these issues,\nthe paper proposes a method to enhance knowledge learning during language model\npretraining, by enhancing elusive but important clues in text discovered by the\nlanguage model themselves. We found that larger language models pay more\nattention to non-obvious but important clues, which are often overlooked by\nsmaller language models. Therefore, we can identify these clues by contrasting\nthe attention weights of large and small language models. We use the identified\nclues as a guide to perform token-dropout data augmentation on the training\ntext, and observed a significant boost in both small and large models'\nperformance in fact memorization. This shows that the behavior contrast between\nmore and less-performant language models contains important clues for knowledge\nlearning, and it can be ``amplified\" for a straight-forward improvement in\nknowledge learning efficiency.", "paper_summary_zh": "因果語言模型在預訓練期間從一般文字語料庫中獲取大量的知識，但已知知識學習的效率並不令人滿意，特別是在從知識密集且小型的語料庫中學習時。這種不足可能來自長距離依賴關係，語言模型難以捕捉，以及過度擬合訓練文本中的共現模式和令人分心的線索。為了解決這些問題，本文提出了一種方法來增強語言模型預訓練期間的知識學習，方法是增強語言模型本身發現的文本中難以捉摸但重要的線索。我們發現，較大的語言模型會更多地關注不顯眼但重要的線索，而這些線索通常會被較小的語言模型所忽略。因此，我們可以通過對比大小語言模型的注意力權重來識別這些線索。我們使用識別出的線索作為指南，對訓練文本執行權杖中斷數據擴充，並觀察到大小模型在事實記憶中的性能都有顯著提升。這表明，性能較高和較低的語言模型之間的行為對比包含了知識學習的重要線索，並且可以「放大」以直接提高知識學習效率。", "author": "Jian Gao et.al.", "authors": "Jian Gao, Xiao Zhang, Ji Wu, Miao Li", "id": "2409.17954v1", "paper_url": "http://arxiv.org/abs/2409.17954v1", "repo": "null"}}