{"2504.17540": {"publish_time": "2025-04-24", "title": "An Explainable Nature-Inspired Framework for Monkeypox Diagnosis: Xception Features Combined with NGBoost and African Vultures Optimization Algorithm", "paper_summary": "The recent global spread of monkeypox, particularly in regions where it has\nnot historically been prevalent, has raised significant public health concerns.\nEarly and accurate diagnosis is critical for effective disease management and\ncontrol. In response, this study proposes a novel deep learning-based framework\nfor the automated detection of monkeypox from skin lesion images, leveraging\nthe power of transfer learning, dimensionality reduction, and advanced machine\nlearning techniques. We utilize the newly developed Monkeypox Skin Lesion\nDataset (MSLD), which includes images of monkeypox, chickenpox, and measles, to\ntrain and evaluate our models. The proposed framework employs the Xception\narchitecture for deep feature extraction, followed by Principal Component\nAnalysis (PCA) for dimensionality reduction, and the Natural Gradient Boosting\n(NGBoost) algorithm for classification. To optimize the model's performance and\ngeneralization, we introduce the African Vultures Optimization Algorithm (AVOA)\nfor hyperparameter tuning, ensuring efficient exploration of the parameter\nspace. Our results demonstrate that the proposed AVOA-NGBoost model achieves\nstate-of-the-art performance, with an accuracy of 97.53%, F1-score of 97.72%\nand an AUC of 97.47%. Additionally, we enhance model interpretability using\nGrad-CAM and LIME techniques, providing insights into the decision-making\nprocess and highlighting key features influencing classification. This\nframework offers a highly precise and efficient diagnostic tool, potentially\naiding healthcare providers in early detection and diagnosis, particularly in\nresource-constrained environments.", "paper_summary_zh": "<paragraph>猴痘近期在全球範圍內擴散，尤其是在過去不常見的區域，引發了重大的公共衛生問題。早期準確的診斷對於有效控制和管理疾病至關重要。為此，本研究提出了一種基於深度學習的新型框架，利用遷移學習、降維和先進的機器學習技術，從皮膚病灶圖像中自動檢測猴痘。我們利用新開發的猴痘皮膚病灶數據集 (MSLD) 來訓練和評估我們的模型，該數據集包含猴痘、水痘和麻疹的圖像。提出的框架採用 Xception 架構進行深度特徵提取，然後使用主成分分析 (PCA) 進行降維，並使用自然梯度提升 (NGBoost) 演算法進行分類。為了優化模型的性能和泛化能力，我們引入了非洲禿鷲優化演算法 (AVOA) 進行超參數調整，確保有效探索參數空間。我們的結果表明，所提出的 AVOA-NGBoost 模型達到了最先進的性能，準確率為 97.53%，F1 分數為 97.72%，AUC 為 97.47%。此外，我們使用 Grad-CAM 和 LIME 技術增強了模型的可解釋性，提供了對決策過程的洞察，並突出了影響分類的關鍵特徵。此框架提供了一個高度精確和高效的診斷工具，可能有助於醫療保健提供者早期發現和診斷，尤其是在資源有限的環境中。\n</paragraph>\n", "author": "Ahmadreza Shateri et.al.", "authors": "Ahmadreza Shateri, Negar Nourani, Morteza Dorrigiv, Hamid Nasiri", "id": "2504.17540v1", "paper_url": "http://arxiv.org/abs/2504.17540v1", "repo": "null"}}