{"2412.18174": {"publish_time": "2024-12-24", "title": "INVESTORBENCH: A Benchmark for Financial Decision-Making Tasks with LLM-based Agent", "paper_summary": "Recent advancements have underscored the potential of large language model\n(LLM)-based agents in financial decision-making. Despite this progress, the\nfield currently encounters two main challenges: (1) the lack of a comprehensive\nLLM agent framework adaptable to a variety of financial tasks, and (2) the\nabsence of standardized benchmarks and consistent datasets for assessing agent\nperformance. To tackle these issues, we introduce \\textsc{InvestorBench}, the\nfirst benchmark specifically designed for evaluating LLM-based agents in\ndiverse financial decision-making contexts. InvestorBench enhances the\nversatility of LLM-enabled agents by providing a comprehensive suite of tasks\napplicable to different financial products, including single equities like\nstocks, cryptocurrencies and exchange-traded funds (ETFs). Additionally, we\nassess the reasoning and decision-making capabilities of our agent framework\nusing thirteen different LLMs as backbone models, across various market\nenvironments and tasks. Furthermore, we have curated a diverse collection of\nopen-source, multi-modal datasets and developed a comprehensive suite of\nenvironments for financial decision-making. This establishes a highly\naccessible platform for evaluating financial agents' performance across various\nscenarios.", "paper_summary_zh": "<paragraph>最近的進展強調了大型語言模型 (LLM) 基礎代理在財務決策中的潛力。儘管有這些進展，該領域目前遇到兩個主要挑戰：(1) 缺乏可適應各種財務任務的綜合 LLM 代理架構，以及 (2) 缺乏標準化基準和一致的數據集來評估代理效能。為了解決這些問題，我們引入了 \\textsc{InvestorBench}，這是第一個專門設計用於評估 LLM 基礎代理在各種財務決策情境中的基準。InvestorBench 透過提供適用於不同金融產品的綜合任務套件，增強了 LLM 啟用代理的多功能性，包括股票、加密貨幣和交易所買賣基金 (ETF) 等單一股票。此外，我們使用十三種不同的 LLM 作為主幹模型，在各種市場環境和任務中評估我們代理架構的推理和決策能力。此外，我們策劃了多模態開源數據集的多樣化集合，並開發了一套全面的財務決策環境。這建立了一個高度可存取的平台，用於評估金融代理在各種情境中的表現。</paragraph>", "author": "Haohang Li et.al.", "authors": "Haohang Li, Yupeng Cao, Yangyang Yu, Shashidhar Reddy Javaji, Zhiyang Deng, Yueru He, Yuechen Jiang, Zining Zhu, Koduvayur Subbalakshmi, Guojun Xiong, Jimin Huang, Lingfei Qian, Xueqing Peng, Qianqian Xie, Jordan W. Suchow", "id": "2412.18174v1", "paper_url": "http://arxiv.org/abs/2412.18174v1", "repo": "null"}}