{"2406.16554": {"publish_time": "2024-06-24", "title": "LLaMA-MoE: Building Mixture-of-Experts from LLaMA with Continual Pre-training", "paper_summary": "Mixture-of-Experts (MoE) has gained increasing popularity as a promising\nframework for scaling up large language models (LLMs). However, training MoE\nfrom scratch in a large-scale setting still suffers from data-hungry and\ninstability problems. Motivated by this limit, we investigate building MoE\nmodels from existing dense large language models. Specifically, based on the\nwell-known LLaMA-2 7B model, we obtain an MoE model by: (1) Expert\nConstruction, which partitions the parameters of original Feed-Forward Networks\n(FFNs) into multiple experts; (2) Continual Pre-training, which further trains\nthe transformed MoE model and additional gate networks. In this paper, we\ncomprehensively explore different methods for expert construction and various\ndata sampling strategies for continual pre-training. After these stages, our\nLLaMA-MoE models could maintain language abilities and route the input tokens\nto specific experts with part of the parameters activated. Empirically, by\ntraining 200B tokens, LLaMA-MoE-3.5B models significantly outperform dense\nmodels that contain similar activation parameters. The source codes and models\nare available at https://github.com/pjlab-sys4nlp/llama-moe .", "paper_summary_zh": "混合专家 (MoE) 作為一種有前途的大型語言模型 (LLM) 擴展框架，獲得越來越高的關注度。然而，從頭開始在大型環境中訓練 MoE 仍然會遇到資料需求大且不穩定的問題。基於此限制，我們探討從現有的稠密大型語言模型中建立 MoE 模型。具體來說，基於著名的 LLaMA-2 7B 模型，我們透過以下方式取得 MoE 模型：(1) 專家構造，將原始前饋網路 (FFN) 的參數分割成多個專家；(2) 持續預訓練，進一步訓練轉換後的 MoE 模型和額外的閘網路。在本文中，我們全面探討了專家構造的不同方法，以及持續預訓練的不同資料取樣策略。在這些階段之後，我們的 LLaMA-MoE 模型可以維護語言能力，並將輸入符號路由到特定專家，並啟用部分參數。根據經驗，透過訓練 200B 個符號，LLaMA-MoE-3.5B 模型明顯優於包含類似啟用參數的稠密模型。原始程式碼和模型可以在 https://github.com/pjlab-sys4nlp/llama-moe 取得。", "author": "Tong Zhu et.al.", "authors": "Tong Zhu, Xiaoye Qu, Daize Dong, Jiacheng Ruan, Jingqi Tong, Conghui He, Yu Cheng", "id": "2406.16554v1", "paper_url": "http://arxiv.org/abs/2406.16554v1", "repo": "https://github.com/pjlab-sys4nlp/llama-moe"}}