{"2502.13141": {"publish_time": "2025-02-18", "title": "UniGuardian: A Unified Defense for Detecting Prompt Injection, Backdoor Attacks and Adversarial Attacks in Large Language Models", "paper_summary": "Large Language Models (LLMs) are vulnerable to attacks like prompt injection,\nbackdoor attacks, and adversarial attacks, which manipulate prompts or models\nto generate harmful outputs. In this paper, departing from traditional deep\nlearning attack paradigms, we explore their intrinsic relationship and\ncollectively term them Prompt Trigger Attacks (PTA). This raises a key\nquestion: Can we determine if a prompt is benign or poisoned? To address this,\nwe propose UniGuardian, the first unified defense mechanism designed to detect\nprompt injection, backdoor attacks, and adversarial attacks in LLMs.\nAdditionally, we introduce a single-forward strategy to optimize the detection\npipeline, enabling simultaneous attack detection and text generation within a\nsingle forward pass. Our experiments confirm that UniGuardian accurately and\nefficiently identifies malicious prompts in LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 容易受到提示注入、後門攻擊和對抗性攻擊等攻擊，這些攻擊會操縱提示或模型以產生有害的輸出。在本文中，我們跳脫傳統深度學習攻擊範例，探討它們的內在關係，並將它們統稱為提示觸發攻擊 (PTA)。這引發了一個關鍵問題：我們能確定一個提示是良性的還是惡意的嗎？為了解決這個問題，我們提出了 UniGuardian，這是一種旨在偵測 LLM 中的提示注入、後門攻擊和對抗性攻擊的第一個統一防禦機制。此外，我們引入了一個單一前向策略來最佳化偵測管道，在單一前向傳遞中同時進行攻擊偵測和文字生成。我們的實驗證實，UniGuardian 能準確且有效地識別 LLM 中的惡意提示。", "author": "Huawei Lin et.al.", "authors": "Huawei Lin, Yingjie Lao, Tong Geng, Tan Yu, Weijie Zhao", "id": "2502.13141v1", "paper_url": "http://arxiv.org/abs/2502.13141v1", "repo": "null"}}