{"2410.03592": {"publish_time": "2024-10-04", "title": "Variational Bayes Gaussian Splatting", "paper_summary": "Recently, 3D Gaussian Splatting has emerged as a promising approach for\nmodeling 3D scenes using mixtures of Gaussians. The predominant optimization\nmethod for these models relies on backpropagating gradients through a\ndifferentiable rendering pipeline, which struggles with catastrophic forgetting\nwhen dealing with continuous streams of data. To address this limitation, we\npropose Variational Bayes Gaussian Splatting (VBGS), a novel approach that\nframes training a Gaussian splat as variational inference over model\nparameters. By leveraging the conjugacy properties of multivariate Gaussians,\nwe derive a closed-form variational update rule, allowing efficient updates\nfrom partial, sequential observations without the need for replay buffers. Our\nexperiments show that VBGS not only matches state-of-the-art performance on\nstatic datasets, but also enables continual learning from sequentially streamed\n2D and 3D data, drastically improving performance in this setting.", "paper_summary_zh": "最近，3D 高斯潑濺已成為一種前景看好的方法，用於使用高斯混合對 3D 場景進行建模。這些模型的主要最佳化方法依賴於通過可微分渲染管線反向傳播梯度，在處理連續數據串流時會遇到災難性遺忘。為了解決這個限制，我們提出了變分貝氏高斯潑濺 (VBGS)，這是一種新方法，將訓練高斯潑濺構建為模型參數上的變分推論。通過利用多元高斯的共軛性質，我們推導出一個閉合形式的變分更新規則，允許從部分、順序觀測中進行有效更新，而無需重播緩衝區。我們的實驗表明，VBGS 不僅在靜態數據集上匹配了最先進的效能，而且還能從順序串流的 2D 和 3D 數據中進行持續學習，從而大幅提升了在這種設定下的效能。", "author": "Toon Van de Maele et.al.", "authors": "Toon Van de Maele, Ozan Catal, Alexander Tschantz, Christopher L. Buckley, Tim Verbelen", "id": "2410.03592v1", "paper_url": "http://arxiv.org/abs/2410.03592v1", "repo": "https://github.com/versestech/vbgs"}}