{"2411.19335": {"publish_time": "2024-11-28", "title": "PEFT-as-an-Attack! Jailbreaking Language Models during Federated Parameter-Efficient Fine-Tuning", "paper_summary": "Federated Parameter-Efficient Fine-Tuning (FedPEFT) has emerged as a\npromising paradigm for privacy-preserving and efficient adaptation of\nPre-trained Language Models (PLMs) in Federated Learning (FL) settings. It\npreserves data privacy by keeping the data decentralized and training the model\non local devices, ensuring that raw data never leaves the user's device.\nMoreover, the integration of PEFT methods such as LoRA significantly reduces\nthe number of trainable parameters compared to fine-tuning the entire model,\nthereby minimizing communication costs and computational overhead. Despite its\npotential, the security implications of FedPEFT remain underexplored. This\npaper introduces a novel security threat to FedPEFT, termed PEFT-as-an-Attack\n(PaaA), which exposes how PEFT can be exploited as an attack vector to\ncircumvent PLMs' safety alignment and generate harmful content in response to\nmalicious prompts. Our evaluation of PaaA reveals that with less than 1% of the\nmodel's parameters set as trainable, and a small subset of clients acting\nmaliciously, the attack achieves an approximate 80% attack success rate using\nrepresentative PEFT methods such as LoRA. To mitigate this threat, we further\ninvestigate potential defense strategies, including Robust Aggregation Schemes\n(RASs) and Post-PEFT Safety Alignment (PPSA). However, our empirical analysis\nhighlights the limitations of these defenses, i.e., even the most advanced\nRASs, such as DnC and ClippedClustering, struggle to defend against PaaA in\nscenarios with highly heterogeneous data distributions. Similarly, while PPSA\ncan reduce attack success rates to below 10%, it severely degrades the model's\naccuracy on the target task. Our results underscore the urgent need for more\neffective defense mechanisms that simultaneously ensure security and maintain\nthe performance of the FedPEFT paradigm.", "paper_summary_zh": "聯邦參數高效微調 (FedPEFT) 已成為聯邦學習 (FL) 設定中一種有前途的範例，用於隱私保護和預訓練語言模型 (PLM) 的高效適應。它透過維持資料分散化和在本地裝置上訓練模型來維護資料隱私，確保原始資料絕不會離開使用者的裝置。此外，整合 LoRA 等 PEFT 方法可大幅減少可訓練參數的數量，與微調整個模型相比，從而將通訊成本和運算負擔降至最低。儘管有潛力，FedPEFT 的安全性影響仍未得到充分探討。本文介紹了 FedPEFT 的一種新型安全威脅，稱為 PEFT 作為攻擊 (PaaA)，它揭露了 PEFT 如何被當作攻擊媒介，用以規避 PLM 的安全比對，並根據惡意提示產生有害內容。我們對 PaaA 的評估顯示，使用 LoRA 等具代表性的 PEFT 方法，即使只有不到 1% 的模型參數設定為可訓練參數，且只有少數用戶惡意行事，攻擊仍可達到約 80% 的攻擊成功率。為了減輕此威脅，我們進一步探討潛在的防禦策略，包括穩健聚合方案 (RAS) 和 PEFT 後安全比對 (PPSA)。然而，我們的實證分析突顯了這些防禦的限制，亦即，即使是最先進的 RAS，例如 DnC 和 ClippedClustering，在資料分佈高度異質化的情況下，也很難抵禦 PaaA。同樣地，雖然 PPSA 可以將攻擊成功率降低到 10% 以下，但它會嚴重降低模型在目標任務上的準確度。我們的結果強調了迫切需要更有效的防禦機制，同時確保安全性並維持 FedPEFT 範例的效能。", "author": "Shenghui Li et.al.", "authors": "Shenghui Li, Edith C. -H. Ngai, Fanghua Ye, Thiemo Voigt", "id": "2411.19335v1", "paper_url": "http://arxiv.org/abs/2411.19335v1", "repo": "null"}}