{"2410.05361": {"publish_time": "2024-10-07", "title": "RespLLM: Unifying Audio and Text with Multimodal LLMs for Generalized Respiratory Health Prediction", "paper_summary": "The high incidence and mortality rates associated with respiratory diseases\nunderscores the importance of early screening. Machine learning models can\nautomate clinical consultations and auscultation, offering vital support in\nthis area. However, the data involved, spanning demographics, medical history,\nsymptoms, and respiratory audio, are heterogeneous and complex. Existing\napproaches are insufficient and lack generalizability, as they typically rely\non limited training data, basic fusion techniques, and task-specific models. In\nthis paper, we propose RespLLM, a novel multimodal large language model (LLM)\nframework that unifies text and audio representations for respiratory health\nprediction. RespLLM leverages the extensive prior knowledge of pretrained LLMs\nand enables effective audio-text fusion through cross-modal attentions.\nInstruction tuning is employed to integrate diverse data from multiple sources,\nensuring generalizability and versatility of the model. Experiments on five\nreal-world datasets demonstrate that RespLLM outperforms leading baselines by\nan average of 4.6% on trained tasks, 7.9% on unseen datasets, and facilitates\nzero-shot predictions for new tasks. Our work lays the foundation for\nmultimodal models that can perceive, listen to, and understand heterogeneous\ndata, paving the way for scalable respiratory health diagnosis.", "paper_summary_zh": "高發生率和死亡率的呼吸道疾病突顯了早期篩檢的重要性。機器學習模型可以自動化臨床諮詢和聽診，在此領域提供重要的支援。然而，所涉及的資料涵蓋人口統計、病史、症狀和呼吸音訊，既異質又複雜。現有的方法不足且缺乏概括性，因為它們通常依賴於有限的訓練資料、基本的融合技術和特定於任務的模型。在本文中，我們提出 RespLLM，這是一個新穎的多模態大型語言模型 (LLM) 框架，它統一了文本和音訊表示，以進行呼吸道健康預測。RespLLM 利用預訓練 LLM 的廣泛先驗知識，並透過跨模態注意力實現有效的音訊文本融合。指示調整用於整合來自多個來源的不同資料，確保模型的概括性和多功能性。在五個真實世界資料集上的實驗表明，RespLLM 在訓練任務上比領先的基準高出平均 4.6%，在未見資料集上高出 7.9%，並促進新任務的零次學習預測。我們的研究為多模態模型奠定了基礎，這些模型可以感知、聆聽和理解異質資料，為可擴充的呼吸道健康診斷鋪平道路。", "author": "Yuwei Zhang et.al.", "authors": "Yuwei Zhang, Tong Xia, Aaqib Saeed, Cecilia Mascolo", "id": "2410.05361v1", "paper_url": "http://arxiv.org/abs/2410.05361v1", "repo": "null"}}