{"2502.13943": {"publish_time": "2025-02-19", "title": "AdaptiveStep: Automatically Dividing Reasoning Step through Model Confidence", "paper_summary": "Current approaches for training Process Reward Models (PRMs) often involve\nbreaking down responses into multiple reasoning steps using rule-based\ntechniques, such as using predefined placeholder tokens or setting the\nreasoning step's length into a fixed size. These approaches overlook the fact\nthat specific words do not typically mark true decision points in a text. To\naddress this, we propose AdaptiveStep, a method that divides reasoning steps\nbased on the model's confidence in predicting the next word. This division\nmethod provides more decision-making information at each step, enhancing\ndownstream tasks, such as reward model learning. Moreover, our method does not\nrequire manual annotation. We demonstrate its effectiveness through experiments\nwith AdaptiveStep-trained PRMs in mathematical reasoning and code generation\ntasks. Experimental results indicate that the outcome PRM achieves\nstate-of-the-art Best-of-N performance, surpassing greedy search strategy with\ntoken-level value-guided decoding, while also reducing construction costs by\nover 30% compared to existing open-source PRMs. In addition, we provide a\nthorough analysis and case study on the PRM's performance, transferability, and\ngeneralization capabilities.", "paper_summary_zh": "目前的訓練流程獎勵模型 (PRM) 方法通常涉及\n使用基於規則的技術將回應分解為多個推理步驟，例如使用預定義的佔位符代幣或將\n推理步驟的長度設定為固定大小。這些方法忽視了具體的字詞通常不會標記文本中的真實決策點。為了\n解決此問題，我們提出了 AdaptiveStep，這是一種基於模型預測下一個字詞的信心來劃分推理步驟的方法。此劃分\n方法在每個步驟中提供了更多決策資訊，增強了下游任務，例如獎勵模型學習。此外，我們的模型不需要\n手動註解。我們透過使用 AdaptiveStep 訓練的 PRM 在數學推理和程式碼生成任務中進行實驗來證明其有效性。實驗結果表明，成果 PRM 達到了最先進的 N 選一最佳效能，超越了使用代幣層級值引導解碼的貪婪搜尋策略，同時與現有的開源 PRM 相比，建構成本也降低了 30% 以上。此外，我們提供了對 PRM 效能、可移植性和泛化能力的深入分析和個案研究。", "author": "Yuliang Liu et.al.", "authors": "Yuliang Liu, Junjie Lu, Zhaoling Chen, Chaofeng Qu, Jason Klein Liu, Chonghan Liu, Zefan Cai, Yunhui Xia, Li Zhao, Jiang Bian, Chuheng Zhang, Wei Shen, Zhouhan Lin", "id": "2502.13943v1", "paper_url": "http://arxiv.org/abs/2502.13943v1", "repo": "null"}}