{"2406.18069": {"publish_time": "2024-06-26", "title": "Large Language Models for Cuffless Blood Pressure Measurement From Wearable Biosignals", "paper_summary": "Large language models (LLMs) have captured significant interest from both\nacademia and industry due to their impressive performance across various\ntextual tasks. However, the potential of LLMs to analyze physiological\ntime-series data remains an emerging research field. Particularly, there is a\nnotable gap in the utilization of LLMs for analyzing wearable biosignals to\nachieve cuffless blood pressure (BP) measurement, which is critical for the\nmanagement of cardiovascular diseases. This paper presents the first work to\nexplore the capacity of LLMs to perform cuffless BP estimation based on\nwearable biosignals. We extracted physiological features from electrocardiogram\n(ECG) and photoplethysmogram (PPG) signals and designed context-enhanced\nprompts by combining these features with BP domain knowledge and user\ninformation. Subsequently, we adapted LLMs to BP estimation tasks through\ninstruction tuning. To evaluate the proposed approach, we conducted assessments\nof ten advanced LLMs using a comprehensive public dataset of wearable\nbiosignals from 1,272 participants. The experimental results demonstrate that\nthe optimally fine-tuned LLM significantly surpasses conventional task-specific\nbaselines, achieving an estimation error of 0.00 $\\pm$ 9.25 mmHg for systolic\nBP and 1.29 $\\pm$ 6.37 mmHg for diastolic BP. Notably, the ablation studies\nhighlight the benefits of our context enhancement strategy, leading to an 8.9%\nreduction in mean absolute error for systolic BP estimation. This paper\npioneers the exploration of LLMs for cuffless BP measurement, providing a\npotential solution to enhance the accuracy of cuffless BP measurement.", "paper_summary_zh": "大型語言模型 (LLM) 由於其在各種文本任務中的出色表現，引起了學術界和產業界的濃厚興趣。然而，LLM 分析生理時序數據的潛力仍然是一個新興的研究領域。特別是，在利用 LLM 分析可穿戴生物信號以實現無袖套血壓 (BP) 測量方面存在顯著差距，這對於心血管疾病的管理至關重要。本文提出了第一項工作，探討 LLM 基於可穿戴生物信號執行無袖套血壓估計的能力。我們從心電圖 (ECG) 和光電容積描記法 (PPG) 信號中提取生理特徵，並通過將這些特徵與血壓領域知識和用戶信息相結合來設計上下文增強提示。隨後，我們通過指令調整將 LLM 適應於血壓估計任務。為了評估所提出的方法，我們使用來自 1,272 名參與者的可穿戴生物信號的綜合公共數據集，對十個先進的 LLM 進行了評估。實驗結果表明，經過最佳微調的 LLM 明顯優於傳統的特定任務基準，收縮壓的估計誤差為 0.00 ± 9.25 mmHg，舒張壓的估計誤差為 1.29 ± 6.37 mmHg。值得注意的是，消融研究突出了我們上下文增強策略的好處，使收縮壓估計的平均絕對誤差降低了 8.9%。本文開創了探索 LLM 進行無袖套血壓測量的先河，為提高無袖套血壓測量的準確性提供了一個潛在的解決方案。", "author": "Zengding Liu et.al.", "authors": "Zengding Liu, Chen Chen, Jiannong Cao, Minglei Pan, Jikui Liu, Nan Li, Fen Miao, Ye Li", "id": "2406.18069v1", "paper_url": "http://arxiv.org/abs/2406.18069v1", "repo": "null"}}