{"2408.11449": {"publish_time": "2024-08-21", "title": "Enabling Small Models for Zero-Shot Classification through Model Label Learning", "paper_summary": "Vision-language models (VLMs) like CLIP have demonstrated impressive\nzero-shot ability in image classification tasks by aligning text and images but\nsuffer inferior performance compared with task-specific expert models. On the\ncontrary, expert models excel in their specialized domains but lack zero-shot\nability for new tasks. How to obtain both the high performance of expert models\nand zero-shot ability is an important research direction. In this paper, we\nattempt to demonstrate that by constructing a model hub and aligning models\nwith their functionalities using model labels, new tasks can be solved in a\nzero-shot manner by effectively selecting and reusing models in the hub. We\nintroduce a novel paradigm, Model Label Learning (MLL), which bridges the gap\nbetween models and their functionalities through a Semantic Directed Acyclic\nGraph (SDAG) and leverages an algorithm, Classification Head Combination\nOptimization (CHCO), to select capable models for new tasks. Compared with the\nfoundation model paradigm, it is less costly and more scalable, i.e., the\nzero-shot ability grows with the sizes of the model hub. Experiments on seven\nreal-world datasets validate the effectiveness and efficiency of MLL,\ndemonstrating that expert models can be effectively reused for zero-shot tasks.\nOur code will be released publicly.", "paper_summary_zh": "視覺語言模型（VLM），例如 CLIP，已在影像分類任務中展現令人印象深刻的零次學習能力，方法是對齊文字和影像，但與特定任務的專家模型相比，其效能較差。相反地，專家模型在其專業領域中表現出色，但對於新任務缺乏零次學習能力。如何同時獲得專家模型的高效能和零次學習能力，是一個重要的研究方向。在本文中，我們嘗試透過建立模型中心，並使用模型標籤將模型與其功能對齊，證明可以透過有效選擇和重複使用中心中的模型，以零次學習的方式解決新任務。我們提出了一種新的範例，即模型標籤學習（MLL），它透過語義導向非循環圖（SDAG）彌合模型及其功能之間的差距，並利用一種演算法，即分類頭組合最佳化（CHCO），為新任務選擇有能力的模型。與基礎模型範例相比，它的成本較低且更具可擴充性，也就是說，零次學習能力會隨著模型中心規模的擴大而增長。在七個真實世界資料集上的實驗驗證了 MLL 的有效性和效率，證明了專家模型可以有效地重複用於零次學習任務。我們的程式碼將公開發布。", "author": "Jia Zhang et.al.", "authors": "Jia Zhang, Zhi Zhou, Lan-Zhe Guo, Yu-Feng Li", "id": "2408.11449v1", "paper_url": "http://arxiv.org/abs/2408.11449v1", "repo": "null"}}