{"2502.14001": {"publish_time": "2025-02-19", "title": "Towards a perturbation-based explanation for medical AI as differentiable programs", "paper_summary": "Recent advancement in machine learning algorithms reaches a point where\nmedical devices can be equipped with artificial intelligence (AI) models for\ndiagnostic support and routine automation in clinical settings. In medicine and\nhealthcare, there is a particular demand for sufficient and objective\nexplainability of the outcome generated by AI models. However, AI models are\ngenerally considered as black boxes due to their complexity, and the\ncomputational process leading to their response is often opaque. Although\nseveral methods have been proposed to explain the behavior of models by\nevaluating the importance of each feature in discrimination and prediction,\nthey may suffer from biases and opacities arising from the scale and sampling\nprotocol of the dataset used for training or testing. To overcome the\nshortcomings of existing methods, we explore an alternative approach to provide\nan objective explanation of AI models that can be defined independently of the\nlearning process and does not require additional data. As a preliminary study\nfor this direction of research, this work examines a numerical availability of\nthe Jacobian matrix of deep learning models that measures how stably a model\nresponses against small perturbations added to the input. The indicator, if\navailable, are calculated from a trained AI model for a given target input.\nThis is a first step towards a perturbation-based explanation, which will\nassist medical practitioners in understanding and interpreting the response of\nthe AI model in its clinical application.", "paper_summary_zh": "機器學習演算法的最新進展已達到一個階段，醫療裝置可以配備人工智慧 (AI) 模型，以在臨床環境中提供診斷支援和例行自動化。在醫學和保健領域，對於 AI 模型產生的結果有足夠且客觀的可解釋性有特別的需求。然而，由於 AI 模型的複雜性，它們通常被視為黑盒子，而導致其反應的運算過程通常是不透明的。儘管已經提出多種方法來解釋模型的行為，方法是評估每個特徵在判別和預測中的重要性，但它們可能會受到訓練或測試所用資料集的規模和抽樣協定的偏差和不透明性的影響。為了克服現有方法的缺點，我們探索一種替代方法，以提供 AI 模型的客觀解釋，這種方法可以獨立於學習過程定義，而且不需要額外的資料。作為這個研究方向的初步研究，這項工作探討了深度學習模型的雅可比矩陣的數值可用性，它衡量了模型對輸入中新增的小擾動的穩定反應程度。如果可用，指標會從訓練好的 AI 模型計算得出，以取得給定的目標輸入。這是基於擾動的解釋的第一步，它將協助醫療從業人員了解和詮釋 AI 模型在其臨床應用中的反應。", "author": "Takeshi Abe et.al.", "authors": "Takeshi Abe, Yoshiyuki Asai", "id": "2502.14001v1", "paper_url": "http://arxiv.org/abs/2502.14001v1", "repo": "null"}}