{"2411.10108": {"publish_time": "2024-11-15", "title": "Identifying Key Drivers of Heatwaves: A Novel Spatio-Temporal Framework for Extreme Event Detection", "paper_summary": "Heatwaves (HWs) are extreme atmospheric events that produce significant\nsocietal and environmental impacts. Predicting these extreme events remains\nchallenging, as their complex interactions with large-scale atmospheric and\nclimatic variables are difficult to capture with traditional statistical and\ndynamical models. This work presents a general method for driver identification\nin extreme climate events. A novel framework (STCO-FS) is proposed to identify\nkey immediate (short-term) HW drivers by combining clustering algorithms with\nan ensemble evolutionary algorithm. The framework analyzes spatio-temporal\ndata, reduces dimensionality by grouping similar geographical nodes for each\nvariable, and develops driver selection in spatial and temporal domains,\nidentifying the best time lags between predictive variables and HW occurrences.\nThe proposed method has been applied to analyze HWs in the Adda river basin in\nItaly. The approach effectively identifies significant variables influencing\nHWs in this region. This research can potentially enhance our understanding of\nHW drivers and predictability.", "paper_summary_zh": "熱浪 (HWs) 是極端的氣象事件，會產生重大的社會和環境影響。預測這些極端事件仍然具有挑戰性，因為它們與大規模大氣和氣候變數的複雜交互作用難以透過傳統的統計和動力模型捕捉。這項工作提出了一種用於極端氣候事件中驅動因素識別的通用方法。提出一個新穎的框架 (STCO-FS) 來識別關鍵的立即 (短期) HW 驅動因素，方法是將聚類演算法與整體演化演算法結合。該框架分析時空資料，透過為每個變數分組類似的地理節點來降低維度，並在空間和時間域中開發驅動因素選擇，找出預測變數和 HW 發生之間最佳的時間差。所提出的方法已應用於分析義大利阿達河流域中的 HWs。這種方法有效地識別出影響該地區 HWs 的重要變數。這項研究有可能增強我們對 HW 驅動因素和可預測性的理解。", "author": "J. Pérez-Aracil et.al.", "authors": "J. Pérez-Aracil, C. Peláez-Rodríguez, Ronan McAdam, Antonello Squintu, Cosmin M. Marina, Eugenio Lorente-Ramos, Niklas Luther, Veronica Torralba, Enrico Scoccimarro, Leone Cavicchia, Matteo Giuliani, Eduardo Zorita, Felicitas Hansen, David Barriopedro, Ricardo Garcia-Herrera, Pedro A. Gutiérrez, Jürg Luterbacher, Elena Xoplaki, Andrea Castelletti, S. Salcedo-Sanz", "id": "2411.10108v1", "paper_url": "http://arxiv.org/abs/2411.10108v1", "repo": "null"}}