{"2501.18237": {"publish_time": "2025-01-30", "title": "Arbitrary Data as Images: Fusion of Patient Data Across Modalities and Irregular Intervals with Vision Transformers", "paper_summary": "A patient undergoes multiple examinations in each hospital stay, where each\nprovides different facets of the health status. These assessments include\ntemporal data with varying sampling rates, discrete single-point measurements,\ntherapeutic interventions such as medication administration, and images. While\nphysicians are able to process and integrate diverse modalities intuitively,\nneural networks need specific modeling for each modality complicating the\ntraining procedure. We demonstrate that this complexity can be significantly\nreduced by visualizing all information as images along with unstructured text\nand subsequently training a conventional vision-text transformer. Our approach,\nVision Transformer for irregular sampled Multi-modal Measurements (ViTiMM), not\nonly simplifies data preprocessing and modeling but also outperforms current\nstate-of-the-art methods in predicting in-hospital mortality and phenotyping,\nas evaluated on 6,175 patients from the MIMIC-IV dataset. The modalities\ninclude patient's clinical measurements, medications, X-ray images, and\nelectrocardiography scans. We hope our work inspires advancements in\nmulti-modal medical AI by reducing the training complexity to (visual) prompt\nengineering, thus lowering entry barriers and enabling no-code solutions for\ntraining. The source code will be made publicly available.", "paper_summary_zh": "在每次住院期間，患者會接受多項檢查，每一項檢查都能提供健康狀態的不同面向。這些評估包括具有不同取樣率的時間資料、離散單點測量值、治療介入（如藥物管理）和影像。雖然醫生能夠直觀地處理和整合不同的模式，但神經網路需要針對每種模式進行特定的建模，這使得訓練程序變得複雜。我們證明，通過將所有資訊視覺化為影像，並結合非結構化文字，隨後訓練一個傳統的視覺文字轉換器，可以大幅降低這種複雜性。我們的做法，即用於不規則採樣多模式測量的視覺轉換器 (ViTiMM)，不僅簡化了資料預處理和建模，而且在預測院內死亡率和表型方面也優於目前的最新方法，這是根據 MIMIC-IV 資料集中的 6,175 名患者評估的。這些模式包括患者的臨床測量值、藥物、X 光影像和心電圖掃描。我們希望我們的工作能透過降低訓練複雜度到（視覺）提示工程，從而降低進入門檻，並為訓練啟用無程式碼解決方案，進而激勵多模式醫療 AI 的進步。原始程式碼將公開提供。", "author": "Malte Tölle et.al.", "authors": "Malte Tölle, Mohamad Scharaf, Samantha Fischer, Christoph Reich, Silav Zeid, Christoph Dieterich, Benjamin Meder, Norbert Frey, Philipp Wild, Sandy Engelhardt", "id": "2501.18237v1", "paper_url": "http://arxiv.org/abs/2501.18237v1", "repo": "null"}}