{"2409.04168": {"publish_time": "2024-09-06", "title": "From Calculation to Adjudication: Examining LLM judges on Mathematical Reasoning Tasks", "paper_summary": "To reduce the need for human annotations, large language models (LLMs) have\nbeen proposed as judges of the quality of other candidate models. LLM judges\nare typically evaluated by measuring the correlation with human judgments on\ngeneration tasks such as summarization or machine translation. In contrast, we\nstudy LLM judges on mathematical reasoning tasks. These tasks require\nmulti-step reasoning, and the correctness of their solutions is verifiable,\nenabling a more objective evaluation. We perform a detailed performance\nanalysis and find that the used judges are mostly unable to improve task\nperformance but are able to pick the better model. Our analysis uncovers a\nstrong correlation between judgment performance and the candidate model task\nperformance. We observe that judges tend to choose the model of higher quality\neven if its answer is incorrect. Further, we show that it is possible to use\nstatistics, such as the task performances of the individual models, to predict\njudgment performance. In an ablation, we either swap or mask the candidate\nanswers and observe that judges often keep the original judgment, providing\nevidence that judges incorporate writing style in their judgments. In summary,\nwe find that regularities in the judgments are quantifiable using statistical\nmeasures and provide various angles on exploiting them.", "paper_summary_zh": "<paragraph>為了減少人工標註的需求，大型語言模型 (LLM) 已被提議用作其他候選模型品質的評審。LLM 評審通常透過衡量在生成任務（例如摘要或機器翻譯）上與人類判斷相關性來評估。相反地，我們在數學推理任務上研究 LLM 評審。這些任務需要多步驟推理，且其解的正確性可驗證，能進行更客觀的評估。我們執行詳細的效能分析，發現所使用的評審大多無法改善任務效能，但能夠挑選出更好的模型。我們的分析揭露判斷效能與候選模型任務效能之間有很強的關聯性。我們觀察到，評審傾向選擇品質較高的模型，即使其答案不正確。此外，我們展示了可以使用統計資料（例如個別模型的任務效能）來預測判斷效能。在消融實驗中，我們調換或遮蔽候選答案，並觀察到評審經常保留原始判斷，這提供了評審在判斷中納入寫作風格的證據。總之，我們發現判斷中的規律性可以使用統計量化，並提供各種角度來利用它們。</paragraph>", "author": "Andreas Stephan et.al.", "authors": "Andreas Stephan, Dawei Zhu, Matthias Aßenmacher, Xiaoyu Shen, Benjamin Roth", "id": "2409.04168v1", "paper_url": "http://arxiv.org/abs/2409.04168v1", "repo": "null"}}