{"2501.01618": {"publish_time": "2025-01-03", "title": "Merging Context Clustering with Visual State Space Models for Medical Image Segmentation", "paper_summary": "Medical image segmentation demands the aggregation of global and local\nfeature representations, posing a challenge for current methodologies in\nhandling both long-range and short-range feature interactions. Recently, vision\nmamba (ViM) models have emerged as promising solutions for addressing model\ncomplexities by excelling in long-range feature iterations with linear\ncomplexity. However, existing ViM approaches overlook the importance of\npreserving short-range local dependencies by directly flattening spatial tokens\nand are constrained by fixed scanning patterns that limit the capture of\ndynamic spatial context information. To address these challenges, we introduce\na simple yet effective method named context clustering ViM (CCViM), which\nincorporates a context clustering module within the existing ViM models to\nsegment image tokens into distinct windows for adaptable local clustering. Our\nmethod effectively combines long-range and short-range feature interactions,\nthereby enhancing spatial contextual representations for medical image\nsegmentation tasks. Extensive experimental evaluations on diverse public\ndatasets, i.e., Kumar, CPM17, ISIC17, ISIC18, and Synapse demonstrate the\nsuperior performance of our method compared to current state-of-the-art\nmethods. Our code can be found at https://github.com/zymissy/CCViM.", "paper_summary_zh": "醫療影像分割需要聚合全局和局部特徵表示，對當前方法處理長程和短程特徵交互構成挑戰。最近，視覺曼巴 (ViM) 模型已成為解決模型複雜性的有前途的解決方案，它在線性複雜度下擅長長程特徵迭代。然而，現有的 ViM 方法忽視了透過直接壓平空間標記來保留短程局部依賴性的重要性，並且受到限制的掃描模式的約束，這會限制動態空間背景資訊的擷取。為了解決這些挑戰，我們引入了一種名為背景聚類 ViM (CCViM) 的簡單但有效的方法，它在現有的 ViM 模型中加入了一個背景聚類模組，將影像標記分割成不同的視窗，以進行適應性局部聚類。我們的模型有效地結合了長程和短程特徵交互，從而增強了用於醫療影像分割任務的空間背景表示。在各種公開資料集（即 Kumar、CPM17、ISIC17、ISIC18 和 Synapse）上進行的廣泛實驗評估證明了我們的方法與當前最先進方法相比具有卓越的效能。我們的程式碼可以在 https://github.com/zymissy/CCViM 找到。", "author": "Yun Zhu et.al.", "authors": "Yun Zhu, Dong Zhang, Yi Lin, Yifei Feng, Jinhui Tang", "id": "2501.01618v1", "paper_url": "http://arxiv.org/abs/2501.01618v1", "repo": "null"}}