{"2411.09116": {"publish_time": "2024-11-14", "title": "P-MMEval: A Parallel Multilingual Multitask Benchmark for Consistent Evaluation of LLMs", "paper_summary": "Recent advancements in large language models (LLMs) showcase varied\nmultilingual capabilities across tasks like translation, code generation, and\nreasoning. Previous assessments often limited their scope to fundamental\nnatural language processing (NLP) or isolated capability-specific tasks. To\nalleviate this drawback, we aim to present a comprehensive multilingual\nmultitask benchmark. First, we present a pipeline for selecting available and\nreasonable benchmarks from massive ones, addressing the oversight in previous\nwork regarding the utility of these benchmarks, i.e., their ability to\ndifferentiate between models being evaluated. Leveraging this pipeline, we\nintroduce P-MMEval, a large-scale benchmark covering effective fundamental and\ncapability-specialized datasets. Furthermore, P-MMEval delivers consistent\nlanguage coverage across various datasets and provides parallel samples.\nFinally, we conduct extensive experiments on representative multilingual model\nseries to compare performances across models, analyze dataset effectiveness,\nexamine prompt impacts on model performances, and explore the relationship\nbetween multilingual performances and factors such as tasks, model sizes, and\nlanguages. These insights offer valuable guidance for future research. The\ndataset is available at https://huggingface.co/datasets/Qwen/P-MMEval.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展展示了在翻譯、程式碼產生和推理等任務上的多種多語能力。先前的評估通常將其範圍限制在基本的自然語言處理 (NLP) 或孤立的能力特定任務。為了減輕這個缺點，我們旨在提出一個全面的多語言多任務基準。首先，我們提出了一個管道，用於從大量的基準中選擇可用且合理的基準，解決先前工作中關於這些基準的效用（即它們區分正在評估的模型的能力）的疏忽。利用這個管道，我們引入了 P-MMEval，一個涵蓋有效的基本和能力專用資料集的大規模基準。此外，P-MMEval 在各種資料集上提供了一致的語言覆蓋範圍，並提供並行範例。最後，我們對具代表性的多語言模型系列進行了廣泛的實驗，以比較模型之間的效能、分析資料集的有效性、檢查提示對模型效能的影響，並探討多語言效能與任務、模型大小和語言等因素之間的關係。這些見解為未來的研究提供了有價值的指導。資料集可在 https://huggingface.co/datasets/Qwen/P-MMEval 取得。", "author": "Yidan Zhang et.al.", "authors": "Yidan Zhang, Boyi Deng, Yu Wan, Baosong Yang, Haoran Wei, Fei Huang, Bowen Yu, Junyang Lin, Fei Huang, Jingren Zhou", "id": "2411.09116v1", "paper_url": "http://arxiv.org/abs/2411.09116v1", "repo": "null"}}