{"2412.10582": {"publish_time": "2024-12-13", "title": "WHAT-IF: Exploring Branching Narratives by Meta-Prompting Large Language Models", "paper_summary": "WHAT-IF -- Writing a Hero's Alternate Timeline through Interactive Fiction --\nis a system that uses zero-shot meta-prompting to create branching narratives\nfrom a prewritten story. Played as an interactive fiction (IF) game, WHAT-IF\nlets the player choose between decisions that the large language model (LLM)\nGPT-4 generates as possible branches in the story. Starting with an existing\nlinear plot as input, a branch is created at each key decision taken by the\nmain character. By meta-prompting the LLM to consider the major plot points\nfrom the story, the system produces coherent and well-structured alternate\nstorylines. WHAT-IF stores the branching plot tree in a graph which helps it to\nboth keep track of the story for prompting and maintain the structure for the\nfinal IF system. A video demo of our system can be found here:\nhttps://youtu.be/8vBqjqtupcc.", "paper_summary_zh": "WHAT-IF -- 透過互動式小說撰寫英雄的替代時間軸 --\n是一個系統，它使用零次提示來建立分歧敘事\n從一個預先寫好的故事。作為一個互動式小說 (IF) 遊戲，WHAT-IF\n讓玩家在大型語言模型 (LLM) 中選擇決定\nGPT-4 產生為故事中的可能分支。從現有的\n線性情節作為輸入，在主要角色做出的每個關鍵決定時都會創建一個分支。通過元提示 LLM 考慮主要情節點\n從故事中，系統產生連貫且結構良好的替代\n故事情節。WHAT-IF 將分支情節樹儲存在一個圖形中，這有助於\n同時追蹤故事以進行提示並維護最終 IF 系統的結構。可以在這裡找到我們系統的影片示範：\nhttps://youtu.be/8vBqjqtupcc。", "author": "Runsheng \"Anson\" Huang et.al.", "authors": "Runsheng \"Anson\" Huang, Lara J. Martin, Chris Callison-Burch", "id": "2412.10582v1", "paper_url": "http://arxiv.org/abs/2412.10582v1", "repo": "null"}}