{"2405.20935": {"publish_time": "2024-05-31", "title": "Effective Interplay between Sparsity and Quantization: From Theory to Practice", "paper_summary": "The increasing size of deep neural networks necessitates effective model\ncompression to improve computational efficiency and reduce their memory\nfootprint. Sparsity and quantization are two prominent compression methods that\nhave individually demonstrated significant reduction in computational and\nmemory footprints while preserving model accuracy. While effective, the\ninterplay between these two methods remains an open question. In this paper, we\ninvestigate the interaction between these two methods and assess whether their\ncombination impacts final model accuracy. We mathematically prove that applying\nsparsity before quantization is the optimal sequence for these operations,\nminimizing error in computation. Our empirical studies across a wide range of\nmodels, including OPT and Llama model families (125M-8B) and ViT corroborate\nthese theoretical findings. In addition, through rigorous analysis, we\ndemonstrate that sparsity and quantization are not orthogonal; their\ninteraction can significantly harm model accuracy, with quantization error\nplaying a dominant role in this degradation. Our findings extend to the\nefficient deployment of large models in resource-limited compute platforms and\nreduce serving cost, offering insights into best practices for applying these\ncompression methods to maximize efficacy without compromising accuracy.", "paper_summary_zh": "深度神经网络的规模日益扩大，需要有效的模型压缩来提高计算效率并减少其内存占用。稀疏性和量化是两种突出的压缩方法，它们分别证明了在保持模型准确性的同时，显著减少了计算和内存占用。虽然有效，但这两个方法之间的相互作用仍然是一个悬而未决的问题。在本文中，我们研究了这两种方法之间的相互作用，并评估它们的组合是否会影响最终的模型准确性。我们从数学上证明，在量化之前应用稀疏性是这些操作的最佳序列，从而最大程度地减少计算误差。我们对包括 OPT 和 Llama 模型族（125M-8B）和 ViT 在内的各种模型进行的实证研究证实了这些理论发现。此外，通过严格的分析，我们证明了稀疏性和量化不是正交的；它们的相互作用会严重损害模型的准确性，而量化误差在这一退化中起主导作用。我们的发现扩展到在资源受限的计算平台中有效部署大型模型，并降低服务成本，为在不影响准确性的前提下应用这些压缩方法以最大化功效提供了见解。", "author": "Simla Burcu Harma et.al.", "authors": "Simla Burcu Harma, Ayan Chakraborty, Elizaveta Kostenok, Danila Mishin, Dongho Ha, Babak Falsafi, Martin Jaggi, Ming Liu, Yunho Oh, Suvinay Subramanian, Amir Yazdanbakhsh", "id": "2405.20935v1", "paper_url": "http://arxiv.org/abs/2405.20935v1", "repo": "null"}}