{"2409.11022": {"publish_time": "2024-09-17", "title": "GEIC: Universal and Multilingual Named Entity Recognition with Large Language Models", "paper_summary": "Large Language Models (LLMs) have supplanted traditional methods in numerous\nnatural language processing tasks. Nonetheless, in Named Entity Recognition\n(NER), existing LLM-based methods underperform compared to baselines and\nrequire significantly more computational resources, limiting their application.\nIn this paper, we introduce the task of generation-based extraction and\nin-context classification (GEIC), designed to leverage LLMs' prior knowledge\nand self-attention mechanisms for NER tasks. We then propose CascadeNER, a\nuniversal and multilingual GEIC framework for few-shot and zero-shot NER.\nCascadeNER employs model cascading to utilize two small-parameter LLMs to\nextract and classify independently, reducing resource consumption while\nenhancing accuracy. We also introduce AnythingNER, the first NER dataset\nspecifically designed for LLMs, including 8 languages, 155 entity types and a\nnovel dynamic categorization system. Experiments show that CascadeNER achieves\nstate-of-the-art performance on low-resource and fine-grained scenarios,\nincluding CrossNER and FewNERD. Our work is openly accessible.", "paper_summary_zh": "大型語言模型 (LLM) 已取代傳統方法，用於許多自然語言處理任務。儘管如此，在命名實體識別 (NER) 中，現有的基於 LLM 的方法與基準相比表現不佳，並且需要更多運算資源，限制了其應用。在本文中，我們介紹了基於生成的抽取和上下文分類 (GEIC) 的任務，旨在利用 LLM 的先驗知識和自注意力機制進行 NER 任務。然後，我們提出了 CascadeNER，一個通用的多語言 GEIC 框架，用於少樣本和零樣本 NER。CascadeNER 使用模型串聯來利用兩個小參數 LLM 獨立提取和分類，從而減少資源消耗並提高準確性。我們還介紹了 AnythingNER，這是第一個專門為 LLM 設計的 NER 資料集，包括 8 種語言、155 種實體類型和一個新穎的動態分類系統。實驗表明，CascadeNER 在低資源和細粒度場景中實現了最先進的性能，包括 CrossNER 和 FewNERD。我們的研究成果是開放獲取的。", "author": "Hanjun Luo et.al.", "authors": "Hanjun Luo, Yibing Jin, Xuecheng Liu, Tong Shang, Ruizhe Chen, Zuozhu Liu", "id": "2409.11022v1", "paper_url": "http://arxiv.org/abs/2409.11022v1", "repo": "null"}}