{"2407.11438": {"publish_time": "2024-07-16", "title": "Trust No Bot: Discovering Personal Disclosures in Human-LLM Conversations in the Wild", "paper_summary": "Measuring personal disclosures made in human-chatbot interactions can provide\na better understanding of users' AI literacy and facilitate privacy research\nfor large language models (LLMs). We run an extensive, fine-grained analysis on\nthe personal disclosures made by real users to commercial GPT models,\ninvestigating the leakage of personally identifiable and sensitive information.\nTo understand the contexts in which users disclose to chatbots, we develop a\ntaxonomy of tasks and sensitive topics, based on qualitative and quantitative\nanalysis of naturally occurring conversations. We discuss these potential\nprivacy harms and observe that: (1) personally identifiable information (PII)\nappears in unexpected contexts such as in translation or code editing (48% and\n16% of the time, respectively) and (2) PII detection alone is insufficient to\ncapture the sensitive topics that are common in human-chatbot interactions,\nsuch as detailed sexual preferences or specific drug use habits. We believe\nthat these high disclosure rates are of significant importance for researchers\nand data curators, and we call for the design of appropriate nudging mechanisms\nto help users moderate their interactions.", "paper_summary_zh": "透過衡量人類與聊天機器人互動中所做的個人揭露，可以更了解使用者的 AI 素養，並促進大型語言模型 (LLM) 的隱私研究。我們對真實使用者對商業 GPT 模型所做的個人揭露進行廣泛的細緻分析，調查個人可識別和敏感資訊的洩漏。為了了解使用者在哪些情況下對聊天機器人揭露資訊，我們根據自然發生的對話進行定性和定量分析，制定了一套任務和敏感主題分類法。我們討論這些潛在的隱私危害，並觀察到：(1) 個人可識別資訊 (PII) 出現在意想不到的情況中，例如翻譯或程式碼編輯中 (分別為 48% 和 16% 的時間)，以及 (2) 僅 PII 偵測不足以掌握在人類與聊天機器人互動中常見的敏感主題，例如詳細的性偏好或特定的藥物使用習慣。我們相信這些高揭露率對研究人員和資料管理員來說非常重要，我們呼籲設計適當的推動機制來幫助使用者調節他們的互動。", "author": "Niloofar Mireshghallah et.al.", "authors": "Niloofar Mireshghallah, Maria Antoniak, Yash More, Yejin Choi, Golnoosh Farnadi", "id": "2407.11438v1", "paper_url": "http://arxiv.org/abs/2407.11438v1", "repo": "null"}}