{"2407.03032": {"publish_time": "2024-07-03", "title": "Strategies for Arabic Readability Modeling", "paper_summary": "Automatic readability assessment is relevant to building NLP applications for\neducation, content analysis, and accessibility. However, Arabic readability\nassessment is a challenging task due to Arabic's morphological richness and\nlimited readability resources. In this paper, we present a set of experimental\nresults on Arabic readability assessment using a diverse range of approaches,\nfrom rule-based methods to Arabic pretrained language models. We report our\nresults on a newly created corpus at different textual granularity levels\n(words and sentence fragments). Our results show that combining different\ntechniques yields the best results, achieving an overall macro F1 score of 86.7\nat the word level and 87.9 at the fragment level on a blind test set. We make\nour code, data, and pretrained models publicly available.", "paper_summary_zh": "自動可讀性評估與建構用於教育、內容分析和無障礙存取的 NLP 應用程式相關。然而，由於阿拉伯語的豐富形態和有限的可讀性資源，阿拉伯語的可讀性評估是一項艱鉅的任務。在本文中，我們提出了一組使用各種方法的阿拉伯語可讀性評估實驗結果，從基於規則的方法到阿拉伯語預訓練語言模型。我們報告了我們在不同文本粒度層級（字詞和句子片段）上新建立的語料庫上的結果。我們的結果顯示，結合不同的技術可產生最佳結果，在盲測集中，字詞層級的整體巨觀 F1 分數達到 86.7，片段層級達到 87.9。我們公開我們的程式碼、資料和預訓練模型。", "author": "Juan Piñeros Liberato et.al.", "authors": "Juan Piñeros Liberato, Bashar Alhafni, Muhamed Al Khalil, Nizar Habash", "id": "2407.03032v1", "paper_url": "http://arxiv.org/abs/2407.03032v1", "repo": "null"}}