{"2502.15424": {"publish_time": "2025-02-21", "title": "Anatomy-Informed Deep Learning and Radiomics for Automated Neurofibroma Segmentation in Whole-Body MRI", "paper_summary": "Neurofibromatosis Type 1 is a genetic disorder characterized by the\ndevelopment of neurofibromas (NFs), which exhibit significant variability in\nsize, morphology, and anatomical location. Accurate and automated segmentation\nof these tumors in whole-body magnetic resonance imaging (WB-MRI) is crucial to\nassess tumor burden and monitor disease progression. In this study, we present\nand analyze a fully automated pipeline for NF segmentation in fat-suppressed\nT2-weighted WB-MRI, consisting of three stages: anatomy segmentation, NF\nsegmentation, and tumor candidate classification. In the first stage, we use\nthe MRSegmentator model to generate an anatomy segmentation mask, extended with\na high-risk zone for NFs. This mask is concatenated with the input image as\nanatomical context information for NF segmentation. The second stage employs an\nensemble of 3D anisotropic anatomy-informed U-Nets to produce an NF\nsegmentation confidence mask. In the final stage, tumor candidates are\nextracted from the confidence mask and classified based on radiomic features,\ndistinguishing tumors from non-tumor regions and reducing false positives. We\nevaluate the proposed pipeline on three test sets representing different\nconditions: in-domain data (test set 1), varying imaging protocols and field\nstrength (test set 2), and low tumor burden cases (test set 3). Experimental\nresults show a 68% improvement in per-scan Dice Similarity Coefficient (DSC), a\n21% increase in per-tumor DSC, and a two-fold improvement in F1 score for tumor\ndetection in high tumor burden cases by integrating anatomy information. The\nmethod is integrated into the 3D Slicer platform for practical clinical use,\nwith the code publicly accessible.", "paper_summary_zh": "神經纖維瘤第 1 型是一種遺傳疾病，其特徵在於神經纖維瘤 (NF) 的發展，其在大小、形態和解剖位置上表現出顯著的可變性。在全身磁共振成像 (WB-MRI) 中準確且自動地分割這些腫瘤對於評估腫瘤負擔和監測疾病進展至關重要。在本研究中，我們提出並分析了脂肪抑制 T2 加權 WB-MRI 中 NF 分割的完全自動化管道，它包含三個階段：解剖分割、NF 分割和腫瘤候選分類。在第一階段，我們使用 MRSegmentator 模型生成解剖分割掩模，並擴展為 NF 的高風險區域。此掩模與輸入影像串聯，作為 NF 分割的解剖背景資訊。第二階段採用 3D 異向解剖資訊 U-Nets 的集合，以產生 NF 分割置信度掩模。在最後階段，從置信度掩模中提取腫瘤候選物，並根據放射特徵進行分類，將腫瘤與非腫瘤區域區分開來，並減少假陽性。我們在代表不同條件的三個測試集中評估所提出的管道：域內資料 (測試集 1)、不同的影像協議和場強 (測試集 2) 和低腫瘤負擔案例 (測試集 3)。實驗結果表明，通過整合解剖資訊，腫瘤負擔高的案例中，每個掃描骰子相似性係數 (DSC) 提升了 68%，每個腫瘤 DSC 提升了 21%，腫瘤檢測的 F1 分數提升了兩倍。該方法已整合到 3D Slicer 平臺中，以供實際臨床使用，其程式碼可公開取得。", "author": "Georgii Kolokolnikov et.al.", "authors": "Georgii Kolokolnikov, Marie-Lena Schmalhofer, Lennart Well, Said Farschtschi, Victor-Felix Mautner, Inka Ristow, Rene Werner", "id": "2502.15424v1", "paper_url": "http://arxiv.org/abs/2502.15424v1", "repo": "null"}}