{"2408.12337": {"publish_time": "2024-08-22", "title": "Fine-tuning Smaller Language Models for Question Answering over Financial Documents", "paper_summary": "Recent research has shown that smaller language models can acquire\nsubstantial reasoning abilities when fine-tuned with reasoning exemplars\ncrafted by a significantly larger teacher model. We explore this paradigm for\nthe financial domain, focusing on the challenge of answering questions that\nrequire multi-hop numerical reasoning over financial texts. We assess the\nperformance of several smaller models that have been fine-tuned to generate\nprograms that encode the required financial reasoning and calculations. Our\nfindings demonstrate that these fine-tuned smaller models approach the\nperformance of the teacher model.\n  To provide a granular analysis of model performance, we propose an approach\nto investigate the specific student model capabilities that are enhanced by\nfine-tuning. Our empirical analysis indicates that fine-tuning refines the\nstudent models ability to express and apply the required financial concepts\nalong with adapting the entity extraction for the specific data format. In\naddition, we hypothesize and demonstrate that comparable financial reasoning\ncapability can be induced using relatively smaller datasets.", "paper_summary_zh": "最近的研究表明，较小的语言模型在经过大幅增加的教师模型精心调整的推理范例微调后，可以获得大量的推理能力。我们探索了金融领域的这一范例，重点在于回答需要对金融文本进行多跳数值推理的问题。我们评估了几个较小的模型的性能，这些模型经过微调以生成对所需的财务推理和计算进行编码的程序。我们的研究结果表明，这些微调后的较小模型接近教师模型的性能。为了对模型性能进行细粒度分析，我们提出了一种方法来调查通过微调增强的特定学生模型能力。我们的实证分析表明，微调完善了学生模型表达和应用所需财务概念的能力，同时调整了特定数据格式的实体提取。此外，我们假设并证明可以使用相对较小的数据集来诱导可比较的财务推理能力。", "author": "Karmvir Singh Phogat et.al.", "authors": "Karmvir Singh Phogat, Sai Akhil Puranam, Sridhar Dasaratha, Chetan Harsha, Shashishekar Ramakrishna", "id": "2408.12337v1", "paper_url": "http://arxiv.org/abs/2408.12337v1", "repo": "null"}}