{"2405.11919": {"publish_time": "2024-05-20", "title": "On Efficient and Statistical Quality Estimation for Data Annotation", "paper_summary": "Annotated datasets are an essential ingredient to train, evaluate, compare\nand productionalize supervised machine learning models. It is therefore\nimperative that annotations are of high quality. For their creation, good\nquality management and thereby reliable quality estimates are needed. Then, if\nquality is insufficient during the annotation process, rectifying measures can\nbe taken to improve it. Quality estimation is often performed by having experts\nmanually label instances as correct or incorrect. But checking all annotated\ninstances tends to be expensive. Therefore, in practice, usually only subsets\nare inspected; sizes are chosen mostly without justification or regard to\nstatistical power and more often than not, are relatively small. Basing\nestimates on small sample sizes, however, can lead to imprecise values for the\nerror rate. Using unnecessarily large sample sizes costs money that could be\nbetter spent, for instance on more annotations. Therefore, we first describe in\ndetail how to use confidence intervals for finding the minimal sample size\nneeded to estimate the annotation error rate. Then, we propose applying\nacceptance sampling as an alternative to error rate estimation We show that\nacceptance sampling can reduce the required sample sizes up to 50% while\nproviding the same statistical guarantees.", "paper_summary_zh": "標註過的資料集是訓練、評量、比較和生產監督式機器學習模型的必要元素。因此，標註的品質必須很高。為了建立標註，需要良好的品質管理和可靠的品質估計。接著，如果在標註過程中品質不足，可以採取補救措施來改善品質。品質估計通常由專家手動標示實例為正確或不正確來執行。但是，檢查所有標註的實例往往很昂貴。因此，在實務上，通常只檢查子集；大小的選擇大多沒有依據或考量統計功效，而且通常很小。然而，根據小樣本大小來估計可能會導致錯誤率的值不精確。使用不必要的大樣本大小會花費金錢，而這些金錢可以花在更好的地方，例如更多標註。因此，我們首先詳細說明如何使用信賴區間來找出估計標註錯誤率所需的最小樣本大小。接著，我們建議採用驗收抽樣作為錯誤率估計的替代方案。我們顯示，驗收抽樣可以將所需的樣本大小減少多達 50%，同時提供相同的統計保證。", "author": "Jan-Christoph Klie et.al.", "authors": "Jan-Christoph Klie, Rahul Nair, Juan Haladjian, Marc Kirchner", "id": "2405.11919v1", "paper_url": "http://arxiv.org/abs/2405.11919v1", "repo": "null"}}