{"2405.15673": {"publish_time": "2024-05-24", "title": "Consistency of Neural Causal Partial Identification", "paper_summary": "Recent progress in Neural Causal Models (NCMs) showcased how identification\nand partial identification of causal effects can be automatically carried out\nvia training of neural generative models that respect the constraints encoded\nin a given causal graph [Xia et al. 2022, Balazadeh et al. 2022]. However,\nformal consistency of these methods has only been proven for the case of\ndiscrete variables or only for linear causal models. In this work, we prove\nconsistency of partial identification via NCMs in a general setting with both\ncontinuous and categorical variables. Further, our results highlight the impact\nof the design of the underlying neural network architecture in terms of depth\nand connectivity as well as the importance of applying Lipschitz regularization\nin the training phase. In particular, we provide a counterexample showing that\nwithout Lipschitz regularization the NCM may not be asymptotically consistent.\nOur results are enabled by new results on the approximability of structural\ncausal models via neural generative models, together with an analysis of the\nsample complexity of the resulting architectures and how that translates into\nan error in the constrained optimization problem that defines the partial\nidentification bounds.", "paper_summary_zh": "神經因果模型 (NCM) 的最新進展展示了如何透過訓練符合給定因果圖中編碼約束的神經生成模型，自動執行因果效應的識別和部分識別 [Xia 等人 2022 年，Balazadeh 等人 2022 年]。然而，這些方法的形式一致性僅證明了離散變數或僅線性因果模型的情況。在這項工作中，我們證明了在具有連續和分類變數的通用設定中，透過 NCM 進行部分識別的一致性。此外，我們的結果突出了基礎神經網路架構的設計在深度和連接性方面的影響，以及在訓練階段應用 Lipschitz 正則化的重要性。特別是，我們提供了一個反例，表明在沒有 Lipschitz 正則化的情況下，NCM 可能不會漸近一致。我們的成果得益於透過神經生成模型對結構因果模型近似性的新成果，以及對所得架構的樣本複雜性的分析，以及這如何轉化為定義部分識別邊界的約束最佳化問題中的誤差。", "author": "Jiyuan Tan et.al.", "authors": "Jiyuan Tan, Jose Blanchet, Vasilis Syrgkanis", "id": "2405.15673v1", "paper_url": "http://arxiv.org/abs/2405.15673v1", "repo": "null"}}