{"2406.17241": {"publish_time": "2024-06-25", "title": "What Do the Circuits Mean? A Knowledge Edit View", "paper_summary": "In the field of language model interpretability, circuit discovery is gaining\npopularity. Despite this, the true meaning of these circuits remain largely\nunanswered. We introduce a novel method to learn their meanings as a holistic\nobject through the lens of knowledge editing. We extract circuits in the\nGPT2-XL model using diverse text classification datasets, and use hierarchical\nrelations datasets to explore knowledge editing in the circuits. Our findings\nindicate that these circuits contain entity knowledge but resist new knowledge\nmore than complementary circuits during knowledge editing. Additionally, we\nexamine the impact of circuit size, discovering that an ideal \"theoretical\ncircuit\" where essential knowledge is concentrated likely incorporates more\nthan 5% but less than 50% of the model's parameters. We also assess the overlap\nbetween circuits from different datasets, finding moderate similarities. What\nconstitutes these circuits, then? We find that up to 60% of the circuits\nconsist of layer normalization modules rather than attention or MLP modules,\nadding evidence to the ongoing debates regarding knowledge localization. In\nsummary, our findings offer new insights into the functions of the circuits,\nand introduce research directions for further interpretability and safety\nresearch of language models.", "paper_summary_zh": "在語言模型可解釋性的領域中，電路發現正獲得\n普及。儘管如此，這些電路的真正含義在很大程度上仍未得到解答。我們引入一種新方法，通過知識編輯的視角將它們的含義作為一個整體對象進行學習。我們使用多樣化的文本分類數據集提取 GPT2-XL 模型中的電路，並使用分層關係數據集探索電路中的知識編輯。我們的研究結果表明，這些電路包含實體知識，但在知識編輯過程中比互補電路更抗拒新知識。此外，我們檢查了電路大小的影響，發現了一個理想的「理論電路」，其中集中了必要的知識，可能包含超過 5% 但少於模型參數的 50%。我們還評估了來自不同數據集的電路之間的重疊，發現有中等相似性。那麼，這些電路由什麼組成呢？我們發現，高達 60% 的電路由層歸一化模組組成，而不是注意力或 MLP 模組，這為關於知識本地化的持續爭論提供了證據。總之，我們的研究結果為電路的功能提供了新的見解，並為語言模型的進一步可解釋性和安全性研究引入了研究方向。", "author": "Huaizhi Ge et.al.", "authors": "Huaizhi Ge, Frank Rudzicz, Zining Zhu", "id": "2406.17241v1", "paper_url": "http://arxiv.org/abs/2406.17241v1", "repo": "null"}}