{"2410.22269": {"publish_time": "2024-10-29", "title": "Fourier Head: Helping Large Language Models Learn Complex Probability Distributions", "paper_summary": "As the quality of large language models has improved, there has been\nincreased interest in using them to model non-linguistic tokens. For example,\nthe Decision Transformer recasts agentic decision making as a sequence modeling\nproblem, using a decoder-only LLM to model the distribution over the discrete\naction space for an Atari agent. However, when adapting LLMs to non-linguistic\ndomains, it remains unclear if softmax over discrete bins captures the\ncontinuous structure of the tokens and the potentially complex distributions\nneeded for high quality token generation. We introduce a neural network layer,\nconstructed using Fourier series, which we can easily substitute for any linear\nlayer if we want the outputs to have a more continuous structure. We perform\nextensive analysis on synthetic datasets, as well as on large-scale decision\nmaking and time series forecasting tasks. We also provide theoretical evidence\nthat this layer can better learn signal from data while ignoring high-frequency\nnoise. All of our results support the effectiveness of our proposed Fourier\nhead in scenarios where the underlying data distribution has a natural\ncontinuous structure. For example, the Fourier head improves a Decision\nTransformer agent's returns by 46% on the Atari Seaquest game, and increases a\nstate-of-the-art times series foundation model's forecasting performance by\n3.5% across 20 benchmarks unseen during training.", "paper_summary_zh": "随着大型语言模型的质量不断提高，人们对使用它们来建模非语言标记的兴趣也与日俱增。例如，决策转换器将代理决策制定重新表述为一个序列建模问题，使用仅解码器 LLM 来建模 Atari 代理的离散动作空间上的分布。然而，在将 LLM 调整到非语言域时，对于 softmax 在离散箱上是否捕捉到标记的连续结构以及高品质标记生成所需的潜在复杂分布，目前仍不清楚。我们引入了一个神经网络层，使用傅立叶级数构建，如果我们希望输出具有更连续的结构，我们可以轻松地用它替换任何线性层。我们对合成数据集以及大规模决策制定和时间序列预测任务进行了广泛的分析。我们还提供了理论证据，证明该层可以更好地从数据中学习信号，同时忽略高频噪声。我们的所有结果都支持我们提出的傅立叶头的有效性，在其中底层数据分布具有自然的连续结构的情况下。例如，傅立叶头将决策转换器代理在 Atari Seaquest 游戏中的回报提高了 46%，并在训练期间未看到的 20 个基准测试中将最先进的时间序列基础模型的预测性能提高了 3.5%。", "author": "Nate Gillman et.al.", "authors": "Nate Gillman, Daksh Aggarwal, Michael Freeman, Saurabh Singh, Chen Sun", "id": "2410.22269v1", "paper_url": "http://arxiv.org/abs/2410.22269v1", "repo": "null"}}