{"2501.01658": {"publish_time": "2025-01-03", "title": "EAUWSeg: Eliminating annotation uncertainty in weakly-supervised medical image segmentation", "paper_summary": "Weakly-supervised medical image segmentation is gaining traction as it\nrequires only rough annotations rather than accurate pixel-to-pixel labels,\nthereby reducing the workload for specialists. Although some progress has been\nmade, there is still a considerable performance gap between the label-efficient\nmethods and fully-supervised one, which can be attributed to the uncertainty\nnature of these weak labels. To address this issue, we propose a novel weak\nannotation method coupled with its learning framework EAUWSeg to eliminate the\nannotation uncertainty. Specifically, we first propose the Bounded Polygon\nAnnotation (BPAnno) by simply labeling two polygons for a lesion. Then, the\ntailored learning mechanism that explicitly treat bounded polygons as two\nseparated annotations is proposed to learn invariant feature by providing\nadversarial supervision signal for model training. Subsequently, a\nconfidence-auxiliary consistency learner incorporates with a\nclassification-guided confidence generator is designed to provide reliable\nsupervision signal for pixels in uncertain region by leveraging the feature\npresentation consistency across pixels within the same category as well as\nclass-specific information encapsulated in bounded polygons annotation.\nExperimental results demonstrate that EAUWSeg outperforms existing\nweakly-supervised segmentation methods. Furthermore, compared to\nfully-supervised counterparts, the proposed method not only delivers superior\nperformance but also costs much less annotation workload. This underscores the\nsuperiority and effectiveness of our approach.", "paper_summary_zh": "弱监督医学影像分割正获得关注，因为它只需要粗略的注释，而不是精确的像素到像素标签，从而减少了专家的工作量。尽管取得了一些进展，但在标签高效方法和完全监督方法之间仍然存在相当大的性能差距，这可归因于这些弱标签的不确定性。为了解决这个问题，我们提出了一种新的弱注释方法，并结合其学习框架 EAUWSeg 来消除注释的不确定性。具体来说，我们首先通过简单地为病灶标记两个多边形来提出有界多边形注释 (BPAnno)。然后，提出了将有界多边形明确地视为两个分离注释的定制学习机制，以通过为模型训练提供对抗性监督信号来学习不变特征。随后，置信辅助一致性学习器与分类引导置信度生成器结合设计，以通过利用同一类别内像素的特征表示一致性以及有界多边形注释中封装的特定于类的信息，为不确定区域中的像素提供可靠的监督信号。实验结果表明，EAUWSeg 优于现有的弱监督分割方法。此外，与完全监督的对应方法相比，所提出的方法不仅提供了卓越的性能，而且注释工作量也大大减少。这突出了我们方法的优越性和有效性。", "author": "Wang Lituan et.al.", "authors": "Wang Lituan, Zhang Lei, Wang Yan, Wang Zhenbin, Zhang Zhenwei, Zhang Yi", "id": "2501.01658v1", "paper_url": "http://arxiv.org/abs/2501.01658v1", "repo": "null"}}