{"2405.18910": {"publish_time": "2024-05-29", "title": "Predicting Parking Availability in Singapore with Cross-Domain Data: A New Dataset and A Data-Driven Approach", "paper_summary": "The increasing number of vehicles highlights the need for efficient parking\nspace management. Predicting real-time Parking Availability (PA) can help\nmitigate traffic congestion and the corresponding social problems, which is a\npressing issue in densely populated cities like Singapore. In this study, we\naim to collectively predict future PA across Singapore with complex factors\nfrom various domains. The contributions in this paper are listed as follows:\n(1) A New Dataset: We introduce the \\texttt{SINPA} dataset, containing a year's\nworth of PA data from 1,687 parking lots in Singapore, enriched with various\nspatial and temporal factors. (2) A Data-Driven Approach: We present DeepPA, a\nnovel deep-learning framework, to collectively and efficiently predict future\nPA across thousands of parking lots. (3) Extensive Experiments and Deployment:\nDeepPA demonstrates a 9.2% reduction in prediction error for up to 3-hour\nforecasts compared to existing advanced models. Furthermore, we implement\nDeepPA in a practical web-based platform to provide real-time PA predictions to\naid drivers and inform urban planning for the governors in Singapore. We\nrelease the dataset and source code at https://github.com/yoshall/SINPA.", "paper_summary_zh": "隨著車輛數量增加，凸顯出有效停車空間管理的需求。預測即時停車可用性 (PA) 可有助於緩解交通擁塞和相應的社會問題，這是人口稠密城市（例如新加坡）中的緊迫問題。在本研究中，我們旨在透過來自不同領域的複雜因素，共同預測新加坡未來的 PA。本文的貢獻如下：(1) 新資料集：我們推出 \\texttt{SINPA} 資料集，其中包含新加坡 1,687 個停車場一年的 PA 資料，並豐富了各種空間和時間因素。(2) 資料驅動方法：我們提出 DeepPA，一種新穎的深度學習架構，用於共同且有效預測數千個停車場的未來 PA。(3) 廣泛的實驗和部署：與現有的進階模型相比，DeepPA 展示了預測誤差降低 9.2%，最長可達 3 小時預測。此外，我們在實用的網路平台中實作 DeepPA，以提供即時 PA 預測，協助駕駛並為新加坡的管理者提供城市規劃資訊。我們在 https://github.com/yoshall/SINPA 上釋出資料集和原始碼。", "author": "Huaiwu Zhang et.al.", "authors": "Huaiwu Zhang, Yutong Xia, Siru Zhong, Kun Wang, Zekun Tong, Qingsong Wen, Roger Zimmermann, Yuxuan Liang", "id": "2405.18910v1", "paper_url": "http://arxiv.org/abs/2405.18910v1", "repo": "null"}}