{"2501.18468": {"publish_time": "2025-01-30", "title": "Beyond Instructed Tasks: Recognizing In-the-Wild Reading Behaviors in the Classroom Using Eye Tracking", "paper_summary": "Understanding reader behaviors such as skimming, deep reading, and scanning\nis essential for improving educational instruction. While prior eye-tracking\nstudies have trained models to recognize reading behaviors, they often rely on\ninstructed reading tasks, which can alter natural behaviors and limit the\napplicability of these findings to in-the-wild settings. Additionally, there is\na lack of clear definitions for reading behavior archetypes in the literature.\nWe conducted a classroom study to address these issues by collecting instructed\nand in-the-wild reading data. We developed a mixed-method framework, including\na human-driven theoretical model, statistical analyses, and an AI classifier,\nto differentiate reading behaviors based on their velocity, density, and\nsequentiality. Our lightweight 2D CNN achieved an F1 score of 0.8 for behavior\nrecognition, providing a robust approach for understanding in-the-wild reading.\nThis work advances our ability to provide detailed behavioral insights to\neducators, supporting more targeted and effective assessment and instruction.", "paper_summary_zh": "了解讀者行為，例如瀏覽、深層閱讀和掃描，對於改善教育教學至關重要。雖然先前的眼球追蹤研究已訓練模型來識別閱讀行為，但它們通常依賴於指示性閱讀任務，這可能會改變自然行為並限制這些發現對野外環境的適用性。此外，文獻中缺乏對閱讀行為原型明確的定義。我們進行了一項課堂研究，透過收集指示性和野外閱讀資料來解決這些問題。我們開發了一個混合方法框架，包括人為驅動的理論模型、統計分析和 AI 分類器，根據速度、密度和順序性來區分閱讀行為。我們的輕量級 2D CNN 在行為識別方面達到了 0.8 的 F1 分數，為理解野外閱讀提供了一種強大的方法。這項工作提升了我們向教育工作者提供詳細行為見解的能力，支援更有針對性和更有效的評估和教學。", "author": "Eduardo Davalos et.al.", "authors": "Eduardo Davalos, Jorge Alberto Salas, Yike Zhang, Namrata Srivastava, Yashvitha Thatigotla, Abbey Gonzales, Sara McFadden, Sun-Joo Cho, Gautam Biswas, Amanda Goodwin", "id": "2501.18468v1", "paper_url": "http://arxiv.org/abs/2501.18468v1", "repo": "null"}}