{"2407.06438": {"publish_time": "2024-07-08", "title": "A Single Transformer for Scalable Vision-Language Modeling", "paper_summary": "We present SOLO, a single transformer for Scalable visiOn-Language mOdeling.\nCurrent large vision-language models (LVLMs) such as LLaVA mostly employ\nheterogeneous architectures that connect pre-trained visual encoders with large\nlanguage models (LLMs) to facilitate visual recognition and complex reasoning.\nAlthough achieving remarkable performance with relatively lightweight training,\nwe identify four primary scalability limitations: (1) The visual capacity is\nconstrained by pre-trained visual encoders, which are typically an order of\nmagnitude smaller than LLMs. (2) The heterogeneous architecture complicates the\nuse of established hardware and software infrastructure. (3) Study of scaling\nlaws on such architecture must consider three separate components - visual\nencoder, connector, and LLMs, which complicates the analysis. (4) The use of\nexisting visual encoders typically requires following a pre-defined\nspecification of image inputs pre-processing, for example, by reshaping inputs\nto fixed-resolution square images, which presents difficulties in processing\nand training on high-resolution images or those with unusual aspect ratio. A\nunified single Transformer architecture, like SOLO, effectively addresses these\nscalability concerns in LVLMs; however, its limited adoption in the modern\ncontext likely stems from the absence of reliable training recipes that balance\nboth modalities and ensure stable training for billion-scale models. In this\npaper, we introduce the first open-source training recipe for developing SOLO,\nan open-source 7B LVLM using moderate academic resources. The training recipe\ninvolves initializing from LLMs, sequential pre-training on ImageNet and\nweb-scale data, and instruction fine-tuning on our curated high-quality\ndatasets. On extensive evaluation, SOLO demonstrates performance comparable to\nLLaVA-v1.5-7B, particularly excelling in visual mathematical reasoning.", "paper_summary_zh": "<paragraph>我們提出了 SOLO，一個用於可擴充視覺語言模型的單一Transformer。\n目前的巨量視覺語言模型 (LVLMs)，例如 LLaVA，大多採用異質架構，將預先訓練好的視覺編碼器與巨量語言模型 (LLMs) 連接起來，以促進視覺識別和複雜推理。\n儘管在相對輕量級的訓練中實現了顯著的效能，我們發現了四個主要的擴充性限制：(1) 視覺容量受到預先訓練好的視覺編碼器的限制，而視覺編碼器通常比 LLM 小一個數量級。(2) 異質架構使既有硬體和軟體基礎設施的使用變得複雜。(3) 此類架構上擴充定律的研究必須考量三個獨立的元件，即視覺編碼器、連接器和 LLM，這使得分析變得複雜。(4) 使用現有的視覺編碼器通常需要遵循預先定義的影像輸入前處理規格，例如，將輸入重新調整為固定解析度的正方形影像，這在處理和訓練高解析度影像或具有異常長寬比的影像時會造成困難。統一的單一Transformer架構，例如 SOLO，有效地解決了 LVLMs 中的這些擴充性問題；然而，它在現代環境中的採用有限，這可能是因為缺乏平衡兩種模式並確保十億規模模型穩定訓練的可靠訓練配方。在本文中，我們介紹了第一個用於開發 SOLO 的開源訓練配方，SOLO 是一個使用適度的學術資源的開源 7B LVLM。訓練配方涉及從 LLM 初始化、在 ImageNet 和網路規模資料上進行順序預訓練，以及在我們策劃的高品質資料集上進行指令微調。在廣泛的評估中，SOLO 表現出與 LLaVA-v1.5-7B 相當的效能，特別是在視覺數學推理方面表現出色。</paragraph>", "author": "Yangyi Chen et.al.", "authors": "Yangyi Chen, Xingyao Wang, Hao Peng, Heng Ji", "id": "2407.06438v1", "paper_url": "http://arxiv.org/abs/2407.06438v1", "repo": "https://github.com/yangyi-chen/solo"}}