{"2501.18011": {"publish_time": "2025-01-29", "title": "Anatomy Might Be All You Need: Forecasting What to Do During Surgery", "paper_summary": "Surgical guidance can be delivered in various ways. In neurosurgery, spatial\nguidance and orientation are predominantly achieved through neuronavigation\nsystems that reference pre-operative MRI scans. Recently, there has been\ngrowing interest in providing live guidance by analyzing video feeds from tools\nsuch as endoscopes. Existing approaches, including anatomy detection,\norientation feedback, phase recognition, and visual question-answering,\nprimarily focus on aiding surgeons in assessing the current surgical scene.\nThis work aims to provide guidance on a finer scale, aiming to provide guidance\nby forecasting the trajectory of the surgical instrument, essentially\naddressing the question of what to do next. To address this task, we propose a\nmodel that not only leverages the historical locations of surgical instruments\nbut also integrates anatomical features. Importantly, our work does not rely on\nexplicit ground truth labels for instrument trajectories. Instead, the ground\ntruth is generated by a detection model trained to detect both anatomical\nstructures and instruments within surgical videos of a comprehensive dataset\ncontaining pituitary surgery videos. By analyzing the interaction between\nanatomy and instrument movements in these videos and forecasting future\ninstrument movements, we show that anatomical features are a valuable asset in\naddressing this challenging task. To the best of our knowledge, this work is\nthe first attempt to address this task for manually operated surgeries.", "paper_summary_zh": "手術引導可以用各種方式傳遞。在神經外科手術中，空間引導和定位主要是透過神經導航系統來實現，該系統參考術前 MRI 掃描。最近，人們越來越有興趣透過分析內視鏡等工具的視訊饋送來提供即時引導。現有的方法，包括解剖偵測、方位回饋、相位辨識和視覺問答，主要集中在協助外科醫生評估目前的術中場景。這項工作旨在提供更精細的引導，目標是透過預測手術器械的軌跡來提供引導，基本上是解決下一步該怎麼做的問題。為了解決這項任務，我們提出一個模型，不僅利用手術器械的歷史位置，還整合解剖特徵。重要的是，我們的模型不依賴於器械軌跡的明確真實標籤。相反地，真實標籤是由偵測模型產生的，該模型經過訓練，可以在包含垂體手術視訊的綜合資料集的手術視訊中偵測解剖結構和器械。透過分析這些視訊中解剖結構和器械動作之間的交互作用，並預測未來的器械動作，我們證明了解剖特徵是解決這項具有挑戰性任務的寶貴資產。據我們所知，這項工作是首次嘗試解決人工手術的這項任務。", "author": "Gary Sarwin et.al.", "authors": "Gary Sarwin, Alessandro Carretta, Victor Staartjes, Matteo Zoli, Diego Mazzatenta, Luca Regli, Carlo Serra, Ender Konukoglu", "id": "2501.18011v1", "paper_url": "http://arxiv.org/abs/2501.18011v1", "repo": "null"}}