{"2407.02310": {"publish_time": "2024-07-02", "title": "Evaluating the Ability of LLMs to Solve Semantics-Aware Process Mining Tasks", "paper_summary": "The process mining community has recently recognized the potential of large\nlanguage models (LLMs) for tackling various process mining tasks. Initial\nstudies report the capability of LLMs to support process analysis and even, to\nsome extent, that they are able to reason about how processes work. This latter\nproperty suggests that LLMs could also be used to tackle process mining tasks\nthat benefit from an understanding of process behavior. Examples of such tasks\ninclude (semantic) anomaly detection and next activity prediction, which both\ninvolve considerations of the meaning of activities and their inter-relations.\nIn this paper, we investigate the capabilities of LLMs to tackle such\nsemantics-aware process mining tasks. Furthermore, whereas most works on the\nintersection of LLMs and process mining only focus on testing these models out\nof the box, we provide a more principled investigation of the utility of LLMs\nfor process mining, including their ability to obtain process mining knowledge\npost-hoc by means of in-context learning and supervised fine-tuning.\nConcretely, we define three process mining tasks that benefit from an\nunderstanding of process semantics and provide extensive benchmarking datasets\nfor each of them. Our evaluation experiments reveal that (1) LLMs fail to solve\nchallenging process mining tasks out of the box and when provided only a\nhandful of in-context examples, (2) but they yield strong performance when\nfine-tuned for these tasks, consistently surpassing smaller, encoder-based\nlanguage models.", "paper_summary_zh": "<paragraph>流程挖掘社群最近已意识到大型语言模型 (LLM) 在处理各种流程挖掘任务的潜力。初期研究报告指出，LLM 具有支持流程分析的能力，甚至在一定程度上能够推理流程的工作方式。后一项特性表明，LLM 也可用于处理受益于了解流程行为的流程挖掘任务。此类任务的范例包括（语义）异常检测和下一个活动预测，这两个任务都涉及考虑活动及其相互关系的含义。在本文中，我们调查了 LLM 处理此类语义感知流程挖掘任务的能力。此外，虽然大多数关于 LLM 和流程挖掘交叉点的工作仅专注于开箱即用地测试这些模型，但我们提供了对 LLM 在流程挖掘中的效用的更具原则性的调查，包括它们通过情境学习和监督微调事后获取流程挖掘知识的能力。具体来说，我们定义了三个受益于了解流程语义的流程挖掘任务，并为每个任务提供了广泛的基准数据集。我们的评估实验表明，（1）LLM 无法开箱即用地解决具有挑战性的流程挖掘任务，并且仅在提供少数情境示例时无法解决，（2）但当针对这些任务进行微调时，它们会产生强大的性能，始终优于较小的基于编码器的语言模型。</paragraph>", "author": "Adrian Rebmann et.al.", "authors": "Adrian Rebmann, Fabian David Schmidt, Goran Glavaš, Han van der Aa", "id": "2407.02310v1", "paper_url": "http://arxiv.org/abs/2407.02310v1", "repo": "null"}}