{"2411.10145": {"publish_time": "2024-11-15", "title": "An Effective Framework to Help Large Language Models Handle Numeric-involved Long-context Tasks", "paper_summary": "Large Language Models (LLMs) have demonstrated remarkable capabilities in\nhandling long texts and have almost perfect performance in traditional\nretrieval tasks. However, their performance significantly degrades when it\ncomes to numerical calculations in the long-context. Numeric-involved\nlong-context tasks typically cannot be addressed by current LLMs in normal\nsettings due to their inherent limitations in simultaneously handling complex\nand massive information. Some CoT like prompting methods can improve accuracy\nbut demands massive output tokens, which is costly and slow. To address this\nissue, we propose a workflow, which decompose a numeric-involved long-context\ntask into 4 low-level subtasks: judging, extracting and processing with code\nand conclusion. The former 2 subtasks is relatively simple, which allows us to\nuse smaller models for efficiently processing long context. When numerical\ncalculations are required, we use code generated by LLMs to avoid the\ndisadvantage of LLM not being good at calculations. The results in 2\nnumeric-involved long-context benchmarks demonstrate our workflow can not only\nimprove accuracy, but also significantly reduce the cost of API calls.", "paper_summary_zh": "大型語言模型 (LLM) 在處理長篇文字方面展現出驚人的能力，在傳統的檢索任務中表現近乎完美。然而，在處理長語境中的數值計算時，它們的表現卻大幅下降。由於 LLM 本身在同時處理複雜且大量的資訊時有其限制，因此涉及數值的長語境任務通常無法在正常設定下由目前的 LLM 處理。一些 CoT（例如提示方法）可以提高準確性，但需要大量的輸出 token，這既昂貴又緩慢。為了解決這個問題，我們提出了一個工作流程，將涉及數值的長語境任務分解為 4 個低階子任務：判斷、萃取和處理程式碼以及結論。前 2 個子任務相對簡單，這讓我們得以使用較小的模型來有效處理長語境。當需要數值計算時，我們會使用 LLM 生成的程式碼來避免 LLM 不擅長計算的缺點。在 2 個涉及數值的長語境基準測試中的結果顯示，我們的這個工作流程不僅可以提高準確性，還能大幅降低 API 呼叫的成本。", "author": "Yijiong Yu et.al.", "authors": "Yijiong Yu", "id": "2411.10145v1", "paper_url": "http://arxiv.org/abs/2411.10145v1", "repo": "null"}}