{"2410.17482": {"publish_time": "2024-10-23", "title": "Is artificial intelligence still intelligence? LLMs generalize to novel adjective-noun pairs, but don't mimic the full human distribution", "paper_summary": "Inferences from adjective-noun combinations like \"Is artificial intelligence\nstill intelligence?\" provide a good test bed for LLMs' understanding of meaning\nand compositional generalization capability, since there are many combinations\nwhich are novel to both humans and LLMs but nevertheless elicit convergent\nhuman judgments. We study a range of LLMs and find that the largest models we\ntested are able to draw human-like inferences when the inference is determined\nby context and can generalize to unseen adjective-noun combinations. We also\npropose three methods to evaluate LLMs on these inferences out of context,\nwhere there is a distribution of human-like answers rather than a single\ncorrect answer. We find that LLMs show a human-like distribution on at most\n75\\% of our dataset, which is promising but still leaves room for improvement.", "paper_summary_zh": "從「人工智慧仍是智慧嗎？」等形容詞-名詞組合中推論，可以很好地測試 LLM 對意義的理解和組合概括能力，因為有許多組合對人類和 LLM 來說都是新穎的，但仍然會引發人類的收斂判斷。我們研究了一系列 LLM，發現我們測試過最大的模型能夠在推論由上下文決定的時候得出類似人類的推論，並且可以概括到未見過的形容詞-名詞組合。我們還提出了三種方法來評估 LLM 在這些推論上脫離語境，在這種情況下，人類的答案分佈而不是單一的正確答案。我們發現 LLM 在我們數據集中的 75% 上顯示出類似人類的分布，這很有希望，但仍有改進空間。", "author": "Hayley Ross et.al.", "authors": "Hayley Ross, Kathryn Davidson, Najoung Kim", "id": "2410.17482v1", "paper_url": "http://arxiv.org/abs/2410.17482v1", "repo": "null"}}