{"2412.06724": {"publish_time": "2024-12-09", "title": "AutoDCWorkflow: LLM-based Data Cleaning Workflow Auto-Generation and Benchmark", "paper_summary": "We investigate the reasoning capabilities of large language models (LLMs) for\nautomatically generating data-cleaning workflows. To evaluate LLMs' ability to\ncomplete data-cleaning tasks, we implemented a pipeline for LLM-based Auto Data\nCleaning Workflow (AutoDCWorkflow), prompting LLMs on data cleaning operations\nto repair three types of data quality issues: duplicates, missing values, and\ninconsistent data formats. Given a dirty table and a purpose (expressed as a\nquery), this pipeline generates a minimal, clean table sufficient to address\nthe purpose and the data cleaning workflow used to produce the table. The\nplanning process involves three main LLM-driven components: (1) Select Target\nColumns: Identifies a set of target columns related to the purpose. (2) Inspect\nColumn Quality: Assesses the data quality for each target column and generates\na Data Quality Report as operation objectives. (3) Generate Operation &\nArguments: Predicts the next operation and arguments based on the data quality\nreport results. Additionally, we propose a data cleaning benchmark to evaluate\nthe capability of LLM agents to automatically generate workflows that address\ndata cleaning purposes of varying difficulty levels. The benchmark comprises\nthe annotated datasets as a collection of purpose, raw table, clean table, data\ncleaning workflow, and answer set. In our experiments, we evaluated three LLMs\nthat auto-generate purpose-driven data cleaning workflows. The results indicate\nthat LLMs perform well in planning and generating data-cleaning workflows\nwithout the need for fine-tuning.", "paper_summary_zh": "<paragraph>我們調查大型語言模型 (LLM) 的推理能力，以自動產生資料清理工作流程。為評估 LLM 完成資料清理任務的能力，我們實作了一個基於 LLM 的自動資料清理工作流程 (AutoDCWorkflow) 管道，提示 LLM 進行資料清理操作，以修復三種類型的資料品質問題：重複、遺失值和不一致的資料格式。給定一個髒資料表和一個目的 (表示為查詢)，此管道會產生一個最小的乾淨資料表，足以解決目的和用於產生資料表的資料清理工作流程。規劃流程包含三個主要的 LLM 驅動元件：(1) 選擇目標欄位：識別一組與目的相關的目標欄位。(2) 檢查欄位品質：評估每個目標欄位的資料品質，並產生資料品質報告作為操作目標。(3) 產生操作和參數：根據資料品質報告結果預測下一個操作和參數。此外，我們提出一個資料清理基準，以評估 LLM 代理自動產生工作流程的能力，以解決不同難度層級的資料清理目的。基準包含註解資料集，作為目的、原始資料表、乾淨資料表、資料清理工作流程和答案集的集合。在我們的實驗中，我們評估了三個自動產生以目的為導向的資料清理工作流程的 LLM。結果表明，LLM 在規劃和產生資料清理工作流程方面表現良好，無需微調。</paragraph>", "author": "Lan Li et.al.", "authors": "Lan Li, Liri Fang, Vetle I. Torvik", "id": "2412.06724v1", "paper_url": "http://arxiv.org/abs/2412.06724v1", "repo": "null"}}