{"2407.13313": {"publish_time": "2024-07-18", "title": "Sortability of Time Series Data", "paper_summary": "Evaluating the performance of causal discovery algorithms that aim to find\ncausal relationships between time-dependent processes remains a challenging\ntopic. In this paper, we show that certain characteristics of datasets, such as\nvarsortability (Reisach et al. 2021) and $R^2$-sortability (Reisach et al.\n2023), also occur in datasets for autocorrelated stationary time series. We\nillustrate this empirically using four types of data: simulated data based on\nSVAR models and Erd\\H{o}s-R\\'enyi graphs, the data used in the 2019\ncausality-for-climate challenge (Runge et al. 2019), real-world river stream\ndatasets, and real-world data generated by the Causal Chamber of (Gamella et\nal. 2024). To do this, we adapt var- and $R^2$-sortability to time series data.\nWe also investigate the extent to which the performance of score-based causal\ndiscovery methods goes hand in hand with high sortability. Arguably, our most\nsurprising finding is that the investigated real-world datasets exhibit high\nvarsortability and low $R^2$-sortability indicating that scales may carry a\nsignificant amount of causal information.", "paper_summary_zh": "評估旨在找出時間相關程序之間因果關係的因果發現演算法的效能，仍然是一個具有挑戰性的主題。在本文中，我們展示了資料集的某些特徵，例如變異排序（Reisach 等人 2021 年）和 R2 排序（Reisach 等人 2023 年），也出現在自相關平穩時間序列的資料集中。我們使用四種類型的資料以實證方式說明這一點：基於 SVAR 模型和 Erd\\H{o}s-R\\'enyi 圖形模擬的資料、2019 年因果關係氣候挑戰（Runge 等人 2019 年）中使用的資料、真實世界的河流串流資料集，以及由因果室（Gamella 等人 2024 年）產生的真實世界資料。為此，我們將變異和 R2 排序調整為時間序列資料。我們還探討了基於分數的因果發現方法的效能與高排序性之間的關係。可以說，我們最令人驚訝的發現是，所研究的真實世界資料集展現出高變異排序和低 R2 排序，這表示尺度可能承載大量的因果資訊。", "author": "Christopher Lohse et.al.", "authors": "Christopher Lohse, Jonas Wahl", "id": "2407.13313v1", "paper_url": "http://arxiv.org/abs/2407.13313v1", "repo": "null"}}