{"2501.03486": {"publish_time": "2025-01-07", "title": "Align-Pro: A Principled Approach to Prompt Optimization for LLM Alignment", "paper_summary": "The alignment of large language models (LLMs) with human values is critical\nas these models become increasingly integrated into various societal and\ndecision-making processes. Traditional methods, such as reinforcement learning\nfrom human feedback (RLHF), achieve alignment by fine-tuning model parameters,\nbut these approaches are often computationally expensive and impractical when\nmodels are frozen or inaccessible for parameter modification. In contrast,\nprompt optimization is a viable alternative to RLHF for LLM alignment. While\nthe existing literature has shown empirical promise of prompt optimization, its\ntheoretical underpinning remains under-explored. We address this gap by\nformulating prompt optimization as an optimization problem and try to provide\ntheoretical insights into the optimality of such a framework. To analyze the\nperformance of the prompt optimization, we study theoretical suboptimality\nbounds and provide insights in terms of how prompt optimization depends upon\nthe given prompter and target model. We also provide empirical validation\nthrough experiments on various datasets, demonstrating that prompt optimization\ncan effectively align LLMs, even when parameter fine-tuning is not feasible.", "paper_summary_zh": "大型語言模型 (LLM) 與人類價值觀的契合度至關重要，因為這些模型正逐漸整合到各種社會和決策制定過程中。傳統方法，例如人類回饋強化學習 (RLHF)，透過微調模型參數來達成契合度，但這些方法在模型凍結或無法存取參數修改時，通常在運算上很昂貴且不切實際。相比之下，提示最佳化是 LLM 契合度 RLHF 的可行替代方案。儘管現有文獻顯示提示最佳化的經驗承諾，但其理論基礎仍未充分探討。我們透過將提示最佳化制定為最佳化問題來解決此差距，並試圖提供此類架構最佳性的理論見解。為了分析提示最佳化的效能，我們研究了理論次最佳性界限，並提供提示最佳化如何依賴於給定的提示者和目標模型的見解。我們也透過在各種資料集上進行實驗提供經驗驗證，證明即使無法進行參數微調，提示最佳化也能有效契合 LLM。", "author": "Prashant Trivedi et.al.", "authors": "Prashant Trivedi, Souradip Chakraborty, Avinash Reddy, Vaneet Aggarwal, Amrit Singh Bedi, George K. Atia", "id": "2501.03486v1", "paper_url": "http://arxiv.org/abs/2501.03486v1", "repo": "null"}}