{"2405.06363": {"publish_time": "2024-05-10", "title": "Projection by Convolution: Optimal Sample Complexity for Reinforcement Learning in Continuous-Space MDPs", "paper_summary": "We consider the problem of learning an $\\varepsilon$-optimal policy in a\ngeneral class of continuous-space Markov decision processes (MDPs) having\nsmooth Bellman operators. Given access to a generative model, we achieve\nrate-optimal sample complexity by performing a simple, \\emph{perturbed} version\nof least-squares value iteration with orthogonal trigonometric polynomials as\nfeatures. Key to our solution is a novel projection technique based on ideas\nfrom harmonic analysis. Our~$\\widetilde{\\mathcal{O}}(\\epsilon^{-2-d/(\\nu+1)})$\nsample complexity, where $d$ is the dimension of the state-action space and\n$\\nu$ the order of smoothness, recovers the state-of-the-art result of\ndiscretization approaches for the special case of Lipschitz MDPs $(\\nu=0)$. At\nthe same time, for $\\nu\\to\\infty$, it recovers and greatly generalizes the\n$\\mathcal{O}(\\epsilon^{-2})$ rate of low-rank MDPs, which are more amenable to\nregression approaches. In this sense, our result bridges the gap between two\npopular but conflicting perspectives on continuous-space MDPs.", "paper_summary_zh": "我們考慮在具有平滑 Bellman 算子的連續空間馬可夫決策過程 (MDP) 的一般類別中學習 $\\varepsilon$-最優策略的問題。透過取得生成模型，我們透過執行一個簡單的、正交三角多項式作為特徵的「攝動」版本最小平方值迭代來達成速率最優樣本複雜度。我們解決方案的關鍵在於一種基於調和分析概念的新穎投影技術。我們的 $\\widetilde{\\mathcal{O}}(\\epsilon^{-2-d/(\\nu+1)})$ 樣本複雜度，其中 $d$ 是狀態動作空間的維度，而 $\\nu$ 是平滑度順序，會在 Lipschitz MDP（$\\nu=0$）的特例中恢復離散化方法的最新結果。同時，對於 $\\nu\\to\\infty$，它會恢復並大幅概括低秩 MDP 的 $\\mathcal{O}(\\epsilon^{-2})$ 速率，而低秩 MDP 更適用於回歸方法。在這個意義上，我們的結果彌合了兩種流行但相互矛盾的連續空間 MDP 觀點之間的差距。", "author": "Davide Maran et.al.", "authors": "Davide Maran, Alberto Maria Metelli, Matteo Papini, Marcello Restelli", "id": "2405.06363v1", "paper_url": "http://arxiv.org/abs/2405.06363v1", "repo": "null"}}