{"2406.14504": {"publish_time": "2024-06-20", "title": "Translating Across Cultures: LLMs for Intralingual Cultural Adaptation", "paper_summary": "LLMs are increasingly being deployed for multilingual applications and have\ndemonstrated impressive translation capabilities between several low and high\nresource languages. An aspect of translation that often gets overlooked is that\nof cultural adaptation, or modifying source culture references to suit the\ntarget culture. Cultural adaptation has applications across several creative\nindustries and requires intimate knowledge of source and target cultures during\ntranslation. While specialized translation models still outperform LLMs on the\nmachine translation task when viewed from the lens of correctness, they are not\nsensitive to cultural differences often requiring manual correction. LLMs on\nthe other hand have a rich reservoir of cultural knowledge embedded within its\nparameters that can be potentially exploited for such applications. In this\npaper we define the task of cultural adaptation and create an evaluation\nframework to benchmark different models for this task. We evaluate the\nperformance of modern LLMs for cultural adaptation and analyze their cross\ncultural knowledge while connecting related concepts across different cultures.\nWe also analyze possible issues with automatic adaptation including cultural\nbiases and stereotypes. We hope that this task will offer more insight into the\ncultural understanding of LLMs and their creativity in cross-cultural\nscenarios.", "paper_summary_zh": "大型語言模型正越來越廣泛地部署於多語言應用程式中，並已展現出令人印象深刻的翻譯能力，支援多種低資源和高資源語言。翻譯中經常被忽略的一項面向是文化改編，或修改原始文化的參照以符合目標文化。文化改編在多個創意產業中都有應用，且在翻譯過程中需要對原始文化和目標文化有深入的了解。雖然從正確性的角度來看，專門的翻譯模型在機器翻譯任務上仍優於大型語言模型，但它們對文化差異不敏感，通常需要手動更正。另一方面，大型語言模型在其參數中蘊含豐富的文化知識儲備，可潛在用於此類應用程式。在本文中，我們定義文化改編任務，並建立一個評估架構來評量不同模型執行此任務的表現。我們評估現代大型語言模型在文化改編方面的表現，並分析它們的跨文化知識，同時連結不同文化中的相關概念。我們也分析自動改編可能出現的問題，包括文化偏見和刻板印象。我們希望此任務能更深入了解大型語言模型的文化理解，以及它們在跨文化情境中的創造力。", "author": "Pushpdeep Singh et.al.", "authors": "Pushpdeep Singh, Mayur Patidar, Lovekesh Vig", "id": "2406.14504v1", "paper_url": "http://arxiv.org/abs/2406.14504v1", "repo": "null"}}