{"2501.05213": {"publish_time": "2025-01-09", "title": "GLaM-Sign: Greek Language Multimodal Lip Reading with Integrated Sign Language Accessibility", "paper_summary": "The Greek Language Multimodal Lip Reading with Integrated Sign Language\nAccessibility (GLaM-Sign) [1] is a groundbreaking resource in accessibility and\nmultimodal AI, designed to support Deaf and Hard-of-Hearing (DHH) individuals.\nDeveloped from the FEELIT project [2], it integrates high-resolution audio,\nvideo, textual transcriptions, and Greek Sign Language translations for\napplications like real-time sign language translation and enhanced subtitle\nsynchronization. While its primary focus is on promoting inclusivity in the\nGreek tourism sector, its adaptability extends to education, healthcare, and\npublic services. Future advancements will enhance word-level precision and\nscalability to additional languages, supported by advanced AI methodologies and\ncollaborations with diverse stakeholders. This dataset underscores the\ntransformative potential of multimodal resources in bridging communication\ngaps, fostering innovation, and setting a benchmark for ethical AI and\ninclusive technologies.", "paper_summary_zh": "希臘語多模態唇讀與手語整合無障礙（GLaM-Sign）[1] 是無障礙和多模態人工智慧的突破性資源，旨在支援聾人和聽力障礙（DHH）人士。它由 FEELIT 專案 [2] 開發，整合了高解析度音訊、影片、文字轉錄和希臘手語翻譯，可用於即時手語翻譯和增強字幕同步等應用程式。雖然其主要重點是促進希臘旅遊業的包容性，但它的適用性也延伸到教育、醫療保健和公共服務。未來的進展將透過先進的人工智慧方法和與不同利害關係人的合作，提升字元級精準度和擴充到其他語言。此資料集突顯了多模態資源在彌合溝通鴻溝、促進創新以及為道德人工智慧和包容性技術設定基準方面的變革潛力。", "author": "Dimitris Kouremenos et.al.", "authors": "Dimitris Kouremenos, Klimis Ntalianis", "id": "2501.05213v1", "paper_url": "http://arxiv.org/abs/2501.05213v1", "repo": "null"}}