{"2502.04242": {"publish_time": "2025-02-06", "title": "A Theoretical Framework for Data Efficient Multi-Source Transfer Learning Based on Cramér-Rao Bound", "paper_summary": "Multi-source transfer learning provides an effective solution to data\nscarcity in real-world supervised learning scenarios by leveraging multiple\nsource tasks. In this field, existing works typically use all available samples\nfrom sources in training, which constrains their training efficiency and may\nlead to suboptimal results. To address this, we propose a theoretical framework\nthat answers the question: what is the optimal quantity of source samples\nneeded from each source task to jointly train the target model? Specifically,\nwe introduce a generalization error measure that aligns with cross-entropy\nloss, and minimize it based on the Cram\\'er-Rao Bound to determine the optimal\ntransfer quantity for each source task. Additionally, we develop an\narchitecture-agnostic and data-efficient algorithm OTQMS to implement our\ntheoretical results for training deep multi-source transfer learning models.\nExperimental studies on diverse architectures and two real-world benchmark\ndatasets show that our proposed algorithm significantly outperforms\nstate-of-the-art approaches in both accuracy and data efficiency. The code and\nsupplementary materials are available in\nhttps://anonymous.4open.science/r/Materials.", "paper_summary_zh": "多源迁移学习通过利用多源任务为现实世界中的监督学习场景中的数据稀缺性提供了有效的解决方案。在这个领域，现有工作通常在训练中使用来自源的所有可用样本，这限制了它们的训练效率，并且可能导致次优结果。为了解决这个问题，我们提出了一个理论框架来回答以下问题：联合训练目标模型时，需要从每个源任务中获取多少最优数量的源样本？具体来说，我们引入了一个与交叉熵损失一致的泛化误差度量，并基于 Cramér-Rao 界对其进行最小化，以确定每个源任务的最优传输量。此外，我们开发了一个与架构无关且数据高效的算法 OTQMS，以实现我们的理论结果，用于训练深度多源迁移学习模型。在各种架构和两个真实世界基准数据集上的实验研究表明，我们提出的算法在准确性和数据效率方面都明显优于最先进的方法。代码和补充材料可在 https://anonymous.4open.science/r/Materials 中获得。", "author": "Qingyue Zhang et.al.", "authors": "Qingyue Zhang, Haohao Fu, Guanbo Huang, Yaoyuan Liang, Chang Chu, Tianren Peng, Yanru Wu, Qi Li, Yang Li, Shao-Lun Huang", "id": "2502.04242v1", "paper_url": "http://arxiv.org/abs/2502.04242v1", "repo": "null"}}