{"2501.01257": {"publish_time": "2025-01-02", "title": "CodeElo: Benchmarking Competition-level Code Generation of LLMs with Human-comparable Elo Ratings", "paper_summary": "With the increasing code reasoning capabilities of existing large language\nmodels (LLMs) and breakthroughs in reasoning models like OpenAI o1 and o3,\nthere is a growing need to develop more challenging and comprehensive\nbenchmarks that effectively test their sophisticated competition-level coding\nabilities. Existing benchmarks, like LiveCodeBench and USACO, fall short due to\nthe unavailability of private test cases, lack of support for special judges,\nand misaligned execution environments. To bridge this gap, we introduce\nCodeElo, a standardized competition-level code generation benchmark that\neffectively addresses all these challenges for the first time. CodeElo\nbenchmark is mainly based on the official CodeForces platform and tries to\nalign with the platform as much as possible. We compile the recent six months\nof contest problems on CodeForces with detailed information such as contest\ndivisions, problem difficulty ratings, and problem algorithm tags. We introduce\na unique judging method in which problems are submitted directly to the\nplatform and develop a reliable Elo rating calculation system that aligns with\nthe platform and is comparable with human participants but has lower variance.\nBy testing on our CodeElo, we provide the Elo ratings of 30 existing popular\nopen-source and 3 proprietary LLMs for the first time. The results show that\no1-mini and QwQ-32B-Preview stand out significantly, achieving Elo ratings of\n1578 and 1261, respectively, while other models struggle even with the easiest\nproblems, placing in the lowest 25 percent among all human participants.\nDetailed analysis experiments are also conducted to provide insights into\nperformance across algorithms and comparisons between using C++ and Python,\nwhich can suggest directions for future studies.", "paper_summary_zh": "<paragraph>隨著現有大語言模型 (LLM) 的程式碼推理能力不斷提升，以及 OpenAI o1 和 o3 等推理模型的突破，越來越需要開發更具挑戰性和全面性的基準，以有效測試其複雜的競賽級程式編碼能力。現有的基準，例如 LiveCodeBench 和 USACO，由於缺乏私人測試案例、缺乏對特殊評審的支持以及執行環境不一致，因此無法達到要求。為了彌補這一差距，我們引入了 CodeElo，這是一個標準化的競賽級程式碼生成基準，首次有效地應對了所有這些挑戰。CodeElo 基準主要基於官方的 CodeForces 平台，並盡可能與該平台保持一致。我們編譯了 CodeForces 近六個月的競賽題目，並附有詳細資訊，例如競賽組別、題目難度評級和題目演算法標籤。我們引入了一種獨特的評審方法，其中題目直接提交到平台，並開發了一個可靠的 Elo 評分計算系統，該系統與平台保持一致，並且可以與人類參與者相比較，但變異性較低。通過在我們的 CodeElo 上進行測試，我們首次提供了 30 個現有流行開源和 3 個專有 LLM 的 Elo 評分。結果表明，o1-mini 和 QwQ-32B-Preview 顯著脫穎而出，分別獲得了 1578 和 1261 的 Elo 評分，而其他模型甚至在最簡單的題目上也難以應對，在所有人類參與者中排名最低的 25%。還進行了詳細的分析實驗，以深入了解演算法的效能，以及使用 C++ 和 Python 之間的比較，這可以為未來的研究提供方向。</paragraph>", "author": "Shanghaoran Quan et.al.", "authors": "Shanghaoran Quan, Jiaxi Yang, Bowen Yu, Bo Zheng, Dayiheng Liu, An Yang, Xuancheng Ren, Bofei Gao, Yibo Miao, Yunlong Feng, Zekun Wang, Jian Yang, Zeyu Cui, Yang Fan, Yichang Zhang, Binyuan Hui, Junyang Lin", "id": "2501.01257v2", "paper_url": "http://arxiv.org/abs/2501.01257v2", "repo": "null"}}