{"2406.11736": {"publish_time": "2024-06-17", "title": "Interactive Evolution: A Neural-Symbolic Self-Training Framework For Large Language Models", "paper_summary": "One of the primary driving forces contributing to the superior performance of\nLarge Language Models (LLMs) is the extensive availability of human-annotated\nnatural language data, which is used for alignment fine-tuning. This inspired\nresearchers to investigate self-training methods to mitigate the extensive\nreliance on human annotations. However, the current success of self-training\nhas been primarily observed in natural language scenarios, rather than in the\nincreasingly important neural-symbolic scenarios. To this end, we propose an\nenvironment-guided neural-symbolic self-training framework named ENVISIONS. It\naims to overcome two main challenges: (1) the scarcity of symbolic data, and\n(2) the limited proficiency of LLMs in processing symbolic language. Extensive\nevaluations conducted on three distinct domains demonstrate the effectiveness\nof our approach. Additionally, we have conducted a comprehensive analysis to\nuncover the factors contributing to ENVISIONS's success, thereby offering\nvaluable insights for future research in this area. Code will be available at\n\\url{https://github.com/xufangzhi/ENVISIONS}.", "paper_summary_zh": "大型語言模型 (LLM) 效能卓越，其中一項主要驅動力在於大量可供取得的人工標註自然語言資料，這些資料用於比對微調。這啟發研究人員探究自訓練方法，以減輕對人工標註的廣泛依賴。然而，自訓練目前的成功主要見於自然語言場景，而非日益重要的神經符號場景。有鑑於此，我們提出一個名為 ENVISIONS 的環境引導神經符號自訓練架構。其目標是克服兩項主要挑戰：(1) 符號資料的稀少性，以及 (2) LLM 處理符號語言的熟練度有限。在三個不同領域進行的廣泛評估證明了我們方法的有效性。此外，我們進行了全面分析，以找出促成 ENVISIONS 成功的原因，進而為此領域的未來研究提供寶貴見解。程式碼將於\\url{https://github.com/xufangzhi/ENVISIONS} 提供。", "author": "Fangzhi Xu et.al.", "authors": "Fangzhi Xu, Qiushi Sun, Kanzhi Cheng, Jun Liu, Yu Qiao, Zhiyong Wu", "id": "2406.11736v1", "paper_url": "http://arxiv.org/abs/2406.11736v1", "repo": "null"}}