{"2312.02364": {"publish_time": "2023-12-04", "title": "Class-Discriminative Attention Maps for Vision Transformers", "paper_summary": "Importance estimators are explainability methods that quantify feature\nimportance for deep neural networks (DNN). In vision transformers (ViT), the\nself-attention mechanism naturally leads to attention maps, which are sometimes\ninterpreted as importance scores that indicate which input features ViT models\nare focusing on. However, attention maps do not account for signals from\ndownstream tasks. To generate explanations that are sensitive to downstream\ntasks, we have developed class-discriminative attention maps (CDAM), a\ngradient-based extension that estimates feature importance with respect to a\nknown class or a latent concept. CDAM scales attention scores by how relevant\nthe corresponding tokens are for the predictions of a classifier head. In\naddition to targeting the supervised classifier, CDAM can explain an arbitrary\nconcept shared by selected samples by measuring similarity in the latent space\nof ViT. Additionally, we introduce Smooth CDAM and Integrated CDAM, which\naverage a series of CDAMs with slightly altered tokens. Our quantitative\nbenchmarks include correctness, compactness, and class sensitivity, in\ncomparison to 7 other importance estimators. Vanilla, Smooth, and Integrated\nCDAM excel across all three benchmarks. In particular, our results suggest that\nexisting importance estimators may not provide sufficient class-sensitivity. We\ndemonstrate the utility of CDAM in medical images by training and explaining\nmalignancy and biomarker prediction models based on lung Computed Tomography\n(CT) scans. Overall, CDAM is shown to be highly class-discriminative and\nsemantically relevant, while providing compact explanations.", "paper_summary_zh": "<paragraph>重要性估計器是一種可解釋性方法，用於量化深度神經網路 (DNN) 的特徵重要性。在視覺Transformer (ViT) 中，自我注意機制自然會導致注意力圖，有時會將其解釋為重要性分數，表示 ViT 模型關注哪些輸入特徵。然而，注意力圖並未考慮來自下游任務的信號。為了產生對下游任務敏感的解釋，我們開發了類別區分注意力圖 (CDAM)，這是一種基於梯度的擴充，用於估計相對於已知類別或潛在概念的特徵重要性。CDAM 根據對應的符號與分類器頭的預測相關程度，調整注意力分數。除了針對監督分類器外，CDAM 還可以通過測量 ViT 的潛在空間中的相似性來解釋選定樣本共有的任意概念。此外，我們引入了平滑 CDAM 和積分 CDAM，它們對一系列具有略微改變的符號的 CDAM 進行平均。我們的量化基準包括正確性、緊湊性和類別敏感性，與其他 7 個重要性估計器相比。香草、平滑和積分 CDAM 在所有三個基準中表現出色。特別是，我們的結果表明現有的重要性估計器可能無法提供足夠的類別敏感性。我們通過基於肺部電腦斷層掃描 (CT) 掃描訓練和解釋惡性腫瘤和生物標記預測模型，證明了 CDAM 在醫學影像中的效用。總的來說，CDAM 被證明具有高度類別區分性和語義相關性，同時提供簡潔的解釋。</paragraph>", "author": "Lennart Brocki et.al.", "authors": "Lennart Brocki, Jakub Binda, Neo Christopher Chung", "id": "2312.02364v3", "paper_url": "http://arxiv.org/abs/2312.02364v3", "repo": "null"}}