{"2504.07422": {"publish_time": "2025-04-10", "title": "The Role of Machine Learning in Reducing Healthcare Costs: The Impact of Medication Adherence and Preventive Care on Hospitalization Expenses", "paper_summary": "This study reveals the important role of prevention care and medication\nadherence in reducing hospitalizations. By using a structured dataset of 1,171\npatients, four machine learning models Logistic Regression, Gradient Boosting,\nRandom Forest, and Artificial Neural Networks are applied to predict five-year\nhospitalization risk, with the Gradient Boosting model achieving the highest\naccuracy of 81.2%. The result demonstrated that patients with high medication\nadherence and consistent preventive care can reduce 38.3% and 37.7% in\nhospitalization risk. The finding also suggests that targeted preventive care\ncan have positive Return on Investment (ROI), and therefore ML models can\neffectively direct personalized interventions and contribute to long-term\nmedical savings.", "paper_summary_zh": "這項研究揭示了預防性照護和藥物依從性在減少住院方面的重要作用。通過使用包含 1,171 名患者的結構化數據集，應用邏輯迴歸、梯度提升、隨機森林和人工神經網絡四種機器學習模型來預測五年住院風險，其中梯度提升模型的準確率最高，達到 81.2%。結果表明，藥物依從性高且持續接受預防性照護的患者，住院風險可分別降低 38.3% 和 37.7%。研究結果還表明，有針對性的預防性照護可以帶來正向的投資回報率 (ROI)，因此機器學習模型可以有效地指導個人化干預措施，並有助於長期醫療成本的節省。\n", "author": "Yixin Zhang et.al.", "authors": "Yixin Zhang, Yisong Chen", "id": "2504.07422v1", "paper_url": "http://arxiv.org/abs/2504.07422v1", "repo": "null"}}