{"2502.17394": {"publish_time": "2025-02-24", "title": "FIG: Forward-Inverse Generation for Low-Resource Domain-specific Event Detection", "paper_summary": "Event Detection (ED) is the task of identifying typed event mentions of\ninterest from natural language text, which benefits domain-specific reasoning\nin biomedical, legal, and epidemiological domains. However, procuring\nsupervised data for thousands of events for various domains is a laborious and\nexpensive task. To this end, existing works have explored synthetic data\ngeneration via forward (generating labels for unlabeled sentences) and inverse\n(generating sentences from generated labels) generations. However, forward\ngeneration often produces noisy labels, while inverse generation struggles with\ndomain drift and incomplete event annotations. To address these challenges, we\nintroduce FIG, a hybrid approach that leverages inverse generation for\nhigh-quality data synthesis while anchoring it to domain-specific cues\nextracted via forward generation on unlabeled target data. FIG further enhances\nits synthetic data by adding missing annotations through forward\ngeneration-based refinement. Experimentation on three ED datasets from diverse\ndomains reveals that FIG outperforms the best baseline achieving average gains\nof 3.3% F1 and 5.4% F1 in the zero-shot and few-shot settings respectively.\nAnalyzing the generated trigger hit rate and human evaluation substantiates\nFIG's superior domain alignment and data quality compared to existing\nbaselines.", "paper_summary_zh": "事件偵測 (ED) 是一項任務，用於識別自然語言文字中感興趣的已輸入事件提及，這有助於生物醫學、法律和流行病學領域的特定領域推理。然而，為各種領域的數千個事件採購監督資料是一項費力且昂貴的任務。為此，現有著作已透過正向 (為未標記句子產生標籤) 和反向 (從產生的標籤產生句子) 產生探索合成資料。然而，正向產生通常會產生雜訊標籤，而反向產生則會與領域漂移和不完整的事件標註奮戰。為了應對這些挑戰，我們引入了 FIG，這是一種混合方法，它利用反向產生進行高品質資料合成，同時將其錨定到透過未標記目標資料的正向產生所提取的特定領域提示。FIG 進一步透過加入透過正向產生為基礎的改進來增強其合成資料，以增加遺失的標註。對來自不同領域的三個 ED 資料集的實驗顯示，FIG 優於最佳基準，分別在零次學習和少次學習設定中獲得平均 3.3% F1 和 5.4% F1 的增益。分析產生的觸發命中率和人工評估證實了 FIG 與現有基準相比，具有優異的領域比對和資料品質。", "author": "Tanmay Parekh et.al.", "authors": "Tanmay Parekh, Yuxuan Dong, Lucas Bandarkar, Artin Kim, I-Hung Hsu, Kai-Wei Chang, Nanyun Peng", "id": "2502.17394v1", "paper_url": "http://arxiv.org/abs/2502.17394v1", "repo": "null"}}