{"2405.16402": {"publish_time": "2024-05-26", "title": "Assessing Empathy in Large Language Models with Real-World Physician-Patient Interactions", "paper_summary": "The integration of Large Language Models (LLMs) into the healthcare domain\nhas the potential to significantly enhance patient care and support through the\ndevelopment of empathetic, patient-facing chatbots. This study investigates an\nintriguing question Can ChatGPT respond with a greater degree of empathy than\nthose typically offered by physicians? To answer this question, we collect a\nde-identified dataset of patient messages and physician responses from Mayo\nClinic and generate alternative replies using ChatGPT. Our analyses incorporate\nnovel empathy ranking evaluation (EMRank) involving both automated metrics and\nhuman assessments to gauge the empathy level of responses. Our findings\nindicate that LLM-powered chatbots have the potential to surpass human\nphysicians in delivering empathetic communication, suggesting a promising\navenue for enhancing patient care and reducing professional burnout. The study\nnot only highlights the importance of empathy in patient interactions but also\nproposes a set of effective automatic empathy ranking metrics, paving the way\nfor the broader adoption of LLMs in healthcare.", "paper_summary_zh": "大型語言模型 (LLM) 整合到醫療領域中，有潛力透過開發同理心、面向病患的聊天機器人來大幅提升病患照護和支持。本研究探討了一個引人入勝的問題：ChatGPT 能否比一般醫生提供更多同理心的回應？為了回答這個問題，我們收集了一組來自梅約診所的去識別化病患訊息和醫生回應資料集，並使用 ChatGPT 產生替代回應。我們的分析結合了新穎的同理心排名評估 (EMRank)，其中包含自動化指標和人為評估，以評量回應的同理心程度。我們的研究結果顯示，LLM 驅動的聊天機器人有潛力在提供同理心溝通方面超越人類醫生，這暗示了一條提升病患照護和減少專業倦怠的潛在途徑。本研究不僅強調了同理心在病患互動中的重要性，也提出了一組有效的自動同理心排名指標，為 LLM 在醫療保健領域的更廣泛採用鋪路。", "author": "Man Luo et.al.", "authors": "Man Luo, Christopher J. Warren, Lu Cheng, Haidar M. Abdul-Muhsin, Imon Banerjee", "id": "2405.16402v1", "paper_url": "http://arxiv.org/abs/2405.16402v1", "repo": "null"}}