{"2407.12449": {"publish_time": "2024-07-17", "title": "Close the Sim2real Gap via Physically-based Structured Light Synthetic Data Simulation", "paper_summary": "Despite the substantial progress in deep learning, its adoption in industrial\nrobotics projects remains limited, primarily due to challenges in data\nacquisition and labeling. Previous sim2real approaches using domain\nrandomization require extensive scene and model optimization. To address these\nissues, we introduce an innovative physically-based structured light simulation\nsystem, generating both RGB and physically realistic depth images, surpassing\nprevious dataset generation tools. We create an RGBD dataset tailored for\nrobotic industrial grasping scenarios and evaluate it across various tasks,\nincluding object detection, instance segmentation, and embedding sim2real\nvisual perception in industrial robotic grasping. By reducing the sim2real gap\nand enhancing deep learning training, we facilitate the application of deep\nlearning models in industrial settings. Project details are available at\nhttps://baikaixinpublic.github.io/structured light 3D synthesizer/.", "paper_summary_zh": "儘管深度學習有顯著進展，但其在產業機器人專案中的採用仍然有限，這主要是由於在資料取得和標籤化方面的挑戰。先前使用網域隨機化的 sim2real 方法需要廣泛的場景和模型最佳化。為了解決這些問題，我們引進了一個創新的基於物理結構光模擬系統，它可以產生 RGB 和物理上逼真的深度影像，超越了先前的資料集產生工具。我們建立了一個專門針對機器人產業抓取場景的 RGBD 資料集，並在各種任務中對其進行評估，包括物體偵測、實例分割，以及將 sim2real 視覺感知嵌入到產業機器人抓取中。透過縮小 sim2real 的差距並增強深度學習訓練，我們促進了深度學習模型在產業環境中的應用。專案詳細資訊可見於 https://baikaixinpublic.github.io/structured light 3D synthesizer/。", "author": "Kaixin Bai et.al.", "authors": "Kaixin Bai, Lei Zhang, Zhaopeng Chen, Fang Wan, Jianwei Zhang", "id": "2407.12449v1", "paper_url": "http://arxiv.org/abs/2407.12449v1", "repo": "null"}}