{"2409.12033": {"publish_time": "2024-09-18", "title": "Topological Deep Learning with State-Space Models: A Mamba Approach for Simplicial Complexes", "paper_summary": "Graph Neural Networks based on the message-passing (MP) mechanism are a\ndominant approach for handling graph-structured data. However, they are\ninherently limited to modeling only pairwise interactions, making it difficult\nto explicitly capture the complexity of systems with $n$-body relations. To\naddress this, topological deep learning has emerged as a promising field for\nstudying and modeling higher-order interactions using various topological\ndomains, such as simplicial and cellular complexes. While these new domains\nprovide powerful representations, they introduce new challenges, such as\neffectively modeling the interactions among higher-order structures through\nhigher-order MP. Meanwhile, structured state-space sequence models have proven\nto be effective for sequence modeling and have recently been adapted for graph\ndata by encoding the neighborhood of a node as a sequence, thereby avoiding the\nMP mechanism. In this work, we propose a novel architecture designed to operate\nwith simplicial complexes, utilizing the Mamba state-space model as its\nbackbone. Our approach generates sequences for the nodes based on the\nneighboring cells, enabling direct communication between all higher-order\nstructures, regardless of their rank. We extensively validate our model,\ndemonstrating that it achieves competitive performance compared to\nstate-of-the-art models developed for simplicial complexes.", "paper_summary_zh": "基於訊息傳遞 (MP) 機制的圖神經網路是處理圖結構資料的主流方法。然而，它們本質上僅限於建模成對交互作用，這使得難以明確捕捉具有 $n$-body 關係的系統的複雜性。為了解決這個問題，拓撲深度學習已成為一個有前景的領域，它使用各種拓撲域（例如，單純復形和細胞復形）來研究和建模高階交互作用。雖然這些新域提供了強大的表示，但它們也帶來了新的挑戰，例如透過高階 MP 有效地對高階結構之間的交互作用進行建模。同時，結構化狀態空間序列模型已被證明對於序列建模是有效的，並且最近已透過將節點的鄰域編碼為序列來適應圖資料，從而避免了 MP 機制。在這項工作中，我們提出了一種新穎的架構，旨在使用單純復形運作，並利用 Mamba 狀態空間模型作為其主幹。我們的做法基於鄰近單元產生節點的序列，從而實現所有高階結構之間的直接通訊，而不管它們的秩如何。我們廣泛驗證了我們的模型，證明它與為單純復形開發的最新模型相比，達到了有競爭力的效能。", "author": "Marco Montagna et.al.", "authors": "Marco Montagna, Simone Scardapane, Lev Telyatnikov", "id": "2409.12033v1", "paper_url": "http://arxiv.org/abs/2409.12033v1", "repo": "null"}}