{"2412.18994": {"publish_time": "2024-12-25", "title": "Geospatial Data Fusion: Combining Lidar, SAR, and Optical Imagery with AI for Enhanced Urban Mapping", "paper_summary": "This study explores the integration of Lidar, Synthetic Aperture Radar (SAR),\nand optical imagery through advanced artificial intelligence techniques for\nenhanced urban mapping. By fusing these diverse geospatial datasets, we aim to\novercome the limitations associated with single-sensor data, achieving a more\ncomprehensive representation of urban environments. The research employs Fully\nConvolutional Networks (FCNs) as the primary deep learning model for urban\nfeature extraction, enabling precise pixel-wise classification of essential\nurban elements, including buildings, roads, and vegetation. To optimize the\nperformance of the FCN model, we utilize Particle Swarm Optimization (PSO) for\nhyperparameter tuning, significantly enhancing model accuracy. Key findings\nindicate that the FCN-PSO model achieved a pixel accuracy of 92.3% and a mean\nIntersection over Union (IoU) of 87.6%, surpassing traditional single-sensor\napproaches. These results underscore the potential of fused geospatial data and\nAI-driven methodologies in urban mapping, providing valuable insights for urban\nplanning and management. The implications of this research pave the way for\nfuture developments in real-time mapping and adaptive urban infrastructure\nplanning.", "paper_summary_zh": "這項研究探討了透過先進的人工智慧技術整合光達、合成孔徑雷達 (SAR) 和光學影像以增強城市製圖。透過融合這些多元的地理空間資料集，我們旨在克服與單一感測器資料相關的限制，達成更全面的城市環境呈現。這項研究採用全卷積網路 (FCN) 作為主要的深度學習模型，用於城市特徵萃取，能夠精確地對每個像素進行分類，包括建築物、道路和植被等重要的城市元素。為了最佳化 FCN 模型的效能，我們利用粒子群最佳化 (PSO) 進行超參數調整，大幅提升模型的準確度。主要的發現指出，FCN-PSO 模型達到了 92.3% 的像素準確度和 87.6% 的平均聯集比交集 (IoU)，超越了傳統的單一感測器方法。這些結果強調了融合地理空間資料和人工智慧驅動方法在城市製圖中的潛力，為城市規劃和管理提供了有價值的見解。這項研究的影響為實時製圖和適應性城市基礎設施規劃的未來發展鋪路。", "author": "Sajjad Afroosheh et.al.", "authors": "Sajjad Afroosheh, Mohammadreza Askari", "id": "2412.18994v1", "paper_url": "http://arxiv.org/abs/2412.18994v1", "repo": "null"}}