{"2407.06071": {"publish_time": "2024-07-08", "title": "From Loops to Oops: Fallback Behaviors of Language Models Under Uncertainty", "paper_summary": "Large language models (LLMs) often exhibit undesirable behaviors, such as\nhallucinations and sequence repetitions. We propose to view these behaviors as\nfallbacks that models exhibit under uncertainty, and investigate the connection\nbetween them. We categorize fallback behaviors -- sequence repetitions,\ndegenerate text, and hallucinations -- and extensively analyze them in models\nfrom the same family that differ by the amount of pretraining tokens, parameter\ncount, or the inclusion of instruction-following training. Our experiments\nreveal a clear and consistent ordering of fallback behaviors, across all these\naxes: the more advanced an LLM is (i.e., trained on more tokens, has more\nparameters, or instruction-tuned), its fallback behavior shifts from sequence\nrepetitions, to degenerate text, and then to hallucinations. Moreover, the same\nordering is observed throughout a single generation, even for the\nbest-performing models; as uncertainty increases, models shift from generating\nhallucinations to producing degenerate text and then sequence repetitions.\nLastly, we demonstrate that while common decoding techniques, such as random\nsampling, might alleviate some unwanted behaviors like sequence repetitions,\nthey increase harder-to-detect hallucinations.", "paper_summary_zh": "大型语言模型 (LLM) 通常会出现不良行为，例如幻觉和序列重复。我们建议将这些行为视为模型在不确定性下的后备行为，并调查它们之间的联系。我们对后备行为进行分类——序列重复、退化文本和幻觉——并对来自同一系列模型进行广泛分析，这些模型通过预训练令牌数量、参数计数或包含指令遵循训练而有所不同。我们的实验揭示了所有这些轴上后备行为的清晰且一致的排序：LLM 越高级（即，在更多令牌上训练，具有更多参数或指令调整），其后备行为就会从序列重复转变为退化文本，然后转变为幻觉。此外，即使对于性能最好的模型，在单个生成过程中也会观察到相同的排序；随着不确定性的增加，模型从生成幻觉转变为生成退化文本，然后是序列重复。最后，我们证明，虽然常见的解码技术（例如随机采样）可能会减轻一些不需要的行为（例如序列重复），但它们会增加更难检测到的幻觉。", "author": "Maor Ivgi et.al.", "authors": "Maor Ivgi, Ori Yoran, Jonathan Berant, Mor Geva", "id": "2407.06071v1", "paper_url": "http://arxiv.org/abs/2407.06071v1", "repo": "https://github.com/mivg/fallbacks"}}