{"2411.16077": {"publish_time": "2024-11-25", "title": "SAGEval: The frontiers of Satisfactory Agent based NLG Evaluation for reference-free open-ended text", "paper_summary": "Large Language Model (LLM) integrations into applications like Microsoft365\nsuite and Google Workspace for creating/processing documents, emails,\npresentations, etc. has led to considerable enhancements in productivity and\ntime savings. But as these integrations become more more complex, it is\nparamount to ensure that the quality of output from the LLM-integrated\napplications are relevant and appropriate for use. Identifying the need to\ndevelop robust evaluation approaches for natural language generation, wherein\nreferences/ground labels doesn't exist or isn't amply available, this paper\nintroduces a novel framework called \"SAGEval\" which utilizes a critiquing Agent\nto provide feedback on scores generated by LLM evaluators. We show that the\ncritiquing Agent is able to rectify scores from LLM evaluators, in absence of\nreferences/ground-truth labels, thereby reducing the need for labeled data even\nfor complex NLG evaluation scenarios, like the generation of JSON-structured\nforms/surveys with responses in different styles like multiple choice, likert\nratings, single choice questions, etc.", "paper_summary_zh": "大型語言模型 (LLM) 整合到 Microsoft365 套件和 Google Workspace 等應用程式中，用於建立/處理文件、電子郵件、簡報等等，這已經大幅提升了生產力並節省時間。但是隨著這些整合變得越來越複雜，最重要的是要確保 LLM 整合應用程式輸出的品質與使用目的相關且適當。本論文辨識出開發健全自然語言產生評估方法的需求，其中參考/基礎標籤不存在或無法充分取得，因此介紹了一個名為「SAGEval」的新架構，它利用批評代理提供 LLM 評估器產生的分數回饋。我們展示出在沒有參考/基礎真實標籤的情況下，批評代理能夠修正 LLM 評估器的分數，因此即使對於複雜的 NLG 評估情境，例如產生具有不同樣式的回應（例如多重選擇、李克特量表、單選題等等）的 JSON 結構化表單/調查，也能減少標記資料的需求。", "author": "Reshmi Ghosh et.al.", "authors": "Reshmi Ghosh, Tianyi Yao, Lizzy Chen, Sadid Hasan, Tianwei Chen, Dario Bernal, Huitian Jiao, H M Sajjad Hossain", "id": "2411.16077v1", "paper_url": "http://arxiv.org/abs/2411.16077v1", "repo": "null"}}