{"2502.12893": {"publish_time": "2025-02-18", "title": "H-CoT: Hijacking the Chain-of-Thought Safety Reasoning Mechanism to Jailbreak Large Reasoning Models, Including OpenAI o1/o3, DeepSeek-R1, and Gemini 2.0 Flash Thinking", "paper_summary": "Large Reasoning Models (LRMs) have recently extended their powerful reasoning\ncapabilities to safety checks-using chain-of-thought reasoning to decide\nwhether a request should be answered. While this new approach offers a\npromising route for balancing model utility and safety, its robustness remains\nunderexplored. To address this gap, we introduce Malicious-Educator, a\nbenchmark that disguises extremely dangerous or malicious requests beneath\nseemingly legitimate educational prompts. Our experiments reveal severe\nsecurity flaws in popular commercial-grade LRMs, including OpenAI o1/o3,\nDeepSeek-R1, and Gemini 2.0 Flash Thinking. For instance, although OpenAI's o1\nmodel initially maintains a high refusal rate of about 98%, subsequent model\nupdates significantly compromise its safety; and attackers can easily extract\ncriminal strategies from DeepSeek-R1 and Gemini 2.0 Flash Thinking without any\nadditional tricks. To further highlight these vulnerabilities, we propose\nHijacking Chain-of-Thought (H-CoT), a universal and transferable attack method\nthat leverages the model's own displayed intermediate reasoning to jailbreak\nits safety reasoning mechanism. Under H-CoT, refusal rates sharply\ndecline-dropping from 98% to below 2%-and, in some instances, even transform\ninitially cautious tones into ones that are willing to provide harmful content.\nWe hope these findings underscore the urgent need for more robust safety\nmechanisms to preserve the benefits of advanced reasoning capabilities without\ncompromising ethical standards.", "paper_summary_zh": "大型推理模型 (LRM) 最近將其強大的推理能力擴展到安全檢查，使用思維鏈推理來決定是否應回答請求。雖然這種新方法為平衡模型實用性和安全性提供了一條有希望的途徑，但其穩健性仍未得到充分探索。為了解決這一差距，我們引入了 Malicious-Educator，這是一個基準，它將極其危險或惡意的請求偽裝在看似合法的教育提示之下。我們的實驗揭示了流行的商業級 LRM 中嚴重的安全缺陷，包括 OpenAI o1/o3、DeepSeek-R1 和 Gemini 2.0 Flash Thinking。例如，儘管 OpenAI 的 o1 模型最初保持約 98% 的高拒絕率，但後續的模型更新顯著損害了其安全性；攻擊者可以輕鬆地從 DeepSeek-R1 和 Gemini 2.0 Flash Thinking 中提取犯罪策略，而無需任何額外的技巧。為了進一步強調這些漏洞，我們提出了劫持思維鏈 (H-CoT)，這是一種通用且可轉移的攻擊方法，它利用模型自己顯示的中間推理來越獄其安全推理機制。在 H-CoT 下，拒絕率急劇下降，從 98% 降至 2% 以下，在某些情況下，甚至將最初謹慎的語氣轉變為願意提供有害內容的語氣。我們希望這些發現強調了對更強大的安全機制的迫切需要，以保留先進推理能力的好處，同時不損害道德標準。", "author": "Martin Kuo et.al.", "authors": "Martin Kuo, Jianyi Zhang, Aolin Ding, Qinsi Wang, Louis DiValentin, Yujia Bao, Wei Wei, Da-Cheng Juan, Hai Li, Yiran Chen", "id": "2502.12893v1", "paper_url": "http://arxiv.org/abs/2502.12893v1", "repo": "null"}}