{"2501.08086": {"publish_time": "2025-01-14", "title": "NOMTO: Neural Operator-based symbolic Model approximaTion and discOvery", "paper_summary": "While many physical and engineering processes are most effectively described\nby non-linear symbolic models, existing non-linear symbolic regression (SR)\nmethods are restricted to a limited set of continuous algebraic functions,\nthereby limiting their applicability to discover higher order non-linear\ndifferential relations. In this work, we introduce the Neural Operator-based\nsymbolic Model approximaTion and discOvery (NOMTO) method, a novel approach to\nsymbolic model discovery that leverages Neural Operators to encompass a broad\nrange of symbolic operations. We demonstrate that NOMTO can successfully\nidentify symbolic expressions containing elementary functions with\nsingularities, special functions, and derivatives. Additionally, our\nexperiments demonstrate that NOMTO can accurately rediscover second-order\nnon-linear partial differential equations. By broadening the set of symbolic\noperations available for discovery, NOMTO significantly advances the\ncapabilities of existing SR methods. It provides a powerful and flexible tool\nfor model discovery, capable of capturing complex relations in a variety of\nphysical systems.", "paper_summary_zh": "雖然許多物理和工程程序最有效地透過非線性符號模型描述，現有的非線性符號回歸 (SR) 方法僅限於一組連續代數函數，因此限制了它們在發現高階非線性微分關係中的適用性。在這項工作中，我們引入了基於神經算子的符號模型近似和發現 (NOMTO) 方法，一種符號模型發現的新方法，它利用神經算子涵蓋廣泛的符號運算。我們證明 NOMTO 可以成功識別包含具有奇異性、特殊函數和導數的基本函數的符號表達式。此外，我們的實驗證明 NOMTO 可以準確地重新發現二階非線性偏微分方程式。透過擴展可供發現的符號運算組，NOMTO 大大提升了現有 SR 方法的功能。它提供了一個強大且靈活的模型發現工具，能夠捕捉各種物理系統中的複雜關係。", "author": "Sergei Garmaev et.al.", "authors": "Sergei Garmaev, Siddhartha Mishra, Olga Fink", "id": "2501.08086v1", "paper_url": "http://arxiv.org/abs/2501.08086v1", "repo": "null"}}