{"2410.13562": {"publish_time": "2024-10-17", "title": "Enhancing Fact Retrieval in PLMs through Truthfulness", "paper_summary": "Pre-trained Language Models (PLMs) encode various facts about the world at\ntheir pre-training phase as they are trained to predict the next or missing\nword in a sentence. There has a been an interest in quantifying and improving\nthe amount of facts that can be extracted from PLMs, as they have been\nenvisioned to act as soft knowledge bases, which can be queried in natural\nlanguage. Different approaches exist to enhance fact retrieval from PLM. Recent\nwork shows that the hidden states of PLMs can be leveraged to determine the\ntruthfulness of the PLMs' inputs. Leveraging this finding to improve factual\nknowledge retrieval remains unexplored. In this work, we investigate the use of\na helper model to improve fact retrieval. The helper model assesses the\ntruthfulness of an input based on the corresponding hidden states\nrepresentations from the PLMs. We evaluate this approach on several masked PLMs\nand show that it enhances fact retrieval by up to 33\\%. Our findings highlight\nthe potential of hidden states representations from PLMs in improving their\nfactual knowledge retrieval.", "paper_summary_zh": "預訓練語言模型 (PLM) 在預訓練階段會編碼世界上各種事實，因為它們被訓練為預測句子中的下一個或遺失的單字。對於量化和改善可從 PLM 中提取的事實數量一直很有興趣，因為它們被設想為可以透過自然語言查詢的軟知識庫。有不同的方法可以增強從 PLM 中擷取事實。最近的研究顯示，PLM 的隱藏狀態可以被利用來確定 PLM 輸入的真實性。利用這個發現來改善事實知識擷取仍未被探索。在這項工作中，我們探討使用輔助模型來改善事實擷取。輔助模型根據來自 PLM 的對應隱藏狀態表示來評估輸入的真實性。我們在多個遮蔽 PLM 上評估此方法，並顯示它將事實擷取提升了 33%。我們的發現突出了 PLM 的隱藏狀態表示在改善其事實知識擷取方面的潛力。", "author": "Paul Youssef et.al.", "authors": "Paul Youssef, Jörg Schlötterer, Christin Seifert", "id": "2410.13562v1", "paper_url": "http://arxiv.org/abs/2410.13562v1", "repo": "null"}}