{"2409.08631": {"publish_time": "2024-09-13", "title": "Sybil Detection using Graph Neural Networks", "paper_summary": "This paper presents SYBILGAT, a novel approach to Sybil detection in social\nnetworks using Graph Attention Networks (GATs). Traditional methods for Sybil\ndetection primarily leverage structural properties of networks; however, they\ntend to struggle with a large number of attack edges and are often unable to\nsimultaneously utilize both known Sybil and honest nodes. Our proposed method\naddresses these limitations by dynamically assigning attention weights to\ndifferent nodes during aggregations, enhancing detection performance. We\nconducted extensive experiments in various scenarios, including pretraining in\nsampled subgraphs, synthetic networks, and networks under targeted attacks. The\nresults show that SYBILGAT significantly outperforms the state-of-the-art\nalgorithms, particularly in scenarios with high attack complexity and when the\nnumber of attack edges increases. Our approach shows robust performance across\ndifferent network models and sizes, even as the detection task becomes more\nchallenging. We successfully applied the model to a real-world Twitter graph\nwith more than 269k nodes and 6.8M edges. The flexibility and generalizability\nof SYBILGAT make it a promising tool to defend against Sybil attacks in online\nsocial networks with only structural information.", "paper_summary_zh": "本文提出 SYBILGAT，這是一種使用圖注意力網路 (GAT) 在社交網路中偵測 Sybil 的新方法。傳統的 Sybil 偵測方法主要利用網路的結構特性；然而，它們往往難以應付大量的攻擊邊緣，而且通常無法同時利用已知的 Sybil 節點和誠實節點。我們提出的方法透過在聚合期間動態地將注意力權重分配給不同的節點來解決這些限制，進而提升偵測效能。我們在各種情境中進行了廣泛的實驗，包括在取樣的子圖、合成網路和受到目標攻擊的網路中進行預訓練。結果顯示，SYBILGAT 明顯優於現有的演算法，特別是在攻擊複雜度高且攻擊邊緣數量增加的情況下。我們的做法在不同的網路模型和規模中展現出穩健的效能，即使偵測任務變得更具挑戰性。我們成功地將該模型應用於一個真實世界的 Twitter 圖，該圖包含超過 269k 個節點和 6.8M 條邊緣。SYBILGAT 的靈活性與泛用性使其成為一種有前途的工具，可用於防禦僅具有結構資訊的線上社交網路中的 Sybil 攻擊。", "author": "Stuart Heeb et.al.", "authors": "Stuart Heeb, Andreas Plesner, Roger Wattenhofer", "id": "2409.08631v1", "paper_url": "http://arxiv.org/abs/2409.08631v1", "repo": "null"}}