{"2412.04947": {"publish_time": "2024-12-06", "title": "C$^2$LEVA: Toward Comprehensive and Contamination-Free Language Model Evaluation", "paper_summary": "Recent advances in large language models (LLMs) have shown significant\npromise, yet their evaluation raises concerns, particularly regarding data\ncontamination due to the lack of access to proprietary training data. To\naddress this issue, we present C$^2$LEVA, a comprehensive bilingual benchmark\nfeaturing systematic contamination prevention. C$^2$LEVA firstly offers a\nholistic evaluation encompassing 22 tasks, each targeting a specific\napplication or ability of LLMs, and secondly a trustworthy assessment due to\nour contamination-free tasks, ensured by a systematic contamination prevention\nstrategy that fully automates test data renewal and enforces data protection\nduring benchmark data release. Our large-scale evaluation of 15 open-source and\nproprietary models demonstrates the effectiveness of C$^2$LEVA.", "paper_summary_zh": "大型語言模型 (LLM) 最近的進展已展現出顯著的希望，但其評估引發了疑慮，特別是對於由於無法取得專有訓練資料而導致資料污染的疑慮。為了解決此問題，我們提出 C$^2$LEVA，一個具有系統性污染防範的全面雙語基準。C$^2$LEVA 首先提供一個全面評估，包含 22 項任務，每個任務都針對 LLM 的特定應用或能力，其次，由於我們無污染的任務，因此提供了一個值得信賴的評估，這由一個系統性的污染防範策略確保，該策略完全自動化測試資料更新，並在基準資料發布期間執行資料保護。我們對 15 個開源和專有模型進行的大規模評估證明了 C$^2$LEVA 的有效性。", "author": "Yanyang Li et.al.", "authors": "Yanyang Li, Tin Long Wong, Cheung To Hung, Jianqiao Zhao, Duo Zheng, Ka Wai Liu, Michael R. Lyu, Liwei Wang", "id": "2412.04947v1", "paper_url": "http://arxiv.org/abs/2412.04947v1", "repo": "null"}}