{"2504.10063": {"publish_time": "2025-04-14", "title": "Hallucination Detection in LLMs via Topological Divergence on Attention Graphs", "paper_summary": "Hallucination, i.e., generating factually incorrect content, remains a\ncritical challenge for large language models (LLMs). We introduce TOHA, a\nTOpology-based HAllucination detector in the RAG setting, which leverages a\ntopological divergence metric to quantify the structural properties of graphs\ninduced by attention matrices. Examining the topological divergence between\nprompt and response subgraphs reveals consistent patterns: higher divergence\nvalues in specific attention heads correlate with hallucinated outputs,\nindependent of the dataset. Extensive experiments, including evaluation on\nquestion answering and data-to-text tasks, show that our approach achieves\nstate-of-the-art or competitive results on several benchmarks, two of which\nwere annotated by us and are being publicly released to facilitate further\nresearch. Beyond its strong in-domain performance, TOHA maintains remarkable\ndomain transferability across multiple open-source LLMs. Our findings suggest\nthat analyzing the topological structure of attention matrices can serve as an\nefficient and robust indicator of factual reliability in LLMs.", "paper_summary_zh": "<paragraph>幻覺，也就是產生事實上不正確的內容，仍然是大語言模型 (LLM) 的一個關鍵挑戰。我們引入了 TOHA，一個基於拓撲結構的 RAG 設定下的幻覺檢測器，它利用拓撲散度指標來量化由注意力矩陣誘導的圖的結構特性。檢驗提示和響應子圖之間的拓撲散度揭示了一致的模式：特定注意力頭中較高的散度值與產生幻覺的輸出相關，而與數據集無關。廣泛的實驗，包括對問答和數據到文本任務的評估，表明我們的方法在幾個基準測試中達到了最先進或具有競爭力的結果，其中兩個基準測試由我們註釋，並將公開發布以促進進一步的研究。除了其強大的域內性能外，TOHA 還能在多個開源 LLM 中保持顯著的域遷移能力。我們的研究結果表明，分析注意力矩陣的拓撲結構可以作為 LLM 事實可靠性的有效且穩健的指標。</paragraph>\n", "author": "Alexandra Bazarova et.al.", "authors": "Alexandra Bazarova, Aleksandr Yugay, Andrey Shulga, Alina Ermilova, Andrei Volodichev, Konstantin Polev, Julia Belikova, Rauf Parchiev, Dmitry Simakov, Maxim Savchenko, Andrey Savchenko, Serguei Barannikov, Alexey Zaytsev", "id": "2504.10063v1", "paper_url": "http://arxiv.org/abs/2504.10063v1", "repo": "null"}}