{"2410.08864": {"publish_time": "2024-10-11", "title": "The Good, the Bad and the Ugly: Watermarks, Transferable Attacks and Adversarial Defenses", "paper_summary": "We formalize and extend existing definitions of backdoor-based watermarks and\nadversarial defenses as interactive protocols between two players. The\nexistence of these schemes is inherently tied to the learning tasks for which\nthey are designed. Our main result shows that for almost every discriminative\nlearning task, at least one of the two -- a watermark or an adversarial defense\n-- exists. The term \"almost every\" indicates that we also identify a third,\ncounterintuitive but necessary option, i.e., a scheme we call a transferable\nattack. By transferable attack, we refer to an efficient algorithm computing\nqueries that look indistinguishable from the data distribution and fool all\nefficient defenders. To this end, we prove the necessity of a transferable\nattack via a construction that uses a cryptographic tool called homomorphic\nencryption. Furthermore, we show that any task that satisfies our notion of a\ntransferable attack implies a cryptographic primitive, thus requiring the\nunderlying task to be computationally complex. These two facts imply an\n\"equivalence\" between the existence of transferable attacks and cryptography.\nFinally, we show that the class of tasks of bounded VC-dimension has an\nadversarial defense, and a subclass of them has a watermark.", "paper_summary_zh": "<paragraph>我們將現有後門浮水印的定義和對抗防禦形式化並擴展為兩個參與者之間的互動協議。\n這些方案的存在與它們所設計的學習任務有著固有的聯繫。我們的結果表明，對於幾乎每個區別性學習任務，至少存在兩個中的其中一個——浮水印或對抗防禦。\n「幾乎每個」一詞表示我們還確定了第三個反直覺但必要的選項，即我們稱之為可轉移攻擊的方案。通過可轉移攻擊，我們指的是一種計算查詢的有效演算法，這些查詢看起來與資料分佈無法區分，並且可以欺騙所有有效的防禦者。為此，我們通過使用稱為同態加密的密碼學工具的構造證明了可轉移攻擊的必要性。此外，我們表明滿足我們對可轉移攻擊概念的任何任務都意味著密碼學原語，從而要求基礎任務在計算上是複雜的。這兩個事實意味著可轉移攻擊和密碼學之間的「等價性」。最後，我們表明邊界 VC 維度的任務類別具有對抗防禦，而它們的一個子類具有浮水印。</paragraph>", "author": "Grzegorz Głuch et.al.", "authors": "Grzegorz Głuch, Berkant Turan, Sai Ganesh Nagarajan, Sebastian Pokutta", "id": "2410.08864v1", "paper_url": "http://arxiv.org/abs/2410.08864v1", "repo": "null"}}