{"2407.08134": {"publish_time": "2024-07-11", "title": "Highway Networks for Improved Surface Reconstruction: The Role of Residuals and Weight Updates", "paper_summary": "Surface reconstruction from point clouds is a fundamental challenge in\ncomputer graphics and medical imaging. In this paper, we explore the\napplication of advanced neural network architectures for the accurate and\nefficient reconstruction of surfaces from data points. We introduce a novel\nvariant of the Highway network (Hw) called Square-Highway (SqrHw) within the\ncontext of multilayer perceptrons and investigate its performance alongside\nplain neural networks and a simplified Hw in various numerical examples. These\nexamples include the reconstruction of simple and complex surfaces, such as\nspheres, human hands, and intricate models like the Stanford Bunny. We analyze\nthe impact of factors such as the number of hidden layers, interior and\nexterior points, and data distribution on surface reconstruction quality. Our\nresults show that the proposed SqrHw architecture outperforms other neural\nnetwork configurations, achieving faster convergence and higher-quality surface\nreconstructions. Additionally, we demonstrate the SqrHw's ability to predict\nsurfaces over missing data, a valuable feature for challenging applications\nlike medical imaging. Furthermore, our study delves into further details,\ndemonstrating that the proposed method based on highway networks yields more\nstable weight norms and backpropagation gradients compared to the Plain Network\narchitecture. This research not only advances the field of computer graphics\nbut also holds utility for other purposes such as function interpolation and\nphysics-informed neural networks, which integrate multilayer perceptrons into\ntheir algorithms.", "paper_summary_zh": "從點雲進行曲面重建是電腦圖學和醫學影像中的一項基本挑戰。在本文中，我們探討了先進神經網路架構在從資料點精確且有效重建曲面中的應用。我們在多層感知器的架構中，引入了高速公路網路（Hw）的一種新變體，稱為 Square-Highway（SqrHw），並在各種數值範例中探討其效能，以及與一般神經網路和簡化的 Hw 的效能。這些範例包括重建簡單和複雜的曲面，例如球體、人手和像 Stanford Bunny 那樣複雜的模型。我們分析了隱藏層數、內部和外部點以及資料分佈等因素對曲面重建品質的影響。我們的結果顯示，所提出的 SqrHw 架構優於其他神經網路組態，能達成更快的收斂速度和更高品質的曲面重建。此外，我們展示了 SqrHw 能夠預測遺失資料上的曲面，這對於像醫學影像那樣具有挑戰性的應用來說，是一個有價值的功能。此外，我們的研究深入探討了更多細節，證明了基於高速公路網路的所提出方法，與一般網路架構相比，產生了更穩定的權重範數和反向傳播梯度。這項研究不僅推動了電腦圖學領域，也對其他用途有幫助，例如函數內插和物理資訊神經網路，將多層感知器整合到其演算法中。", "author": "A. Noorizadegan et.al.", "authors": "A. Noorizadegan, Y. C. Hon, D. L. Young, C. S. Chen", "id": "2407.08134v1", "paper_url": "http://arxiv.org/abs/2407.08134v1", "repo": "null"}}