{"2407.09072": {"publish_time": "2024-07-12", "title": "New Desiderata for Direct Preference Optimization", "paper_summary": "Large language models in the past have typically relied on some form of\nreinforcement learning with human feedback (RLHF) to better align model\nresponses with human preferences. However, because of oft-observed\ninstabilities when implementing these RLHF pipelines, various\nreparameterization techniques have recently been introduced to sidestep the\nneed for separately learning an RL reward model. Instead, directly fine-tuning\nfor human preferences is achieved via the minimization of a single closed-form\ntraining objective, a process originally referred to as direct preference\noptimization (DPO) and followed by several notable descendants. Although\neffective in certain real-world settings, we introduce new evaluation criteria\nthat serve to highlight unresolved shortcomings in the ability of existing DPO\nmethods to interpolate between a pre-trained reference model and empirical\nmeasures of human preferences, as well as unavoidable trade-offs in how low-\nand high-quality responses are regularized and constraints are handled. Our\ninsights then motivate an alternative DPO-like loss that provably mitigates\nthese limitations. Empirical results serve to corroborate notable aspects of\nour analyses.", "paper_summary_zh": "過去的大語言模型通常依賴某種形式的強化學習與人類回饋 (RLHF)，以更好地將模型回應與人類偏好相符。然而，由於在實作這些 RLHF 管線時經常觀察到不穩定性，因此最近已引入各種重新參數化技術來迴避需要單獨學習 RL 獎勵模型。相反地，直接微調以符合人類偏好是透過最小化單一閉合形式訓練目標來達成，這項程序最初稱為直接偏好最佳化 (DPO)，並有幾個著名的後續版本。儘管在某些實際環境中有效，但我們引入了新的評量準則，用於強調現有 DPO 方法在預訓練參考模型與人類偏好的經驗測量之間內插的能力中尚未解決的缺點，以及在低品質和高品質回應如何正規化和處理限制方面的不可避免的權衡。我們的見解接著激勵了一種替代的類似 DPO 的損失，可證明減輕了這些限制。經驗結果用於證實我們分析的顯著面向。", "author": "Xiangkun Hu et.al.", "authors": "Xiangkun Hu, Tong He, David Wipf", "id": "2407.09072v1", "paper_url": "http://arxiv.org/abs/2407.09072v1", "repo": "null"}}