{"2406.17755": {"publish_time": "2024-06-25", "title": "Accelerating Clinical Evidence Synthesis with Large Language Models", "paper_summary": "Automatic medical discovery by AI is a dream of many. One step toward that\ngoal is to create an AI model to understand clinical studies and synthesize\nclinical evidence from the literature. Clinical evidence synthesis currently\nrelies on systematic reviews of clinical trials and retrospective analyses from\nmedical literature. However, the rapid expansion of publications presents\nchallenges in efficiently identifying, summarizing, and updating evidence. We\nintroduce TrialMind, a generative AI-based pipeline for conducting medical\nsystematic reviews, encompassing study search, screening, and data extraction\nphases. We utilize large language models (LLMs) to drive each pipeline\ncomponent while incorporating human expert oversight to minimize errors. To\nfacilitate evaluation, we also create a benchmark dataset TrialReviewBench, a\ncustom dataset with 870 annotated clinical studies from 25 meta-analysis papers\nacross various medical treatments. Our results demonstrate that TrialMind\nsignificantly improves the literature review process, achieving high recall\nrates (0.897-1.000) in study searching from over 20 million PubMed studies and\noutperforming traditional language model embeddings-based methods in screening\n(Recall@20 of 0.227-0.246 vs. 0.000-0.102). Furthermore, our approach surpasses\ndirect GPT-4 performance in result extraction, with accuracy ranging from 0.65\nto 0.84. We also support clinical evidence synthesis in forest plots, as\nvalidated by eight human annotators who preferred TrialMind over the GPT-4\nbaseline with a winning rate of 62.5%-100% across the involved reviews. Our\nfindings suggest that an LLM-based clinical evidence synthesis approach, such\nas TrialMind, can enable reliable and high-quality clinical evidence synthesis\nto improve clinical research efficiency.", "paper_summary_zh": "<paragraph>許多人夢想著由 AI 自動進行醫學發現。朝此目標邁進的一步是建立一個 AI 模型來理解臨床研究，並從文獻中綜合臨床證據。臨床證據綜合目前依賴於臨床試驗的系統性回顧和醫學文獻的回溯性分析。然而，出版物的快速擴張在有效地識別、總結和更新證據方面提出了挑戰。我們介紹了 TrialMind，這是一個基於生成式 AI 的管道，用於進行醫學系統性回顧，包括研究搜尋、篩選和數據萃取階段。我們利用大型語言模型 (LLM) 來驅動每個管道組件，同時結合人類專家監督以最大程度地減少錯誤。為了促進評估，我們還建立了一個基準數據集 TrialReviewBench，這是一個自訂數據集，其中包含來自 25 篇關於各種醫療治療的元分析論文的 870 項註解臨床研究。我們的結果表明，TrialMind 大幅改善了文獻回顧流程，在超過 2000 萬篇 PubMed 研究中達到了很高的召回率 (0.897-1.000)，並在篩選方面優於基於傳統語言模型嵌入的方法（召回率 @20 為 0.227-0.246，相較於 0.000-0.102）。此外，我們的做法在結果萃取方面超越了直接的 GPT-4 效能，準確度範圍從 0.65 到 0.84。我們還支援森林圖中的臨床證據綜合，這點已獲得八位人類註解者的驗證，他們在相關回顧中以 62.5%-100% 的獲勝率偏好 TrialMind，勝過 GPT-4 基準。我們的研究結果表明，基於 LLM 的臨床證據綜合方法（例如 TrialMind）可以實現可靠且高品質的臨床證據綜合，以提高臨床研究效率。</paragraph>", "author": "Zifeng Wang et.al.", "authors": "Zifeng Wang, Lang Cao, Benjamin Danek, Yichi Zhang, Qiao Jin, Zhiyong Lu, Jimeng Sun", "id": "2406.17755v1", "paper_url": "http://arxiv.org/abs/2406.17755v1", "repo": "null"}}