{"2409.11290": {"publish_time": "2024-09-17", "title": "Neural Networks for Vehicle Routing Problem", "paper_summary": "The Vehicle Routing Problem is about optimizing the routes of vehicles to\nmeet the needs of customers at specific locations. The route graph consists of\ndepots on several levels and customer positions. Several optimization methods\nhave been developed over the years, most of which are based on some type of\nclassic heuristic: genetic algorithm, simulated annealing, tabu search, ant\ncolony optimization, firefly algorithm. Recent developments in machine learning\nprovide a new toolset, the rich family of neural networks, for tackling complex\nproblems. The main area of application of neural networks is the area of\nclassification and regression. Route optimization can be viewed as a new\nchallenge for neural networks. The article first presents an analysis of the\napplicability of neural network tools, then a novel graphical neural network\nmodel is presented in detail. The efficiency analysis based on test experiments\nshows the applicability of the proposed NN architecture.", "paper_summary_zh": "車輛路線問題是關於最佳化車輛路線，以滿足特定地點客戶的需求。路線圖包含多個層級的車輛存放處和客戶位置。多年來已經開發出多種最佳化方法，其中大多數基於某種類型的經典啟發式方法：遺傳演算法、模擬退火、禁忌搜尋、蟻群最佳化、螢火蟲演算法。機器學習的最新發展提供了一組新的工具，即豐富的神經網路家族，用於解決複雜的問題。神經網路的主要應用領域是分類和回歸領域。路線最佳化可以視為神經網路的新挑戰。本文首先分析了神經網路工具的適用性，然後詳細介紹了一個新穎的圖形神經網路模型。基於測試實驗的效率分析顯示了所提出的神經網路架構的適用性。", "author": "László Kovács et.al.", "authors": "László Kovács, Ali Jlidi", "id": "2409.11290v1", "paper_url": "http://arxiv.org/abs/2409.11290v1", "repo": "null"}}