{"2409.12186": {"publish_time": "2024-09-18", "title": "Qwen2.5-Coder Technical Report", "paper_summary": "In this report, we introduce the Qwen2.5-Coder series, a significant upgrade\nfrom its predecessor, CodeQwen1.5. This series includes two models:\nQwen2.5-Coder-1.5B and Qwen2.5-Coder-7B. As a code-specific model,\nQwen2.5-Coder is built upon the Qwen2.5 architecture and continues pretrained\non a vast corpus of over 5.5 trillion tokens. Through meticulous data cleaning,\nscalable synthetic data generation, and balanced data mixing, Qwen2.5-Coder\ndemonstrates impressive code generation capabilities while retaining general\nversatility. The model has been evaluated on a wide range of code-related\ntasks, achieving state-of-the-art (SOTA) performance across more than 10\nbenchmarks, including code generation, completion, reasoning, and repair,\nconsistently outperforming larger models of the same model size. We believe\nthat the release of the Qwen2.5-Coder series will not only push the boundaries\nof research in code intelligence but also, through its permissive licensing,\nencourage broader adoption by developers in real-world applications.", "paper_summary_zh": "在本次報告中，我們介紹 Qwen2.5-Coder 系列，這是其前身 CodeQwen1.5 的重大升級。此系列包含兩個模型：Qwen2.5-Coder-1.5B 和 Qwen2.5-Coder-7B。作為一個特定於程式碼的模型，Qwen2.5-Coder 建構於 Qwen2.5 架構之上，並持續在超過 5.5 兆個 token 的龐大語料庫上進行預訓練。透過細心的資料清理、可擴充的合成資料產生，以及平衡的資料混合，Qwen2.5-Coder 展現了令人印象深刻的程式碼產生能力，同時保留了通用的多功能性。此模型已在廣泛的程式碼相關任務中進行評估，在超過 10 個基準測試中（包括程式碼產生、完成、推理和修復）達到最先進 (SOTA) 的效能，持續優於同等模型大小的較大型模型。我們相信，Qwen2.5-Coder 系列的釋出不僅會推動程式碼智能研究的界限，而且透過其寬鬆的授權，也會鼓勵開發人員在實際應用中更廣泛地採用。", "author": "Binyuan Hui et.al.", "authors": "Binyuan Hui, Jian Yang, Zeyu Cui, Jiaxi Yang, Dayiheng Liu, Lei Zhang, Tianyu Liu, Jiajun Zhang, Bowen Yu, Kai Dang, An Yang, Rui Men, Fei Huang, Xingzhang Ren, Xuancheng Ren, Jingren Zhou, Junyang Lin", "id": "2409.12186v1", "paper_url": "http://arxiv.org/abs/2409.12186v1", "repo": "null"}}