{"2407.19584": {"publish_time": "2024-07-28", "title": "SaulLM-54B & SaulLM-141B: Scaling Up Domain Adaptation for the Legal Domain", "paper_summary": "In this paper, we introduce SaulLM-54B and SaulLM-141B, two large language\nmodels (LLMs) tailored for the legal sector. These models, which feature\narchitectures of 54 billion and 141 billion parameters, respectively, are based\non the Mixtral architecture. The development of SaulLM-54B and SaulLM-141B is\nguided by large-scale domain adaptation, divided into three strategies: (1) the\nexploitation of continued pretraining involving a base corpus that includes\nover 540 billion of legal tokens, (2) the implementation of a specialized legal\ninstruction-following protocol, and (3) the alignment of model outputs with\nhuman preferences in legal interpretations. The integration of synthetically\ngenerated data in the second and third steps enhances the models' capabilities\nin interpreting and processing legal texts, effectively reaching\nstate-of-the-art performance and outperforming previous open-source models on\nLegalBench-Instruct. This work explores the trade-offs involved in\ndomain-specific adaptation at this scale, offering insights that may inform\nfuture studies on domain adaptation using strong decoder models. Building upon\nSaulLM-7B, this study refines the approach to produce an LLM better equipped\nfor legal tasks. We are releasing base, instruct, and aligned versions on top\nof SaulLM-54B and SaulLM-141B under the MIT License to facilitate reuse and\ncollaborative research.", "paper_summary_zh": "<paragraph>在本文中，我們介紹了 SaulLM-54B 和 SaulLM-141B，兩種針對法律領域量身打造的大型語言模型 (LLM)。這些模型分別採用 540 億和 1410 億個參數的架構，基於 Mixtral 架構。SaulLM-54B 和 SaulLM-141B 的開發由大規模領域適應引導，分為三種策略：(1) 利用持續預訓練，包含一個基礎語料庫，其中包含超過 5400 億個法律標記，(2) 實施專業法律指令遵循協定，以及 (3) 將模型輸出與人類在法律解釋中的偏好對齊。在第二和第三步驟中整合合成產生的數據，增強了模型在解釋和處理法律文本方面的能力，有效地達到最先進的效能，並在 LegalBench-Instruct 中優於先前的開源模型。這項工作探討了在此規模下涉及領域特定適應的權衡，提供見解，可能為使用強大解碼器模型進行領域適應的未來研究提供資訊。本研究建立在 SaulLM-7B 的基礎上，改進了方法，以產生更適合法律任務的 LLM。我們根據 MIT 許可證在 SaulLM-54B 和 SaulLM-141B 上發布基礎、指令和對齊版本，以促進重複使用和協作研究。</paragraph>", "author": "Pierre Colombo et.al.", "authors": "Pierre Colombo, Telmo Pires, Malik Boudiaf, Rui Melo, Dominic Culver, Sofia Morgado, Etienne Malaboeuf, Gabriel Hautreux, Johanne Charpentier, Michael Desa", "id": "2407.19584v1", "paper_url": "http://arxiv.org/abs/2407.19584v1", "repo": "null"}}