{"2411.11647": {"publish_time": "2024-11-18", "title": "No-regret Exploration in Shuffle Private Reinforcement Learning", "paper_summary": "Differential privacy (DP) has recently been introduced into episodic\nreinforcement learning (RL) to formally address user privacy concerns in\npersonalized services. Previous work mainly focuses on two trust models of DP:\nthe central model, where a central agent is responsible for protecting users'\nsensitive data, and the (stronger) local model, where the protection occurs\ndirectly on the user side. However, they either require a trusted central agent\nor incur a significantly higher privacy cost, making it unsuitable for many\nscenarios. This work introduces a trust model stronger than the central model\nbut with a lower privacy cost than the local model, leveraging the emerging\n\\emph{shuffle} model of privacy. We present the first generic algorithm for\nepisodic RL under the shuffle model, where a trusted shuffler randomly permutes\na batch of users' data before sending it to the central agent. We then\ninstantiate the algorithm using our proposed shuffle Privatizer, relying on a\nshuffle private binary summation mechanism. Our analysis shows that the\nalgorithm achieves a near-optimal regret bound comparable to that of the\ncentralized model and significantly outperforms the local model in terms of\nprivacy cost.", "paper_summary_zh": "差分隐私 (DP) 最近已引入到情境强化学习 (RL) 中，以正式解决个性化服务中的用户隐私问题。先前的工作主要关注 DP 的两种信任模型：中心模型，其中一个中心代理负责保护用户的敏感数据，以及（更强的）本地模型，其中保护直接发生在用户端。然而，它们要么需要一个受信任的中心代理，要么产生明显更高的隐私成本，使其不适用于许多场景。这项工作引入了一个比中心模型更强但隐私成本低于本地模型的信任模型，利用了新兴的隐私“混洗”模型。我们提出了混洗模型下情境 RL 的第一个通用算法，其中一个受信任的混洗器在将一批用户数据发送到中心代理之前随机排列这些数据。然后，我们使用我们提出的混洗私有化器实例化该算法，依靠混洗私有二进制求和机制。我们的分析表明，该算法实现了与集中式模型相当的近似最优后悔界，并且在隐私成本方面明显优于本地模型。", "author": "Shaojie Bai et.al.", "authors": "Shaojie Bai, Mohammad Sadegh Talebi, Chengcheng Zhao, Peng Cheng, Jiming Chen", "id": "2411.11647v1", "paper_url": "http://arxiv.org/abs/2411.11647v1", "repo": "null"}}