{"2411.11758": {"publish_time": "2024-11-18", "title": "The Power of Many: Multi-Agent Multimodal Models for Cultural Image Captioning", "paper_summary": "Large Multimodal Models (LMMs) exhibit impressive performance across various\nmultimodal tasks. However, their effectiveness in cross-cultural contexts\nremains limited due to the predominantly Western-centric nature of most data\nand models. Conversely, multi-agent models have shown significant capability in\nsolving complex tasks. Our study evaluates the collective performance of LMMs\nin a multi-agent interaction setting for the novel task of cultural image\ncaptioning. Our contributions are as follows: (1) We introduce MosAIC, a\nMulti-Agent framework to enhance cross-cultural Image Captioning using LMMs\nwith distinct cultural personas; (2) We provide a dataset of culturally\nenriched image captions in English for images from China, India, and Romania\nacross three datasets: GeoDE, GD-VCR, CVQA; (3) We propose a culture-adaptable\nmetric for evaluating cultural information within image captions; and (4) We\nshow that the multi-agent interaction outperforms single-agent models across\ndifferent metrics, and offer valuable insights for future research. Our dataset\nand models can be accessed at https://github.com/MichiganNLP/MosAIC.", "paper_summary_zh": "大型多模态模型 (LMM) 在各种多模态任务中表现出色。然而，由于大多数数据和模型本质上以西方为中心，它们在跨文化环境中的有效性仍然受到限制。相反，多主体模型在解决复杂任务方面显示出显著的能力。我们的研究评估了 LMM 在多主体交互设置中对文化图像字幕的新颖任务的集体表现。我们的贡献如下：(1) 我们引入了 MosAIC，一个多主体框架，使用具有不同文化角色的 LMM 增强跨文化图像字幕；(2) 我们提供了一个数据集，其中包含来自中国、印度和罗马尼亚的图像的文化丰富的图像字幕，跨越三个数据集：GeoDE、GD-VCR、CVQA；(3) 我们提出了一个文化适应性指标，用于评估图像字幕中的文化信息；(4) 我们表明，多主体交互在不同指标上优于单主体模型，并为未来的研究提供了宝贵的见解。我们的数据集和模型可在 https://github.com/MichiganNLP/MosAIC 获得。", "author": "Longju Bai et.al.", "authors": "Longju Bai, Angana Borah, Oana Ignat, Rada Mihalcea", "id": "2411.11758v1", "paper_url": "http://arxiv.org/abs/2411.11758v1", "repo": "null"}}