{"2408.09948": {"publish_time": "2024-08-19", "title": "Caption-Driven Explorations: Aligning Image and Text Embeddings through Human-Inspired Foveated Vision", "paper_summary": "Understanding human attention is crucial for vision science and AI. While\nmany models exist for free-viewing, less is known about task-driven image\nexploration. To address this, we introduce CapMIT1003, a dataset with captions\nand click-contingent image explorations, to study human attention during the\ncaptioning task. We also present NevaClip, a zero-shot method for predicting\nvisual scanpaths by combining CLIP models with NeVA algorithms. NevaClip\ngenerates fixations to align the representations of foveated visual stimuli and\ncaptions. The simulated scanpaths outperform existing human attention models in\nplausibility for captioning and free-viewing tasks. This research enhances the\nunderstanding of human attention and advances scanpath prediction models.", "paper_summary_zh": "了解人類的注意力對於視覺科學和 AI 至關重要。雖然有許多自由視覺模型，但對於任務驅動的影像探索卻知之甚少。為了解決這個問題，我們引入了 CapMIT1003，一個帶有標題和點擊相關影像探索的資料集，用於研究標題任務期間的人類注意力。我們還提出了 NevaClip，一種零次學習方法，透過將 CLIP 模型與 NeVA 演算法結合來預測視覺掃描路徑。NevaClip 會產生注視點，以對齊注視視覺刺激和標題的表徵。模擬掃描路徑在標題和自由視覺任務的合理性上優於現有的人類注意力模型。這項研究增進了對人類注意力的理解，並推動了掃描路徑預測模型的進步。", "author": "Dario Zanca et.al.", "authors": "Dario Zanca, Andrea Zugarini, Simon Dietz, Thomas R. Altstidl, Mark A. Turban Ndjeuha, Leo Schwinn, Bjoern Eskofier", "id": "2408.09948v1", "paper_url": "http://arxiv.org/abs/2408.09948v1", "repo": "null"}}