{"2405.17284": {"publish_time": "2024-05-27", "title": "An NLP Crosswalk Between the Common Core State Standards and NAEP Item Specifications", "paper_summary": "Natural language processing (NLP) is rapidly developing for applications in\neducational assessment. In this paper, I describe an NLP-based procedure that\ncan be used to support subject matter experts in establishing a crosswalk\nbetween item specifications and content standards. This paper extends recent\nwork by proposing and demonstrating the use of multivariate similarity based on\nembedding vectors for sentences or texts. In particular, a hybrid regression\nprocedure is demonstrated for establishing the match of each content standard\nto multiple item specifications. The procedure is used to evaluate the match of\nthe Common Core State Standards (CCSS) for mathematics at grade 4 to the\ncorresponding item specifications for the 2026 National Assessment of\nEducational Progress (NAEP).", "paper_summary_zh": "自然語言處理 (NLP) 正在快速發展，可用於教育評量的應用程式。在本文中，我描述了一個基於 NLP 的程序，可用於支援主題專家在項目規格和內容標準之間建立對應關係。本文透過提出和展示基於句子或文字嵌入向量的多變量相似性使用，來延伸最近的研究。特別是，展示了一個混合回歸程序，用於建立每個內容標準與多個項目規格的匹配。此程序用於評估 4 年級數學的共同核心州標準 (CCSS) 與 2026 年國家教育進度評估 (NAEP) 的對應項目規格的匹配。", "author": "Gregory Camilli et.al.", "authors": "Gregory Camilli", "id": "2405.17284v1", "paper_url": "http://arxiv.org/abs/2405.17284v1", "repo": "null"}}