{"2501.08838": {"publish_time": "2025-01-15", "title": "ToMATO: Verbalizing the Mental States of Role-Playing LLMs for Benchmarking Theory of Mind", "paper_summary": "Existing Theory of Mind (ToM) benchmarks diverge from real-world scenarios in\nthree aspects: 1) they assess a limited range of mental states such as beliefs,\n2) false beliefs are not comprehensively explored, and 3) the diverse\npersonality traits of characters are overlooked. To address these challenges,\nwe introduce ToMATO, a new ToM benchmark formulated as multiple-choice QA over\nconversations. ToMATO is generated via LLM-LLM conversations featuring\ninformation asymmetry. By employing a prompting method that requires\nrole-playing LLMs to verbalize their thoughts before each utterance, we capture\nboth first- and second-order mental states across five categories: belief,\nintention, desire, emotion, and knowledge. These verbalized thoughts serve as\nanswers to questions designed to assess the mental states of characters within\nconversations. Furthermore, the information asymmetry introduced by hiding\nthoughts from others induces the generation of false beliefs about various\nmental states. Assigning distinct personality traits to LLMs further\ndiversifies both utterances and thoughts. ToMATO consists of 5.4k questions,\n753 conversations, and 15 personality trait patterns. Our analysis shows that\nthis dataset construction approach frequently generates false beliefs due to\nthe information asymmetry between role-playing LLMs, and effectively reflects\ndiverse personalities. We evaluate nine LLMs on ToMATO and find that even\nGPT-4o mini lags behind human performance, especially in understanding false\nbeliefs, and lacks robustness to various personality traits.", "paper_summary_zh": "現有的心智理論 (ToM) 基準在三個方面與真實世界的場景有所不同：1) 它們評估的範圍僅限於信念等心智狀態，2) 沒有全面探討錯誤信念，以及 3) 忽略了角色的多樣化人格特質。為了應對這些挑戰，我們引入了 ToMATO，這是一個新的 ToM 基準，以多選題問答的形式制定，內容是對話。ToMATO 是透過具有資訊不對稱的 LLM-LLM 對話所產生。透過採用一種提示方法，要求角色扮演 LLM 在每次發言前將其想法口頭化，我們捕捉到了五種類別的一階和二階心智狀態：信念、意圖、慾望、情緒和知識。這些口頭化的想法可用於回答問題，這些問題旨在評估對話中角色的心智狀態。此外，透過隱藏他人想法所產生的資訊不對稱，會導致對各種心智狀態產生錯誤信念。為 LLM 分配不同的個性特質，進一步使發言和想法多樣化。ToMATO 由 5.4k 個問題、753 個對話和 15 種個性特質模式組成。我們的分析顯示，這種資料集建構方法由於角色扮演 LLM 之間的資訊不對稱，經常會產生錯誤信念，並有效地反映出不同的個性。我們在 ToMATO 上評估了九個 LLM，發現即使是 GPT-4o mini 也落後於人類表現，特別是在理解錯誤信念方面，並且缺乏對各種個性特質的穩健性。", "author": "Kazutoshi Shinoda et.al.", "authors": "Kazutoshi Shinoda, Nobukatsu Hojo, Kyosuke Nishida, Saki Mizuno, Keita Suzuki, Ryo Masumura, Hiroaki Sugiyama, Kuniko Saito", "id": "2501.08838v1", "paper_url": "http://arxiv.org/abs/2501.08838v1", "repo": "https://github.com/nttmdlab-nlp/ToMATO"}}