{"2504.08584": {"publish_time": "2025-04-11", "title": "Boosting multi-demographic federated learning for chest x-ray analysis using general-purpose self-supervised representations", "paper_summary": "Reliable artificial intelligence (AI) models for medical image analysis often\ndepend on large and diverse labeled datasets. Federated learning (FL) offers a\ndecentralized and privacy-preserving approach to training but struggles in\nhighly non-independent and identically distributed (non-IID) settings, where\ninstitutions with more representative data may experience degraded performance.\nMoreover, existing large-scale FL studies have been limited to adult datasets,\nneglecting the unique challenges posed by pediatric data, which introduces\nadditional non-IID variability. To address these limitations, we analyzed\nn=398,523 adult chest radiographs from diverse institutions across multiple\ncountries and n=9,125 pediatric images, leveraging transfer learning from\ngeneral-purpose self-supervised image representations to classify pneumonia and\ncases with no abnormality. Using state-of-the-art vision transformers, we found\nthat FL improved performance only for smaller adult datasets (P<0.001) but\ndegraded performance for larger datasets (P<0.064) and pediatric cases\n(P=0.242). However, equipping FL with self-supervised weights significantly\nenhanced outcomes across pediatric cases (P=0.031) and most adult datasets\n(P<0.008), except the largest dataset (P=0.052). These findings underscore the\npotential of easily deployable general-purpose self-supervised image\nrepresentations to address non-IID challenges in clinical FL applications and\nhighlight their promise for enhancing patient outcomes and advancing pediatric\nhealthcare, where data scarcity and variability remain persistent obstacles.", "paper_summary_zh": "可靠的醫學影像分析人工智慧 (AI) 模型通常依賴於大型且多樣化的標記數據集。聯邦學習 (FL) 提供了一種去中心化且保護隱私的訓練方法，但在高度非獨立同分佈 (non-IID) 的情況下會遇到困難，其中擁有更具代表性數據的機構可能會遇到效能下降的問題。此外，現有的大規模 FL 研究僅限於成人數據集，忽略了兒科數據帶來的獨特挑戰，這會引入額外的 non-IID 變異性。為了克服這些限制，我們分析了來自多個國家不同機構的 n=398,523 張成人胸部 X 光片和 n=9,125 張兒科影像，利用從通用自監督影像表示的遷移學習來分類肺炎和無異常的病例。使用最先進的視覺轉換器，我們發現FL 僅針對較小的成人數據集提高了效能 (P<0.001)，但降低了較大數據集 (P<0.064) 和兒科病例 (P=0.242) 的效能。然而，為 FL 配備自監督權重顯著提升了兒科病例 (P=0.031) 和大多數成人數據集 (P<0.008) 的結果，除了最大的數據集 (P=0.052)。這些發現強調了易於部署的通用自監督影像表示在應對臨床 FL 應用中的 non-IID 挑戰方面的潛力，並突出了它們在改善患者治療結果和促進兒科醫療保健方面的希望，在這些領域，數據稀缺性和變異性仍然是持續存在的障礙。\n", "author": "Mahshad Lotfinia et.al.", "authors": "Mahshad Lotfinia, Arash Tayebiarasteh, Samaneh Samiei, Mehdi Joodaki, Soroosh Tayebi Arasteh", "id": "2504.08584v1", "paper_url": "http://arxiv.org/abs/2504.08584v1", "repo": "null"}}