{"2412.09036": {"publish_time": "2024-12-12", "title": "ZigZagkv: Dynamic KV Cache Compression for Long-context Modeling based on Layer Uncertainty", "paper_summary": "Large Language models (LLMs) have become a research hotspot. To accelerate\nthe inference of LLMs, storing computed caches in memory has become the\nstandard technique. However, as the inference length increases, growing KV\ncaches might lead to out-of-memory issues. Many existing methods address this\nissue through KV cache compression, primarily by preserving key tokens\nthroughout all layers to reduce information loss. Most of them allocate a\nuniform budget size for each layer to retain. However, we observe that the\nminimum budget sizes needed to retain essential information vary across layers\nand models based on the perspectives of attention and hidden state output.\nBuilding on this observation, this paper proposes a simple yet effective KV\ncache compression method that leverages layer uncertainty to allocate budget\nsize for each layer. Experimental results show that the proposed method can\nreduce memory usage of the KV caches to only $\\sim$20\\% when compared to Full\nKV inference while achieving nearly lossless performance.", "paper_summary_zh": "大型語言模型 (LLM) 已成為研究熱點。為了加速 LLM 的推論，將計算好的快取儲存在記憶體中已成為標準技術。然而，隨著推論長度的增加，不斷增長的 KV 快取可能會導致記憶體不足的問題。許多現有方法透過 KV 快取壓縮來解決這個問題，主要是透過在所有層中保留關鍵代碼，以減少資訊遺失。它們大多數會為每個層分配一個均勻的預算大小來保留。然而，我們觀察到，基於注意力和隱藏狀態輸出的觀點，保留必要資訊所需的最小預算大小會因層和模型而異。基於此觀察，本文提出一個簡單但有效的 KV 快取壓縮方法，該方法利用層不確定性為每個層分配預算大小。實驗結果顯示，與完整 KV 推論相比，所提出的方法可以將 KV 快取的記憶體使用量減少到僅約 20%，同時實現幾乎無損失的效能。", "author": "Meizhi Zhong et.al.", "authors": "Meizhi Zhong, Xikai Liu, Chen Zhang, Yikun Lei, Yan Gao, Yao Hu, Kehai Chen, Min Zhang", "id": "2412.09036v1", "paper_url": "http://arxiv.org/abs/2412.09036v1", "repo": "null"}}