{"2405.11655": {"publish_time": "2024-05-19", "title": "Track Anything Rapter(TAR)", "paper_summary": "Object tracking is a fundamental task in computer vision with broad practical\napplications across various domains, including traffic monitoring, robotics,\nand autonomous vehicle tracking. In this project, we aim to develop a\nsophisticated aerial vehicle system known as Track Anything Raptor (TAR),\ndesigned to detect, segment, and track objects of interest based on\nuser-provided multimodal queries, such as text, images, and clicks. TAR\nutilizes cutting-edge pre-trained models like DINO, CLIP, and SAM to estimate\nthe relative pose of the queried object. The tracking problem is approached as\na Visual Servoing task, enabling the UAV to consistently focus on the object\nthrough advanced motion planning and control algorithms. We showcase how the\nintegration of these foundational models with a custom high-level control\nalgorithm results in a highly stable and precise tracking system deployed on a\ncustom-built PX4 Autopilot-enabled Voxl2 M500 drone. To validate the tracking\nalgorithm's performance, we compare it against Vicon-based ground truth.\nAdditionally, we evaluate the reliability of the foundational models in aiding\ntracking in scenarios involving occlusions. Finally, we test and validate the\nmodel's ability to work seamlessly with multiple modalities, such as click,\nbounding box, and image templates.", "paper_summary_zh": "物體追蹤是電腦視覺中的一項基本任務，在包括交通監控、機器人和自動車輛追蹤等多種領域都有廣泛的實際應用。在這個專案中，我們的目標是開發一個稱為 Track Anything Raptor (TAR) 的先進空中載具系統，旨在根據使用者提供的多模態查詢（例如文字、影像和點擊）來偵測、分割和追蹤感興趣的物體。TAR 利用 DINO、CLIP 和 SAM 等先進的預先訓練模型來估計查詢物體的相對位姿。追蹤問題被視為一個視覺伺服任務，讓無人機能夠透過先進的運動規劃和控制演算法持續對焦在物體上。我們展示了這些基礎模型與自訂高階控制演算法整合後，如何產生一個部署在自訂 PX4 Autopilot 支援的 Voxl2 M500 無人機上的高度穩定且精確的追蹤系統。為了驗證追蹤演算法的效能，我們將其與基於 Vicon 的地面實況進行比較。此外，我們評估了基礎模型在協助追蹤遮擋情境中的可靠性。最後，我們測試並驗證了模型與多種模態（例如點擊、邊界框和影像範本）無縫運作的能力。", "author": "Tharun V. Puthanveettil et.al.", "authors": "Tharun V. Puthanveettil, Fnu Obaid ur Rahman", "id": "2405.11655v1", "paper_url": "http://arxiv.org/abs/2405.11655v1", "repo": "null"}}