{"2406.09388": {"publish_time": "2024-06-13", "title": "Exploring the Spectrum of Visio-Linguistic Compositionality and Recognition", "paper_summary": "Vision and language models (VLMs) such as CLIP have showcased remarkable\nzero-shot recognition abilities yet face challenges in visio-linguistic\ncompositionality, particularly in linguistic comprehension and fine-grained\nimage-text alignment. This paper explores the intricate relationship between\ncompositionality and recognition -- two pivotal aspects of VLM capability. We\nconduct a comprehensive evaluation of existing VLMs, covering both pre-training\napproaches aimed at recognition and the fine-tuning methods designed to improve\ncompositionality. Our evaluation employs 12 benchmarks for compositionality,\nalong with 21 zero-shot classification and two retrieval benchmarks for\nrecognition. In our analysis from 274 CLIP model checkpoints, we reveal\npatterns and trade-offs that emerge between compositional understanding and\nrecognition accuracy. Ultimately, this necessitates strategic efforts towards\ndeveloping models that improve both capabilities, as well as the meticulous\nformulation of benchmarks for compositionality. We open our evaluation\nframework at https://github.com/ytaek-oh/vl_compo.", "paper_summary_zh": "視覺和語言模型 (VLM)，例如 CLIP，展示了非凡的零次學習辨識能力，但卻在視覺語言的組成性方面面臨挑戰，特別是在語言理解和細緻的影像文字對齊上。本文探討了組成性和辨識之間的複雜關係，這是 VLM 能力的兩個關鍵面向。我們對現有的 VLM 進行全面評估，涵蓋了針對辨識的預訓練方法和旨在改善組成性的微調方法。我們的評估採用了 12 個組成性基準，以及 21 個零次學習分類和兩個用於辨識的檢索基準。在我們對 274 個 CLIP 模型檢查點的分析中，我們揭示了組成理解和辨識準確度之間出現的模式和權衡。最終，這需要策略性地努力開發能改善這兩種能力的模型，以及仔細制定組成性的基準。我們在 https://github.com/ytaek-oh/vl_compo 開放我們的評估架構。", "author": "Youngtaek Oh et.al.", "authors": "Youngtaek Oh, Pyunghwan Ahn, Jinhyung Kim, Gwangmo Song, Soonyoung Lee, In So Kweon, Junmo Kim", "id": "2406.09388v1", "paper_url": "http://arxiv.org/abs/2406.09388v1", "repo": "https://github.com/ytaek-oh/vl_compo"}}