{"2504.05196": {"publish_time": "2025-04-07", "title": "Universal Lymph Node Detection in Multiparametric MRI with Selective Augmentation", "paper_summary": "Robust localization of lymph nodes (LNs) in multiparametric MRI (mpMRI) is\ncritical for the assessment of lymphadenopathy. Radiologists routinely measure\nthe size of LN to distinguish benign from malignant nodes, which would require\nsubsequent cancer staging. Sizing is a cumbersome task compounded by the\ndiverse appearances of LNs in mpMRI, which renders their measurement difficult.\nFurthermore, smaller and potentially metastatic LNs could be missed during a\nbusy clinical day. To alleviate these imaging and workflow problems, we propose\na pipeline to universally detect both benign and metastatic nodes in the body\nfor their ensuing measurement. The recently proposed VFNet neural network was\nemployed to identify LN in T2 fat suppressed and diffusion weighted imaging\n(DWI) sequences acquired by various scanners with a variety of exam protocols.\nWe also use a selective augmentation technique known as Intra-Label LISA (ILL)\nto diversify the input data samples the model sees during training, such that\nit improves its robustness during the evaluation phase. We achieved a\nsensitivity of $\\sim$83\\% with ILL vs. $\\sim$80\\% without ILL at 4 FP/vol.\nCompared with current LN detection approaches evaluated on mpMRI, we show a\nsensitivity improvement of $\\sim$9\\% at 4 FP/vol.", "paper_summary_zh": "<paragraph>在多參數磁振造影 (mpMRI) 中，準確定位淋巴結 (LNs) 對於評估淋巴結腫大至關重要。放射科醫師通常會測量淋巴結的大小來區分良性與惡性淋巴結，惡性淋巴結需要進行後續的癌症分期。淋巴結在 mpMRI 中呈現多樣化的外觀，使得測量變得困難，也讓尺寸測量成為一項繁瑣的任務。此外，在繁忙的臨床工作中，較小且可能轉移的淋巴結可能會被遺漏。為了減輕這些影像和工作流程上的問題，我們提出了一個流程，可以普遍地檢測體內良性和轉移性淋巴結，以便進行後續的測量。我們採用了最近提出的 VFNet 神經網路來識別以各種掃描儀和各種檢查方案所獲得的 T2 脂肪抑制和擴散加權成像 (DWI) 序列中的淋巴結。我們還使用了一種稱為標籤內局部重要性感知 (ILL) 的選擇性增強技術，使模型在訓練期間看到更多樣化的輸入數據樣本，從而在評估階段提高其穩健性。在 4 個 FP/vol 的情況下，使用 ILL 的靈敏度達到約 83%，而未使用 ILL 的靈敏度約為 80%。與目前在 mpMRI 上評估的淋巴結檢測方法相比，我們在 4 個 FP/vol 的情況下顯示出約 9% 的靈敏度提升。</paragraph>\n", "author": "Tejas Sudharshan Mathai et.al.", "authors": "Tejas Sudharshan Mathai, Sungwon Lee, Thomas C. Shen, Zhiyong Lu, Ronald M. Summers", "id": "2504.05196v1", "paper_url": "http://arxiv.org/abs/2504.05196v1", "repo": "null"}}