{"2405.19874": {"publish_time": "2024-05-30", "title": "Is In-Context Learning Sufficient for Instruction Following in LLMs?", "paper_summary": "In-context learning (ICL) allows LLMs to learn from examples without changing\ntheir weights, which is a particularly promising capability for long-context\nLLMs that can potentially learn from many examples. Recently, Lin et al. (2024)\nproposed URIAL, a method using only three in-context examples to align base\nLLMs, achieving non-trivial instruction following performance. In this work, we\nshow that, while effective, ICL alignment with URIAL still underperforms\ncompared to instruction fine-tuning on established benchmarks such as MT-Bench\nand AlpacaEval 2.0 (LC), especially with more capable base LMs. Unlike for\ntasks such as classification, translation, or summarization, adding more ICL\ndemonstrations for long-context LLMs does not systematically improve\ninstruction following performance. To address this limitation, we derive a\ngreedy selection approach for ICL examples that noticeably improves\nperformance, yet without bridging the gap to instruction fine-tuning. Finally,\nwe provide a series of ablation studies to better understand the reasons behind\nthe remaining gap, and we show how some aspects of ICL depart from the existing\nknowledge and are specific to the instruction tuning setting. Overall, our work\nadvances the understanding of ICL as an alignment technique. We provide our\ncode at https://github.com/tml-epfl/icl-alignment.", "paper_summary_zh": "<paragraph>情境式學習 (ICL) 讓大型語言模型 (LLM) 能夠從範例中學習，而無需改變其權重，這對於潛在能從許多範例中學習的長情境 LLM 而言，是一種特別有前途的能力。最近，Lin 等人 (2024) 提出 URIAL，一種僅使用三個情境式範例來比對基礎 LLM 的方法，實現了非平凡的指令遵循效能。在這項工作中，我們證明，儘管有效，但與在既定的基準（例如 MT-Bench 和 AlpacaEval 2.0 (LC)）上進行指令微調相比，ICL 比對與 URIAL 仍然表現不佳，特別是對於功能更強大的基礎 LLM。與分類、翻譯或摘要等任務不同，為長情境 LLM 加入更多 ICL 示範並不會系統性地改善指令遵循效能。為了解決這個限制，我們推導出一個針對 ICL 範例的貪婪選擇方法，顯著改善了效能，但並未彌合與指令微調之間的差距。最後，我們提供了一系列消融研究，以更好地了解造成剩餘差距的原因，並展示 ICL 的某些方面如何偏離現有知識，並且特定於指令調整設定。總體而言，我們的研究促進了對 ICL 作為比對技術的理解。我們在 https://github.com/tml-epfl/icl-alignment 提供我們的程式碼。</paragraph>", "author": "Hao Zhao et.al.", "authors": "Hao Zhao, Maksym Andriushchenko, Francesco Croce, Nicolas Flammarion", "id": "2405.19874v1", "paper_url": "http://arxiv.org/abs/2405.19874v1", "repo": "null"}}