{"2411.19650": {"publish_time": "2024-11-29", "title": "CogACT: A Foundational Vision-Language-Action Model for Synergizing Cognition and Action in Robotic Manipulation", "paper_summary": "The advancement of large Vision-Language-Action (VLA) models has\nsignificantly improved robotic manipulation in terms of language-guided task\nexecution and generalization to unseen scenarios. While existing VLAs adapted\nfrom pretrained large Vision-Language-Models (VLM) have demonstrated promising\ngeneralizability, their task performance is still unsatisfactory as indicated\nby the low tasks success rates in different environments. In this paper, we\npresent a new advanced VLA architecture derived from VLM. Unlike previous works\nthat directly repurpose VLM for action prediction by simple action\nquantization, we propose a omponentized VLA architecture that has a specialized\naction module conditioned on VLM output. We systematically study the design of\nthe action module and demonstrates the strong performance enhancement with\ndiffusion action transformers for action sequence modeling, as well as their\nfavorable scaling behaviors. We also conduct comprehensive experiments and\nablation studies to evaluate the efficacy of our models with varied designs.\nThe evaluation on 5 robot embodiments in simulation and real work shows that\nour model not only significantly surpasses existing VLAs in task performance\nand but also exhibits remarkable adaptation to new robots and generalization to\nunseen objects and backgrounds. It exceeds the average success rates of OpenVLA\nwhich has similar model size (7B) with ours by over 35% in simulated evaluation\nand 55% in real robot experiments. It also outperforms the large RT-2-X model\n(55B) by 18% absolute success rates in simulation. Code and models can be found\non our project page (https://cogact.github.io/).", "paper_summary_zh": "大型視覺語言動作 (VLA) 模型的進步在語言引導任務執行和廣泛化到未見場景方面顯著改善了機器人操作。儘管從預訓練大型視覺語言模型 (VLM) 改編的現有 VLA 已展現出有希望的廣泛化能力，但根據不同環境中的低任務成功率顯示，其任務執行能力仍不令人滿意。在本文中，我們提出了一個源自 VLM 的新進階 VLA 架構。與先前直接重新利用 VLM 進行動作預測的著作不同，我們提出了一個組件化的 VLA 架構，其具有基於 VLM 輸出的專用動作模組。我們系統性地研究動作模組的設計，並展示了擴散動作Transformer在動作序列建模方面的強勁效能提升，以及它們有利的擴充行為。我們還進行了全面的實驗和消融研究，以評估我們設計多變的模型的功效。在模擬和實際工作中對 5 個機器人實體的評估顯示，我們的模型不僅在任務執行方面顯著超越現有的 VLA，而且還展現出對新機器人的顯著適應性和對未見物體和背景的廣泛化能力。它超過了 OpenVLA 的平均成功率，而 OpenVLA 具有與我們相似的模型大小 (7B)，在模擬評估中高出 35%，在真實機器人實驗中高出 55%。它還在模擬中以 18% 的絕對成功率優於大型 RT-2-X 模型 (55B)。程式碼和模型可以在我們的專案頁面 (https://cogact.github.io/) 中找到。", "author": "Qixiu Li et.al.", "authors": "Qixiu Li, Yaobo Liang, Zeyu Wang, Lin Luo, Xi Chen, Mozheng Liao, Fangyun Wei, Yu Deng, Sicheng Xu, Yizhong Zhang, Xiaofan Wang, Bei Liu, Jianlong Fu, Jianmin Bao, Dong Chen, Yuanchun Shi, Jiaolong Yang, Baining Guo", "id": "2411.19650v1", "paper_url": "http://arxiv.org/abs/2411.19650v1", "repo": "null"}}