{"2501.01709": {"publish_time": "2025-01-03", "title": "MoVE-KD: Knowledge Distillation for VLMs with Mixture of Visual Encoders", "paper_summary": "Visual encoders are fundamental components in vision-language models (VLMs),\neach showcasing unique strengths derived from various pre-trained visual\nfoundation models. To leverage the various capabilities of these encoders,\nrecent studies incorporate multiple encoders within a single VLM, leading to a\nconsiderable increase in computational cost. In this paper, we present\nMixture-of-Visual-Encoder Knowledge Distillation (MoVE-KD), a novel framework\nthat distills the unique proficiencies of multiple vision encoders into a\nsingle, efficient encoder model. Specifically, to mitigate conflicts and retain\nthe unique characteristics of each teacher encoder, we employ low-rank\nadaptation (LoRA) and mixture-of-experts (MoEs) to selectively activate\nspecialized knowledge based on input features, enhancing both adaptability and\nefficiency. To regularize the KD process and enhance performance, we propose an\nattention-based distillation strategy that adaptively weighs the different\nvisual encoders and emphasizes valuable visual tokens, reducing the burden of\nreplicating comprehensive but distinct features from multiple teachers.\nComprehensive experiments on popular VLMs, such as LLaVA and LLaVA-NeXT,\nvalidate the effectiveness of our method. The code will be released.", "paper_summary_zh": "視覺編碼器是視覺語言模型 (VLM) 中的基本組成部分，\n每個編碼器都展示了源自各種預先訓練的視覺\n基礎模型的獨特優勢。為了利用這些編碼器的各種功能，\n最近的研究在單一 VLM 中納入了多個編碼器，導致計算成本大幅增加。在本文中，我們提出\n混合視覺編碼器知識萃取 (MoVE-KD)，一種新穎的架構\n它將多個視覺編碼器的獨特能力萃取到一個\n單一、高效的編碼器模型中。具體來說，為了緩解衝突並保留\n每個教師編碼器的獨特特徵，我們採用低秩\n適應 (LoRA) 和專家混合 (MoE) 來選擇性地根據輸入特徵啟動\n專業知識，從而提高適應性和\n效率。為了規範 KD 程序並增強性能，我們提出了一種\n基於注意力的萃取策略，它自適應地權衡不同的\n視覺編碼器並強調有價值的視覺代幣，減輕了\n複製來自多個教師的全面但不同的特徵的負擔。\n對流行的 VLM（例如 LLaVA 和 LLaVA-NeXT）進行的全面實驗，\n驗證了我們方法的有效性。代碼將會發布。", "author": "Jiajun Cao et.al.", "authors": "Jiajun Cao, Yuan Zhang, Tao Huang, Ming Lu, Qizhe Zhang, Ruichuan An, Ningning MA, Shanghang Zhang", "id": "2501.01709v1", "paper_url": "http://arxiv.org/abs/2501.01709v1", "repo": "null"}}