{"2409.14181": {"publish_time": "2024-09-21", "title": "Democratising Artificial Intelligence for Pandemic Preparedness and Global Governance in Latin American and Caribbean Countries", "paper_summary": "Infectious diseases, transmitted directly or indirectly, are among the\nleading causes of epidemics and pandemics. Consequently, several open\nchallenges exist in predicting epidemic outbreaks, detecting variants, tracing\ncontacts, discovering new drugs, and fighting misinformation. Artificial\nIntelligence (AI) can provide tools to deal with these scenarios, demonstrating\npromising results in the fight against the COVID-19 pandemic. AI is becoming\nincreasingly integrated into various aspects of society. However, ensuring that\nAI benefits are distributed equitably and that they are used responsibly is\ncrucial. Multiple countries are creating regulations to address these concerns,\nbut the borderless nature of AI requires global cooperation to define\nregulatory and guideline consensus. Considering this, The Global South AI for\nPandemic & Epidemic Preparedness & Response Network (AI4PEP) has developed an\ninitiative comprising 16 projects across 16 countries in the Global South,\nseeking to strengthen equitable and responsive public health systems that\nleverage Southern-led responsible AI solutions to improve prevention,\npreparedness, and response to emerging and re-emerging infectious disease\noutbreaks. This opinion introduces our branches in Latin American and Caribbean\n(LAC) countries and discusses AI governance in LAC in the light of\nbiotechnology. Our network in LAC has high potential to help fight infectious\ndiseases, particularly in low- and middle-income countries, generating\nopportunities for the widespread use of AI techniques to improve the health and\nwell-being of their communities.", "paper_summary_zh": "傳染病的直接或間接傳播是造成流行病和全球大流行的主要原因之一。因此，在預測流行病爆發、檢測變異株、追蹤接觸者、發現新藥物和對抗錯誤訊息方面存在許多未解決的挑戰。人工智慧 (AI) 可提供應對這些情境的工具，在對抗 COVID-19 大流行方面展現出令人振奮的成果。AI 正日益融入社會的各個層面。然而，確保 AI 的好處能公平分配且負責任地使用至關重要。許多國家正制定法規來解決這些問題，但 AI 的無國界性質需要全球合作才能定義法規和指導方針的共識。有鑑於此，全球南方 AI 防疫和流行病防範及應變網路 (AI4PEP) 已開發一項計畫，包含全球南方 16 個國家/地區的 16 個專案，旨在強化公平且具應變能力的公共衛生系統，並利用南方主導的負責任 AI 解決方案來改善對新興和再興傳染病爆發的預防、防範和應變。本意見書介紹我們在拉丁美洲和加勒比海 (LAC) 國家的分支機構，並根據生物技術探討 LAC 中的 AI 治理。我們在 LAC 的網路極具潛力，有助於對抗傳染病，特別是在低收入和中等收入國家，並為廣泛使用 AI 技術創造機會，以改善其社區的健康和福祉。", "author": "Andre de Carvalho et.al.", "authors": "Andre de Carvalho, Robson Bonidia, Jude Dzevela Kong, Mariana Dauhajre, Claudio Struchiner, Guilherme Goedert, Peter F. Stadler, Maria Emilia Walter, Danilo Sanches, Troy Day, Marcia Castro, John Edmunds, Manuel Colome-Hidalgo, Demian Arturo Herrera Morban, Edian F. Franco, Cesar Ugarte-Gil, Patricia Espinoza-Lopez, Gabriel Carrasco-Escobar, Ulisses Rocha", "id": "2409.14181v1", "paper_url": "http://arxiv.org/abs/2409.14181v1", "repo": "null"}}