{"2502.12082": {"publish_time": "2025-02-17", "title": "AdaSplash: Adaptive Sparse Flash Attention", "paper_summary": "The computational cost of softmax-based attention in transformers limits\ntheir applicability to long-context tasks. Adaptive sparsity, of which\n$\\alpha$-entmax attention is an example, offers a flexible data-dependent\nalternative, but existing implementations are inefficient and do not leverage\nthe sparsity to obtain runtime and memory gains. In this work, we propose\nAdaSplash, which combines the efficiency of GPU-optimized algorithms with the\nsparsity benefits of $\\alpha$-entmax. We first introduce a hybrid\nHalley-bisection algorithm, resulting in a 7-fold reduction in the number of\niterations needed to compute the $\\alpha$-entmax transformation. Then, we\nimplement custom Triton kernels to efficiently handle adaptive sparsity.\nExperiments with RoBERTa and ModernBERT for text classification and\nsingle-vector retrieval, along with GPT-2 for language modeling, show that our\nmethod achieves substantial improvements in runtime and memory efficiency\ncompared to existing $\\alpha$-entmax implementations. It approaches -- and in\nsome cases surpasses -- the efficiency of highly optimized softmax\nimplementations like FlashAttention-2, enabling long-context training while\nmaintaining strong task performance.", "paper_summary_zh": "基於 softmax 的注意力在 Transformer 中的運算成本限制了它們在長內容任務中的應用性。適應性稀疏性，其中 $\\alpha$-entmax 注意力是一個例子，提供了一個靈活的資料相關替代方案，但現有的實作效率低下，且無法利用稀疏性來獲得執行時間和記憶體的增益。在這項工作中，我們提出了 AdaSplash，它結合了 GPU 最佳化演算法的效率和 $\\alpha$-entmax 的稀疏性優點。我們首先引入了一個混合 Halley-二分法演算法，導致計算 $\\alpha$-entmax 轉換所需的迭代次數減少了 7 倍。然後，我們實作自訂 Triton 核心，以有效處理適應性稀疏性。針對文字分類和單一向量擷取的 RoBERTa 和 ModernBERT，以及用於語言建模的 GPT-2 的實驗顯示，與現有的 $\\alpha$-entmax 實作相比，我們的方法在執行時間和記憶體效率方面獲得了顯著的改善。它接近了 -- 在某些情況下超越了 -- 高度最佳化 softmax 實作（例如 FlashAttention-2）的效率，同時在維持強大任務效能的同時，能夠進行長內容訓練。", "author": "Nuno Gonçalves et.al.", "authors": "Nuno Gonçalves, Marcos Treviso, André F. T. Martins", "id": "2502.12082v1", "paper_url": "http://arxiv.org/abs/2502.12082v1", "repo": "null"}}