{"2407.15862": {"publish_time": "2024-07-16", "title": "Performance Evaluation of Lightweight Open-source Large Language Models in Pediatric Consultations: A Comparative Analysis", "paper_summary": "Large language models (LLMs) have demonstrated potential applications in\nmedicine, yet data privacy and computational burden limit their deployment in\nhealthcare institutions. Open-source and lightweight versions of LLMs emerge as\npotential solutions, but their performance, particularly in pediatric settings\nremains underexplored. In this cross-sectional study, 250 patient consultation\nquestions were randomly selected from a public online medical forum, with 10\nquestions from each of 25 pediatric departments, spanning from December 1,\n2022, to October 30, 2023. Two lightweight open-source LLMs, ChatGLM3-6B and\nVicuna-7B, along with a larger-scale model, Vicuna-13B, and the widely-used\nproprietary ChatGPT-3.5, independently answered these questions in Chinese\nbetween November 1, 2023, and November 7, 2023. To assess reproducibility, each\ninquiry was replicated once. We found that ChatGLM3-6B demonstrated higher\naccuracy and completeness than Vicuna-13B and Vicuna-7B (P < .001), but all\nwere outperformed by ChatGPT-3.5. ChatGPT-3.5 received the highest ratings in\naccuracy (65.2%) compared to ChatGLM3-6B (41.2%), Vicuna-13B (11.2%), and\nVicuna-7B (4.4%). Similarly, in completeness, ChatGPT-3.5 led (78.4%), followed\nby ChatGLM3-6B (76.0%), Vicuna-13B (34.8%), and Vicuna-7B (22.0%) in highest\nratings. ChatGLM3-6B matched ChatGPT-3.5 in readability, both outperforming\nVicuna models (P < .001). In terms of empathy, ChatGPT-3.5 outperformed the\nlightweight LLMs (P < .001). In safety, all models performed comparably well (P\n> .05), with over 98.4% of responses being rated as safe. Repetition of\ninquiries confirmed these findings. In conclusion, Lightweight LLMs demonstrate\npromising application in pediatric healthcare. However, the observed gap\nbetween lightweight and large-scale proprietary LLMs underscores the need for\ncontinued development efforts.", "paper_summary_zh": "大型語言模型 (LLM) 已展現出在醫療保健領域的潛在應用，但資料隱私和運算負擔限制了它們在醫療保健機構中的部署。開放原始碼和輕量級版本的 LLM 成為潛在的解決方案，但它們的效能，特別是在兒科領域的效能，仍未被充分探討。在這項橫斷面研究中，從一個公開的線上醫療論壇中隨機選取了 250 個患者諮詢問題，每個兒科部門各 10 個問題，時間跨度從 2022 年 12 月 1 日到 2023 年 10 月 30 日。兩個輕量級的開放原始碼 LLM，ChatGLM3-6B 和 Vicuna-7B，以及一個更大規模的模型 Vicuna-13B，還有廣泛使用的專有 ChatGPT-3.5，在 2023 年 11 月 1 日到 2023 年 11 月 7 日期間獨立用中文回答了這些問題。為了評估可複製性，每個查詢都複製了一次。我們發現 ChatGLM3-6B 的準確性和完整性高於 Vicuna-13B 和 Vicuna-7B (P < .001)，但所有這些都低於 ChatGPT-3.5。ChatGPT-3.5 在準確性方面獲得了最高評分 (65.2%)，而 ChatGLM3-6B (41.2%)、Vicuna-13B (11.2%) 和 Vicuna-7B (4.4%) 的評分較低。同樣地，在完整性方面，ChatGPT-3.5 領先 (78.4%)，其次是 ChatGLM3-6B (76.0%)、Vicuna-13B (34.8%) 和 Vicuna-7B (22.0%) 的評分最高。ChatGLM3-6B 在可讀性方面與 ChatGPT-3.5 相匹配，兩者都優於 Vicuna 模型 (P < .001)。在同理心方面，ChatGPT-3.5 優於輕量級 LLM (P < .001)。在安全性方面，所有模型的表現都相當好 (P > .05)，超過 98.4% 的回應被評為安全。查詢的重複確認了這些發現。結論是，輕量級 LLM 展示了在兒科醫療保健中的應用前景。然而，在輕量級和大型專有 LLM 之間觀察到的差距強調了持續開發工作的重要性。", "author": "Qiuhong Wei et.al.", "authors": "Qiuhong Wei, Ying Cui, Mengwei Ding, Yanqin Wang, Lingling Xiang, Zhengxiong Yao, Ceran Chen, Ying Long, Zhezhen Jin, Ximing Xu", "id": "2407.15862v1", "paper_url": "http://arxiv.org/abs/2407.15862v1", "repo": "null"}}