{"2405.11525": {"publish_time": "2024-05-19", "title": "Overcoming Data and Model Heterogeneities in Decentralized Federated Learning via Synthetic Anchors", "paper_summary": "Conventional Federated Learning (FL) involves collaborative training of a\nglobal model while maintaining user data privacy. One of its branches,\ndecentralized FL, is a serverless network that allows clients to own and\noptimize different local models separately, which results in saving management\nand communication resources. Despite the promising advancements in\ndecentralized FL, it may reduce model generalizability due to lacking a global\nmodel. In this scenario, managing data and model heterogeneity among clients\nbecomes a crucial problem, which poses a unique challenge that must be\novercome: How can every client's local model learn generalizable representation\nin a decentralized manner? To address this challenge, we propose a novel\nDecentralized FL technique by introducing Synthetic Anchors, dubbed as DeSA.\nBased on the theory of domain adaptation and Knowledge Distillation (KD), we\ntheoretically and empirically show that synthesizing global anchors based on\nraw data distribution facilitates mutual knowledge transfer. We further design\ntwo effective regularization terms for local training: 1) REG loss that\nregularizes the distribution of the client's latent embedding with the anchors\nand 2) KD loss that enables clients to learn from others. Through extensive\nexperiments on diverse client data distributions, we showcase the effectiveness\nof DeSA in enhancing both inter- and intra-domain accuracy of each client.", "paper_summary_zh": "傳統的聯合學習 (FL) 涉及在維護用戶資料隱私的同時，對全球模型進行協作訓練。其中一個分支，去中心化 FL，是一個無伺服器網路，允許客戶分別擁有和最佳化不同的本地模型，這有助於節省管理和通訊資源。儘管去中心化 FL 有著令人振奮的進展，但由於缺乏全球模型，它可能會降低模型的概括性。在這種情況下，管理客戶之間的資料和模型異質性成為一個關鍵問題，這提出了必須克服的獨特挑戰：每個客戶的本地模型如何在去中心化的方式下學習可概括的表示？為了應對這一挑戰，我們提出了一種新的去中心化 FL 技術，方法是引入合成錨點，稱為 DeSA。根據領域適應和知識蒸餾 (KD) 的理論，我們在理論上和經驗上證明，基於原始資料分佈合成全球錨點有助於相互知識轉移。我們進一步設計了兩個有效的正規化術語，用於本地訓練：1) REG 損失，它規範了客戶潛在嵌入與錨點的分布，以及 2) KD 損失，它使客戶能夠從他人那裡學習。透過在不同的客戶資料分佈上進行廣泛的實驗，我們展示了 DeSA 在提升每個客戶的域間和域內準確性方面的有效性。", "author": "Chun-Yin Huang et.al.", "authors": "Chun-Yin Huang, Kartik Srinivas, Xin Zhang, Xiaoxiao Li", "id": "2405.11525v1", "paper_url": "http://arxiv.org/abs/2405.11525v1", "repo": "null"}}