{"2409.20565": {"publish_time": "2024-09-30", "title": "Ranking Over Scoring: Towards Reliable and Robust Automated Evaluation of LLM-Generated Medical Explanatory Arguments", "paper_summary": "Evaluating LLM-generated text has become a key challenge, especially in\ndomain-specific contexts like the medical field. This work introduces a novel\nevaluation methodology for LLM-generated medical explanatory arguments, relying\non Proxy Tasks and rankings to closely align results with human evaluation\ncriteria, overcoming the biases typically seen in LLMs used as judges. We\ndemonstrate that the proposed evaluators are robust against adversarial\nattacks, including the assessment of non-argumentative text. Additionally, the\nhuman-crafted arguments needed to train the evaluators are minimized to just\none example per Proxy Task. By examining multiple LLM-generated arguments, we\nestablish a methodology for determining whether a Proxy Task is suitable for\nevaluating LLM-generated medical explanatory arguments, requiring only five\nexamples and two human experts.", "paper_summary_zh": "評估 LLM 生成的文字已成為一項關鍵挑戰，特別是在醫療領域等特定領域中。這項工作介紹了一種針對 LLM 生成的醫學解釋性論點的新穎評估方法，依賴代理任務和排名，以將結果與人類評估標準緊密對齊，克服了通常在用作評判的 LLM 中看到的偏差。我們證明了所提出的評估員對對抗性攻擊具有魯棒性，包括對非論證性文字的評估。此外，訓練評估員所需的人工論證已最小化，每個代理任務僅一個範例。通過檢查多個 LLM 生成的論點，我們建立了一種方法來確定代理任務是否適合評估 LLM 生成的醫學解釋性論點，只需要五個範例和兩位人類專家。", "author": "Iker De la Iglesia et.al.", "authors": "Iker De la Iglesia, Iakes Goenaga, Johanna Ramirez-Romero, Jose Maria Villa-Gonzalez, Josu Goikoetxea, Ander Barrena", "id": "2409.20565v1", "paper_url": "http://arxiv.org/abs/2409.20565v1", "repo": "null"}}