{"2410.18745": {"publish_time": "2024-10-24", "title": "Why Does the Effective Context Length of LLMs Fall Short?", "paper_summary": "Advancements in distributed training and efficient attention mechanisms have\nsignificantly expanded the context window sizes of large language models\n(LLMs). However, recent work reveals that the effective context lengths of\nopen-source LLMs often fall short, typically not exceeding half of their\ntraining lengths. In this work, we attribute this limitation to the left-skewed\nfrequency distribution of relative positions formed in LLMs pretraining and\npost-training stages, which impedes their ability to effectively gather distant\ninformation. To address this challenge, we introduce ShifTed Rotray position\nembeddING (STRING). STRING shifts well-trained positions to overwrite the\noriginal ineffective positions during inference, enhancing performance within\ntheir existing training lengths. Experimental results show that without\nadditional training, STRING dramatically improves the performance of the latest\nlarge-scale models, such as Llama3.1 70B and Qwen2 72B, by over 10 points on\npopular long-context benchmarks RULER and InfiniteBench, establishing new\nstate-of-the-art results for open-source LLMs. Compared to commercial models,\nLlama 3.1 70B with \\method even achieves better performance than GPT-4-128K and\nclearly surpasses Claude 2 and Kimi-chat.", "paper_summary_zh": "分布式训练和高效注意力机制的进步显著扩展了大型语言模型 (LLM) 的上下文窗口大小。然而，最近的研究表明，开源 LLM 的有效上下文长度通常不足，通常不超过其训练长度的一半。在这项工作中，我们将此限制归因于 LLM 预训练和训练后阶段形成的相对位置的左偏频率分布，这阻碍了它们有效收集远距离信息的能力。为了应对这一挑战，我们引入了 ShifTed Rotray 位置嵌入 (STRING)。STRING 在推理期间将训练良好的位置转移到覆盖原始无效位置，从而在现有训练长度内增强性能。实验结果表明，STRING 在不进行额外训练的情况下，将 Llama3.1 70B 和 Qwen2 72B 等最新的大规模模型在流行的长上下文基准 RULER 和 InfiniteBench 上的性能提高了 10 分以上，为开源 LLM 建立了新的最先进的结果。与商业模型相比，采用 \\method 的 Llama 3.1 70B 甚至比 GPT-4-128K 实现了更好的性能，并且明显超越了 Claude 2 和 Kimi-chat。", "author": "Chenxin An et.al.", "authors": "Chenxin An, Jun Zhang, Ming Zhong, Lei Li, Shansan Gong, Yao Luo, Jingjing Xu, Lingpeng Kong", "id": "2410.18745v1", "paper_url": "http://arxiv.org/abs/2410.18745v1", "repo": "null"}}