{"2412.14668": {"publish_time": "2024-12-19", "title": "LoLaFL: Low-Latency Federated Learning via Forward-only Propagation", "paper_summary": "Federated learning (FL) has emerged as a widely adopted paradigm for enabling\nedge learning with distributed data while ensuring data privacy. However, the\ntraditional FL with deep neural networks trained via backpropagation can hardly\nmeet the low-latency learning requirements in the sixth generation (6G) mobile\nnetworks. This challenge mainly arises from the high-dimensional model\nparameters to be transmitted and the numerous rounds of communication required\nfor convergence due to the inherent randomness of the training process. To\naddress this issue, we adopt the state-of-the-art principle of maximal coding\nrate reduction to learn linear discriminative features and extend the resultant\nwhite-box neural network into FL, yielding the novel framework of Low-Latency\nFederated Learning (LoLaFL) via forward-only propagation. LoLaFL enables\nlayer-wise transmissions and aggregation with significantly fewer communication\nrounds, thereby considerably reducing latency. Additionally, we propose two\n\\emph{nonlinear} aggregation schemes for LoLaFL. The first scheme is based on\nthe proof that the optimal NN parameter aggregation in LoLaFL should be\nharmonic-mean-like. The second scheme further exploits the low-rank structures\nof the features and transmits the low-rank-approximated covariance matrices of\nfeatures to achieve additional latency reduction. Theoretic analysis and\nexperiments are conducted to evaluate the performance of LoLaFL. In comparison\nwith traditional FL, the two nonlinear aggregation schemes for LoLaFL can\nachieve reductions in latency of over 91\\% and 98\\%, respectively, while\nmaintaining comparable accuracies.", "paper_summary_zh": "聯合學習 (FL) 已成為一種廣泛採用的範例，用於在確保資料隱私的同時，透過分散式資料進行邊緣學習。然而，透過反向傳播訓練的深度神經網路進行傳統 FL，難以滿足第六代 (6G) 行動網路中的低延遲學習需求。此挑戰主要來自於要傳輸的高維度模型參數，以及訓練過程中固有的隨機性，導致收斂需要進行多輪通訊。為了解決這個問題，我們採用最先進的最大編碼率降低原則，來學習線性判別特徵，並將結果的白盒神經網路延伸到 FL，透過僅前向傳播產生低延遲聯合學習 (LoLaFL) 的新架構。LoLaFL 能夠進行分層傳輸和聚合，且通訊輪次大幅減少，從而大幅降低延遲。此外，我們為 LoLaFL 提出兩種\\emph{非線性}聚合方案。第一個方案基於 LoLaFL 中最佳 NN 參數聚合應為調和平均數的證明。第二個方案進一步利用特徵的低秩結構，並傳輸特徵的低秩近似共變異數矩陣，以實現額外的延遲降低。進行理論分析和實驗，以評估 LoLaFL 的效能。與傳統 FL 相比，LoLaFL 的兩種非線性聚合方案可以將延遲分別降低超過 91% 和 98%，同時維持相當的準確度。", "author": "Jierui Zhang et.al.", "authors": "Jierui Zhang, Jianhao Huang, Kaibin Huang", "id": "2412.14668v1", "paper_url": "http://arxiv.org/abs/2412.14668v1", "repo": "null"}}