{"2408.11491": {"publish_time": "2024-08-21", "title": "Nothing in Excess: Mitigating the Exaggerated Safety for LLMs via Safety-Conscious Activation Steering", "paper_summary": "Safety alignment is indispensable for Large language models (LLMs) to defend\nthreats from malicious instructions. However, recent researches reveal\nsafety-aligned LLMs prone to reject benign queries due to the exaggerated\nsafety issue, limiting their helpfulness. In this paper, we propose a\nSafety-Conscious Activation Steering (SCANS) method to mitigate the exaggerated\nsafety concerns in aligned LLMs. First, SCANS extracts the refusal steering\nvectors within the activation space and utilizes vocabulary projection to\nanchor some specific safety-critical layers which influence model refusal\nbehavior. Second, by tracking the hidden state transition, SCANS identifies the\nsteering direction and steers the model behavior accordingly, achieving a\nbalance between exaggerated safety and adequate safety. Experiments show that\nSCANS achieves new state-of-the-art performance on XSTest and OKTest\nbenchmarks, without impairing their defense capability against harmful queries\nand maintaining almost unchanged model capability.", "paper_summary_zh": "大型語言模型 (LLM) 必須進行安全性校準，才能抵禦惡意指令的威脅。然而，最近的研究顯示，安全性校準的 LLM 容易拒絕良性查詢，因為安全問題被誇大了，這限制了它們的幫助性。在本文中，我們提出了一種安全性意識啟動導向 (SCANS) 方法，以減輕校準 LLM 中誇大的安全問題。首先，SCANS 會在啟動空間中提取拒絕導向向量，並利用詞彙投影來錨定一些特定會影響模型拒絕行為的安全關鍵層。其次，透過追蹤隱藏狀態轉換，SCANS 會識別導向方向，並據此導向模型行為，在誇大的安全性和適當的安全之間取得平衡。實驗顯示，SCANS 在 XSTest 和 OKTest 基準測試中達到了新的最先進效能，而不會損害它們對有害查詢的防禦能力，並維持幾乎不變的模型能力。", "author": "Zouying Cao et.al.", "authors": "Zouying Cao, Yifei Yang, Hai Zhao", "id": "2408.11491v1", "paper_url": "http://arxiv.org/abs/2408.11491v1", "repo": "null"}}