{"2408.06292": {"publish_time": "2024-08-12", "title": "The AI Scientist: Towards Fully Automated Open-Ended Scientific Discovery", "paper_summary": "One of the grand challenges of artificial general intelligence is developing\nagents capable of conducting scientific research and discovering new knowledge.\nWhile frontier models have already been used as aids to human scientists, e.g.\nfor brainstorming ideas, writing code, or prediction tasks, they still conduct\nonly a small part of the scientific process. This paper presents the first\ncomprehensive framework for fully automatic scientific discovery, enabling\nfrontier large language models to perform research independently and\ncommunicate their findings. We introduce The AI Scientist, which generates\nnovel research ideas, writes code, executes experiments, visualizes results,\ndescribes its findings by writing a full scientific paper, and then runs a\nsimulated review process for evaluation. In principle, this process can be\nrepeated to iteratively develop ideas in an open-ended fashion, acting like the\nhuman scientific community. We demonstrate its versatility by applying it to\nthree distinct subfields of machine learning: diffusion modeling,\ntransformer-based language modeling, and learning dynamics. Each idea is\nimplemented and developed into a full paper at a cost of less than $15 per\npaper. To evaluate the generated papers, we design and validate an automated\nreviewer, which we show achieves near-human performance in evaluating paper\nscores. The AI Scientist can produce papers that exceed the acceptance\nthreshold at a top machine learning conference as judged by our automated\nreviewer. This approach signifies the beginning of a new era in scientific\ndiscovery in machine learning: bringing the transformative benefits of AI\nagents to the entire research process of AI itself, and taking us closer to a\nworld where endless affordable creativity and innovation can be unleashed on\nthe world's most challenging problems. Our code is open-sourced at\nhttps://github.com/SakanaAI/AI-Scientist", "paper_summary_zh": "人工智能通才的一大難題，在於開發出有能力進行科學研究和發現新知識的代理人。儘管前沿模型已用於協助人類科學家，例如集思廣益、撰寫程式碼或預測任務，但它們仍只進行科學程序的一小部分。本文提出了第一個全自動科學發現的綜合架構，讓前沿大型語言模型能夠獨立進行研究並傳達其發現。我們介紹了「AI 科學家」，它會產生新的研究想法、撰寫程式碼、執行實驗、視覺化結果，並透過撰寫完整的科學論文來描述其發現，然後執行模擬審查程序進行評估。原則上，這個程序可以重複進行，以開放式的方式反覆發展想法，就像人類科學社群一樣。我們透過將其應用於機器學習的三個不同子領域來展示其多樣性：擴散模型、基於Transformer的語言模型和學習動態。每個想法都以每篇論文不到 15 美元的成本實作並發展成一篇完整的論文。為了評估產生的論文，我們設計並驗證了一個自動審查員，我們展示其在評估論文分數時達到了接近人類的表現。AI 科學家可以產生論文，其根據我們的自動審查員的判斷，超過了頂尖機器學習會議的接受門檻。這種方法標誌著機器學習科學發現新時代的開始：將 AI 代理人的轉型優勢帶入 AI 本身的整個研究程序，並讓我們更接近一個無盡且負擔得起的創意和創新能被釋放到世界上最具挑戰性問題的世界。我們的程式碼在 https://github.com/SakanaAI/AI-Scientist 開源。", "author": "Chris Lu et.al.", "authors": "Chris Lu, Cong Lu, Robert Tjarko Lange, Jakob Foerster, Jeff Clune, David Ha", "id": "2408.06292v1", "paper_url": "http://arxiv.org/abs/2408.06292v1", "repo": "https://github.com/sakanaai/ai-scientist"}}