{"2503.03532": {"publish_time": "2025-03-05", "title": "AI-Enabled Conversational Journaling for Advancing Parkinson's Disease Symptom Tracking", "paper_summary": "Journaling plays a crucial role in managing chronic conditions by allowing\npatients to document symptoms and medication intake, providing essential data\nfor long-term care. While valuable, traditional journaling methods often rely\non static, self-directed entries, lacking interactive feedback and real-time\nguidance. This gap can result in incomplete or imprecise information, limiting\nits usefulness for effective treatment. To address this gap, we introduce\nPATRIKA, an AI-enabled prototype designed specifically for people with\nParkinson's disease (PwPD). The system incorporates cooperative conversation\nprinciples, clinical interview simulations, and personalization to create a\nmore effective and user-friendly journaling experience. Through two user\nstudies with PwPD and iterative refinement of PATRIKA, we demonstrate\nconversational journaling's significant potential in patient engagement and\ncollecting clinically valuable information. Our results showed that generating\nprobing questions PATRIKA turned journaling into a bi-directional interaction.\nAdditionally, we offer insights for designing journaling systems for healthcare\nand future directions for promoting sustained journaling.", "paper_summary_zh": "寫日記在管理慢性病方面扮演著至關重要的角色，它讓病患可以記錄症狀和藥物攝取情況，為長期照護提供必要的數據。雖然傳統的日記方法很有價值，但它們通常依賴靜態的、自主的記錄，缺乏互動式的回饋和即時指導。這種缺失可能導致資訊不完整或不精確，從而限制了其在有效治療中的作用。為了彌補這個缺失，我們推出了 PATRIKA，這是一款專為帕金森氏症患者 (PwPD) 設計的AI 驅動原型。該系統結合了合作對話原則、臨床訪談模擬和個人化設定，以創造更有效且使用者友善的日記體驗。透過對 PwPD 的兩項使用者研究和 PATRIKA 的迭代改進，我們展示了對話式日記在提升病患參與度和收集具有臨床價值資訊方面的巨大潛力。我們的研究結果顯示，透過產生探索性問題，PATRIKA 將寫日記變成了一種雙向互動。此外，我們還提供了設計醫療保健日記系統的見解，以及促進持續寫日記的未來方向。\n", "author": "Mashrur Rashik et.al.", "authors": "Mashrur Rashik, Shilpa Sweth, Nishtha Agrawal, Saiyyam Kochar, Kara M Smith, Fateme Rajabiyazdi, Vidya Setlur, Narges Mahyar, Ali Sarvghad", "id": "2503.03532v1", "paper_url": "http://arxiv.org/abs/2503.03532v1", "repo": "https://github.com/mashrur29/AI-Enabled-Conversational-Journaling-Agent"}}