{"2405.08784": {"publish_time": "2024-05-14", "title": "Refinement of an Epilepsy Dictionary through Human Annotation of Health-related posts on Instagram", "paper_summary": "We used a dictionary built from biomedical terminology extracted from various\nsources such as DrugBank, MedDRA, MedlinePlus, TCMGeneDIT, to tag more than 8\nmillion Instagram posts by users who have mentioned an epilepsy-relevant drug\nat least once, between 2010 and early 2016. A random sample of 1,771 posts with\n2,947 term matches was evaluated by human annotators to identify\nfalse-positives. OpenAI's GPT series models were compared against human\nannotation. Frequent terms with a high false-positive rate were removed from\nthe dictionary. Analysis of the estimated false-positive rates of the annotated\nterms revealed 8 ambiguous terms (plus synonyms) used in Instagram posts, which\nwere removed from the original dictionary. To study the effect of removing\nthose terms, we constructed knowledge networks using the refined and the\noriginal dictionaries and performed an eigenvector-centrality analysis on both\nnetworks. We show that the refined dictionary thus produced leads to a\nsignificantly different rank of important terms, as measured by their\neigenvector-centrality of the knowledge networks. Furthermore, the most\nimportant terms obtained after refinement are of greater medical relevance. In\naddition, we show that OpenAI's GPT series models fare worse than human\nannotators in this task.", "paper_summary_zh": "我們使用從各種來源（例如 DrugBank、MedDRA、MedlinePlus、TCMGeneDIT）中提取的生物醫學術語所建構的詞典，標記了 2010 年至 2016 年初之間，超過 800 萬則至少提及過一次癲癇相關藥物的 Instagram 貼文。由人類註釋者評估了 1,771 則隨機抽樣貼文，其中包含 2,947 個詞彙比對，以找出假陽性。將 OpenAI 的 GPT 系列模型與人類註釋進行比較。從詞典中移除了假陽性率高的頻繁詞彙。對註釋詞彙的估計假陽性率進行分析，揭示了 Instagram 貼文中使用的 8 個模稜兩可的詞彙（加上同義詞），這些詞彙已從原始詞典中移除。為了研究移除這些詞彙的效果，我們使用精煉過的詞典和原始詞典建構了知識網路，並對這兩個網路執行特徵向量中心性分析。我們顯示，如此產生的精煉過詞典會導致重要詞彙的排名顯著不同，這是透過知識網路的特徵向量中心性來衡量的。此外，精煉後獲得的最重要詞彙具有更大的醫療相關性。此外，我們顯示 OpenAI 的 GPT 系列模型在這個任務中的表現比人類註釋者差。", "author": "Aehong Min et.al.", "authors": "Aehong Min, Xuan Wang, Rion Brattig Correia, Jordan Rozum, Wendy R. Miller, Luis M. Rocha", "id": "2405.08784v1", "paper_url": "http://arxiv.org/abs/2405.08784v1", "repo": "null"}}