{"2409.10969": {"publish_time": "2024-09-17", "title": "Enhancing Multilingual Speech Generation and Recognition Abilities in LLMs with Constructed Code-switched Data", "paper_summary": "While large language models (LLMs) have been explored in the speech domain\nfor both generation and recognition tasks, their applications are predominantly\nconfined to the monolingual scenario, with limited exploration in multilingual\nand code-switched (CS) contexts. Additionally, speech generation and\nrecognition tasks are often handled separately, such as VALL-E and Qwen-Audio.\nIn this paper, we propose a MutltiLingual MultiTask (MLMT) model, integrating\nmultilingual speech generation and recognition tasks within the single LLM.\nFurthermore, we develop an effective data construction approach that splits and\nconcatenates words from different languages to equip LLMs with CS synthesis\nability without relying on CS data. The experimental results demonstrate that\nour model outperforms other baselines with a comparable data scale.\nFurthermore, our data construction approach not only equips LLMs with CS speech\nsynthesis capability with comparable speaker consistency and similarity to any\ngiven speaker, but also improves the performance of LLMs in multilingual speech\ngeneration and recognition tasks.", "paper_summary_zh": "儘管大型語言模型 (LLM) 已在語音領域中探討生成和辨識任務，但其應用主要侷限於單語境，在多語言和代碼轉換 (CS) 語境中的探索有限。此外，語音生成和辨識任務通常是分開處理的，例如 VALL-E 和 Qwen-Audio。在本文中，我們提出一個多語言多任務 (MLMT) 模型，將多語言語音生成和辨識任務整合在單一 LLM 中。此外，我們開發一種有效資料建構方法，將不同語言的字詞拆分和串接，以具備 CS 合成能力的 LLM，而無需依賴 CS 資料。實驗結果證明，我們的模型優於其他基準，資料規模相當。此外，我們的資料建構方法不僅讓 LLM 具備 CS 語音合成能力，具有與任何特定說話者相當的說話者一致性和相似性，而且還提升了 LLM 在多語言語音生成和辨識任務中的效能。", "author": "Jing Xu et.al.", "authors": "Jing Xu, Daxin Tan, Jiaqi Wang, Xiao Chen", "id": "2409.10969v1", "paper_url": "http://arxiv.org/abs/2409.10969v1", "repo": "null"}}