{"2411.01373": {"publish_time": "2024-11-02", "title": "Medical X-Ray Image Enhancement Using Global Contrast-Limited Adaptive Histogram Equalization", "paper_summary": "In medical imaging, accurate diagnosis heavily relies on effective image\nenhancement techniques, particularly for X-ray images. Existing methods often\nsuffer from various challenges such as sacrificing global image characteristics\nover local image characteristics or vice versa. In this paper, we present a\nnovel approach, called G-CLAHE (Global-Contrast Limited Adaptive Histogram\nEqualization), which perfectly suits medical imaging with a focus on X-rays.\nThis method adapts from Global Histogram Equalization (GHE) and Contrast\nLimited Adaptive Histogram Equalization (CLAHE) to take both advantages and\navoid weakness to preserve local and global characteristics. Experimental\nresults show that it can significantly improve current state-of-the-art\nalgorithms to effectively address their limitations and enhance the contrast\nand quality of X-ray images for diagnostic accuracy.", "paper_summary_zh": "在醫學影像中，準確的診斷高度依賴於有效的影像增強技術，特別是 X 光影像。現有的方法通常會遇到各種挑戰，例如犧牲整體影像特性以換取局部影像特性，反之亦然。在本文中，我們提出了一種新穎的方法，稱為 G-CLAHE（全局對比度限制自適應直方圖均衡化），它非常適合於以 X 光為重點的醫學影像。此方法改編自全局直方圖均衡化 (GHE) 和對比度限制自適應直方圖均衡化 (CLAHE)，以取得兩者的優點，並避免弱點，以保留局部和全局特性。實驗結果表明，它可以顯著改善當前最先進的演算法，以有效解決其限制，並增強 X 光影像的對比度和品質，以利於診斷準確性。", "author": "Sohrab Namazi Nia et.al.", "authors": "Sohrab Namazi Nia, Frank Y. Shih", "id": "2411.01373v1", "paper_url": "http://arxiv.org/abs/2411.01373v1", "repo": "null"}}