{"2412.16420": {"publish_time": "2024-12-21", "title": "Beyond End-to-End VLMs: Leveraging Intermediate Text Representations for Superior Flowchart Understanding", "paper_summary": "Flowcharts are typically presented as images, driving the trend of using\nvision-language models (VLMs) for end-to-end flowchart understanding. However,\ntwo key challenges arise: (i) Limited controllability--users have minimal\ninfluence over the downstream task, as they can only modify input images, while\nthe training of VLMs is often out of reach for most researchers. (ii) Lack of\nexplainability--it is difficult to trace VLM errors to specific causes, such as\nfailures in visual encoding or reasoning. We propose TextFlow, addressing\naforementioned issues with two stages: (i) Vision Textualizer--which generates\ntextual representations from flowchart images; and (ii) Textual Reasoner--which\nperforms question-answering based on the text representations. TextFlow offers\nthree key advantages: (i) users can select the type of text representations\n(e.g., Graphviz, Mermaid, PlantUML), or further convert them into executable\ngraph object to call tools, enhancing performance and controllability; (ii) it\nimproves explainability by helping to attribute errors more clearly to visual\nor textual processing components; and (iii) it promotes the modularization of\nthe solution, such as allowing advanced LLMs to be used in the Reasoner stage\nwhen VLMs underperform in end-to-end fashion. Experiments on the FlowVQA and\nFlowLearn benchmarks demonstrate TextFlow's state-of-the-art performance as\nwell as its robustness. All code is publicly available.", "paper_summary_zh": "流程圖通常以影像呈現，推動了使用視覺語言模型 (VLM) 進行端對端流程圖理解的趨勢。然而，出現了兩個關鍵挑戰：(i) 可控性有限——使用者對下游任務的影響很小，因為他們只能修改輸入影像，而大多數研究人員往往無法訓練 VLM。(ii) 缺乏可解釋性——難以追溯 VLM 錯誤到具體原因，例如視覺編碼或推理失敗。我們提出 TextFlow，透過兩個階段來解決上述問題：(i) 視覺文字化器——從流程圖影像產生文字表示；(ii) 文字推理器——根據文字表示執行問答。TextFlow 提供了三個主要優點：(i) 使用者可以選擇文字表示的類型（例如 Graphviz、Mermaid、PlantUML），或進一步將它們轉換為可執行的圖形物件來呼叫工具，增強效能和可控性；(ii) 它透過幫助更清楚地將錯誤歸因於視覺或文字處理元件來改善可解釋性；(iii) 它促進了解決方案的模組化，例如允許在 VLM 在端對端模式下表現不佳時，在推理器階段使用進階 LLM。在 FlowVQA 和 FlowLearn 基準上的實驗證明了 TextFlow 的最先進效能以及其穩健性。所有程式碼都公開可用。", "author": "Junyi Ye et.al.", "authors": "Junyi Ye, Ankan Dash, Wenpeng Yin, Guiling Wang", "id": "2412.16420v1", "paper_url": "http://arxiv.org/abs/2412.16420v1", "repo": "null"}}