{"2409.18082": {"publish_time": "2024-09-26", "title": "SKT: Integrating State-Aware Keypoint Trajectories with Vision-Language Models for Robotic Garment Manipulation", "paper_summary": "Automating garment manipulation poses a significant challenge for assistive\nrobotics due to the diverse and deformable nature of garments. Traditional\napproaches typically require separate models for each garment type, which\nlimits scalability and adaptability. In contrast, this paper presents a unified\napproach using vision-language models (VLMs) to improve keypoint prediction\nacross various garment categories. By interpreting both visual and semantic\ninformation, our model enables robots to manage different garment states with a\nsingle model. We created a large-scale synthetic dataset using advanced\nsimulation techniques, allowing scalable training without extensive real-world\ndata. Experimental results indicate that the VLM-based method significantly\nenhances keypoint detection accuracy and task success rates, providing a more\nflexible and general solution for robotic garment manipulation. In addition,\nthis research also underscores the potential of VLMs to unify various garment\nmanipulation tasks within a single framework, paving the way for broader\napplications in home automation and assistive robotics for future.", "paper_summary_zh": "自動化服飾操作對輔助機器人技術構成重大挑戰，因為服飾具有多樣且可變形的特性。傳統方法通常需要針對每種服飾類型建立獨立的模型，這限制了可擴充性和適應性。相反地，本文提出一個統一的方法，使用視覺語言模型 (VLM) 來改善各種服飾類別的關鍵點預測。透過解讀視覺和語義資訊，我們的模型讓機器人能夠使用單一模型來管理不同的服飾狀態。我們使用進階模擬技術建立了一個大型合成資料集，允許進行可擴充的訓練，而不需要大量的真實世界資料。實驗結果顯示，基於 VLM 的方法顯著提升了關鍵點偵測的準確度和任務成功率，為機器人服飾操作提供了更靈活且通用的解決方案。此外，這項研究也強調了 VLM 將各種服飾操作任務統一在單一架構中的潛力，為未來居家自動化和輔助機器人技術的廣泛應用鋪路。", "author": "Xin Li et.al.", "authors": "Xin Li, Siyuan Huang, Qiaojun Yu, Zhengkai Jiang, Ce Hao, Yimeng Zhu, Hongsheng Li, Peng Gao, Cewu Lu", "id": "2409.18082v1", "paper_url": "http://arxiv.org/abs/2409.18082v1", "repo": "null"}}