{"2501.18457": {"publish_time": "2025-01-30", "title": "CALM: Unleashing the Cross-Lingual Self-Aligning Ability of Language Model Question Answering", "paper_summary": "Large Language Models (LLMs) are pretrained on extensive multilingual corpora\nto acquire both language-specific cultural knowledge and general knowledge.\nIdeally, while LLMs should provide consistent responses to culture-independent\nquestions across languages, we observe significant performance disparities. To\naddress this, we explore the Cross-Lingual Self-Aligning ability of Language\nModels (CALM) to align knowledge across languages. Specifically, for a given\nquestion, we sample multiple responses across different languages, and select\nthe most self-consistent response as the target, leaving the remaining\nresponses as negative examples. We then employ direct preference optimization\n(DPO) to align the model's knowledge across different languages. Evaluations on\nthe MEDQA and X-CSQA datasets demonstrate CALM's effectiveness in enhancing\ncross-lingual knowledge question answering, both in zero-shot and retrieval\naugmented settings. We also found that increasing the number of languages\ninvolved in CALM training leads to even higher accuracy and consistency. We\noffer a qualitative analysis of how cross-lingual consistency can enhance\nknowledge alignment and explore the method's generalizability. The source code\nand data of this paper are available on GitHub.", "paper_summary_zh": "大型語言模型 (LLM) 在廣泛的多語言語料庫上進行預訓練，以獲取特定語言的文化知識和一般知識。理想情況下，雖然 LLM 應對各語言的文化無關問題提供一致的回應，但我們觀察到顯著的效能差異。為了解決這個問題，我們探討語言模型的跨語言自我對齊能力 (CALM)，以對齊各語言的知識。具體來說，對於一個給定的問題，我們在不同語言中採樣多個回應，並選擇最自洽的回應作為目標，將其餘的回應作為負面範例。然後，我們採用直接偏好最佳化 (DPO) 來對齊模型在不同語言中的知識。在 MEDQA 和 X-CSQA 資料集上的評估證明了 CALM 在增強跨語言知識問答方面的有效性，無論是在零次學習還是檢索增強設定中。我們還發現，增加 CALM 訓練中涉及的語言數量會導致更高的準確性和一致性。我們提供了一個定性分析，說明跨語言一致性如何增強知識對齊並探討該方法的可概化性。本文的原始碼和資料可在 GitHub 上取得。", "author": "Yumeng Wang et.al.", "authors": "Yumeng Wang, Zhiyuan Fan, Qingyun Wang, May Fung, Heng Ji", "id": "2501.18457v1", "paper_url": "http://arxiv.org/abs/2501.18457v1", "repo": "https://github.com/Alexwwwwww/CALM"}}