{"2411.09694": {"publish_time": "2024-11-14", "title": "A Bayesian Optimization Approach to Machine Translation Reranking", "paper_summary": "Reranking a list of candidates from a machine translation system with an\nexternal scoring model and returning the highest-scoring candidate remains a\nsimple and effective method for improving the overall output quality.\nTranslation scoring models continue to grow in size, with the best models being\ncomparable to generation models. Thus, reranking can add substantial\ncomputational cost to the translation pipeline. In this work, we pose reranking\nas a Bayesian optimization (BayesOpt) problem. By strategically selecting\ncandidates to score based on a balance of exploration and exploitation, we show\nthat it is possible to find top-scoring candidates when scoring only a fraction\nof the candidate list. For instance, our method achieves the same CometKiwi\nscore using only 70 scoring evaluations compared a baseline system using 180.\nWe present a multi-fidelity setting for BayesOpt, where the candidates are\nfirst scored with a cheaper but noisier proxy scoring model, which further\nimproves the cost-performance tradeoff when using smaller but well-trained\ndistilled proxy scorers.", "paper_summary_zh": "利用外部評分模型重新排列機器翻譯系統的候選清單，並回傳評分最高的候選，這仍然是改善整體輸出品質的簡單且有效的方法。\n翻譯評分模型持續擴增，其中最佳的模型與生成模型相當。因此，重新排列會為翻譯流程增加大量的運算成本。在這項工作中，我們將重新排列視為貝氏最佳化 (BayesOpt) 問題。透過策略性地選擇候選，在探索與開發取得平衡的基礎上進行評分，我們證明了在僅評分候選清單的一部分時，有可能找到評分最高的候選。例如，我們的模型僅使用 70 次評分評估就達到相同的 CometKiwi 分數，而基線系統則使用 180 次。我們提出適用於 BayesOpt 的多重保真度設定，其中候選首先使用較便宜但較多雜訊的代理評分模型進行評分，這進一步改善了使用較小但訓練良好的蒸餾代理評分器的成本效益權衡。", "author": "Julius Cheng et.al.", "authors": "Julius Cheng, Maike Züfle, Vilém Zouhar, Andreas Vlachos", "id": "2411.09694v1", "paper_url": "http://arxiv.org/abs/2411.09694v1", "repo": "null"}}