{"2405.19299": {"publish_time": "2024-05-29", "title": "Expert-Guided Extinction of Toxic Tokens for Debiased Generation", "paper_summary": "Large language models (LLMs) can elicit social bias during generations,\nespecially when inference with toxic prompts. Controlling the sensitive\nattributes in generation encounters challenges in data distribution,\ngeneralizability, and efficiency. Specifically, fine-tuning and retrieval\ndemand extensive unbiased corpus, while direct prompting requires meticulously\ncurated instructions for correcting the output in multiple rounds of thoughts\nbut poses challenges on memory and inference latency. In this work, we propose\nthe Expert-Guided Extinction of Toxic Tokens for Debiased Generation (EXPOSED)\nto eliminate the undesired harmful outputs for LLMs without the aforementioned\nrequirements. EXPOSED constructs a debiasing expert based on the abundant toxic\ncorpus to expose and elicit the potentially dangerous tokens. It then processes\nthe output to the LLMs and constructs a fair distribution by suppressing and\nattenuating the toxic tokens. EXPOSED is evaluated on fairness benchmarks over\nthree LLM families. Extensive experiments demonstrate that compared with other\nbaselines, the proposed EXPOSED significantly reduces the potential social bias\nwhile balancing fairness and generation performance.", "paper_summary_zh": "大型語言模型（LLM）在生成過程中可能會引發社會偏見，特別是在使用有毒提示進行推論時。在生成過程中控制敏感屬性會遇到數據分佈、泛化性和效率方面的挑戰。具體來說，微調和檢索需要大量的無偏數據集，而直接提示需要仔細策劃的指令，才能在多輪思考中糾正輸出，但對記憶體和推論延遲提出了挑戰。在這項工作中，我們提出了有毒符號的專家指導滅絕，用於無偏生成（EXPOSED），以消除 LLM 的不需要的有害輸出，而無需上述要求。EXPOSED 基於豐富的有毒語料庫構建了一個去偏專家，以揭露和引出潛在的危險標記。然後，它處理 LLM 的輸出，並通過抑制和衰減有毒標記來構建一個公平的分配。EXPOSED 在三個 LLM 家族的公平基準上進行了評估。大量的實驗表明，與其他基線相比，所提出的 EXPOSED 在平衡公平性和生成性能的同時，顯著降低了潛在的社會偏見。", "author": "Xueyao Sun et.al.", "authors": "Xueyao Sun, Kaize Shi, Haoran Tang, Guandong Xu, Qing Li", "id": "2405.19299v1", "paper_url": "http://arxiv.org/abs/2405.19299v1", "repo": "null"}}