{"2407.08112": {"publish_time": "2024-07-11", "title": "How Well Can a Long Sequence Model Model Long Sequences? Comparing Architechtural Inductive Biases on Long-Context Abilities", "paper_summary": "Long sequences occur in abundance within real-world scenarios, hence properly\nmodelling them opens numerous down-stream use-cases. Deep neural networks,\nhowever, have often struggled with these for a variety of reasons. Recent\nadvances, both in system engineering as well as model design, have enabled the\nscaling up of model that are purported to support extended context length. In\nparticular, the state-space and linear recurrent neural network families of\nmodels hypothetically can entend to infinite sequence lenth. However, is this\ntoo good to be true? We conduct an evaluation to show that while such claims\nmay be sound theoretically, there remain large practical gaps that are\nempirically observed. In particular, recurrent models still suffer in the same\nsettings as long-context LLMs with attention. We further show that different\ninductive biases have inconsistent extrapolation capabilities, highlighting the\nneed to further study such paradigms and investigate why long-context models\nseemingly fail to behave as one might expect.", "paper_summary_zh": "長序列在現實世界中大量出現，因此適當的建模為我們開啟了許多下游用例。然而，由於各種原因，深度神經網路經常難以處理這些序列。系統工程和模型設計的最新進展，使得擴展模型的上下文長度成為可能，而這些模型據稱可以支援擴展的上下文長度。特別是，狀態空間和線性遞迴神經網路的模型族在理論上可以延伸到無限序列長度。然而，這是否好得令人難以置信？我們進行了一項評估，以表明雖然這些說法在理論上可能是合理的，但仍存在大量在經驗上觀察到的實際差距。特別是，遞迴模型在與具有注意力的長上下文 LLM 相同的設定中仍然表現不佳。我們進一步表明，不同的歸納偏差具有不一致的外推能力，強調了進一步研究這些範例和調查為什麼長上下文模型看似無法按照預期行為的必要性。", "author": "Jerry Huang et.al.", "authors": "Jerry Huang", "id": "2407.08112v1", "paper_url": "http://arxiv.org/abs/2407.08112v1", "repo": "null"}}