{"2501.10072": {"publish_time": "2025-01-17", "title": "Author-Specific Linguistic Patterns Unveiled: A Deep Learning Study on Word Class Distributions", "paper_summary": "Deep learning methods have been increasingly applied to computational\nlinguistics to uncover patterns in text data. This study investigates\nauthor-specific word class distributions using part-of-speech (POS) tagging and\nbigram analysis. By leveraging deep neural networks, we classify literary\nauthors based on POS tag vectors and bigram frequency matrices derived from\ntheir works. We employ fully connected and convolutional neural network\narchitectures to explore the efficacy of unigram and bigram-based\nrepresentations. Our results demonstrate that while unigram features achieve\nmoderate classification accuracy, bigram-based models significantly improve\nperformance, suggesting that sequential word class patterns are more\ndistinctive of authorial style. Multi-dimensional scaling (MDS) visualizations\nreveal meaningful clustering of authors' works, supporting the hypothesis that\nstylistic nuances can be captured through computational methods. These findings\nhighlight the potential of deep learning and linguistic feature analysis for\nauthor profiling and literary studies.", "paper_summary_zh": "深度學習方法已日益應用於計算語言學，以揭示文本資料中的模式。本研究使用詞性標記和二元分析調查作者特定的詞類分佈。透過利用深度神經網路，我們根據從其作品中衍生的詞性標記向量和二元頻率矩陣對文學作者進行分類。我們採用全連接和卷積神經網路架構來探討一元和二元表示的功效。我們的結果表明，雖然一元特徵可達成適度的分類準確度，但基於二元的模型顯著提升了效能，這表示連續詞類模式更能區分作者風格。多維度縮放 (MDS) 視覺化揭示了作者作品的意義聚類，支持了風格細微差別可透過計算方法擷取的假設。這些發現突顯了深度學習和語言特徵分析在作者輪廓和文學研究中的潛力。", "author": "Patrick Krauss et.al.", "authors": "Patrick Krauss, Achim Schilling", "id": "2501.10072v1", "paper_url": "http://arxiv.org/abs/2501.10072v1", "repo": "null"}}