{"2411.18220": {"publish_time": "2024-11-27", "title": "R-MTLLMF: Resilient Multi-Task Large Language Model Fusion at the Wireless Edge", "paper_summary": "Multi-task large language models (MTLLMs) are important for many applications\nat the wireless edge, where users demand specialized models to handle multiple\ntasks efficiently. However, training MTLLMs is complex and exhaustive,\nparticularly when tasks are subject to change. Recently, the concept of model\nfusion via task vectors has emerged as an efficient approach for combining\nfine-tuning parameters to produce an MTLLM. In this paper, the problem of\nenabling edge users to collaboratively craft such MTTLMs via tasks vectors is\nstudied, under the assumption of worst-case adversarial attacks. To this end,\nfirst the influence of adversarial noise to multi-task model fusion is\ninvestigated and a relationship between the so-called weight disentanglement\nerror and the mean squared error (MSE) is derived. Using hypothesis testing, it\nis directly shown that the MSE increases interference between task vectors,\nthereby rendering model fusion ineffective. Then, a novel resilient MTLLM\nfusion (R-MTLLMF) is proposed, which leverages insights about the LLM\narchitecture and fine-tuning process to safeguard task vector aggregation under\nadversarial noise by realigning the MTLLM. The proposed R-MTLLMF is then\ncompared for both worst-case and ideal transmission scenarios to study the\nimpact of the wireless channel. Extensive model fusion experiments with vision\nLLMs demonstrate R-MTLLMF's effectiveness, achieving close-to-baseline\nperformance across eight different tasks in ideal noise scenarios and\nsignificantly outperforming unprotected model fusion in worst-case scenarios.\nThe results further advocate for additional physical layer protection for a\nholistic approach to resilience, from both a wireless and LLM perspective.", "paper_summary_zh": "多任務大型語言模型 (MTLLM) 對許多應用程式而言非常重要，特別是在無線邊緣，使用者需要專門的模型來有效率地處理多項任務。然而，訓練 MTLLM 是一項複雜且耗盡資源的任務，特別是在任務會改變的情況下。最近，透過任務向量的模型融合概念已成為一種有效率的方法，用於結合微調參數以產生 MTLLM。本文研究了在最壞情況的對抗性攻擊假設下，讓邊緣使用者透過任務向量協作打造此類 MTLLM 的問題。為此，首先探討了對抗性雜訊對多任務模型融合的影響，並推導出所謂的權重解糾纏誤差與均方誤差 (MSE) 之間的關係。透過假設檢定，直接顯示 MSE 會增加任務向量之間的干擾，從而使模型融合無效。接著，提出了一種新穎的彈性 MTLLM 融合 (R-MTLLMF)，它利用有關 LLM 架構和微調流程的見解，透過重新調整 MTLLM，在對抗性雜訊下保護任務向量聚合。然後，針對最壞情況和理想傳輸情境比較所提出的 R-MTLLMF，以研究無線頻道的影響。廣泛的模型融合實驗顯示 R-MTLLMF 的有效性，在理想雜訊情境中，在八種不同的任務中達到接近基線的效能，並且在最壞情況下明顯優於未受保護的模型融合。結果進一步提倡額外的物理層保護，以從無線和 LLM 的角度採取整體復原力方法。", "author": "Aladin Djuhera et.al.", "authors": "Aladin Djuhera, Vlad C. Andrei, Mohsen Pourghasemian, Haris Gacanin, Holger Boche, Walid Saad", "id": "2411.18220v1", "paper_url": "http://arxiv.org/abs/2411.18220v1", "repo": "null"}}