{"2501.07102": {"publish_time": "2025-01-13", "title": "AdaCS: Adaptive Normalization for Enhanced Code-Switching ASR", "paper_summary": "Intra-sentential code-switching (CS) refers to the alternation between\nlanguages that happens within a single utterance and is a significant challenge\nfor Automatic Speech Recognition (ASR) systems. For example, when a Vietnamese\nspeaker uses foreign proper names or specialized terms within their speech. ASR\nsystems often struggle to accurately transcribe intra-sentential CS due to\ntheir training on monolingual data and the unpredictable nature of CS. This\nissue is even more pronounced for low-resource languages, where limited data\navailability hinders the development of robust models. In this study, we\npropose AdaCS, a normalization model integrates an adaptive bias attention\nmodule (BAM) into encoder-decoder network. This novel approach provides a\nrobust solution to CS ASR in unseen domains, thereby significantly enhancing\nour contribution to the field. By utilizing BAM to both identify and normalize\nCS phrases, AdaCS enhances its adaptive capabilities with a biased list of\nwords provided during inference. Our method demonstrates impressive performance\nand the ability to handle unseen CS phrases across various domains. Experiments\nshow that AdaCS outperforms previous state-of-the-art method on Vietnamese CS\nASR normalization by considerable WER reduction of 56.2% and 36.8% on the two\nproposed test sets.", "paper_summary_zh": "句內碼轉換 (CS) 指在單一句話內交替使用語言，對自動語音辨識 (ASR) 系統來說是一項重大挑戰。例如，當越南語使用者在說話時使用外來專有名詞或專門術語。由於 ASR 系統訓練時使用的是單一語言資料，且 CS 的性質難以預測，因此 ASR 系統在準確轉錄句內 CS 時常會遇到困難。對於資源較少的語言來說，這個問題更為嚴重，因為資料有限，會阻礙穩健模型的開發。在本研究中，我們提出 AdaCS，一種正規化模型，將適應性偏差注意力模組 (BAM) 整合到編碼器解碼器網路中。這種新方法為未知領域的 CS ASR 提供了一個穩健的解決方案，進而大幅提升我們對這個領域的貢獻。AdaCS 利用 BAM 來辨識和正規化 CS 片語，並透過在推論期間提供的偏差詞彙清單，增強其適應性。我們的這項方法展現了令人印象深刻的效能，以及處理各種領域中未知 CS 片語的能力。實驗顯示，AdaCS 在越南語 CS ASR 正規化方面優於先前的最新方法，在兩個提議的測試集中，WER 分別降低了 56.2% 和 36.8%。", "author": "The Chuong Chu et.al.", "authors": "The Chuong Chu, Vu Tuan Dat Pham, Kien Dao, Hoang Nguyen, Quoc Hung Truong", "id": "2501.07102v1", "paper_url": "http://arxiv.org/abs/2501.07102v1", "repo": "null"}}