{"2407.14049": {"publish_time": "2024-07-19", "title": "Prompted Aspect Key Point Analysis for Quantitative Review Summarization", "paper_summary": "Key Point Analysis (KPA) aims for quantitative summarization that provides\nkey points (KPs) as succinct textual summaries and quantities measuring their\nprevalence. KPA studies for arguments and reviews have been reported in the\nliterature. A majority of KPA studies for reviews adopt supervised learning to\nextract short sentences as KPs before matching KPs to review comments for\nquantification of KP prevalence. Recent abstractive approaches still generate\nKPs based on sentences, often leading to KPs with overlapping and hallucinated\nopinions, and inaccurate quantification. In this paper, we propose Prompted\nAspect Key Point Analysis (PAKPA) for quantitative review summarization. PAKPA\nemploys aspect sentiment analysis and prompted in-context learning with Large\nLanguage Models (LLMs) to generate and quantify KPs grounded in aspects for\nbusiness entities, which achieves faithful KPs with accurate quantification,\nand removes the need for large amounts of annotated data for supervised\ntraining. Experiments on the popular review dataset Yelp and the\naspect-oriented review summarization dataset SPACE show that our framework\nachieves state-of-the-art performance. Source code and data are available at:\nhttps://github.com/antangrocket1312/PAKPA", "paper_summary_zh": "關鍵點分析 (KPA) 旨在進行量化摘要，提供關鍵點 (KP) 作為簡潔的文字摘要，並量化測量其流行程度。文獻中已報導了針對論點和評論的 KPA 研究。大多數針對評論的 KPA 研究採用監督式學習，先將短句萃取為 KP，再比對評論中的評論，以量化 KP 的流行程度。最近的抽象式方法仍根據句子產生 KP，這通常會導致 KP 出現重疊和虛構的意見，以及不準確的量化。在本文中，我們提出提示式面向關鍵點分析 (PAKPA)，用於量化評論摘要。PAKPA 採用面向的意見分析和提示式情境學習，搭配大型語言模型 (LLM)，以產生和量化以商業實體面向為基礎的 KP，這可達成具有準確量化的忠實 KP，並消除監督式訓練大量標註資料的需求。在熱門評論資料集 Yelp 和面向評論摘要資料集 SPACE 上的實驗顯示，我們的架構達到了最先進的效能。原始碼和資料可取得：https://github.com/antangrocket1312/PAKPA", "author": "An Quang Tang et.al.", "authors": "An Quang Tang, Xiuzhen Zhang, Minh Ngoc Dinh, Erik Cambria", "id": "2407.14049v1", "paper_url": "http://arxiv.org/abs/2407.14049v1", "repo": "https://github.com/antangrocket1312/pakpa"}}