{"2412.03856": {"publish_time": "2024-12-05", "title": "How Good is ChatGPT in Giving Adaptive Guidance Using Knowledge Graphs in E-Learning Environments?", "paper_summary": "E-learning environments are increasingly harnessing large language models\n(LLMs) like GPT-3.5 and GPT-4 for tailored educational support. This study\nintroduces an approach that integrates dynamic knowledge graphs with LLMs to\noffer nuanced student assistance. By evaluating past and ongoing student\ninteractions, the system identifies and appends the most salient learning\ncontext to prompts directed at the LLM. Central to this method is the knowledge\ngraph's role in assessing a student's comprehension of topic prerequisites.\nDepending on the categorized understanding (good, average, or poor), the LLM\nadjusts its guidance, offering advanced assistance, foundational reviews, or\nin-depth prerequisite explanations, respectively. Preliminary findings suggest\nstudents could benefit from this tiered support, achieving enhanced\ncomprehension and improved task outcomes. However, several issues related to\npotential errors arising from LLMs were identified, which can potentially\nmislead students. This highlights the need for human intervention to mitigate\nthese risks. This research aims to advance AI-driven personalized learning\nwhile acknowledging the limitations and potential pitfalls, thus guiding future\nresearch in technology and data-driven education.", "paper_summary_zh": "電子學習環境正日益利用大型語言模型 (LLM)，例如 GPT-3.5 和 GPT-4，提供量身打造的教育支援。本研究提出了一種方法，將動態知識圖與 LLM 整合，提供細緻入微的學生協助。系統會評估過去和正在進行的學生互動，找出並附加最顯著的學習脈絡，以提示 LLM。此方法的核心在於知識圖在評估學生對主題先備知識的理解程度方面所扮演的角色。LLM 會根據分類後的理解程度（良好、普通或差）調整其指導，分別提供進階協助、基礎回顧或深入的先備知識說明。初步發現表明，學生可以受益於這種分層支援，達到增強的理解力和改善的任務成果。然而，已找出與 LLM 產生的潛在錯誤相關的幾個問題，這些錯誤可能會誤導學生。這突顯了人類介入以降低這些風險的必要性。本研究旨在推進 AI 驅動的個人化學習，同時承認限制和潛在的陷阱，從而指導未來在技術和資料驅動教育方面的研究。", "author": "Patrick Ocheja et.al.", "authors": "Patrick Ocheja, Brendan Flanagan, Yiling Dai, Hiroaki Ogata", "id": "2412.03856v1", "paper_url": "http://arxiv.org/abs/2412.03856v1", "repo": "null"}}