{"2412.19350": {"publish_time": "2024-12-26", "title": "On the Expressiveness and Length Generalization of Selective State-Space Models on Regular Languages", "paper_summary": "Selective state-space models (SSMs) are an emerging alternative to the\nTransformer, offering the unique advantage of parallel training and sequential\ninference. Although these models have shown promising performance on a variety\nof tasks, their formal expressiveness and length generalization properties\nremain underexplored. In this work, we provide insight into the workings of\nselective SSMs by analyzing their expressiveness and length generalization\nperformance on regular language tasks, i.e., finite-state automaton (FSA)\nemulation. We address certain limitations of modern SSM-based architectures by\nintroducing the Selective Dense State-Space Model (SD-SSM), the first selective\nSSM that exhibits perfect length generalization on a set of various regular\nlanguage tasks using a single layer. It utilizes a dictionary of dense\ntransition matrices, a softmax selection mechanism that creates a convex\ncombination of dictionary matrices at each time step, and a readout consisting\nof layer normalization followed by a linear map. We then proceed to evaluate\nvariants of diagonal selective SSMs by considering their empirical performance\non commutative and non-commutative automata. We explain the experimental\nresults with theoretical considerations. Our code is available at\nhttps://github.com/IBM/selective-dense-state-space-model.", "paper_summary_zh": "選擇性狀態空間模型 (SSM) 是 Transformer 的新興替代方案，提供平行訓練和順序推論的獨特優勢。儘管這些模型在各種任務上表現出令人滿意的效能，但它們的形式表達力和長度概化特性仍未得到充分探討。在這項工作中，我們透過分析選擇性 SSM 在規則語言任務（即有限狀態自動機 (FSA) 模擬）上的表達力和長度概化效能，深入了解選擇性 SSM 的運作方式。我們透過導入選擇性稠密狀態空間模型 (SD-SSM) 來解決現代基於 SSM 的架構的某些限制，這是第一個在單層上對各種規則語言任務表現出完美長度概化的選擇性 SSM。它利用稠密轉移矩陣的字典、在每個時間步長建立字典矩陣的凸組合的 softmax 選擇機制，以及由層正規化後接線性映射組成的讀出。然後，我們繼續評估對角選擇性 SSM 的變體，考慮它們在交換和非交換自動機上的經驗效能。我們以理論考量說明實驗結果。我們的程式碼可在 https://github.com/IBM/selective-dense-state-space-model 取得。", "author": "Aleksandar Terzić et.al.", "authors": "Aleksandar Terzić, Michael Hersche, Giacomo Camposampiero, Thomas Hofmann, Abu Sebastian, Abbas Rahimi", "id": "2412.19350v1", "paper_url": "http://arxiv.org/abs/2412.19350v1", "repo": "https://github.com/ibm/selective-dense-state-space-model"}}