{"2409.06468": {"publish_time": "2024-09-10", "title": "An Effective Context-Balanced Adaptation Approach for Long-Tailed Speech Recognition", "paper_summary": "End-to-end (E2E) automatic speech recognition (ASR) models have become\nstandard practice for various commercial applications. However, in real-world\nscenarios, the long-tailed nature of word distribution often leads E2E ASR\nmodels to perform well on common words but fall short in recognizing uncommon\nones. Recently, the notion of a contextual adapter (CA) was proposed to infuse\nexternal knowledge represented by a context word list into E2E ASR models.\nAlthough CA can improve recognition performance on rare words, two crucial data\nimbalance problems remain. First, when using low-frequency words as context\nwords during training, since these words rarely occur in the utterance, CA\nbecomes prone to overfit on attending to the <no-context> token due to\nhigher-frequency words not being present in the context list. Second, the\nlong-tailed distribution within the context list itself still causes the model\nto perform poorly on low-frequency context words. In light of this, we explore\nin-depth the impact of altering the context list to have words with different\nfrequency distributions on model performance, and meanwhile extend CA with a\nsimple yet effective context-balanced learning objective. A series of\nexperiments conducted on the AISHELL-1 benchmark dataset suggests that using\nall vocabulary words from the training corpus as the context list and pairing\nthem with our balanced objective yields the best performance, demonstrating a\nsignificant reduction in character error rate (CER) by up to 1.21% and a more\npronounced 9.44% reduction in the error rate of zero-shot words.", "paper_summary_zh": "端對端 (E2E) 自動語音辨識 (ASR) 模型已成為各種商業應用中的標準實務。然而，在真實世界的場景中，詞彙分佈的長尾特性常常導致 E2E ASR 模型在常見詞彙上表現良好，但在辨識不常見詞彙時卻表現不佳。最近，有人提出情境式適配器 (CA) 的概念，將由情境詞彙清單所代表的外部知識注入 E2E ASR 模型中。儘管 CA 能夠提升罕見詞彙的辨識效能，但仍存在兩個關鍵的資料不平衡問題。首先，在訓練期間使用低頻率詞彙作為情境詞彙時，由於這些詞彙很少出現在語句中，因此 CA 容易過度擬合，專注於 <no-context> 權杖，因為較高頻率的詞彙並未出現在情境清單中。其次，情境清單本身內的長尾分佈仍會導致模型在低頻率情境詞彙上的表現不佳。有鑑於此，我們深入探討改變情境清單以納入具有不同頻率分佈的詞彙對模型效能的影響，同時使用一個簡單但有效的平衡情境學習目標來延伸 CA。在 AISHELL-1 基準資料集上進行的一系列實驗顯示，使用訓練語料庫中的所有詞彙作為情境清單，並將其與我們的平衡目標配對，可產生最佳效能，證明字元錯誤率 (CER) 大幅降低了 1.21%，而零次學習詞彙的錯誤率則大幅降低了 9.44%。", "author": "Yi-Cheng Wang et.al.", "authors": "Yi-Cheng Wang, Li-Ting Pai, Bi-Cheng Yan, Hsin-Wei Wang, Chi-Han Lin, Berlin Chen", "id": "2409.06468v1", "paper_url": "http://arxiv.org/abs/2409.06468v1", "repo": "null"}}