{"2501.17615": {"publish_time": "2025-01-29", "title": "Cross-lingual Embedding Clustering for Hierarchical Softmax in Low-Resource Multilingual Speech Recognition", "paper_summary": "We present a novel approach centered on the decoding stage of Automatic\nSpeech Recognition (ASR) that enhances multilingual performance, especially for\nlow-resource languages. It utilizes a cross-lingual embedding clustering method\nto construct a hierarchical Softmax (H-Softmax) decoder, which enables similar\ntokens across different languages to share similar decoder representations. It\naddresses the limitations of the previous Huffman-based H-Softmax method, which\nrelied on shallow features in token similarity assessments. Through experiments\non a downsampled dataset of 15 languages, we demonstrate the effectiveness of\nour approach in improving low-resource multilingual ASR accuracy.", "paper_summary_zh": "我們提出了一種新穎的方法，專注於自動語音識別 (ASR) 的解碼階段，可以增強多語言效能，特別是對於低資源語言。它利用跨語言嵌入式群集方法來建構階層式 Softmax (H-Softmax) 解碼器，這使得不同語言中的相似符號可以共用相似的解碼器表示。它解決了先前基於 Huffman 的 H-Softmax 方法的限制，該方法依賴於符號相似性評估中的淺層特徵。透過對 15 種語言的降採樣資料集進行實驗，我們證明了我們的方法在提升低資源多語言 ASR 準確度方面的有效性。", "author": "Zhengdong Yang et.al.", "authors": "Zhengdong Yang, Qianying Liu, Sheng Li, Fei Cheng, Chenhui Chu", "id": "2501.17615v1", "paper_url": "http://arxiv.org/abs/2501.17615v1", "repo": "null"}}