{"2406.14185": {"publish_time": "2024-06-20", "title": "Failure-Resilient Distributed Inference with Model Compression over Heterogeneous Edge Devices", "paper_summary": "The distributed inference paradigm enables the computation workload to be\ndistributed across multiple devices, facilitating the implementations of deep\nlearning based intelligent services on extremely resource-constrained Internet\nof Things (IoT) scenarios. Yet it raises great challenges to perform\ncomplicated inference tasks relying on a cluster of IoT devices that are\nheterogeneous in their computing/communication capacity and prone to crash or\ntimeout failures. In this paper, we present RoCoIn, a robust cooperative\ninference mechanism for locally distributed execution of deep neural\nnetwork-based inference tasks over heterogeneous edge devices. It creates a set\nof independent and compact student models that are learned from a large model\nusing knowledge distillation for distributed deployment. In particular, the\ndevices are strategically grouped to redundantly deploy and execute the same\nstudent model such that the inference process is resilient to any local\nfailures, while a joint knowledge partition and student model assignment scheme\nare designed to minimize the response latency of the distributed inference\nsystem in the presence of devices with diverse capacities. Extensive\nsimulations are conducted to corroborate the superior performance of our RoCoIn\nfor distributed inference compared to several baselines, and the results\ndemonstrate its efficacy in timely inference and failure resiliency.", "paper_summary_zh": "分布式推理範例使計算工作負載能夠在多個裝置上進行分配，進而促進在極度受資源限制的物聯網 (IoT) 場景中實施基於深度學習的智慧服務。然而，這對執行複雜的推理任務構成了極大的挑戰，這些任務依賴於運算/通訊容量異質且容易發生崩潰或逾時故障的物聯網裝置叢集。在本文中，我們提出了 RoCoIn，這是一種用於在異質邊緣裝置上對基於深度神經網路的推理任務進行本地化分散執行的穩健協作推理機制。它建立了一組獨立且緊湊的學生模型，這些模型是使用知識蒸餾從一個大型模型中學習而來的，用於分散式部署。特別是，這些裝置被策略性地分組，以便冗餘部署並執行相同的學生模型，使得推理程序能對任何本地故障產生韌性，同時設計了一種聯合知識分割和學生模型分配方案，以最小化在存在具有不同容量的裝置的情況下分散式推理系統的回應延遲。進行了廣泛的模擬，以證實我們的 RoCoIn 在分散式推理方面的優異效能，與多個基準相比，結果證明了其在及時推理和故障復原力方面的效能。", "author": "Li Wang et.al.", "authors": "Li Wang, Liang Li, Lianming Xu, Xian Peng, Aiguo Fei", "id": "2406.14185v1", "paper_url": "http://arxiv.org/abs/2406.14185v1", "repo": "null"}}