{"2409.04340": {"publish_time": "2024-09-06", "title": "AGR: Age Group fairness Reward for Bias Mitigation in LLMs", "paper_summary": "LLMs can exhibit age biases, resulting in unequal treatment of individuals\nacross age groups. While much research has addressed racial and gender biases,\nage bias remains little explored. The scarcity of instruction-tuning and\npreference datasets for age bias hampers its detection and measurement, and\nexisting fine-tuning methods seldom address age-related fairness. In this\npaper, we construct age bias preference datasets and instruction-tuning\ndatasets for RLHF. We introduce ARG, an age fairness reward to reduce\ndifferences in the response quality of LLMs across different age groups.\nExtensive experiments demonstrate that this reward significantly improves\nresponse accuracy and reduces performance disparities across age groups. Our\nsource code and datasets are available at the anonymous\n\\href{https://anonymous.4open.science/r/FairRLHF-D445/readme.md}{link}.", "paper_summary_zh": "大型語言模型可能會表現出年齡偏見，導致不同年齡組別的個人受到不平等的待遇。雖然許多研究已探討種族和性別偏見，但年齡偏見仍鮮少被探討。年齡偏見的指示微調和偏好資料集的稀少阻礙了其偵測和測量，而現有的微調方法很少探討與年齡相關的公平性。在本文中，我們建構了年齡偏見偏好資料集和 RLHF 的指示微調資料集。我們引入了 ARG，一種年齡公平獎勵，以減少不同年齡組別中 LLM 回應品質的差異。廣泛的實驗證明，此獎勵顯著提升了回應準確度，並減少了不同年齡組別之間的效能差異。我們的原始程式碼和資料集可在匿名連結取得：\n\\href{https://anonymous.4open.science/r/FairRLHF-D445/readme.md}{link}。", "author": "Shuirong Cao et.al.", "authors": "Shuirong Cao, Ruoxi Cheng, Zhiqiang Wang", "id": "2409.04340v1", "paper_url": "http://arxiv.org/abs/2409.04340v1", "repo": "null"}}