{"2406.14898": {"publish_time": "2024-06-21", "title": "Safely Learning with Private Data: A Federated Learning Framework for Large Language Model", "paper_summary": "Private data, being larger and quality-higher than public data, can greatly\nimprove large language models (LLM). However, due to privacy concerns, this\ndata is often dispersed in multiple silos, making its secure utilization for\nLLM training a challenge. Federated learning (FL) is an ideal solution for\ntraining models with distributed private data, but traditional frameworks like\nFedAvg are unsuitable for LLM due to their high computational demands on\nclients. An alternative, split learning, offloads most training parameters to\nthe server while training embedding and output layers locally, making it more\nsuitable for LLM. Nonetheless, it faces significant challenges in security and\nefficiency. Firstly, the gradients of embeddings are prone to attacks, leading\nto potential reverse engineering of private data. Furthermore, the server's\nlimitation of handle only one client's training request at a time hinders\nparallel training, severely impacting training efficiency. In this paper, we\npropose a Federated Learning framework for LLM, named FL-GLM, which prevents\ndata leakage caused by both server-side and peer-client attacks while improving\ntraining efficiency. Specifically, we first place the input block and output\nblock on local client to prevent embedding gradient attacks from server.\nSecondly, we employ key-encryption during client-server communication to\nprevent reverse engineering attacks from peer-clients. Lastly, we employ\noptimization methods like client-batching or server-hierarchical, adopting\ndifferent acceleration methods based on the actual computational capabilities\nof the server. Experimental results on NLU and generation tasks demonstrate\nthat FL-GLM achieves comparable metrics to centralized chatGLM model,\nvalidating the effectiveness of our federated learning framework.", "paper_summary_zh": "<paragraph>私人數據比公開數據更大且品質更高，可以大幅改善大型語言模型 (LLM)。然而，由於隱私問題，這些數據通常分散在多個資料孤島中，使得其安全利用成為 LLM 訓練的一項挑戰。聯合學習 (FL) 是使用分散的私人數據訓練模型的理想解決方案，但 FedAvg 等傳統框架由於對用戶端的高運算需求而不適合 LLM。一種替代方案，分割式學習，將大多數訓練參數卸載到伺服器，同時在本地訓練嵌入和輸出層，使其更適合 LLM。儘管如此，它在安全性和效率方面面臨著重大挑戰。首先，嵌入的梯度容易受到攻擊，導致潛在的私人數據逆向工程。此外，伺服器一次只能處理一個用戶端的訓練請求的限制阻礙了並行訓練，嚴重影響了訓練效率。在本文中，我們提出了一個名為 FL-GLM 的 LLM 聯邦學習框架，它可以防止伺服器端和對等用戶端攻擊造成的數據洩漏，同時提高訓練效率。具體來說，我們首先將輸入區塊和輸出區塊放置在本地用戶端，以防止伺服器發起的嵌入梯度攻擊。其次，我們在用戶端-伺服器通信期間採用密鑰加密，以防止對等用戶端發起的逆向工程攻擊。最後，我們採用用戶端批次處理或伺服器分層等最佳化方法，根據伺服器的實際運算能力採用不同的加速方法。NLU 和生成任務的實驗結果表明，FL-GLM 達到了與集中式 chatGLM 模型相當的指標，驗證了我們聯合學習框架的有效性。</paragraph>", "author": "JiaYing Zheng et.al.", "authors": "JiaYing Zheng, HaiNan Zhang, LingXiang Wang, WangJie Qiu, HongWei Zheng, ZhiMing Zheng", "id": "2406.14898v1", "paper_url": "http://arxiv.org/abs/2406.14898v1", "repo": "null"}}