{"2501.04952": {"publish_time": "2025-01-09", "title": "Open Problems in Machine Unlearning for AI Safety", "paper_summary": "As AI systems become more capable, widely deployed, and increasingly\nautonomous in critical areas such as cybersecurity, biological research, and\nhealthcare, ensuring their safety and alignment with human values is paramount.\nMachine unlearning -- the ability to selectively forget or suppress specific\ntypes of knowledge -- has shown promise for privacy and data removal tasks,\nwhich has been the primary focus of existing research. More recently, its\npotential application to AI safety has gained attention. In this paper, we\nidentify key limitations that prevent unlearning from serving as a\ncomprehensive solution for AI safety, particularly in managing dual-use\nknowledge in sensitive domains like cybersecurity and chemical, biological,\nradiological, and nuclear (CBRN) safety. In these contexts, information can be\nboth beneficial and harmful, and models may combine seemingly harmless\ninformation for harmful purposes -- unlearning this information could strongly\naffect beneficial uses. We provide an overview of inherent constraints and open\nproblems, including the broader side effects of unlearning dangerous knowledge,\nas well as previously unexplored tensions between unlearning and existing\nsafety mechanisms. Finally, we investigate challenges related to evaluation,\nrobustness, and the preservation of safety features during unlearning. By\nmapping these limitations and open challenges, we aim to guide future research\ntoward realistic applications of unlearning within a broader AI safety\nframework, acknowledging its limitations and highlighting areas where\nalternative approaches may be required.", "paper_summary_zh": "隨著人工智慧系統變得更強大、廣泛部署，並在網路安全、生物研究和醫療保健等關鍵領域變得越來越自主，確保其安全性和與人類價值觀的一致性至關重要。機器遺忘——有選擇地遺忘或壓制特定類型知識的能力——已顯示出在隱私和資料移除任務中的前景，這是現有研究的主要焦點。最近，其在人工智慧安全方面的潛在應用受到關注。在本文中，我們找出阻止遺忘作為人工智慧安全綜合解決方案的關鍵限制，特別是在管理網路安全和化學、生物、放射和核（CBRN）安全等敏感領域中的雙重用途知識。在這些情況下，資訊既有益又有害，模型可能會將看似無害的資訊與有害目的結合在一起——遺忘這些資訊可能會嚴重影響有益的用途。我們概述了固有的限制和未解決的問題，包括遺忘危險知識的廣泛副作用，以及遺忘與現有安全機制之間以前未探討的緊張關係。最後，我們探討了與評估、穩健性和在遺忘過程中保留安全功能相關的挑戰。透過繪製這些限制和未解決的挑戰，我們旨在引導未來的研究朝著在更廣泛的人工智慧安全架構內遺忘的實際應用邁進，承認其限制並強調可能需要替代方法的領域。", "author": "Fazl Barez et.al.", "authors": "Fazl Barez, Tingchen Fu, Ameya Prabhu, Stephen Casper, Amartya Sanyal, Adel Bibi, Aidan O'Gara, Robert Kirk, Ben Bucknall, Tim Fist, Luke Ong, Philip Torr, Kwok-Yan Lam, Robert Trager, David Krueger, Sören Mindermann, José Hernandez-Orallo, Mor Geva, Yarin Gal", "id": "2501.04952v1", "paper_url": "http://arxiv.org/abs/2501.04952v1", "repo": "null"}}