{"2412.13147": {"publish_time": "2024-12-17", "title": "Are Your LLMs Capable of Stable Reasoning?", "paper_summary": "The rapid advancement of Large Language Models (LLMs) has demonstrated\nremarkable progress in complex reasoning tasks. However, a significant\ndiscrepancy persists between benchmark performances and real-world\napplications. We identify this gap as primarily stemming from current\nevaluation protocols and metrics, which inadequately capture the full spectrum\nof LLM capabilities, particularly in complex reasoning tasks where both\naccuracy and consistency are crucial. This work makes two key contributions.\nFirst, we introduce G-Pass@k, a novel evaluation metric that provides a\ncontinuous assessment of model performance across multiple sampling attempts,\nquantifying both the model's peak performance potential and its stability.\nSecond, we present LiveMathBench, a dynamic benchmark comprising challenging,\ncontemporary mathematical problems designed to minimize data leakage risks\nduring evaluation. Through extensive experiments using G-Pass@k on\nstate-of-the-art LLMs with LiveMathBench, we provide comprehensive insights\ninto both their maximum capabilities and operational consistency. Our findings\nreveal substantial room for improvement in LLMs' \"realistic\" reasoning\ncapabilities, highlighting the need for more robust evaluation methods. The\nbenchmark and detailed results are available at:\nhttps://github.com/open-compass/GPassK.", "paper_summary_zh": "大型語言模型 (LLM) 的快速進步已證明在複雜推理任務中取得顯著進展。然而，基準效能和實際應用之間仍存在顯著差異。我們將此差距主要歸因於當前的評估協定和指標，這些協定和指標未能充分掌握 LLM 能力的全部範圍，特別是在準確性和一致性都很重要的複雜推理任務中。這項工作做出了兩項關鍵貢獻。首先，我們引入了 G-Pass@k，這是一種新穎的評估指標，它提供了對模型效能的持續評估，涵蓋了多次抽樣嘗試，量化了模型的峰值效能潛力及其穩定性。其次，我們提出了 LiveMathBench，這是一個動態基準，包含具有挑戰性的當代數學問題，旨在最大程度地降低評估期間的數據洩露風險。通過在 LiveMathBench 上使用 G-Pass@k 對最先進的 LLM 進行廣泛的實驗，我們對其最大能力和運作一致性提供了全面的見解。我們的發現揭示了 LLM 的「實際」推理能力有很大的改進空間，強調了需要更強大的評估方法。基準和詳細結果可在以下網址獲得：https://github.com/open-compass/GPassK。", "author": "Junnan Liu et.al.", "authors": "Junnan Liu, Hongwei Liu, Linchen Xiao, Ziyi Wang, Kuikun Liu, Songyang Gao, Wenwei Zhang, Songyang Zhang, Kai Chen", "id": "2412.13147v1", "paper_url": "http://arxiv.org/abs/2412.13147v1", "repo": "https://github.com/open-compass/gpassk"}}