{"2309.00903": {"publish_time": "2023-09-02", "title": "An explainable three dimension framework to uncover learning patterns: A unified look in variable sulci recognition", "paper_summary": "Explainable AI is crucial in medical imaging. In the challenging field of\nneuroscience, visual topics present a high level of complexity, particularly\nwithin three-dimensional space. The application of neuroscience, which involves\nidentifying brain sulcal features from MRI, faces significant hurdles due to\nvarying annotation protocols among experts and the intricate three-dimension\nfunctionality of the brain. Consequently, traditional explainability approaches\nfall short in effectively validating and evaluating these networks. To address\nthis, we first present a mathematical formulation delineating various\ncategories of explanation needs across diverse computer vision tasks,\ncategorized into self-explanatory, semi-explanatory, non-explanatory, and\nnew-pattern learning applications based on the reliability of the validation\nprotocol. With respect to this mathematical formulation, we propose a 3D\nexplainability framework aimed at validating the outputs of deep learning\nnetworks in detecting the paracingulate sulcus an essential brain anatomical\nfeature. The framework integrates local 3D explanations, global explanations\nthrough dimensionality reduction, concatenated global explanations, and\nstatistical shape features, unveiling new insights into pattern learning. We\ntrained and tested two advanced 3D deep learning networks on the challenging\nTOP-OSLO dataset, significantly improving sulcus detection accuracy,\nparticularly on the left hemisphere. During evaluation with diverse annotation\nprotocols for this dataset, we highlighted the crucial role of an unbiased\nannotation process in achieving precise predictions and effective pattern\nlearning within our proposed 3D framework. The proposed framework not only\nannotates the variable sulcus but also uncovers hidden AI knowledge, promising\nto advance our understanding of brain anatomy and function.", "paper_summary_zh": "<paragraph>可解釋 AI 在醫學影像中至關重要。在神經科學這個充滿挑戰的領域中，視覺主題呈現出高度的複雜性，特別是在三維空間中。神經科學的應用，包括從 MRI 識別腦溝特徵，由於專家之間不同的註解協定和複雜的三維大腦功能，面臨重大的障礙。因此，傳統的可解釋性方法無法有效驗證和評估這些網路。為了解決這個問題，我們首先提出一個數學公式，描述各種電腦視覺任務中不同的解釋需求類別，根據驗證協定的可靠性，將其分類為自解釋、半解釋、非解釋和新模式學習應用。關於這個數學公式，我們提出一個 3D 可解釋性框架，旨在驗證深度學習網路在偵測旁扣帶溝（一個重要的腦部解剖特徵）的輸出。該框架整合了局部 3D 解釋、透過降維的整體解釋、串聯的整體解釋和統計形狀特徵，揭示了模式學習的新見解。我們在具有挑戰性的 TOP-OSLO 資料集上訓練並測試了兩個先進的 3D 深度學習網路，顯著提高了腦溝偵測的準確度，特別是在左半球。在使用此資料集的不同註解協定進行評估時，我們強調了無偏註解過程在我們提出的 3D 框架中實現精確預測和有效模式學習的重要作用。所提出的框架不僅註解了可變的腦溝，還揭示了隱藏的人工智慧知識，有望推進我們對腦部解剖和功能的理解。</paragraph>", "author": "Michail Mamalakis et.al.", "authors": "Michail Mamalakis, Heloise de Vareilles, Atheer AI-Manea, Samantha C. Mitchell, Ingrid Arartz, Lynn Egeland Morch-Johnsen, Jane Garrison, Jon Simons, Pietro Lio, John Suckling, Graham Murray", "id": "2309.00903v2", "paper_url": "http://arxiv.org/abs/2309.00903v2", "repo": "https://github.com/ece7048/3dsulci"}}