{"2407.21615": {"publish_time": "2024-07-31", "title": "Between the AI and Me: Analysing Listeners' Perspectives on AI- and Human-Composed Progressive Metal Music", "paper_summary": "Generative AI models have recently blossomed, significantly impacting\nartistic and musical traditions. Research investigating how humans interact\nwith and deem these models is therefore crucial. Through a listening and\nreflection study, we explore participants' perspectives on AI- vs\nhuman-generated progressive metal, in symbolic format, using rock music as a\ncontrol group. AI-generated examples were produced by ProgGP, a\nTransformer-based model. We propose a mixed methods approach to assess the\neffects of generation type (human vs. AI), genre (progressive metal vs. rock),\nand curation process (random vs. cherry-picked). This combines quantitative\nfeedback on genre congruence, preference, creativity, consistency, playability,\nhumanness, and repeatability, and qualitative feedback to provide insights into\nlisteners' experiences. A total of 32 progressive metal fans completed the\nstudy. Our findings validate the use of fine-tuning to achieve genre-specific\nspecialization in AI music generation, as listeners could distinguish between\nAI-generated rock and progressive metal. Despite some AI-generated excerpts\nreceiving similar ratings to human music, listeners exhibited a preference for\nhuman compositions. Thematic analysis identified key features for genre and AI\nvs. human distinctions. Finally, we consider the ethical implications of our\nwork in promoting musical data diversity within MIR research by focusing on an\nunder-explored genre.", "paper_summary_zh": "生成式 AI 模型近期蓬勃發展，對藝術和音樂傳統產生重大影響。因此，探討人類如何與這些模型互動並評斷它們的研究至關重要。透過聆聽與反思研究，我們以符號格式探討參與者對 AI 與人類產生的前衛金屬音樂的觀點，並以搖滾音樂作為對照組。AI 生成的範例由 ProgGP，一個基於 Transformer 的模型製作。我們提出一個混合方法來評估生成類型（人類與 AI）、類型（前衛金屬與搖滾）和策展流程（隨機與精選）的影響。這結合了對類型一致性、偏好、創造力、一致性、可演奏性、人性化和可重複性的量化回饋，以及定性回饋，以提供對聽眾體驗的見解。共有 32 位前衛金屬樂迷完成這項研究。我們的發現驗證了微調在 AI 音樂生成中實現特定類型專業化的用途，因為聽眾可以區分 AI 生成的搖滾和前衛金屬。儘管一些 AI 生成的片段獲得與人類音樂類似的評分，但聽眾表現出對人類作品的偏好。主題分析識別出類型和 AI 與人類區別的主要特徵。最後，我們考慮了我們的工作在促進 MIR 研究中的音樂資料多樣性方面的倫理影響，重點放在一個探索不足的類型上。", "author": "Pedro Sarmento et.al.", "authors": "Pedro Sarmento, Jackson Loth, Mathieu Barthet", "id": "2407.21615v1", "paper_url": "http://arxiv.org/abs/2407.21615v1", "repo": "null"}}