{"2407.12336": {"publish_time": "2024-07-17", "title": "M2DS: Multilingual Dataset for Multi-document Summarisation", "paper_summary": "In the rapidly evolving digital era, there is an increasing demand for\nconcise information as individuals seek to distil key insights from various\nsources. Recent attention from researchers on Multi-document Summarisation\n(MDS) has resulted in diverse datasets covering customer reviews, academic\npapers, medical and legal documents, and news articles. However, the\nEnglish-centric nature of these datasets has created a conspicuous void for\nmultilingual datasets in today's globalised digital landscape, where linguistic\ndiversity is celebrated. Media platforms such as British Broadcasting\nCorporation (BBC) have disseminated news in 20+ languages for decades. With\nonly 380 million people speaking English natively as their first language,\naccounting for less than 5% of the global population, the vast majority\nprimarily relies on other languages. These facts underscore the need for\ninclusivity in MDS research, utilising resources from diverse languages.\nRecognising this gap, we present the Multilingual Dataset for Multi-document\nSummarisation (M2DS), which, to the best of our knowledge, is the first dataset\nof its kind. It includes document-summary pairs in five languages from BBC\narticles published during the 2010-2023 period. This paper introduces M2DS,\nemphasising its unique multilingual aspect, and includes baseline scores from\nstate-of-the-art MDS models evaluated on our dataset.", "paper_summary_zh": "<paragraph>在快速演進的數位時代中，隨著個人試圖從各種來源中提煉出關鍵見解，對於簡潔資訊的需求與日俱增。研究人員最近關注多文件摘要 (MDS)，已產生涵蓋顧客評論、學術論文、醫療和法律文件以及新聞文章的多樣化資料集。然而，這些資料集以英語為中心的特質，在當今全球化數位環境中造成了多語言資料集的明顯空缺，而語言多樣性在此環境中備受推崇。英國廣播公司 (BBC) 等媒體平台數十年來已以 20 多種語言傳播新聞。僅有 3.8 億人以英語為母語，約占全球人口的 5%，絕大多數人主要依賴其他語言。這些事實強調了在 MDS 研究中納入多元語言資源的重要性。有鑑於此差距，我們提出了多語言多文件摘要資料集 (M2DS)，根據我們的了解，這是第一個此類資料集。它包含 2010-2023 年期間發布的 BBC 文章中五種語言的文件摘要對。本文介紹 M2DS，強調其獨特的多語言面向，並包含在我們的資料集上評估的最新 MDS 模型的基準分數。</paragraph>", "author": "Kushan Hewapathirana et.al.", "authors": "Kushan Hewapathirana, Nisansa de Silva, C. D. Athuraliya", "id": "2407.12336v1", "paper_url": "http://arxiv.org/abs/2407.12336v1", "repo": "null"}}