{"2407.18550": {"publish_time": "2024-07-26", "title": "ReALFRED: An Embodied Instruction Following Benchmark in Photo-Realistic Environments", "paper_summary": "Simulated virtual environments have been widely used to learn robotic agents\nthat perform daily household tasks. These environments encourage research\nprogress by far, but often provide limited object interactability, visual\nappearance different from real-world environments, or relatively smaller\nenvironment sizes. This prevents the learned models in the virtual scenes from\nbeing readily deployable. To bridge the gap between these learning environments\nand deploying (i.e., real) environments, we propose the ReALFRED benchmark that\nemploys real-world scenes, objects, and room layouts to learn agents to\ncomplete household tasks by understanding free-form language instructions and\ninteracting with objects in large, multi-room and 3D-captured scenes.\nSpecifically, we extend the ALFRED benchmark with updates for larger\nenvironmental spaces with smaller visual domain gaps. With ReALFRED, we analyze\npreviously crafted methods for the ALFRED benchmark and observe that they\nconsistently yield lower performance in all metrics, encouraging the community\nto develop methods in more realistic environments. Our code and data are\npublicly available.", "paper_summary_zh": "模擬虛擬環境已被廣泛用於學習執行日常家務任務的機器人代理。這些環境極大地促進了研究進度，但通常提供有限的物件互動性、與真實世界環境不同的視覺外觀，或相對較小的環境大小。這會讓虛擬場景中學習的模型無法輕易地部署。為了彌補這些學習環境與部署（即真實）環境之間的差距，我們提出了 ReALFRED 基準，它採用真實世界的場景、物件和房間佈局來學習代理，藉由理解自由形式的語言指令並與大型、多房間和 3D 擷取場景中的物件互動，來完成家務任務。具體來說，我們擴充了 ALFRED 基準，以更新較大環境空間的較小視覺域差距。透過 ReALFRED，我們分析了先前為 ALFRED 基準製作的方法，並觀察到它們在所有指標中持續產生較低的效能，鼓勵社群在更逼真的環境中開發方法。我們的程式碼和資料已公開。", "author": "Taewoong Kim et.al.", "authors": "Taewoong Kim, Cheolhong Min, Byeonghwi Kim, Jinyeon Kim, Wonje Jeung, Jonghyun Choi", "id": "2407.18550v1", "paper_url": "http://arxiv.org/abs/2407.18550v1", "repo": "https://github.com/snumprlab/realfred"}}