{"2504.12474": {"publish_time": "2025-04-16", "title": "Integrating Structural and Semantic Signals in Text-Attributed Graphs with BiGTex", "paper_summary": "Text-attributed graphs (TAGs) present unique challenges in representation\nlearning by requiring models to capture both the semantic richness of\nnode-associated texts and the structural dependencies of the graph. While graph\nneural networks (GNNs) excel at modeling topological information, they lack the\ncapacity to process unstructured text. Conversely, large language models (LLMs)\nare proficient in text understanding but are typically unaware of graph\nstructure. In this work, we propose BiGTex (Bidirectional Graph Text), a novel\narchitecture that tightly integrates GNNs and LLMs through stacked Graph-Text\nFusion Units. Each unit allows for mutual attention between textual and\nstructural representations, enabling information to flow in both directions,\ntext influencing structure and structure guiding textual interpretation. The\nproposed architecture is trained using parameter-efficient fine-tuning (LoRA),\nkeeping the LLM frozen while adapting to task-specific signals. Extensive\nexperiments on five benchmark datasets demonstrate that BiGTex achieves\nstate-of-the-art performance in node classification and generalizes effectively\nto link prediction. An ablation study further highlights the importance of soft\nprompting and bi-directional attention in the model's success.", "paper_summary_zh": "<paragraph>文本屬性圖 (TAG) 在表示學習方面提出了獨特的挑戰，要求模型既要捕捉與節點相關聯的文本的豐富語義，又要捕捉圖的結構依賴性。雖然圖神經網絡 (GNN) 擅長建模拓撲信息，但它們缺乏處理非結構化文本的能力。相反，大型語言模型 (LLM) 精通文本理解，但通常不知道圖結構。在這項工作中，我們提出了 BiGTex（雙向圖文本），這是一種通過堆疊圖文本融合單元將 GNN 和 LLM 緊密集成的新穎架構。每個單元允許文本和結構表示之間相互關注，使信息雙向流動，文本影響結構，結構指導文本解釋。所提出的架構使用參數高效的微調 (LoRA) 進行訓練，保持 LLM 凍結的同時適應任務特定的信號。在五個基準數據集上的大量實驗表明，BiGTex 在節點分類中達到了最先進的性能，並且可以有效地泛化到鏈接預測。消融研究進一步強調了軟提示和雙向注意力在模型成功中的重要性。</paragraph>\n", "author": "Azadeh Beiranvand et.al.", "authors": "Azadeh Beiranvand, Seyed Mehdi Vahidipour", "id": "2504.12474v1", "paper_url": "http://arxiv.org/abs/2504.12474v1", "repo": "null"}}