{"2410.10348": {"publish_time": "2024-10-14", "title": "Augmenting In-Context-Learning in LLMs via Automatic Data Labeling and Refinement", "paper_summary": "It has been shown that Large Language Models' (LLMs) performance can be\nimproved for many tasks using Chain of Thought (CoT) or In-Context Learning\n(ICL), which involve demonstrating the steps needed to solve a task using a few\nexamples. However, while datasets with input-output pairs are relatively easy\nto produce, providing demonstrations which include intermediate steps requires\ncumbersome manual work. These steps may be executable programs, as in agentic\nflows, or step-by-step reasoning as in CoT. In this work, we propose Automatic\nData Labeling and Refinement (ADLR), a method to automatically generate and\nfilter demonstrations which include the above intermediate steps, starting from\na small seed of manually crafted examples. We demonstrate the advantage of ADLR\nin code-based table QA and mathematical reasoning, achieving up to a 5.5% gain.\nThe code implementing our method is provided in the Supplementary material and\nwill be made available.", "paper_summary_zh": "研究表明，透過思想鏈（CoT）或情境學習（ICL）可以改善大型語言模型（LLM）的許多任務表現，這涉及展示使用幾個範例解決任務所需的步驟。然而，雖然具有輸入輸出配對的資料集相對容易產生，但提供包含中間步驟的範例需要繁瑣的手動工作。這些步驟可能是可執行程式，例如代理流程，或如 CoT 中的逐步推理。在這項工作中，我們提出自動資料標記和精煉（ADLR），這是一種方法，可以從少量手動製作範例開始，自動產生和過濾包含上述中間步驟的範例。我們在基於程式碼的表格問答和數學推理中展示了 ADLR 的優點，獲得了高達 5.5% 的增益。實作我們方法的程式碼提供在補充資料中，並將公開。", "author": "Joseph Shtok et.al.", "authors": "Joseph Shtok, Amit Alfassy, Foad Abo Dahood, Eliyahu Schwartz, Sivan Doveh, Assaf Arbelle", "id": "2410.10348v1", "paper_url": "http://arxiv.org/abs/2410.10348v1", "repo": "null"}}