{"2408.06069": {"publish_time": "2024-08-12", "title": "Fully Bayesian Differential Gaussian Processes through Stochastic Differential Equations", "paper_summary": "Traditional deep Gaussian processes model the data evolution using a discrete\nhierarchy, whereas differential Gaussian processes (DIFFGPs) represent the\nevolution as an infinitely deep Gaussian process. However, prior DIFFGP methods\noften overlook the uncertainty of kernel hyperparameters and assume them to be\nfixed and time-invariant, failing to leverage the unique synergy between\ncontinuous-time models and approximate inference. In this work, we propose a\nfully Bayesian approach that treats the kernel hyperparameters as random\nvariables and constructs coupled stochastic differential equations (SDEs) to\nlearn their posterior distribution and that of inducing points. By\nincorporating estimation uncertainty on hyperparameters, our method enhances\nthe model's flexibility and adaptability to complex dynamics. Additionally, our\napproach provides a time-varying, comprehensive, and realistic posterior\napproximation through coupling variables using SDE methods. Experimental\nresults demonstrate the advantages of our method over traditional approaches,\nshowcasing its superior performance in terms of flexibility, accuracy, and\nother metrics. Our work opens up exciting research avenues for advancing\nBayesian inference and offers a powerful modeling tool for continuous-time\nGaussian processes.", "paper_summary_zh": "傳統深度高斯程序使用離散層級來建模資料演進，而差分高斯程序 (DIFFGP) 則將演進表示為無限深度的 Gaussian 程序。然而，先前的 DIFFGP 方法經常忽略核仁超參數的不確定性，並假設它們是固定的和時不變的，未能利用連續時間模型和近似推論之間的獨特協同作用。在這項工作中，我們提出了一種完全貝氏方法，將核仁超參數視為隨機變數，並建構耦合隨機微分方程式 (SDE) 來學習它們的後驗分佈和誘導點的後驗分佈。透過納入超參數的估計不確定性，我們的模型增強了模型對複雜動態的靈活性與適應性。此外，我們的模型透過使用 SDE 方法耦合變數，提供了一個時變、全面且真實的後驗近似。實驗結果證明了我們的方法優於傳統方法，展示了它在靈活性、準確性和其他指標方面的優異效能。我們的模型開啟了推進貝氏推論的令人興奮的研究途徑，並為連續時間高斯程序提供了一個強大的建模工具。", "author": "Jian Xu et.al.", "authors": "Jian Xu, Zhiqi Lin, Min Chen, Junmei Yang, Delu Zeng, John Paisley", "id": "2408.06069v1", "paper_url": "http://arxiv.org/abs/2408.06069v1", "repo": "null"}}