{"2407.01964": {"publish_time": "2024-07-02", "title": "Enabling Discriminative Reasoning in LLMs for Legal Judgment Prediction", "paper_summary": "Legal judgment prediction is essential for enhancing judicial efficiency. In\nthis work, we identify that existing large language models (LLMs) underperform\nin this domain due to challenges in understanding case complexities and\ndistinguishing between similar charges. To adapt LLMs for effective legal\njudgment prediction, we introduce the Ask-Discriminate-Predict (ADAPT)\nreasoning framework inspired by human judicial reasoning. ADAPT involves\ndecomposing case facts, discriminating among potential charges, and predicting\nthe final judgment. We further enhance LLMs through fine-tuning with multi-task\nsynthetic trajectories to improve legal judgment prediction accuracy and\nefficiency under our ADAPT framework. Extensive experiments conducted on two\nwidely-used datasets demonstrate the superior performance of our framework in\nlegal judgment prediction, particularly when dealing with complex and confusing\ncharges.", "paper_summary_zh": "法律判決預測對於提升司法效率至關重要。在這項工作中，我們發現現有的大型語言模型 (LLM) 在這個領域表現不佳，原因在於難以理解案件複雜性以及區分類似的指控。為了讓 LLM 適應有效的法律判決預測，我們引入了受人類司法推理啟發的詢問-區分-預測 (ADAPT) 推理架構。ADAPT 涉及分解案件事實、區分潛在指控以及預測最終判決。我們進一步透過微調多任務合成軌跡來增強 LLM，以在我們的 ADAPT 架構下提高法律判決預測的準確性和效率。在兩個廣泛使用的資料集上進行的廣泛實驗證明了我們的架構在法律判決預測中的優異效能，特別是在處理複雜且令人困惑的指控時。", "author": "Chenlong Deng et.al.", "authors": "Chenlong Deng, Kelong Mao, Yuyao Zhang, Zhicheng Dou", "id": "2407.01964v2", "paper_url": "http://arxiv.org/abs/2407.01964v2", "repo": "null"}}