{"2412.17727": {"publish_time": "2024-12-23", "title": "Knowledge Editing through Chain-of-Thought", "paper_summary": "Large Language Models (LLMs) have demonstrated exceptional capabilities\nacross a wide range of natural language processing (NLP) tasks. However,\nkeeping these models up-to-date with evolving world knowledge remains a\nsignificant challenge due to the high costs of frequent retraining. To address\nthis challenge, knowledge editing techniques have emerged to update LLMs with\nnew information without rebuilding the model from scratch. Among these, the\nin-context editing paradigm stands out for its effectiveness in integrating new\nknowledge while preserving the model's original capabilities. Despite its\npotential, existing in-context knowledge editing methods are often\ntask-specific, focusing primarily on multi-hop QA tasks using structured\nknowledge triples. Moreover, their reliance on few-shot prompting for task\ndecomposition makes them unstable and less effective in generalizing across\ndiverse tasks.\n  In response to these limitations, we propose EditCoT, a novel knowledge\nediting framework that flexibly and efficiently updates LLMs across various\ntasks without retraining. EditCoT works by generating a chain-of-thought (CoT)\nfor a given input and then iteratively refining this CoT process using a CoT\neditor based on updated knowledge. We evaluate EditCoT across a diverse range\nof benchmarks, covering multiple languages and tasks. The results demonstrate\nthat our approach achieves state-of-the-art performance while offering superior\ngeneralization, effectiveness, and stability compared to existing methods,\nmarking a significant advancement in the field of knowledge updating. Code and\ndata are available at: https://github.com/bebr2/EditCoT.", "paper_summary_zh": "大型語言模型 (LLM) 已在廣泛的自然語言處理 (NLP) 任務中展現出非凡的能力。然而，由於頻繁重新訓練的成本高昂，讓這些模型與不斷演進的世界知識保持同步仍是一項重大挑戰。為了應對此挑戰，知識編輯技術應運而生，可以在不從頭重建模型的情況下，使用新資訊更新 LLM。其中，情境編輯範例因其在整合新知識的同時，還能保留模型的原始能力而脫穎而出。儘管有其潛力，現有的情境知識編輯方法通常是特定於任務的，主要專注於使用結構化知識三元組的多跳問答任務。此外，它們依賴於少次提示來進行任務分解，這使得它們不穩定，且在跨不同任務進行概括時效果較差。\n為了回應這些限制，我們提出了 EditCoT，這是一個新穎的知識編輯架構，可以在不重新訓練的情況下，靈活且有效地跨各種任務更新 LLM。EditCoT 的運作方式是為給定的輸入產生一個思考鏈 (CoT)，然後使用基於更新知識的 CoT 編輯器，反覆優化這個 CoT 程序。我們在涵蓋多種語言和任務的多元基準上評估 EditCoT。結果表明，與現有方法相比，我們的做法達到了最先進的效能，同時提供了優異的概括性、有效性和穩定性，標誌著知識更新領域的重大進展。程式碼和資料可於以下網址取得：https://github.com/bebr2/EditCoT。", "author": "Changyue Wang et.al.", "authors": "Changyue Wang, Weihang Su, Qingyao Ai, Yiqun Liu", "id": "2412.17727v1", "paper_url": "http://arxiv.org/abs/2412.17727v1", "repo": "https://github.com/bebr2/editcot"}}