{"2502.03014": {"publish_time": "2025-02-05", "title": "xai_evals : A Framework for Evaluating Post-Hoc Local Explanation Methods", "paper_summary": "The growing complexity of machine learning and deep learning models has led\nto an increased reliance on opaque \"black box\" systems, making it difficult to\nunderstand the rationale behind predictions. This lack of transparency is\nparticularly challenging in high-stakes applications where interpretability is\nas important as accuracy. Post-hoc explanation methods are commonly used to\ninterpret these models, but they are seldom rigorously evaluated, raising\nconcerns about their reliability. The Python package xai_evals addresses this\nby providing a comprehensive framework for generating, benchmarking, and\nevaluating explanation methods across both tabular and image data modalities.\nIt integrates popular techniques like SHAP, LIME, Grad-CAM, Integrated\nGradients (IG), and Backtrace, while supporting evaluation metrics such as\nfaithfulness, sensitivity, and robustness. xai_evals enhances the\ninterpretability of machine learning models, fostering transparency and trust\nin AI systems. The library is open-sourced at\nhttps://pypi.org/project/xai-evals/ .", "paper_summary_zh": "機器學習和深度學習模型的複雜性日益增加，導致對不透明的「黑盒子」系統的依賴性提高，使得難以理解預測背後的依據。這種缺乏透明性的狀況在高風險應用中特別具有挑戰性，因為可解釋性與準確性同樣重要。事後解釋方法通常用於解釋這些模型，但它們很少經過嚴格評估，引發了對其可靠性的擔憂。Python 套件 xai_evals 透過提供一個全面的架構來產生、評比和評估表格和影像資料模式的解釋方法，來解決這個問題。它整合了 SHAP、LIME、Grad-CAM、整合梯度 (IG) 和回溯等熱門技術，同時支援忠實度、敏感度和穩健性等評估指標。xai_evals 增強了機器學習模型的可解釋性，促進了對 AI 系統的透明度和信任。這個函式庫在 https://pypi.org/project/xai-evals/ 開源。", "author": "Pratinav Seth et.al.", "authors": "Pratinav Seth, Yashwardhan Rathore, Neeraj Kumar Singh, Chintan Chitroda, Vinay Kumar Sankarapu", "id": "2502.03014v1", "paper_url": "http://arxiv.org/abs/2502.03014v1", "repo": "null"}}