{"2411.16454": {"publish_time": "2024-11-25", "title": "Learning by Analogy: Enhancing Few-Shot Prompting for Math Word Problem Solving with Computational Graph-Based Retrieval", "paper_summary": "Large language models (LLMs) are known to struggle with complicated reasoning\ntasks such as math word problems (MWPs). In this paper, we present how analogy\nfrom similarly structured questions can improve LLMs' problem-solving\ncapabilities for MWPs. Specifically, we rely on the retrieval of problems with\nsimilar computational graphs to the given question to serve as exemplars in the\nprompt, providing the correct reasoning path for the generation model to refer\nto. Empirical results across six math word problem datasets demonstrate the\neffectiveness of our proposed method, which achieves a significant improvement\nof up to 6.7 percent on average in absolute value, compared to baseline\nmethods. These results highlight our method's potential in addressing the\nreasoning challenges in current LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 已知在複雜推理任務（例如數學文字題 (MWP)）中會遇到困難。在本文中，我們展示了來自結構相似的問題的類比如何能改善 LLM 對 MWP 的問題解決能力。具體來說，我們依賴於擷取與給定問題具有類似運算圖形的問題，作為提示中的範例，為生成模型提供正確的推理路徑以供參考。六個數學文字題數據集的實證結果證明了我們提出的方法的有效性，與基線方法相比，平均絕對值提高了 6.7 個百分點。這些結果突出了我們的方法在解決當前 LLM 中的推理挑戰方面的潛力。", "author": "Xiaocong Yang et.al.", "authors": "Xiaocong Yang, Jiacheng Lin, Ziqi Wang, Chengxiang Zhai", "id": "2411.16454v1", "paper_url": "http://arxiv.org/abs/2411.16454v1", "repo": "null"}}