{"2411.07441": {"publish_time": "2024-11-11", "title": "Automatically Detecting Online Deceptive Patterns in Real-time", "paper_summary": "Deceptive patterns (DPs) in digital interfaces manipulate users into making\nunintended decisions, exploiting cognitive biases and psychological\nvulnerabilities. These patterns have become ubiquitous across various digital\nplatforms. While efforts to mitigate DPs have emerged from legal and technical\nperspectives, a significant gap in usable solutions that empower users to\nidentify and make informed decisions about DPs in real-time remains. In this\nwork, we introduce AutoBot, an automated, deceptive pattern detector that\nanalyzes websites' visual appearances using machine learning techniques to\nidentify and notify users of DPs in real-time. AutoBot employs a two-staged\npipeline that processes website screenshots, identifying interactable elements\nand extracting textual features without relying on HTML structure. By\nleveraging a custom language model, AutoBot understands the context surrounding\nthese elements to determine the presence of deceptive patterns. We implement\nAutoBot as a lightweight Chrome browser extension that performs all analyses\nlocally, minimizing latency and preserving user privacy. Through extensive\nevaluation, we demonstrate AutoBot's effectiveness in enhancing users' ability\nto navigate digital environments safely while providing a valuable tool for\nregulators to assess and enforce compliance with DP regulations.", "paper_summary_zh": "數位介面中的欺騙性模式 (DP) 會操縱使用者做出非預期的決定，利用認知偏誤和心理漏洞。這些模式已在各種數位平台上變得無所不在。雖然從法律和技術角度來看，已經出現減輕 DP 的努力，但仍然缺乏重要的可用解決方案，讓使用者能夠識別和做出有關 DP 的明智決定。在這項工作中，我們介紹了 AutoBot，這是一個自動化的欺騙性模式偵測器，它使用機器學習技術分析網站的視覺外觀，以識別和即時通知使用者 DP。AutoBot 採用一個兩階段管道，處理網站螢幕截圖、識別可互動元素，並在不依賴 HTML 結構的情況下擷取文字特徵。透過利用自訂語言模型，AutoBot 了解這些元素周圍的內容，以確定是否存在欺騙性模式。我們將 AutoBot 實作為一個輕量級的 Chrome 瀏覽器擴充功能，它在本地執行所有分析，將延遲降至最低並保護使用者隱私。透過廣泛的評估，我們展示了 AutoBot 在提升使用者安全瀏覽數位環境的能力方面的有效性，同時也為監管機構提供了一個有價值的工具，用於評估和強制遵守 DP 法規。", "author": "Asmit Nayak et.al.", "authors": "Asmit Nayak, Shirley Zhang, Yash Wani, Rishabh Khandelwal, Kassem Fawaz", "id": "2411.07441v1", "paper_url": "http://arxiv.org/abs/2411.07441v1", "repo": "null"}}