{"2409.10964": {"publish_time": "2024-09-17", "title": "Active learning for energy-based antibody optimization and enhanced screening", "paper_summary": "Accurate prediction and optimization of protein-protein binding affinity is\ncrucial for therapeutic antibody development. Although machine learning-based\nprediction methods $\\Delta\\Delta G$ are suitable for large-scale mutant\nscreening, they struggle to predict the effects of multiple mutations for\ntargets without existing binders. Energy function-based methods, though more\naccurate, are time consuming and not ideal for large-scale screening. To\naddress this, we propose an active learning workflow that efficiently trains a\ndeep learning model to learn energy functions for specific targets, combining\nthe advantages of both approaches. Our method integrates the RDE-Network deep\nlearning model with Rosetta's energy function-based Flex ddG to efficiently\nexplore mutants that bind to Flex ddG. In a case study targeting HER2-binding\nTrastuzumab mutants, our approach significantly improved the screening\nperformance over random selection and demonstrated the ability to identify\nmutants with better binding properties without experimental $\\Delta\\Delta G$\ndata. This workflow advances computational antibody design by combining machine\nlearning, physics-based computations, and active learning to achieve more\nefficient antibody development.", "paper_summary_zh": "準確預測和最佳化蛋白質-蛋白質結合親和力對於治療性抗體開發至關重要。儘管基於機器學習的預測方法$\\Delta\\Delta G$適用於大規模突變篩選，但它們難以預測沒有現有結合劑的目標的多次突變的影響。基於能量函數的方法雖然更準確，但耗時且不適用於大規模篩選。為了解決這個問題，我們提出一個主動學習工作流程，可以有效訓練一個深度學習模型來學習特定目標的能量函數，結合兩種方法的優點。我們的模型將 RDE-Network 深度學習模型與 Rosetta 基於能量函數的 Flex ddG 結合，以有效探索與 Flex ddG 結合的突變體。在針對 HER2 結合 Trastuzumab 突變體的案例研究中，我們的模型顯著提升了隨機選擇的篩選效能，並證明了在沒有實驗性$\\Delta\\Delta G$資料的情況下識別具有更好結合特性的突變體的能力。這個工作流程結合機器學習、基於物理的計算和主動學習，推動了計算抗體設計，以實現更有效的抗體開發。", "author": "Kairi Furui et.al.", "authors": "Kairi Furui, Masahito Ohue", "id": "2409.10964v1", "paper_url": "http://arxiv.org/abs/2409.10964v1", "repo": "null"}}