{"2410.18032": {"publish_time": "2024-10-23", "title": "GraphTeam: Facilitating Large Language Model-based Graph Analysis via Multi-Agent Collaboration", "paper_summary": "Graphs are widely used for modeling relational data in real-world scenarios,\nsuch as social networks and urban computing. Existing LLM-based graph analysis\napproaches either integrate graph neural networks (GNNs) for specific machine\nlearning tasks, limiting their transferability, or rely solely on LLMs'\ninternal reasoning ability, resulting in suboptimal performance. To address\nthese limitations, we take advantage of recent advances in LLM-based agents,\nwhich have shown capabilities of utilizing external knowledge or tools for\nproblem solving. By simulating human problem-solving strategies such as analogy\nand collaboration, we propose a multi-agent system based on LLMs named\nGraphTeam, for graph analysis. GraphTeam consists of five LLM-based agents from\nthree modules, and the agents with different specialities can collaborate with\neach other to address complex problems. Specifically, (1) input-output\nnormalization module: the question agent extracts and refines four key\narguments from the original question, facilitating the problem understanding,\nand the answer agent organizes the results to meet the output requirement; (2)\nexternal knowledge retrieval module: we first build a knowledge base consisting\nof relevant documentation and experience information, and then the search agent\nretrieves the most relevant entries for each question. (3) problem-solving\nmodule: given the retrieved information from search agent, the coding agent\nuses established algorithms via programming to generate solutions, and in case\nthe coding agent does not work, the reasoning agent will directly compute the\nresults without programming. Extensive experiments on six graph analysis\nbenchmarks demonstrate that GraphTeam achieves state-of-the-art performance\nwith an average 25.85% improvement over the best baseline in terms of accuracy.\nThe code and data are available at https://github.com/BUPT-GAMMA/GraphTeam.", "paper_summary_zh": "<paragraph>圖表廣泛用於在現實世界的場景中對關聯資料進行建模，例如社交網路和城市運算。現有的基於 LLM 的圖表分析方法，不是整合圖神經網路 (GNN) 來執行特定的機器學習任務，限制了它們的可轉移性，就是單純依賴 LLM 的內部推理能力，導致次佳的效能。為了解決這些限制，我們利用 LLM 基於代理的最新進展，這些進展已展現出利用外部知識或工具來解決問題的能力。透過模擬類比和協作等人類問題解決策略，我們提出了一個基於 LLM 的多代理系統，稱為 GraphTeam，用於圖表分析。GraphTeam 由來自三個模組的五個基於 LLM 的代理組成，而具有不同專業知識的代理可以彼此協作，以解決複雜的問題。具體來說，（1）輸入輸出正規化模組：問題代理從原始問題中萃取和精煉出四個關鍵論點，促進問題理解，而答案代理則整理結果以符合輸出需求；（2）外部知識擷取模組：我們首先建立一個由相關文件和經驗資訊組成的知識庫，然後搜尋代理會為每個問題擷取最相關的條目。（3）問題解決模組：在給定從搜尋代理擷取的資訊後，編碼代理會透過程式設計使用已建立的演算法來產生解決方案，而如果編碼代理無法運作，推理代理將會直接在沒有程式設計的情況下計算結果。在六個圖表分析基準上的廣泛實驗證明，GraphTeam 達到了最先進的效能，在準確度方面比最佳基準線平均提升了 25.85%。程式碼和資料可在 https://github.com/BUPT-GAMMA/GraphTeam 取得。</paragraph>", "author": "Xin Li et.al.", "authors": "Xin Li, Qizhi Chu, Yubin Chen, Yang Liu, Yaoqi Liu, Zekai Yu, Weize Chen, Chen Qian, Chuan Shi, Cheng Yang", "id": "2410.18032v1", "paper_url": "http://arxiv.org/abs/2410.18032v1", "repo": "https://github.com/bupt-gamma/graphteam"}}