{"2406.06520": {"publish_time": "2024-06-10", "title": "Decentralized Personalized Federated Learning", "paper_summary": "This work tackles the challenges of data heterogeneity and communication\nlimitations in decentralized federated learning. We focus on creating a\ncollaboration graph that guides each client in selecting suitable collaborators\nfor training personalized models that leverage their local data effectively.\nOur approach addresses these issues through a novel, communication-efficient\nstrategy that enhances resource efficiency. Unlike traditional methods, our\nformulation identifies collaborators at a granular level by considering\ncombinatorial relations of clients, enhancing personalization while minimizing\ncommunication overhead. We achieve this through a bi-level optimization\nframework that employs a constrained greedy algorithm, resulting in a\nresource-efficient collaboration graph for personalized learning. Extensive\nevaluation against various baselines across diverse datasets demonstrates the\nsuperiority of our method, named DPFL. DPFL consistently outperforms other\napproaches, showcasing its effectiveness in handling real-world data\nheterogeneity, minimizing communication overhead, enhancing resource\nefficiency, and building personalized models in decentralized federated\nlearning scenarios.", "paper_summary_zh": "这项工作解决了去中心化联邦学习中数据异质性和通信限制的挑战。我们专注于创建一个协作图，指导每个客户端选择合适的协作者来训练个性化模型，该模型有效利用其本地数据。我们的方法通过一种新颖的、通信效率高的策略来解决这些问题，该策略提高了资源效率。与传统方法不同，我们的公式通过考虑客户端的组合关系来细粒度地识别协作者，在最大程度减少通信开销的同时增强个性化。我们通过一个双层优化框架来实现这一点，该框架采用受约束的贪心算法，从而生成一个用于个性化学习的资源高效协作图。针对不同数据集的各种基准进行的广泛评估证明了我们名为 DPFL 的方法的优越性。DPFL 始终优于其他方法，展示了其在处理现实世界数据异质性、最小化通信开销、提高资源效率和在去中心化联邦学习场景中构建个性化模型方面的有效性。", "author": "Salma Kharrat et.al.", "authors": "Salma Kharrat, Marco Canini, Samuel Horvath", "id": "2406.06520v1", "paper_url": "http://arxiv.org/abs/2406.06520v1", "repo": "null"}}