{"2502.05104": {"publish_time": "2025-02-07", "title": "Leveraging Hypernetworks and Learnable Kernels for Consumer Energy Forecasting Across Diverse Consumer Types", "paper_summary": "Consumer energy forecasting is essential for managing energy consumption and\nplanning, directly influencing operational efficiency, cost reduction,\npersonalized energy management, and sustainability efforts. In recent years,\ndeep learning techniques, especially LSTMs and transformers, have been greatly\nsuccessful in the field of energy consumption forecasting. Nevertheless, these\ntechniques have difficulties in capturing complex and sudden variations, and,\nmoreover, they are commonly examined only on a specific type of consumer (e.g.,\nonly offices, only schools). Consequently, this paper proposes HyperEnergy, a\nconsumer energy forecasting strategy that leverages hypernetworks for improved\nmodeling of complex patterns applicable across a diversity of consumers.\nHypernetwork is responsible for predicting the parameters of the primary\nprediction network, in our case LSTM. A learnable adaptable kernel, comprised\nof polynomial and radial basis function kernels, is incorporated to enhance\nperformance. The proposed HyperEnergy was evaluated on diverse consumers\nincluding, student residences, detached homes, a home with electric vehicle\ncharging, and a townhouse. Across all consumer types, HyperEnergy consistently\noutperformed 10 other techniques, including state-of-the-art models such as\nLSTM, AttentionLSTM, and transformer.", "paper_summary_zh": "消費者能源預測對於管理能源消耗和規劃至關重要，直接影響營運效率、成本降低、個人化能源管理和永續性工作。近年來，深度學習技術，特別是 LSTM 和 Transformer，在能源消耗預測領域取得了巨大的成功。儘管如此，這些技術在捕捉複雜和突然的變化方面存在困難，而且通常僅在特定類型的消費者（例如，僅辦公室、僅學校）上進行檢驗。因此，本文提出了 HyperEnergy，一種消費者能源預測策略，它利用超網路來改善適用於各種消費者的複雜模式建模。超網路負責預測主預測網路（在我們的案例中為 LSTM）的參數。一個可學習的可適應核，由多項式和徑向基函數核組成，被納入以增強效能。所提出的 HyperEnergy 在各種消費者上進行了評估，包括學生宿舍、獨棟住宅、配備電動車充電功能的住宅和聯排住宅。在所有消費者類型中，HyperEnergy 的表現始終優於其他 10 種技術，包括 LSTM、AttentionLSTM 和 Transformer 等最先進的模型。", "author": "Muhammad Umair Danish et.al.", "authors": "Muhammad Umair Danish, Katarina Grolinger", "id": "2502.05104v1", "paper_url": "http://arxiv.org/abs/2502.05104v1", "repo": "null"}}