{"2502.03729": {"publish_time": "2025-02-06", "title": "Action-Free Reasoning for Policy Generalization", "paper_summary": "End-to-end imitation learning offers a promising approach for training robot\npolicies. However, generalizing to new settings remains a significant\nchallenge. Although large-scale robot demonstration datasets have shown\npotential for inducing generalization, they are resource-intensive to scale. In\ncontrast, human video data is abundant and diverse, presenting an attractive\nalternative. Yet, these human-video datasets lack action labels, complicating\ntheir use in imitation learning. Existing methods attempt to extract grounded\naction representations (e.g., hand poses), but resulting policies struggle to\nbridge the embodiment gap between human and robot actions. We propose an\nalternative approach: leveraging language-based reasoning from human\nvideos-essential for guiding robot actions-to train generalizable robot\npolicies. Building on recent advances in reasoning-based policy architectures,\nwe introduce Reasoning through Action-free Data (RAD). RAD learns from both\nrobot demonstration data (with reasoning and action labels) and action-free\nhuman video data (with only reasoning labels). The robot data teaches the model\nto map reasoning to low-level actions, while the action-free data enhances\nreasoning capabilities. Additionally, we will release a new dataset of 3,377\nhuman-hand demonstrations with reasoning annotations compatible with the Bridge\nV2 benchmark and aimed at facilitating future research on reasoning-driven\nrobot learning. Our experiments show that RAD enables effective transfer across\nthe embodiment gap, allowing robots to perform tasks seen only in action-free\ndata. Furthermore, scaling up action-free reasoning data significantly improves\npolicy performance and generalization to novel tasks. These results highlight\nthe promise of reasoning-driven learning from action-free datasets for\nadvancing generalizable robot control. Project page:\nhttps://rad-generalization.github.io", "paper_summary_zh": "端對端模仿學習提供了一種訓練機器人政策的有前景的方法。然而，推廣到新的設定仍然是一個重大的挑戰。儘管大規模機器人示範數據集已顯示出誘導概括的潛力，但它們在擴展方面需要大量資源。相比之下，人類視頻數據豐富且多樣，提供了一個有吸引力的替代方案。然而，這些人類視頻數據集缺乏動作標籤，使它們在模仿學習中的使用變得複雜。現有方法嘗試提取接地的動作表示（例如，手部姿勢），但由此產生的策略難以彌合人類和機器人動作之間的具體化差距。我們提出了一種替代方法：利用人類視頻中基於語言的推理——指導機器人動作的必要條件——來訓練可概括的機器人策略。在基於推理的策略架構的最新進展的基礎上，我們引入了無動作數據推理 (RAD)。RAD 從機器人示範數據（帶有推理和動作標籤）和無動作人類視頻數據（僅帶有推理標籤）中學習。機器人數據教導模型將推理映射到低級動作，而無動作數據增強了推理能力。此外，我們將發布一個新的數據集，其中包含 3,377 個帶有推理註釋的人手示範，這些註釋與 Bridge V2 基準兼容，旨在促進未來對基於推理的機器人學習的研究。我們的實驗表明，RAD 能夠有效地跨越具體化差距，讓機器人能夠執行僅在無動作數據中看到的任務。此外，擴展無動作推理數據顯著提高了策略性能和對新任務的概括。這些結果突出了無動作數據集的基於推理的學習在推進可概括機器人控制方面的前景。項目頁面：https://rad-generalization.github.io", "author": "Jaden Clark et.al.", "authors": "Jaden Clark, Suvir Mirchandani, Dorsa Sadigh, Suneel Belkhale", "id": "2502.03729v1", "paper_url": "http://arxiv.org/abs/2502.03729v1", "repo": "null"}}