{"2411.02939": {"publish_time": "2024-11-05", "title": "A Post-Training Enhanced Optimization Approach for Small Language Models", "paper_summary": "This paper delves into the continuous post-training optimization methods for\nsmall language models, and proposes a continuous post-training alignment data\nconstruction method for small language models. The core of this method is based\non the data guidance of large models, optimizing the diversity and accuracy of\nalignment data. In addition, to verify the effectiveness of the methods in this\npaper, we used Qwen2-0.5B-Instruct model as the baseline model for small\nlanguage models, using the alignment dataset constructed by our proposed\nmethod, we trained and compared several groups of experiments, including SFT\n(Supervised Fine Tuning) post-training experiment and KTO (Kahneman Tversky\noptimization) post-training experiment, as well as SFT-KTO two-stage\npost-training experiment and model weight fusion experiment. Finally, we\nevaluated and analyzed the performance of post-training models, and confirmed\nthat the continuous post-training optimization method proposed by us can\nsignificantly improve the performance of small language models.", "paper_summary_zh": "本文深入探讨了小语言模型的持续后训练优化方法，并提出了一种小语言模型的持续后训练对齐数据构建方法。该方法的核心是基于大模型的数据指导，优化对齐数据的 diversity 和准确性。此外，为了验证本文方法的有效性，我们使用 Qwen2-0.5B-Instruct 模型作为小语言模型的 baseline 模型，使用我们提出的方法构建的对齐数据集，训练并比较了几组实验，包括 SFT（有监督微调）后训练实验和 KTO（Kahneman Tversky 优化）后训练实验，以及 SFT-KTO 两阶段后训练实验和模型权重融合实验。最后，我们对后训练模型的性能进行了评估和分析，并确认我们提出的持续后训练优化方法可以显著提升小语言模型的性能。", "author": "Keke Zhai et.al.", "authors": "Keke Zhai", "id": "2411.02939v1", "paper_url": "http://arxiv.org/abs/2411.02939v1", "repo": "null"}}