{"2412.09413": {"publish_time": "2024-12-12", "title": "Imitate, Explore, and Self-Improve: A Reproduction Report on Slow-thinking Reasoning Systems", "paper_summary": "Recently, slow-thinking reasoning systems, such as o1, have demonstrated\nremarkable capabilities in solving complex reasoning tasks. These systems\ntypically engage in an extended thinking process before responding to a query,\nallowing them to generate more thorough, accurate, and well-reasoned solutions.\nThese systems are primarily developed and maintained by industry, with their\ncore techniques not publicly disclosed. In response, an increasing number of\nstudies from the research community aim to explore the technical foundations\nunderlying these powerful reasoning systems. Building on these prior efforts,\nthis paper presents a reproduction report on implementing o1-like reasoning\nsystems. We introduce an \"imitate, explore, and self-improve\" framework as our\nprimary technical approach to train the reasoning model. In the initial phase,\nwe use distilled long-form thought data to fine-tune the reasoning model,\nenabling it to invoke a slow-thinking mode. The model is then encouraged to\nexplore challenging problems by generating multiple rollouts, which can result\nin increasingly more high-quality trajectories that lead to correct answers.\nFurthermore, the model undergoes self-improvement by iteratively refining its\ntraining dataset. To verify the effectiveness of this approach, we conduct\nextensive experiments on three challenging benchmarks. The experimental results\ndemonstrate that our approach achieves competitive performance compared to\nindustry-level reasoning systems on these benchmarks.", "paper_summary_zh": "<paragraph>最近，慢思考推理系统（例如 o1）已展现出在解决复杂推理任务方面的非凡能力。这些系统通常在回答查询之前进行长时间的思考过程，从而能够生成更全面、准确且经过充分推理的解决方案。这些系统主要由行业开发和维护，其核心技术并未公开披露。作为回应，越来越多的研究界研究旨在探索这些强大的推理系统背后的技术基础。在此前工作的基础上，本文介绍了关于实施类似 o1 的推理系统的复制报告。我们引入了一个“模仿、探索和自我完善”框架作为我们训练推理模型的主要技术方法。在初始阶段，我们使用精馏的长格式思维数据对推理模型进行微调，使其能够调用慢思考模式。然后鼓励模型通过生成多个滚动来探索具有挑战性的问题，这可能导致产生更多高质量的轨迹，从而得出正确的答案。此外，该模型通过迭代优化其训练数据集来自我完善。为了验证此方法的有效性，我们在三个具有挑战性的基准上进行了广泛的实验。实验结果表明，与这些基准上的行业级推理系统相比，我们的方法取得了具有竞争力的性能。</paragraph>", "author": "Yingqian Min et.al.", "authors": "Yingqian Min, Zhipeng Chen, Jinhao Jiang, Jie Chen, Jia Deng, Yiwen Hu, Yiru Tang, Jiapeng Wang, Xiaoxue Cheng, Huatong Song, Wayne Xin Zhao, Zheng Liu, Zhongyuan Wang, Ji-Rong Wen", "id": "2412.09413v1", "paper_url": "http://arxiv.org/abs/2412.09413v1", "repo": "null"}}