{"2405.16876": {"publish_time": "2024-05-27", "title": "Transfer Learning for Diffusion Models", "paper_summary": "Diffusion models, a specific type of generative model, have achieved\nunprecedented performance in recent years and consistently produce high-quality\nsynthetic samples. A critical prerequisite for their notable success lies in\nthe presence of a substantial number of training samples, which can be\nimpractical in real-world applications due to high collection costs or\nassociated risks. Consequently, various finetuning and regularization\napproaches have been proposed to transfer knowledge from existing pre-trained\nmodels to specific target domains with limited data. This paper introduces the\nTransfer Guided Diffusion Process (TGDP), a novel approach distinct from\nconventional finetuning and regularization methods. We prove that the optimal\ndiffusion model for the target domain integrates pre-trained diffusion models\non the source domain with additional guidance from a domain classifier. We\nfurther extend TGDP to a conditional version for modeling the joint\ndistribution of data and its corresponding labels, together with two additional\nregularization terms to enhance the model performance. We validate the\neffectiveness of TGDP on Gaussian mixture simulations and on real\nelectrocardiogram (ECG) datasets.", "paper_summary_zh": "擴散模型，一種特定類型的生成式模型，在近年來取得前所未有的效能，並持續產生高品質的合成樣本。它們顯著成功的關鍵先決條件在於大量訓練樣本的存在，然而在實際應用中，由於高昂的收集成本或相關風險，這可能不切實際。因此，各種微調和正則化方法已被提出，以將知識從現有的預訓練模型轉移到具有有限數據的特定目標領域。本文介紹了轉移引導擴散過程 (TGDP)，這是一種不同於傳統微調和正則化方法的新穎方法。我們證明了目標領域的最佳擴散模型整合了來源領域的預訓練擴散模型，並結合了來自領域分類器的額外指導。我們進一步將 TGDP 延伸到條件式版本，用於建模數據及其對應標籤的聯合分佈，並加入兩個額外的正則化項以增強模型效能。我們在高斯混合模擬和真實心電圖 (ECG) 資料集上驗證了 TGDP 的有效性。", "author": "Yidong Ouyang et.al.", "authors": "Yidong Ouyang, Liyan Xie, Hongyuan Zha, Guang Cheng", "id": "2405.16876v2", "paper_url": "http://arxiv.org/abs/2405.16876v2", "repo": "null"}}