{"2410.10083": {"publish_time": "2024-10-14", "title": "Beyond Graphs: Can Large Language Models Comprehend Hypergraphs?", "paper_summary": "Existing benchmarks like NLGraph and GraphQA evaluate LLMs on graphs by\nfocusing mainly on pairwise relationships, overlooking the high-order\ncorrelations found in real-world data. Hypergraphs, which can model complex\nbeyond-pairwise relationships, offer a more robust framework but are still\nunderexplored in the context of LLMs. To address this gap, we introduce\nLLM4Hypergraph, the first comprehensive benchmark comprising 21,500 problems\nacross eight low-order, five high-order, and two isomorphism tasks, utilizing\nboth synthetic and real-world hypergraphs from citation networks and protein\nstructures. We evaluate six prominent LLMs, including GPT-4o, demonstrating our\nbenchmark's effectiveness in identifying model strengths and weaknesses. Our\nspecialized prompting framework incorporates seven hypergraph languages and\nintroduces two novel techniques, Hyper-BAG and Hyper-COT, which enhance\nhigh-order reasoning and achieve an average 4% (up to 9%) performance\nimprovement on structure classification tasks. This work establishes a\nfoundational testbed for integrating hypergraph computational capabilities into\nLLMs, advancing their comprehension. The source codes are at\nhttps://github.com/iMoonLab/LLM4Hypergraph.", "paper_summary_zh": "現有的 NLGraph 和 GraphQA 等基準主要關注成對關係，而忽略了在現實世界資料中發現的高階相關性，從而對圖形中的 LLM 進行評估。超圖可以建模複雜的超越成對關係，提供更強大的框架，但在 LLM 的背景下仍未得到充分探索。為了解決這個差距，我們引入了 LLM4Hypergraph，這是第一個綜合基準，包含 21,500 個問題，涵蓋八個低階、五個高階和兩個同構任務，利用來自引文網路和蛋白質結構的合成和真實世界超圖。我們評估了六個著名的 LLM，包括 GPT-4o，證明了我們的基準在識別模型優勢和劣勢方面的有效性。我們專業的提示框架包含七種超圖語言，並引入了兩種新技術 Hyper-BAG 和 Hyper-COT，它們增強了高階推理，並在結構分類任務上實現了平均 4%（最高 9%）的性能改進。這項工作為將超圖計算能力整合到 LLM 中建立了一個基礎測試平台，從而提升了它們的理解力。源代碼位於 https://github.com/iMoonLab/LLM4Hypergraph。", "author": "Yifan Feng et.al.", "authors": "Yifan Feng, Chengwu Yang, Xingliang Hou, Shaoyi Du, Shihui Ying, Zongze Wu, Yue Gao", "id": "2410.10083v2", "paper_url": "http://arxiv.org/abs/2410.10083v2", "repo": "null"}}