{"2412.20373": {"publish_time": "2024-12-29", "title": "A Deep Subgrouping Framework for Precision Drug Repurposing via Emulating Clinical Trials on Real-world Patient Data", "paper_summary": "Drug repurposing identifies new therapeutic uses for existing drugs, reducing\nthe time and costs compared to traditional de novo drug discovery. Most\nexisting drug repurposing studies using real-world patient data often treat the\nentire population as homogeneous, ignoring the heterogeneity of treatment\nresponses across patient subgroups. This approach may overlook promising drugs\nthat benefit specific subgroups but lack notable treatment effects across the\nentire population, potentially limiting the number of repurposable candidates\nidentified. To address this, we introduce STEDR, a novel drug repurposing\nframework that integrates subgroup analysis with treatment effect estimation.\nOur approach first identifies repurposing candidates by emulating multiple\nclinical trials on real-world patient data and then characterizes patient\nsubgroups by learning subgroup-specific treatment effects. We deploy \\model to\nAlzheimer's Disease (AD), a condition with few approved drugs and known\nheterogeneity in treatment responses. We emulate trials for over one thousand\nmedications on a large-scale real-world database covering over 8 million\npatients, identifying 14 drug candidates with beneficial effects to AD in\ncharacterized subgroups. Experiments demonstrate STEDR's superior capability in\nidentifying repurposing candidates compared to existing approaches.\nAdditionally, our method can characterize clinically relevant patient subgroups\nassociated with important AD-related risk factors, paving the way for precision\ndrug repurposing.", "paper_summary_zh": "药物再利用为现有药物找出新的治疗用途，与传统的从头药物发现相比，减少了时间和成本。大多数使用真实世界患者数据的现有药物再利用研究通常将整个人群视为同质的，而忽略了不同患者亚组治疗反应的异质性。这种方法可能会忽视对特定亚组有益但整个群体缺乏显着治疗效果的有希望的药物，从而可能限制已识别的可再利用候选药物的数量。为了解决这个问题，我们引入了 STEDR，这是一个新颖的药物再利用框架，它将亚组分析与治疗效果估计相结合。我们的方法首先通过模拟真实世界患者数据的多个临床试验来识别再利用候选药物，然后通过学习亚组特异性治疗效果来表征患者亚组。我们部署\\model到阿尔茨海默病 (AD)，这是一种已获批药物较少且治疗反应已知异质性的疾病。我们在一个覆盖超过 800 万患者的大规模真实世界数据库上模拟了超过一千种药物的试验，确定了 14 种在表征的亚组中对 AD 有益的候选药物。实验表明，与现有方法相比，STEDR 在识别再利用候选药物方面具有更强的能力。此外，我们的方法可以表征与重要的 AD 相关危险因素相关的临床相关患者亚组，为精准药物再利用铺平道路。", "author": "Seungyeon Lee et.al.", "authors": "Seungyeon Lee, Ruoqi Liu, Feixiong Cheng, Ping Zhang", "id": "2412.20373v1", "paper_url": "http://arxiv.org/abs/2412.20373v1", "repo": "null"}}