{"2405.17394": {"publish_time": "2024-05-27", "title": "The Expressive Capacity of State Space Models: A Formal Language Perspective", "paper_summary": "Recently, recurrent models based on linear state space models (SSMs) have\nshown promising performance in language modeling (LM), competititve with\ntransformers. However, there is little understanding of the in-principle\nabilities of such models, which could provide useful guidance to the search for\nbetter LM architectures. We present a comprehensive theoretical study of the\ncapacity of such SSMs as it compares to that of transformers and traditional\nRNNs. We find that SSMs and transformers have overlapping but distinct\nstrengths. In star-free state tracking, SSMs implement straightforward and\nexact solutions to problems that transformers struggle to represent exactly.\nThey can also model bounded hierarchical structure with optimal memory even\nwithout simulating a stack. On the other hand, we identify a design choice in\ncurrent SSMs that limits their expressive power. We discuss implications for\nSSM and LM research, and verify results empirically on a recent SSM, Mamba.", "paper_summary_zh": "近期，基於線性狀態空間模型 (SSM) 的遞迴模型\n在語言模型 (LM) 中展現出可觀的效能，與\nTransformer模型不相上下。然而，對於此類模型的原則性\n能力了解甚少，而這可能會為尋找\n更好的 LM 架構提供有用的指導。我們提出了一項對\n此類 SSM 容量的全面理論研究，並將其與Transformer模型和傳統\nRNN 進行比較。我們發現 SSM 和Transformer模型的優勢重疊但截然不同。在無星狀態追蹤中，SSM 實作了直接且\n精確的解決方案，而Transformer模型難以精確表示這些問題。\n它們甚至可以在不模擬堆疊的情況下，以最佳記憶體建構有界的階層結構。另一方面，我們找出\n目前 SSM 中的設計選擇限制了其表現能力。我們討論了\nSSM 和 LM 研究的含意，並在最近的 SSM，Mamba，上驗證結果。", "author": "Yash Sarrof et.al.", "authors": "Yash Sarrof, Yana Veitsman, Michael Hahn", "id": "2405.17394v1", "paper_url": "http://arxiv.org/abs/2405.17394v1", "repo": "null"}}