{"2406.09977": {"publish_time": "2024-06-14", "title": "Disentangling Dialect from Social Bias via Multitask Learning to Improve Fairness", "paper_summary": "Dialects introduce syntactic and lexical variations in language that occur in\nregional or social groups. Most NLP methods are not sensitive to such\nvariations. This may lead to unfair behavior of the methods, conveying negative\nbias towards dialect speakers. While previous work has studied dialect-related\nfairness for aspects like hate speech, other aspects of biased language, such\nas lewdness, remain fully unexplored. To fill this gap, we investigate\nperformance disparities between dialects in the detection of five aspects of\nbiased language and how to mitigate them. To alleviate bias, we present a\nmultitask learning approach that models dialect language as an auxiliary task\nto incorporate syntactic and lexical variations. In our experiments with\nAfrican-American English dialect, we provide empirical evidence that\ncomplementing common learning approaches with dialect modeling improves their\nfairness. Furthermore, the results suggest that multitask learning achieves\nstate-of-the-art performance and helps to detect properties of biased language\nmore reliably.", "paper_summary_zh": "方言會在語言中引入句法和詞彙變化，這些變化發生在區域或社會群體中。大多數 NLP 方法對此類變化不敏感。這可能會導致這些方法產生不公平的行為，對方言使用者傳達負面偏見。雖然先前的研究已經探討了與方言相關的公平性，例如仇恨言論，但有偏見語言的其他方面，例如淫穢，仍然完全未被探索。為了填補這一空白，我們研究了方言在五個有偏見語言方面的檢測中表現出的差異，以及如何減輕這些差異。為了減輕偏見，我們提出了一種多任務學習方法，將方言語言建模為輔助任務，以納入句法和詞彙變化。在我們對非裔美國英語方言的實驗中，我們提供了經證據證明，用方言建模補充常見的學習方法可以提高它們的公平性。此外，結果表明多任務學習達到了最先進的性能，並有助於更可靠地檢測有偏見語言的屬性。", "author": "Maximilian Spliethöver et.al.", "authors": "Maximilian Spliethöver, Sai Nikhil Menon, Henning Wachsmuth", "id": "2406.09977v1", "paper_url": "http://arxiv.org/abs/2406.09977v1", "repo": "null"}}