{"2411.07075": {"publish_time": "2024-11-11", "title": "Transformer verbatim in-context retrieval across time and scale", "paper_summary": "To predict upcoming text, language models must in some cases retrieve\nin-context information verbatim. In this report, we investigated how the\nability of language models to retrieve arbitrary in-context nouns developed\nduring training (across time) and as language models trained on the same\ndataset increase in size (across scale). We then asked whether learning of\nin-context retrieval correlates with learning of more challenging zero-shot\nbenchmarks. Furthermore, inspired by semantic effects in human short-term\nmemory, we evaluated the retrieval with respect to a major semantic component\nof target nouns, namely whether they denote a concrete or abstract entity, as\nrated by humans. We show that verbatim in-context retrieval developed in a\nsudden transition early in the training process, after about 1% of the training\ntokens. This was observed across model sizes (from 14M and up to 12B\nparameters), and the transition occurred slightly later for the two smallest\nmodels. We further found that the development of verbatim in-context retrieval\nis positively correlated with the learning of zero-shot benchmarks. Around the\ntransition point, all models showed the advantage of retrieving concrete nouns\nas opposed to abstract nouns. In all but two smallest models, the advantage\ndissipated away toward the end of training.", "paper_summary_zh": "語言模型若要預測後續文字，有時必須逐字擷取脈絡中的資訊。在此報告中，我們探討語言模型擷取任意脈絡中名詞的能力在訓練過程中（隨著時間推移）和在針對相同資料集訓練的語言模型大小增加（隨著規模擴大）的演變。接著我們探討脈絡中擷取的學習是否與學習更具挑戰性的零次學習基準相關。此外，受人類短期記憶中語義效應的啟發，我們針對目標名詞的主要語義成分評估擷取，也就是由人類評分的名詞是否表示具體或抽象實體。我們顯示逐字脈絡中擷取在訓練過程的早期突然轉變中發展，大約在訓練符號的 1% 之後。這在各種模型大小（從 14M 到 12B 參數）中觀察到，而且轉變發生在兩個最小模型的稍後時間。我們進一步發現，逐字脈絡中擷取的發展與零次學習基準的學習呈正相關。在轉變點附近，所有模型都顯示出擷取具體名詞而非抽象名詞的優勢。在所有模型中，除了兩個最小模型，優勢在訓練結束時逐漸消失。", "author": "Kristijan Armeni et.al.", "authors": "Kristijan Armeni, Marko Pranjić, Senja Pollak", "id": "2411.07075v1", "paper_url": "http://arxiv.org/abs/2411.07075v1", "repo": "null"}}