{"2412.17333": {"publish_time": "2024-12-23", "title": "Broadband Ground Motion Synthesis by Diffusion Model with Minimal Condition", "paper_summary": "Earthquakes are rare. Hence there is a fundamental call for reliable methods\nto generate realistic ground motion data for data-driven approaches in\nseismology. Recent GAN-based methods fall short of the call, as the methods\neither require special information such as geological traits or generate subpar\nwaveforms that fail to satisfy seismological constraints such as phase arrival\ntimes. We propose a specialized Latent Diffusion Model (LDM) that reliably\ngenerates realistic waveforms after learning from real earthquake data with\nminimal conditions: location and magnitude. We also design a domain-specific\ntraining method that exploits the traits of earthquake dataset: multiple\nobserved waveforms time-aligned and paired to each earthquake source that are\ntagged with seismological metadata comprised of earthquake magnitude, depth of\nfocus, and the locations of epicenter and seismometers. We construct the\ntime-aligned earthquake dataset using Southern California Earthquake Data\nCenter (SCEDC) API, and train our model with the dataset and our proposed\ntraining method for performance evaluation. Our model surpasses all comparable\ndata-driven methods in various test criteria not only from waveform generation\ndomain but also from seismology such as phase arrival time, GMPE analysis, and\nspectrum analysis. Our result opens new future research directions for deep\nlearning applications in seismology.", "paper_summary_zh": "地震罕見。因此，迫切需要可靠的方法來生成逼真的地面運動數據，以用於地震學中的數據驅動方法。基於 GAN 的近期方法未能滿足要求，因為這些方法需要特殊信息（例如地質特徵）或生成無法滿足地震學約束（例如相位到達時間）的次級波形。我們提出了一種專門的潛在擴散模型 (LDM)，該模型在從真實地震數據中學習後，在最少的條件下（位置和震級）可靠地生成逼真的波形。我們還設計了一種特定於領域的訓練方法，該方法利用了地震數據集的特徵：多個觀測波形與每個地震源的時間對齊並配對，這些波形標記有地震學元數據，包括地震震級、震源深度以及震中和地震儀的位置。我們使用南加州地震數據中心 (SCEDC) API 構建了時間對齊的地震數據集，並使用該數據集和我們提出的訓練方法訓練我們的模型以進行性能評估。我們的模型在各種測試標準中超越了所有可比較的數據驅動方法，不僅來自波形生成領域，還來自地震學，例如相位到達時間、GMPE 分析和譜分析。我們的結果為地震學中的深度學習應用開闢了新的未來研究方向。", "author": "Jaeheun Jung et.al.", "authors": "Jaeheun Jung, Jaehyuk Lee, Chang-Hae Jung, Hanyoung Kim, Bosung Jung, Donghun Lee", "id": "2412.17333v1", "paper_url": "http://arxiv.org/abs/2412.17333v1", "repo": "null"}}