{"2412.18148": {"publish_time": "2024-12-24", "title": "Are We in the AI-Generated Text World Already? Quantifying and Monitoring AIGT on Social Media", "paper_summary": "Social media platforms are experiencing a growing presence of AI-Generated\nTexts (AIGTs). However, the misuse of AIGTs could have profound implications\nfor public opinion, such as spreading misinformation and manipulating\nnarratives. Despite its importance, a systematic study to assess the prevalence\nof AIGTs on social media is still lacking. To address this gap, this paper aims\nto quantify, monitor, and analyze the AIGTs on online social media platforms.\nWe first collect a dataset (SM-D) with around 2.4M posts from 3 major social\nmedia platforms: Medium, Quora, and Reddit. Then, we construct a diverse\ndataset (AIGTBench) to train and evaluate AIGT detectors. AIGTBench combines\npopular open-source datasets and our AIGT datasets generated from social media\ntexts by 12 LLMs, serving as a benchmark for evaluating mainstream detectors.\nWith this setup, we identify the best-performing detector (OSM-Det). We then\napply OSM-Det to SM-D to track AIGTs over time and observe different trends of\nAI Attribution Rate (AAR) across social media platforms from January 2022 to\nOctober 2024. Specifically, Medium and Quora exhibit marked increases in AAR,\nrising from 1.77% to 37.03% and 2.06% to 38.95%, respectively. In contrast,\nReddit shows slower growth, with AAR increasing from 1.31% to 2.45% over the\nsame period. Our further analysis indicates that AIGTs differ from\nhuman-written texts across several dimensions, including linguistic patterns,\ntopic distributions, engagement levels, and the follower distribution of\nauthors. We envision our analysis and findings on AIGTs in social media can\nshed light on future research in this domain.", "paper_summary_zh": "<paragraph>社群媒體平台上出現越來越多由 AI 所產生的文字 (AIGT)。然而，AIGT 的誤用可能會對輿論造成深遠影響，例如散布錯誤資訊和操縱敘述。儘管其重要性，但仍缺乏系統性的研究來評估 AIGT 在社群媒體上的盛行程度。為了解決這個差距，本文旨在量化、監控和分析線上社群媒體平台上的 AIGT。我們首先從 3 個主要的社群媒體平台：Medium、Quora 和 Reddit 收集了包含約 240 萬則貼文的資料集 (SM-D)。然後，我們建構了一個多元化的資料集 (AIGTBench) 來訓練和評估 AIGT 偵測器。AIGTBench 結合了熱門的開源資料集和我們從社群媒體文字中生成的 AIGT 資料集，由 12 個 LLM 產生，作為評估主流偵測器的基準。透過此設定，我們找出效能最佳的偵測器 (OSM-Det)。接著，我們將 OSM-Det 套用至 SM-D 以追蹤 AIGT，並觀察從 2022 年 1 月到 2024 年 10 月不同社群媒體平台的 AI 歸因率 (AAR) 趨勢。具體來說，Medium 和 Quora 的 AAR 顯著增加，分別從 1.77% 上升至 37.03% 和 2.06% 上升至 38.95%。相比之下，Reddit 的成長較慢，AAR 在同一時期從 1.31% 上升至 2.45%。我們的進一步分析指出，AIGT 在語言模式、主題分佈、參與度和作者的追蹤者分佈等多個面向與人類撰寫的文字不同。我們預見我們對社群媒體中 AIGT 的分析和發現，可以為此領域的未來研究提供啟發。</paragraph>", "author": "Zhen Sun et.al.", "authors": "Zhen Sun, Zongmin Zhang, Xinyue Shen, Ziyi Zhang, Yule Liu, Michael Backes, Yang Zhang, Xinlei He", "id": "2412.18148v1", "paper_url": "http://arxiv.org/abs/2412.18148v1", "repo": "null"}}