{"2501.08540": {"publish_time": "2025-01-15", "title": "Knowledge prompt chaining for semantic modeling", "paper_summary": "The task of building semantics for structured data such as CSV, JSON, and XML\nfiles is highly relevant in the knowledge representation field. Even though we\nhave a vast of structured data on the internet, mapping them to domain\nontologies to build semantics for them is still very challenging as it requires\nthe construction model to understand and learn graph-structured knowledge.\nOtherwise, the task will require human beings' effort and cost. In this paper,\nwe proposed a novel automatic semantic modeling framework: Knowledge Prompt\nChaining. It can serialize the graph-structured knowledge and inject it into\nthe LLMs properly in a Prompt Chaining architecture. Through this knowledge\ninjection and prompting chaining, the model in our framework can learn the\nstructure information and latent space of the graph and generate the semantic\nlabels and semantic graphs following the chains' insturction naturally. Based\non experimental results, our method achieves better performance than existing\nleading techniques, despite using reduced structured input data.", "paper_summary_zh": "在知識表示領域中，為結構化資料（例如 CSV、JSON 和 XML 檔案）建立語意的任務非常重要。儘管網路上有大量的結構化資料，但將它們對應到領域本体以建立語意仍然非常具有挑戰性，因為這需要建構模型來理解和學習圖形結構的知識。否則，此任務將需要人類的努力和成本。在本文中，我們提出了一個新穎的自動語義建模框架：知識提示鏈接。它可以序列化圖形結構的知識，並適當地將其注入到提示鏈接架構中的 LLM 中。透過這種知識注入和提示鏈接，我們框架中的模型可以學習圖形的結構資訊和潛在空間，並自然地遵循鏈接的指示來產生語義標籤和語義圖。根據實驗結果，儘管使用減少的結構化輸入資料，但我們的方法仍比現有的領先技術獲得更好的效能。", "author": "Ning Pei Ding et.al.", "authors": "Ning Pei Ding, Jingge Du, Zaiwen Feng", "id": "2501.08540v1", "paper_url": "http://arxiv.org/abs/2501.08540v1", "repo": "https://github.com/dingningpei/llm_semantics"}}