{"2405.02559": {"publish_time": "2024-05-04", "title": "A Literature Review and Framework for Human Evaluation of Generative Large Language Models in Healthcare", "paper_summary": "As generative artificial intelligence (AI), particularly Large Language\nModels (LLMs), continues to permeate healthcare, it remains crucial to\nsupplement traditional automated evaluations with human expert evaluation.\nUnderstanding and evaluating the generated texts is vital for ensuring safety,\nreliability, and effectiveness. However, the cumbersome, time-consuming, and\nnon-standardized nature of human evaluation presents significant obstacles to\nthe widespread adoption of LLMs in practice. This study reviews existing\nliterature on human evaluation methodologies for LLMs within healthcare. We\nhighlight a notable need for a standardized and consistent human evaluation\napproach. Our extensive literature search, adhering to the Preferred Reporting\nItems for Systematic Reviews and Meta-Analyses (PRISMA) guidelines, spans\npublications from January 2018 to February 2024. This review provides a\ncomprehensive overview of the human evaluation approaches used in diverse\nhealthcare applications.This analysis examines the human evaluation of LLMs\nacross various medical specialties, addressing factors such as evaluation\ndimensions, sample types, and sizes, the selection and recruitment of\nevaluators, frameworks and metrics, the evaluation process, and statistical\nanalysis of the results. Drawing from diverse evaluation strategies highlighted\nin these studies, we propose a comprehensive and practical framework for human\nevaluation of generative LLMs, named QUEST: Quality of Information,\nUnderstanding and Reasoning, Expression Style and Persona, Safety and Harm, and\nTrust and Confidence. This framework aims to improve the reliability,\ngeneralizability, and applicability of human evaluation of generative LLMs in\ndifferent healthcare applications by defining clear evaluation dimensions and\noffering detailed guidelines.", "paper_summary_zh": "<paragraph>隨著生成式人工智慧 (AI)，特別是大型語言模型 (LLM) 持續滲透醫療保健領域，補充傳統的自動化評估方法，並結合人類專家評估，仍然至關重要。了解和評估產生的文字對於確保安全性、可靠性和有效性至關重要。然而，人類評估的繁瑣、耗時且未標準化的性質，對 LLM 在實務中的廣泛採用構成了重大的障礙。本研究回顧了現有關於醫療保健領域內 LLM 人類評估方法的文獻。我們強調了對標準化且一致的人類評估方法的顯著需求。我們廣泛的文獻搜尋，遵循系統性回顧和元分析的首選報告項目 (PRISMA) 指南，涵蓋了從 2018 年 1 月到 2024 年 2 月的出版物。本回顧提供了在各種醫療保健應用中使用的人類評估方法的全面概述。此分析檢視了 LLM 在各種醫療專科領域的人類評估，探討了評估面向、樣本類型和規模、評估者的選擇和招募、架構和指標、評估流程和結果的統計分析等因素。借鑒這些研究中強調的不同評估策略，我們提出了人類評估生成式 LLM 的全面且實用的架構，稱為 QUEST：資訊品質、理解和推理、表達風格和角色、安全和危害，以及信任和信心。此架構旨在透過定義明確的評估面向，並提供詳細的指南，來改善人類對生成式 LLM 在不同醫療保健應用中的評估的可靠性、概括性和適用性。</paragraph>", "author": "Thomas Yu Chow Tam et.al.", "authors": "Thomas Yu Chow Tam, Sonish Sivarajkumar, Sumit Kapoor, Alisa V Stolyar, Katelyn Polanska, Karleigh R McCarthy, Hunter Osterhoudt, Xizhi Wu, Shyam Visweswaran, Sunyang Fu, Piyush Mathur, Giovanni E. Cacciamani, Cong Sun, Yifan Peng, Yanshan Wang", "id": "2405.02559v1", "paper_url": "http://arxiv.org/abs/2405.02559v1", "repo": "null"}}