{"2405.02559": {"publish_time": "2024-05-04", "title": "A Literature Review and Framework for Human Evaluation of Generative Large Language Models in Healthcare", "paper_summary": "As generative artificial intelligence (AI), particularly Large Language\nModels (LLMs), continues to permeate healthcare, it remains crucial to\nsupplement traditional automated evaluations with human expert evaluation.\nUnderstanding and evaluating the generated texts is vital for ensuring safety,\nreliability, and effectiveness. However, the cumbersome, time-consuming, and\nnon-standardized nature of human evaluation presents significant obstacles to\nthe widespread adoption of LLMs in practice. This study reviews existing\nliterature on human evaluation methodologies for LLMs within healthcare. We\nhighlight a notable need for a standardized and consistent human evaluation\napproach. Our extensive literature search, adhering to the Preferred Reporting\nItems for Systematic Reviews and Meta-Analyses (PRISMA) guidelines, spans\npublications from January 2018 to February 2024. This review provides a\ncomprehensive overview of the human evaluation approaches used in diverse\nhealthcare applications.This analysis examines the human evaluation of LLMs\nacross various medical specialties, addressing factors such as evaluation\ndimensions, sample types, and sizes, the selection and recruitment of\nevaluators, frameworks and metrics, the evaluation process, and statistical\nanalysis of the results. Drawing from diverse evaluation strategies highlighted\nin these studies, we propose a comprehensive and practical framework for human\nevaluation of generative LLMs, named QUEST: Quality of Information,\nUnderstanding and Reasoning, Expression Style and Persona, Safety and Harm, and\nTrust and Confidence. This framework aims to improve the reliability,\ngeneralizability, and applicability of human evaluation of generative LLMs in\ndifferent healthcare applications by defining clear evaluation dimensions and\noffering detailed guidelines.", "paper_summary_zh": "", "author": "Thomas Yu Chow Tam et.al.", "authors": "Thomas Yu Chow Tam,Sonish Sivarajkumar,Sumit Kapoor,Alisa V Stolyar,Katelyn Polanska,Karleigh R McCarthy,Hunter Osterhoudt,Xizhi Wu,Shyam Visweswaran,Sunyang Fu,Piyush Mathur,Giovanni E. Cacciamani,Cong Sun,Yifan Peng,Yanshan Wang", "id": "2405.02559v1", "paper_url": "http://arxiv.org/abs/2405.02559v1", "repo": "null"}}