{"2410.08047": {"publish_time": "2024-10-10", "title": "Divide and Translate: Compositional First-Order Logic Translation and Verification for Complex Logical Reasoning", "paper_summary": "Complex logical reasoning tasks require a long sequence of reasoning, which a\nlarge language model (LLM) with chain-of-thought prompting still falls short.\nTo alleviate this issue, neurosymbolic approaches incorporate a symbolic\nsolver. Specifically, an LLM only translates a natural language problem into a\nsatisfiability (SAT) problem that consists of first-order logic formulas, and a\nsound symbolic solver returns a mathematically correct solution. However, we\ndiscover that LLMs have difficulties to capture complex logical semantics\nhidden in the natural language during translation. To resolve this limitation,\nwe propose a Compositional First-Order Logic Translation. An LLM first parses a\nnatural language sentence into newly defined logical dependency structures that\nconsist of an atomic subsentence and its dependents, then sequentially\ntranslate the parsed subsentences. Since multiple logical dependency structures\nand sequential translations are possible for a single sentence, we also\nintroduce two Verification algorithms to ensure more reliable results. We\nutilize an SAT solver to rigorously compare semantics of generated first-order\nlogic formulas and select the most probable one. We evaluate the proposed\nmethod, dubbed CLOVER, on seven logical reasoning benchmarks and show that it\noutperforms the previous neurosymbolic approaches and achieves new\nstate-of-the-art results.", "paper_summary_zh": "複雜的邏輯推理任務需要一連串的推理，而具有思考鏈提示的大語言模型 (LLM) 仍無法達成。\n為了緩解這個問題，神經符號方法整合了一個符號求解器。具體來說，LLM 只會將自然語言問題轉換為由一階邏輯公式組成的可滿足性 (SAT) 問題，而健全的符號求解器會回傳一個數學上正確的解。然而，我們發現 LLM 難以在轉換過程中擷取隱藏在自然語言中的複雜邏輯語義。為了解決這個限制，我們提出了一個組合一階邏輯轉換。LLM 會先將一個自然語言句子解析成新定義的邏輯依賴結構，其中包含一個原子子句及其依賴項，然後依序轉換解析後的子句。由於單一句子有多個可能的邏輯依賴結構和順序轉換，我們也引入了兩個驗證演算法來確保結果更可靠。我們利用 SAT 求解器嚴格比較產生的邏輯公式的語義，並選出最可能的公式。我們在七個邏輯推理基準上評估所提出的方法，稱為 CLOVER，並顯示它優於先前的神經符號方法，並取得新的最先進結果。", "author": "Hyun Ryu et.al.", "authors": "Hyun Ryu, Gyeongman Kim, Hyemin S. Lee, Eunho Yang", "id": "2410.08047v1", "paper_url": "http://arxiv.org/abs/2410.08047v1", "repo": "null"}}