{"2405.17992": {"publish_time": "2024-05-28", "title": "fMRI predictors based on language models of increasing complexity recover brain left lateralization", "paper_summary": "Over the past decade, studies of naturalistic language processing where\nparticipants are scanned while listening to continuous text have flourished.\nUsing word embeddings at first, then large language models, researchers have\ncreated encoding models to analyze the brain signals. Presenting these models\nwith the same text as the participants allows to identify brain areas where\nthere is a significant correlation between the functional magnetic resonance\nimaging (fMRI) time series and the ones predicted by the models' artificial\nneurons. One intriguing finding from these studies is that they have revealed\nhighly symmetric bilateral activation patterns, somewhat at odds with the\nwell-known left lateralization of language processing. Here, we report analyses\nof an fMRI dataset where we manipulate the complexity of large language models,\ntesting 28 pretrained models from 8 different families, ranging from 124M to\n14.2B parameters. First, we observe that the performance of models in\npredicting brain responses follows a scaling law, where the fit with brain\nactivity increases linearly with the logarithm of the number of parameters of\nthe model (and its performance on natural language processing tasks). Second,\nwe show that a left-right asymmetry gradually appears as model size increases,\nand that the difference in left-right brain correlations also follows a scaling\nlaw. Whereas the smallest models show no asymmetry, larger models fit better\nand better left hemispheric activations than right hemispheric ones. This\nfinding reconciles computational analyses of brain activity using large\nlanguage models with the classic observation from aphasic patients showing left\nhemisphere dominance for language.", "paper_summary_zh": "<paragraph>在過去十年中，研究人員在參與者聆聽連續文本時進行掃描的自然語言處理研究蓬勃發展。\n研究人員首先使用詞嵌入，然後使用大型語言模型，創建編碼模型來分析腦部訊號。向這些模型呈現與參與者相同的文本，可以識別腦部區域，在該區域中，功能性磁共振造影 (fMRI) 時間序列與模型的人工神經元所預測的序列之間存在顯著相關性。這些研究中一個有趣的發現是，它們揭示了高度對稱的雙邊激活模式，這與語言處理中眾所周知的左半球側化現象有些矛盾。在這裡，我們報告了 fMRI 資料集的分析，其中我們操縱大型語言模型的複雜性，測試了來自 8 個不同家族的 28 個預訓練模型，範圍從 124M 到 14.2B 個參數。首先，我們觀察到模型在預測腦部反應方面的表現遵循一個比例定律，其中與腦部活動的吻合度隨著模型參數數量的對數線性增加（以及它在自然語言處理任務中的表現）。其次，我們表明，隨著模型大小的增加，左右不對稱性逐漸出現，並且左右腦相關性的差異也遵循一個比例定律。儘管最小的模型沒有顯示出不對稱性，但較大的模型比右半球激活更適合和更好的左半球激活。這一發現調和了使用大型語言模型對腦部活動的計算分析與失語症患者的經典觀察，後者顯示左半球在語言方面佔優勢。</paragraph>", "author": "Laurent Bonnasse-Gahot et.al.", "authors": "Laurent Bonnasse-Gahot, Christophe Pallier", "id": "2405.17992v1", "paper_url": "http://arxiv.org/abs/2405.17992v1", "repo": "null"}}