{"2407.06682": {"publish_time": "2024-07-09", "title": "A Predictive Model Based on Transformer with Statistical Feature Embedding in Manufacturing Sensor Dataset", "paper_summary": "In the manufacturing process, sensor data collected from equipment is crucial\nfor building predictive models to manage processes and improve productivity.\nHowever, in the field, it is challenging to gather sufficient data to build\nrobust models. This study proposes a novel predictive model based on the\nTransformer, utilizing statistical feature embedding and window positional\nencoding. Statistical features provide an effective representation of sensor\ndata, and the embedding enables the Transformer to learn both time- and\nsensor-related information. Window positional encoding captures precise time\ndetails from the feature embedding. The model's performance is evaluated in two\nproblems: fault detection and virtual metrology, showing superior results\ncompared to baseline models. This improvement is attributed to the efficient\nuse of parameters, which is particularly beneficial for sensor data that often\nhas limited sample sizes. The results support the model's applicability across\nvarious manufacturing industries, demonstrating its potential for enhancing\nprocess management and yield.", "paper_summary_zh": "在製造過程中，從設備收集的感測器資料對於建立預測模型以管理流程和提升生產力至關重要。\n然而，在實際應用中，要收集足夠的資料來建立穩健的模型是一項挑戰。本研究提出了一個基於 Transformer 的創新預測模型，利用統計特徵嵌入和視窗位置編碼。統計特徵提供了感測器資料的有效表示，而嵌入使 Transformer 能同時學習時間和感測器相關的資訊。視窗位置編碼從特徵嵌入中擷取精確的時間資訊。該模型的效能已在兩個問題中得到評估：故障偵測和虛擬量測，與基準模型相比，顯示出優異的結果。這種改進歸功於參數的有效使用，這對於經常有樣本數限制的感測器資料特別有益。結果支持了該模型在各種製造產業中的適用性，證明了它在增強流程管理和良率方面的潛力。", "author": "Gyeong Taek Lee et.al.", "authors": "Gyeong Taek Lee, Oh-Ran Kwon", "id": "2407.06682v1", "paper_url": "http://arxiv.org/abs/2407.06682v1", "repo": "null"}}