{"2501.05366": {"publish_time": "2025-01-09", "title": "Search-o1: Agentic Search-Enhanced Large Reasoning Models", "paper_summary": "Large reasoning models (LRMs) like OpenAI-o1 have demonstrated impressive\nlong stepwise reasoning capabilities through large-scale reinforcement\nlearning. However, their extended reasoning processes often suffer from\nknowledge insufficiency, leading to frequent uncertainties and potential\nerrors. To address this limitation, we introduce \\textbf{Search-o1}, a\nframework that enhances LRMs with an agentic retrieval-augmented generation\n(RAG) mechanism and a Reason-in-Documents module for refining retrieved\ndocuments. Search-o1 integrates an agentic search workflow into the reasoning\nprocess, enabling dynamic retrieval of external knowledge when LRMs encounter\nuncertain knowledge points. Additionally, due to the verbose nature of\nretrieved documents, we design a separate Reason-in-Documents module to deeply\nanalyze the retrieved information before injecting it into the reasoning chain,\nminimizing noise and preserving coherent reasoning flow. Extensive experiments\non complex reasoning tasks in science, mathematics, and coding, as well as six\nopen-domain QA benchmarks, demonstrate the strong performance of Search-o1.\nThis approach enhances the trustworthiness and applicability of LRMs in complex\nreasoning tasks, paving the way for more reliable and versatile intelligent\nsystems. The code is available at\n\\url{https://github.com/sunnynexus/Search-o1}.", "paper_summary_zh": "大型推理模型（LRM），例如 OpenAI-o1，已通过大规模强化学习展示了令人印象深刻的长步推理能力。然而，它们扩展的推理过程通常会受到知识不足的影响，从而导致频繁的不确定性和潜在的错误。为了解决这个限制，我们引入了 \\textbf{Search-o1}，这是一个框架，它通过代理检索增强生成（RAG）机制和用于精炼检索到的文档的文档中推理模块来增强 LRM。Search-o1 将代理搜索工作流集成到推理过程中，使 LRM 在遇到不确定的知识点时能够动态检索外部知识。此外，由于检索到的文档冗长，我们设计了一个单独的文档中推理模块，以便在将检索到的信息注入推理链之前对其进行深入分析，最大程度地减少噪音并保持连贯的推理流程。在科学、数学和编码中的复杂推理任务以及六个开放域 QA 基准上的大量实验表明了 Search-o1 的强大性能。这种方法增强了 LRM 在复杂推理任务中的可信度和适用性，为更可靠和通用的智能系统铺平了道路。代码可在 \\url{https://github.com/sunnynexus/Search-o1} 获得。", "author": "Xiaoxi Li et.al.", "authors": "Xiaoxi Li, Guanting Dong, Jiajie Jin, Yuyao Zhang, Yujia Zhou, Yutao Zhu, Peitian Zhang, Zhicheng Dou", "id": "2501.05366v1", "paper_url": "http://arxiv.org/abs/2501.05366v1", "repo": "null"}}