{"2412.13623": {"publish_time": "2024-12-18", "title": "Unifying Attribution-Based Explanations Using Functional Decomposition", "paper_summary": "The black box problem in machine learning has led to the introduction of an\never-increasing set of explanation methods for complex models. These\nexplanations have different properties, which in turn has led to the problem of\nmethod selection: which explanation method is most suitable for a given use\ncase? In this work, we propose a unifying framework of attribution-based\nexplanation methods, which provides a step towards a rigorous study of the\nsimilarities and differences of explanations. We first introduce removal-based\nattribution methods (RBAMs), and show that an extensively broad selection of\nexisting methods can be viewed as such RBAMs. We then introduce the canonical\nadditive decomposition (CAD). This is a general construction for additively\ndecomposing any function based on the central idea of removing (groups of)\nfeatures. We proceed to show that indeed every valid additive decomposition is\nan instance of the CAD, and that any removal-based attribution method is\nassociated with a specific CAD. Next, we show that any removal-based\nattribution method can be completely defined as a game-theoretic value or\ninteraction index for a specific (possibly constant-shifted) cooperative game,\nwhich is defined using the corresponding CAD of the method. We then use this\nintrinsic connection to define formal descriptions of specific behaviours of\nexplanation methods, which we also call functional axioms, and identify\nsufficient conditions on the corresponding CAD and game-theoretic value or\ninteraction index of an attribution method under which the attribution method\nis guaranteed to adhere to these functional axioms. Finally, we show how this\nunifying framework can be used to develop new, efficient approximations for\nexisting explanation methods.", "paper_summary_zh": "機器學習中的黑盒問題導致了一組不斷增加的複雜模型解釋方法的引入。這些解釋具有不同的屬性，這反過來導致了方法選擇的問題：哪種解釋方法最適合給定的使用案例？在這項工作中，我們提出了一個基於歸因的解釋方法的統一框架，這為嚴謹研究解釋的相似性和差異邁出了一步。我們首先介紹了基於移除的歸因方法 (RBAM)，並表明現有方法的廣泛選擇可以視為這樣的 RBAM。然後我們介紹了規範加性分解 (CAD)。這是一個通用結構，用於根據移除（特徵組）的中心思想對任何函數進行加性分解。我們繼續證明，每個有效的加性分解實際上都是 CAD 的一個實例，並且任何基於移除的歸因方法都與特定的 CAD 相關。接下來，我們表明任何基於移除的歸因方法都可以完全定義為一個博弈論價值或一個特定（可能為常數偏移）合作博弈的交互指數，該博弈是使用該方法的對應 CAD 定義的。然後，我們使用這種內在聯繫來定義解釋方法的特定行為的正式描述，我們也稱之為函數公理，並識別歸因方法對應的 CAD 和博弈論價值或交互指數的充分條件，在這些條件下，歸因方法保證遵守這些函數公理。最後，我們展示了如何使用這個統一框架來為現有的解釋方法開發新的、高效的近似值。", "author": "Arne Gevaert et.al.", "authors": "Arne Gevaert, Yvan Saeys", "id": "2412.13623v1", "paper_url": "http://arxiv.org/abs/2412.13623v1", "repo": "null"}}