{"2412.04935": {"publish_time": "2024-12-06", "title": "Uncertainty-aware retinal layer segmentation in OCT through probabilistic signed distance functions", "paper_summary": "In this paper, we present a new approach for uncertainty-aware retinal layer\nsegmentation in Optical Coherence Tomography (OCT) scans using probabilistic\nsigned distance functions (SDF). Traditional pixel-wise and regression-based\nmethods primarily encounter difficulties in precise segmentation and lack of\ngeometrical grounding respectively. To address these shortcomings, our\nmethodology refines the segmentation by predicting a signed distance function\n(SDF) that effectively parameterizes the retinal layer shape via level set. We\nfurther enhance the framework by integrating probabilistic modeling, applying\nGaussian distributions to encapsulate the uncertainty in the shape\nparameterization. This ensures a robust representation of the retinal layer\nmorphology even in the presence of ambiguous input, imaging noise, and\nunreliable segmentations. Both quantitative and qualitative evaluations\ndemonstrate superior performance when compared to other methods. Additionally,\nwe conducted experiments on artificially distorted datasets with various noise\ntypes-shadowing, blinking, speckle, and motion-common in OCT scans to showcase\nthe effectiveness of our uncertainty estimation. Our findings demonstrate the\npossibility to obtain reliable segmentation of retinal layers, as well as an\ninitial step towards the characterization of layer integrity, a key biomarker\nfor disease progression. Our code is available at\n\\url{https://github.com/niazoys/RLS_PSDF}.", "paper_summary_zh": "<paragraph>在本文中，我們提出了一種新的方法，用於光學相干斷層掃描 (OCT) 中的不確定性視網膜層分割，使用機率簽署距離函數 (SDF)。傳統的逐像素和基於回歸的方法主要在精確分割和缺乏幾何基礎方面遇到困難。為了解決這些缺點，我們的算法通過預測一個簽署距離函數 (SDF) 來改善分割，該函數通過水平集有效地參數化視網膜層形狀。我們進一步通過整合機率建模來增強框架，應用高斯分布來封裝形狀參數化的不確定性。這確保了視網膜層形態的穩健表示，即使在存在模糊輸入、成像雜訊和不可靠分割的情況下也是如此。與其他方法相比，定量和定性評估都證明了優越的性能。此外，我們在具有各種雜訊類型（陰影、眨眼、斑點和運動）的人工扭曲數據集上進行了實驗，這些雜訊類型在 OCT 掃描中很常見，以展示我們的不確定性估計的有效性。我們的研究結果證明了獲得視網膜層可靠分割的可能性，以及朝著表徵層完整性（疾病進展的一個關鍵生物標誌）邁出的第一步。我們的代碼可以在 \\url{https://github.com/niazoys/RLS_PSDF} 獲得。</paragraph>", "author": "Mohammad Mohaiminul Islam et.al.", "authors": "Mohammad Mohaiminul Islam, Coen de Vente, Bart Liefers, Caroline Klaver, Erik J Bekkers, Clara I. Sánchez", "id": "2412.04935v1", "paper_url": "http://arxiv.org/abs/2412.04935v1", "repo": "https://github.com/niazoys/rls_psdf"}}