{"2412.11543": {"publish_time": "2024-12-16", "title": "Error Diversity Matters: An Error-Resistant Ensemble Method for Unsupervised Dependency Parsing", "paper_summary": "We address unsupervised dependency parsing by building an ensemble of diverse\nexisting models through post hoc aggregation of their output dependency parse\nstructures. We observe that these ensembles often suffer from low robustness\nagainst weak ensemble components due to error accumulation. To tackle this\nproblem, we propose an efficient ensemble-selection approach that avoids error\naccumulation. Results demonstrate that our approach outperforms each individual\nmodel as well as previous ensemble techniques. Additionally, our experiments\nshow that the proposed ensemble-selection method significantly enhances the\nperformance and robustness of our ensemble, surpassing previously proposed\nstrategies, which have not accounted for error diversity.", "paper_summary_zh": "我們透過建立一個由多樣化現有模型組成的集合，透過事後彙總其輸出依賴項解析結構，來處理非監督依賴項解析。我們觀察到這些集合通常會因錯誤累積而對弱集合組成部分的低健壯性而受苦。為了解決這個問題，我們提出一個有效的集合選擇方法，以避免錯誤累積。結果證明我們的方法優於每個單獨的模型以及先前的集合技術。此外，我們的實驗表明，所提出的集合選擇方法顯著地增強了我們集合的效能和健壯性，超越了先前提出的策略，而這些策略並未考慮錯誤多樣性。", "author": "Behzad Shayegh et.al.", "authors": "Behzad Shayegh, Hobie H. -B. Lee, Xiaodan Zhu, Jackie Chi Kit Cheung, Lili Mou", "id": "2412.11543v1", "paper_url": "http://arxiv.org/abs/2412.11543v1", "repo": "null"}}