{"2408.13860": {"publish_time": "2024-08-25", "title": "Knowledge-Aware Reasoning over Multimodal Semi-structured Tables", "paper_summary": "Existing datasets for tabular question answering typically focus exclusively\non text within cells. However, real-world data is inherently multimodal, often\nblending images such as symbols, faces, icons, patterns, and charts with\ntextual content in tables. With the evolution of AI models capable of\nmultimodal reasoning, it is pertinent to assess their efficacy in handling such\nstructured data. This study investigates whether current AI models can perform\nknowledge-aware reasoning on multimodal structured data. We explore their\nability to reason on tables that integrate both images and text, introducing\nMMTabQA, a new dataset designed for this purpose. Our experiments highlight\nsubstantial challenges for current AI models in effectively integrating and\ninterpreting multiple text and image inputs, understanding visual context, and\ncomparing visual content across images. These findings establish our dataset as\na robust benchmark for advancing AI's comprehension and capabilities in\nanalyzing multimodal structured data.", "paper_summary_zh": "現有的表格問答資料集通常只專注於儲存格內的文字。然而，真實世界的資料本質上是多模態的，通常會將符號、人臉、圖示、圖案和圖表等影像與表格中的文字內容混合在一起。隨著具備多模態推理能力的人工智慧模型的發展，評估它們在處理此類結構化資料時的效能至關重要。本研究探討了當前的人工智慧模型是否能夠對多模態結構化資料執行知識感知推理。我們探討了它們對整合影像和文字的表格進行推理的能力，並介紹了為此目的設計的新資料集 MMTabQA。我們的實驗突顯了當前的人工智慧模型在有效整合和詮釋多個文字和影像輸入、理解視覺脈絡以及比較影像中的視覺內容方面面臨的重大挑戰。這些發現確立了我們的資料集作為促進人工智慧理解和分析多模態結構化資料的能力的強大基準。", "author": "Suyash Vardhan Mathur et.al.", "authors": "Suyash Vardhan Mathur, Jainit Sushil Bafna, Kunal Kartik, Harshita Khandelwal, Manish Shrivastava, Vivek Gupta, Mohit Bansal, Dan Roth", "id": "2408.13860v1", "paper_url": "http://arxiv.org/abs/2408.13860v1", "repo": "null"}}