{"2410.15528": {"publish_time": "2024-10-20", "title": "Improving Clinical Documentation with AI: A Comparative Study of Sporo AI Scribe and GPT-4o mini", "paper_summary": "AI-powered medical scribes have emerged as a promising solution to alleviate\nthe documentation burden in healthcare. Ambient AI scribes provide real-time\ntranscription and automated data entry into Electronic Health Records (EHRs),\nwith the potential to improve efficiency, reduce costs, and enhance\nscalability. Despite early success, the accuracy of AI scribes remains\ncritical, as errors can lead to significant clinical consequences.\nAdditionally, AI scribes face challenges in handling the complexity and\nvariability of medical language and ensuring the privacy of sensitive patient\ndata. This case study aims to evaluate Sporo Health's AI scribe, a multi-agent\nsystem leveraging fine-tuned medical LLMs, by comparing its performance with\nOpenAI's GPT-4o Mini on multiple performance metrics. Using a dataset of\nde-identified patient conversation transcripts, AI-generated summaries were\ncompared to clinician-generated notes (the ground truth) based on clinical\ncontent recall, precision, and F1 scores. Evaluations were further supplemented\nby clinician satisfaction assessments using a modified Physician Documentation\nQuality Instrument revision 9 (PDQI-9), rated by both a medical student and a\nphysician. The results show that Sporo AI consistently outperformed GPT-4o\nMini, achieving higher recall, precision, and overall F1 scores. Moreover, the\nAI generated summaries provided by Sporo were rated more favorably in terms of\naccuracy, comprehensiveness, and relevance, with fewer hallucinations. These\nfindings demonstrate that Sporo AI Scribe is an effective and reliable tool for\nclinical documentation, enhancing clinician workflows while maintaining high\nstandards of privacy and security.", "paper_summary_zh": "<paragraph>由 AI 驅動的醫療抄寫員已成為減輕醫療保健中文件負擔的有前景的解決方案。Ambient AI 抄寫員提供實時的轉錄和自動化資料輸入電子健康記錄 (EHR)，具有提高效率、降低成本和增強可擴充性的潛力。儘管早期成功，AI 抄寫員的準確性仍然至關重要，因為錯誤可能導致嚴重的臨床後果。此外，AI 抄寫員在處理醫療語言的複雜性和可變性以及確保敏感患者資料的隱私方面面臨挑戰。本案例研究旨在評估 Sporo Health 的 AI 抄寫員，一個利用微調醫療 LLM 的多代理系統，通過比較其在多個性能指標上的表現與 OpenAI 的 GPT-4o Mini。使用去識別的患者對話記錄的資料集，將 AI 生成的摘要與臨床醫生生成的筆記（基本事實）進行比較，基於臨床內容召回、精確度和 F1 分數。評估進一步補充了臨床醫生滿意度評估，使用修改後的醫生文件質量工具修訂版 9 (PDQI-9)，由醫學生和醫生評分。結果表明，Sporo AI 持續優於 GPT-4o Mini，獲得更高的召回率、精確度和整體 F1 分數。此外，Sporo 提供的 AI 生成的摘要在準確性、全面性和相關性方面獲得了更正面的評價，而且幻覺更少。這些發現表明，Sporo AI Scribe 是一種用於臨床文件編寫的有效且可靠的工具，可在保持高標準的隱私和安全性的同時，增強臨床醫生的工作流程。</paragraph>", "author": "Chanseo Lee et.al.", "authors": "Chanseo Lee, Sonu Kumar, Kimon A. Vogt, Sam Meraj", "id": "2410.15528v1", "paper_url": "http://arxiv.org/abs/2410.15528v1", "repo": "null"}}