{"2409.10173": {"publish_time": "2024-09-16", "title": "jina-embeddings-v3: Multilingual Embeddings With Task LoRA", "paper_summary": "We introduce jina-embeddings-v3, a novel text embedding model with 570\nmillion parameters, achieves state-of-the-art performance on multilingual data\nand long-context retrieval tasks, supporting context lengths of up to 8192\ntokens. The model includes a set of task-specific Low-Rank Adaptation (LoRA)\nadapters to generate high-quality embeddings for query-document retrieval,\nclustering, classification, and text matching. Additionally, Matryoshka\nRepresentation Learning is integrated into the training process, allowing\nflexible truncation of embedding dimensions without compromising performance.\nEvaluation on the MTEB benchmark shows that jina-embeddings-v3 outperforms the\nlatest proprietary embeddings from OpenAI and Cohere on English tasks, while\nachieving superior performance compared to multilingual-e5-large-instruct\nacross all multilingual tasks.", "paper_summary_zh": "我們推出 jina-embeddings-v3，一種具有 5.7 億個參數的新型文字嵌入模型，在多語言數據和長內容擷取任務上獲得了最先進的效能，支援長達 8192 個 token 的內容長度。此模型包含一組特定於任務的低秩適應 (LoRA) 適配器，以產生用於查詢文件擷取、分群、分類和文字比對的高品質嵌入。此外，Matryoshka 表徵學習已整合到訓練過程中，允許靈活地截斷嵌入維度，而不會影響效能。在 MTEB 基準上的評估顯示，jina-embeddings-v3 在英文任務上優於 OpenAI 和 Cohere 的最新專有嵌入，同時在所有多語言任務上都優於 multilingual-e5-large-instruct。", "author": "Saba Sturua et.al.", "authors": "Saba Sturua, Isabelle Mohr, Mohammad Kalim Akram, Michael Günther, Bo Wang, Markus Krimmel, Feng Wang, Georgios Mastrapas, Andreas Koukounas, Andreas Koukounas, Nan Wang, Han Xiao", "id": "2409.10173v2", "paper_url": "http://arxiv.org/abs/2409.10173v2", "repo": "null"}}