{"2409.16630": {"publish_time": "2024-09-25", "title": "Stochastic Subsampling With Average Pooling", "paper_summary": "Regularization of deep neural networks has been an important issue to achieve\nhigher generalization performance without overfitting problems. Although the\npopular method of Dropout provides a regularization effect, it causes\ninconsistent properties in the output, which may degrade the performance of\ndeep neural networks. In this study, we propose a new module called stochastic\naverage pooling, which incorporates Dropout-like stochasticity in pooling. We\ndescribe the properties of stochastic subsampling and average pooling and\nleverage them to design a module without any inconsistency problem. The\nstochastic average pooling achieves a regularization effect without any\npotential performance degradation due to the inconsistency issue and can easily\nbe plugged into existing architectures of deep neural networks. Experiments\ndemonstrate that replacing existing average pooling with stochastic average\npooling yields consistent improvements across a variety of tasks, datasets, and\nmodels.", "paper_summary_zh": "深度神经网络的正则化一直是实现更高泛化性能而不出现过拟合问题的一个重要课题。尽管流行的 Dropout 方法提供了一种正则化效果，但它会导致输出中的属性不一致，这可能会降低深度神经网络的性能。在本研究中，我们提出了一种称为随机平均池化的全新模块，它在池化中纳入了类似 Dropout 的随机性。我们描述了随机子采样和平均池化的属性，并利用它们设计了一个不存在任何不一致问题的模块。随机平均池化实现了一种正则化效果，不会因不一致问题而导致任何潜在的性能下降，并且可以轻松插入现有深度神经网络架构中。实验表明，用随机平均池化替换现有的平均池化，可以在各种任务、数据集和模型中产生一致的改进。", "author": "Bum Jun Kim et.al.", "authors": "Bum Jun Kim, Sang Woo Kim", "id": "2409.16630v1", "paper_url": "http://arxiv.org/abs/2409.16630v1", "repo": "null"}}