{"2501.09045": {"publish_time": "2025-01-15", "title": "Spatio-Temporal Foundation Models: Vision, Challenges, and Opportunities", "paper_summary": "Foundation models have revolutionized artificial intelligence, setting new\nbenchmarks in performance and enabling transformative capabilities across a\nwide range of vision and language tasks. However, despite the prevalence of\nspatio-temporal data in critical domains such as transportation, public health,\nand environmental monitoring, spatio-temporal foundation models (STFMs) have\nnot yet achieved comparable success. In this paper, we articulate a vision for\nthe future of STFMs, outlining their essential characteristics and the\ngeneralization capabilities necessary for broad applicability. We critically\nassess the current state of research, identifying gaps relative to these ideal\ntraits, and highlight key challenges that impede their progress. Finally, we\nexplore potential opportunities and directions to advance research towards the\naim of effective and broadly applicable STFMs.", "paper_summary_zh": "基礎模型徹底改變了人工智慧，在效能上樹立新的基準，並在廣泛的視覺和語言任務中實現轉型能力。然而，儘管時空資料普遍存在於運輸、公共衛生和環境監控等關鍵領域，但時空基礎模型 (STFM) 尚未取得同等成就。在本文中，我們闡述了對 STFM 未來的願景，概述了其基本特徵和廣泛適用的必要概括能力。我們批判性地評估了當前研究的狀態，找出相對於這些理想特質的差距，並強調阻礙其進展的關鍵挑戰。最後，我們探討了推進研究的潛在機會和方向，以實現有效且廣泛適用的 STFM。", "author": "Adam Goodge et.al.", "authors": "Adam Goodge, Wee Siong Ng, Bryan Hooi, See Kiong Ng", "id": "2501.09045v1", "paper_url": "http://arxiv.org/abs/2501.09045v1", "repo": "null"}}