{"2411.04383": {"publish_time": "2024-11-07", "title": "Neuro-Symbolic AI: Explainability, Challenges, and Future Trends", "paper_summary": "Explainability is an essential reason limiting the application of neural\nnetworks in many vital fields. Although neuro-symbolic AI hopes to enhance the\noverall explainability by leveraging the transparency of symbolic learning, the\nresults are less evident than imagined. This article proposes a classification\nfor explainability by considering both model design and behavior of 191 studies\nfrom 2013, focusing on neuro-symbolic AI, hoping to inspire scholars who want\nto understand the explainability of neuro-symbolic AI. Precisely, we classify\nthem into five categories by considering whether the form of bridging the\nrepresentation differences is readable as their design factor, if there are\nrepresentation differences between neural networks and symbolic logic learning,\nand whether a model decision or prediction process is understandable as their\nbehavior factor: implicit intermediate representations and implicit prediction,\npartially explicit intermediate representations and partially explicit\nprediction, explicit intermediate representations or explicit prediction,\nexplicit intermediate representation and explicit prediction, unified\nrepresentation and explicit prediction. We also analyzed the research trends\nand three significant challenges: unified representations, explainability and\ntransparency, and sufficient cooperation from neural networks and symbolic\nlearning. Finally, we put forward suggestions for future research in three\naspects: unified representations, enhancing model explainability, ethical\nconsiderations, and social impact.", "paper_summary_zh": "可解釋性是限制神經網路在許多重要領域應用的基本原因。儘管神經符號 AI 希望透過利用符號學習的透明性來增強整體可解釋性，但結果不如想像中明顯。本文提出了一個可解釋性的分類，透過考量 191 篇研究（自 2013 年）的模型設計和行為，專注於神經符號 AI，希望能啟發想要了解神經符號 AI 可解釋性的學者。具體來說，我們將它們分為五類，考量連結表示差異的形式是否可作為設計因素來閱讀，神經網路和符號邏輯學習之間是否存在表示差異，以及模型決策或預測過程是否可作為行為因素來理解：隱含中間表示和隱含預測、部分明確中間表示和部分明確預測、明確中間表示或明確預測、明確中間表示和明確預測、統一表示和明確預測。我們還分析了研究趨勢和三個重大挑戰：統一表示、可解釋性和透明性，以及來自神經網路和符號學習的充分合作。最後，我們在統一表示、增強模型可解釋性、倫理考量和社會影響三個方面提出了未來研究建議。", "author": "Xin Zhang et.al.", "authors": "Xin Zhang, Victor S. Sheng", "id": "2411.04383v1", "paper_url": "http://arxiv.org/abs/2411.04383v1", "repo": "null"}}