{"2502.06659": {"publish_time": "2025-02-10", "title": "Who Taught You That? Tracing Teachers in Model Distillation", "paper_summary": "Model distillation -- using outputs from a large teacher model to teach a\nsmall student model -- is a practical means of creating efficient models for a\nparticular task. We ask: Can we identify a students' teacher based on its\noutputs? Such \"footprints\" left by teacher LLMs would be interesting artifacts.\nBeyond this, reliable teacher inference may have practical implications as\nactors seek to distill specific capabilities of massive proprietary LLMs into\ndeployed smaller LMs, potentially violating terms of service. We consider\npractical task distillation targets including summarization, question\nanswering, and instruction-following. We assume a finite set of candidate\nteacher models, which we treat as blackboxes. We design discriminative models\nthat operate over lexical features. We find that $n$-gram similarity alone is\nunreliable for identifying teachers, but part-of-speech (PoS) templates\npreferred by student models mimic those of their teachers.", "paper_summary_zh": "模型蒸馏，即使用大型教师模型的输出来训练小型学生模型，是一种为特定任务创建高效模型的实用方法。我们问：我们可以根据学生的输出识别出学生的老师吗？教师 LLM 留下的这种“足迹”将成为有趣的工件。除此之外，可靠的教师推理可能具有实际意义，因为参与者寻求将大型专有 LLM 的特定功能提炼到已部署的小型 LLM 中，从而可能违反服务条款。我们考虑了包括摘要、问答和指令遵循在内的实际任务蒸馏目标。我们假设有一组有限的候选教师模型，我们将它们视为黑匣子。我们设计了在词法特征上运行的判别模型。我们发现，仅 $n$-gram 相似性不足以识别教师，但学生模型偏好的词性 (PoS) 模板模仿了其教师的模板。", "author": "Somin Wadhwa et.al.", "authors": "Somin Wadhwa, Chantal Shaib, Silvio Amir, Byron C. Wallace", "id": "2502.06659v1", "paper_url": "http://arxiv.org/abs/2502.06659v1", "repo": "null"}}