{"2409.02228": {"publish_time": "2024-09-03", "title": "Unforgettable Generalization in Language Models", "paper_summary": "When language models (LMs) are trained to forget (or \"unlearn'') a skill, how\nprecisely does their behavior change? We study the behavior of transformer LMs\nin which tasks have been forgotten via fine-tuning on randomized labels. Such\nLMs learn to generate near-random predictions for individual examples in the\n\"training'' set used for forgetting. Across tasks, however, LMs exhibit extreme\nvariability in whether LM predictions change on examples outside the training\nset. In some tasks (like entailment classification), forgetting generalizes\nrobustly, and causes models to produce uninformative predictions on new task\ninstances; in other tasks (like physical commonsense reasoning and scientific\nquestion answering) forgetting affects only the training examples, and models\ncontinue to perform the \"forgotten'' task accurately even for examples very\nsimilar to those that appeared in the training set. Dataset difficulty is not\npredictive of whether a behavior can be forgotten; instead, generalization in\nforgetting is (weakly) predicted by the confidence of LMs' initial task\npredictions and the variability of LM representations of training data, with\nlow confidence and low variability both associated with greater generalization.\nPerhaps most surprisingly, random-label forgetting appears to be somewhat\ninsensitive to the contents of the training set: for example, models trained on\nscience questions with random labels continue to answer other science questions\naccurately, but begin to produce random labels on entailment classification\ntasks. Finally, we show that even generalizable forgetting is shallow: linear\nprobes trained on LMs' representations can still perform tasks reliably after\nforgetting. Our results highlight the difficulty and unpredictability of\nperforming targeted skill removal from models via fine-tuning.", "paper_summary_zh": "當語言模型 (LM) 被訓練去遺忘 (或「遺失」) 一項技能時，它們的行為會如何精準地改變？我們研究了Transformer LM 的行為，在這些行為中，任務已被遺忘，並透過在隨機標籤上進行微調。此類 LM 學會為「訓練」集中用於遺忘的個別範例產生近乎隨機的預測。然而，在各項任務中，LM 在 LM 預測是否會改變訓練集外的範例方面表現出極大的變異性。在某些任務中（例如蘊涵分類），遺忘會強健地概化，並導致模型對新的任務實例產生無意義的預測；在其他任務中（例如物理常識推理和科學問題解答），遺忘只會影響訓練範例，而模型仍能準確執行「被遺忘」的任務，即使對於那些出現在訓練集中與之非常類似的範例也是如此。資料集的難度無法預測某種行為是否能被遺忘；相反地，遺忘中的概化是由 LM 初始任務預測的信心和 LM 訓練資料表徵的變異性（弱地）預測的，而低信心和低變異性都與更大的概化相關。也許最令人驚訝的是，隨機標籤遺忘似乎對訓練集的內容有些遲鈍：例如，在使用隨機標籤訓練科學問題的模型會繼續準確回答其他科學問題，但會開始在蘊涵分類任務中產生隨機標籤。最後，我們展示了即使是可概化的遺忘也是膚淺的：在 LM 表徵上訓練的線性探測仍可以在遺忘後可靠地執行任務。我們的結果突出了透過微調從模型中執行目標技能移除的困難性和不可預測性。", "author": "Eric Zhang et.al.", "authors": "Eric Zhang, Leshem Chosen, Jacob Andreas", "id": "2409.02228v1", "paper_url": "http://arxiv.org/abs/2409.02228v1", "repo": "null"}}