{"2409.03166": {"publish_time": "2024-09-05", "title": "Continual Skill and Task Learning via Dialogue", "paper_summary": "Continual and interactive robot learning is a challenging problem as the\nrobot is present with human users who expect the robot to learn novel skills to\nsolve novel tasks perpetually with sample efficiency. In this work we present a\nframework for robots to query and learn visuo-motor robot skills and task\nrelevant information via natural language dialog interactions with human users.\nPrevious approaches either focus on improving the performance of instruction\nfollowing agents, or passively learn novel skills or concepts. Instead, we used\ndialog combined with a language-skill grounding embedding to query or confirm\nskills and/or tasks requested by a user. To achieve this goal, we developed and\nintegrated three different components for our agent. Firstly, we propose a\nnovel visual-motor control policy ACT with Low Rank Adaptation (ACT-LoRA),\nwhich enables the existing SoTA ACT model to perform few-shot continual\nlearning. Secondly, we develop an alignment model that projects demonstrations\nacross skill embodiments into a shared embedding allowing us to know when to\nask questions and/or demonstrations from users. Finally, we integrated an\nexisting LLM to interact with a human user to perform grounded interactive\ncontinual skill learning to solve a task. Our ACT-LoRA model learns novel\nfine-tuned skills with a 100% accuracy when trained with only five\ndemonstrations for a novel skill while still maintaining a 74.75% accuracy on\npre-trained skills in the RLBench dataset where other models fall significantly\nshort. We also performed a human-subjects study with 8 subjects to demonstrate\nthe continual learning capabilities of our combined framework. We achieve a\nsuccess rate of 75% in the task of sandwich making with the real robot learning\nfrom participant data demonstrating that robots can learn novel skills or task\nknowledge from dialogue with non-expert users using our approach.", "paper_summary_zh": "持續且互動的機器人學習是一個具有挑戰性的問題，因為機器人與人類使用者同時存在，而人類使用者期望機器人能夠學習新技能，以持續解決新任務，並具有範例效率。在這項工作中，我們提出一個架構，讓機器人透過與人類使用者進行自然語言對話互動，來查詢和學習視覺運動機器人技能和任務相關資訊。先前的做法不是專注於改善指令遵循代理人的效能，就是被動地學習新技能或概念。相反地，我們使用對話結合語言技能基礎嵌入，來查詢或確認使用者要求的技能和/或任務。為了達成這個目標，我們為我們的代理人開發並整合了三個不同的元件。首先，我們提出一個新的視覺運動控制策略 ACT，具有低秩適應 (ACT-LoRA)，這讓現有的 SoTA ACT 模型能夠執行小樣本持續學習。其次，我們開發一個比對模型，將不同技能具體實例中的示範投射到一個共用嵌入中，讓我們知道何時向使用者詢問問題和/或示範。最後，我們整合了一個現有的 LLM，與人類使用者互動，以執行基礎互動式持續技能學習，來解決一個任務。我們的 ACT-LoRA 模型在僅使用五個示範訓練新技能時，就能學習到新的微調技能，準確率達到 100%，同時在 RLBench 資料集中預先訓練的技能上仍能維持 74.75% 的準確率，而其他模型的準確率則大幅下降。我們還進行了一項包含 8 位受試者的真人研究，以展示我們這個結合框架的持續學習能力。我們在三明治製作任務中達到 75% 的成功率，真實機器人從參與者的資料中學習，證明了機器人可以使用我們的方法，從非專家使用者的對話中學習新的技能或任務知識。", "author": "Weiwei Gu et.al.", "authors": "Weiwei Gu, Suresh Kondepudi, Lixiao Huang, Nakul Gopalan", "id": "2409.03166v1", "paper_url": "http://arxiv.org/abs/2409.03166v1", "repo": "null"}}