{"2409.05314": {"publish_time": "2024-09-09", "title": "Tele-LLMs: A Series of Specialized Large Language Models for Telecommunications", "paper_summary": "The emergence of large language models (LLMs) has significantly impacted\nvarious fields, from natural language processing to sectors like medicine and\nfinance. However, despite their rapid proliferation, the applications of LLMs\nin telecommunications remain limited, often relying on general-purpose models\nthat lack domain-specific specialization. This lack of specialization results\nin underperformance, particularly when dealing with telecommunications-specific\ntechnical terminology and their associated mathematical representations. This\npaper addresses this gap by first creating and disseminating Tele-Data, a\ncomprehensive dataset of telecommunications material curated from relevant\nsources, and Tele-Eval, a large-scale question-and-answer dataset tailored to\nthe domain. Through extensive experiments, we explore the most effective\ntraining techniques for adapting LLMs to the telecommunications domain, ranging\nfrom examining the division of expertise across various telecommunications\naspects to employing parameter-efficient techniques. We also investigate how\nmodels of different sizes behave during adaptation and analyze the impact of\ntheir training data on this behavior. Leveraging these findings, we develop and\nopen-source Tele-LLMs, the first series of language models ranging from 1B to\n8B parameters, specifically tailored for telecommunications. Our evaluations\ndemonstrate that these models outperform their general-purpose counterparts on\nTele-Eval while retaining their previously acquired capabilities, thus avoiding\nthe catastrophic forgetting phenomenon.", "paper_summary_zh": "大型語言模型 (LLM) 的出現對各個領域產生了重大影響，從自然語言處理到醫學和金融等領域。然而，儘管 LLM 迅速普及，但在電信領域的應用仍然有限，通常依賴於缺乏特定領域專業知識的通用模型。這種專業知識的缺乏導致了表現不佳，特別是在處理電信專用技術術語及其相關數學表示時。本文通過首先創建和傳播 Tele-Data 來解決這一差距，Tele-Data 是從相關來源策展的電信材料的綜合數據集，以及 Tele-Eval，一個針對該領域量身定制的大規模問答數據集。通過廣泛的實驗，我們探討了將 LLM 適應電信領域的最有效訓練技術，從檢查電信各個方面的專業知識劃分到採用參數高效技術。我們還研究了不同規模的模型在適應過程中如何表現，並分析了其訓練數據對這種行為的影響。利用這些發現，我們開發並開源了 Tele-LLM，這是第一個針對電信量身定制的語言模型系列，參數範圍從 1B 到 8B。我們的評估表明，這些模型在 Tele-Eval 上優於其通用模型，同時保留了它們先前獲得的能力，從而避免了災難性遺忘現象。", "author": "Ali Maatouk et.al.", "authors": "Ali Maatouk, Kenny Chirino Ampudia, Rex Ying, Leandros Tassiulas", "id": "2409.05314v1", "paper_url": "http://arxiv.org/abs/2409.05314v1", "repo": "null"}}