{"2501.12486": {"publish_time": "2025-01-21", "title": "The Journey Matters: Average Parameter Count over Pre-training Unifies Sparse and Dense Scaling Laws", "paper_summary": "Pruning eliminates unnecessary parameters in neural networks; it offers a\npromising solution to the growing computational demands of large language\nmodels (LLMs). While many focus on post-training pruning, sparse\npre-training--which combines pruning and pre-training into a single\nphase--provides a simpler alternative. In this work, we present the first\nsystematic exploration of optimal sparse pre-training configurations for LLMs\nthrough an examination of 80 unique pruning schedules across different sparsity\nlevels and training durations. We find that initiating pruning at 25% of total\ntraining compute and concluding at 75% achieves near-optimal final evaluation\nloss. These findings provide valuable insights for efficient and effective\nsparse pre-training of LLMs. Furthermore, we propose a new scaling law that\nmodifies the Chinchilla scaling law to use the average parameter count over\npre-training. Through empirical and theoretical validation, we demonstrate that\nthis modified scaling law accurately models evaluation loss for both sparsely\nand densely pre-trained LLMs, unifying scaling laws across pre-training\nparadigms. Our findings indicate that while sparse pre-training achieves the\nsame final model quality as dense pre-training for equivalent compute budgets,\nit provides substantial benefits through reduced model size, enabling\nsignificant potential computational savings during inference.", "paper_summary_zh": "修剪消除了神經網路中不必要的參數；它為大型語言模型 (LLM) 不斷增長的運算需求提供了一個有前途的解決方案。雖然許多人專注於訓練後修剪，但稀疏預訓練（將修剪和預訓練結合到一個階段）提供了一個更簡單的替代方案。在這項工作中，我們通過檢查 80 個不同的稀疏度級別和訓練持續時間的獨特修剪時間表，對 LLM 的最佳稀疏預訓練配置進行了首次系統性探索。我們發現，從總訓練運算的 25% 開始修剪並在 75% 結束，可以達到接近最佳的最終評估損失。這些發現為 LLM 的高效且有效的稀疏預訓練提供了寶貴的見解。此外，我們提出了新的縮放定律，該定律修改了 Chinchilla 縮放定律，以使用預訓練期間的平均參數計數。通過經驗和理論驗證，我們證明了這個修改後的縮放定律可以準確地模擬稀疏和密集預訓練 LLM 的評估損失，統一了預訓練範例中的縮放定律。我們的發現表明，雖然稀疏預訓練在相同的運算預算下實現了與密集預訓練相同的最終模型品質，但它通過減少模型大小提供了顯著的優點，從而可以在推理期間實現顯著的潛在運算節省。", "author": "Tian Jin et.al.", "authors": "Tian Jin, Ahmed Imtiaz Humayun, Utku Evci, Suvinay Subramanian, Amir Yazdanbakhsh, Dan Alistarh, Gintare Karolina Dziugaite", "id": "2501.12486v1", "paper_url": "http://arxiv.org/abs/2501.12486v1", "repo": "null"}}