{"2412.09353": {"publish_time": "2024-12-12", "title": "Causal Graphical Models for Vision-Language Compositional Understanding", "paper_summary": "Recent work has empirically shown that Vision-Language Models (VLMs) struggle\nto fully understand the compositional properties of the human language, usually\nmodeling an image caption as a \"bag of words\". As a result, they perform poorly\non compositional tasks, which require a deeper understanding of the different\nentities of a sentence (subject, verb, etc.) jointly with their mutual\nrelationships in order to be solved. In this paper, we model the dependency\nrelations among textual and visual tokens using a Causal Graphical Model (CGM),\nbuilt using a dependency parser, and we train a decoder conditioned by the VLM\nvisual encoder. Differently from standard autoregressive or parallel\npredictions, our decoder's generative process is partially-ordered following\nthe CGM structure. This structure encourages the decoder to learn only the main\ncausal dependencies in a sentence discarding spurious correlations. Using\nextensive experiments on five compositional benchmarks, we show that our method\nsignificantly outperforms all the state-of-the-art compositional approaches by\na large margin, and it also improves over methods trained using much larger\ndatasets.", "paper_summary_zh": "最近的研究實證顯示，視覺語言模型 (VLM) 難以完全理解人類語言的組合特性，通常將影像標題建模為「詞彙袋」。因此，它們在組合任務上的表現不佳，而這些任務需要更深入地理解句子中不同實體（主詞、動詞等）以及它們之間的相互關係才能解決。在本文中，我們使用因果圖形模型 (CGM) 對文本和視覺符號之間的依賴關係進行建模，該模型是使用依賴解析器建立的，並且我們訓練了一個由 VLM 視覺編碼器條件化的解碼器。與標準的自動迴歸或並行預測不同，我們的解碼器的生成過程是部分排序的，遵循 CGM 結構。此結構鼓勵解碼器僅學習句子中的主要因果依賴關係，並捨棄虛假的相關性。透過在五個組合基準上進行廣泛的實驗，我們展示了我們的模型大幅優於所有最先進的組合方法，而且也優於使用更大資料集訓練的方法。", "author": "Fiorenzo Parascandolo et.al.", "authors": "Fiorenzo Parascandolo, Nicholas Moratelli, Enver Sangineto, Lorenzo Baraldi, Rita Cucchiara", "id": "2412.09353v1", "paper_url": "http://arxiv.org/abs/2412.09353v1", "repo": "null"}}