{"2412.09467": {"publish_time": "2024-12-12", "title": "Audios Don't Lie: Multi-Frequency Channel Attention Mechanism for Audio Deepfake Detection", "paper_summary": "With the rapid development of artificial intelligence technology, the\napplication of deepfake technology in the audio field has gradually increased,\nresulting in a wide range of security risks. Especially in the financial and\nsocial security fields, the misuse of deepfake audios has raised serious\nconcerns. To address this challenge, this study proposes an audio deepfake\ndetection method based on multi-frequency channel attention mechanism (MFCA)\nand 2D discrete cosine transform (DCT). By processing the audio signal into a\nmelspectrogram, using MobileNet V2 to extract deep features, and combining it\nwith the MFCA module to weight different frequency channels in the audio\nsignal, this method can effectively capture the fine-grained frequency domain\nfeatures in the audio signal and enhance the Classification capability of fake\naudios. Experimental results show that compared with traditional methods, the\nmodel proposed in this study shows significant advantages in accuracy,\nprecision,recall, F1 score and other indicators. Especially in complex audio\nscenarios, this method shows stronger robustness and generalization\ncapabilities and provides a new idea for audio deepfake detection and has\nimportant practical application value. In the future, more advanced audio\ndetection technologies and optimization strategies will be explored to further\nimprove the accuracy and generalization capabilities of audio deepfake\ndetection.", "paper_summary_zh": "隨著人工智慧技術的快速發展，深度偽造技術在音訊領域的應用逐漸增多，導致安全性風險範圍廣泛。特別是在金融、社會安全領域，深度偽造音訊的濫用引發了嚴重的關注。為了應對這一挑戰，本研究提出了一種基於多頻道頻道注意力機制 (MFCA) 和 2D 離散餘弦變換 (DCT) 的音訊深度偽造檢測方法。通過將音訊訊號處理成梅爾頻譜圖，使用 MobileNet V2 提取深度特徵，並結合 MFCA 模組對音訊訊號中的不同頻率通道進行加權，此方法可以有效捕捉音訊訊號中的細粒度頻域特徵，並增強偽造音訊的分類能力。實驗結果表明，與傳統方法相比，本研究提出的模型在準確度、精確度、召回率、F1 分數等指標上表現出顯著的優勢。特別是在複雜的音訊場景中，此方法展現出更強的魯棒性和泛化能力，為音訊深度偽造檢測提供了新思路，具有重要的實務應用價值。未來將探索更多進階的音訊檢測技術和最佳化策略，以進一步提升音訊深度偽造檢測的準確度和泛化能力。", "author": "Yangguang Feng et.al.", "authors": "Yangguang Feng", "id": "2412.09467v1", "paper_url": "http://arxiv.org/abs/2412.09467v1", "repo": "null"}}