{"2411.08334": {"publish_time": "2024-11-13", "title": "Enhancing Multimodal Query Representation via Visual Dialogues for End-to-End Knowledge Retrieval", "paper_summary": "Existing multimodal retrieval systems often rely on disjointed models for\nimage comprehension, such as object detectors and caption generators, leading\nto cumbersome implementations and training processes. To overcome this\nlimitation, we propose an end-to-end retrieval system, Ret-XKnow, to endow a\ntext retriever with the ability to understand multimodal queries via dynamic\nmodality interaction. Ret-XKnow leverages a partial convolution mechanism to\nfocus on visual information relevant to the given textual query, thereby\nenhancing multimodal query representations. To effectively learn multimodal\ninteraction, we also introduce the Visual Dialogue-to-Retrieval (ViD2R) dataset\nautomatically constructed from visual dialogue datasets. Our dataset\nconstruction process ensures that the dialogues are transformed into suitable\ninformation retrieval tasks using a text retriever. We demonstrate that our\napproach not only significantly improves retrieval performance in zero-shot\nsettings but also achieves substantial improvements in fine-tuning scenarios.\nOur code is publicly available: https://github.com/yeongjoonJu/Ret_XKnow.", "paper_summary_zh": "現有的多模態檢索系統通常依賴於不連貫的模型來理解影像，例如物件偵測器和標題產生器，導致實作和訓練過程繁瑣。為了克服這個限制，我們提出一個端到端的檢索系統 Ret-XKnow，賦予文字檢索器透過動態模態互動來理解多模態查詢的能力。Ret-XKnow 利用部分卷積機制來專注於與給定文字查詢相關的視覺資訊，進而增強多模態查詢表示。為了有效地學習多模態互動，我們還引入了視覺對話到檢索 (ViD2R) 資料集，該資料集是自動從視覺對話資料集中建構的。我們的資料集建構過程可確保對話使用文字檢索器轉換成合適的資訊檢索任務。我們證明我們的做法不僅顯著改善了零次學習設定中的檢索效能，而且在微調場景中也獲得了顯著的改善。我們的程式碼已公開：https://github.com/yeongjoonJu/Ret_XKnow。", "author": "Yeong-Joon Ju et.al.", "authors": "Yeong-Joon Ju, Ho-Joong Kim, Seong-Whan Lee", "id": "2411.08334v1", "paper_url": "http://arxiv.org/abs/2411.08334v1", "repo": "https://github.com/yeongjoonju/ret_xknow"}}