{"2406.16714": {"publish_time": "2024-06-24", "title": "AutoDetect: Towards a Unified Framework for Automated Weakness Detection in Large Language Models", "paper_summary": "Although Large Language Models (LLMs) are becoming increasingly powerful,\nthey still exhibit significant but subtle weaknesses, such as mistakes in\ninstruction-following or coding tasks. As these unexpected errors could lead to\nsevere consequences in practical deployments, it is crucial to investigate the\nlimitations within LLMs systematically. Traditional benchmarking approaches\ncannot thoroughly pinpoint specific model deficiencies, while manual\ninspections are costly and not scalable. In this paper, we introduce a unified\nframework, AutoDetect, to automatically expose weaknesses in LLMs across\nvarious tasks. Inspired by the educational assessment process that measures\nstudents' learning outcomes, AutoDetect consists of three LLM-powered agents:\nExaminer, Questioner, and Assessor. The collaboration among these three agents\nis designed to realize comprehensive and in-depth weakness identification. Our\nframework demonstrates significant success in uncovering flaws, with an\nidentification success rate exceeding 30% in prominent models such as ChatGPT\nand Claude. More importantly, these identified weaknesses can guide specific\nmodel improvements, proving more effective than untargeted data augmentation\nmethods like Self-Instruct. Our approach has led to substantial enhancements in\npopular LLMs, including the Llama series and Mistral-7b, boosting their\nperformance by over 10% across several benchmarks. Code and data are publicly\navailable at https://github.com/thu-coai/AutoDetect.", "paper_summary_zh": "儘管大型語言模型 (LLM) 變得越來越強大，\n它們仍展現出顯著但細微的弱點，例如在指令遵循或編碼任務中的錯誤。由於這些意外錯誤可能導致實際部署中的嚴重後果，因此系統地調查 LLM 中的限制至關重要。傳統的基準測試方法無法徹底找出具體的模型缺陷，而手動檢查成本高昂且不可擴展。在本文中，我們介紹了一個統一的框架 AutoDetect，用於自動揭露 LLM 在各種任務中的弱點。受衡量學生學習成果的教育評量過程啟發，AutoDetect 包含三個由 LLM 驅動的代理：考官、提問者和評估者。這三個代理之間的協作旨在實現全面且深入的弱點識別。我們的框架在發現缺陷方面表現出顯著的成功，在 ChatGPT 和 Claude 等知名模型中，識別成功率超過 30%。更重要的是，這些已識別的弱點可以指導具體的模型改進，證明比自指導等無目標數據擴充方法更有效。我們的做法已大幅提升熱門 LLM 的效能，包括 Llama 系列和 Mistral-7b，在多個基準測試中提升其效能超過 10%。程式碼和資料已公開發布於 https://github.com/thu-coai/AutoDetect。", "author": "Jiale Cheng et.al.", "authors": "Jiale Cheng, Yida Lu, Xiaotao Gu, Pei Ke, Xiao Liu, Yuxiao Dong, Hongning Wang, Jie Tang, Minlie Huang", "id": "2406.16714v1", "paper_url": "http://arxiv.org/abs/2406.16714v1", "repo": "https://github.com/thu-coai/autodetect"}}