{"2408.09846": {"publish_time": "2024-08-19", "title": "Continual Dialogue State Tracking via Reason-of-Select Distillation", "paper_summary": "An ideal dialogue system requires continuous skill acquisition and adaptation\nto new tasks while retaining prior knowledge. Dialogue State Tracking (DST),\nvital in these systems, often involves learning new services and confronting\ncatastrophic forgetting, along with a critical capability loss termed the\n\"Value Selection Quandary.\" To address these challenges, we introduce the\nReason-of-Select (RoS) distillation method by enhancing smaller models with a\nnovel 'meta-reasoning' capability. Meta-reasoning employs an enhanced\nmulti-domain perspective, combining fragments of meta-knowledge from\ndomain-specific dialogues during continual learning. This transcends\ntraditional single-perspective reasoning. The domain bootstrapping process\nenhances the model's ability to dissect intricate dialogues from multiple\npossible values. Its domain-agnostic property aligns data distribution across\ndifferent domains, effectively mitigating forgetting. Additionally, two novel\nimprovements, \"multi-value resolution\" strategy and Semantic Contrastive\nReasoning Selection method, significantly enhance RoS by generating\nDST-specific selection chains and mitigating hallucinations in teachers'\nreasoning, ensuring effective and reliable knowledge transfer. Extensive\nexperiments validate the exceptional performance and robust generalization\ncapabilities of our method. The source code is provided for reproducibility.", "paper_summary_zh": "理想的對話系統需要持續的技能習得和適應新任務，同時保留先前的知識。對話狀態追蹤 (DST) 在這些系統中至關重要，通常涉及學習新服務和應對災難性遺忘，以及稱為「值選擇困境」的關鍵能力損失。為了應對這些挑戰，我們引入了選擇原因 (RoS) 萃取方法，通過一種新穎的「元推理」能力增強較小的模型。元推理採用增強的多領域觀點，在持續學習期間結合來自特定領域對話的元知識片段。這超越了傳統的單一觀點推理。領域自舉過程增強了模型從多個可能值中剖析複雜對話的能力。其與領域無關的屬性使不同領域之間的數據分佈保持一致，有效減輕遺忘。此外，兩種新穎的改進，「多值解析」策略和語義對比推理選擇方法，通過生成 DST 特定的選擇鏈並減輕教師推理中的幻覺，顯著增強了 RoS，確保有效且可靠的知識傳遞。廣泛的實驗驗證了我們方法的出色性能和強大的泛化能力。提供源代碼以供重現。", "author": "Yujie Feng et.al.", "authors": "Yujie Feng, Bo Liu, Xiaoyu Dong, Zexin Lu, Li-Ming Zhan, Xiao-Ming Wu, Albert Y. S. Lam", "id": "2408.09846v1", "paper_url": "http://arxiv.org/abs/2408.09846v1", "repo": "null"}}