{"2406.09967": {"publish_time": "2024-06-14", "title": "Bag of Lies: Robustness in Continuous Pre-training BERT", "paper_summary": "This study aims to acquire more insights into the continuous pre-training\nphase of BERT regarding entity knowledge, using the COVID-19 pandemic as a case\nstudy. Since the pandemic emerged after the last update of BERT's pre-training\ndata, the model has little to no entity knowledge about COVID-19. Using\ncontinuous pre-training, we control what entity knowledge is available to the\nmodel. We compare the baseline BERT model with the further pre-trained variants\non the fact-checking benchmark Check-COVID. To test the robustness of\ncontinuous pre-training, we experiment with several adversarial methods to\nmanipulate the input data, such as training on misinformation and shuffling the\nword order until the input becomes nonsensical. Surprisingly, our findings\nreveal that these methods do not degrade, and sometimes even improve, the\nmodel's downstream performance. This suggests that continuous pre-training of\nBERT is robust against misinformation. Furthermore, we are releasing a new\ndataset, consisting of original texts from academic publications in the\nLitCovid repository and their AI-generated false counterparts.", "paper_summary_zh": "本研究旨在透過以 COVID-19 疫情為案例研究，進一步了解 BERT 持續預訓練階段中關於實體知識的見解。由於疫情在 BERT 預訓練資料的最後一次更新後才出現，因此該模型對於 COVID-19 的實體知識幾乎沒有或完全沒有。透過持續預訓練，我們控制模型可取得的實體知識。我們在事實查核基準 Check-COVID 上比較基準 BERT 模型與進一步預訓練的變體。為了測試持續預訓練的穩健性，我們嘗試使用多種對抗方法來操縱輸入資料，例如針對錯誤資訊進行訓練，以及將字詞順序打亂，直到輸入變得毫無意義為止。令人驚訝的是，我們的研究結果顯示，這些方法並不會降低模型的下游效能，有時甚至會提升效能。這表示 BERT 的持續預訓練對於錯誤資訊具有穩健性。此外，我們發布了一個新資料集，其中包含 LitCovid 存放庫中學術出版品的原始文字及其 AI 生成的錯誤對應文字。", "author": "Ine Gevers et.al.", "authors": "Ine Gevers, Walter Daelemans", "id": "2406.09967v1", "paper_url": "http://arxiv.org/abs/2406.09967v1", "repo": "null"}}