{"2501.00782": {"publish_time": "2025-01-01", "title": "Navigating Nuance: In Quest for Political Truth", "paper_summary": "This study investigates the several nuanced rationales for countering the\nrise of political bias. We evaluate the performance of the Llama-3 (70B)\nlanguage model on the Media Bias Identification Benchmark (MBIB), based on a\nnovel prompting technique that incorporates subtle reasons for identifying\npolitical leaning. Our findings underscore the challenges of detecting\npolitical bias and highlight the potential of transfer learning methods to\nenhance future models. Through our framework, we achieve a comparable\nperformance with the supervised and fully fine-tuned ConvBERT model, which is\nthe state-of-the-art model, performing best among other baseline models for the\npolitical bias task on MBIB. By demonstrating the effectiveness of our\napproach, we contribute to the development of more robust tools for mitigating\nthe spread of misinformation and polarization. Our codes and dataset are made\npublicly available in github.", "paper_summary_zh": "本研究探討了對抗政治偏見興起的幾種微妙理由。我們根據一種新的提示技術，它包含了識別政治傾向的微妙理由，評估了 Llama-3 (70B) 語言模型在媒體偏見識別基準 (MBIB) 上的表現。我們的發現強調了檢測政治偏見的挑戰，並突出了遷移學習方法增強未來模型的潛力。透過我們的架構，我們達到了與監督式和完全微調的 ConvBERT 模型相當的表現，這是最先進的模型，在 MBIB 的政治偏見任務中表現優於其他基準模型。透過展示我們方法的有效性，我們有助於開發更強大的工具來減輕錯誤資訊和兩極分化的傳播。我們的程式碼和資料集已公開在 github 中。", "author": "Soumyadeep Sar et.al.", "authors": "Soumyadeep Sar, Dwaipayan Roy", "id": "2501.00782v1", "paper_url": "http://arxiv.org/abs/2501.00782v1", "repo": "null"}}