{"2408.12159": {"publish_time": "2024-08-22", "title": "Search-Based LLMs for Code Optimization", "paper_summary": "The code written by developers usually suffers from efficiency problems and\ncontain various performance bugs. These inefficiencies necessitate the research\nof automated refactoring methods for code optimization. Early research in code\noptimization employs rule-based methods and focuses on specific inefficiency\nissues, which are labor-intensive and suffer from the low coverage issue.\nRecent work regards the task as a sequence generation problem, and resorts to\ndeep learning (DL) techniques such as large language models (LLMs). These\nmethods typically prompt LLMs to directly generate optimized code. Although\nthese methods show state-of-the-art performance, such one-step generation\nparadigm is hard to achieve an optimal solution. First, complex optimization\nmethods such as combinatorial ones are hard to be captured by LLMs. Second, the\none-step generation paradigm poses challenge in precisely infusing the\nknowledge required for effective code optimization within LLMs, resulting in\nunder-optimized code.To address these problems, we propose to model this task\nfrom the search perspective, and propose a search-based LLMs framework named\nSBLLM that enables iterative refinement and discovery of improved optimization\nmethods. SBLLM synergistically integrate LLMs with evolutionary search and\nconsists of three key components: 1) an execution-based representative sample\nselection part that evaluates the fitness of each existing optimized code and\nprioritizes promising ones to pilot the generation of improved code; 2) an\nadaptive optimization pattern retrieval part that infuses targeted optimization\npatterns into the model for guiding LLMs towards rectifying and progressively\nenhancing their optimization methods; and 3) a genetic operator-inspired\nchain-of-thought prompting part that aids LLMs in combining different\noptimization methods and generating improved optimization methods.", "paper_summary_zh": "<paragraph>開發人員撰寫的程式碼通常會有效率問題，並包含各種效能錯誤。這些低效率需要研究自動重構方法以進行程式碼最佳化。程式碼最佳化的早期研究採用基於規則的方法，並專注於特定低效率問題，這需要大量人工，且存在覆蓋率低的問題。最近的研究將任務視為序列產生問題，並採用深度學習 (DL) 技術，例如大型語言模型 (LLM)。這些方法通常會提示 LLM 直接產生最佳化的程式碼。儘管這些方法顯示了最先進的效能，但這種單步產生模式難以達成最佳解。首先，組合式等複雜最佳化方法難以被 LLM 捕捉。其次，單步產生模式在精確注入 LLM 中有效程式碼最佳化所需的知識時構成挑戰，導致程式碼最佳化不足。為了解決這些問題，我們提議從搜尋角度建模此任務，並提出一個名為 SBLLM 的基於搜尋的 LLM 架構，它能進行反覆精煉和發現改良的最佳化方法。SBLLM 協同整合 LLM 與演化搜尋，並包含三個關鍵組成部分：1) 基於執行的代表性樣本選取部分，用於評估每個現有最佳化程式碼的適應度，並優先考慮有希望的程式碼來引導改善程式碼的產生；2) 自適應最佳化模式擷取部分，用於將目標最佳化模式注入模型，以引導 LLM 修正和逐步增強其最佳化方法；3) 受遺傳算子啟發的思考鏈提示部分，用於協助 LLM 結合不同的最佳化方法，並產生改良的最佳化方法。</paragraph>", "author": "Shuzheng Gao et.al.", "authors": "Shuzheng Gao, Cuiyun Gao, Wenchao Gu, Michael Lyu", "id": "2408.12159v1", "paper_url": "http://arxiv.org/abs/2408.12159v1", "repo": "null"}}