{"2410.19195": {"publish_time": "2024-10-24", "title": "Label Set Optimization via Activation Distribution Kurtosis for Zero-shot Classification with Generative Models", "paper_summary": "In-context learning (ICL) performance is known to be sensitive to the prompt\ndesign, yet the impact of class label options in zero-shot classification has\nbeen largely overlooked. This study presents the first comprehensive empirical\nstudy investigating how label option (e.g., lexical choice, order, and\nelaboration) influences zero-shot ICL classification performance. Our findings\nreveal that lexical choices for label names (e.g., agree vs.support in stance\nclassification) play an important role, with effects also linked to label\norders. An analysis of the model internal states further shows that optimal\nlabel names tend to activate fewer outlier neurons in the feed forward network.\nBased on this observation, we propose Label set Optimization via Activation\nDistribution kurtosiS (LOADS), a post-hoc approach requiring no gradient\npropagation. LOADS not only demonstrates effectiveness with only 100 unlabelled\nsamples across different model types and sizes, but also shows cross-lingual\ntransferability.", "paper_summary_zh": "<paragraph>已知语境学习 (ICL) 效能对于提示设计很敏感，但类别标签选项在零次分类中的影响却在很大程度上被忽视了。本研究提出了第一个全面的经验研究，调查标签选项（例如词汇选择、顺序和详细说明）如何影响零次 ICL 分类效能。我们的研究结果表明，标签名称的词汇选择（例如，立场分类中的同意与支持）起着重要作用，其影响还与标签顺序相关。对模型内部状态的分析进一步表明，最佳标签名称倾向于在前馈网络中激活较少的离群神经元。基于这一观察，我们提出了通过激活分布峰度 (LOADS) 进行标签集优化，这是一种无需梯度传播的后验方法。LOADS 不仅在不同模型类型和大小中仅使用 100 个未标记样本就证明了其有效性，还显示了跨语言的可传递性。</paragraph>", "author": "Yue Li et.al.", "authors": "Yue Li, Zhixue Zhao, Carolina Scarton", "id": "2410.19195v1", "paper_url": "http://arxiv.org/abs/2410.19195v1", "repo": "null"}}