{"2502.15182": {"publish_time": "2025-02-21", "title": "LEDD: Large Language Model-Empowered Data Discovery in Data Lakes", "paper_summary": "Data discovery in data lakes with ever increasing datasets has long been\nrecognized as a big challenge in the realm of data management, especially for\nsemantic search of and hierarchical global catalog generation of tables. While\nlarge language models (LLMs) facilitate the processing of data semantics,\nchallenges remain in architecting an end-to-end system that comprehensively\nexploits LLMs for the two semantics-related tasks. In this demo, we propose\nLEDD, an end-to-end system with an extensible architecture that leverages LLMs\nto provide hierarchical global catalogs with semantic meanings and semantic\ntable search for data lakes. Specifically, LEDD can return semantically related\ntables based on natural-language specification. These features make LEDD an\nideal foundation for downstream tasks such as model training and schema linking\nfor text-to-SQL tasks. LEDD also provides a simple Python interface to\nfacilitate the extension and the replacement of data discovery algorithms.", "paper_summary_zh": "在數據集不斷增加的資料湖中進行資料探索，長期以來一直被視為資料管理領域的一大挑戰，特別是對於資料表的語義搜尋和階層式全球目錄產生。雖然大型語言模型 (LLM) 能夠促進資料語義的處理，但在建構一個全面利用 LLM 來執行兩個語義相關任務的端到端系統時，仍存在挑戰。在此示範中，我們提出 LEDD，一個具有可擴充架構的端到端系統，它利用 LLM 來提供具有語義意義的階層式全球目錄和資料湖的語義資料表搜尋。具體而言，LEDD 可以根據自然語言規範傳回語義相關的資料表。這些功能使 LEDD 成為下游任務的理想基礎，例如模型訓練和文字轉 SQL 任務的架構連結。LEDD 也提供一個簡單的 Python 介面，以利於擴充和替換資料探索演算法。", "author": "Qi An et.al.", "authors": "Qi An, Chihua Ying, Yuqing Zhu, Yihao Xu, Manwei Zhang, Jianmin Wang", "id": "2502.15182v1", "paper_url": "http://arxiv.org/abs/2502.15182v1", "repo": "null"}}