{"2409.00724": {"publish_time": "2024-09-01", "title": "BUET Multi-disease Heart Sound Dataset: A Comprehensive Auscultation Dataset for Developing Computer-Aided Diagnostic Systems", "paper_summary": "Cardiac auscultation, an integral tool in diagnosing cardiovascular diseases\n(CVDs), often relies on the subjective interpretation of clinicians, presenting\na limitation in consistency and accuracy. Addressing this, we introduce the\nBUET Multi-disease Heart Sound (BMD-HS) dataset - a comprehensive and\nmeticulously curated collection of heart sound recordings. This dataset,\nencompassing 864 recordings across five distinct classes of common heart\nsounds, represents a broad spectrum of valvular heart diseases, with a focus on\ndiagnostically challenging cases. The standout feature of the BMD-HS dataset is\nits innovative multi-label annotation system, which captures a diverse range of\ndiseases and unique disease states. This system significantly enhances the\ndataset's utility for developing advanced machine learning models in automated\nheart sound classification and diagnosis. By bridging the gap between\ntraditional auscultation practices and contemporary data-driven diagnostic\nmethods, the BMD-HS dataset is poised to revolutionize CVD diagnosis and\nmanagement, providing an invaluable resource for the advancement of cardiac\nhealth research. The dataset is publicly available at this link:\nhttps://github.com/mHealthBuet/BMD-HS-Dataset.", "paper_summary_zh": "心臟聽診是診斷心血管疾病 (CVD) 的一項整合工具，通常依賴於臨床醫師的主觀詮釋，在一致性和準確性方面存在限制。為了解決這個問題，我們引入了 BUET 多重疾病心音 (BMD-HS) 資料集，這是一個全面且經過精心策劃的心音錄音資料集。此資料集包含五種常見心音的 864 個錄音，代表了廣泛的心瓣膜疾病，重點在於診斷困難的病例。BMD-HS 資料集的突出特點是其創新的多標籤註解系統，它涵蓋了各種疾病和獨特的疾病狀態。這個系統顯著增強了資料集在開發自動心音分類和診斷中進階機器學習模型的效用。透過彌合傳統聽診實務與當代資料驅動診斷方法之間的差距，BMD-HS 資料集準備好革新心血管疾病的診斷和管理，為心臟健康研究的進展提供寶貴的資源。此資料集可透過以下連結公開取得：https://github.com/mHealthBuet/BMD-HS-Dataset。", "author": "Shams Nafisa Ali et.al.", "authors": "Shams Nafisa Ali, Afia Zahin, Samiul Based Shuvo, Nusrat Binta Nizam, Shoyad Ibn Sabur Khan Nuhash, Sayeed Sajjad Razin, S. M. Sakeef Sani, Farihin Rahman, Nawshad Binta Nizam, Farhat Binte Azam, Rakib Hossen, Sumaiya Ohab, Nawsabah Noor, Taufiq Hasan", "id": "2409.00724v1", "paper_url": "http://arxiv.org/abs/2409.00724v1", "repo": "https://github.com/mhealthbuet/bmd-hs-dataset"}}