{"2405.02334": {"publish_time": "2024-04-26", "title": "Rad4XCNN: a new agnostic method for post-hoc global explanation of CNN-derived features by means of radiomics", "paper_summary": "In the last years, artificial intelligence (AI) in clinical decision support\nsystems (CDSS) played a key role in harnessing machine learning and deep\nlearning architectures. Despite their promising capabilities, the lack of\ntransparency and explainability of AI models poses significant challenges,\nparticularly in medical contexts where reliability is a mandatory aspect.\nAchieving transparency without compromising predictive accuracy remains a key\nchallenge. This paper presents a novel method, namely Rad4XCNN, to enhance the\npredictive power of CNN-derived features with the interpretability inherent in\nradiomic features. Rad4XCNN diverges from conventional methods based on\nsaliency map, by associating intelligible meaning to CNN-derived features by\nmeans of Radiomics, offering new perspectives on explanation methods beyond\nvisualization maps. Using a breast cancer classification task as a case study,\nwe evaluated Rad4XCNN on ultrasound imaging datasets, including an online\ndataset and two in-house datasets for internal and external validation. Some\nkey results are: i) CNN-derived features guarantee more robust accuracy when\ncompared against ViT-derived and radiomic features; ii) conventional\nvisualization map methods for explanation present several pitfalls; iii)\nRad4XCNN does not sacrifice model accuracy for their explainability; iv)\nRad4XCNN provides global explanation insights enabling the physician to analyze\nthe model outputs and findings. In addition, we highlight the importance of\nintegrating interpretability into AI models for enhanced trust and adoption in\nclinical practice, emphasizing how our method can mitigate some concerns\nrelated to explainable AI methods.", "paper_summary_zh": "<paragraph>在過去幾年，臨床決策支援系統 (CDSS) 中的人工智慧 (AI) 在利用機器學習和深度學習架構方面發揮了關鍵作用。儘管 AI 模型具有令人滿意的能力，但缺乏透明度和可解釋性，特別是在可靠性為必要考量的醫療背景下，這帶來了重大的挑戰。在不影響預測精準度的情況下實現透明度仍然是一項關鍵挑戰。本文提出了一種新方法，即 Rad4XCNN，以增強 CNN 衍生特徵的預測能力，同時具備放射特徵固有的可解釋性。Rad4XCNN 不同於基於顯著性圖的傳統方法，它通過放射組學將可理解的含義與 CNN 衍生特徵關聯起來，為超越視覺化圖表的解釋方法提供了新的觀點。我們以乳癌分類任務作為案例研究，在超音波影像資料集上評估 Rad4XCNN，包括一個線上資料集和兩個用於內部和外部驗證的內部資料集。一些關鍵結果如下：i) 與 ViT 衍生特徵和放射特徵相比，CNN 衍生特徵保證了更穩健的準確度；ii) 傳統的視覺化圖解釋方法存在一些缺陷；iii) Rad4XCNN 沒有犧牲模型準確度來換取其可解釋性；iv) Rad4XCNN 提供了全局解釋見解，使醫師能夠分析模型輸出和發現。此外，我們強調將可解釋性整合到 AI 模型中對於增強臨床實務中的信任和採用至關重要，並強調了我們的方法如何能緩解與可解釋 AI 方法相關的一些疑慮。</paragraph>", "author": "Francesco Prinzi et.al.", "authors": "Francesco Prinzi, Carmelo Militello, Calogero Zarcaro, Tommaso Vincenzo Bartolotta, Salvatore Gaglio, Salvatore Vitabile", "id": "2405.02334v1", "paper_url": "http://arxiv.org/abs/2405.02334v1", "repo": "null"}}