{"2405.02334": {"publish_time": "2024-04-26", "title": "Rad4XCNN: a new agnostic method for post-hoc global explanation of CNN-derived features by means of radiomics", "paper_summary": "In the last years, artificial intelligence (AI) in clinical decision support\nsystems (CDSS) played a key role in harnessing machine learning and deep\nlearning architectures. Despite their promising capabilities, the lack of\ntransparency and explainability of AI models poses significant challenges,\nparticularly in medical contexts where reliability is a mandatory aspect.\nAchieving transparency without compromising predictive accuracy remains a key\nchallenge. This paper presents a novel method, namely Rad4XCNN, to enhance the\npredictive power of CNN-derived features with the interpretability inherent in\nradiomic features. Rad4XCNN diverges from conventional methods based on\nsaliency map, by associating intelligible meaning to CNN-derived features by\nmeans of Radiomics, offering new perspectives on explanation methods beyond\nvisualization maps. Using a breast cancer classification task as a case study,\nwe evaluated Rad4XCNN on ultrasound imaging datasets, including an online\ndataset and two in-house datasets for internal and external validation. Some\nkey results are: i) CNN-derived features guarantee more robust accuracy when\ncompared against ViT-derived and radiomic features; ii) conventional\nvisualization map methods for explanation present several pitfalls; iii)\nRad4XCNN does not sacrifice model accuracy for their explainability; iv)\nRad4XCNN provides global explanation insights enabling the physician to analyze\nthe model outputs and findings. In addition, we highlight the importance of\nintegrating interpretability into AI models for enhanced trust and adoption in\nclinical practice, emphasizing how our method can mitigate some concerns\nrelated to explainable AI methods.", "paper_summary_zh": "", "author": "Francesco Prinzi et.al.", "authors": "Francesco Prinzi,Carmelo Militello,Calogero Zarcaro,Tommaso Vincenzo Bartolotta,Salvatore Gaglio,Salvatore Vitabile", "id": "2405.02334v1", "paper_url": "http://arxiv.org/abs/2405.02334v1", "repo": "null"}}