{"2405.02334": {"publish_time": "2024-04-26", "title": "Rad4XCNN: a new agnostic method for post-hoc global explanation of CNN-derived features by means of radiomics", "paper_summary": "In recent years, machine learning-based clinical decision support systems\n(CDSS) have played a key role in the analysis of several medical conditions.\nDespite their promising capabilities, the lack of transparency in AI models\nposes significant challenges, particularly in medical contexts where\nreliability is a mandatory aspect. However, it appears that explainability is\ninversely proportional to accuracy. For this reason, achieving transparency\nwithout compromising predictive accuracy remains a key challenge. This paper\npresents a novel method, namely Rad4XCNN, to enhance the predictive power of\nCNN-derived features with the inherent interpretability of radiomic features.\nRad4XCNN diverges from conventional methods based on saliency maps, by\nassociating intelligible meaning to CNN-derived features by means of Radiomics,\noffering new perspectives on explanation methods beyond visualization maps.\nUsing a breast cancer classification task as a case study, we evaluated\nRad4XCNN on ultrasound imaging datasets, including an online dataset and two\nin-house datasets for internal and external validation. Some key results are:\ni) CNN-derived features guarantee more robust accuracy when compared against\nViT-derived and radiomic features; ii) conventional visualization map methods\nfor explanation present several pitfalls; iii) Rad4XCNN does not sacrifice\nmodel accuracy for their explainability; iv) Rad4XCNN provides a global\nexplanation enabling the physician to extract global insights and findings. Our\nmethod can mitigate some concerns related to the explainability-accuracy\ntrade-off. This study highlighted the importance of proposing new methods for\nmodel explanation without affecting their accuracy.", "paper_summary_zh": "<paragraph>近年来，基于机器学习的临床决策支持系统 (CDSS) 在多种疾病的分析中扮演了关键角色。尽管它们具有广阔的前景，但 AI 模型缺乏透明度，尤其在医疗领域，可靠性是强制性方面，这带来了重大挑战。然而，解释性似乎与准确性成反比。因此，在不影响预测准确性的情况下实现透明度仍然是一个关键挑战。本文提出了一种新方法，即 Rad4XCNN，以通过放射组学的内在可解释性来增强 CNN 衍生特征的预测能力。Rad4XCNN 通过放射组学将可理解的含义与 CNN 衍生特征关联起来，从而偏离了基于显着性图的传统方法，为超越可视化图的解释方法提供了新的视角。使用乳腺癌分类任务作为案例研究，我们在超声成像数据集上评估了 Rad4XCNN，包括一个在线数据集和两个用于内部和外部验证的内部数据集。一些关键结果是：i) 与 ViT 衍生和放射组学特征相比，CNN 衍生特征保证了更稳健的准确性；ii) 用于解释的传统可视化图方法存在一些缺陷；iii) Rad4XCNN 不会为了可解释性而牺牲模型准确性；iv) Rad4XCNN 提供全局解释，使医生能够提取全局见解和发现。我们的方法可以减轻一些与可解释性-准确性权衡相关的担忧。本研究强调了提出新方法来解释模型而不影响其准确性的重要性。</paragraph>", "author": "Francesco Prinzi et.al.", "authors": "Francesco Prinzi, Carmelo Militello, Calogero Zarcaro, Tommaso Vincenzo Bartolotta, Salvatore Gaglio, Salvatore Vitabile", "id": "2405.02334v2", "paper_url": "http://arxiv.org/abs/2405.02334v2", "repo": "null"}}