{"2410.06010": {"publish_time": "2024-10-08", "title": "A large collection of bioinformatics question-query pairs over federated knowledge graphs: methodology and applications", "paper_summary": "Background. In the last decades, several life science resources have\nstructured data using the same framework and made these accessible using the\nsame query language to facilitate interoperability. Knowledge graphs have seen\nincreased adoption in bioinformatics due to their advantages for representing\ndata in a generic graph format. For example, yummydata.org catalogs more than\n60 knowledge graphs accessible through SPARQL, a technical query language.\nAlthough SPARQL allows powerful, expressive queries, even across physically\ndistributed knowledge graphs, formulating such queries is a challenge for most\nusers. Therefore, to guide users in retrieving the relevant data, many of these\nresources provide representative examples. These examples can also be an\nimportant source of information for machine learning, if a sufficiently large\nnumber of examples are provided and published in a common, machine-readable and\nstandardized format across different resources.\n  Findings. We introduce a large collection of human-written natural language\nquestions and their corresponding SPARQL queries over federated bioinformatics\nknowledge graphs (KGs) collected for several years across different research\ngroups at the SIB Swiss Institute of Bioinformatics. The collection comprises\nmore than 1000 example questions and queries, including 65 federated queries.\nWe propose a methodology to uniformly represent the examples with minimal\nmetadata, based on existing standards. Furthermore, we introduce an extensive\nset of open-source applications, including query graph visualizations and smart\nquery editors, easily reusable by KG maintainers who adopt the proposed\nmethodology.\n  Conclusions. We encourage the community to adopt and extend the proposed\nmethodology, towards richer KG metadata and improved Semantic Web services.", "paper_summary_zh": "<paragraph>背景。在過去幾十年，許多生命科學資源使用相同的架構來建構資料，並使用相同的查詢語言來存取這些資料，以促進互操作性。知識圖譜由於其以通用圖形格式表示資料的優點，因此在生物資訊學中獲得了越來越廣泛的採用。例如，yummydata.org 編錄了超過 60 個可透過技術查詢語言 SPARQL 存取的知識圖譜。儘管 SPARQL 允許進行強大且具表達力的查詢，甚至跨越實體分布的知識圖譜，但對大多數使用者來說，制定此類查詢是一項挑戰。因此，為了指導使用者擷取相關資料，其中許多資源提供了具代表性的範例。如果提供了足夠大量的範例，並以跨不同資源的通用、機器可讀且標準化的格式發布，這些範例也可以成為機器學習的重要資訊來源。\n  發現。我們引入了大量由人類撰寫的自然語言問題及其對應的 SPARQL 查詢，這些查詢是多年來在 SIB 瑞士生物資訊學研究所的不同研究小組中收集的，涵蓋了聯邦生物資訊學知識圖譜 (KG)。該集合包含 1000 多個範例問題和查詢，包括 65 個聯邦查詢。我們提出了一種方法，基於現有標準，以最少的元資料統一表示這些範例。此外，我們還引入了一套廣泛的開源應用程式，包括查詢圖形視覺化和智慧查詢編輯器，這些應用程式很容易被採用所提出方法的 KG 維護人員重複使用。\n  結論。我們鼓勵社群採用並擴充所提出的方法，以獲得更豐富的 KG 元資料和改善的語意網路服務。</paragraph>", "author": "Jerven Bolleman et.al.", "authors": "Jerven Bolleman, Vincent Emonet, Adrian Altenhoff, Amos Bairoch, Marie-Claude Blatter, Alan Bridge, Severine Duvaud, Elisabeth Gasteiger, Dmitry Kuznetsov, Sebastien Moretti, Pierre-Andre Michel, Anne Morgat, Marco Pagni, Nicole Redaschi, Monique Zahn-Zabal, Tarcisio Mendes de Farias, Ana Claudia Sima", "id": "2410.06010v1", "paper_url": "http://arxiv.org/abs/2410.06010v1", "repo": "null"}}