{"2408.07479": {"publish_time": "2024-08-14", "title": "A Study on Bias Detection and Classification in Natural Language Processing", "paper_summary": "Human biases have been shown to influence the performance of models and\nalgorithms in various fields, including Natural Language Processing. While the\nstudy of this phenomenon is garnering focus in recent years, the available\nresources are still relatively scarce, often focusing on different forms or\nmanifestations of biases. The aim of our work is twofold: 1) gather\npublicly-available datasets and determine how to better combine them to\neffectively train models in the task of hate speech detection and\nclassification; 2) analyse the main issues with these datasets, such as\nscarcity, skewed resources, and reliance on non-persistent data. We discuss\nthese issues in tandem with the development of our experiments, in which we\nshow that the combinations of different datasets greatly impact the models'\nperformance.", "paper_summary_zh": "人類偏見已被證實會影響各種領域的模型和演算法效能，包括自然語言處理。雖然近年來對這項現象的研究備受關注，但現有的資源仍然相對稀少，通常只關注偏見的不同形式或表現。我們工作的目標有兩個：1) 收集公開可用的資料集，並確定如何將它們更好地結合起來，以有效訓練仇恨言論偵測和分類任務中的模型；2) 分析這些資料集的主要問題，例如稀少性、資源傾斜和依賴非持久性資料。我們在討論這些問題的同時，也進行了我們的實驗，我們在其中展示了不同資料集的組合會對模型的效能產生很大的影響。", "author": "Ana Sofia Evans et.al.", "authors": "Ana Sofia Evans, Helena Moniz, Luísa Coheur", "id": "2408.07479v1", "paper_url": "http://arxiv.org/abs/2408.07479v1", "repo": "null"}}