{"2405.06925": {"publish_time": "2024-05-11", "title": "Semi-supervised Anomaly Detection via Adaptive Reinforcement Learning-Enabled Method with Causal Inference", "paper_summary": "Semi-supervised anomaly detection for guaranteeing the reliability of\nintelligent systems has received increasing attention. However, existing\nmethods rely too much on data correlation and neglect causality, which can be\nmisleading due to confounding factors and affect system reliability.\nAdditionally, the current reinforcement learning anomaly detection methods can\neffectively identify known and unknown anomalies in environments with limited\nlabeled samples. Despite its effectiveness, these methods still face several\nchallenges, such as under-utilization of priori knowledge, lack of model\nflexibility, and insufficient reward feedback when interacting with the\nenvironment. To address the above problems, this paper innovatively constructs\na counterfactual causal reinforcement learning model, termed Triple-Assisted\nCausal Reinforcement Learning Anomaly Detector (Tri-CRLAD). The model utilizes\nthe causal inference mechanism to radically improve the performance of\nsemi-supervised models and enhance the model's ability to uncover anomaly data\nin the face of unknown or rare data. In addition, Tri-CRLAD features a triple\ndecision support mechanism, namely, a sampling strategy based on historical\nsimilarity, an adaptive threshold smoothing adjustment strategy, and an\nadaptive decision reward mechanism. These mechanisms further enhance the\nflexibility and generalization ability of the model, enabling it to effectively\nrespond to various complex and dynamically changing environments. Finally,\nTri-CRLAD matches or exceeds the performance of 9 baseline methods across 7\ndiverse intelligent system datasets, including satellite systems, medical\nsystems, and health systems. Moreover, anomaly detection stability was\nsignificantly improved by up to 23\\% with an extremely small number of known\nanomaly samples. Our code is available at\nhttps://github.com/Aoudsung/Tri-CRLAD/", "paper_summary_zh": "<paragraph>半监督异常检测用于保证智能系统的可靠性，已受到越来越多的关注。然而，现有的方法过于依赖数据相关性，而忽略因果关系，这可能会因混杂因素而产生误导，并影响系统可靠性。此外，当前的强化学习异常检测方法可以在标记样本有限的环境中有效识别已知和未知的异常。尽管这些方法很有效，但仍然面临着一些挑战，例如先验知识利用不足、模型灵活性不足以及与环境交互时奖励反馈不足。为了解决上述问题，本文创新性地构建了一个反事实因果强化学习模型，称为三辅助因果强化学习异常检测器（Tri-CRLAD）。该模型利用因果推理机制从根本上提高了半监督模型的性能，并增强了模型在面对未知或稀有数据时发现异常数据的能力。此外，Tri-CRLAD 具有三重决策支持机制，即基于历史相似性的采样策略、自适应阈值平滑调整策略和自适应决策奖励机制。这些机制进一步增强了模型的灵活性和泛化能力，使其能够有效应对各种复杂且动态变化的环境。最后，Tri-CRLAD 在 7 个不同的智能系统数据集（包括卫星系统、医疗系统和健康系统）中匹配或超过了 9 种基线方法的性能。此外，异常检测稳定性在已知异常样本极少的情况下显着提高了 23%。我们的代码可在 https://github.com/Aoudsung/Tri-CRLAD/ 获得</paragraph>", "author": "Xiangwei Chen et.al.", "authors": "Xiangwei Chen, Ruliang Xiaoa, Zhixia Zeng, Zhipeng Qiu, Shi Zhang, Xin Du", "id": "2405.06925v1", "paper_url": "http://arxiv.org/abs/2405.06925v1", "repo": "null"}}