{"2408.12796": {"publish_time": "2024-08-23", "title": "Real-Time Posture Monitoring and Risk Assessment for Manual Lifting Tasks Using MediaPipe and LSTM", "paper_summary": "This research focuses on developing a real-time posture monitoring and risk\nassessment system for manual lifting tasks using advanced AI and computer\nvision technologies. Musculoskeletal disorders (MSDs) are a significant concern\nfor workers involved in manual lifting, and traditional methods for posture\ncorrection are often inadequate due to delayed feedback and lack of\npersonalized assessment. Our proposed solution integrates AI-driven posture\ndetection, detailed keypoint analysis, risk level determination, and real-time\nfeedback delivered through a user-friendly web interface. The system aims to\nimprove posture, reduce the risk of MSDs, and enhance user engagement. The\nresearch involves comprehensive data collection, model training, and iterative\ndevelopment to ensure high accuracy and user satisfaction. The solution's\neffectiveness is evaluated against existing methodologies, demonstrating\nsignificant improvements in real-time feedback and risk assessment. This study\ncontributes to the field by offering a novel approach to posture correction\nthat addresses existing gaps and provides practical, immediate benefits to\nusers.", "paper_summary_zh": "本研究重點在於開發一個使用進階 AI 和電腦視覺技術，用於手動搬運任務的即時姿勢監控和風險評估系統。肌肉骨骼疾病 (MSD) 是從事手動搬運的員工的重要問題，而傳統的姿勢矯正方法通常因為回饋延遲和缺乏個人化評估而不足夠。我們提出的解決方案整合了 AI 驅動的姿勢偵測、詳細關鍵點分析、風險等級判定，以及透過使用者友善的網路介面提供的即時回饋。此系統旨在改善姿勢、降低 MSD 風險，並提升使用者參與度。本研究包含全面的資料收集、模型訓練，以及反覆開發，以確保高準確度和使用者滿意度。此解決方案的有效性會根據現有方法進行評估，證明在即時回饋和風險評估方面有顯著的改善。本研究透過提供一種新的姿勢矯正方法來為此領域做出貢獻，這種方法能解決現有的差距，並為使用者提供實際且立即的益處。", "author": "Ereena Bagga et.al.", "authors": "Ereena Bagga, Ang Yang", "id": "2408.12796v1", "paper_url": "http://arxiv.org/abs/2408.12796v1", "repo": "null"}}