{"2502.04083": {"publish_time": "2025-02-06", "title": "Automatic quantification of breast cancer biomarkers from multiple 18F-FDG PET image segmentation", "paper_summary": "Neoadjuvant chemotherapy (NAC) has become a standard clinical practice for\ntumor downsizing in breast cancer with 18F-FDG Positron Emission Tomography\n(PET). Our work aims to leverage PET imaging for the segmentation of breast\nlesions. The focus is on developing an automated system that accurately\nsegments primary tumor regions and extracts key biomarkers from these areas to\nprovide insights into the evolution of breast cancer following the first course\nof NAC. 243 baseline 18F-FDG PET scans (PET_Bl) and 180 follow-up 18F-FDG PET\nscans (PET_Fu) were acquired before and after the first course of NAC,\nrespectively. Firstly, a deep learning-based breast tumor segmentation method\nwas developed. The optimal baseline model (model trained on baseline exams) was\nfine-tuned on 15 follow-up exams and adapted using active learning to segment\ntumor areas in PET_Fu. The pipeline computes biomarkers such as maximum\nstandardized uptake value (SUVmax), metabolic tumor volume (MTV), and total\nlesion glycolysis (TLG) to evaluate tumor evolution between PET_Fu and PET_Bl.\nQuality control measures were employed to exclude aberrant outliers. The nnUNet\ndeep learning model outperformed in tumor segmentation on PET_Bl, achieved a\nDice similarity coefficient (DSC) of 0.89 and a Hausdorff distance (HD) of 3.52\nmm. After fine-tuning, the model demonstrated a DSC of 0.78 and a HD of 4.95 mm\non PET_Fu exams. Biomarkers analysis revealed very strong correlations whatever\nthe biomarker between manually segmented and automatically predicted regions.\nThe significant average decrease of SUVmax, MTV and TLG were 5.22, 11.79 cm3\nand 19.23 cm3, respectively. The presented approach demonstrates an automated\nsystem for breast tumor segmentation from 18F-FDG PET. Thanks to the extracted\nbiomarkers, our method enables the automatic assessment of cancer progression.", "paper_summary_zh": "新辅助化疗 (NAC) 已成为乳腺癌中采用 18F-FDG 正电子发射断层扫描 (PET) 进行肿瘤缩小的标准临床实践。我们的工作旨在利用 PET 影像分割乳腺病变。重点在于开发一个自动系统，该系统可以准确分割原发性肿瘤区域并从这些区域提取关键生物标记，以深入了解乳腺癌在第一疗程 NAC 后的演变。分别在第一疗程 NAC 之前和之后采集了 243 例基线 18F-FDG PET 扫描 (PET_Bl) 和 180 例随访 18F-FDG PET 扫描 (PET_Fu)。首先，开发了一种基于深度学习的乳腺肿瘤分割方法。对 15 例随访检查对最优基线模型（在基线检查中训练的模型）进行了微调，并使用主动学习对 PET_Fu 中的肿瘤区域进行了分割。该管道计算诸如最大标准摄取值 (SUVmax)、代谢肿瘤体积 (MTV) 和总病灶糖酵解 (TLG) 等生物标记，以评估 PET_Fu 和 PET_Bl 之间的肿瘤演变。采用质量控制措施来排除异常值。nnUNet 深度学习模型在 PET_Bl 上的肿瘤分割方面表现出色，达到 0.89 的 Dice 相似性系数 (DSC) 和 3.52 毫米的 Hausdorff 距离 (HD)。微调后，该模型在 PET_Fu 检查中显示出 0.78 的 DSC 和 4.95 毫米的 HD。无论手动分割区域和自动预测区域之间的生物标记如何，生物标记分析都显示出非常强的相关性。SUVmax、MTV 和 TLG 的平均显着下降分别为 5.22、11.79 cm3 和 19.23 cm3。所提出的方法展示了一个用于从 18F-FDG PET 分割乳腺肿瘤的自动化系统。由于提取了生物标记，我们的方法能够自动评估癌症进展。", "author": "Tewele W. Tareke et.al.", "authors": "Tewele W. Tareke, Neree Payan, Alexandre Cochet, Laurent Arnould, Benoit Presles, Jean-Marc Vrigneaud, Fabrice Meriaudeau, Alain Lalande", "id": "2502.04083v1", "paper_url": "http://arxiv.org/abs/2502.04083v1", "repo": "null"}}