{"2407.05693": {"publish_time": "2024-07-08", "title": "Sub-SA: Strengthen In-context Learning via Submodular Selective Annotation", "paper_summary": "In-context learning (ICL) leverages in-context examples as prompts for the\npredictions of Large Language Models (LLMs). These prompts play a crucial role\nin achieving strong performance. However, the selection of suitable prompts\nfrom a large pool of labeled examples often entails significant annotation\ncosts. To address this challenge, we propose \\textbf{Sub-SA}\n(\\textbf{Sub}modular \\textbf{S}elective \\textbf{A}nnotation), a submodule-based\nselective annotation method. The aim of Sub-SA is to reduce annotation costs\nwhile improving the quality of in-context examples and minimizing the time\nconsumption of the selection process. In Sub-SA, we design a submodular\nfunction that facilitates effective subset selection for annotation and\ndemonstrates the characteristics of monotonically and submodularity from the\ntheoretical perspective. Specifically, we propose \\textbf{RPR} (\\textbf{R}eward\nand \\textbf{P}enalty \\textbf{R}egularization) to better balance the diversity\nand representativeness of the unlabeled dataset attributed to a reward term and\na penalty term, respectively. Consequently, the selection for annotations can\nbe effectively addressed with a simple yet effective greedy search algorithm\nbased on the submodular function. Finally, we apply the similarity prompt\nretrieval to get the examples for ICL.", "paper_summary_zh": "情境學習（ICL）利用情境範例作為提示，用於預測大型語言模型（LLM）。這些提示在實現強大效能方面扮演著至關重要的角色。然而，從大量的標籤範例中選取適當的提示通常需要大量的標註成本。為了應對這個挑戰，我們提出了**Sub-SA**（**子**模組**S**elective **A**nnotation），一種基於子模組的選擇性標註方法。Sub-SA 的目標是降低標註成本，同時提升情境範例的品質，並將選取程序的耗時降至最低。在 Sub-SA 中，我們設計了一個次模組函數，以利於有效地選取標註的子集，並從理論觀點證明了單調性和次模組性的特性。具體來說，我們提出了**RPR**（**R**eward and **P**enalty **R**egularization）以更好地平衡未標籤資料集的多樣性和代表性，分別歸因於獎勵項和懲罰項。因此，可以透過一個基於次模組函數的簡單但有效的貪婪搜尋演算法，有效地解決標註的選取問題。最後，我們應用相似的提示檢索來取得 ICL 的範例。", "author": "Jian Qian et.al.", "authors": "Jian Qian, Miao Sun, Sifan Zhou, Ziyu Zhao, Ruizhi Hun, Patrick Chiang", "id": "2407.05693v1", "paper_url": "http://arxiv.org/abs/2407.05693v1", "repo": "https://github.com/jamesqian11/subsa"}}