{"2408.11861": {"publish_time": "2024-08-16", "title": "Speaking the Same Language: Leveraging LLMs in Standardizing Clinical Data for AI", "paper_summary": "The implementation of Artificial Intelligence (AI) in the healthcare industry\nhas garnered considerable attention, attributable to its prospective\nenhancement of clinical outcomes, expansion of access to superior healthcare,\ncost reduction, and elevation of patient satisfaction. Nevertheless, the\nprimary hurdle that persists is related to the quality of accessible\nmulti-modal healthcare data in conjunction with the evolution of AI\nmethodologies. This study delves into the adoption of large language models to\naddress specific challenges, specifically, the standardization of healthcare\ndata. We advocate the use of these models to identify and map clinical data\nschemas to established data standard attributes, such as the Fast Healthcare\nInteroperability Resources. Our results illustrate that employing large\nlanguage models significantly diminishes the necessity for manual data curation\nand elevates the efficacy of the data standardization process. Consequently,\nthe proposed methodology has the propensity to expedite the integration of AI\nin healthcare, ameliorate the quality of patient care, whilst minimizing the\ntime and financial resources necessary for the preparation of data for AI.", "paper_summary_zh": "人工智慧（AI）在醫療保健產業的實施\n備受關注，這歸因於其預計能\n提升臨床結果、擴展取得優質醫療保健的管道、\n降低成本和提升病患滿意度。儘管如此，\n持續存在的主要障礙與可取得的多模式醫療保健資料品質有關，以及 AI\n方法論的演進。本研究深入探討採用大型語言模型來\n解決特定挑戰，特別是醫療保健\n資料的標準化。我們提倡使用這些模型來識別和對應臨床資料\n架構至已建立的資料標準屬性，例如快速醫療保健\n互通性資源。我們的結果說明採用大型\n語言模型能大幅減少手動資料整理的必要性\n並提升資料標準化程序的效能。因此，\n建議的方法論有能力加速 AI\n在醫療保健的整合，改善病患照護品質，同時將\n準備資料以供 AI 使用所需的時間和財務資源減到最低。", "author": "Arindam Sett et.al.", "authors": "Arindam Sett, Somaye Hashemifar, Mrunal Yadav, Yogesh Pandit, Mohsen Hejrati", "id": "2408.11861v1", "paper_url": "http://arxiv.org/abs/2408.11861v1", "repo": "null"}}