{"2408.09720": {"publish_time": "2024-08-19", "title": "Pedestrian Attribute Recognition: A New Benchmark Dataset and A Large Language Model Augmented Framework", "paper_summary": "Pedestrian Attribute Recognition (PAR) is one of the indispensable tasks in\nhuman-centered research. However, existing datasets neglect different domains\n(e.g., environments, times, populations, and data sources), only conducting\nsimple random splits, and the performance of these datasets has already\napproached saturation. In the past five years, no large-scale dataset has been\nopened to the public. To address this issue, this paper proposes a new\nlarge-scale, cross-domain pedestrian attribute recognition dataset to fill the\ndata gap, termed MSP60K. It consists of 60,122 images and 57 attribute\nannotations across eight scenarios. Synthetic degradation is also conducted to\nfurther narrow the gap between the dataset and real-world challenging\nscenarios. To establish a more rigorous benchmark, we evaluate 17\nrepresentative PAR models under both random and cross-domain split protocols on\nour dataset. Additionally, we propose an innovative Large Language Model (LLM)\naugmented PAR framework, named LLM-PAR. This framework processes pedestrian\nimages through a Vision Transformer (ViT) backbone to extract features and\nintroduces a multi-embedding query Transformer to learn partial-aware features\nfor attribute classification. Significantly, we enhance this framework with LLM\nfor ensemble learning and visual feature augmentation. Comprehensive\nexperiments across multiple PAR benchmark datasets have thoroughly validated\nthe efficacy of our proposed framework. The dataset and source code\naccompanying this paper will be made publicly available at\n\\url{https://github.com/Event-AHU/OpenPAR}.", "paper_summary_zh": "行人屬性辨識 (PAR) 是以人為中心的研究所中不可或缺的任務之一。然而，現有的資料集忽略了不同的領域（例如，環境、時間、族群和資料來源），只進行簡單的隨機分割，而這些資料集的效能已接近飽和。在過去的五年中，沒有大型資料集向公眾開放。為了解決這個問題，本文提出了一個新的、大規模的、跨領域的行人屬性辨識資料集，以填補資料差距，稱為 MSP60K。它包含 60,122 張影像和 57 個屬性註解，橫跨八個場景。合成降級也進行以進一步縮小資料集和現實世界挑戰場景之間的差距。為了建立更嚴謹的基準，我們在我們的資料集上，在隨機和跨領域分割協定的情況下，評估 17 個具代表性的 PAR 模型。此外，我們提出了一個創新的大型語言模型 (LLM) 增強 PAR 框架，稱為 LLM-PAR。此框架透過 Vision Transformer (ViT) 主幹處理行人影像以提取特徵，並引入多嵌入查詢 Transformer 來學習部分感知特徵以進行屬性分類。重要的是，我們透過 LLM 增強此框架以進行整體學習和視覺特徵增強。跨多個 PAR 基準資料集的綜合實驗已徹底驗證了我們提出的框架的效能。本文附帶的資料集和原始碼將在 \\url{https://github.com/Event-AHU/OpenPAR} 公開。", "author": "Jiandong Jin et.al.", "authors": "Jiandong Jin, Xiao Wang, Qian Zhu, Haiyang Wang, Chenglong Li", "id": "2408.09720v1", "paper_url": "http://arxiv.org/abs/2408.09720v1", "repo": "https://github.com/event-ahu/openpar"}}