{"2410.21272": {"publish_time": "2024-10-28", "title": "Arithmetic Without Algorithms: Language Models Solve Math With a Bag of Heuristics", "paper_summary": "Do large language models (LLMs) solve reasoning tasks by learning robust\ngeneralizable algorithms, or do they memorize training data? To investigate\nthis question, we use arithmetic reasoning as a representative task. Using\ncausal analysis, we identify a subset of the model (a circuit) that explains\nmost of the model's behavior for basic arithmetic logic and examine its\nfunctionality. By zooming in on the level of individual circuit neurons, we\ndiscover a sparse set of important neurons that implement simple heuristics.\nEach heuristic identifies a numerical input pattern and outputs corresponding\nanswers. We hypothesize that the combination of these heuristic neurons is the\nmechanism used to produce correct arithmetic answers. To test this, we\ncategorize each neuron into several heuristic types-such as neurons that\nactivate when an operand falls within a certain range-and find that the\nunordered combination of these heuristic types is the mechanism that explains\nmost of the model's accuracy on arithmetic prompts. Finally, we demonstrate\nthat this mechanism appears as the main source of arithmetic accuracy early in\ntraining. Overall, our experimental results across several LLMs show that LLMs\nperform arithmetic using neither robust algorithms nor memorization; rather,\nthey rely on a \"bag of heuristics\".", "paper_summary_zh": "大型語言模型 (LLM) 透過學習強健且可概化的演算法來解決推理任務，還是記住訓練資料？為了探討這個問題，我們使用算術推理作為一個代表性的任務。透過因果分析，我們找出模型的一個子集（一個電路），它解釋了模型大部分的行為，用於基本的算術邏輯，並檢查它的功能。透過縮放至個別電路神經元的層級，我們發現一組稀疏的重要神經元，它們實作了簡單的啟發法。每個啟發法會找出一個數值輸入模式，並輸出對應的答案。我們假設這些啟發法神經元的組合是產生正確算術答案的機制。為了測試這一點，我們將每個神經元分類成數個啟發法類型，例如在運算元落在某個範圍內時會啟動的神經元，並發現這些啟發法類型的無序組合是解釋模型在算術提示上大部分準確度的機制。最後，我們展示這個機制在訓練早期會出現為算術準確度的主要來源。整體而言，我們在多個 LLM 上的實驗結果顯示，LLM 執行算術時既不使用強健的演算法，也不使用記憶；相反地，它們依賴於「啟發法組合」。", "author": "Yaniv Nikankin et.al.", "authors": "Yaniv Nikankin, Anja Reusch, Aaron Mueller, Yonatan Belinkov", "id": "2410.21272v1", "paper_url": "http://arxiv.org/abs/2410.21272v1", "repo": "null"}}