{"2405.07282": {"publish_time": "2024-05-12", "title": "Branching Narratives: Character Decision Points Detection", "paper_summary": "This paper presents the Character Decision Points Detection (CHADPOD) task, a\ntask of identification of points within narratives where characters make\ndecisions that may significantly influence the story's direction. We propose a\nnovel dataset based on CYOA-like games graphs to be used as a benchmark for\nsuch a task. We provide a comparative analysis of different models' performance\non this task, including a couple of LLMs and several MLMs as baselines,\nachieving up to 89% accuracy. This underscores the complexity of narrative\nanalysis, showing the challenges associated with understanding character-driven\nstory dynamics. Additionally, we show how such a model can be applied to the\nexisting text to produce linear segments divided by potential branching points,\ndemonstrating the practical application of our findings in narrative analysis.", "paper_summary_zh": "本文提出角色決策點偵測 (CHADPOD) 任務，此任務為在敘事中識別角色做出可能顯著影響故事走向的決策之點。我們提出一個基於類似選擇你自己的冒險 (CYOA) 遊戲圖表的創新資料集，可用作此類任務的基準。我們提供不同模型在這個任務上的效能比較分析，包括幾個 LLM 和幾個 MLM 作為基準，準確率高達 89%。這強調了敘事分析的複雜性，顯示出理解角色驅動的故事動態所面臨的挑戰。此外，我們展示如何將此類模型應用於現有文字，以產生由潛在分支點劃分的線性區段，證明我們的研究結果在敘事分析中的實際應用。", "author": "Alexey Tikhonov et.al.", "authors": "Alexey Tikhonov", "id": "2405.07282v1", "paper_url": "http://arxiv.org/abs/2405.07282v1", "repo": "null"}}