{"2501.08925": {"publish_time": "2025-01-15", "title": "Disentangling Exploration of Large Language Models by Optimal Exploitation", "paper_summary": "Exploration is a crucial skill for self-improvement and open-ended\nproblem-solving. However, it remains uncertain whether large language models\ncan effectively explore the state-space. Existing evaluations predominantly\nfocus on the trade-off between exploration and exploitation, often assessed in\nmulti-armed bandit problems. In contrast, this work isolates exploration as the\nsole objective, tasking the agent with delivering information that enhances\nfuture returns. For the evaluation, we propose to decompose missing rewards\ninto exploration and exploitation components by measuring the optimal\nachievable return for the states already explored. Our experiments with various\nLLMs reveal that most models struggle to sufficiently explore the state-space\nand that weak exploration is insufficient. We observe a positive correlation\nbetween model size and exploration performance, with larger models\ndemonstrating superior capabilities. Furthermore, we show that our\ndecomposition provides insights into differences in behaviors driven by agent\ninstructions during prompt engineering, offering a valuable tool for refining\nLLM performance in exploratory tasks.", "paper_summary_zh": "探索是自我提升和開放式問題解決的關鍵技能。然而，大型語言模型是否能有效探索狀態空間仍不確定。現有的評估主要關注探索和利用之間的權衡，通常在多臂賭徒問題中進行評估。相反，這項工作將探索孤立為唯一目標，賦予代理人提供增強未來回報的資訊的任務。對於評估，我們建議將遺失的獎勵分解為探索和利用組成，方法是測量已探索狀態的可實現最佳回報。我們對各種 LLM 的實驗表明，大多數模型難以充分探索狀態空間，並且探索不足。我們觀察到模型大小和探索性能之間存在正相關，較大的模型表現出更強的能力。此外，我們表明我們的分解提供了對提示工程過程中代理指令驅動的行為差異的見解，為改進探索性任務中的 LLM 性能提供了一個有價值的工具。", "author": "Tim Grams et.al.", "authors": "Tim Grams, Patrick Betz, Christian Bartelt", "id": "2501.08925v1", "paper_url": "http://arxiv.org/abs/2501.08925v1", "repo": "null"}}