{"2412.12679": {"publish_time": "2024-12-17", "title": "Detecting Document-level Paraphrased Machine Generated Content: Mimicking Human Writing Style and Involving Discourse Features", "paper_summary": "The availability of high-quality APIs for Large Language Models (LLMs) has\nfacilitated the widespread creation of Machine-Generated Content (MGC), posing\nchallenges such as academic plagiarism and the spread of misinformation.\nExisting MGC detectors often focus solely on surface-level information,\noverlooking implicit and structural features. This makes them susceptible to\ndeception by surface-level sentence patterns, particularly for longer texts and\nin texts that have been subsequently paraphrased.\n  To overcome these challenges, we introduce novel methodologies and datasets.\nBesides the publicly available dataset Plagbench, we developed the paraphrased\nLong-Form Question and Answer (paraLFQA) and paraphrased Writing Prompts\n(paraWP) datasets using GPT and DIPPER, a discourse paraphrasing tool, by\nextending artifacts from their original versions. To address the challenge of\ndetecting highly similar paraphrased texts, we propose MhBART, an\nencoder-decoder model designed to emulate human writing style while\nincorporating a novel difference score mechanism. This model outperforms strong\nclassifier baselines and identifies deceptive sentence patterns. To better\ncapture the structure of longer texts at document level, we propose\nDTransformer, a model that integrates discourse analysis through PDTB\npreprocessing to encode structural features. It results in substantial\nperformance gains across both datasets -- 15.5\\% absolute improvement on\nparaLFQA, 4\\% absolute improvement on paraWP, and 1.5\\% absolute improvement on\nM4 compared to SOTA approaches.", "paper_summary_zh": "大型語言模型 (LLM) 的高品質 API 的可用性促進了機器生成內容 (MGC) 的廣泛創建，這對學術剽竊和錯誤訊息的散布構成了挑戰。現有的 MGC 偵測器通常只專注於表面層級的資訊，忽略了隱含和結構特徵。這使得它們容易被表面層級的句子模式所欺騙，特別是對於較長的文字和經過重新改寫的文字。\n為了克服這些挑戰，我們引入了創新的方法和資料集。除了公開的資料集 Plagbench 之外，我們還使用了 GPT 和 DIPPER（一種語篇改寫工具）開發了改寫的長篇問答 (paraLFQA) 和改寫的寫作提示 (paraWP) 資料集，方法是擴充其原始版本的成品。為了應對偵測高度相似改寫文字的挑戰，我們提出了 MhBART，這是一種編碼器-解碼器模型，旨在模擬人類的寫作風格，同時納入一種新穎的差異分數機制。此模型優於強大的分類器基準，並識別出具有欺騙性的句子模式。為了更好地擷取文件層級較長文字的結構，我們提出了 DTransformer，這是一種透過 PDTB 預處理整合語篇分析以編碼結構特徵的模型。與 SOTA 方法相比，它在兩個資料集上都產生了顯著的效能提升——在 paraLFQA 上提升了 15.5% 的絕對值，在 paraWP 上提升了 4% 的絕對值，在 M4 上提升了 1.5% 的絕對值。", "author": "Yupei Li et.al.", "authors": "Yupei Li, Manuel Milling, Lucia Specia, Björn W. Schuller", "id": "2412.12679v1", "paper_url": "http://arxiv.org/abs/2412.12679v1", "repo": "null"}}