{"2409.18768": {"publish_time": "2024-09-27", "title": "Learning from Demonstration with Implicit Nonlinear Dynamics Models", "paper_summary": "Learning from Demonstration (LfD) is a useful paradigm for training policies\nthat solve tasks involving complex motions. In practice, the successful\napplication of LfD requires overcoming error accumulation during policy\nexecution, i.e. the problem of drift due to errors compounding over time and\nthe consequent out-of-distribution behaviours. Existing works seek to address\nthis problem through scaling data collection, correcting policy errors with a\nhuman-in-the-loop, temporally ensembling policy predictions or through learning\nthe parameters of a dynamical system model. In this work, we propose and\nvalidate an alternative approach to overcoming this issue. Inspired by\nreservoir computing, we develop a novel neural network layer that includes a\nfixed nonlinear dynamical system with tunable dynamical properties. We validate\nthe efficacy of our neural network layer on the task of reproducing human\nhandwriting motions using the LASA Human Handwriting Dataset. Through empirical\nexperiments we demonstrate that incorporating our layer into existing neural\nnetwork architectures addresses the issue of compounding errors in LfD.\nFurthermore, we perform a comparative evaluation against existing approaches\nincluding a temporal ensemble of policy predictions and an Echo State Networks\n(ESNs) implementation. We find that our approach yields greater policy\nprecision and robustness on the handwriting task while also generalising to\nmultiple dynamics regimes and maintaining competitive latency scores.", "paper_summary_zh": "從示範中學習 (LfD) 是用於訓練處理涉及複雜動作任務的策略的一個有用的範例。在實務上，LfD 的成功應用需要克服策略執行期間的錯誤累積，也就是說，隨著時間推移，錯誤會複雜化，並導致後續的非分佈行為。現有的作品試圖透過擴大資料收集、透過人工參與迴圈來修正策略錯誤、暫時組合策略預測或透過學習動態系統模型的參數來解決此問題。在這項工作中，我們提出並驗證了克服此問題的替代方法。受到儲存器運算的啟發，我們開發了一個新穎的神經網路層，其中包括一個具有可調整動態特性的固定非線性動態系統。我們在使用 LASA 人類手寫資料集重現人類手寫動作的任務上驗證了我們的神經網路層的效能。透過經驗實驗，我們證明將我們的層納入現有的神經網路架構可以解決 LfD 中的複合錯誤問題。此外，我們針對現有方法，包括策略預測的暫時組合和迴音狀態網路 (ESN) 實作，進行了比較評估。我們發現，我們的做法在手寫任務上產生了更高的策略精確度和穩健性，同時也概括到多個動態模式，並維持有競爭力的延遲分數。", "author": "Peter David Fagan et.al.", "authors": "Peter David Fagan, Subramanian Ramamoorthy", "id": "2409.18768v1", "paper_url": "http://arxiv.org/abs/2409.18768v1", "repo": "null"}}