{"2502.15538": {"publish_time": "2025-02-21", "title": "SOTOPIA-Ω: Dynamic Strategy Injection Learning and Social Instrucion Following Evaluation for Social Agents", "paper_summary": "Despite the abundance of prior social strategies possessed by humans, there\nremains a paucity of research dedicated to their transfer and integration into\nsocial agents. Our proposed SOTOPIA-{\\Omega} framework aims to address and\nbridge this gap, with a particular focus on enhancing the social capabilities\nof language agents. This framework dynamically injects multi-step reasoning\nstrategies inspired by negotiation theory, along with two simple direct\nstrategies, into expert agents, thereby automating the construction of\nhigh-quality social dialogue training corpus. Additionally, we introduce the\nconcept of Social Instruction Following (S-IF) and propose two new S-IF\nevaluation metrics that are complementary to social capability. We demonstrate\nthat several 7B models trained on high-quality corpus not only significantly\nsurpass the expert agent (GPT-4) in achieving social goals but also enhance\nS-IF performance. Analysis and variant experiments validate the advantages of\ndynamic construction, which can especially break the agent's prolonged\ndeadlock.", "paper_summary_zh": "儘管人類擁有豐富的既有社交策略，但鮮少有研究致力於將其轉移並整合到社交代理中。我們提出的 SOTOPIA-{\\Omega} 架構旨在解決並彌補這個差距，特別著重於增強語言代理的社交能力。此架構將靈感來自協商理論的多步驟推理策略，以及兩個簡單的直接策略，動態注入到專家代理中，從而自動建構高品質的社交對話訓練語料庫。此外，我們引入了社交指令遵循 (S-IF) 的概念，並提出了兩個新的 S-IF 評量指標，作為社交能力的補充。我們證明了幾個在高品質語料庫上訓練的 7B 模型，不僅在達成社交目標方面顯著超越專家代理 (GPT-4)，也提升了 S-IF 的表現。分析和變異實驗驗證了動態建構的優點，特別可以打破代理的長期僵局。", "author": "Wenyuan Zhang et.al.", "authors": "Wenyuan Zhang, Tianyun Liu, Mengxiao Song, Xiaodong Li, Tingwen Liu", "id": "2502.15538v1", "paper_url": "http://arxiv.org/abs/2502.15538v1", "repo": "null"}}