{"2407.20891": {"publish_time": "2024-07-30", "title": "Bayesian Low-Rank LeArning (Bella): A Practical Approach to Bayesian Neural Networks", "paper_summary": "Computational complexity of Bayesian learning is impeding its adoption in\npractical, large-scale tasks. Despite demonstrations of significant merits such\nas improved robustness and resilience to unseen or out-of-distribution inputs\nover their non- Bayesian counterparts, their practical use has faded to near\ninsignificance. In this study, we introduce an innovative framework to mitigate\nthe computational burden of Bayesian neural networks (BNNs). Our approach\nfollows the principle of Bayesian techniques based on deep ensembles, but\nsignificantly reduces their cost via multiple low-rank perturbations of\nparameters arising from a pre-trained neural network. Both vanilla version of\nensembles as well as more sophisticated schemes such as Bayesian learning with\nStein Variational Gradient Descent (SVGD), previously deemed impractical for\nlarge models, can be seamlessly implemented within the proposed framework,\ncalled Bayesian Low-Rank LeArning (Bella). In a nutshell, i) Bella achieves a\ndramatic reduction in the number of trainable parameters required to\napproximate a Bayesian posterior; and ii) it not only maintains, but in some\ninstances, surpasses the performance of conventional Bayesian learning methods\nand non-Bayesian baselines. Our results with large-scale tasks such as\nImageNet, CAMELYON17, DomainNet, VQA with CLIP, LLaVA demonstrate the\neffectiveness and versatility of Bella in building highly scalable and\npractical Bayesian deep models for real-world applications.", "paper_summary_zh": "貝氏學習的計算複雜度阻礙了它在實用、大規模任務中的採用。儘管展示了顯著的優點，例如提高了對未見或分佈外輸入的穩健性和韌性，但與非貝氏對應物相比，它們的實際使用已逐漸變得微不足道。在本研究中，我們引入了一個創新的框架來減輕貝氏神經網路 (BNN) 的計算負擔。我們的做法遵循基於深度合奏的貝氏技術原理，但透過對預先訓練的神經網路產生的參數進行多重低秩擾動，大幅降低其成本。合奏的香草版本以及更複雜的方案，例如使用 Stein 變分梯度下降 (SVGD) 的貝氏學習，以前被認為不適用於大型模型，可以在稱為貝氏低秩學習 (Bella) 的提議框架中無縫實作。簡而言之，i) Bella 大幅減少了近似貝氏後驗所需的訓練參數數量；ii) 它不僅維持，而且在某些情況下，超越了傳統貝氏學習方法和非貝氏基線的效能。我們在 ImageNet、CAMELYON17、DomainNet、VQA with CLIP、LLaVA 等大型任務中的結果證明了 Bella 在建立高度可擴充且實用的貝氏深度模型以進行真實世界應用方面的有效性和多功能性。", "author": "Bao Gia Doan et.al.", "authors": "Bao Gia Doan, Afshar Shamsi, Xiao-Yu Guo, Arash Mohammadi, Hamid Alinejad-Rokny, Dino Sejdinovic, Damith C. Ranasinghe, Ehsan Abbasnejad", "id": "2407.20891v1", "paper_url": "http://arxiv.org/abs/2407.20891v1", "repo": "null"}}