{"2502.14302": {"publish_time": "2025-02-20", "title": "MedHallu: A Comprehensive Benchmark for Detecting Medical Hallucinations in Large Language Models", "paper_summary": "Advancements in Large Language Models (LLMs) and their increasing use in\nmedical question-answering necessitate rigorous evaluation of their\nreliability. A critical challenge lies in hallucination, where models generate\nplausible yet factually incorrect outputs. In the medical domain, this poses\nserious risks to patient safety and clinical decision-making. To address this,\nwe introduce MedHallu, the first benchmark specifically designed for medical\nhallucination detection. MedHallu comprises 10,000 high-quality question-answer\npairs derived from PubMedQA, with hallucinated answers systematically generated\nthrough a controlled pipeline. Our experiments show that state-of-the-art LLMs,\nincluding GPT-4o, Llama-3.1, and the medically fine-tuned UltraMedical,\nstruggle with this binary hallucination detection task, with the best model\nachieving an F1 score as low as 0.625 for detecting \"hard\" category\nhallucinations. Using bidirectional entailment clustering, we show that\nharder-to-detect hallucinations are semantically closer to ground truth.\nThrough experiments, we also show incorporating domain-specific knowledge and\nintroducing a \"not sure\" category as one of the answer categories improves the\nprecision and F1 scores by up to 38% relative to baselines.", "paper_summary_zh": "大型語言模型 (LLM) 的進步及其在醫療問答中的使用日益增加，因此需要嚴格評估其可靠性。一個關鍵的挑戰在於幻覺，模型會產生看似合理但事實上不正確的輸出。在醫療領域，這對患者安全和臨床決策構成嚴重風險。為了解決此問題，我們推出了 MedHallu，這是第一個專門設計用於檢測醫療幻覺的基準。MedHallu 包含 10,000 個從 PubMedQA 衍生的高品質問答對，並透過受控管道系統性地產生幻覺答案。我們的實驗顯示，包括 GPT-4o、Llama-3.1 和經過醫學微調的 UltraMedical 在內的最新 LLM 難以執行這個二元幻覺檢測任務，最佳模型在檢測「困難」類別幻覺時達到的 F1 分數低至 0.625。使用雙向蘊涵聚類，我們表明較難檢測的幻覺在語義上更接近真實。透過實驗，我們還表明，納入特定領域的知識並將「不確定」類別作為其中一個答案類別，可以將精確度和 F1 分數相對於基線提高多達 38%。", "author": "Shrey Pandit et.al.", "authors": "Shrey Pandit, Jiawei Xu, Junyuan Hong, Zhangyang Wang, Tianlong Chen, Kaidi Xu, Ying Ding", "id": "2502.14302v1", "paper_url": "http://arxiv.org/abs/2502.14302v1", "repo": "null"}}