{"2406.19931": {"publish_time": "2024-06-28", "title": "Decoupling General and Personalized Knowledge in Federated Learning via Additive and Low-Rank Decomposition", "paper_summary": "To address data heterogeneity, the key strategy of Personalized Federated\nLearning (PFL) is to decouple general knowledge (shared among clients) and\nclient-specific knowledge, as the latter can have a negative impact on\ncollaboration if not removed. Existing PFL methods primarily adopt a parameter\npartitioning approach, where the parameters of a model are designated as one of\ntwo types: parameters shared with other clients to extract general knowledge\nand parameters retained locally to learn client-specific knowledge. However, as\nthese two types of parameters are put together like a jigsaw puzzle into a\nsingle model during the training process, each parameter may simultaneously\nabsorb both general and client-specific knowledge, thus struggling to separate\nthe two types of knowledge effectively. In this paper, we introduce FedDecomp,\na simple but effective PFL paradigm that employs parameter additive\ndecomposition to address this issue. Instead of assigning each parameter of a\nmodel as either a shared or personalized one, FedDecomp decomposes each\nparameter into the sum of two parameters: a shared one and a personalized one,\nthus achieving a more thorough decoupling of shared and personalized knowledge\ncompared to the parameter partitioning method. In addition, as we find that\nretaining local knowledge of specific clients requires much lower model\ncapacity compared with general knowledge across all clients, we let the matrix\ncontaining personalized parameters be low rank during the training process.\nMoreover, a new alternating training strategy is proposed to further improve\nthe performance. Experimental results across multiple datasets and varying\ndegrees of data heterogeneity demonstrate that FedDecomp outperforms\nstate-of-the-art methods up to 4.9\\%.", "paper_summary_zh": "<paragraph>為了處理資料異質性，個人化聯邦學習 (PFL) 的關鍵策略是將一般知識 (在客戶端之間共享) 和客戶端特定的知識分開，因為後者如果沒有移除，可能會對協作產生負面影響。現有的 PFL 方法主要採用參數分割方法，其中模型的參數被指定為兩種類型之一：與其他客戶端共享以提取一般知識的參數和保留在本地以學習客戶端特定知識的參數。然而，由於這兩種類型的參數在訓練過程中會像拼圖一樣組合成單一模型，因此每個參數可能會同時吸收一般和客戶端特定的知識，從而難以有效地將這兩種知識類型分開。在本文中，我們介紹了 FedDecomp，這是一個簡單但有效的 PFL 典範，採用參數加法分解來解決此問題。FedDecomp 沒有將模型的每個參數指定為共享參數或個人化參數，而是將每個參數分解為兩個參數的總和：共享參數和個人化參數，從而實現了與參數分割方法相比更徹底的共享和個人化知識解耦。此外，由於我們發現保留特定客戶端的本地知識所需的模型容量遠低於所有客戶端的一般知識，因此我們讓包含個人化參數的矩陣在訓練過程中保持低秩。此外，提出了一種新的交替訓練策略，以進一步提高性能。跨多個資料集和不同程度資料異質性的實驗結果證明，FedDecomp 的效能優於最先進的方法，最高可達 4.9%。</paragraph>", "author": "Xinghao Wu et.al.", "authors": "Xinghao Wu, Xuefeng Liu, Jianwei Niu, Haolin Wang, Shaojie Tang, Guogang Zhu, Hao Su", "id": "2406.19931v1", "paper_url": "http://arxiv.org/abs/2406.19931v1", "repo": "null"}}