{"2409.11605": {"publish_time": "2024-09-17", "title": "Harnessing AI data-driven global weather models for climate attribution: An analysis of the 2017 Oroville Dam extreme atmospheric river", "paper_summary": "AI data-driven models (Graphcast, Pangu Weather, Fourcastnet, and SFNO) are\nexplored for storyline-based climate attribution due to their short inference\ntimes, which can accelerate the number of events studied, and provide real time\nattributions when public attention is heightened. The analysis is framed on the\nextreme atmospheric river episode of February 2017 that contributed to the\nOroville dam spillway incident in Northern California. Past and future\nsimulations are generated by perturbing the initial conditions with the\npre-industrial and the late-21st century temperature climate change signals,\nrespectively. The simulations are compared to results from a dynamical model\nwhich represents plausible pseudo-realities under both climate environments.\nOverall, the AI models show promising results, projecting a 5-6 % increase in\nthe integrated water vapor over the Oroville dam in the present day compared to\nthe pre-industrial, in agreement with the dynamical model. Different\ngeopotential-moisture-temperature dependencies are unveiled for each of the\nAI-models tested, providing valuable information for understanding the\nphysicality of the attribution response. However, the AI models tend to\nsimulate weaker attribution values than the pseudo-reality imagined by the\ndynamical model, suggesting some reduced extrapolation skill, especially for\nthe late-21st century regime. Large ensembles generated with an AI model (>500\nmembers) produced statistically significant present-day to pre-industrial\nattribution results, unlike the >20-member ensemble from the dynamical model.\nThis analysis highlights the potential of AI models to conduct attribution\nanalysis, while emphasizing future lines of work on explainable artificial\nintelligence to gain confidence in these tools, which can enable reliable\nattribution studies in real-time.", "paper_summary_zh": "<paragraph>由於 AI 資料驅動模式（Graphcast、Pangu Weather、Fourcastnet 和 SFNO）推論時間短，因此可探索用於基於故事情節的氣候歸因，這可以加速研究事件數量，並在公眾關注度提高時提供實時歸因。分析基於 2017 年 2 月極端大氣河流事件，該事件導致了北加州奧羅維爾大壩溢洪道事件。通過分別用前工業時代和 21 世紀末的溫度氣候變化信號擾動初始條件，產生過去和未來的模擬。將模擬與動態模型的結果進行比較，該模型表示在兩種氣候環境下的合理偽現實。總體而言，AI 模型顯示出有希望的結果，預測與前工業時代相比，當今奧羅維爾大壩上的積分水汽增加 5-6%，與動態模型一致。揭示了每個測試的 AI 模型不同的地勢能-水分-溫度依賴性，為理解歸因響應的物理性提供了有價值的信息。然而，AI 模型傾向於模擬比動態模型想像的偽現實更弱的歸因值，這表明一些外推技能降低了，特別是對於 21 世紀末的狀態。使用 AI 模型生成的大型集合（>500 個成員）產生了統計上顯著的當前到前工業時代的歸因結果，這與動態模型的 >20 個成員集合不同。該分析強調了 AI 模型進行歸因分析的潛力，同時強調了對可解釋人工智能的未來工作線，以增強對這些工具的信心，從而能夠實時進行可靠的歸因研究。</paragraph>", "author": "Jorge Baño-Medina et.al.", "authors": "Jorge Baño-Medina, Agniv Sengupta, Allison Michaelis, Luca Delle Monache, Julie Kalansky, Duncan Watson-Parris", "id": "2409.11605v1", "paper_url": "http://arxiv.org/abs/2409.11605v1", "repo": "null"}}