{"2502.15264": {"publish_time": "2025-02-21", "title": "Retrieval-Augmented Speech Recognition Approach for Domain Challenges", "paper_summary": "Speech recognition systems often face challenges due to domain mismatch,\nparticularly in real-world applications where domain-specific data is\nunavailable because of data accessibility and confidentiality constraints.\nInspired by Retrieval-Augmented Generation (RAG) techniques for large language\nmodels (LLMs), this paper introduces a LLM-based retrieval-augmented speech\nrecognition method that incorporates domain-specific textual data at the\ninference stage to enhance recognition performance. Rather than relying on\ndomain-specific textual data during the training phase, our model is trained to\nlearn how to utilize textual information provided in prompts for LLM decoder to\nimprove speech recognition performance. Benefiting from the advantages of the\nRAG retrieval mechanism, our approach efficiently accesses locally available\ndomain-specific documents, ensuring a convenient and effective process for\nsolving domain mismatch problems. Experiments conducted on the CSJ database\ndemonstrate that the proposed method significantly improves speech recognition\naccuracy and achieves state-of-the-art results on the CSJ dataset, even without\nrelying on the full training data.", "paper_summary_zh": "語音辨識系統通常會因為領域不符而面臨挑戰，特別是在實際的應用中，因為資料取得和機密限制，無法取得特定領域的資料。本論文受到大型語言模型（LLM）的檢索增強生成（RAG）技術啟發，介紹了一種基於 LLM 的檢索增強語音辨識方法，它在推論階段納入了特定領域的文字資料，以增強辨識效能。我們的模型並非在訓練階段依賴特定領域的文字資料，而是訓練模型學習如何利用提示中提供的文字資訊，以改善 LLM 解碼器的語音辨識效能。我們的做法受益於 RAG 檢索機制的優點，能有效存取當地可用的特定領域文件，確保解決領域不符問題的過程既便利又有效。在 CSJ 資料庫上進行的實驗證明，所提出的方法大幅改善了語音辨識的準確度，即使不依賴完整的訓練資料，也能在 CSJ 資料集上達成最先進的結果。", "author": "Peng Shen et.al.", "authors": "Peng Shen, Xugang Lu, Hisashi Kawai", "id": "2502.15264v1", "paper_url": "http://arxiv.org/abs/2502.15264v1", "repo": "null"}}