{"2407.04693": {"publish_time": "2024-07-05", "title": "ANAH-v2: Scaling Analytical Hallucination Annotation of Large Language Models", "paper_summary": "Large language models (LLMs) exhibit hallucinations in long-form\nquestion-answering tasks across various domains and wide applications. Current\nhallucination detection and mitigation datasets are limited in domains and\nsizes, which struggle to scale due to prohibitive labor costs and insufficient\nreliability of existing hallucination annotators. To facilitate the scalable\noversight of LLM hallucinations, this paper introduces an iterative\nself-training framework that simultaneously and progressively scales up the\nhallucination annotation dataset and improves the accuracy of the hallucination\nannotator. Based on the Expectation Maximization (EM) algorithm, in each\niteration, the framework first applies a hallucination annotation pipeline to\nannotate a scaled dataset and then trains a more accurate hallucination\nannotator on the dataset. This new hallucination annotator is adopted in the\nhallucination annotation pipeline used for the next iteration. Extensive\nexperimental results demonstrate that the finally obtained hallucination\nannotator with only 7B parameters surpasses the performance of GPT-4 and\nobtains new state-of-the-art hallucination detection results on HaluEval and\nHalluQA by zero-shot inference. Such an annotator can not only evaluate the\nhallucination levels of various LLMs on the large-scale dataset but also help\nto mitigate the hallucination of LLMs generations, with the Natural Language\nInference (NLI) metric increasing from 25% to 37% on HaluEval.", "paper_summary_zh": "大型語言模型 (LLM) 在各種領域和廣泛應用中表現出長篇問答任務中的幻覺。當前的幻覺檢測和緩解數據集在領域和規模上受到限制，由於高昂的人工成本和現有幻覺註解器的可靠性不足，因此難以擴展。為了促進 LLM 幻覺的可擴展監督，本文介紹了一個迭代自訓練框架，該框架同時且逐步擴展幻覺註解數據集並提高幻覺註解器的準確性。基於期望最大化 (EM) 演算法，在每次迭代中，該框架首先應用幻覺註解管道來註解一個縮放的數據集，然後在數據集上訓練一個更準確的幻覺註解器。這個新的幻覺註解器被採用在用於下一次迭代的幻覺註解管道中。大量的實驗結果表明，最終獲得的幻覺註解器只有 7B 參數，就超過了 GPT-4 的性能，並通過零次學習推理在 HaluEval 和 HalluQA 上獲得了新的最先進的幻覺檢測結果。這樣的註解器不僅可以評估各種 LLM 在大型數據集上的幻覺等級，還可以幫助減輕 LLM 生成的幻覺，自然語言推理 (NLI) 指標從 HaluEval 上的 25% 增加到 37%。", "author": "Yuzhe Gu et.al.", "authors": "Yuzhe Gu, Ziwei Ji, Wenwei Zhang, Chengqi Lyu, Dahua Lin, Kai Chen", "id": "2407.04693v1", "paper_url": "http://arxiv.org/abs/2407.04693v1", "repo": "null"}}