{"2410.16091": {"publish_time": "2024-10-21", "title": "Neural Quantum Propagators for Driven-Dissipative Quantum Dynamics", "paper_summary": "Describing the dynamics of strong-laser driven open quantum systems is a very\nchallenging task that requires the solution of highly involved equations of\nmotion. While machine learning techniques are being applied with some success\nto simulate the time evolution of individual quantum states, their use to\napproximate time-dependent operators (that can evolve various states) remains\nlargely unexplored. In this work, we develop driven neural quantum propagators\n(NQP), a universal neural network framework that solves driven-dissipative\nquantum dynamics by approximating propagators rather than wavefunctions or\ndensity matrices. NQP can handle arbitrary initial quantum states, adapt to\nvarious external fields, and simulate long-time dynamics, even when trained on\nfar shorter time windows. Furthermore, by appropriately configuring the\nexternal fields, our trained NQP can be transferred to systems governed by\ndifferent Hamiltonians. We demonstrate the effectiveness of our approach by\nstudying the spin-boson and the three-state transition Gamma models.", "paper_summary_zh": "描述強雷射驅動開放量子系統的動力學是一個非常具有挑戰性的任務，需要求解高度複雜的運動方程式。儘管機器學習技術已成功應用於模擬個別量子態的時間演化，但其用於近似時間相關算符（可演化各種態）的用途仍未被廣泛探討。在這項工作中，我們開發了驅動神經量子傳播器 (NQP)，這是一種通用的神經網路架構，透過近似傳播器，而不是波函數或密度矩陣，來求解驅動耗散量子動力學。NQP 可以處理任意初始量子態，適應各種外場，並模擬長時間動力學，即使是在遠短時間窗上訓練時也是如此。此外，透過適當地配置外場，我們訓練好的 NQP 可以轉移到受不同哈密頓量支配的系統。我們透過研究自旋玻色子和三態轉換 Gamma 模型來證明我們方法的有效性。", "author": "Jiaji Zhang et.al.", "authors": "Jiaji Zhang, Carlos L. Benavides-Riveros, Lipeng Chen", "id": "2410.16091v1", "paper_url": "http://arxiv.org/abs/2410.16091v1", "repo": "null"}}