{"2406.18856": {"publish_time": "2024-06-27", "title": "FFN: a Fine-grained Chinese-English Financial Domain Parallel Corpus", "paper_summary": "Large Language Models (LLMs) have stunningly advanced the field of machine\ntranslation, though their effectiveness within the financial domain remains\nlargely underexplored. To probe this issue, we constructed a fine-grained\nChinese-English parallel corpus of financial news called FFN. We acquired\nfinancial news articles spanning between January 1st, 2014, to December 31,\n2023, from mainstream media websites such as CNN, FOX, and China Daily. The\ndataset consists of 1,013 main text and 809 titles, all of which have been\nmanually corrected. We measured the translation quality of two LLMs -- ChatGPT\nand ERNIE-bot, utilizing BLEU, TER and chrF scores as the evaluation metrics.\nFor comparison, we also trained an OpenNMT model based on our dataset. We\ndetail problems of LLMs and provide in-depth analysis, intending to stimulate\nfurther research and solutions in this largely uncharted territory. Our\nresearch underlines the need to optimize LLMs within the specific field of\nfinancial translation to ensure accuracy and quality.", "paper_summary_zh": "大型語言模型 (LLM) 驚人地推進了機器翻譯領域，儘管它們在金融領域的有效性在很大程度上仍未得到探索。為了探討這個問題，我們構建了一個細粒度的中英平行語料庫，稱為 FFN。我們從 CNN、FOX 和中國日報等主流媒體網站獲取了從 2014 年 1 月 1 日到 2023 年 12 月 31 日的財經新聞文章。該數據集包含 1,013 篇正文和 809 個標題，所有這些都已手動更正。我們使用 BLEU、TER 和 chrF 分數作為評估指標，測量了兩個 LLM（ChatGPT 和 ERNIE-bot）的翻譯質量。為了進行比較，我們還根據我們的數據集訓練了一個 OpenNMT 模型。我們詳細說明了 LLM 的問題並提供深入分析，旨在激勵在這個很大程度上未知的領域進行進一步的研究和解決方案。我們的研究強調了在金融翻譯的特定領域優化 LLM 以確保準確性和質量的必要性。", "author": "Yuxin Fu et.al.", "authors": "Yuxin Fu, Shijing Si, Leyi Mai, Xi-ang Li", "id": "2406.18856v1", "paper_url": "http://arxiv.org/abs/2406.18856v1", "repo": "null"}}