{"2406.12474": {"publish_time": "2024-06-18", "title": "Exploring Intra and Inter-language Consistency in Embeddings with ICA", "paper_summary": "Word embeddings represent words as multidimensional real vectors,\nfacilitating data analysis and processing, but are often challenging to\ninterpret. Independent Component Analysis (ICA) creates clearer semantic axes\nby identifying independent key features. Previous research has shown ICA's\npotential to reveal universal semantic axes across languages. However, it\nlacked verification of the consistency of independent components within and\nacross languages. We investigated the consistency of semantic axes in two ways:\nboth within a single language and across multiple languages. We first probed\ninto intra-language consistency, focusing on the reproducibility of axes by\nperforming ICA multiple times and clustering the outcomes. Then, we\nstatistically examined inter-language consistency by verifying those axes'\ncorrespondences using statistical tests. We newly applied statistical methods\nto establish a robust framework that ensures the reliability and universality\nof semantic axes.", "paper_summary_zh": "詞嵌入將詞彙表示為多維實數向量，\n促進數據分析和處理，但通常難以解讀。獨立成分分析 (ICA) 通過識別獨立關鍵特徵來建立更清晰的語義軸。先前的研究表明 ICA 有潛力揭示跨語言的通用語義軸。然而，它缺乏對語言內部和跨語言獨立成分一致性的驗證。我們以兩種方式研究了語義軸的一致性：一種在單一語言內，另一種在多種語言間。我們首先探討語言內部的一致性，重點關注通過多次執行 ICA 和對結果進行聚類來實現軸的可複製性。然後，我們通過使用統計檢驗驗證這些軸的對應關係，在統計上檢查語言間的一致性。我們新應用了統計方法來建立一個穩健的框架，以確保語義軸的可靠性和普遍性。", "author": "Rongzhi Li et.al.", "authors": "Rongzhi Li, Takeru Matsuda, Hitomi Yanaka", "id": "2406.12474v1", "paper_url": "http://arxiv.org/abs/2406.12474v1", "repo": "null"}}