{"2410.13754": {"publish_time": "2024-10-17", "title": "MixEval-X: Any-to-Any Evaluations from Real-World Data Mixtures", "paper_summary": "Perceiving and generating diverse modalities are crucial for AI models to\neffectively learn from and engage with real-world signals, necessitating\nreliable evaluations for their development. We identify two major issues in\ncurrent evaluations: (1) inconsistent standards, shaped by different\ncommunities with varying protocols and maturity levels; and (2) significant\nquery, grading, and generalization biases. To address these, we introduce\nMixEval-X, the first any-to-any real-world benchmark designed to optimize and\nstandardize evaluations across input and output modalities. We propose\nmulti-modal benchmark mixture and adaptation-rectification pipelines to\nreconstruct real-world task distributions, ensuring evaluations generalize\neffectively to real-world use cases. Extensive meta-evaluations show our\napproach effectively aligns benchmark samples with real-world task\ndistributions and the model rankings correlate strongly with that of\ncrowd-sourced real-world evaluations (up to 0.98). We provide comprehensive\nleaderboards to rerank existing models and organizations and offer insights to\nenhance understanding of multi-modal evaluations and inform future research.", "paper_summary_zh": "感知和生成不同的模態對於 AI 模型從真實世界的訊號中有效學習並與之互動至關重要，這需要對其開發進行可靠的評估。我們在當前的評估中發現了兩個主要問題：(1) 不一致的標準，由不同社群使用不同的協定和成熟度等級所形成；(2) 顯著的查詢、評分和概化偏差。為了解決這些問題，我們引入了 MixEval-X，這是第一個任何對任何真實世界基準，旨在最佳化並標準化輸入和輸出模態的評估。我們提出多模態基準混合和適應修正管道，以重建真實世界的任務分佈，確保評估能有效概化到真實世界的使用案例。廣泛的元評估顯示，我們的做法有效地將基準範例與真實世界的任務分佈對齊，且模型排名與群眾外包的真實世界評估密切相關 (高達 0.98)。我們提供全面的排行榜，以重新排名現有的模型和組織，並提供見解，以增強對多模態評估的理解，並為未來的研究提供資訊。", "author": "Jinjie Ni et.al.", "authors": "Jinjie Ni, Yifan Song, Deepanway Ghosal, Bo Li, David Junhao Zhang, Xiang Yue, Fuzhao Xue, Zian Zheng, Kaichen Zhang, Mahir Shah, Kabir Jain, Yang You, Michael Shieh", "id": "2410.13754v1", "paper_url": "http://arxiv.org/abs/2410.13754v1", "repo": "null"}}