{"2410.13754": {"publish_time": "2024-10-17", "title": "MixEval-X: Any-to-Any Evaluations from Real-World Data Mixtures", "paper_summary": "Perceiving and generating diverse modalities are crucial for AI models to\neffectively learn from and engage with real-world signals, necessitating\nreliable evaluations for their development. We identify two major issues in\ncurrent evaluations: (1) inconsistent standards, shaped by different\ncommunities with varying protocols and maturity levels; and (2) significant\nquery, grading, and generalization biases. To address these, we introduce\nMixEval-X, the first any-to-any, real-world benchmark designed to optimize and\nstandardize evaluations across diverse input and output modalities. We propose\nmulti-modal benchmark mixture and adaptation-rectification pipelines to\nreconstruct real-world task distributions, ensuring evaluations generalize\neffectively to real-world use cases. Extensive meta-evaluations show our\napproach effectively aligns benchmark samples with real-world task\ndistributions. Meanwhile, MixEval-X's model rankings correlate strongly with\nthat of crowd-sourced real-world evaluations (up to 0.98) while being much more\nefficient. We provide comprehensive leaderboards to rerank existing models and\norganizations and offer insights to enhance understanding of multi-modal\nevaluations and inform future research.", "paper_summary_zh": "感知和生成多樣化的模式對於 AI 模型從現實世界的訊號有效地學習和參與至關重要，這需要對其開發進行可靠的評估。我們在當前評估中發現兩個主要問題：(1) 不一致的標準，由具有不同協定和成熟度層級的不同社群所塑造；以及 (2) 顯著的查詢、評分和概化偏差。為了解決這些問題，我們引入了 MixEval-X，這是第一個任何到任何的真實世界基準，旨在最佳化和標準化跨不同輸入和輸出模式的評估。我們提出多模式基準混合和適應校正管線，以重建真實世界的任務分佈，確保評估能有效概化到真實世界的使用案例。廣泛的元評估顯示，我們的方法能有效地將基準樣本與真實世界的任務分佈對齊。同時，MixEval-X 的模型排名與眾包真實世界評估的排名密切相關（高達 0.98），同時效率更高。我們提供全面的排行榜，以重新排名現有模型和組織，並提供洞察力，以增強對多模式評估的理解，並為未來的研究提供資訊。", "author": "Jinjie Ni et.al.", "authors": "Jinjie Ni, Yifan Song, Deepanway Ghosal, Bo Li, David Junhao Zhang, Xiang Yue, Fuzhao Xue, Zian Zheng, Kaichen Zhang, Mahir Shah, Kabir Jain, Yang You, Michael Shieh", "id": "2410.13754v2", "paper_url": "http://arxiv.org/abs/2410.13754v2", "repo": "null"}}