{"2407.13113": {"publish_time": "2024-07-18", "title": "Multiobjective Vehicle Routing Optimization with Time Windows: A Hybrid Approach Using Deep Reinforcement Learning and NSGA-II", "paper_summary": "This paper proposes a weight-aware deep reinforcement learning (WADRL)\napproach designed to address the multiobjective vehicle routing problem with\ntime windows (MOVRPTW), aiming to use a single deep reinforcement learning\n(DRL) model to solve the entire multiobjective optimization problem. The\nNon-dominated sorting genetic algorithm-II (NSGA-II) method is then employed to\noptimize the outcomes produced by the WADRL, thereby mitigating the limitations\nof both approaches. Firstly, we design an MOVRPTW model to balance the\nminimization of travel cost and the maximization of customer satisfaction.\nSubsequently, we present a novel DRL framework that incorporates a\ntransformer-based policy network. This network is composed of an encoder\nmodule, a weight embedding module where the weights of the objective functions\nare incorporated, and a decoder module. NSGA-II is then utilized to optimize\nthe solutions generated by WADRL. Finally, extensive experimental results\ndemonstrate that our method outperforms the existing and traditional methods.\nDue to the numerous constraints in VRPTW, generating initial solutions of the\nNSGA-II algorithm can be time-consuming. However, using solutions generated by\nthe WADRL as initial solutions for NSGA-II significantly reduces the time\nrequired for generating initial solutions. Meanwhile, the NSGA-II algorithm can\nenhance the quality of solutions generated by WADRL, resulting in solutions\nwith better scalability. Notably, the weight-aware strategy significantly\nreduces the training time of DRL while achieving better results, enabling a\nsingle DRL model to solve the entire multiobjective optimization problem.", "paper_summary_zh": "<paragraph>這篇論文提出一個重量感知深度強化學習 (WADRL) 方法，旨在解決具時間窗的多目標車輛路線問題 (MOVRPTW)，目標是使用單一深度強化學習 (DRL) 模型來解決整個多目標最佳化問題。接著採用非支配排序遺傳演算法 II (NSGA-II) 方法來最佳化 WADRL 產生的結果，從而減輕兩種方法的限制。首先，我們設計一個 MOVRPTW 模型來平衡旅行成本的最小化和顧客滿意度的最大化。接著，我們提出一個新的 DRL 架構，其中包含一個基於 Transformer 的策略網路。這個網路由一個編碼器模組、一個將目標函數的權重納入其中的權重嵌入模組，以及一個解碼器模組組成。接著利用 NSGA-II 來最佳化 WADRL 生成的解。最後，廣泛的實驗結果證明，我們的方法優於現有和傳統的方法。由於 VRPTW 中的約束眾多，產生 NSGA-II 演算法的初始解會很耗時。然而，使用 WADRL 生成的解作為 NSGA-II 的初始解，可以大幅減少產生初始解所需的時間。同時，NSGA-II 演算法可以提升 WADRL 生成的解的品質，產生具有更好可擴充性的解。值得注意的是，重量感知策略大幅減少了 DRL 的訓練時間，同時獲得更好的結果，讓單一 DRL 模型就能解決整個多目標最佳化問題。</paragraph>", "author": "Rixin Wu et.al.", "authors": "Rixin Wu, Ran Wang, Jie Hao, Qiang Wu, Ping Wang, Dusit Niyato", "id": "2407.13113v1", "paper_url": "http://arxiv.org/abs/2407.13113v1", "repo": "null"}}