{"2406.11682": {"publish_time": "2024-06-17", "title": "Knowledge-to-Jailbreak: One Knowledge Point Worth One Attack", "paper_summary": "Large language models (LLMs) have been increasingly applied to various\ndomains, which triggers increasing concerns about LLMs' safety on specialized\ndomains, e.g. medicine. However, testing the domain-specific safety of LLMs is\nchallenging due to the lack of domain knowledge-driven attacks in existing\nbenchmarks. To bridge this gap, we propose a new task, knowledge-to-jailbreak,\nwhich aims to generate jailbreaks from domain knowledge to evaluate the safety\nof LLMs when applied to those domains. We collect a large-scale dataset with\n12,974 knowledge-jailbreak pairs and fine-tune a large language model as\njailbreak-generator, to produce domain knowledge-specific jailbreaks.\nExperiments on 13 domains and 8 target LLMs demonstrate the effectiveness of\njailbreak-generator in generating jailbreaks that are both relevant to the\ngiven knowledge and harmful to the target LLMs. We also apply our method to an\nout-of-domain knowledge base, showing that jailbreak-generator can generate\njailbreaks that are comparable in harmfulness to those crafted by human\nexperts. Data and code: https://github.com/THU-KEG/Knowledge-to-Jailbreak/.", "paper_summary_zh": "大型语言模型（LLM）已越来越多地应用于各种领域，这引发了人们对 LLM 在专业领域（例如医学）上的安全性日益担忧。然而，由于现有基准缺乏领域知识驱动的攻击，因此测试 LLM 的特定领域安全性具有挑战性。为了弥合这一差距，我们提出了一个新任务，即知识到越狱，其目的是从领域知识中生成越狱，以评估 LLM 应用于这些领域时的安全性。我们收集了一个包含 12,974 个知识越狱对的大规模数据集，并微调了一个大型语言模型作为越狱生成器，以产生特定于领域知识的越狱。在 13 个领域和 8 个目标 LLM 上的实验表明了越狱生成器在生成与给定知识相关且对目标 LLM 有害的越狱方面的有效性。我们还将我们的方法应用于域外知识库，表明越狱生成器可以生成与人类专家制作的越狱在危害性方面相当的越狱。数据和代码：https://github.com/THU-KEG/Knowledge-to-Jailbreak/。", "author": "Shangqing Tu et.al.", "authors": "Shangqing Tu, Zhuoran Pan, Wenxuan Wang, Zhexin Zhang, Yuliang Sun, Jifan Yu, Hongning Wang, Lei Hou, Juanzi Li", "id": "2406.11682v1", "paper_url": "http://arxiv.org/abs/2406.11682v1", "repo": "https://github.com/thu-keg/knowledge-to-jailbreak"}}