{"2407.14085": {"publish_time": "2024-07-19", "title": "An Improved Method for Class-specific Keyword Extraction: A Case Study in the German Business Registry", "paper_summary": "The task of $\\textit{keyword extraction}$ is often an important initial step\nin unsupervised information extraction, forming the basis for tasks such as\ntopic modeling or document classification. While recent methods have proven to\nbe quite effective in the extraction of keywords, the identification of\n$\\textit{class-specific}$ keywords, or only those pertaining to a predefined\nclass, remains challenging. In this work, we propose an improved method for\nclass-specific keyword extraction, which builds upon the popular\n$\\textbf{KeyBERT}$ library to identify only keywords related to a class\ndescribed by $\\textit{seed keywords}$. We test this method using a dataset of\nGerman business registry entries, where the goal is to classify each business\naccording to an economic sector. Our results reveal that our method greatly\nimproves upon previous approaches, setting a new standard for\n$\\textit{class-specific}$ keyword extraction.", "paper_summary_zh": "<paragraph>$\\textit{關鍵字萃取}$ 的任務通常是無監督資訊萃取中重要的第一步，形成主題模型或文件分類等任務的基礎。雖然最近的方法已證明在關鍵字萃取方面相當有效，但 $\\textit{類別特定}$ 關鍵字（或僅屬於預定義類別的關鍵字）的辨識仍然具有挑戰性。在這項工作中，我們提出了一種改進的類別特定關鍵字萃取方法，它建立在廣受歡迎的 $\\textbf{KeyBERT}$ 函式庫上，僅辨識與 $\\textit{種子關鍵字}$ 所描述類別相關的關鍵字。我們使用一個德國商業註冊條目的資料集來測試此方法，目標是根據經濟部門對每個企業進行分類。我們的結果顯示，我們的這種方法大大改進了先前的做法，為 $\\textit{類別特定}$ 關鍵字萃取樹立了新的標準。</paragraph>", "author": "Stephen Meisenbacher et.al.", "authors": "Stephen Meisenbacher, Tim Schopf, Weixin Yan, Patrick Holl, Florian Matthes", "id": "2407.14085v1", "paper_url": "http://arxiv.org/abs/2407.14085v1", "repo": "https://github.com/sjmeis/CSKE"}}