{"2502.12119": {"publish_time": "2025-02-17", "title": "PRISM: Self-Pruning Intrinsic Selection Method for Training-Free Multimodal Data Selection", "paper_summary": "Visual instruction tuning refines pre-trained Multimodal Large Language\nModels (MLLMs) to enhance their real-world task performance. However, the rapid\nexpansion of visual instruction datasets introduces significant data\nredundancy, leading to excessive computational costs. Existing data selection\nmethods predominantly rely on proxy models or loss-based metrics, both of which\nimpose substantial computational overheads due to the necessity of model\ninference and backpropagation. To address this challenge, we propose PRISM, a\nnovel training-free approach for efficient multimodal data selection. Unlike\nexisting methods, PRISM eliminates the reliance on proxy models, warm-up\npretraining, and gradient-based optimization. Instead, it leverages Pearson\ncorrelation analysis to quantify the intrinsic visual encoding properties of\nMLLMs, computing a task-specific correlation score to identify high-value\ninstances. This not only enbles data-efficient selection,but maintains the\noriginal performance. Empirical evaluations across multiple MLLMs demonstrate\nthat PRISM reduces the overall time required for visual instruction tuning and\ndata selection to just 30% of conventional methods, while surpassing fully\nfine-tuned models across eight multimodal and three language understanding\nbenchmarks, achieving a 101.7% relative improvement in final performance.", "paper_summary_zh": "視覺指令調整優化預先訓練的多模態大型語言模型 (MLLM)，以增強其真實世界的任務表現。然而，視覺指令資料集的快速擴展引入了顯著的資料冗餘，導致過度的運算成本。現有的資料選取方法主要依賴於代理模型或基於損失的指標，這兩者由於模型推理和反向傳播的必要性而造成大量的運算負擔。為了應對這一挑戰，我們提出了 PRISM，一種用於高效多模態資料選取的新型無訓練方法。與現有方法不同，PRISM 消除了對代理模型、熱身預訓練和基於梯度的優化的依賴。相反，它利用 Pearson 相關分析來量化 MLLM 的內在視覺編碼特性，計算特定任務相關性分數以識別高價值實例。這不僅能選擇資料效率，而且能保持原始效能。跨多個 MLLM 的經驗評估表明，PRISM 將視覺指令調整和資料選取所需的總時間減少到傳統方法的 30%，同時在八個多模態和三個語言理解基準中超越了完全微調的模型，在最終效能上實現了 101.7% 的相對改進。", "author": "Jinhe Bi et.al.", "authors": "Jinhe Bi, Yifan Wang, Danqi Yan, Xun Xiao, Artur Hecker, Volker Tresp, Yunpu Ma", "id": "2502.12119v1", "paper_url": "http://arxiv.org/abs/2502.12119v1", "repo": "null"}}