{"2411.13547": {"publish_time": "2024-11-20", "title": "SpecTool: A Benchmark for Characterizing Errors in Tool-Use LLMs", "paper_summary": "Evaluating the output of Large Language Models (LLMs) is one of the most\ncritical aspects of building a performant compound AI system. Since the output\nfrom LLMs propagate to downstream steps, identifying LLM errors is crucial to\nsystem performance. A common task for LLMs in AI systems is tool use. While\nthere are several benchmark environments for evaluating LLMs on this task, they\ntypically only give a success rate without any explanation of the failure\ncases. To solve this problem, we introduce SpecTool, a new benchmark to\nidentify error patterns in LLM output on tool-use tasks. Our benchmark data set\ncomprises of queries from diverse environments that can be used to test for the\npresence of seven newly characterized error patterns. Using SPECTOOL , we show\nthat even the most prominent LLMs exhibit these error patterns in their\noutputs. Researchers can use the analysis and insights from SPECTOOL to guide\ntheir error mitigation strategies.", "paper_summary_zh": "評估大型語言模型 (LLM) 的輸出是建構高效能複合式 AI 系統最重要的面向之一。由於 LLM 的輸出會傳播到下游步驟，因此找出 LLM 錯誤對於系統效能至關重要。在 AI 系統中，LLM 的一項常見任務是使用工具。雖然有幾個用於評估 LLM 執行此項任務的基準環境，但它們通常只提供成功率，而沒有說明失敗案例。為了解決這個問題，我們引進 SpecTool，一個用於找出 LLM 在工具使用任務中輸出錯誤模式的新基準。我們的基準資料集包含來自不同環境的查詢，可據以測試七種新特徵化錯誤模式的存在。使用 SPECTOOL，我們顯示出即使是最傑出的 LLM 也會在其輸出中展現這些錯誤模式。研究人員可以使用 SPECTOOL 的分析和見解來引導他們的錯誤緩解策略。", "author": "Shirley Kokane et.al.", "authors": "Shirley Kokane, Ming Zhu, Tulika Awalgaonkar, Jianguo Zhang, Thai Hoang, Akshara Prabhakar, Zuxin Liu, Tian Lan, Liangwei Yang, Juntao Tan, Rithesh Murthy, Weiran Yao, Zhiwei Liu, Juan Carlos Niebles, Huan Wang, Shelby Heinecke, Caiming Xiong, Silivo Savarese", "id": "2411.13547v1", "paper_url": "http://arxiv.org/abs/2411.13547v1", "repo": "null"}}