{"2408.01970": {"publish_time": "2024-08-04", "title": "SR-CIS: Self-Reflective Incremental System with Decoupled Memory and Reasoning", "paper_summary": "The ability of humans to rapidly learn new knowledge while retaining old\nmemories poses a significant challenge for current deep learning models. To\nhandle this challenge, we draw inspiration from human memory and learning\nmechanisms and propose the Self-Reflective Complementary Incremental System\n(SR-CIS). Comprising the deconstructed Complementary Inference Module (CIM) and\nComplementary Memory Module (CMM), SR-CIS features a small model for fast\ninference and a large model for slow deliberation in CIM, enabled by the\nConfidence-Aware Online Anomaly Detection (CA-OAD) mechanism for efficient\ncollaboration. CMM consists of task-specific Short-Term Memory (STM) region and\na universal Long-Term Memory (LTM) region. By setting task-specific Low-Rank\nAdaptive (LoRA) and corresponding prototype weights and biases, it instantiates\nexternal storage for parameter and representation memory, thus deconstructing\nthe memory module from the inference module. By storing textual descriptions of\nimages during training and combining them with the Scenario Replay Module (SRM)\npost-training for memory combination, along with periodic short-to-long-term\nmemory restructuring, SR-CIS achieves stable incremental memory with limited\nstorage requirements. Balancing model plasticity and memory stability under\nconstraints of limited storage and low data resources, SR-CIS surpasses\nexisting competitive baselines on multiple standard and few-shot incremental\nlearning benchmarks.", "paper_summary_zh": "人類快速學習新知識的同時，還能保留舊記憶的能力，對目前的深度學習模型來說是一項重大的挑戰。為了應對這項挑戰，我們從人類的記憶和學習機制中汲取靈感，並提出自我反省的互補增量系統 (SR-CIS)。SR-CIS 由解構的互補推論模組 (CIM) 和互補記憶模組 (CMM) 組成，其特點是在 CIM 中有一個用於快速推論的小模型和一個用於緩慢思考的大模型，並由信心感知線上異常偵測 (CA-OAD) 機制實現高效協作。CMM 由特定任務的短期記憶 (STM) 區域和一個通用的長期記憶 (LTM) 區域組成。通過設定特定任務的低秩自適應 (LoRA) 和對應的原型權重和偏差，它實例化了參數和表示記憶的外部儲存，從而將記憶模組從推論模組中解構。通過在訓練期間儲存影像的文字描述，並將它們與訓練後的場景重播模組 (SRM) 結合起來進行記憶組合，以及定期的短期到長期記憶重組，SR-CIS 在有限的儲存需求下實現穩定的增量記憶。在有限的儲存和低資料資源的約束下，平衡模型可塑性和記憶穩定性，SR-CIS 在多個標準和少次增量學習基準上超越了現有的競爭基準。", "author": "Biqing Qi et.al.", "authors": "Biqing Qi, Junqi Gao, Xinquan Chen, Dong Li, Weinan Zhang, Bowen Zhou", "id": "2408.01970v1", "paper_url": "http://arxiv.org/abs/2408.01970v1", "repo": "null"}}