{"2411.14795": {"publish_time": "2024-11-22", "title": "De-biased Multimodal Electrocardiogram Analysis", "paper_summary": "Multimodal large language models (MLLMs) are increasingly being applied in\nthe medical field, particularly in medical imaging. However, developing MLLMs\nfor ECG signals, which are crucial in clinical settings, has been a significant\nchallenge beyond medical imaging. Previous studies have attempted to address\nthis by converting ECGs into several text tags using an external classifier in\na training-free manner. However, this approach significantly compresses the\ninformation in ECGs and underutilizes the reasoning capabilities of LLMs. In\nthis work, we directly feed the embeddings of ECGs into the LLM through a\nprojection layer, retaining more information about ECGs and better leveraging\nthe reasoning abilities of LLMs. Our method can also effectively handle a\ncommon situation in clinical practice where it is necessary to compare two ECGs\ntaken at different times. Recent studies found that MLLMs may rely solely on\ntext input to provide answers, ignoring inputs from other modalities. We\nanalyzed this phenomenon from a causal perspective in the context of ECG MLLMs\nand discovered that the confounder, severity of illness, introduces a spurious\ncorrelation between the question and answer, leading the model to rely on this\nspurious correlation and ignore the ECG input. Such models do not comprehend\nthe ECG input and perform poorly in adversarial tests where different\nexpressions of the same question are used in the training and testing sets. We\ndesigned a de-biased pre-training method to eliminate the confounder's effect\naccording to the theory of backdoor adjustment. Our model performed well on the\nECG-QA task under adversarial testing and demonstrated zero-shot capabilities.\nAn interesting random ECG test further validated that our model effectively\nunderstands and utilizes the input ECG signal.", "paper_summary_zh": "多模态大型语言模型 (MLLM) 正越来越多地应用于医学领域，尤其是在医学影像中。然而，为在临床环境中至关重要的 ECG 信号开发 MLLM 一直是医学影像之外的一项重大挑战。先前的研究尝试通过以无训练的方式使用外部分类器将 ECG 转换为多个文本标签来解决此问题。然而，这种方法极大地压缩了 ECG 中的信息，并且低估了 LLM 的推理能力。在这项工作中，我们通过投影层直接将 ECG 的嵌入馈送到 LLM 中，保留了更多有关 ECG 的信息，并更好地利用了 LLM 的推理能力。我们的方法还可以有效地处理临床实践中常见的需要比较在不同时间采集的两个 ECG 的情况。最近的研究发现，MLLM 可能仅依靠文本输入来提供答案，而忽略来自其他模式的输入。我们从因果角度分析了 ECG MLLM 背景下的这种现象，发现混杂因素（疾病严重程度）引入了问题和答案之间的虚假相关性，导致模型依赖于这种虚假相关性并忽略 ECG 输入。此类模型不理解 ECG 输入，并且在对抗性测试中表现不佳，其中在训练和测试集中使用了同一问题的不同表达方式。我们设计了一种去偏差预训练方法，以根据后门调整理论消除混杂因素的影响。我们的模型在对抗性测试中在 ECG-QA 任务上表现良好，并展示了零样本学习能力。一个有趣的随机 ECG 测试进一步验证了我们的模型有效地理解并利用了输入 ECG 信号。", "author": "Haitao Li et.al.", "authors": "Haitao Li, Ziyu Li, Yiheng Mao, Ziyi Liu, Zhoujian Sun, Zhengxing Huang", "id": "2411.14795v1", "paper_url": "http://arxiv.org/abs/2411.14795v1", "repo": "null"}}