{"2410.15956": {"publish_time": "2024-10-21", "title": "Do Large Language Models Have an English Accent? Evaluating and Improving the Naturalness of Multilingual LLMs", "paper_summary": "Current Large Language Models (LLMs) are predominantly designed with English\nas the primary language, and even the few that are multilingual tend to exhibit\nstrong English-centric biases. Much like speakers who might produce awkward\nexpressions when learning a second language, LLMs often generate unnatural\noutputs in non-English languages, reflecting English-centric patterns in both\nvocabulary and grammar. Despite the importance of this issue, the naturalness\nof multilingual LLM outputs has received limited attention. In this paper, we\naddress this gap by introducing novel automatic corpus-level metrics to assess\nthe lexical and syntactic naturalness of LLM outputs in a multilingual context.\nUsing our new metrics, we evaluate state-of-the-art LLMs on a curated benchmark\nin French and Chinese, revealing a tendency towards English-influenced\npatterns. To mitigate this issue, we also propose a simple and effective\nalignment method to improve the naturalness of an LLM in a target language and\ndomain, achieving consistent improvements in naturalness without compromising\nthe performance on general-purpose benchmarks. Our work highlights the\nimportance of developing multilingual metrics, resources and methods for the\nnew wave of multilingual LLMs.", "paper_summary_zh": "目前的大型語言模型（LLM）主要是以英語作為主要語言設計的，即使是少數的多語言模型也傾向於表現出強烈的以英語為中心的偏見。就像學習第二語言時可能會產生奇怪表達方式的說話者一樣，LLM 通常會以非英語語言產生不自然的輸出，反映在詞彙和語法中以英語為中心的模式。儘管這個問題很重要，但多語言 LLM 產出的自然性卻很少受到關注。在本文中，我們透過引入新的自動語料庫級度量度來解決這個差距，以評估多語言環境中 LLM 產出的詞彙和句法自然性。使用我們新的度量標準，我們評估了法語和中文精選基準上的最新 LLM，揭示了受英語影響的模式的趨勢。為了減輕這個問題，我們還提出了一種簡單且有效的方法，以提高 LLM 在目標語言和領域中的自然性，在不影響通用基準效能的情況下，持續改善自然性。我們的研究重點說明了為新一波的多語言 LLM 開發多語言度量標準、資源和方法的重要性。", "author": "Yanzhu Guo et.al.", "authors": "Yanzhu Guo, Simone Conia, Zelin Zhou, Min Li, Saloni Potdar, Henry Xiao", "id": "2410.15956v1", "paper_url": "http://arxiv.org/abs/2410.15956v1", "repo": "null"}}