{"2410.11660": {"publish_time": "2024-10-15", "title": "Eliciting Textual Descriptions from Representations of Continuous Prompts", "paper_summary": "Continuous prompts, or \"soft prompts\", are a widely-adopted\nparameter-efficient tuning strategy for large language models, but are often\nless favorable due to their opaque nature. Prior attempts to interpret\ncontinuous prompts relied on projecting individual prompt tokens onto the\nvocabulary space. However, this approach is problematic as performant prompts\ncan yield arbitrary or contradictory text, and it interprets prompt tokens\nindividually. In this work, we propose a new approach to interpret continuous\nprompts that elicits textual descriptions from their representations during\nmodel inference. Using a Patchscopes variant (Ghandeharioun et al., 2024)\ncalled InSPEcT over various tasks, we show our method often yields accurate\ntask descriptions which become more faithful as task performance increases.\nMoreover, an elaborated version of InSPEcT reveals biased features in\ncontinuous prompts, whose presence correlates with biased model predictions.\nProviding an effective interpretability solution, InSPEcT can be leveraged to\ndebug unwanted properties in continuous prompts and inform developers on ways\nto mitigate them.", "paper_summary_zh": "連續提示或「軟提示」是一種廣泛採用的參數高效調整策略，適用於大型語言模型，但由於其不透明的性質，通常較不受青睞。先前嘗試詮釋連續提示的作法，依賴於將個別提示符號投射到詞彙空間上。然而，這種方法是有問題的，因為高執行效能的提示符號可能會產生任意或矛盾的文字，而且它個別詮釋提示符號。在這項工作中，我們提出一個新的方法來詮釋連續提示，在模型推論期間，從其表徵中引出文字描述。我們使用 Patchscopes 變體（Ghandeharioun 等人，2024 年），稱為 InSPEcT，在各種任務中，我們展示我們的模型方法通常會產生準確的任務描述，隨著任務效能提升，這些描述會變得更為忠實。此外，InSPEcT 的精緻版本揭示了連續提示中的偏差特徵，其存在與偏差模型預測相關。InSPEcT 提供了一個有效的可詮釋性解決方案，可以利用它來偵錯連續提示中不需要的屬性，並告知開發人員如何減輕這些屬性。", "author": "Dana Ramati et.al.", "authors": "Dana Ramati, Daniela Gottesman, Mor Geva", "id": "2410.11660v1", "paper_url": "http://arxiv.org/abs/2410.11660v1", "repo": "null"}}