{"2410.13762": {"publish_time": "2024-10-17", "title": "Virtual Sensing for Real-Time Degradation Monitoring of Nuclear Systems: Leveraging DeepONet for Enhanced Sensing Coverage for Digital Twin-Enabling Technology", "paper_summary": "Effective real-time monitoring technique is crucial for detecting material\ndegradation and maintaining the structural integrity of nuclear systems to\nensure both safety and operational efficiency. Traditional physical sensor\nsystems face limitations such as installation challenges, high costs, and\ndifficulties in measuring critical parameters in hard-to-reach or harsh\nenvironments, often resulting in incomplete data coverage. Machine\nlearning-driven virtual sensors offer a promising solution by enhancing\nphysical sensor capabilities to monitor critical degradation indicators like\npressure, velocity, and turbulence. However, conventional machine learning\nmodels struggle with real-time monitoring due to the high-dimensional nature of\nreactor data and the need for frequent retraining. This paper explores the use\nof Deep Operator Networks (DeepONet) within a digital twin (DT) framework to\npredict key thermal-hydraulic parameters in the hot leg of an AP-1000\nPressurized Water Reactor (PWR). In this study, DeepONet is trained with\ndifferent operational conditions, which relaxes the requirement of continuous\nretraining, making it suitable for online and real-time prediction components\nfor DT. Our results show that DeepONet achieves accurate predictions with low\nmean squared error and relative L2 error and can make predictions on unknown\ndata 160,000 times faster than traditional finite element (FE) simulations.\nThis speed and accuracy make DeepONet a powerful tool for tracking conditions\nthat contribute to material degradation in real-time, enhancing reactor safety\nand longevity.", "paper_summary_zh": "有效的实时监控技术对于检测材料退化和维持核系统的结构完整性至关重要，以确保安全性和运行效率。传统的物理传感器系统面临安装挑战、高成本和难以测量难以到达或恶劣环境中的关键参数等限制，通常导致数据覆盖不完整。机器学习驱动的虚拟传感器通过增强物理传感器监测关键退化指标（如压力、速度和湍流）的能力，提供了一个有前途的解决方案。然而，传统的机器学习模型由于反应堆数据的维度高和需要频繁重新训练而难以进行实时监控。本文探讨了在数字孪生 (DT) 框架内使用深度算子网络 (DeepONet) 来预测 AP-1000 压水堆 (PWR) 热腿中的关键热工水力参数。在这项研究中，DeepONet 在不同的操作条件下进行训练，这放松了持续重新训练的要求，使其适用于 DT 的在线和实时预测组件。我们的结果表明，DeepONet 以较低的均方误差和相对 L2 误差实现了准确的预测，并且可以比传统的有限元 (FE) 模拟快 160,000 倍对未知数据进行预测。这种速度和准确性使 DeepONet 成为实时跟踪导致材料退化的条件、提高反应堆安全性和使用寿命的有力工具。", "author": "Raisa Bentay Hossain et.al.", "authors": "Raisa Bentay Hossain, Farid Ahmed, Kazuma Kobayashi, Seid Koric, Diab Abueidda, Syed Bahauddin Alam", "id": "2410.13762v1", "paper_url": "http://arxiv.org/abs/2410.13762v1", "repo": "null"}}