{"2410.05243": {"publish_time": "2024-10-07", "title": "Navigating the Digital World as Humans Do: Universal Visual Grounding for GUI Agents", "paper_summary": "Multimodal large language models (MLLMs) are transforming the capabilities of\ngraphical user interface (GUI) agents, facilitating their transition from\ncontrolled simulations to complex, real-world applications across various\nplatforms. However, the effectiveness of these agents hinges on the robustness\nof their grounding capability. Current GUI agents predominantly utilize\ntext-based representations such as HTML or accessibility trees, which, despite\ntheir utility, often introduce noise, incompleteness, and increased\ncomputational overhead. In this paper, we advocate a human-like embodiment for\nGUI agents that perceive the environment entirely visually and directly take\npixel-level operations on the GUI. The key is visual grounding models that can\naccurately map diverse referring expressions of GUI elements to their\ncoordinates on the GUI across different platforms. We show that a simple\nrecipe, which includes web-based synthetic data and slight adaptation of the\nLLaVA architecture, is surprisingly effective for training such visual\ngrounding models. We collect the largest dataset for GUI visual grounding so\nfar, containing 10M GUI elements and their referring expressions over 1.3M\nscreenshots, and use it to train UGround, a strong universal visual grounding\nmodel for GUI agents. Empirical results on six benchmarks spanning three\ncategories (grounding, offline agent, and online agent) show that 1) UGround\nsubstantially outperforms existing visual grounding models for GUI agents, by\nup to 20% absolute, and 2) agents with UGround outperform state-of-the-art\nagents, despite the fact that existing agents use additional text-based input\nwhile ours only uses visual perception. These results provide strong support\nfor the feasibility and promises of GUI agents that navigate the digital world\nas humans do.", "paper_summary_zh": "多模态大型语言模型 (MLLM) 正在改变图形用户界面 (GUI) 代理的能力，促进它们从受控模拟向跨各种平台的复杂现实世界应用程序过渡。然而，这些代理的有效性取决于其基础能力的稳健性。当前的 GUI 代理主要使用基于文本的表示，例如 HTML 或无障碍树，尽管它们很实用，但通常会引入噪声、不完整性和增加的计算开销。在本文中，我们主张 GUI 代理采用类人化身，它们完全通过视觉感知环境并直接在 GUI 上执行像素级操作。关键在于视觉基础模型，它可以准确地将 GUI 元素的不同引用表达式映射到它们在不同平台上的 GUI 坐标。我们展示了一个简单的配方，其中包括基于网络的合成数据和 LLaVA 架构的轻微调整，对于训练此类视觉基础模型出人意料地有效。我们收集了迄今为止最大的 GUI 视觉基础数据集，其中包含 1000 万个 GUI 元素及其在 130 万个屏幕截图上的引用表达式，并使用它来训练 UGround，一个强大的 GUI 代理通用视觉基础模型。跨越三个类别（基础、离线代理和在线代理）的六个基准的经验结果表明，1）UGround 在 GUI 代理的现有视觉基础模型中表现明显优异，绝对值高达 20%，并且 2）使用 UGround 的代理优于最先进的代理，尽管现有代理使用额外的基于文本的输入，而我们的代理仅使用视觉感知。这些结果为 GUI 代理的可行性和前景提供了强有力的支持，这些代理像人类一样在数字世界中导航。", "author": "Boyu Gou et.al.", "authors": "Boyu Gou, Ruohan Wang, Boyuan Zheng, Yanan Xie, Cheng Chang, Yiheng Shu, Huan Sun, Yu Su", "id": "2410.05243v1", "paper_url": "http://arxiv.org/abs/2410.05243v1", "repo": "null"}}