{"2409.11527": {"publish_time": "2024-09-17", "title": "Improving LLM Reasoning with Multi-Agent Tree-of-Thought Validator Agent", "paper_summary": "Multi-agent strategies have emerged as a promising approach to enhance the\nreasoning abilities of Large Language Models (LLMs) by assigning specialized\nroles in the problem-solving process. Concurrently, Tree of Thoughts (ToT)\nmethods have shown potential in improving reasoning for complex\nquestion-answering tasks by exploring diverse reasoning paths. A critical\nlimitation in multi-agent reasoning is the 'Reasoner' agent's shallow\nexploration of reasoning paths. While ToT strategies could help mitigate this\nproblem, they may generate flawed reasoning branches, which could harm the\ntrustworthiness of the final answer. To leverage the strengths of both\nmulti-agent reasoning and ToT strategies, we introduce a novel approach\ncombining ToT-based Reasoner agents with a Thought Validator agent. Multiple\nReasoner agents operate in parallel, employing ToT to explore diverse reasoning\npaths. The Thought Validator then scrutinizes these paths, considering a\nReasoner's conclusion only if its reasoning is valid. This method enables a\nmore robust voting strategy by discarding faulty reasoning paths, enhancing the\nsystem's ability to tackle tasks requiring systematic and trustworthy\nreasoning. Our method demonstrates superior performance compared to existing\ntechniques when evaluated on the GSM8K dataset, outperforming the standard ToT\nstrategy by an average 5.6\\% across four LLMs.", "paper_summary_zh": "多代理策略已成為一種有前途的方法，可透過在問題解決過程中分配專門角色來增強大型語言模型 (LLM) 的推理能力。同時，思想樹 (ToT) 方法已展現出改善複雜問答任務推理的潛力，方法是探索多樣的推理路徑。多代理推理的一個關鍵限制是「推理者」代理對推理路徑的探索很淺。雖然 ToT 策略有助於減輕此問題，但它們可能會產生有缺陷的推理分支，這可能會損害最終答案的可信度。為了利用多代理推理和 ToT 策略的優點，我們提出了一種新穎方法，將基於 ToT 的推理代理與思想驗證代理結合起來。多個推理代理並行運作，利用 ToT 探索多樣的推理路徑。然後，思想驗證器會審查這些路徑，只有推理有效時才會考慮推理者的結論。這種方法透過捨棄有缺陷的推理路徑來實現更強大的投票策略，增強系統處理需要系統且可信推理任務的能力。在 GSM8K 資料集上評估時，我們的模型展現出優於現有技術的效能，在四個 LLM 上平均優於標準 ToT 策略 5.6%。", "author": "Fatemeh Haji et.al.", "authors": "Fatemeh Haji, Mazal Bethany, Maryam Tabar, Jason Chiang, Anthony Rios, Peyman Najafirad", "id": "2409.11527v1", "paper_url": "http://arxiv.org/abs/2409.11527v1", "repo": "null"}}