{"2501.01743": {"publish_time": "2025-01-03", "title": "Automating Legal Concept Interpretation with LLMs: Retrieval, Generation, and Evaluation", "paper_summary": "Legal articles often include vague concepts to adapt to the ever-changing\nsociety. Providing detailed interpretations of these concepts is a critical\ntask for legal practitioners, which requires meticulous and professional\nannotations by legal experts, admittedly time-consuming and expensive to\ncollect at scale. In this paper, we introduce a novel retrieval-augmented\ngeneration framework, ATRI, for AuTomatically Retrieving relevant information\nfrom past judicial precedents and Interpreting vague legal concepts. We further\npropose a new benchmark, Legal Concept Entailment, to automate the evaluation\nof generated concept interpretations without expert involvement. Automatic\nevaluations indicate that our generated interpretations can effectively assist\nlarge language models (LLMs) in understanding vague legal concepts.\nMulti-faceted evaluations by legal experts indicate that the quality of our\nconcept interpretations is comparable to those written by human experts. Our\nwork has strong implications for leveraging LLMs to support legal practitioners\nin interpreting vague legal concepts and beyond.", "paper_summary_zh": "法律條文通常包含模糊的概念以適應瞬息萬變的社會。對這些概念提供詳細的解釋是法律從業人員的一項重要任務，這需要法律專家仔細且專業地註解，而且公認收集起來既費時又昂貴。在本文中，我們介紹了一個新穎的檢索增強生成框架 ATRI，用於自動檢索過去司法判例中的相關資訊，並解釋模糊的法律概念。我們進一步提出一個新的基準，法律概念蘊涵，以自動化評估產生的概念解釋，而無需專家參與。自動評估表明，我們產生的解釋可以有效地協助大型語言模型 (LLM) 理解模糊的法律概念。法律專家進行的多方面評估表明，我們概念解釋的品質可與人類專家所寫的相媲美。我們的研究對於利用 LLM 來協助法律從業人員解釋模糊的法律概念以及更廣泛的應用具有重要的意義。", "author": "Kangcheng Luo et.al.", "authors": "Kangcheng Luo, Quzhe Huang, Cong Jiang, Yansong Feng", "id": "2501.01743v1", "paper_url": "http://arxiv.org/abs/2501.01743v1", "repo": "null"}}