{"2405.10746": {"publish_time": "2024-05-17", "title": "Causality in the Can: Diet Coke's Impact on Fatness", "paper_summary": "Artificially sweetened beverages like Diet Coke are often considered\nhealthier alternatives, but the debate over their impact on obesity persists.\nPrevious research has predominantly relied on observational data or randomized\ncontrolled trials (RCTs), which may not accurately capture the causal\nrelationship between Diet Coke consumption and obesity. This study uses causal\ninference methods, employing data from the National Health and Nutrition\nExamination Survey (NHANES) to examine this relationship across diverse\ndemographics. Instead of relying on RCT data, we constructed a causal graph and\napplied the back-door criterion with its adjustment formula to estimate the RCT\ndistributions. We then calculated the counterfactual quantity, the Probability\nof Necessity and Sufficiency (PNS), using both NHANES data and estimated RCT\ndata. We propose that PNS is the essential metric for assessing the impact of\nDiet Coke on obesity. Our results indicate that between 20% to 50% of\nindividuals, especially those with poor dietary habits, are more likely to gain\nweight from Diet Coke. Conversely, in groups like young females with healthier\ndiets, only a small proportion experience weight gain due to Diet Coke. These\nfindings highlight the influence of individual lifestyle and potential hormonal\nfactors on the varied effects of Diet Coke, providing a new framework for\nunderstanding its nutritional impacts on health.", "paper_summary_zh": "人工加糖飲料（如健怡可樂）通常被認為是更健康的選擇，但對於它們對肥胖的影響的爭論仍持續著。先前的研究主要依賴於觀察數據或隨機對照試驗 (RCT)，這可能無法準確捕捉健怡可樂攝取與肥胖之間的因果關係。本研究使用因果推論方法，採用國家健康與營養檢查調查 (NHANES) 的數據來檢驗不同人口統計資料中的這種關係。我們沒有依賴 RCT 數據，而是建構了一個因果圖，並應用後門準則及其調整公式來估計 RCT 分配。然後，我們使用 NHANES 數據和估計的 RCT 數據計算反事實數量，即必要性和充分性機率 (PNS)。我們提出 PNS 是評估健怡可樂對肥胖影響的基本指標。我們的結果表明，20% 至 50% 的個人，尤其是飲食習慣不良者，更有可能因健怡可樂而增加體重。相反地，在年輕女性等飲食較健康的族群中，只有少部分人會因健怡可樂而體重增加。這些發現突顯了個人生活方式和潛在荷爾蒙因素對健怡可樂不同影響的影響，為了解其對健康的營養影響提供了新的架構。", "author": "Yicheng Qi et.al.", "authors": "Yicheng Qi, Ang Li", "id": "2405.10746v1", "paper_url": "http://arxiv.org/abs/2405.10746v1", "repo": "null"}}