{"2411.11984": {"publish_time": "2024-11-18", "title": "Understanding Chain-of-Thought in LLMs through Information Theory", "paper_summary": "Large Language Models (LLMs) have shown impressive performance in complex\nreasoning tasks through Chain-of-Thought (CoT) reasoning, allowing models to\nbreak down problems into manageable sub-tasks. However, existing CoT evaluation\ntechniques either require annotated CoT data or fall short in accurately\nassessing intermediate reasoning steps, leading to high rates of false\npositives. In this paper, we formalize CoT reasoning in LLMs through an\ninformation-theoretic lens. Specifically, our framework quantifies the\n`information gain' at each reasoning step, enabling the identification of\nfailure modes in LLMs without the need for expensive annotated datasets. We\ndemonstrate the efficacy of our approach through extensive experiments on toy\nand GSM-8K data, where it significantly outperforms existing outcome-based\nmethods by providing more accurate insights into model performance on\nindividual tasks.", "paper_summary_zh": "大型語言模型 (LLM) 已透過思考鏈 (CoT) 推理在複雜推理任務中展現驚人的效能，讓模型能將問題分解成可管理的子任務。然而，現有的 CoT 評估技術需要標記的 CoT 資料，或無法準確評估中間推理步驟，導致大量的假陽性。在本文中，我們透過資訊理論的觀點形式化 LLM 中的 CoT 推理。具體來說，我們的架構量化了每個推理步驟的「資訊增益」，讓無需昂貴的標記資料集也能找出 LLM 的失敗模式。我們透過玩具和 GSM-8K 資料上的廣泛實驗證明了我們方法的效能，它透過提供更準確的見解，在個別任務上大幅優於現有的基於結果的方法。", "author": "Jean-Francois Ton et.al.", "authors": "Jean-Francois Ton, Muhammad Faaiz Taufiq, Yang Liu", "id": "2411.11984v1", "paper_url": "http://arxiv.org/abs/2411.11984v1", "repo": "null"}}