{"2408.08146": {"publish_time": "2024-08-15", "title": "KOALA: Enhancing Speculative Decoding for LLM via Multi-Layer Draft Heads with Adversarial Learning", "paper_summary": "Large Language Models (LLMs) exhibit high inference latency due to their\nautoregressive decoding nature. While the draft head in speculative decoding\nmitigates this issue, its full potential remains unexplored. In this paper, we\nintroduce KOALA (K-layer Optimized Adversarial Learning Architecture), an\northogonal approach to the draft head. By transforming the conventional\nsingle-layer draft head into a multi-layer architecture and incorporating\nadversarial learning into the traditional supervised training, KOALA\nsignificantly improves the accuracy of the draft head in predicting subsequent\ntokens, thus more closely mirroring the functionality of LLMs. Although this\nimprovement comes at the cost of slightly increased drafting overhead, KOALA\nsubstantially unlocks the draft head's potential, greatly enhancing speculative\ndecoding. We conducted comprehensive evaluations of KOALA, including both\nautoregressive and non-autoregressive draft heads across various tasks,\ndemonstrating a latency speedup ratio improvement of 0.24x-0.41x, which is\n10.57%-14.09% faster than the original draft heads.", "paper_summary_zh": "大型語言模型（LLM）由於其自迴歸解碼性質而展現出高推論延遲。雖然推測解碼中的草稿頭緩解了這個問題，但其全部潛力仍未被探索。在本文中，我們引入了 KOALA（K 層最佳化對抗學習架構），這是一種與草稿頭正交的方法。透過將傳統的單層草稿頭轉換成多層架構，並將對抗學習納入傳統的監督訓練中，KOALA 大幅提升了草稿頭在預測後續符號時的準確度，因此更接近於反映 LLM 的功能。雖然這種改進是以略微增加的草稿開銷為代價，但 KOALA 大幅解鎖了草稿頭的潛力，極大地增強了推測解碼。我們對 KOALA 進行了全面的評估，包括各種任務中的自迴歸和非自迴歸草稿頭，證明延遲加速比改進了 0.24x-0.41x，比原始草稿頭快了 10.57%-14.09%。", "author": "Kaiqi Zhang et.al.", "authors": "Kaiqi Zhang, Jing Zhao, Rui Chen", "id": "2408.08146v1", "paper_url": "http://arxiv.org/abs/2408.08146v1", "repo": "null"}}