{"2412.11679": {"publish_time": "2024-12-16", "title": "Bias Vector: Mitigating Biases in Language Models with Task Arithmetic Approach", "paper_summary": "The use of language models (LMs) has increased considerably in recent years,\nand the biases and stereotypes in training data that are reflected in the LM\noutputs are causing social problems. In this paper, inspired by the task\narithmetic, we propose the ``Bias Vector'' method for the mitigation of these\nLM biases. The Bias Vector method does not require manually created debiasing\ndata. The three main steps of our approach involve: (1) continual training the\npre-trained LMs on biased data using masked language modeling; (2) constructing\nthe Bias Vector as the difference between the weights of the biased LMs and\nthose of pre-trained LMs; and (3) subtracting the Bias Vector from the weights\nof the pre-trained LMs for debiasing. We evaluated the Bias Vector method on\nthe SEAT across three LMs and confirmed an average improvement of 0.177 points.\nWe demonstrated that the Bias Vector method does not degrade the LM performance\non downstream tasks in the GLUE benchmark. In addition, we examined the impact\nof scaling factors, which control the magnitudes of Bias Vectors, with effect\nsizes on the SEAT and conducted a comprehensive evaluation of our debiased LMs\nacross both the SEAT and GLUE benchmarks.", "paper_summary_zh": "近年來，語言模型 (LM) 的使用大幅增加，而訓練資料中的偏見和刻板印象反映在 LM 輸出中，並造成社會問題。在本文中，我們受到算術任務的啟發，提出「偏見向量」方法來減輕這些 LM 偏見。偏見向量方法不需要手動建立去偏見資料。我們的做法包含三個主要步驟：(1) 使用遮蔽語言模型在有偏見的資料上持續訓練預先訓練的 LM；(2) 將偏見 LM 的權重與預先訓練的 LM 的權重之間的差異建構為偏見向量；(3) 從預先訓練的 LM 的權重中減去偏見向量以進行去偏見。我們在三個 LM 上的 SEAT 評估偏見向量方法，並確認平均改善 0.177 分。我們證明偏見向量方法不會降低 GLUE 基準中下游任務的 LM 效能。此外，我們檢視了控制偏見向量大小的縮放因子的影響，以及在 SEAT 上的效果大小，並對我們的去偏見 LM 在 SEAT 和 GLUE 基準上進行全面的評估。", "author": "Daiki Shirafuji et.al.", "authors": "Daiki Shirafuji, Makoto Takenaka, Shinya Taguchi", "id": "2412.11679v1", "paper_url": "http://arxiv.org/abs/2412.11679v1", "repo": "null"}}