{"2408.17064": {"publish_time": "2024-08-30", "title": "Instant Adversarial Purification with Adversarial Consistency Distillation", "paper_summary": "Neural networks, despite their remarkable performance in widespread\napplications, including image classification, are also known to be vulnerable\nto subtle adversarial noise. Although some diffusion-based purification methods\nhave been proposed, for example, DiffPure, those methods are time-consuming. In\nthis paper, we propose One Step Control Purification (OSCP), a diffusion-based\npurification model that can purify the adversarial image in one Neural Function\nEvaluation (NFE) in diffusion models. We use Latent Consistency Model (LCM) and\nControlNet for our one-step purification. OSCP is computationally friendly and\ntime efficient compared to other diffusion-based purification methods; we\nachieve defense success rate of 74.19\\% on ImageNet, only requiring 0.1s for\neach purification. Moreover, there is a fundamental incongruence between\nconsistency distillation and adversarial perturbation. To address this\nontological dissonance, we propose Gaussian Adversarial Noise Distillation\n(GAND), a novel consistency distillation framework that facilitates a more\nnuanced reconciliation of the latent space dynamics, effectively bridging the\nnatural and adversarial manifolds. Our experiments show that the GAND does not\nneed a Full Fine Tune (FFT); PEFT, e.g., LoRA is sufficient.", "paper_summary_zh": "儘管神經網路在包括影像分類在內的廣泛應用中表現卓越，但眾所周知，神經網路也容易受到細微對抗性雜訊的影響。雖然已經提出了一些基於擴散的淨化方法，例如 DiffPure，但這些方法非常耗時。在本文中，我們提出了一步控制淨化 (OSCP)，這是一個基於擴散的淨化模型，可以在擴散模型中對抗性影像進行一次神經功能評估 (NFE) 的淨化。我們使用潛在一致性模型 (LCM) 和 ControlNet 進行一步淨化。與其他基於擴散的淨化方法相比，OSCP 在計算上更友善，且更省時；我們在 ImageNet 上達到了 74.19% 的防禦成功率，每次淨化只需 0.1 秒。此外，一致性蒸餾和對抗性擾動之間存在根本的不一致性。為了解決這種本體論上的不協調，我們提出了高斯對抗性雜訊蒸餾 (GAND)，這是一個新穎的一致性蒸餾框架，有助於對潛在空間動態進行更細緻的調和，有效地橋接自然和對抗性流形。我們的實驗表明，GAND 不需要完全微調 (FFT)；PEFT，例如 LoRA 就已經足夠了。", "author": "Chun Tong Lei et.al.", "authors": "Chun Tong Lei, Hon Ming Yam, Zhongliang Guo, Chun Pong Lau", "id": "2408.17064v2", "paper_url": "http://arxiv.org/abs/2408.17064v2", "repo": "null"}}