{"2406.14449": {"publish_time": "2024-06-20", "title": "APEER: Automatic Prompt Engineering Enhances Large Language Model Reranking", "paper_summary": "Large Language Models (LLMs) have significantly enhanced Information\nRetrieval (IR) across various modules, such as reranking. Despite impressive\nperformance, current zero-shot relevance ranking with LLMs heavily relies on\nhuman prompt engineering. Existing automatic prompt engineering algorithms\nprimarily focus on language modeling and classification tasks, leaving the\ndomain of IR, particularly reranking, underexplored. Directly applying current\nprompt engineering algorithms to relevance ranking is challenging due to the\nintegration of query and long passage pairs in the input, where the ranking\ncomplexity surpasses classification tasks. To reduce human effort and unlock\nthe potential of prompt optimization in reranking, we introduce a novel\nautomatic prompt engineering algorithm named APEER. APEER iteratively generates\nrefined prompts through feedback and preference optimization. Extensive\nexperiments with four LLMs and ten datasets demonstrate the substantial\nperformance improvement of APEER over existing state-of-the-art (SoTA) manual\nprompts. Furthermore, we find that the prompts generated by APEER exhibit\nbetter transferability across diverse tasks and LLMs. Code is available at\nhttps://github.com/jincan333/APEER.", "paper_summary_zh": "大型語言模型 (LLM) 已大幅提升資訊檢索 (IR) 在各種模組中的表現，例如重新排序。儘管有令人印象深刻的表現，但目前使用 LLM 的零次方相關性排序仍高度依賴於人工提示工程。現有的自動提示工程演算法主要專注於語言建模和分類任務，讓 IR 領域，特別是重新排序，處於未充分探索的狀態。由於輸入中整合了查詢和長篇段落的配對，因此直接將目前的提示工程演算法應用於相關性排序具有挑戰性，其中排序複雜度超越了分類任務。為了減少人工工作並發揮重新排序中提示最佳化的潛力，我們提出了一種名為 APEER 的新穎自動提示工程演算法。APEER 透過回饋和偏好最佳化，反覆產生精製的提示。使用四個 LLM 和十個資料集進行的廣泛實驗證明了 APEER 比現有的最先進 (SoTA) 手動提示有顯著的效能提升。此外，我們發現 APEER 產生的提示在不同的任務和 LLM 中表現出更好的可移植性。程式碼可在 https://github.com/jincan333/APEER 取得。", "author": "Can Jin et.al.", "authors": "Can Jin, Hongwu Peng, Shiyu Zhao, Zhenting Wang, Wujiang Xu, Ligong Han, Jiahui Zhao, Kai Zhong, Sanguthevar Rajasekaran, Dimitris N. Metaxas", "id": "2406.14449v1", "paper_url": "http://arxiv.org/abs/2406.14449v1", "repo": "https://github.com/jincan333/apeer"}}