{"2501.08200": {"publish_time": "2025-01-14", "title": "CWEval: Outcome-driven Evaluation on Functionality and Security of LLM Code Generation", "paper_summary": "Large Language Models (LLMs) have significantly aided developers by\ngenerating or assisting in code writing, enhancing productivity across various\ntasks. While identifying incorrect code is often straightforward, detecting\nvulnerabilities in functionally correct code is more challenging, especially\nfor developers with limited security knowledge, which poses considerable\nsecurity risks of using LLM-generated code and underscores the need for robust\nevaluation benchmarks that assess both functional correctness and security.\nCurrent benchmarks like CyberSecEval and SecurityEval attempt to solve it but\nare hindered by unclear and impractical specifications, failing to assess both\nfunctionality and security accurately. To tackle these deficiencies, we\nintroduce CWEval, a novel outcome-driven evaluation framework designed to\nenhance the evaluation of secure code generation by LLMs. This framework not\nonly assesses code functionality but also its security simultaneously with\nhigh-quality task specifications and outcome-driven test oracles which provides\nhigh accuracy. Coupled with CWEval-bench, a multilingual, security-critical\ncoding benchmark, CWEval provides a rigorous empirical security evaluation on\nLLM-generated code, overcoming previous benchmarks' shortcomings. Through our\nevaluations, CWEval reveals a notable portion of functional but insecure code\nproduced by LLMs, and shows a serious inaccuracy of previous evaluations,\nultimately contributing significantly to the field of secure code generation.\nWe open-source our artifact at: https://github.com/Co1lin/CWEval .", "paper_summary_zh": "大型語言模型 (LLM) 已透過產生或協助撰寫程式碼，大幅協助開發人員，提升各種任務的生產力。雖然識別錯誤的程式碼通常很簡單，但偵測功能正確程式碼中的漏洞更具挑戰性，特別是對於安全知識有限的開發人員而言，這對使用 LLM 生成的程式碼構成相當大的安全風險，並強調需要健全的評估基準，以評估功能正確性和安全性。CyberSecEval 和 SecurityEval 等目前的基準試圖解決這個問題，但受到不明確且不切實際的規格阻礙，無法準確評估功能和安全性。為了解決這些缺點，我們引入了 CWEval，一個新穎的成果導向評估架構，旨在加強對 LLM 安全程式碼生成的評估。這個架構不僅評估程式碼功能，還同時評估其安全性，並具備高品質的任務規格和成果導向測試預言，可提供高準確度。結合多語言、安全關鍵編碼基準 CWEval-bench，CWEval 對 LLM 生成的程式碼提供嚴謹的經驗安全評估，克服了先前基準的缺點。透過我們的評估，CWEval 揭露了 LLM 產生的一大部分功能性但又不安全的程式碼，並顯示先前評估的嚴重不準確性，最終對安全程式碼生成的領域做出重大貢獻。我們在 https://github.com/Co1lin/CWEval 開放原始碼工件。", "author": "Jinjun Peng et.al.", "authors": "Jinjun Peng, Leyi Cui, Kele Huang, Junfeng Yang, Baishakhi Ray", "id": "2501.08200v1", "paper_url": "http://arxiv.org/abs/2501.08200v1", "repo": "null"}}