{"2503.09370": {"publish_time": "2025-03-12", "title": "Revisiting Medical Image Retrieval via Knowledge Consolidation", "paper_summary": "As artificial intelligence and digital medicine increasingly permeate\nhealthcare systems, robust governance frameworks are essential to ensure\nethical, secure, and effective implementation. In this context, medical image\nretrieval becomes a critical component of clinical data management, playing a\nvital role in decision-making and safeguarding patient information. Existing\nmethods usually learn hash functions using bottleneck features, which fail to\nproduce representative hash codes from blended embeddings. Although contrastive\nhashing has shown superior performance, current approaches often treat image\nretrieval as a classification task, using category labels to create\npositive/negative pairs. Moreover, many methods fail to address the\nout-of-distribution (OOD) issue when models encounter external OOD queries or\nadversarial attacks. In this work, we propose a novel method to consolidate\nknowledge of hierarchical features and optimisation functions. We formulate the\nknowledge consolidation by introducing Depth-aware Representation Fusion (DaRF)\nand Structure-aware Contrastive Hashing (SCH). DaRF adaptively integrates\nshallow and deep representations into blended features, and SCH incorporates\nimage fingerprints to enhance the adaptability of positive/negative pairings.\nThese blended features further facilitate OOD detection and content-based\nrecommendation, contributing to a secure AI-driven healthcare environment.\nMoreover, we present a content-guided ranking to improve the robustness and\nreproducibility of retrieval results. Our comprehensive assessments demonstrate\nthat the proposed method could effectively recognise OOD samples and\nsignificantly outperform existing approaches in medical image retrieval\n(p<0.05). In particular, our method achieves a 5.6-38.9% improvement in mean\nAverage Precision on the anatomical radiology dataset.", "paper_summary_zh": "<paragraph>隨著人工智慧和數位醫療日益滲透醫療保健系統，強大的治理框架對於確保其倫理、安全和有效實施至關重要。在這種情況下，醫學影像檢索成為臨床數據管理的關鍵組成部分，在決策和保護患者資訊方面發揮著至關重要的作用。現有方法通常使用瓶頸特徵來學習雜湊函數，但無法從混合嵌入中產生具有代表性的雜湊碼。雖然對比雜湊已展現出優異的性能，但目前的方法通常將影像檢索視為分類任務，使用類別標籤來創建正/負樣本對。此外，許多方法在模型遇到外部的分布外 (OOD) 查詢或對抗性攻擊時，未能解決分布外 (OOD) 問題。在這項工作中，我們提出了一種整合分層特徵和優化函數知識的新方法。我們通過引入深度感知表示融合 (DaRF) 和結構感知對比雜湊 (SCH) 來制定知識整合。DaRF 自適應地將淺層和深層表示整合到混合特徵中，而 SCH 則結合影像指紋來增強正/負樣本配對的適應性。這些混合特徵進一步促進了 OOD 檢測和基於內容的推薦，有助於構建安全的 AI 驅動醫療保健環境。此外，我們提出了一種內容導向的排序方法，以提高檢索結果的穩健性和可重複性。我們的綜合評估表明，所提出的方法可以有效地識別 OOD 樣本，並且在醫學影像檢索方面顯著優於現有方法 (p<0.05)。特別是，在解剖放射學數據集上，我們的方法在平均精度均值方面取得了 5.6-38.9% 的提升。</paragraph>\n", "author": "Yang Nan et.al.", "authors": "Yang Nan, Huichi Zhou, Xiaodan Xing, Giorgos Papanastasiou, Lei Zhu, Zhifan Gao, Alejandro F Fangi, Guang Yang", "id": "2503.09370v1", "paper_url": "http://arxiv.org/abs/2503.09370v1", "repo": "null"}}