{"2408.12188": {"publish_time": "2024-08-22", "title": "Reasoning Factual Knowledge in Structured Data with Large Language Models", "paper_summary": "Large language models (LLMs) have made remarkable progress in various natural\nlanguage processing tasks as a benefit of their capability to comprehend and\nreason with factual knowledge. However, a significant amount of factual\nknowledge is stored in structured data, which possesses unique characteristics\nthat differ from the unstructured texts used for pretraining. This difference\ncan introduce imperceptible inference parameter deviations, posing challenges\nfor LLMs in effectively utilizing and reasoning with structured data to\naccurately infer factual knowledge. To this end, we propose a benchmark named\nStructFact, to evaluate the structural reasoning capabilities of LLMs in\ninferring factual knowledge. StructFact comprises 8,340 factual questions\nencompassing various tasks, domains, timelines, and regions. This benchmark\nallows us to investigate the capability of LLMs across five factual tasks\nderived from the unique characteristics of structural facts. Extensive\nexperiments on a set of LLMs with different training strategies reveal the\nlimitations of current LLMs in inferring factual knowledge from structured\ndata. We present this benchmark as a compass to navigate the strengths and\nweaknesses of LLMs in reasoning with structured data for knowledge-sensitive\ntasks, and to encourage advancements in related real-world applications. Please\nfind our code at https://github.com/EganGu/StructFact.", "paper_summary_zh": "大型語言模型 (LLM) 在各種自然語言處理任務中取得顯著進展，因為它們具備理解和推理事實知識的能力。然而，大量的真實知識儲存在結構化資料中，其具有與用於預訓練的非結構化文字不同的獨特特徵。這種差異可能會引入難以察覺的推論參數偏差，對 LLM 有效利用和推理結構化資料以準確推斷事實知識構成挑戰。為此，我們提出了一個名為 StructFact 的基準，以評估 LLM 在推斷事實知識方面的結構推理能力。StructFact 包含 8,340 個事實問題，涵蓋各種任務、領域、時間線和區域。這個基準讓我們能夠調查 LLM 在源自結構化事實的獨特特徵的五項事實任務中的能力。對採用不同訓練策略的一組 LLM 進行的廣泛實驗揭示了當前 LLM 從結構化資料中推斷事實知識的局限性。我們將這個基準作為指南，用於了解 LLM 在推理結構化資料以進行知識敏感任務時的優缺點，並鼓勵在相關實際應用中取得進展。請在 https://github.com/EganGu/StructFact 找到我們的程式碼。", "author": "Sirui Huang et.al.", "authors": "Sirui Huang, Yanggan Gu, Xuming Hu, Zhonghao Li, Qing Li, Guandong Xu", "id": "2408.12188v1", "paper_url": "http://arxiv.org/abs/2408.12188v1", "repo": "https://github.com/egangu/structfact"}}