{"2410.15973": {"publish_time": "2024-10-21", "title": "Karush-Kuhn-Tucker Condition-Trained Neural Networks (KKT Nets)", "paper_summary": "This paper presents a novel approach to solving convex optimization problems\nby leveraging the fact that, under certain regularity conditions, any set of\nprimal or dual variables satisfying the Karush-Kuhn-Tucker (KKT) conditions is\nnecessary and sufficient for optimality. Similar to Theory-Trained Neural\nNetworks (TTNNs), the parameters of the convex optimization problem are input\nto the neural network, and the expected outputs are the optimal primal and dual\nvariables. A choice for the loss function in this case is a loss, which we\nrefer to as the KKT Loss, that measures how well the network's outputs satisfy\nthe KKT conditions. We demonstrate the effectiveness of this approach using a\nlinear program as an example. For this problem, we observe that minimizing the\nKKT Loss alone outperforms training the network with a weighted sum of the KKT\nLoss and a Data Loss (the mean-squared error between the ground truth optimal\nsolutions and the network's output). Moreover, minimizing only the Data Loss\nyields inferior results compared to those obtained by minimizing the KKT Loss.\nWhile the approach is promising, the obtained primal and dual solutions are not\nsufficiently close to the ground truth optimal solutions. In the future, we aim\nto develop improved models to obtain solutions closer to the ground truth and\nextend the approach to other problem classes.", "paper_summary_zh": "本文提出了一種解決凸優化問題的新方法，方法是利用在特定規則條件下，任何滿足 Karush-Kuhn-Tucker (KKT) 條件的原始或對偶變數組對於最優性而言是必要且充分的事實。類似於理論訓練神經網路 (TTNN)，凸優化問題的參數會輸入神經網路，而預期的輸出是最佳原始和對偶變數。在這種情況下，損失函數的選擇是一種損失，我們稱之為 KKT 損失，它衡量網路輸出滿足 KKT 條件的程度。我們以線性規劃為例，展示了這種方法的有效性。對於這個問題，我們觀察到僅最小化 KKT 損失就優於使用 KKT 損失和資料損失（地面實況最佳解與網路輸出之間的均方誤差）的加權和來訓練網路。此外，僅最小化資料損失會產生劣於最小化 KKT 損失的結果。雖然這種方法很有希望，但獲得的原始和對偶解並不足以接近地面實況的最佳解。未來，我們旨在開發改進的模型，以獲得更接近地面實況的解，並將這種方法擴展到其他問題類別。", "author": "Shreya Arvind et.al.", "authors": "Shreya Arvind, Rishabh Pomaje, Rajshekhar V Bhat", "id": "2410.15973v1", "paper_url": "http://arxiv.org/abs/2410.15973v1", "repo": "null"}}