{"2501.03413": {"publish_time": "2025-01-06", "title": "SALT: Sales Autocompletion Linked Business Tables Dataset", "paper_summary": "Foundation models, particularly those that incorporate Transformer\narchitectures, have demonstrated exceptional performance in domains such as\nnatural language processing and image processing. Adapting these models to\nstructured data, like tables, however, introduces significant challenges. These\ndifficulties are even more pronounced when addressing multi-table data linked\nvia foreign key, which is prevalent in the enterprise realm and crucial for\nempowering business use cases. Despite its substantial impact, research\nfocusing on such linked business tables within enterprise settings remains a\nsignificantly important yet underexplored domain. To address this, we introduce\na curated dataset sourced from an Enterprise Resource Planning (ERP) system,\nfeaturing extensive linked tables. This dataset is specifically designed to\nsupport research endeavors in table representation learning. By providing\naccess to authentic enterprise data, our goal is to potentially enhance the\neffectiveness and applicability of models for real-world business contexts.", "paper_summary_zh": "基礎模型，尤其是那些結合Transformer架構的模型，已在自然語言處理和影像處理等領域展現出卓越效能。然而，將這些模型調整到結構化資料（如表格）時，會產生重大挑戰。在處理透過外來鍵連結的多表格資料時，這些困難更為明顯，而這在企業領域中很常見，且對於強化商業用例至關重要。儘管其影響力很大，但專注於企業環境中此類連結的商業表格的研究仍是一個非常重要但尚未充分探索的領域。為了解決這個問題，我們引進一個從企業資源規劃 (ERP) 系統中取得的精選資料集，其中包含廣泛的連結表格。此資料集特別設計用於支援表格表示學習的研究工作。透過提供對真實企業資料的存取，我們的目標是潛在地提升模型在實際商業情境中的效能和適用性。", "author": "Tassilo Klein et.al.", "authors": "Tassilo Klein, Clemens Biehl, Margarida Costa, Andre Sres, Jonas Kolk, Johannes Hoffart", "id": "2501.03413v1", "paper_url": "http://arxiv.org/abs/2501.03413v1", "repo": "https://github.com/sap-samples/salt"}}