{"2407.06576": {"publish_time": "2024-07-09", "title": "Virtual Personas for Language Models via an Anthology of Backstories", "paper_summary": "Large language models (LLMs) are trained from vast repositories of text\nauthored by millions of distinct authors, reflecting an enormous diversity of\nhuman traits. While these models bear the potential to be used as\napproximations of human subjects in behavioral studies, prior efforts have been\nlimited in steering model responses to match individual human users. In this\nwork, we introduce \"Anthology\", a method for conditioning LLMs to particular\nvirtual personas by harnessing open-ended life narratives, which we refer to as\n\"backstories.\" We show that our methodology enhances the consistency and\nreliability of experimental outcomes while ensuring better representation of\ndiverse sub-populations. Across three nationally representative human surveys\nconducted as part of Pew Research Center's American Trends Panel (ATP), we\ndemonstrate that Anthology achieves up to 18% improvement in matching the\nresponse distributions of human respondents and 27% improvement in consistency\nmetrics. Our code and generated backstories are available at\nhttps://github.com/CannyLab/anthology.", "paper_summary_zh": "大型語言模型 (LLM) 接受由數百萬位不同作者撰寫的龐大文字資料庫訓練，反映了人類特質的極大差異。雖然這些模型有潛力用於行為研究中人類受試者的近似值，但先前的努力在引導模型反應以符合個別人類使用者方面受到限制。在這項工作中，我們引入了「選集」，一種通過利用開放式人生敘述（我們稱之為「背景故事」）來調整 LLM 以適應特定虛擬角色的方法。我們表明，我們的技術增強了實驗結果的一致性和可靠性，同時確保了對不同亞群的更好表現。在皮尤研究中心美國趨勢小組 (ATP) 的一環中進行的三項全國代表性人類調查中，我們證明選集在匹配人類受訪者的反應分佈方面取得了高達 18% 的改進，在一致性指標方面取得了 27% 的改進。我們的代碼和生成的背景故事可在 https://github.com/CannyLab/anthology 獲得。", "author": "Suhong Moon et.al.", "authors": "Suhong Moon, Marwa Abdulhai, Minwoo Kang, Joseph Suh, Widyadewi Soedarmadji, Eran Kohen Behar, David M. Chan", "id": "2407.06576v1", "paper_url": "http://arxiv.org/abs/2407.06576v1", "repo": "https://github.com/cannylab/anthology"}}