{"2410.02651": {"publish_time": "2024-10-03", "title": "CAX: Cellular Automata Accelerated in JAX", "paper_summary": "Cellular automata have become a cornerstone for investigating emergence and\nself-organization across diverse scientific disciplines, spanning neuroscience,\nartificial life, and theoretical physics. However, the absence of a\nhardware-accelerated cellular automata library limits the exploration of new\nresearch directions, hinders collaboration, and impedes reproducibility. In\nthis work, we introduce CAX (Cellular Automata Accelerated in JAX), a\nhigh-performance and flexible open-source library designed to accelerate\ncellular automata research. CAX offers cutting-edge performance and a modular\ndesign through a user-friendly interface, and can support both discrete and\ncontinuous cellular automata with any number of dimensions. We demonstrate\nCAX's performance and flexibility through a wide range of benchmarks and\napplications. From classic models like elementary cellular automata and\nConway's Game of Life to advanced applications such as growing neural cellular\nautomata and self-classifying MNIST digits, CAX speeds up simulations up to\n2,000 times faster. Furthermore, we demonstrate CAX's potential to accelerate\nresearch by presenting a collection of three novel cellular automata\nexperiments, each implemented in just a few lines of code thanks to the\nlibrary's modular architecture. Notably, we show that a simple one-dimensional\ncellular automaton can outperform GPT-4 on the 1D-ARC challenge.", "paper_summary_zh": "細胞自動機已成為跨越神經科學、人工生命和理論物理等不同科學領域中研究出現和自組織的基石。然而，缺乏硬體加速的細胞自動機程式庫限制了新研究方向的探索，阻礙了合作，並妨礙了再現性。在這項工作中，我們介紹了 CAX（JAX 中加速的細胞自動機），這是一個高性能且靈活的開源程式庫，旨在加速細胞自動機研究。CAX 透過使用者友善的介面提供尖端的效能和模組化設計，並且可以支援任何維度的離散和連續細胞自動機。我們透過廣泛的基準和應用程式展示了 CAX 的效能和靈活性。從基本細胞自動機和康威生命遊戲等經典模型到先進應用程式，例如生長神經細胞自動機和自分類 MNIST 數位，CAX 將模擬速度提高了 2,000 倍。此外，我們展示了 CAX 加速研究的潛力，方法是展示三項新穎的細胞自動機實驗，由於程式庫的模組化架構，每個實驗僅使用幾行程式碼就能實作。值得注意的是，我們展示了一個簡單的一維細胞自動機可以在 1D-ARC 挑戰中優於 GPT-4。", "author": "Maxence Faldor et.al.", "authors": "Maxence Faldor, Antoine Cully", "id": "2410.02651v1", "paper_url": "http://arxiv.org/abs/2410.02651v1", "repo": "null"}}