{"2406.11581": {"publish_time": "2024-06-17", "title": "Style Transfer with Multi-iteration Preference Optimization", "paper_summary": "Numerous recent techniques for text style transfer characterize their\napproaches as variants of reinforcement learning and preference optimization.\nIn this work, we consider the relationship between these approaches and a class\nof optimization approaches developed primarily for (non-neural) statistical\nmachine translation, formerly known as 'tuning'. Inspired by these techniques\nfrom the past, we improve upon established preference optimization approaches,\nincorporating multiple iterations of exploration and optimization, and choosing\ncontrastive examples by following a 'hope' vs 'fear' sampling strategy.\nCognizant of the difference between machine translation and style transfer,\nhowever, we further tailor our framework with a new pseudo-parallel generation\nmethod and a dynamic weighted reward aggregation method to tackle the lack of\nparallel data and the need for a multi-objective reward. We evaluate our model\non two commonly used text style transfer datasets. Through automatic and human\nevaluation results we show the effectiveness and the superiority of our model\ncompared to state-of-the-art baselines.", "paper_summary_zh": "最近許多文本樣式轉移技術將其方法描述為強化學習和偏好最佳化的變體。在這項工作中，我們考慮這些方法與主要為（非神經）統計機器翻譯開發的一類最佳化方法之間的關係，以前稱為「調整」。受到過去這些技術的啟發，我們改進既有的偏好最佳化方法，納入多重探索和最佳化的反覆運算，並遵循「希望」與「恐懼」取樣策略來選擇對比範例。然而，我們認知到機器翻譯與樣式轉移之間的差異，進一步透過新的偽平行產生方法和動態加權回饋彙總方法調整我們的架構，以解決缺乏平行資料和需要多目標回饋的問題。我們在兩個常用的文本樣式轉移資料集上評估我們的模型。透過自動和人工評估結果，我們展示了我們的模型與最先進的基準相比的有效性和優越性。", "author": "Shuai Liu et.al.", "authors": "Shuai Liu, Jonathan May", "id": "2406.11581v1", "paper_url": "http://arxiv.org/abs/2406.11581v1", "repo": "null"}}