{"2502.17421": {"publish_time": "2025-02-24", "title": "LongSpec: Long-Context Speculative Decoding with Efficient Drafting and Verification", "paper_summary": "Speculative decoding has become a promising technique to mitigate the high\ninference latency of autoregressive decoding in Large Language Models (LLMs).\nDespite its promise, the effective application of speculative decoding in LLMs\nstill confronts three key challenges: the increasing memory demands of the\ndraft model, the distribution shift between the short-training corpora and\nlong-context inference, and inefficiencies in attention implementation. In this\nwork, we enhance the performance of speculative decoding in long-context\nsettings by addressing these challenges. First, we propose a memory-efficient\ndraft model with a constant-sized Key-Value (KV) cache. Second, we introduce\nnovel position indices for short-training data, enabling seamless adaptation\nfrom short-context training to long-context inference. Finally, we present an\ninnovative attention aggregation method that combines fast implementations for\nprefix computation with standard attention for tree mask handling, effectively\nresolving the latency and memory inefficiencies of tree decoding. Our approach\nachieves strong results on various long-context tasks, including\nrepository-level code completion, long-context summarization, and o1-like long\nreasoning tasks, demonstrating significant improvements in latency reduction.\nThe code is available at https://github.com/sail-sg/LongSpec.", "paper_summary_zh": "推測性解碼已成為一種有前途的技術，用於減輕大型語言模型 (LLM) 中自迴歸解碼的高推論延遲。\n儘管有前景，推測性解碼在 LLM 中的有效應用仍面臨三大挑戰：草稿模型不斷增加的記憶體需求、短訓練語料庫和長語境推論之間的分布轉移，以及注意力實作的低效率。在這項工作中，我們透過解決這些挑戰來增強推測性解碼在長語境設定中的效能。首先，我們提出一個記憶體高效的草稿模型，其中包含一個大小固定的鍵值 (KV) 快取。其次，我們為短訓練資料引入新的位置索引，讓從短語境訓練到長語境推論的無縫適應成為可能。最後，我們提出一個創新的注意力聚合方法，結合用於前綴計算的快速實作與用於樹狀遮罩處理的標準注意力，有效解決樹狀解碼的延遲和記憶體低效率。我們的做法在各種長語境任務中獲得強勁的結果，包括儲存庫層級的程式碼完成、長語境摘要，以及類似 O1 的長推理任務，證明在降低延遲方面有顯著的進步。程式碼可於 https://github.com/sail-sg/LongSpec 取得。", "author": "Penghui Yang et.al.", "authors": "Penghui Yang, Cunxiao Du, Fengzhuo Zhang, Haonan Wang, Tianyu Pang, Chao Du, Bo An", "id": "2502.17421v1", "paper_url": "http://arxiv.org/abs/2502.17421v1", "repo": "null"}}