{"2501.08276": {"publish_time": "2025-01-14", "title": "Exploring Robustness of LLMs to Sociodemographically-Conditioned Paraphrasing", "paper_summary": "Large Language Models (LLMs) have shown impressive performance in various NLP\ntasks. However, there are concerns about their reliability in different domains\nof linguistic variations. Many works have proposed robustness evaluation\nmeasures for local adversarial attacks, but we need globally robust models\nunbiased to different language styles. We take a broader approach to explore a\nwider range of variations across sociodemographic dimensions to perform\nstructured reliability tests on the reasoning capacity of language models. We\nextend the SocialIQA dataset to create diverse paraphrased sets conditioned on\nsociodemographic styles. The assessment aims to provide a deeper understanding\nof LLMs in (a) their capability of generating demographic paraphrases with\nengineered prompts and (b) their reasoning capabilities in real-world, complex\nlanguage scenarios. We also explore measures such as perplexity,\nexplainability, and ATOMIC performance of paraphrases for fine-grained\nreliability analysis of LLMs on these sets. We find that demographic-specific\nparaphrasing significantly impacts the performance of language models,\nindicating that the subtleties of language variations remain a significant\nchallenge. The code and dataset will be made available for reproducibility and\nfuture research.", "paper_summary_zh": "大型語言模型 (LLM) 在各種自然語言處理 (NLP) 任務中展現了令人印象深刻的效能。然而，對於它們在不同語言變異領域的可靠性仍有疑慮。許多研究已針對局部對抗攻擊提出穩健性評估措施，但我們需要對不同語言風格沒有偏見的全球穩健模型。我們採取更廣泛的方法，探索社會人口特徵維度中更廣泛的變異，對語言模型的推理能力進行結構化的可靠性測試。我們擴充 SocialIQA 資料集，以建立以社會人口特徵風格為條件的不同同義詞組。評估旨在提供對 LLM 的更深入理解，包括：(a) 它們使用設計提示產生人口同義詞的能力，以及 (b) 它們在現實世界中複雜語言情境中的推理能力。我們還探索困惑度、可解釋性和同義詞的 ATOMIC 效能等指標，以對 LLM 在這些集合上的可靠性進行細緻的分析。我們發現，特定人口的同義詞改寫會顯著影響語言模型的效能，這表示語言變異的細微差別仍然是一項重大的挑戰。程式碼和資料集將提供出來，以利於再現性和後續研究。", "author": "Pulkit Arora et.al.", "authors": "Pulkit Arora, Akbar Karimi, Lucie Flek", "id": "2501.08276v1", "paper_url": "http://arxiv.org/abs/2501.08276v1", "repo": "null"}}