{"2409.07823": {"publish_time": "2024-09-12", "title": "Online vs Offline: A Comparative Study of First-Party and Third-Party Evaluations of Social Chatbots", "paper_summary": "This paper explores the efficacy of online versus offline evaluation methods\nin assessing conversational chatbots, specifically comparing first-party direct\ninteractions with third-party observational assessments. By extending a\nbenchmarking dataset of user dialogs with empathetic chatbots with offline\nthird-party evaluations, we present a systematic comparison between the\nfeedback from online interactions and the more detached offline third-party\nevaluations. Our results reveal that offline human evaluations fail to capture\nthe subtleties of human-chatbot interactions as effectively as online\nassessments. In comparison, automated third-party evaluations using a GPT-4\nmodel offer a better approximation of first-party human judgments given\ndetailed instructions. This study highlights the limitations of third-party\nevaluations in grasping the complexities of user experiences and advocates for\nthe integration of direct interaction feedback in conversational AI evaluation\nto enhance system development and user satisfaction.", "paper_summary_zh": "本文探討線上與線下評估方法在評估對話式聊天機器人時的效能，特別是比較第一方直接互動與第三方觀察評估。透過擴充使用者對話的基准資料集，並加入離線的第三方評估，我們對線上互動的回饋與較為抽離的離線第三方評估進行系統性的比較。我們的結果顯示，與線上評估相比，離線的人工評估未能有效捕捉人與聊天機器人互動的細微差別。相較之下，使用 GPT-4 模型的自動化第三方評估，在給予詳細說明的情況下，能提供較佳的近似值，以判斷第一方的人類判斷。本研究強調了第三方評估在掌握使用者體驗的複雜性方面的限制，並主張在對話式 AI 評估中整合直接互動回饋，以增強系統開發和使用者滿意度。", "author": "Ekaterina Svikhnushina et.al.", "authors": "Ekaterina Svikhnushina, Pearl Pu", "id": "2409.07823v1", "paper_url": "http://arxiv.org/abs/2409.07823v1", "repo": "null"}}