{"2408.00447": {"publish_time": "2024-08-01", "title": "DiscipLink: Unfolding Interdisciplinary Information Seeking Process via Human-AI Co-Exploration", "paper_summary": "Interdisciplinary studies often require researchers to explore literature in\ndiverse branches of knowledge. Yet, navigating through the highly scattered\nknowledge from unfamiliar disciplines poses a significant challenge. In this\npaper, we introduce DiscipLink, a novel interactive system that facilitates\ncollaboration between researchers and large language models (LLMs) in\ninterdisciplinary information seeking (IIS). Based on users' topics of\ninterest, DiscipLink initiates exploratory questions from the perspectives of\npossible relevant fields of study, and users can further tailor these\nquestions. DiscipLink then supports users in searching and screening papers\nunder selected questions by automatically expanding queries with\ndisciplinary-specific terminologies, extracting themes from retrieved papers,\nand highlighting the connections between papers and questions. Our evaluation,\ncomprising a within-subject comparative experiment and an open-ended\nexploratory study, reveals that DiscipLink can effectively support researchers\nin breaking down disciplinary boundaries and integrating scattered knowledge in\ndiverse fields. The findings underscore the potential of LLM-powered tools in\nfostering information-seeking practices and bolstering interdisciplinary\nresearch.", "paper_summary_zh": "跨領域研究往往需要研究人員探索不同知識領域的文獻。然而，在不熟悉的領域中穿梭於高度分散的知識，構成了一項重大的挑戰。在本文中，我們介紹了 DiscipLink，一個新穎的互動式系統，它促進了研究人員與大型語言模型 (LLM) 在跨領域資訊搜尋 (IIS) 中的協作。根據使用者的興趣主題，DiscipLink 從可能相關的研究領域的角度提出探索性問題，而使用者可以進一步調整這些問題。接著，DiscipLink 透過自動擴充查詢，使用特定於領域的術語，從檢索到的論文中萃取主題，並強調論文與問題之間的關聯，來支援使用者在所選問題之下搜尋和篩選論文。我們的評量包含一個受試者內比較實驗和一個開放式的探索性研究，結果顯示 DiscipLink 能有效地支援研究人員打破學科界線，並整合不同領域中分散的知識。這些發現強調了 LLM 驅動工具在促進資訊搜尋實務和強化跨領域研究方面的潛力。", "author": "Chengbo Zheng et.al.", "authors": "Chengbo Zheng, Yuanhao Zhang, Zeyu Huang, Chuhan Shi, Minrui Xu, Xiaojuan Ma", "id": "2408.00447v1", "paper_url": "http://arxiv.org/abs/2408.00447v1", "repo": "null"}}