{"2502.04706": {"publish_time": "2025-02-07", "title": "Enhancing Impression Change Prediction in Speed Dating Simulations Based on Speakers' Personalities", "paper_summary": "This paper focuses on simulating text dialogues in which impressions between\nspeakers improve during speed dating. This simulation involves selecting an\nutterance from multiple candidates generated by a text generation model that\nreplicates a specific speaker's utterances, aiming to improve the impression of\nthe speaker. Accurately selecting an utterance that improves the impression is\ncrucial for the simulation. We believe that whether an utterance improves a\ndialogue partner's impression of the speaker may depend on the personalities of\nboth parties. However, recent methods for utterance selection do not consider\nthe impression per utterance or the personalities. To address this, we propose\na method that predicts whether an utterance improves a partner's impression of\nthe speaker, considering the personalities. The evaluation results showed that\npersonalities are useful in predicting impression changes per utterance.\nFurthermore, we conducted a human evaluation of simulated dialogues using our\nmethod. The results showed that it could simulate dialogues more favorably\nreceived than those selected without considering personalities.", "paper_summary_zh": "本文重點在於模擬在快速約會中，講者之間的印象得到改善的文字對話。此模擬包括從文字生成模型產生的多個候選者中選擇一個語句，該模型複製特定講者的語句，旨在改善講者的印象。準確選擇能改善印象的語句對於模擬至關重要。我們相信，語句是否能改善對話夥伴對講者的印象可能取決於雙方的個性。然而，最近的語句選擇方法並未考慮每個語句的印象或個性。為了解決這個問題，我們提出了一種方法，該方法預測語句是否會改善夥伴對講者的印象，並考慮個性。評估結果表明，個性對於預測每個語句的印象變化很有用。此外，我們使用我們的方法對模擬對話進行了人工評估。結果表明，它可以模擬出比不考慮個性而選擇的對話更受歡迎的對話。", "author": "Kazuya Matsuo et.al.", "authors": "Kazuya Matsuo, Yoko Ishii, Atsushi Otsuka, Ryo Ishii, Hiroaki Sugiyama, Masahiro Mizukami, Tsunehiro Arimoto, Narichika Nomoto, Yoshihide Sato, Tetsuya Yamaguchi", "id": "2502.04706v1", "paper_url": "http://arxiv.org/abs/2502.04706v1", "repo": "null"}}