{"2405.04629": {"publish_time": "2024-05-07", "title": "ResNCT: A Deep Learning Model for the Synthesis of Nephrographic Phase Images in CT Urography", "paper_summary": "Purpose: To develop and evaluate a transformer-based deep learning model for\nthe synthesis of nephrographic phase images in CT urography (CTU) examinations\nfrom the unenhanced and urographic phases.\n  Materials and Methods: This retrospective study was approved by the local\nInstitutional Review Board. A dataset of 119 patients (mean $\\pm$ SD age, 65\n$\\pm$ 12 years; 75/44 males/females) with three-phase CT urography studies was\ncurated for deep learning model development. The three phases for each patient\nwere aligned with an affine registration algorithm. A custom model, coined\nResidual transformer model for Nephrographic phase CT image synthesis (ResNCT),\nwas developed and implemented with paired inputs of non-contrast and urographic\nsets of images trained to produce the nephrographic phase images, that were\ncompared with the corresponding ground truth nephrographic phase images. The\nsynthesized images were evaluated with multiple performance metrics, including\npeak signal to noise ratio (PSNR), structural similarity index (SSIM),\nnormalized cross correlation coefficient (NCC), mean absolute error (MAE), and\nroot mean squared error (RMSE).\n  Results: The ResNCT model successfully generated synthetic nephrographic\nimages from non-contrast and urographic image inputs. With respect to ground\ntruth nephrographic phase images, the images synthesized by the model achieved\nhigh PSNR (27.8 $\\pm$ 2.7 dB), SSIM (0.88 $\\pm$ 0.05), and NCC (0.98 $\\pm$\n0.02), and low MAE (0.02 $\\pm$ 0.005) and RMSE (0.042 $\\pm$ 0.016).\n  Conclusion: The ResNCT model synthesized nephrographic phase CT images with\nhigh similarity to ground truth images. The ResNCT model provides a means of\neliminating the acquisition of the nephrographic phase with a resultant 33%\nreduction in radiation dose for CTU examinations.", "paper_summary_zh": "<paragraph>目的：開發並評估基於 Transformer 的深度學習模型，用於從未增強和尿路造影期中合成 CT 尿路造影 (CTU) 檢查的腎造影期影像。\n材料和方法：這項回顧性研究已獲得當地機構審查委員會核准。整理了一個包含 119 位患者（平均年齡 $\\pm$ 標準差，65 $\\pm$ 12 歲；75/44 位男性/女性）的三期 CT 尿路造影研究資料集，以進行深度學習模型開發。每位患者的三個期別使用仿射配準演算法對齊。開發並實作了一個自訂模型，稱為腎造影期 CT 影像合成的殘差 Transformer 模型 (ResNCT)，並使用非對比和尿路造影影像組的配對輸入進行訓練，以產生腎造影期影像，並與對應的真實腎造影期影像進行比較。使用多項效能指標評估合成的影像，包括峰值信號雜訊比 (PSNR)、結構相似性指標 (SSIM)、歸一化互相關係係數 (NCC)、平均絕對誤差 (MAE) 和均方根誤差 (RMSE)。\n結果：ResNCT 模型成功地從非對比和尿路造影影像輸入中生成了合成腎造影影像。相對於真實腎造影期影像，模型合成的影像達到了較高的 PSNR (27.8 $\\pm$ 2.7 dB)、SSIM (0.88 $\\pm$ 0.05) 和 NCC (0.98 $\\pm$ 0.02)，以及較低的 MAE (0.02 $\\pm$ 0.005) 和 RMSE (0.042 $\\pm$ 0.016)。\n結論：ResNCT 模型合成了與真實影像高度相似的腎造影期 CT 影像。ResNCT 模型提供了一種消除腎造影期擷取的方法，從而使 CTU 檢查的輻射劑量減少了 33%。</paragraph>", "author": "Syed Jamal Safdar Gardezi et.al.", "authors": "Syed Jamal Safdar Gardezi, Lucas Aronson, Peter Wawrzyn, Hongkun Yu, E. Jason Abel, Daniel D. Shapiro, Meghan G. Lubner, Joshua Warner, Giuseppe Toia, Lu Mao, Pallavi Tiwari, Andrew L. Wentland", "id": "2405.04629v1", "paper_url": "http://arxiv.org/abs/2405.04629v1", "repo": "null"}}