{"2407.04287": {"publish_time": "2024-07-05", "title": "MARS: Paying more attention to visual attributes for text-based person search", "paper_summary": "Text-based person search (TBPS) is a problem that gained significant interest\nwithin the research community. The task is that of retrieving one or more\nimages of a specific individual based on a textual description. The multi-modal\nnature of the task requires learning representations that bridge text and image\ndata within a shared latent space. Existing TBPS systems face two major\nchallenges. One is defined as inter-identity noise that is due to the inherent\nvagueness and imprecision of text descriptions and it indicates how\ndescriptions of visual attributes can be generally associated to different\npeople; the other is the intra-identity variations, which are all those\nnuisances e.g. pose, illumination, that can alter the visual appearance of the\nsame textual attributes for a given subject. To address these issues, this\npaper presents a novel TBPS architecture named MARS\n(Mae-Attribute-Relation-Sensitive), which enhances current state-of-the-art\nmodels by introducing two key components: a Visual Reconstruction Loss and an\nAttribute Loss. The former employs a Masked AutoEncoder trained to reconstruct\nrandomly masked image patches with the aid of the textual description. In doing\nso the model is encouraged to learn more expressive representations and\ntextual-visual relations in the latent space. The Attribute Loss, instead,\nbalances the contribution of different types of attributes, defined as\nadjective-noun chunks of text. This loss ensures that every attribute is taken\ninto consideration in the person retrieval process. Extensive experiments on\nthree commonly used datasets, namely CUHK-PEDES, ICFG-PEDES, and RSTPReid,\nreport performance improvements, with significant gains in the mean Average\nPrecision (mAP) metric w.r.t. the current state of the art.", "paper_summary_zh": "<paragraph>基於文字的人員搜尋 (TBPS) 是在研究社群中獲得顯著關注的問題。這項任務是根據文字描述，擷取一位或多位特定個人的影像。多模態任務的性質需要學習表徵，以在共享的潛在空間中橋接文字和影像資料。現有的 TBPS 系統面臨兩項主要的挑戰。其一是定義為「身分間雜訊」，這是由於文字描述的本質模糊且不精確，且它指出視覺屬性的描述通常可以與不同的人關聯；另一個是「身分內變異」，也就是所有那些例如姿勢、光線等會改變給定主體相同文字屬性的視覺外觀的討厭因素。為了解決這些問題，本文提出名為 MARS (Mae-Attribute-Relation-Sensitive) 的新穎 TBPS 架構，透過引入兩個關鍵元件來增強目前最先進的模型：視覺重建損失和屬性損失。前者使用遮罩式自動編碼器，在文字描述的輔助下訓練以重建隨機遮罩的影像區塊。在這樣做的過程中，會鼓勵模型學習潛在空間中更具表現力的表徵和文字視覺關係。另一方面，屬性損失則平衡不同類型屬性的貢獻，定義為文字的形容詞名詞區塊。此損失確保在人員擷取過程中考量每個屬性。在三個常用資料集 (CUHK-PEDES、ICFG-PEDES 和 RSTPReid) 上進行的廣泛實驗報告了效能提升，平均準確度 (mAP) 指標相較於目前的最新技術有顯著的進步。</paragraph>", "author": "Alex Ergasti et.al.", "authors": "Alex Ergasti, Tomaso Fontanini, Claudio Ferrari, Massimo Bertozzi, Andrea Prati", "id": "2407.04287v1", "paper_url": "http://arxiv.org/abs/2407.04287v1", "repo": "https://github.com/ergastialex/mars"}}