{"2412.17780": {"publish_time": "2024-12-23", "title": "PepTune: De Novo Generation of Therapeutic Peptides with Multi-Objective-Guided Discrete Diffusion", "paper_summary": "Peptide therapeutics, a major class of medicines, have achieved remarkable\nsuccess across diseases such as diabetes and cancer, with landmark examples\nsuch as GLP-1 receptor agonists revolutionizing the treatment of type-2\ndiabetes and obesity. Despite their success, designing peptides that satisfy\nmultiple conflicting objectives, such as target binding affinity, solubility,\nand membrane permeability, remains a major challenge. Classical drug\ndevelopment and structure-based design are ineffective for such tasks, as they\nfail to optimize global functional properties critical for therapeutic\nefficacy. Existing generative frameworks are largely limited to continuous\nspaces, unconditioned outputs, or single-objective guidance, making them\nunsuitable for discrete sequence optimization across multiple properties. To\naddress this, we present PepTune, a multi-objective discrete diffusion model\nfor the simultaneous generation and optimization of therapeutic peptide SMILES.\nBuilt on the Masked Discrete Language Model (MDLM) framework, PepTune ensures\nvalid peptide structures with state-dependent masking schedules and\npenalty-based objectives. To guide the diffusion process, we propose a Monte\nCarlo Tree Search (MCTS)-based strategy that balances exploration and\nexploitation to iteratively refine Pareto-optimal sequences. MCTS integrates\nclassifier-based rewards with search-tree expansion, overcoming gradient\nestimation challenges and data sparsity inherent to discrete spaces. Using\nPepTune, we generate diverse, chemically-modified peptides optimized for\nmultiple therapeutic properties, including target binding affinity, membrane\npermeability, solubility, hemolysis, and non-fouling characteristics on various\ndisease-relevant targets. In total, our results demonstrate that MCTS-guided\ndiscrete diffusion is a powerful and modular approach for multi-objective\nsequence design in discrete state spaces.", "paper_summary_zh": "胜肽疗法是一类主要的药物，在糖尿病和癌症等疾病中取得了显著的成功，其中具有里程碑意义的例子如 GLP-1 受体激动剂彻底改变了 2 型糖尿病和肥胖症的治疗。尽管取得了成功，但设计满足多种相互冲突的目标（如靶向结合亲和力、溶解性和膜渗透性）的胜肽仍然是一项重大挑战。经典药物开发和基于结构的设计对于此类任务无效，因为它们无法优化对治疗效果至关重要的全局功能特性。现有的生成框架在很大程度上仅限于连续空间、无条件输出或单目标指导，这使得它们不适合跨多个属性进行离散序列优化。为了解决这个问题，我们提出了 PepTune，一种用于同时生成和优化治疗性胜肽 SMILES 的多目标离散扩散模型。基于掩码离散语言模型 (MDLM) 框架，PepTune 通过状态相关掩码调度和基于惩罚的目标确保有效的胜肽结构。为了指导扩散过程，我们提出了一种基于蒙特卡罗树搜索 (MCTS) 的策略，该策略平衡探索和利用以迭代优化帕累托最优序列。MCTS 将基于分类器的奖励与搜索树扩展相结合，克服了离散空间固有的梯度估计挑战和数据稀疏性。使用 PepTune，我们生成了针对多种治疗特性（包括靶向结合亲和力、膜渗透性、溶解性、溶血和在各种疾病相关靶标上的非污染特性）进行优化的多样化化学修饰胜肽。总体而言，我们的结果表明，MCTS 指导的离散扩散是一种用于离散状态空间中多目标序列设计的强大且模块化的方法。", "author": "Sophia Tang et.al.", "authors": "Sophia Tang, Yinuo Zhang, Pranam Chatterjee", "id": "2412.17780v1", "paper_url": "http://arxiv.org/abs/2412.17780v1", "repo": "null"}}