{"2406.06017": {"publish_time": "2024-06-10", "title": "Neuro-TransUNet: Segmentation of stroke lesion in MRI using transformers", "paper_summary": "Accurate segmentation of the stroke lesions using magnetic resonance imaging\n(MRI) is associated with difficulties due to the complicated anatomy of the\nbrain and the different properties of the lesions. This study introduces the\nNeuro-TransUNet framework, which synergizes the U-Net's spatial feature\nextraction with SwinUNETR's global contextual processing ability, further\nenhanced by advanced feature fusion and segmentation synthesis techniques. The\ncomprehensive data pre-processing pipeline improves the framework's efficiency,\nwhich involves resampling, bias correction, and data standardization, enhancing\ndata quality and consistency. Ablation studies confirm the significant impact\nof the advanced integration of U-Net with SwinUNETR and data pre-processing\npipelines on performance and demonstrate the model's effectiveness. The\nproposed Neuro-TransUNet model, trained with the ATLAS v2.0 \\emph{training}\ndataset, outperforms existing deep learning algorithms and establishes a new\nbenchmark in stroke lesion segmentation.", "paper_summary_zh": "使用磁共振成像（MRI）準確分割中風病灶會因大腦結構複雜和病灶性質差異而產生困難。本研究提出 Neuro-TransUNet 框架，它將 U-Net 的空間特徵提取與 SwinUNETR 的全局脈絡處理能力結合起來，並進一步透過先進的特徵融合和分割合成技術進行強化。全面的資料預處理管線改善了框架的效率，其中包括重新取樣、偏差校正和資料標準化，以提升資料品質和一致性。消融研究證實了 U-Net 與 SwinUNETR 的先進整合，以及資料預處理管線對效能的重大影響，並證明了模型的有效性。所提出的 Neuro-TransUNet 模型使用 ATLAS v2.0 訓練資料集進行訓練，其表現優於現有的深度學習演算法，並在中風病灶分割中建立新的基準。", "author": "Muhammad Nouman et.al.", "authors": "Muhammad Nouman, Mohamed Mabrok, Essam A. Rashed", "id": "2406.06017v1", "paper_url": "http://arxiv.org/abs/2406.06017v1", "repo": "null"}}