{"2409.12087": {"publish_time": "2024-09-18", "title": "Towards Interpretable End-Stage Renal Disease (ESRD) Prediction: Utilizing Administrative Claims Data with Explainable AI Techniques", "paper_summary": "This study explores the potential of utilizing administrative claims data,\ncombined with advanced machine learning and deep learning techniques, to\npredict the progression of Chronic Kidney Disease (CKD) to End-Stage Renal\nDisease (ESRD). We analyze a comprehensive, 10-year dataset provided by a major\nhealth insurance organization to develop prediction models for multiple\nobservation windows using traditional machine learning methods such as Random\nForest and XGBoost as well as deep learning approaches such as Long Short-Term\nMemory (LSTM) networks. Our findings demonstrate that the LSTM model,\nparticularly with a 24-month observation window, exhibits superior performance\nin predicting ESRD progression, outperforming existing models in the\nliterature. We further apply SHapley Additive exPlanations (SHAP) analysis to\nenhance interpretability, providing insights into the impact of individual\nfeatures on predictions at the individual patient level. This study underscores\nthe value of leveraging administrative claims data for CKD management and\npredicting ESRD progression.", "paper_summary_zh": "本研究探討利用行政申報數據的潛力，結合進階機器學習和深度學習技術，以預測慢性腎臟疾病 (CKD) 進展至末期腎臟疾病 (ESRD)。我們分析一家大型健康保險組織提供的 10 年綜合數據集，以開發使用傳統機器學習方法（例如隨機森林和 XGBoost）以及深度學習方法（例如長短期記憶 (LSTM) 網路）的多個觀察窗口的預測模型。我們的研究結果表明，LSTM 模型，特別是在 24 個月的觀察窗口中，在預測 ESRD 進展方面表現優異，優於文獻中的現有模型。我們進一步應用 SHapley Additive exPlanations (SHAP) 分析來增強可解釋性，提供對個別特徵對個別患者層級預測影響的見解。本研究強調了利用行政申報數據進行 CKD 管理和預測 ESRD 進展的價值。", "author": "Yubo Li et.al.", "authors": "Yubo Li, Saba Al-Sayouri, Rema Padman", "id": "2409.12087v2", "paper_url": "http://arxiv.org/abs/2409.12087v2", "repo": "null"}}