{"2504.01951": {"publish_time": "2025-04-02", "title": "The LLM Wears Prada: Analysing Gender Bias and Stereotypes through Online Shopping Data", "paper_summary": "With the wide and cross-domain adoption of Large Language Models, it becomes\ncrucial to assess to which extent the statistical correlations in training\ndata, which underlie their impressive performance, hide subtle and potentially\ntroubling biases. Gender bias in LLMs has been widely investigated from the\nperspectives of works, hobbies, and emotions typically associated with a\nspecific gender. In this study, we introduce a novel perspective. We\ninvestigate whether LLMs can predict an individual's gender based solely on\nonline shopping histories and whether these predictions are influenced by\ngender biases and stereotypes. Using a dataset of historical online purchases\nfrom users in the United States, we evaluate the ability of six LLMs to\nclassify gender and we then analyze their reasoning and products-gender\nco-occurrences. Results indicate that while models can infer gender with\nmoderate accuracy, their decisions are often rooted in stereotypical\nassociations between product categories and gender. Furthermore, explicit\ninstructions to avoid bias reduce the certainty of model predictions, but do\nnot eliminate stereotypical patterns. Our findings highlight the persistent\nnature of gender biases in LLMs and emphasize the need for robust\nbias-mitigation strategies.", "paper_summary_zh": "隨著大型語言模型的廣泛和跨領域應用，評估其訓練數據中統計相關性（這是其出色表現的基礎）在多大程度上隱藏了微妙且可能令人不安的偏見，變得至關重要。大型語言模型中的性別偏見已從通常與特定性別相關的工作、愛好和情緒的角度得到廣泛研究。在本研究中，我們引入了一個新的視角。我們研究了大型語言模型是否可以僅根據線上購物歷史記錄來預測個人的性別，以及這些預測是否受到性別偏見和刻板印象的影響。利用來自美國用戶的歷史線上購物數據集，我們評估了六個大型語言模型的性別分類能力，然後分析了它們的推理和產品與性別的共現性。結果表明，雖然模型可以以中等準確度推斷性別，但它們的決策通常基於產品類別和性別之間的刻板印象關聯。此外，明確指示避免偏見會降低模型預測的確定性，但不會消除刻板印象模式。我們的研究結果突出了大型語言模型中性別偏見的持續性，並強調了對穩健的偏見緩解策略的需求。\n", "author": "Massimiliano Luca et.al.", "authors": "Massimiliano Luca, Ciro Beneduce, Bruno Lepri, Jacopo Staiano", "id": "2504.01951v1", "paper_url": "http://arxiv.org/abs/2504.01951v1", "repo": "null"}}