{"2409.11378": {"publish_time": "2024-09-17", "title": "Diversify and Conquer: Diversity-Centric Data Selection with Iterative Refinement", "paper_summary": "Finetuning large language models on instruction data is crucial for enhancing\npre-trained knowledge and improving instruction-following capabilities. As\ninstruction datasets proliferate, selecting optimal data for effective training\nbecomes increasingly important. This work addresses the question: How can we\ndetermine the optimal subset of data for effective training? While existing\nresearch often emphasizes local criteria like instance quality for subset\nselection, we argue that a global approach focused on data diversity is more\ncritical. Our method employs k-means clustering to ensure the selected subset\neffectively represents the full dataset. We propose an iterative refinement\nmethod inspired by active learning techniques to resample instances from\nclusters, reassessing each cluster's importance and sampling weight in every\ntraining iteration. This approach reduces the effect of outliers and\nautomatically filters out clusters containing low-quality data. Through\nextensive evaluation across natural language reasoning, general world\nknowledge, code and math reasoning tasks, and by fine-tuning models from\nvarious families, we observe consistent improvements, achieving a 7% increase\nover random selection and a 3.8% improvement over state-of-the-art sampling\nmethods. Our work highlights the significance of diversity-first sampling when\nfinetuning LLMs to enhance performance across a broad array of evaluation\ntasks. Our code is available at\nhttps://github.com/for-ai/iterative-data-selection.", "paper_summary_zh": "微調大型語言模型的指令資料對於增強預訓練知識和改進指令遵循能力至關重要。隨著指令資料集的激增，選擇最佳資料以進行有效訓練變得越來越重要。這項工作解決了以下問題：我們如何確定最佳資料子集以進行有效訓練？雖然現有的研究通常強調子集選擇的局部標準，例如例項品質，但我們認為專注於資料多樣性的整體方法更為關鍵。我們的模型採用 k 均值聚類法，以確保所選子集有效代表整個資料集。我們提出了一種受主動學習技術啟發的迭代改進方法，從群集中重新抽取例項，在每次訓練迭代中重新評估每個群集的重要性及抽樣權重。這種方法降低了異常值的效果，並自動過濾掉包含低品質資料的群集。透過自然語言推理、一般世界知識、程式碼和數學推理任務的廣泛評估，以及微調來自不同系列的模型，我們觀察到了一致的改進，隨機選擇增加了 7%，最先進的抽樣方法改進了 3.8%。我們的研究強調了在微調 LLM 以增強廣泛評估任務的效能時，以多樣性為優先的抽樣的顯著性。我們的程式碼可以在 https://github.com/for-ai/iterative-data-selection 取得。", "author": "Simon Yu et.al.", "authors": "Simon Yu, Liangyu Chen, Sara Ahmadian, Marzieh Fadaee", "id": "2409.11378v1", "paper_url": "http://arxiv.org/abs/2409.11378v1", "repo": "null"}}