{"2406.09098": {"publish_time": "2024-06-13", "title": "SciKnowEval: Evaluating Multi-level Scientific Knowledge of Large Language Models", "paper_summary": "The burgeoning utilization of Large Language Models (LLMs) in scientific\nresearch necessitates advanced benchmarks capable of evaluating their\nunderstanding and application of scientific knowledge comprehensively. To\naddress this need, we introduce the SciKnowEval benchmark, a novel framework\nthat systematically evaluates LLMs across five progressive levels of scientific\nknowledge: studying extensively, inquiring earnestly, thinking profoundly,\ndiscerning clearly, and practicing assiduously. These levels aim to assess the\nbreadth and depth of scientific knowledge in LLMs, including knowledge\ncoverage, inquiry and exploration capabilities, reflection and reasoning\nabilities, ethic and safety considerations, as well as practice proficiency.\nSpecifically, we take biology and chemistry as the two instances of SciKnowEval\nand construct a dataset encompassing 50K multi-level scientific problems and\nsolutions. By leveraging this dataset, we benchmark 20 leading open-source and\nproprietary LLMs using zero-shot and few-shot prompting strategies. The results\nreveal that despite achieving state-of-the-art performance, the proprietary\nLLMs still have considerable room for improvement, particularly in addressing\nscientific computations and applications. We anticipate that SciKnowEval will\nestablish a comprehensive standard for benchmarking LLMs in science research\nand discovery, and promote the development of LLMs that integrate scientific\nknowledge with strong safety awareness. The dataset and code are publicly\navailable at https://github.com/hicai-zju/sciknoweval .", "paper_summary_zh": "大型語言模型 (LLM) 在科學研究中的蓬勃發展，需要先進的基準來全面評估它們對科學知識的理解和應用能力。為了滿足這個需求，我們引入了 SciKnowEval 基準，這是一個新穎的框架，可以系統性地評估 LLM 在科學知識的五個漸進層面上：廣泛學習、認真探究、深入思考、清楚辨別和勤奮實踐。這些層級旨在評估 LLM 中科學知識的廣度和深度，包括知識涵蓋範圍、探究和探索能力、反思和推理能力、道德和安全考量以及實踐熟練度。具體來說，我們將生物學和化學作為 SciKnowEval 的兩個實例，並構建了一個包含 50K 多層級科學問題和解決方案的資料集。通過利用這個資料集，我們使用零次學習和少次學習提示策略對 20 個領先的開源和專有 LLM 進行基準測試。結果顯示，儘管取得了最先進的效能，但專有 LLM 仍有很大的改進空間，特別是在解決科學計算和應用方面。我們預期 SciKnowEval 將為科學研究和發現中的 LLM 基準測試建立一個全面的標準，並促進開發將科學知識與強烈的安全意識相結合的 LLM。資料集和程式碼已公開發布於 https://github.com/hicai-zju/sciknoweval。", "author": "Kehua Feng et.al.", "authors": "Kehua Feng, Keyan Ding, Weijie Wang, Xiang Zhuang, Zeyuan Wang, Ming Qin, Yu Zhao, Jianhua Yao, Qiang Zhang, Huajun Chen", "id": "2406.09098v1", "paper_url": "http://arxiv.org/abs/2406.09098v1", "repo": "https://github.com/hicai-zju/sciknoweval"}}