{"2502.10248": {"publish_time": "2025-02-14", "title": "Step-Video-T2V Technical Report: The Practice, Challenges, and Future of Video Foundation Model", "paper_summary": "We present Step-Video-T2V, a state-of-the-art text-to-video pre-trained model\nwith 30B parameters and the ability to generate videos up to 204 frames in\nlength. A deep compression Variational Autoencoder, Video-VAE, is designed for\nvideo generation tasks, achieving 16x16 spatial and 8x temporal compression\nratios, while maintaining exceptional video reconstruction quality. User\nprompts are encoded using two bilingual text encoders to handle both English\nand Chinese. A DiT with 3D full attention is trained using Flow Matching and is\nemployed to denoise input noise into latent frames. A video-based DPO approach,\nVideo-DPO, is applied to reduce artifacts and improve the visual quality of the\ngenerated videos. We also detail our training strategies and share key\nobservations and insights. Step-Video-T2V's performance is evaluated on a novel\nvideo generation benchmark, Step-Video-T2V-Eval, demonstrating its\nstate-of-the-art text-to-video quality when compared with both open-source and\ncommercial engines. Additionally, we discuss the limitations of current\ndiffusion-based model paradigm and outline future directions for video\nfoundation models. We make both Step-Video-T2V and Step-Video-T2V-Eval\navailable at https://github.com/stepfun-ai/Step-Video-T2V. The online version\ncan be accessed from https://yuewen.cn/videos as well. Our goal is to\naccelerate the innovation of video foundation models and empower video content\ncreators.", "paper_summary_zh": "<paragraph>我們提出 Step-Video-T2V，一個最先進的文字轉影片預訓練模型，具有 30B 參數，並能夠產生長達 204 幀的影片。一個深度壓縮變異自動編碼器 Video-VAE，專為影片產生任務而設計，可實現 16x16 空間和 8x 時間壓縮比，同時維持出色的影片重建品質。使用兩個雙語文字編碼器對使用者提示進行編碼，以處理英文和中文。使用流匹配訓練具有 3D 全注意力的 DiT，並用於將輸入雜訊去噪成潛在幀。應用基於影片的 DPO 方法 Video-DPO，以減少人工製品並提升產生影片的視覺品質。我們也詳細說明我們的訓練策略，並分享關鍵觀察和見解。Step-Video-T2V 的效能是在一個新穎的影片產生基準 Step-Video-T2V-Eval 上評估，與開源和商業引擎相比，展示其最先進的文字轉影片品質。此外，我們討論了當前基於擴散模型範例的限制，並概述影片基礎模型的未來方向。我們在 https://github.com/stepfun-ai/Step-Video-T2V 上提供 Step-Video-T2V 和 Step-Video-T2V-Eval。也可以從 https://yuewen.cn/videos 訪問線上版本。我們的目標是加速影片基礎模型的創新，並賦能影片內容創作者。</paragraph>", "author": "Guoqing Ma et.al.", "authors": "Guoqing Ma, Haoyang Huang, Kun Yan, Liangyu Chen, Nan Duan, Shengming Yin, Changyi Wan, Ranchen Ming, Xiaoniu Song, Xing Chen, Yu Zhou, Deshan Sun, Deyu Zhou, Jian Zhou, Kaijun Tan, Kang An, Mei Chen, Wei Ji, Qiling Wu, Wen Sun, Xin Han, Yanan Wei, Zheng Ge, Aojie Li, Bin Wang, Bizhu Huang, Bo Wang, Brian Li, Changxing Miao, Chen Xu, Chenfei Wu, Chenguang Yu, Dapeng Shi, Dingyuan Hu, Enle Liu, Gang Yu, Ge Yang, Guanzhe Huang, Gulin Yan, Haiyang Feng, Hao Nie, Haonan Jia, Hanpeng Hu, Hanqi Chen, Haolong Yan, Heng Wang, Hongcheng Guo, Huilin Xiong, Huixin Xiong, Jiahao Gong, Jianchang Wu, Jiaoren Wu, Jie Wu, Jie Yang, Jiashuai Liu, Jiashuo Li, Jingyang Zhang, Junjing Guo, Junzhe Lin, Kaixiang Li, Lei Liu, Lei Xia, Liang Zhao, Liguo Tan, Liwen Huang, Liying Shi, Ming Li, Mingliang Li, Muhua Cheng, Na Wang, Qiaohui Chen, Qinglin He, Qiuyan Liang, Quan Sun, Ran Sun, Rui Wang, Shaoliang Pang, Shiliang Yang, Sitong Liu, Siqi Liu, Shuli Gao, Tiancheng Cao, Tianyu Wang, Weipeng Ming, Wenqing He, Xu Zhao, Xuelin Zhang, Xianfang Zeng, Xiaojia Liu, Xuan Yang, Yaqi Dai, Yanbo Yu, Yang Li, Yineng Deng, Yingming Wang, Yilei Wang, Yuanwei Lu, Yu Chen, Yu Luo, Yuchu Luo, Yuhe Yin, Yuheng Feng, Yuxiang Yang, Zecheng Tang, Zekai Zhang, Zidong Yang, Binxing Jiao, Jiansheng Chen, Jing Li, Shuchang Zhou, Xiangyu Zhang, Xinhao Zhang, Yibo Zhu, Heung-Yeung Shum, Daxin Jiang", "id": "2502.10248v1", "paper_url": "http://arxiv.org/abs/2502.10248v1", "repo": "null"}}