{"2412.09104": {"publish_time": "2024-12-12", "title": "In-Dataset Trajectory Return Regularization for Offline Preference-based Reinforcement Learning", "paper_summary": "Offline preference-based reinforcement learning (PbRL) typically operates in\ntwo phases: first, use human preferences to learn a reward model and annotate\nrewards for a reward-free offline dataset; second, learn a policy by optimizing\nthe learned reward via offline RL. However, accurately modeling step-wise\nrewards from trajectory-level preference feedback presents inherent challenges.\nThe reward bias introduced, particularly the overestimation of predicted\nrewards, leads to optimistic trajectory stitching, which undermines the\npessimism mechanism critical to the offline RL phase. To address this\nchallenge, we propose In-Dataset Trajectory Return Regularization (DTR) for\noffline PbRL, which leverages conditional sequence modeling to mitigate the\nrisk of learning inaccurate trajectory stitching under reward bias.\nSpecifically, DTR employs Decision Transformer and TD-Learning to strike a\nbalance between maintaining fidelity to the behavior policy with high\nin-dataset trajectory returns and selecting optimal actions based on high\nreward labels. Additionally, we introduce an ensemble normalization technique\nthat effectively integrates multiple reward models, balancing the tradeoff\nbetween reward differentiation and accuracy. Empirical evaluations on various\nbenchmarks demonstrate the superiority of DTR over other state-of-the-art\nbaselines", "paper_summary_zh": "離線基於偏好的強化學習 (PbRL) 通常分為兩個階段：首先，使用人類偏好學習獎勵模型，並為無獎勵離線資料集註解獎勵；其次，通過離線 RL 最佳化學習的獎勵來學習策略。然而，從軌跡級別偏好回饋中準確建模逐步獎勵會帶來固有的挑戰。引入的獎勵偏差，特別是對預測獎勵的高估，會導致樂觀的軌跡拼接，這會破壞對離線 RL 階段至關重要的悲觀機制。為了應對這一挑戰，我們提出了離線 PbRL 的資料集內軌跡回報正則化 (DTR)，它利用條件序列建模來降低在獎勵偏差下學習不準確軌跡拼接的風險。具體來說，DTR 使用決策轉換器和 TD 學習來在保持對行為策略的忠誠度與高資料集軌跡回報之間取得平衡，並根據高獎勵標籤選擇最佳行動。此外，我們引入了一種集合正規化技術，它有效地整合了多個獎勵模型，平衡了獎勵區分度和準確性之間的權衡。在各種基準上的經驗評估證明了 DTR 優於其他最先進的基線", "author": "Songjun Tu et.al.", "authors": "Songjun Tu, Jingbo Sun, Qichao Zhang, Yaocheng Zhang, Jia Liu, Ke Chen, Dongbin Zhao", "id": "2412.09104v1", "paper_url": "http://arxiv.org/abs/2412.09104v1", "repo": "null"}}