{"2412.21006": {"publish_time": "2024-12-30", "title": "Verbosity-Aware Rationale Reduction: Effective Reduction of Redundant Rationale via Principled Criteria", "paper_summary": "Large Language Models (LLMs) rely on generating extensive intermediate\nreasoning units (e.g., tokens, sentences) to enhance final answer quality\nacross a wide range of complex tasks. While generating multiple reasoning paths\nor iteratively refining rationales proves effective for improving performance,\nthese approaches inevitably result in significantly higher inference costs. In\nthis work, we propose a novel sentence-level rationale reduction training\nframework that leverages likelihood-based criteria, verbosity, to identify and\nremove redundant reasoning sentences. Unlike previous approaches that utilize\ntoken-level reduction, our sentence-level reduction framework maintains model\nperformance while reducing generation length. This preserves the original\nreasoning abilities of LLMs and achieves an average 17.15% reduction in\ngeneration costs across various models and tasks.", "paper_summary_zh": "大型語言模型 (LLM) 仰賴產生廣泛的中間推理單元 (例如：符號、句子) 來提升在各種複雜任務中的最終答案品質。儘管產生多重推理路徑或反覆精進依據已證實能有效提升效能，但這些方法無可避免地會導致顯著更高的推論成本。在這項工作中，我們提出一個新穎的句子層級依據簡化訓練架構，該架構利用基於可能性的標準（冗長度）來識別並移除多餘的推理句子。與利用符號層級簡化的先前方法不同，我們的句子層級簡化架構在減少產生長度的同時，維持模型效能。這保留了 LLM 的原始推理能力，並在各種模型和任務中平均減少了 17.15% 的產生成本。", "author": "Joonwon Jang et.al.", "authors": "Joonwon Jang, Jaehee Kim, Wonbin Kweon, Hwanjo Yu", "id": "2412.21006v1", "paper_url": "http://arxiv.org/abs/2412.21006v1", "repo": "null"}}