{"2405.18292": {"publish_time": "2024-05-28", "title": "Semantic are Beacons: A Semantic Perspective for Unveiling Parameter-Efficient Fine-Tuning in Knowledge Learning", "paper_summary": "Parameter-Efficient Fine-Tuning (PEFT) methods enable efficient adaptation of\nLarge Language Models (LLMs) to various downstream applications. However, the\neffectiveness of the PEFT diminishes notably when downstream tasks require\naccurate learning of factual knowledge. In this paper, we adopt a semantic\nperspective to investigate this phenomenon, uncovering the reasons behind\nPEFT's limitations in knowledge learning task. Our findings reveal that: (1)\nPEFT presents a notable risk of pushing the model away from the intended\nknowledge target; (2) multiple knowledge interfere with each other, and such\ninterference suppresses the learning and expression of knowledge features.\nBased on these insights, we introduce a data filtering strategy to exclude data\nthat is detrimental to knowledge learning and a re-weighted learning strategy\nto make the model attentive to semantic distance during knowledge learning.\nExperimental results demonstrate the effectiveness of the proposed method on\nopen-source large language model, further validate the semantic challenge in\nPEFT, thus paving the way for future research.", "paper_summary_zh": "參數有效微調 (PEFT) 方法能有效地將大型語言模型 (LLM) 調整至各種下游應用。然而，當下游任務需要準確學習事實知識時，PEFT 的有效性會顯著降低。在本文中，我們採用語義觀點來探討這種現象，揭示 PEFT 在知識學習任務中的限制背後的原因。我們的研究結果表明：(1) PEFT 會帶來顯著風險，將模型推離預期的知識目標；(2) 多重知識會相互干擾，而這種干擾會抑制知識特徵的學習和表達。根據這些見解，我們引入資料過濾策略，排除對知識學習有害的資料，並重新加權學習策略，讓模型在知識學習過程中注意語義距離。實驗結果證明了所提出的方法對開源大型語言模型的有效性，進一步驗證了 PEFT 中的語義挑戰，從而為未來的研究鋪平道路。", "author": "Renzhi Wang et.al.", "authors": "Renzhi Wang, Piji Li", "id": "2405.18292v1", "paper_url": "http://arxiv.org/abs/2405.18292v1", "repo": "null"}}