{"2501.12975": {"publish_time": "2025-01-22", "title": "OnionEval: An Unified Evaluation of Fact-conflicting Hallucination for Small-Large Language Models", "paper_summary": "Large Language Models (LLMs) are highly capable but require significant\ncomputational resources for both training and inference. Within the LLM family,\nsmaller models (those with fewer than 10 billion parameters) also perform well\nacross various tasks. However, these smaller models share similar limitations\nto their larger counterparts, including the tendency to hallucinate. Despite\nthe existence of many benchmarks to evaluate hallucination in LLMs, few have\nspecifically focused on small LLMs (SLLMs). Additionally, SLLMs show widely\nvarying performance across different benchmarks. In this paper, we introduce\nOnionEval, a multi-layer structured framework with a specific metric called the\ncontext-influence score (CI), designed to effectively assess the\nfact-conflicting hallucination tendencies of small LLMs across different\ncontextual levels. Our experimental results reveal a key feature of SLLMs: they\nexcel in factual analysis but face challenges with context reasoning. Further\ninvestigation shows that a simple Chain-of-Thought strategy can significantly\nreduce these limitations, improving the practical usefulness of SLLMs in\nreal-world applications.", "paper_summary_zh": "大型語言模型 (LLM) 的能力極強，但無論是在訓練或推理上，都需要大量的運算資源。在 LLM 家族中，較小的模型（參數少於 100 億個）也能在各種任務中表現良好。然而，這些較小的模型與較大的模型一樣，有類似的限制，包括出現幻覺的傾向。儘管有許多基準來評估 LLM 中的幻覺，但鮮少專注於小型 LLM (SLLM)。此外，SLLM 在不同的基準中表現差異很大。在本文中，我們介紹了 OnionEval，這是一個多層結構框架，有一個稱為上下文影響分數 (CI) 的特定指標，旨在有效評估不同上下文層級中小型 LLM 的事實衝突幻覺傾向。我們的實驗結果揭示了 SLLM 的一個關鍵特徵：它們在事實分析中表現出色，但在上下文推理方面面臨挑戰。進一步的調查顯示，一個簡單的思考鏈策略可以顯著減少這些限制，提高 SLLM 在實際應用中的實用性。", "author": "Chongren Sun et.al.", "authors": "Chongren Sun, Yuran Li, Di Wu, Benoit Boulet", "id": "2501.12975v1", "paper_url": "http://arxiv.org/abs/2501.12975v1", "repo": "https://github.com/sunchongren/onioneval"}}