{"2411.06858": {"publish_time": "2024-11-11", "title": "Scientific machine learning in ecological systems: A study on the predator-prey dynamics", "paper_summary": "In this study, we apply two pillars of Scientific Machine Learning: Neural\nOrdinary Differential Equations (Neural ODEs) and Universal Differential\nEquations (UDEs) to the Lotka Volterra Predator Prey Model, a fundamental\necological model describing the dynamic interactions between predator and prey\npopulations. The Lotka-Volterra model is critical for understanding ecological\ndynamics, population control, and species interactions, as it is represented by\na system of differential equations. In this work, we aim to uncover the\nunderlying differential equations without prior knowledge of the system,\nrelying solely on training data and neural networks. Using robust modeling in\nthe Julia programming language, we demonstrate that both Neural ODEs and UDEs\ncan be effectively utilized for prediction and forecasting of the\nLotka-Volterra system. More importantly, we introduce the forecasting breakdown\npoint: the time at which forecasting fails for both Neural ODEs and UDEs. We\nobserve how UDEs outperform Neural ODEs by effectively recovering the\nunderlying dynamics and achieving accurate forecasting with significantly less\ntraining data. Additionally, we introduce Gaussian noise of varying magnitudes\n(from mild to high) to simulate real-world data perturbations and show that\nUDEs exhibit superior robustness, effectively recovering the underlying\ndynamics even in the presence of noisy data, while Neural ODEs struggle with\nhigh levels of noise. Through extensive hyperparameter optimization, we offer\ninsights into neural network architectures, activation functions, and\noptimizers that yield the best results. This study opens the door to applying\nScientific Machine Learning frameworks for forecasting tasks across a wide\nrange of ecological and scientific domains.", "paper_summary_zh": "<paragraph>在這項研究中，我們運用科學機器學習的兩大支柱：神經常微分方程式 (Neural ODE) 和通用微分方程式 (UDE) 到 Lotka Volterra 掠食者獵物模型，這是一個描述掠食者和獵物族群之間動態交互作用的基本生態模型。Lotka-Volterra 模型對於了解生態動力學、族群控制和物種交互至關重要，因為它是由微分方程式系統表示。在這項工作中，我們旨在揭示在沒有系統先備知識的情況下，僅依賴訓練資料和神經網路的基礎微分方程式。使用 Julia 程式語言中的強健建模，我們證明了神經 ODE 和 UDE 都可以有效地用於 Lotka-Volterra 系統的預測和預報。更重要的是，我們引入了預測崩潰點：神經 ODE 和 UDE 預測失敗的時間。我們觀察到 UDE 如何通過有效地恢復基礎動態並在訓練資料顯著減少的情況下實現準確預測，從而優於神經 ODE。此外，我們引入了不同大小的 Gaussian 雜訊（從輕微到高）來模擬真實世界的資料擾動，並表明 UDE 表現出優異的穩健性，即使在有雜訊資料的情況下也能有效恢復基礎動態，而神經 ODE 則難以應付高水準的雜訊。透過廣泛的超參數最佳化，我們深入了解了神經網路架構、啟動函數和最佳化器，這些架構、函數和最佳化器可產生最佳結果。這項研究開啟了應用科學機器學習架構進行預測任務的大門，涵蓋廣泛的生態和科學領域。</paragraph>", "author": "Ranabir Devgupta et.al.", "authors": "Ranabir Devgupta, Raj Abhijit Dandekar, Rajat Dandekar, Sreedath Panat", "id": "2411.06858v1", "paper_url": "http://arxiv.org/abs/2411.06858v1", "repo": "null"}}