{"2502.03032": {"publish_time": "2025-02-05", "title": "Analyze Feature Flow to Enhance Interpretation and Steering in Language Models", "paper_summary": "We introduce a new approach to systematically map features discovered by\nsparse autoencoder across consecutive layers of large language models,\nextending earlier work that examined inter-layer feature links. By using a\ndata-free cosine similarity technique, we trace how specific features persist,\ntransform, or first appear at each stage. This method yields granular flow\ngraphs of feature evolution, enabling fine-grained interpretability and\nmechanistic insights into model computations. Crucially, we demonstrate how\nthese cross-layer feature maps facilitate direct steering of model behavior by\namplifying or suppressing chosen features, achieving targeted thematic control\nin text generation. Together, our findings highlight the utility of a causal,\ncross-layer interpretability framework that not only clarifies how features\ndevelop through forward passes but also provides new means for transparent\nmanipulation of large language models.", "paper_summary_zh": "我們提出了一種新的方法，可以系統性地對大型語言模型中連續層中稀疏自動編碼器發現的功能進行對應，擴展了先前檢視層間功能連結的研究。透過使用無資料的餘弦相似性技術，我們追蹤特定功能如何持續、轉換或首次出現在每個階段。此方法產生了功能演化的細粒度流程圖，能精細地解釋模型運算並提供機制見解。至關重要的是，我們展示了這些跨層功能對應如何透過放大或抑制所選功能來促進直接引導模型行為，在文字生成中實現目標主題控制。我們的研究結果共同突出了因果、跨層可解釋性架構的效用，它不僅闡明了功能如何透過前向傳遞而發展，還提供了透明操作大型語言模型的新方法。", "author": "Daniil Laptev et.al.", "authors": "Daniil Laptev, Nikita Balagansky, Yaroslav Aksenov, Daniil Gavrilov", "id": "2502.03032v1", "paper_url": "http://arxiv.org/abs/2502.03032v1", "repo": "null"}}