{"2409.12411": {"publish_time": "2024-09-19", "title": "Textualized Agent-Style Reasoning for Complex Tasks by Multiple Round LLM Generation", "paper_summary": "Chain-of-thought prompting significantly boosts the reasoning ability of\nlarge language models but still faces three issues: hallucination problem,\nrestricted interpretability, and uncontrollable generation. To address these\nchallenges, we present AgentCOT, a llm-based autonomous agent framework, which\ncan solve complex problems in an agent-style manner by multiple round LLM\ngeneration. At each step, AgentCOT selects an action and executes it to yield\nan intermediate result with supporting evidence. In addition, we integrate the\nstep's index into the reasoning process to form a graph structure for complex\ninference logic. We introduce two new strategies to enhance the performance of\nAgentCOT.We conduct extensive experiments to verify the effectiveness of our\nmethod on six common benchmarks. Results exhibit that our method brings in\nsubstantial improvements over current competitive approaches.", "paper_summary_zh": "鏈條思考提示顯著提升大型語言模型的推理能力，但仍面臨三個問題：幻覺問題、受限的可解釋性，以及無法控制的生成。為了應對這些挑戰，我們提出了 AgentCOT，一個基於 llm 的自主代理架構，它可以通過多輪 LLM 生成以代理樣式解決複雜問題。在每一步中，AgentCOT 選擇一個動作並執行它，以產生一個具有支持證據的中間結果。此外，我們將步驟索引整合到推理過程中，以形成一個圖形結構，用於複雜的推理邏輯。我們引入了兩種新策略來增強 AgentCOT 的性能。我們進行了廣泛的實驗，以驗證我們的方法在六個常見基準上的有效性。結果表明，我們的的方法比當前的競爭方法有了顯著的改進。", "author": "Chen Liang et.al.", "authors": "Chen Liang, Zhifan Feng, Zihe Liu, Wenbin Jiang, Jinan Xu, Yufeng Chen, Yong Wang", "id": "2409.12411v1", "paper_url": "http://arxiv.org/abs/2409.12411v1", "repo": "null"}}