{"2502.12911": {"publish_time": "2025-02-18", "title": "Knapsack Optimization-based Schema Linking for LLM-based Text-to-SQL Generation", "paper_summary": "Generating SQLs from user queries is a long-standing challenge, where the\naccuracy of initial schema linking significantly impacts subsequent SQL\ngeneration performance. However, current schema linking models still struggle\nwith missing relevant schema elements or an excess of redundant ones. A crucial\nreason for this is that commonly used metrics, recall and precision, fail to\ncapture relevant element missing and thus cannot reflect actual schema linking\nperformance. Motivated by this, we propose an enhanced schema linking metric by\nintroducing a restricted missing indicator. Accordingly, we introduce Knapsack\noptimization-based Schema Linking Agent (KaSLA), a plug-in schema linking agent\ndesigned to prevent the missing of relevant schema elements while minimizing\nthe inclusion of redundant ones. KaSLA employs a hierarchical linking strategy\nthat first identifies the optimal table linking and subsequently links columns\nwithin the selected table to reduce linking candidate space. In each linking\nprocess, it utilize a knapsack optimization approach to link potentially\nrelevant elements while accounting for a limited tolerance of potential\nredundant ones.With this optimization, KaSLA-1.6B achieves superior schema\nlinking results compared to large-scale LLMs, including deepseek-v3 with\nstate-of-the-art (SOTA) schema linking method. Extensive experiments on Spider\nand BIRD benchmarks verify that KaSLA can significantly improve the SQL\ngeneration performance of SOTA text-to-SQL models by substituting their schema\nlinking processes.", "paper_summary_zh": "從使用者查詢中產生 SQL 是個長期的挑戰，其中初始架構連結的準確性會顯著影響後續 SQL 產生效能。然而，目前的架構連結模型仍難以處理遺漏相關架構元素或過多重複元素的問題。造成此問題的一個關鍵原因是，常用的指標召回率和精確度無法捕捉遺漏相關元素，因此無法反映實際的架構連結效能。有鑑於此，我們提出一個增強的架構連結指標，透過引入受限遺漏指標。因此，我們介紹基於背包最佳化的架構連結代理 (KaSLA)，這是一個外掛式架構連結代理，旨在防止遺漏相關架構元素，同時將重複元素的納入降至最低。KaSLA 採用分層連結策略，首先找出最佳的表格連結，然後連結所選表格中的欄位，以減少連結候選空間。在每個連結過程中，它利用背包最佳化方法連結潛在相關元素，同時考量對潛在重複元素的容忍度。透過此最佳化，KaSLA-1.6B 達到優於大規模 LLM 的架構連結結果，包括採用最先進 (SOTA) 架構連結方法的 deepseek-v3。在 Spider 和 BIRD 基準上的廣泛實驗驗證，KaSLA 可透過取代其架構連結流程，大幅提升 SOTA 文字轉 SQL 模型的 SQL 產生效能。", "author": "Zheng Yuan et.al.", "authors": "Zheng Yuan, Hao Chen, Zijin Hong, Qinggang Zhang, Feiran Huang, Xiao Huang", "id": "2502.12911v1", "paper_url": "http://arxiv.org/abs/2502.12911v1", "repo": "null"}}