{"2410.10456": {"publish_time": "2024-10-14", "title": "Ada-K Routing: Boosting the Efficiency of MoE-based LLMs", "paper_summary": "In the era of Large Language Models (LLMs), Mixture-of-Experts (MoE)\narchitectures offer a promising approach to managing computational costs while\nscaling up model parameters. Conventional MoE-based LLMs typically employ\nstatic Top-K routing, which activates a fixed and equal number of experts for\neach token regardless of their significance within the context. In this paper,\nwe propose a novel Ada-K routing strategy that dynamically adjusts the number\nof activated experts for each token, thereby improving the balance between\ncomputational efficiency and model performance. Specifically, our strategy\nincorporates learnable and lightweight allocator modules that decide customized\nexpert resource allocation tailored to the contextual needs for each token.\nThese allocators are designed to be fully pluggable, making it broadly\napplicable across all mainstream MoE-based LLMs. We leverage the Proximal\nPolicy Optimization (PPO) algorithm to facilitate an end-to-end learning\nprocess for this non-differentiable decision-making framework. Extensive\nevaluations on four popular baseline models demonstrate that our Ada-K routing\nmethod significantly outperforms conventional Top-K routing. Compared to Top-K,\nour method achieves over 25% reduction in FLOPs and more than 20% inference\nspeedup while still improving performance across various benchmarks. Moreover,\nthe training of Ada-K is highly efficient. Even for Mixtral-8x22B, a MoE-based\nLLM with more than 140B parameters, the training time is limited to 8 hours.\nDetailed analysis shows that harder tasks, middle layers, and content words\ntend to activate more experts, providing valuable insights for future adaptive\nMoE system designs. Both the training code and model checkpoints will be\npublicly available.", "paper_summary_zh": "<paragraph>在大型語言模型 (LLM) 時代，混合專家 (MoE) 架構提供了一種有前景的方法，可以在擴充模型參數的同時管理運算成本。基於 MoE 的傳統 LLM 通常採用靜態 Top-K 路由，無論符號在上下文中的重要性如何，都會為每個符號啟用固定且相等的專家數量。在本文中，我們提出了一種新穎的 Ada-K 路由策略，它會動態調整每個符號的已啟用專家數量，從而改善運算效率和模型效能之間的平衡。具體來說，我們的策略包含可學習且輕量化的配置器模組，這些模組會針對每個符號的上下文需求決定自訂的專家資源配置。這些配置器被設計為完全可插入，使其廣泛適用於所有主流的基於 MoE 的 LLM。我們利用近端策略最佳化 (PPO) 演算法來促進這個不可微分決策制定架構的端對端學習過程。對四個流行的基線模型進行廣泛評估，證明我們的 Ada-K 路由方法顯著優於傳統的 Top-K 路由。與 Top-K 相比，我們的模型在 FLOP 方面減少了 25% 以上，推理速度加快了 20% 以上，同時仍改善了各種基準測試的效能。此外，Ada-K 的訓練非常有效率。即使對於 Mixtral-8x22B，一個具有超過 140B 參數的基於 MoE 的 LLM，訓練時間也限制在 8 小時內。詳細分析顯示，較困難的任務、中間層和內容詞傾向於啟用更多專家，這為未來的自適應 MoE 系統設計提供了寶貴的見解。訓練程式碼和模型檢查點將公開提供。</paragraph>", "author": "Tongtian Yue et.al.", "authors": "Tongtian Yue, Longteng Guo, Jie Cheng, Xuange Gao, Jing Liu", "id": "2410.10456v2", "paper_url": "http://arxiv.org/abs/2410.10456v2", "repo": "null"}}