{"2407.07799": {"publish_time": "2024-07-10", "title": "Attribute or Abstain: Large Language Models as Long Document Assistants", "paper_summary": "LLMs can help humans working with long documents, but are known to\nhallucinate. Attribution can increase trust in LLM responses: The LLM provides\nevidence that supports its response, which enhances verifiability. Existing\napproaches to attribution have only been evaluated in RAG settings, where the\ninitial retrieval confounds LLM performance. This is crucially different from\nthe long document setting, where retrieval is not needed, but could help. Thus,\na long document specific evaluation of attribution is missing. To fill this\ngap, we present LAB, a benchmark of 6 diverse long document tasks with\nattribution, and experiment with different approaches to attribution on 4 LLMs\nof different sizes, both prompted and fine-tuned. We find that citation, i.e.\nresponse generation and evidence extraction in one step, mostly performs best.\nWe investigate whether the ``Lost in the Middle'' phenomenon exists for\nattribution, but do not find this. We also find that evidence quality can\npredict response quality on datasets with simple responses, but not so for\ncomplex responses, as models struggle with providing evidence for complex\nclaims. We release code and data for further investigation.", "paper_summary_zh": "大型語言模型可以幫助人類處理長篇文件，但它們會出現幻覺。標示出處可以增加對大型語言模型回應的信任：大型語言模型提供了支持其回應的證據，這增強了可驗證性。現有的歸因方法僅在 RAG 設定中進行評估，其中初始檢索會混淆大型語言模型的效能。這與不需要檢索但可能有所幫助的長篇文件設定有根本上的不同。因此，缺少針對長篇文件的特定歸因評估。為了填補這個空白，我們提出了 LAB，這是一個包含 6 項不同長篇文件任務的基準，並在 4 個不同規模的大型語言模型上嘗試不同的歸因方法，包括提示式和微調。我們發現引文，即一步完成回應產生和證據提取，通常表現最佳。我們探討了「迷失在中間」現象是否存在於歸因中，但沒有發現。我們還發現，在回應簡單的資料集上，證據品質可以預測回應品質，但對於複雜的回應則不然，因為模型難以提供複雜說法的證據。我們釋出程式碼和資料以供進一步探討。", "author": "Jan Buchmann et.al.", "authors": "Jan Buchmann, Xiao Liu, Iryna Gurevych", "id": "2407.07799v1", "paper_url": "http://arxiv.org/abs/2407.07799v1", "repo": "https://github.com/ukplab/arxiv2024-attribute-or-abstain"}}