{"2410.22790": {"publish_time": "2024-10-30", "title": "Dual Contrastive Transformer for Hierarchical Preference Modeling in Sequential Recommendation", "paper_summary": "Sequential recommender systems (SRSs) aim to predict the subsequent items\nwhich may interest users via comprehensively modeling users' complex preference\nembedded in the sequence of user-item interactions. However, most of existing\nSRSs often model users' single low-level preference based on item ID\ninformation while ignoring the high-level preference revealed by item attribute\ninformation, such as item category. Furthermore, they often utilize limited\nsequence context information to predict the next item while overlooking richer\ninter-item semantic relations. To this end, in this paper, we proposed a novel\nhierarchical preference modeling framework to substantially model the complex\nlow- and high-level preference dynamics for accurate sequential recommendation.\nSpecifically, in the framework, a novel dual-transformer module and a novel\ndual contrastive learning scheme have been designed to discriminatively learn\nusers' low- and high-level preference and to effectively enhance both low- and\nhigh-level preference learning respectively. In addition, a novel\nsemantics-enhanced context embedding module has been devised to generate more\ninformative context embedding for further improving the recommendation\nperformance. Extensive experiments on six real-world datasets have demonstrated\nboth the superiority of our proposed method over the state-of-the-art ones and\nthe rationality of our design.", "paper_summary_zh": "序列推薦系統 (SRS) 的目的是預測後續項目，這些項目可能透過全面建模嵌入在使用者與項目互動序列中的使用者的複雜偏好來引起使用者的興趣。然而，現有的 SRS 大多常根據項目 ID 資訊來建模使用者的單一低層級偏好，同時忽略項目屬性資訊（例如項目類別）所揭示的高層級偏好。此外，他們通常利用有限的序列脈絡資訊來預測下一個項目，同時忽略更豐富的項目間語義關係。為此，在本文中，我們提出了一個新穎的分層偏好建模架構，以實質性地建模複雜的低層級和高層級偏好動態，以進行準確的序列推薦。具體來說，在該架構中，設計了一個新穎的雙重Transformer模組和一個新穎的雙重對比學習方案，分別用於區別性地學習使用者的低層級和高層級偏好，並有效地增強低層級和高層級偏好學習。此外，還設計了一個新穎的語義增強脈絡嵌入模組，以產生更多資訊性的脈絡嵌入，進一步改善推薦效能。在六個真實世界資料集上進行的大量實驗證明了我們提出的方法優於現有技術，以及我們設計的合理性。", "author": "Chengkai Huang et.al.", "authors": "Chengkai Huang, Shoujin Wang, Xianzhi Wang, Lina Yao", "id": "2410.22790v1", "paper_url": "http://arxiv.org/abs/2410.22790v1", "repo": "null"}}