{"2501.00885": {"publish_time": "2025-01-01", "title": "Representation in large language models", "paper_summary": "The extraordinary success of recent Large Language Models (LLMs) on a diverse\narray of tasks has led to an explosion of scientific and philosophical\ntheorizing aimed at explaining how they do what they do. Unfortunately,\ndisagreement over fundamental theoretical issues has led to stalemate, with\nentrenched camps of LLM optimists and pessimists often committed to very\ndifferent views of how these systems work. Overcoming stalemate requires\nagreement on fundamental questions, and the goal of this paper is to address\none such question, namely: is LLM behavior driven partly by\nrepresentation-based information processing of the sort implicated in\nbiological cognition, or is it driven entirely by processes of memorization and\nstochastic table look-up? This is a question about what kind of algorithm LLMs\nimplement, and the answer carries serious implications for higher level\nquestions about whether these systems have beliefs, intentions, concepts,\nknowledge, and understanding. I argue that LLM behavior is partially driven by\nrepresentation-based information processing, and then I describe and defend a\nseries of practical techniques for investigating these representations and\ndeveloping explanations on their basis. The resulting account provides a\ngroundwork for future theorizing about language models and their successors.", "paper_summary_zh": "最近的大型语言模型 (LLM) 在各种任务上取得了非凡的成功，这引发了科学和哲学理论的爆炸式增长，旨在解释它们如何发挥作用。不幸的是，对基本理论问题的分歧导致了僵局，LLM 乐观主义者和悲观主义者的根深蒂固的阵营经常对这些系统如何工作持有截然不同的看法。克服僵局需要就基本问题达成一致，本文的目标是解决这样一个问题，即：LLM 行为是否部分由涉及生物认知的基于表示的信息处理驱动，还是完全由记忆和随机查找表驱动？这是一个关于 LLM 实现哪种算法的问题，答案对关于这些系统是否有信念、意图、概念、知识和理解的高级问题具有严重影响。我认为 LLM 行为部分是由基于表示的信息处理驱动的，然后我描述并捍卫了一系列用于调查这些表示并在此基础上制定解释的实用技术。由此产生的解释为未来关于语言模型及其继任者的理论化提供了基础。", "author": "Cameron C. Yetman et.al.", "authors": "Cameron C. Yetman", "id": "2501.00885v1", "paper_url": "http://arxiv.org/abs/2501.00885v1", "repo": "null"}}