{"2411.13322": {"publish_time": "2024-11-20", "title": "Scaling Laws for Online Advertisement Retrieval", "paper_summary": "The scaling law is a notable property of neural network models and has\nsignificantly propelled the development of large language models. Scaling laws\nhold great promise in guiding model design and resource allocation. Recent\nresearch increasingly shows that scaling laws are not limited to NLP tasks or\nTransformer architectures; they also apply to domains such as recommendation.\nHowever, there is still a lack of literature on scaling law research in online\nadvertisement retrieval systems. This may be because 1) identifying the scaling\nlaw for resource cost and online revenue is often expensive in both time and\ntraining resources for large-scale industrial applications, and 2) varying\nsettings for different systems prevent the scaling law from being applied\nacross various scenarios. To address these issues, we propose a lightweight\nparadigm to identify the scaling law of online revenue and machine cost for a\ncertain online advertisement retrieval scenario with a low experimental cost.\nSpecifically, we focus on a sole factor (FLOPs) and propose an offline metric\nnamed R/R* that exhibits a high linear correlation with online revenue for\nretrieval models. We estimate the machine cost offline via a simulation\nalgorithm. Thus, we can transform most online experiments into low-cost offline\nexperiments. We conduct comprehensive experiments to verify the effectiveness\nof our proposed metric R/R* and to identify the scaling law in the online\nadvertisement retrieval system of Kuaishou. With the scaling law, we\ndemonstrate practical applications for ROI-constrained model designing and\nmulti-scenario resource allocation in Kuaishou advertising system. To the best\nof our knowledge, this is the first work to study the scaling laws for online\nadvertisement retrieval of real-world systems, showing great potential for\nscaling law in advertising system optimization.", "paper_summary_zh": "<paragraph>規模定律是神經網路模型的顯著特性，並已顯著推動大型語言模型的發展。規模定律在指導模型設計和資源分配方面具有很大的前景。最近的研究越來越表明，規模定律不僅限於 NLP 任務或 Transformer 架構；它們也適用於推薦等領域。然而，在線上廣告檢索系統中，關於規模定律研究的文獻仍然缺乏。這可能是因為 1) 針對大規模產業應用，找出資源成本和線上收益的規模定律通常在時間和訓練資源上很昂貴，以及 2) 不同系統的設定不同，會妨礙規模定律應用於各種場景。為了解決這些問題，我們提出了一個輕量的範例，以低實驗成本找出線上收益和機器成本的規模定律，適用於特定的線上廣告檢索場景。具體來說，我們專注於單一因素 (FLOP)，並提出一個名為 R/R* 的離線指標，它與檢索模型的線上收益呈現高度線性相關性。我們透過模擬演算法估計離線機器成本。因此，我們可以將大多數線上實驗轉換為低成本離線實驗。我們進行了全面的實驗，以驗證我們提出的指標 R/R* 的有效性，並找出快手線上廣告檢索系統中的規模定律。有了規模定律，我們展示了 ROI 受限模型設計和快手廣告系統中多場景資源分配的實際應用。據我們所知，這是第一個研究真實世界系統的線上廣告檢索規模定律的研究，顯示了規模定律在廣告系統最佳化方面的巨大潛力。</paragraph>", "author": "Yunli Wang et.al.", "authors": "Yunli Wang, Zixuan Yang, Zhen Zhang, Zhiqiang Wang, Jian Yang, Shiyang Wen, Peng Jiang, Kun Gai", "id": "2411.13322v1", "paper_url": "http://arxiv.org/abs/2411.13322v1", "repo": "null"}}