{"2501.01110": {"publish_time": "2025-01-02", "title": "MalCL: Leveraging GAN-Based Generative Replay to Combat Catastrophic Forgetting in Malware Classification", "paper_summary": "Continual Learning (CL) for malware classification tackles the rapidly\nevolving nature of malware threats and the frequent emergence of new types.\nGenerative Replay (GR)-based CL systems utilize a generative model to produce\nsynthetic versions of past data, which are then combined with new data to\nretrain the primary model. Traditional machine learning techniques in this\ndomain often struggle with catastrophic forgetting, where a model's performance\non old data degrades over time.\n  In this paper, we introduce a GR-based CL system that employs Generative\nAdversarial Networks (GANs) with feature matching loss to generate high-quality\nmalware samples. Additionally, we implement innovative selection schemes for\nreplay samples based on the model's hidden representations.\n  Our comprehensive evaluation across Windows and Android malware datasets in a\nclass-incremental learning scenario -- where new classes are introduced\ncontinuously over multiple tasks -- demonstrates substantial performance\nimprovements over previous methods. For example, our system achieves an average\naccuracy of 55% on Windows malware samples, significantly outperforming other\nGR-based models by 28%. This study provides practical insights for advancing\nGR-based malware classification systems. The implementation is available at\n\\url {https://github.com/MalwareReplayGAN/MalCL}\\footnote{The code will be made\npublic upon the presentation of the paper}.", "paper_summary_zh": "持續學習 (CL) 用於惡意軟體分類，應對惡意軟體威脅快速演變的本質和新類型的頻繁出現。基於生成式重播 (GR) 的 CL 系統利用生成式模型來產生過去資料的合成版本，然後將其與新資料結合以重新訓練主要模型。此領域的傳統機器學習技術通常會陷入災難性遺忘，其中模型對舊資料的效能會隨著時間推移而下降。\n在本文中，我們介紹了一個基於 GR 的 CL 系統，該系統採用具有特徵匹配損失的生成式對抗網路 (GAN) 來產生高品質的惡意軟體範例。此外，我們實作創新的重播範例選擇方案，這些方案基於模型的隱藏表示。\n我們在 Windows 和 Android 惡意軟體資料集中的全面評估，在類別遞增學習場景中（其中新類別會在多個任務中持續引入），證明了相較於先前的方法有顯著的效能提升。例如，我們的系統在 Windows 惡意軟體範例上達到了 55% 的平均準確度，顯著優於其他基於 GR 的模型 28%。這項研究提供了實用的見解，用於推進基於 GR 的惡意軟體分類系統。實作可在以下網址取得：\\url {https://github.com/MalwareReplayGAN/MalCL}\\footnote{程式碼將在論文發表後公開}。", "author": "Jimin Park et.al.", "authors": "Jimin Park, AHyun Ji, Minji Park, Mohammad Saidur Rahman, Se Eun Oh", "id": "2501.01110v1", "paper_url": "http://arxiv.org/abs/2501.01110v1", "repo": "null"}}