{"2405.06105": {"publish_time": "2024-05-09", "title": "Can Perplexity Reflect Large Language Model's Ability in Long Text Understanding?", "paper_summary": "Recent studies have shown that Large Language Models (LLMs) have the\npotential to process extremely long text. Many works only evaluate LLMs'\nlong-text processing ability on the language modeling task, with perplexity\n(PPL) as the evaluation metric. However, in our study, we find that there is no\ncorrelation between PPL and LLMs' long-text understanding ability. Besides, PPL\nmay only reflect the model's ability to model local information instead of\ncatching long-range dependency. Therefore, only using PPL to prove the model\ncould process long text is inappropriate. The local focus feature of PPL could\nalso explain some existing phenomena, such as the great extrapolation ability\nof the position method ALiBi. When evaluating a model's ability in long text,\nwe might pay more attention to PPL's limitation and avoid overly relying on it.", "paper_summary_zh": "最近的研究表明，大型語言模型 (LLM) 具有處理極長文本的潛力。許多作品僅在語言建模任務上評估 LLM 的長文本處理能力，並以困惑度 (PPL) 作為評估指標。然而，在我們的研究中，我們發現 PPL 與 LLM 的長文本理解能力之間沒有相關性。此外，PPL 可能只反映模型對局部資訊建模的能力，而不是捕捉長距離依賴關係。因此，僅使用 PPL 來證明模型可以處理長文本是不適當的。PPL 的局部關注特徵也可以解釋一些現有現象，例如位置方法 ALiBi 的強大外推能力。在評估模型在長文本中的能力時，我們可能更關注 PPL 的限制，並避免過度依賴它。", "author": "Yutong Hu et.al.", "authors": "Yutong Hu, Quzhe Huang, Mingxu Tao, Chen Zhang, Yansong Feng", "id": "2405.06105v1", "paper_url": "http://arxiv.org/abs/2405.06105v1", "repo": "null"}}