{"2407.02813": {"publish_time": "2024-07-03", "title": "Data Overfitting for On-Device Super-Resolution with Dynamic Algorithm and Compiler Co-Design", "paper_summary": "Deep neural networks (DNNs) are frequently employed in a variety of computer\nvision applications. Nowadays, an emerging trend in the current video\ndistribution system is to take advantage of DNN's overfitting properties to\nperform video resolution upscaling. By splitting videos into chunks and\napplying a super-resolution (SR) model to overfit each chunk, this scheme of SR\nmodels plus video chunks is able to replace traditional video transmission to\nenhance video quality and transmission efficiency. However, many models and\nchunks are needed to guarantee high performance, which leads to tremendous\noverhead on model switching and memory footprints at the user end. To resolve\nsuch problems, we propose a Dynamic Deep neural network assisted by a\nContent-Aware data processing pipeline to reduce the model number down to one\n(Dy-DCA), which helps promote performance while conserving computational\nresources. Additionally, to achieve real acceleration on the user end, we\ndesigned a framework that optimizes dynamic features (e.g., dynamic shapes,\nsizes, and control flow) in Dy-DCA to enable a series of compilation\noptimizations, including fused code generation, static execution planning, etc.\nBy employing such techniques, our method achieves better PSNR and real-time\nperformance (33 FPS) on an off-the-shelf mobile phone. Meanwhile, assisted by\nour compilation optimization, we achieve a 1.7$\\times$ speedup while saving up\nto 1.61$\\times$ memory consumption. Code available in\nhttps://github.com/coulsonlee/Dy-DCA-ECCV2024.", "paper_summary_zh": "深度神经網路 (DNN) 經常運用於各種電腦視覺應用中。現在，當前影片分發系統中出現的新趨勢是利用 DNN 的過擬合特性來執行影片解析度升頻。透過將影片分割成區塊，並對每個區塊套用超解析度 (SR) 模型來過擬合，這種 SR 模型加上影片區塊的架構能夠取代傳統的影片傳輸，以提升影片品質和傳輸效率。然而，需要許多模型和區塊才能保證高性能，這會導致使用者端在模型切換和記憶體使用量上產生極大的負擔。為了解決這些問題，我們提出了一個由內容感知資料處理管線輔助的動態深度神經網路，將模型數量減少到一個 (Dy-DCA)，這有助於提升性能，同時節省運算資源。此外，為了在使用者端實現真正的加速，我們設計了一個架構，用於最佳化 Dy-DCA 中的動態特徵（例如，動態形狀、大小和控制流程），以進行一系列編譯最佳化，包括融合程式碼產生、靜態執行規劃等。透過採用這種技術，我們的程式在現成的行動電話上實現了更好的 PSNR 和即時效能 (33 FPS)。同時，在我們的編譯最佳化的協助下，我們實現了 1.7 倍的速度提升，同時節省了多達 1.61 倍的記憶體使用量。程式碼可在 https://github.com/coulsonlee/Dy-DCA-ECCV2024 取得。", "author": "Gen Li et.al.", "authors": "Gen Li, Zhihao Shu, Jie Ji, Minghai Qin, Fatemeh Afghah, Wei Niu, Xiaolong Ma", "id": "2407.02813v1", "paper_url": "http://arxiv.org/abs/2407.02813v1", "repo": "https://github.com/coulsonlee/dy-dca-eccv2024"}}