{"2405.08839": {"publish_time": "2024-05-14", "title": "PromptMind Team at EHRSQL-2024: Improving Reliability of SQL Generation using Ensemble LLMs", "paper_summary": "This paper presents our approach to the EHRSQL-2024 shared task, which aims\nto develop a reliable Text-to-SQL system for electronic health records. We\npropose two approaches that leverage large language models (LLMs) for prompting\nand fine-tuning to generate EHRSQL queries. In both techniques, we concentrate\non bridging the gap between the real-world knowledge on which LLMs are trained\nand the domain specific knowledge required for the task. The paper provides the\nresults of each approach individually, demonstrating that they achieve high\nexecution accuracy. Additionally, we show that an ensemble approach further\nenhances generation reliability by reducing errors. This approach secured us\n2nd place in the shared task competition. The methodologies outlined in this\npaper are designed to be transferable to domain-specific Text-to-SQL problems\nthat emphasize both accuracy and reliability.", "paper_summary_zh": "本文介紹我們對 EHRSQL-2024 共享任務的方法，該任務旨在開發一個可靠的電子病歷文字轉 SQL 系統。我們提出兩種方法，利用大型語言模型 (LLM) 來提示和微調以產生 EHRSQL 查詢。在這兩種技術中，我們專注於彌合 LLM 接受訓練的現實世界知識與任務所需的特定領域知識之間的差距。本文分別提供了每種方法的結果，證明它們實現了很高的執行準確度。此外，我們表明，整體方法進一步通過減少錯誤來增強生成可靠性。這種方法讓我們在共享任務競賽中獲得第二名。本文中概述的方法旨在轉移到特定領域的文字轉 SQL 問題，這些問題強調準確性和可靠性。", "author": "Satya K Gundabathula et.al.", "authors": "Satya K Gundabathula, Sriram R Kolar", "id": "2405.08839v1", "paper_url": "http://arxiv.org/abs/2405.08839v1", "repo": "null"}}