{"2412.20331": {"publish_time": "2024-12-29", "title": "Mind the Data Gap: Bridging LLMs to Enterprise Data Integration", "paper_summary": "Leading large language models (LLMs) are trained on public data. However,\nmost of the world's data is dark data that is not publicly accessible, mainly\nin the form of private organizational or enterprise data. We show that the\nperformance of methods based on LLMs seriously degrades when tested on\nreal-world enterprise datasets. Current benchmarks, based on public data,\noverestimate the performance of LLMs. We release a new benchmark dataset, the\nGOBY Benchmark, to advance discovery in enterprise data integration. Based on\nour experience with this enterprise benchmark, we propose techniques to uplift\nthe performance of LLMs on enterprise data, including (1) hierarchical\nannotation, (2) runtime class-learning, and (3) ontology synthesis. We show\nthat, once these techniques are deployed, the performance on enterprise data\nbecomes on par with that of public data. The Goby benchmark can be obtained at\nhttps://goby-benchmark.github.io/.", "paper_summary_zh": "領先的大語言模型 (LLM) 是根據公開資料訓練的。然而，世界上大部分的資料都是難以公開取得的暗資料，主要以私人組織或企業資料的形式存在。我們展示了在實際企業資料集上進行測試時，基於 LLM 的方法的效能嚴重下降。基於公開資料的當前基準過度高估了 LLM 的效能。我們發布了一個新的基準資料集，即 Goby 基準，以推動企業資料整合的發現。根據我們使用此企業基準的經驗，我們提出了提升 LLM 在企業資料上效能的技術，包括 (1) 層級註解、(2) 執行時期類別學習，以及 (3) 本体合成。我們展示了在部署這些技術後，企業資料上的效能已與公開資料相當。Goby 基準可以在 https://goby-benchmark.github.io/ 取得。", "author": "Moe Kayali et.al.", "authors": "Moe Kayali, Fabian Wenz, Nesime Tatbul, Çağatay Demiralp", "id": "2412.20331v1", "paper_url": "http://arxiv.org/abs/2412.20331v1", "repo": "null"}}