{"2412.19018": {"publish_time": "2024-12-26", "title": "Let the Rule Speak: Enhancing In-context Learning Debiasing with Interpretability", "paper_summary": "In-context learning, which allows large language models to perform diverse\ntasks with a few demonstrations, is found to have imbalanced per-class\nprediction accuracy on multi-class text classification. Although notable output\ncorrection methods have been developed to tackle the issue and simultaneously\nimprove downstream prediction accuracy, they may fail to answer the core\ninterpretability challenges: why and which certain classes need corrections,\nand more importantly, a tailored correction for per-sample, per-class's\nprobability. To address such interpretability gaps, we first find that the\nimbalance arises from certain classes consistently receiving high ICL output\nprobabilities, whereas others receiving lower or mixed ranges, so the former is\nmore frequently chosen, resulting in higher accuracy; more crucially, we find\nthat these ranges have significantly varying degrees of influence on the\naccuracy bias, highlighting the need for precise, interpretable probability\ncorrections by range. Motivated by this, we propose FuRud, a Fuzzy Rule\nOptimization based Debiasing method, that (1) detects which classes need\ncorrections, and (2) for each correction-needed class, detects its probability\nranges and applies asymmetric amplifications or reductions to correct them\ninterpretably. Notably, across seven benchmark datasets, FuRud reduces the\npairwise class accuracy bias (COBias) by more than half (56%), while achieving\na relative increase of 21% in accuracy, outperforming state-of-the-art\ndebiasing methods. Moreover, FuRud can optimize downstream tasks with as few as\n10 optimization examples. Furthermore, FuRud can work for prompt formats that\nlead to highly skewed predictions. For example, FuRud greatly improves ICL\noutputs which use letter options, with 44% relative accuracy increase and 54%\nrelative COBias reduction.", "paper_summary_zh": "<paragraph>語境學習讓大型語言模型能透過少數示範執行多樣化的任務，但發現其在多類別文字分類上，每個類別的預測準確度不平衡。儘管已開發出顯著的輸出修正方法來解決此問題，並同時提升下游預測準確度，但它們可能無法回答核心可解釋性挑戰：為何且哪些特定類別需要修正，更重要的是，針對每個樣本、每個類別的機率進行客製化修正。為了解決此類可解釋性差距，我們首先發現不平衡來自於某些類別持續接收高 ICL 輸出機率，而其他類別接收較低或混合範圍，所以前者較常被選取，導致較高準確度；更重要的是，我們發現這些範圍對準確度偏差有顯著不同的影響程度，突顯了依範圍進行精確、可解釋機率修正的必要性。基於此，我們提出 FuRud，一種基於模糊規則最佳化的去偏誤方法，它 (1) 偵測哪些類別需要修正，以及 (2) 針對每個需要修正的類別，偵測其機率範圍並應用非對稱放大或縮小以進行可解釋的修正。值得注意的是，在七個基準資料集上，FuRud 將成對類別準確度偏差 (COBias) 減少了一半以上 (56%)，同時準確度相對增加了 21%，優於最先進的去偏誤方法。此外，FuRud 可以使用少至 10 個最佳化範例最佳化下游任務。此外，FuRud 可以處理導致高度偏斜預測的提示格式。例如，FuRud 大幅改善使用字母選項的 ICL 輸出，相對準確度提升 44%，相對 COBias 減少 54%。</paragraph>", "author": "Ruixi Lin et.al.", "authors": "Ruixi Lin, Yang You", "id": "2412.19018v1", "paper_url": "http://arxiv.org/abs/2412.19018v1", "repo": "null"}}