{"2406.14953": {"publish_time": "2024-06-21", "title": "Deep Imbalanced Regression to Estimate Vascular Age from PPG Data: a Novel Digital Biomarker for Cardiovascular Health", "paper_summary": "Photoplethysmography (PPG) is emerging as a crucial tool for monitoring human\nhemodynamics, with recent studies highlighting its potential in assessing\nvascular aging through deep learning. However, real-world age distributions are\noften imbalanced, posing significant challenges for deep learning models. In\nthis paper, we introduce a novel, simple, and effective loss function named the\nDist Loss to address deep imbalanced regression tasks. We trained a\none-dimensional convolutional neural network (Net1D) incorporating the Dist\nLoss on the extensive UK Biobank dataset (n=502,389) to estimate vascular age\nfrom PPG signals and validate its efficacy in characterizing cardiovascular\nhealth. The model's performance was validated on a 40% held-out test set,\nachieving state-of-the-art results, especially in regions with small sample\nsizes. Furthermore, we divided the population into three subgroups based on the\ndifference between predicted vascular age and chronological age: less than -10\nyears, between -10 and 10 years, and greater than 10 years. We analyzed the\nrelationship between predicted vascular age and several cardiovascular events\nover a follow-up period of up to 10 years, including death, coronary heart\ndisease, and heart failure. Our results indicate that the predicted vascular\nage has significant potential to reflect an individual's cardiovascular health\nstatus. Our code will be available at https://github.com/Ngk03/AI-vascular-age.", "paper_summary_zh": "光電容積描記法 (PPG) 正逐漸成為監測人體血流動力學的一項重要工具，最近的研究強調其透過深度學習評估血管老化的潛力。然而，真實世界的年齡分佈通常不平衡，對深度學習模型構成重大挑戰。在本文中，我們引入一個新穎、簡單且有效的損失函數，稱為 Dist Loss，以解決深度不平衡迴歸任務。我們在龐大的英國生物銀行資料集 (n=502,389) 上訓練了一個一維卷積神經網路 (Net1D)，結合 Dist Loss 從 PPG 訊號估計血管年齡，並驗證其在表徵心血管健康的效能。該模型的效能經過 40% 的留出測試集驗證，獲得了最先進的結果，特別是在樣本量小的區域。此外，我們根據預測的血管年齡和實際年齡之間的差異將人群分為三個子群：小於 -10 歲、介於 -10 到 10 歲之間，以及大於 10 歲。我們分析了預測的血管年齡與後續長達 10 年的數個心血管事件之間的關係，包括死亡、冠心病和心衰竭。我們的結果表明，預測的血管年齡具有反映個人心血管健康狀況的顯著潛力。我們的程式碼將在 https://github.com/Ngk03/AI-vascular-age 提供。", "author": "Guangkun Nie et.al.", "authors": "Guangkun Nie, Qinghao Zhao, Gongzheng Tang, Jun Li, Shenda Hong", "id": "2406.14953v1", "paper_url": "http://arxiv.org/abs/2406.14953v1", "repo": "null"}}