{"2501.18533": {"publish_time": "2025-01-30", "title": "Rethinking Bottlenecks in Safety Fine-Tuning of Vision Language Models", "paper_summary": "Large Vision-Language Models (VLMs) have achieved remarkable performance\nacross a wide range of tasks. However, their deployment in safety-critical\ndomains poses significant challenges. Existing safety fine-tuning methods,\nwhich focus on textual or multimodal content, fall short in addressing\nchallenging cases or disrupt the balance between helpfulness and harmlessness.\nOur evaluation highlights a safety reasoning gap: these methods lack safety\nvisual reasoning ability, leading to such bottlenecks. To address this\nlimitation and enhance both visual perception and reasoning in safety-critical\ncontexts, we propose a novel dataset that integrates multi-image inputs with\nsafety Chain-of-Thought (CoT) labels as fine-grained reasoning logic to improve\nmodel performance. Specifically, we introduce the Multi-Image Safety (MIS)\ndataset, an instruction-following dataset tailored for multi-image safety\nscenarios, consisting of training and test splits. Our experiments demonstrate\nthat fine-tuning InternVL2.5-8B with MIS significantly outperforms both\npowerful open-source models and API-based models in challenging multi-image\ntasks requiring safety-related visual reasoning. This approach not only\ndelivers exceptional safety performance but also preserves general capabilities\nwithout any trade-offs. Specifically, fine-tuning with MIS increases average\naccuracy by 0.83% across five general benchmarks and reduces the Attack Success\nRate (ASR) on multiple safety benchmarks by a large margin. Data and Models are\nreleased under:\n\\href{https://dripnowhy.github.io/MIS/}{\\texttt{https://dripnowhy.github.io/MIS/}}", "paper_summary_zh": "大型視覺語言模型 (VLM) 已在各種任務中取得顯著成效。然而，它們在安全關鍵領域的部署卻帶來重大挑戰。現有的安全微調方法著重於文字或多模態內容，在處理具挑戰性的案例或破壞有益性和無害性之間的平衡方面做得不夠。我們的評估強調了安全推理差距：這些方法缺乏安全視覺推理能力，導致產生此類瓶頸。為了解決此限制並增強安全關鍵情境中的視覺感知和推理，我們提出了一個新穎的資料集，將多圖像輸入與安全思考鏈 (CoT) 標籤整合為細粒度的推理邏輯，以改善模型效能。具體來說，我們引入了多圖像安全 (MIS) 資料集，這是一個專為多圖像安全情境量身打造的指令遵循資料集，包含訓練和測試分割。我們的實驗證明，使用 MIS 微調 InternVL2.5-8B 在需要安全相關視覺推理的具挑戰性多圖像任務中，明顯優於功能強大的開源模型和基於 API 的模型。這種方法不僅提供了出色的安全效能，而且還保留了一般能力，沒有任何權衡取捨。具體來說，使用 MIS 進行微調可將五個一般基準的平均準確度提高 0.83%，並將多個安全基準的攻擊成功率 (ASR) 大幅降低。資料和模型在以下位置發布：\n\\href{https://dripnowhy.github.io/MIS/}{\\texttt{https://dripnowhy.github.io/MIS/}}", "author": "Yi Ding et.al.", "authors": "Yi Ding, Lijun Li, Bing Cao, Jing Shao", "id": "2501.18533v1", "paper_url": "http://arxiv.org/abs/2501.18533v1", "repo": "null"}}