{"2412.14617": {"publish_time": "2024-12-19", "title": "How good is GPT at writing political speeches for the White House?", "paper_summary": "Using large language models (LLMs), computers are able to generate a written\ntext in response to a us er request. As this pervasive technology can be\napplied in numerous contexts, this study analyses the written style of one LLM\ncalled GPT by comparing its generated speeches with those of the recent US\npresidents. To achieve this objective, the State of the Union (SOTU) addresses\nwritten by Reagan to Biden are contrasted to those produced by both GPT-3.5 and\nGPT-4.o versions. Compared to US presidents, GPT tends to overuse the lemma\n\"we\" and produce shorter messages with, on average, longer sentences. Moreover,\nGPT opts for an optimistic tone, opting more often for political (e.g.,\npresident, Congress), symbolic (e.g., freedom), and abstract terms (e.g.,\nfreedom). Even when imposing an author's style to GPT, the resulting speech\nremains distinct from addresses written by the target author. Finally, the two\nGPT versions present distinct characteristics, but both appear overall\ndissimilar to true presidential messages.", "paper_summary_zh": "使用大型語言模型 (LLM)，電腦能夠根據使用者要求產生書面文字。由於這項普遍技術可應用於許多情境，本研究透過比較大型語言模型 GPT 產生的演講與近期美國總統的演講，分析 GPT 的書寫風格。為達成此目標，將雷根至拜登撰寫的國情咨文 (SOTU) 演說與 GPT-3.5 和 GPT-4.o 版本產生的演說進行對比。與美國總統相比，GPT 傾向過度使用詞素「我們」，並產生較短的訊息，但平均句子較長。此外，GPT 選擇樂觀的語氣，較常選擇政治（例如，總統、國會）、象徵（例如，自由）和抽象術語（例如，自由）。即使將作者的風格套用至 GPT，產生的演說仍與目標作者撰寫的演說有所不同。最後，兩個 GPT 版本呈現出不同的特徵，但整體而言都與真正的總統訊息不同。", "author": "Jacques Savoy et.al.", "authors": "Jacques Savoy", "id": "2412.14617v1", "paper_url": "http://arxiv.org/abs/2412.14617v1", "repo": "null"}}