{"2408.15640": {"publish_time": "2024-08-28", "title": "GANs Conditioning Methods: A Survey", "paper_summary": "In recent years, Generative Adversarial Networks (GANs) have seen significant\nadvancements, leading to their widespread adoption across various fields. The\noriginal GAN architecture enables the generation of images without any specific\ncontrol over the content, making it an unconditional generation process.\nHowever, many practical applications require precise control over the generated\noutput, which has led to the development of conditional GANs (cGANs) that\nincorporate explicit conditioning to guide the generation process. cGANs extend\nthe original framework by incorporating additional information (conditions),\nenabling the generation of samples that adhere to that specific criteria.\nVarious conditioning methods have been proposed, each differing in how they\nintegrate the conditioning information into both the generator and the\ndiscriminator networks. In this work, we review the conditioning methods\nproposed for GANs, exploring the characteristics of each method and\nhighlighting their unique mechanisms and theoretical foundations. Furthermore,\nwe conduct a comparative analysis of these methods, evaluating their\nperformance on various image datasets. Through these analyses, we aim to\nprovide insights into the strengths and limitations of various conditioning\ntechniques, guiding future research and application in generative modeling.", "paper_summary_zh": "近年來，生成對抗網路 (GAN) 已顯著進步，因而廣泛運用於各個領域。原始 GAN 架構能夠生成影像，但無法特別控制內容，因此屬於無條件生成程序。然而，許多實際應用都需要精準控制所生成的輸出，這促使條件式 GAN (cGAN) 應運而生，它結合明確條件來引導生成程序。cGAN 在原始架構中加入額外的資訊（條件），進而擴充功能，能夠生成符合特定條件的樣本。已提出各種條件式方法，每種方法整合條件資訊至生成器和鑑別器網路的方式各不相同。在這項研究中，我們回顧為 GAN 提出的條件式方法，探討每種方法的特性，並強調其獨特的機制和理論基礎。此外，我們對這些方法進行比較分析，評估它們在各種影像資料集上的效能。透過這些分析，我們旨在提供洞察力，瞭解各種條件式技術的優缺點，引導未來在生成模型中的研究和應用。", "author": "Anis Bourou et.al.", "authors": "Anis Bourou, Auguste Genovesio, Valérie Mezger", "id": "2408.15640v2", "paper_url": "http://arxiv.org/abs/2408.15640v2", "repo": "null"}}