{"2408.15640": {"publish_time": "2024-08-28", "title": "GANs Conditioning Methods: A Survey", "paper_summary": "In recent years, Generative Adversarial Networks (GANs) have seen significant\nadvancements, leading to their widespread adoption across various fields. The\noriginal GAN architecture enables the generation of images without any specific\ncontrol over the content, making it an unconditional generation process.\nHowever, many practical applications require precise control over the generated\noutput, which has led to the development of conditional GANs (cGANs) that\nincorporate explicit conditioning to guide the generation process. cGANs extend\nthe original framework by incorporating additional information (conditions),\nenabling the generation of samples that adhere to that specific criteria.\nVarious conditioning methods have been proposed, each differing in how they\nintegrate the conditioning information into both the generator and the\ndiscriminator networks. In this work, we review the conditioning methods\nproposed for GANs, exploring the characteristics of each method and\nhighlighting their unique mechanisms and theoretical foundations. Furthermore,\nwe conduct a comparative analysis of these methods, evaluating their\nperformance on various image datasets. Through these analyses, we aim to\nprovide insights into the strengths and limitations of various conditioning\ntechniques, guiding future research and application in generative modeling.", "paper_summary_zh": "近年来，生成对抗网络 (GAN) 已获得重大进展，导致其在各个领域得到广泛采用。原始 GAN 架构能够生成图像，而无需对内容进行任何特定控制，使其成为无条件生成过程。然而，许多实际应用需要对生成的输出进行精确控制，这导致了条件 GAN (cGAN) 的开发，它结合了显式条件来指导生成过程。cGAN 通过合并附加信息（条件）扩展了原始框架，从而能够生成符合特定条件的样本。已经提出了各种条件方法，它们在将条件信息集成到生成器和判别器网络中的方式上各不相同。在这项工作中，我们回顾了为 GAN 提出的条件方法，探讨了每种方法的特征，并重点介绍了它们独特的机制和理论基础。此外，我们对这些方法进行了比较分析，评估了它们在各种图像数据集上的性能。通过这些分析，我们旨在深入了解各种条件技术的优势和局限性，指导生成建模中的未来研究和应用。", "author": "Anis Bourou et.al.", "authors": "Anis Bourou, Auguste Genovesio, Valérie Mezger", "id": "2408.15640v1", "paper_url": "http://arxiv.org/abs/2408.15640v1", "repo": "null"}}