{"2410.08049": {"publish_time": "2024-10-10", "title": "Scaling Up Your Kernels: Large Kernel Design in ConvNets towards Universal Representations", "paper_summary": "This paper proposes the paradigm of large convolutional kernels in designing\nmodern Convolutional Neural Networks (ConvNets). We establish that employing a\nfew large kernels, instead of stacking multiple smaller ones, can be a superior\ndesign strategy. Our work introduces a set of architecture design guidelines\nfor large-kernel ConvNets that optimize their efficiency and performance. We\npropose the UniRepLKNet architecture, which offers systematical architecture\ndesign principles specifically crafted for large-kernel ConvNets, emphasizing\ntheir unique ability to capture extensive spatial information without deep\nlayer stacking. This results in a model that not only surpasses its\npredecessors with an ImageNet accuracy of 88.0%, an ADE20K mIoU of 55.6%, and a\nCOCO box AP of 56.4% but also demonstrates impressive scalability and\nperformance on various modalities such as time-series forecasting, audio, point\ncloud, and video recognition. These results indicate the universal modeling\nabilities of large-kernel ConvNets with faster inference speed compared with\nvision transformers. Our findings reveal that large-kernel ConvNets possess\nlarger effective receptive fields and a higher shape bias, moving away from the\ntexture bias typical of smaller-kernel CNNs. All codes and models are publicly\navailable at https://github.com/AILab-CVC/UniRepLKNet promoting further\nresearch and development in the community.", "paper_summary_zh": "本文提出在設計現代卷積神經網路 (ConvNets) 時使用大型卷積核的範例。我們確立使用少數大型核，而不是堆疊多個較小的核，可能是一種優越的設計策略。我們的研究引入了一組大型核 ConvNets 的架構設計準則，以最佳化其效率和效能。我們提出 UniRepLKNet 架構，它提供了專門為大型核 ConvNets 設計的系統化架構設計原則，強調它們在不進行深度層堆疊的情況下擷取廣泛空間資訊的獨特能力。這產生了一個模型，不僅以 88.0% 的 ImageNet 準確度、55.6% 的 ADE20K mIoU 和 56.4% 的 COCO 盒子 AP 超越其前身，還展示了令人印象深刻的可擴充性和效能在各種模式上的表現，例如時間序列預測、音訊、點雲和影片辨識。這些結果表明，與視覺轉換器相比，大型核 ConvNets 具有通用的建模能力，且推理速度更快。我們的研究結果表明，大型核 ConvNets 具有更大的有效感受野和更高的形狀偏差，遠離了較小核 CNN 的典型紋理偏差。所有程式碼和模型都公開在 https://github.com/AILab-CVC/UniRepLKNet，以促進社群進一步的研究和開發。", "author": "Yiyuan Zhang et.al.", "authors": "Yiyuan Zhang, Xiaohan Ding, Xiangyu Yue", "id": "2410.08049v1", "paper_url": "http://arxiv.org/abs/2410.08049v1", "repo": "https://github.com/ailab-cvc/unireplknet"}}