{"2410.22812": {"publish_time": "2024-10-30", "title": "Universality of the $π^2/6$ Pathway in Avoiding Model Collapse", "paper_summary": "Researchers in empirical machine learning recently spotlighted their fears of\nso-called Model Collapse. They imagined a discard workflow, where an initial\ngenerative model is trained with real data, after which the real data are\ndiscarded, and subsequently, the model generates synthetic data on which a new\nmodel is trained. They came to the conclusion that models degenerate as\nmodel-fitting generations proceed. However, other researchers considered an\naugment workflow, where the original real data continue to be used in each\ngeneration of training, augmented by synthetic data from models fit in all\nearlier generations. Empirical results on canonical datasets and learning\nprocedures confirmed the occurrence of model collapse under the discard\nworkflow and avoidance of model collapse under the augment workflow. Under the\naugment workflow, theoretical evidence also confirmed avoidance in particular\ninstances; specifically, Gerstgrasser et al. (2024) found that for classical\nLinear Regression, test risk at any later generation is bounded by a moderate\nmultiple, viz. pi-squared-over-6 of the test risk of training with the original\nreal data alone. Some commentators questioned the generality of theoretical\nconclusions based on the generative model assumed in Gerstgrasser et al.\n(2024): could similar conclusions be reached for other task/model pairings? In\nthis work, we demonstrate the universality of the pi-squared-over-6 augment\nrisk bound across a large family of canonical statistical models, offering key\ninsights into exactly why collapse happens under the discard workflow and is\navoided under the augment workflow. In the process, we provide a framework that\nis able to accommodate a large variety of workflows (beyond discard and\naugment), thereby enabling an experimenter to judge the comparative merits of\nmultiple different workflows by simulating a simple Gaussian process.", "paper_summary_zh": "<paragraph>經驗機器學習的研究人員最近強調了他們對所謂模型崩潰的擔憂。他們想像一個丟棄工作流程，其中一個初始生成模型使用真實資料訓練，之後丟棄真實資料，隨後，模型會生成合成資料，並在合成資料上訓練一個新模型。他們得出的結論是，隨著模型擬合世代的進行，模型會退化。然而，其他研究人員考慮了一個擴充工作流程，其中原始真實資料會持續用於每一代訓練，並擴充來自所有先前世代中擬合模型的合成資料。標準資料集和學習程序的經驗結果證實了在丟棄工作流程下會發生模型崩潰，而在擴充工作流程下則避免了模型崩潰。在擴充工作流程下，理論證據也證實了在特定情況下避免了模型崩潰；具體來說，Gerstgrasser 等人 (2024) 發現，對於經典線性迴歸，任何後續世代的測試風險都受到適度倍數的限制，即僅使用原始真實資料訓練的測試風險的 pi 平方除以 6。一些評論者質疑了 Gerstgrasser 等人 (2024) 中假設的生成模型所依據的理論結論的一般性：是否可以對其他任務/模型配對得出類似的結論？在這項工作中，我們證明了 pi 平方除以 6 擴充風險界限在許多標準統計模型的大家族中具有普遍性，提供了關鍵見解，說明了為什麼崩潰會在丟棄工作流程下發生，而在擴充工作流程下則可以避免。在此過程中，我們提供了一個框架，能夠容納各種工作流程（不只是丟棄和擴充），從而使實驗者能夠透過模擬一個簡單的高斯過程來判斷多個不同工作流程的比較優缺點。</paragraph>", "author": "Apratim Dey et.al.", "authors": "Apratim Dey, David Donoho", "id": "2410.22812v1", "paper_url": "http://arxiv.org/abs/2410.22812v1", "repo": "null"}}