{"2409.11393": {"publish_time": "2024-09-17", "title": "LLM-Agent-UMF: LLM-based Agent Unified Modeling Framework for Seamless Integration of Multi Active/Passive Core-Agents", "paper_summary": "The integration of tools in LLM-based agents overcame the difficulties of\nstandalone LLMs and traditional agents' limited capabilities. However, the\nconjunction of these technologies and the proposed enhancements in several\nstate-of-the-art works followed a non-unified software architecture resulting\nin a lack of modularity. Indeed, they focused mainly on functionalities and\noverlooked the definition of the component's boundaries within the agent. This\ncaused terminological and architectural ambiguities between researchers which\nwe addressed in this paper by proposing a unified framework that establishes a\nclear foundation for LLM-based agents' development from both functional and\nsoftware architectural perspectives.\n  Our framework, LLM-Agent-UMF (LLM-based Agent Unified Modeling Framework),\nclearly distinguishes between the different components of an agent, setting\nLLMs, and tools apart from a newly introduced element: the core-agent, playing\nthe role of the central coordinator of the agent which comprises five modules:\nplanning, memory, profile, action, and security, the latter often neglected in\nprevious works. Differences in the internal structure of core-agents led us to\nclassify them into a taxonomy of passive and active types. Based on this, we\nproposed different multi-core agent architectures combining unique\ncharacteristics of various individual agents.\n  For evaluation purposes, we applied this framework to a selection of\nstate-of-the-art agents, thereby demonstrating its alignment with their\nfunctionalities and clarifying the overlooked architectural aspects. Moreover,\nwe thoroughly assessed four of our proposed architectures by integrating\ndistinctive agents into hybrid active/passive core-agents' systems. This\nanalysis provided clear insights into potential improvements and highlighted\nthe challenges involved in the combination of specific agents.", "paper_summary_zh": "<paragraph>整合 LLM 為基礎的代理程式中的工具克服了獨立 LLM 和傳統代理程式功能有限的困難。然而，這些技術的結合和幾個最先進作品中提出的增強功能遵循非統一軟體架構，導致缺乏模組化。事實上，它們主要關注功能，而忽略了代理程式內元件邊界的定義。這導致研究人員之間術語和架構上的歧義，我們在本文中提出了一個統一框架來解決這個問題，該框架為 LLM 為基礎的代理程式的開發建立了一個清晰的基礎，無論是從功能還是軟體架構的角度來看。\n我們的框架 LLM-Agent-UMF（LLM 為基礎的代理程式統一建模框架），清楚地區分了代理程式的不同元件，設定 LLM 和工具，除了新引入的元素：核心代理程式，扮演代理程式中央協調者的角色，包含五個模組：規劃、記憶體、設定檔、動作和安全性，後者在之前的作品中經常被忽略。核心代理程式內部結構的差異導致我們將它們分類為被動和主動類型。基於此，我們提出了不同的多核心代理程式架構，結合了各種個別代理程式的獨特特徵。\n為了評估目的，我們將這個框架應用於一系列最先進的代理程式，從而證明它與它們的功能一致，並釐清被忽略的架構方面。此外，我們透過將獨特的代理程式整合到混合主動/被動核心代理程式系統中，徹底評估了我們提出的四種架構。這個分析提供了對潛在改進的清晰見解，並強調了結合特定代理程式所涉及的挑戰。</paragraph>", "author": "Amine B. Hassouna et.al.", "authors": "Amine B. Hassouna, Hana Chaari, Ines Belhaj", "id": "2409.11393v1", "paper_url": "http://arxiv.org/abs/2409.11393v1", "repo": "null"}}