{"2408.07402": {"publish_time": "2024-08-14", "title": "A Quantum-Inspired Analysis of Human Disambiguation Processes", "paper_summary": "Formal languages are essential for computer programming and are constructed\nto be easily processed by computers. In contrast, natural languages are much\nmore challenging and instigated the field of Natural Language Processing (NLP).\nOne major obstacle is the ubiquity of ambiguities. Recent advances in NLP have\nled to the development of large language models, which can resolve ambiguities\nwith high accuracy. At the same time, quantum computers have gained much\nattention in recent years as they can solve some computational problems faster\nthan classical computers. This new computing paradigm has reached the fields of\nmachine learning and NLP, where hybrid classical-quantum learning algorithms\nhave emerged. However, more research is needed to identify which NLP tasks\ncould benefit from a genuine quantum advantage. In this thesis, we applied\nformalisms arising from foundational quantum mechanics, such as contextuality\nand causality, to study ambiguities arising from linguistics. By doing so, we\nalso reproduced psycholinguistic results relating to the human disambiguation\nprocess. These results were subsequently used to predict human behaviour and\noutperformed current NLP methods.", "paper_summary_zh": "形式語言對於電腦程式設計至關重要，且建構出來後可以讓電腦輕鬆處理。相對地，自然語言更具挑戰性，並促成了自然語言處理 (NLP) 領域。其中一個主要障礙是無所不在的歧義性。NLP 的近期進展促成了大型語言模型的發展，它可以高準確度地解決歧義性。同時，量子電腦在近年來備受關注，因為它們可以比傳統電腦更快地解決一些運算問題。這個新的運算模式已經觸及機器學習和 NLP 領域，其中出現了混合古典量子學習演算法。然而，需要更多研究來找出哪些 NLP 任務可以從真正的量子優勢中受益。在本文中，我們應用源自基礎量子力學的形式主義，例如情境性和因果性，來研究源自語言學的歧義性。透過這麼做，我們也重現了與人類消除歧義過程相關的心理語言學結果。這些結果隨後用於預測人類行為，並且優於目前的 NLP 方法。", "author": "Daphne Wang et.al.", "authors": "Daphne Wang", "id": "2408.07402v1", "paper_url": "http://arxiv.org/abs/2408.07402v1", "repo": "null"}}