{"2407.15042": {"publish_time": "2024-07-21", "title": "MedSAGa: Few-shot Memory Efficient Medical Image Segmentation using Gradient Low-Rank Projection in SAM", "paper_summary": "The application of large-scale models in medical image segmentation demands\nsubstantial quantities of meticulously annotated data curated by experts along\nwith high computational resources, both of which are challenges in\nresource-poor settings. In this study, we present the Medical Segment Anything\nModel with Galore MedSAGa where we adopt the Segment Anything Model (SAM) to\nachieve memory-efficient, few-shot medical image segmentation by applying\nGradient Low-Rank Projection GaLore to the parameters of the image encoder of\nSAM. Meanwhile, the weights of the prompt encoder and mask decoder undergo full\nparameter fine-tuning using standard optimizers. We further assess MedSAGa's\nfew-shot learning capabilities, reporting on its memory efficiency and\nsegmentation performance across multiple standard medical image segmentation\ndatasets. We compare it with several baseline models, including LoRA fine-tuned\nSAM (SAMed) and DAE-Former. Experiments across multiple datasets and these\nbaseline models with different number of images for fine tuning demonstrated\nthat the GPU memory consumption of MedSAGa is significantly less than that of\nthe baseline models, achieving an average memory efficiency of 66% more than\ncurrent state-of-the-art (SOTA) models for medical image segmentation. The\ncombination of substantially lower memory requirements and comparable to SOTA\nresults in few-shot learning for medical image segmentation positions MedSAGa\nas an optimal solution for deployment in resource-constrained settings.", "paper_summary_zh": "大型模型在醫學影像分割中的應用需要大量由專家精心註解的資料，以及大量的計算資源，這兩者在資源貧乏的環境中都是挑戰。在本研究中，我們提出了具有豐富醫學影像分割的醫學分割任何模型 (MedSAGa)，其中我們採用分割任何模型 (SAM) 來通過將梯度低秩投影 GaLore 應用於 SAM 的影像編碼器參數來實現記憶體效率高的少量醫學影像分割。同時，提示編碼器和遮罩解碼器的權重使用標準最佳化器進行完整的參數微調。我們進一步評估了 MedSAGa 的少量學習能力，報告了其在多個標準醫學影像分割資料集中的記憶體效率和分割效能。我們將其與幾個基準模型進行比較，包括微調 SAM (SAMed) 的 LoRA 和 DAE-Former。跨多個資料集和這些基準模型的實驗，使用不同數量的影像進行微調，證明 MedSAGa 的 GPU 記憶體消耗明顯低於基準模型，比目前最先進 (SOTA) 的醫學影像分割模型平均記憶體效率高出 66%。在少量學習中，大幅降低記憶體需求與 SOTA 相當的結果，使得 MedSAGa 成為在資源受限環境中部署的最佳解決方案。", "author": "Navyansh Mahla et.al.", "authors": "Navyansh Mahla, Annie D'souza, Shubh Gupta, Bhavik Kanekar, Kshitij Sharad Jadhav", "id": "2407.15042v1", "paper_url": "http://arxiv.org/abs/2407.15042v1", "repo": "null"}}