{"2412.02251": {"publish_time": "2024-12-03", "title": "Selective Reviews of Bandit Problems in AI via a Statistical View", "paper_summary": "Reinforcement Learning (RL) is a widely researched area in artificial\nintelligence that focuses on teaching agents decision-making through\ninteractions with their environment. A key subset includes stochastic\nmulti-armed bandit (MAB) and continuum-armed bandit (SCAB) problems, which\nmodel sequential decision-making under uncertainty. This review outlines the\nfoundational models and assumptions of bandit problems, explores non-asymptotic\ntheoretical tools like concentration inequalities and minimax regret bounds,\nand compares frequentist and Bayesian algorithms for managing\nexploration-exploitation trade-offs. We also extend the discussion to $K$-armed\ncontextual bandits and SCAB, examining their methodologies, regret analyses,\nand discussing the relation between the SCAB problems and the functional data\nanalysis. Finally, we highlight recent advances and ongoing challenges in the\nfield.", "paper_summary_zh": "強化學習 (RL) 是人工智慧中廣泛研究的領域，專注於透過與環境互動來教授代理決策制定。一個關鍵子集包括隨機多臂賭博機 (MAB) 和連續臂賭博機 (SCAB) 問題，它們對不確定性下的順序決策制定進行建模。本篇評論概述了賭博機問題的基本模型和假設，探討了非漸近理論工具（如集中不等式和極小極大後悔邊界），並比較了管理探索 - 利用權衡的頻率論和貝氏演算法。我們還將討論擴展到 K 臂情境賭博機和 SCAB，檢視它們的方法、後悔分析，並討論 SCAB 問題與函式資料分析之間的關係。最後，我們重點介紹了該領域的最新進展和持續挑戰。", "author": "Pengjie Zhou et.al.", "authors": "Pengjie Zhou, Haoyu Wei, Huiming Zhang", "id": "2412.02251v1", "paper_url": "http://arxiv.org/abs/2412.02251v1", "repo": "null"}}