{"2408.14841": {"publish_time": "2024-08-27", "title": "Diffusion based Semantic Outlier Generation via Nuisance Awareness for Out-of-Distribution Detection", "paper_summary": "Out-of-distribution (OOD) detection, which determines whether a given sample\nis part of the in-distribution (ID), has recently shown promising results\nthrough training with synthetic OOD datasets. Nonetheless, existing methods\noften produce outliers that are considerably distant from the ID, showing\nlimited efficacy for capturing subtle distinctions between ID and OOD. To\naddress these issues, we propose a novel framework, Semantic Outlier generation\nvia Nuisance Awareness (SONA), which notably produces challenging outliers by\ndirectly leveraging pixel-space ID samples through diffusion models. Our\napproach incorporates SONA guidance, providing separate control over semantic\nand nuisance regions of ID samples. Thereby, the generated outliers achieve two\ncrucial properties: (i) they present explicit semantic-discrepant information,\nwhile (ii) maintaining various levels of nuisance resemblance with ID.\nFurthermore, the improved OOD detector training with SONA outliers facilitates\nlearning with a focus on semantic distinctions. Extensive experiments\ndemonstrate the effectiveness of our framework, achieving an impressive AUROC\nof 88% on near-OOD datasets, which surpasses the performance of baseline\nmethods by a significant margin of approximately 6%.", "paper_summary_zh": "<paragraph>異常分佈 (OOD) 偵測會判斷給定的範例是否為常態分佈 (ID) 的一部分，最近已透過使用合成 OOD 資料集進行訓練，展現出有前途的成果。儘管如此，現有方法經常會產生與 ID 相距甚遠的異常值，顯示出在捕捉 ID 和 OOD 之間的細微差異時效能有限。為了解決這些問題，我們提出一個創新的架構，稱為透過雜訊感知 (SONA) 進行語意異常值產生，它特別透過擴散模型直接利用像素空間 ID 範例來產生具挑戰性的異常值。我們的做法納入了 SONA 指導，對 ID 範例的語意和雜訊區域提供個別控制。因此，產生的異常值達到了兩個關鍵特性：(i) 它們呈現明確的語意差異資訊，同時 (ii) 保持與 ID 不同程度的雜訊相似性。此外，使用 SONA 異常值進行改良的 OOD 偵測器訓練，有助於學習專注於語意差異。廣泛的實驗證明了我們架構的有效性，在近 OOD 資料集上達到了令人印象深刻的 88% AUROC，比基準方法的效能高出約 6%，差距顯著。</paragraph>", "author": "Suhee Yoon et.al.", "authors": "Suhee Yoon, Sanghyu Yoon, Hankook Lee, Ye Seul Sim, Sungik Choi, Kyungeun Lee, Hye-Seung Cho, Woohyung Lim", "id": "2408.14841v1", "paper_url": "http://arxiv.org/abs/2408.14841v1", "repo": "null"}}