{"2405.01705": {"publish_time": "2024-05-02", "title": "Long Tail Image Generation Through Feature Space Augmentation and Iterated Learning", "paper_summary": "Image and multimodal machine learning tasks are very challenging to solve in\nthe case of poorly distributed data. In particular, data availability and\nprivacy restrictions exacerbate these hurdles in the medical domain. The state\nof the art in image generation quality is held by Latent Diffusion models,\nmaking them prime candidates for tackling this problem. However, a few key\nissues still need to be solved, such as the difficulty in generating data from\nunder-represented classes and a slow inference process. To mitigate these\nissues, we propose a new method for image augmentation in long-tailed data\nbased on leveraging the rich latent space of pre-trained Stable Diffusion\nModels. We create a modified separable latent space to mix head and tail class\nexamples. We build this space via Iterated Learning of underlying sparsified\nembeddings, which we apply to task-specific saliency maps via a K-NN approach.\nCode is available at\nhttps://github.com/SugarFreeManatee/Feature-Space-Augmentation-and-Iterated-Learning", "paper_summary_zh": "影像和多模态机器学习任务在资料分布不佳的情况下很难解决。特别是资料可用性和隐私限制加剧了医疗领域的这些障碍。影像生成质量的最新技术由 Latent Diffusion 模型掌握，使其成为解决此问题的首要候选者。然而，仍有几个关键问题需要解决，例如从代表性不足的类别生成资料的困难和缓慢的推论过程。为了减轻这些问题，我们提出了一种基于利用预先训练的 Stable Diffusion 模型的丰富潜在空间，用于长尾资料中影像扩充的新方法。我们创建了一个经过修改的可分离潜在空间来混合头部和尾部类别的范例。我们通过对底层稀疏嵌入的迭代学习来构建这个空间，我们通过 K-NN 方法将其应用于特定任务的显着性图。代码可在 https://github.com/SugarFreeManatee/Feature-Space-Augmentation-and-Iterated-Learning 取得", "author": "Rafael Elberg et.al.", "authors": "Rafael Elberg, Denis Parra, Mircea Petrache", "id": "2405.01705v1", "paper_url": "http://arxiv.org/abs/2405.01705v1", "repo": "https://github.com/sugarfreemanatee/feature-space-augmentation-and-iterated-learning"}}