{"2411.04372": {"publish_time": "2024-11-07", "title": "Benchmarking Large Language Models with Integer Sequence Generation Tasks", "paper_summary": "This paper presents a novel benchmark where the large language model (LLM)\nmust write code that computes integer sequences from the Online Encyclopedia of\nInteger Sequences (OEIS), a widely-used resource for mathematical sequences.\nThe benchmark is designed to evaluate both the correctness of the generated\ncode and its computational efficiency. Our benchmark reveals that the o1 series\nof models outperform other frontier models from OpenAI, Anthropic, Meta, and\nGoogle in accuracy and cheating rates across both easy and hard integer\nsequences. In order to ensure models do not exploit memorized sequence values,\nwe introduce an automated cheating detection mechanism that flags the use of\nlookup tables and validated this automation against human cheating evaluations.\nThis benchmark provides a meaningful challenge for current LLMs, offering\ninsights into their mathematical reasoning and code writing capabilities, which\ncan guide future research directions and model development in mathematical\nreasoning and code synthesis.", "paper_summary_zh": "本文提出了一个新基準，其中大型語言模型 (LLM)\n必須撰寫程式碼來計算來自整數序列線上百科全書 (OEIS) 的整數序列，這是一個廣泛用於數學序列的資源。\n基準旨在評估所產生程式碼的正確性和其計算效率。我們的基準顯示，o1 系列的模型在準確度和作弊率方面優於 OpenAI、Anthropic、Meta 和 Google 等其他前沿模型，適用於簡單和困難的整數序列。為了確保模型不會利用記憶的序列值，我們引入了一個自動作弊偵測機制，標示使用查詢表，並根據人類作弊評估驗證此自動化。此基準為目前的 LLM 提供了一個有意義的挑戰，提供了對其數學推理和程式碼撰寫能力的見解，這可以引導未來的研究方向和數學推理和程式碼合成中的模型開發。", "author": "Daniel O'Malley et.al.", "authors": "Daniel O'Malley, Manish Bhattarai, Javier Santos", "id": "2411.04372v1", "paper_url": "http://arxiv.org/abs/2411.04372v1", "repo": "null"}}