{"2407.14482": {"publish_time": "2024-07-19", "title": "ChatQA 2: Bridging the Gap to Proprietary LLMs in Long Context and RAG Capabilities", "paper_summary": "In this work, we introduce ChatQA 2, a Llama3-based model designed to bridge\nthe gap between open-access LLMs and leading proprietary models (e.g.,\nGPT-4-Turbo) in long-context understanding and retrieval-augmented generation\n(RAG) capabilities. These two capabilities are essential for LLMs to process\nlarge volumes of information that cannot fit into a single prompt and are\ncomplementary to each other, depending on the downstream tasks and\ncomputational budgets. We present a detailed continued training recipe to\nextend the context window of Llama3-70B-base from 8K to 128K tokens, along with\na three-stage instruction tuning process to enhance the model's\ninstruction-following, RAG performance, and long-context understanding\ncapabilities. Our results demonstrate that the Llama3-ChatQA-2-70B model\nachieves accuracy comparable to GPT-4-Turbo-2024-0409 on many long-context\nunderstanding tasks and surpasses it on the RAG benchmark. Interestingly, we\nfind that the state-of-the-art long-context retriever can alleviate the top-k\ncontext fragmentation issue in RAG, further improving RAG-based results for\nlong-context understanding tasks. We also provide extensive comparisons between\nRAG and long-context solutions using state-of-the-art long-context LLMs.", "paper_summary_zh": "在這項工作中，我們介紹 ChatQA 2，一種基於 Llama3 的模型，旨在彌合開放式 LLM 和領先的專有模型（例如 GPT-4-Turbo）在長期語境理解和檢索增強生成 (RAG) 能力方面的差距。這兩種能力對於 LLM 處理大量無法放入單一提示中的資訊至關重要，並且根據下游任務和計算預算，它們是互補的。我們提出了詳細的持續訓練配方，將 Llama3-70B-base 的語境視窗從 8K 擴展到 128K 個 token，並採用三階段指令調整流程來增強模型的指令遵循、RAG 效能和長期語境理解能力。我們的結果表明，Llama3-ChatQA-2-70B 模型在許多長期語境理解任務上達到了與 GPT-4-Turbo-2024-0409 相當的準確度，並且在 RAG 基準上超越了它。有趣的是，我們發現最先進的長期語境檢索器可以緩解 RAG 中的 top-k 語境碎片化問題，進一步改善了基於 RAG 的長期語境理解任務的結果。我們還提供了使用最先進的長期語境 LLM，在 RAG 和長期語境解決方案之間進行廣泛的比較。", "author": "Peng Xu et.al.", "authors": "Peng Xu, Wei Ping, Xianchao Wu, Zihan Liu, Mohammad Shoeybi, Bryan Catanzaro", "id": "2407.14482v1", "paper_url": "http://arxiv.org/abs/2407.14482v1", "repo": "null"}}