{"2412.13769": {"publish_time": "2024-12-18", "title": "QuLTSF: Long-Term Time Series Forecasting with Quantum Machine Learning", "paper_summary": "Long-term time series forecasting (LTSF) involves predicting a large number\nof future values of a time series based on the past values and is an essential\ntask in a wide range of domains including weather forecasting, stock market\nanalysis, disease outbreak prediction. Over the decades LTSF algorithms have\ntransitioned from statistical models to deep learning models like transformer\nmodels. Despite the complex architecture of transformer based LTSF models `Are\nTransformers Effective for Time Series Forecasting? (Zeng et al., 2023)' showed\nthat simple linear models can outperform the state-of-the-art transformer based\nLTSF models. Recently, quantum machine learning (QML) is evolving as a domain\nto enhance the capabilities of classical machine learning models. In this paper\nwe initiate the application of QML to LTSF problems by proposing QuLTSF, a\nsimple hybrid QML model for multivariate LTSF. Through extensive experiments on\na widely used weather dataset we show the advantages of QuLTSF over the\nstate-of-the-art classical linear models, in terms of reduced mean squared\nerror and mean absolute error.", "paper_summary_zh": "長期時間序列預測 (LTSF) 涉及根據過去值預測時間序列的大量未來值，並且是天氣預報、股票市場分析、疾病爆發預測等廣泛領域中的一項基本任務。數十年來，LTSF 演算法已從統計模型轉變為Transformer模型等深度學習模型。儘管基於Transformer的 LTSF 模型架構複雜，但「Transformer對時間序列預測有效嗎？」（曾等人，2023 年）一文顯示，簡單的線性模型可以優於最先進的基於Transformer的 LTSF 模型。最近，量子機器學習 (QML) 正作為一個領域發展，以增強經典機器學習模型的能力。在本文中，我們透過提出 QuLTSF（一種用於多變量 LTSF 的簡單混合 QML 模型），啟動了 QML 在 LTSF 問題中的應用。透過在廣泛使用的天氣資料集上進行大量實驗，我們展示了 QuLTSF 在減少均方誤差和平均絕對誤差方面優於最先進的經典線性模型。", "author": "Hari Hara Suthan Chittoor et.al.", "authors": "Hari Hara Suthan Chittoor, Paul Robert Griffin, Ariel Neufeld, Jayne Thompson, Mile Gu", "id": "2412.13769v1", "paper_url": "http://arxiv.org/abs/2412.13769v1", "repo": "https://github.com/chariharasuthan/qultsf"}}