{"2411.03628": {"publish_time": "2024-11-06", "title": "StreamingBench: Assessing the Gap for MLLMs to Achieve Streaming Video Understanding", "paper_summary": "The rapid development of Multimodal Large Language Models (MLLMs) has\nexpanded their capabilities from image comprehension to video understanding.\nHowever, most of these MLLMs focus primarily on offline video comprehension,\nnecessitating extensive processing of all video frames before any queries can\nbe made. This presents a significant gap compared to the human ability to\nwatch, listen, think, and respond to streaming inputs in real time,\nhighlighting the limitations of current MLLMs. In this paper, we introduce\nStreamingBench, the first comprehensive benchmark designed to evaluate the\nstreaming video understanding capabilities of MLLMs. StreamingBench assesses\nthree core aspects of streaming video understanding: (1) real-time visual\nunderstanding, (2) omni-source understanding, and (3) contextual understanding.\nThe benchmark consists of 18 tasks, featuring 900 videos and 4,500\nhuman-curated QA pairs. Each video features five questions presented at\ndifferent time points to simulate a continuous streaming scenario. We conduct\nexperiments on StreamingBench with 13 open-source and proprietary MLLMs and\nfind that even the most advanced proprietary MLLMs like Gemini 1.5 Pro and\nGPT-4o perform significantly below human-level streaming video understanding\ncapabilities. We hope our work can facilitate further advancements for MLLMs,\nempowering them to approach human-level video comprehension and interaction in\nmore realistic scenarios.", "paper_summary_zh": "多模態大型語言模型 (MLLM) 的快速發展已將其能力從影像理解擴展到影片理解。然而，這些 MLLM 大多主要專注於離線影片理解，在進行任何查詢之前需要對所有影片幀進行廣泛的處理。這與人類觀看、聆聽、思考和即時回應串流輸入的能力相比，存在顯著的差距，突顯了當前 MLLM 的限制。在本文中，我們介紹了 StreamingBench，這是第一個旨在評估 MLLM 串流影片理解能力的綜合基準測試。StreamingBench 評估串流影片理解的三个核心方面：(1) 即時視覺理解，(2) 全源理解，以及 (3) 背景理解。基準測試包含 18 項任務，特點是 900 部影片和 4,500 個由人工策劃的問答配對。每部影片都有五個問題在不同的時間點提出，以模擬連續串流場景。我們使用 13 個開源和專有 MLLM 對 StreamingBench 進行實驗，發現即使是最先進的專有 MLLM，如 Gemini 1.5 Pro 和 GPT-4o，在串流影片理解能力方面也顯著低於人類水準。我們希望我們的研究能促進 MLLM 的進一步發展，讓它們能夠在更逼真的場景中接近人類水準的影片理解和互動。", "author": "Junming Lin et.al.", "authors": "Junming Lin, Zheng Fang, Chi Chen, Zihao Wan, Fuwen Luo, Peng Li, Yang Liu, Maosong Sun", "id": "2411.03628v1", "paper_url": "http://arxiv.org/abs/2411.03628v1", "repo": "null"}}