{"2504.08481": {"publish_time": "2025-04-11", "title": "A Hybrid Fully Convolutional CNN-Transformer Model for Inherently Interpretable Medical Image Classification", "paper_summary": "In many medical imaging tasks, convolutional neural networks (CNNs)\nefficiently extract local features hierarchically. More recently, vision\ntransformers (ViTs) have gained popularity, using self-attention mechanisms to\ncapture global dependencies, but lacking the inherent spatial localization of\nconvolutions. Therefore, hybrid models combining CNNs and ViTs have been\ndeveloped to combine the strengths of both architectures. However, such hybrid\nCNN-ViT models are difficult to interpret, which hinders their application in\nmedical imaging. In this work, we introduce an interpretable-by-design hybrid\nfully convolutional CNN-Transformer architecture for medical image\nclassification. Unlike widely used post-hoc saliency methods for ViTs, our\napproach generates faithful and localized evidence maps that directly reflect\nthe model's decision process. We evaluated our method on two medical image\nclassification tasks using color fundus images. Our model not only achieves\nstate-of-the-art predictive performance compared to both black-box and\ninterpretable models but also provides class-specific sparse evidence maps in a\nsingle forward pass. The code is available at:\nhttps://anonymous.4open.science/r/Expl-CNN-Transformer/.", "paper_summary_zh": "在許多醫學影像任務中，卷積神經網絡 (CNN)可以有效地分層提取局部特徵。近年來，視覺Transformer (ViT) 變得越來越流行，它使用自注意力機制來捕捉全局依賴關係，但缺乏卷積固有的空間定位能力。因此，人們開發了結合 CNN 和 ViT 的混合模型，以結合兩種架構的優勢。然而，這種混合CNN-ViT 模型難以解釋，這阻礙了它們在醫學影像中的應用。在這項工作中，我們介紹了一種用於醫學影像分類的可解釋的混合全卷積 CNN-Transformer 架構。與 ViT 廣泛使用的後處理顯著性方法不同，我們的方法生成忠實且局部化的證據圖，直接反映模型的決策過程。我們在兩個醫學影像分類任務中使用彩色眼底圖像評估了我們的方法。與黑盒模型和可解釋模型相比，我們的模型不僅達到了最先進的預測性能，而且還在單次前向傳遞中提供了特定類別的稀疏證據圖。代碼可在以下網址獲得：https://anonymous.4open.science/r/Expl-CNN-Transformer/。\n", "author": "Kerol Djoumessi et.al.", "authors": "Kerol Djoumessi, Samuel Ofosu Mensah, Philipp Berens", "id": "2504.08481v1", "paper_url": "http://arxiv.org/abs/2504.08481v1", "repo": "null"}}