{"2409.17063": {"publish_time": "2024-09-25", "title": "Benchmarking Domain Generalization Algorithms in Computational Pathology", "paper_summary": "Deep learning models have shown immense promise in computational pathology\n(CPath) tasks, but their performance often suffers when applied to unseen data\ndue to domain shifts. Addressing this requires domain generalization (DG)\nalgorithms. However, a systematic evaluation of DG algorithms in the CPath\ncontext is lacking. This study aims to benchmark the effectiveness of 30 DG\nalgorithms on 3 CPath tasks of varying difficulty through 7,560\ncross-validation runs. We evaluate these algorithms using a unified and robust\nplatform, incorporating modality-specific techniques and recent advances like\npretrained foundation models. Our extensive cross-validation experiments\nprovide insights into the relative performance of various DG strategies. We\nobserve that self-supervised learning and stain augmentation consistently\noutperform other methods, highlighting the potential of pretrained models and\ndata augmentation. Furthermore, we introduce a new pan-cancer tumor detection\ndataset (HISTOPANTUM) as a benchmark for future research. This study offers\nvaluable guidance to researchers in selecting appropriate DG approaches for\nCPath tasks.", "paper_summary_zh": "深度學習模型在計算病理學 (CPath) 任務中展現出巨大的前景，但當應用於未見數據時，其效能通常會因領域轉移而下降。解決此問題需要領域泛化 (DG) 演算法。然而，目前缺乏在 CPath 背景下對 DG 演算法的系統性評估。本研究旨在透過 7,560 次交叉驗證執行，對 30 種 DG 演算法在 3 種不同難度的 CPath 任務上的效能進行基準測試。我們使用一個統一且穩健的平台評估這些演算法，並結合特定於方式的技術和預訓練基礎模型等最新進展。我們廣泛的交叉驗證實驗提供了對各種 DG 策略相對效能的見解。我們觀察到自監督式學習和染色增強始終優於其他方法，突顯了預訓練模型和資料增強的潛力。此外，我們引入了一個新的泛癌腫瘤檢測資料集 (HISTOPANTUM) 作為未來研究的基準。本研究為研究人員在選擇適當的 DG 方法以執行 CPath 任務時提供了寶貴的指導。", "author": "Neda Zamanitajeddin et.al.", "authors": "Neda Zamanitajeddin, Mostafa Jahanifar, Kesi Xu, Fouzia Siraj, Nasir Rajpoot", "id": "2409.17063v1", "paper_url": "http://arxiv.org/abs/2409.17063v1", "repo": "null"}}