{"2406.11715": {"publish_time": "2024-06-17", "title": "Measuring memorization in RLHF for code completion", "paper_summary": "Reinforcement learning with human feedback (RLHF) has become the dominant\nmethod to align large models to user preferences. Unlike fine-tuning, for which\nthere are many studies regarding training data memorization, it is not clear\nhow memorization is affected by or introduced in the RLHF alignment process.\nUnderstanding this relationship is important as real user data may be collected\nand used to align large models; if user data is memorized during RLHF and later\nregurgitated, this could raise privacy concerns. In this work, we analyze how\ntraining data memorization can surface and propagate through each phase of\nRLHF. We focus our study on code completion models, as code completion is one\nof the most popular use cases for large language models. We find that RLHF\nsignificantly decreases the chance that data used for reward modeling and\nreinforcement learning is memorized, in comparison to aligning via directly\nfine-tuning on this data, but that examples already memorized during the\nfine-tuning stage of RLHF, will, in the majority of cases, remain memorized\nafter RLHF.", "paper_summary_zh": "人類回饋增強學習（RLHF）已成為調整大型模型以符合使用者偏好的主要方法。與微調不同，對於微調有許多關於訓練資料記憶的研究，但尚不清楚記憶是如何受到 RLHF 調整程序影響或引入的。了解這種關係很重要，因為可能會收集真實使用者資料並用於調整大型模型；如果使用者資料在 RLHF 期間被記憶下來並稍後再重複，這可能會引發隱私問題。在這項工作中，我們分析訓練資料記憶如何在 RLHF 的每個階段浮現並傳播。我們將研究重點放在程式碼完成模型上，因為程式碼完成是大語言模型最受歡迎的用例之一。我們發現，與直接對此資料進行微調的調整方式相比，RLHF 會顯著降低用於獎勵建模和增強學習的資料被記憶的機率，但 RLHF 微調階段中已記憶的範例在大部分情況下，RLHF 之後仍會保持記憶。", "author": "Aneesh Pappu et.al.", "authors": "Aneesh Pappu, Billy Porter, Ilia Shumailov, Jamie Hayes", "id": "2406.11715v1", "paper_url": "http://arxiv.org/abs/2406.11715v1", "repo": "null"}}