{"2405.08174": {"publish_time": "2024-05-13", "title": "Estimating Direct and Indirect Causal Effects of Spatiotemporal Interventions in Presence of Spatial Interference", "paper_summary": "Spatial interference (SI) occurs when the treatment at one location affects\nthe outcomes at other locations. Accounting for spatial interference in\nspatiotemporal settings poses further challenges as interference violates the\nstable unit treatment value assumption, making it infeasible for standard\ncausal inference methods to quantify the effects of time-varying treatment at\nspatially varying outcomes. In this paper, we first formalize the concept of\nspatial interference in case of time-varying treatment assignments by extending\nthe potential outcome framework under the assumption of no unmeasured\nconfounding. We then propose our deep learning based potential outcome model\nfor spatiotemporal causal inference. We utilize latent factor modeling to\nreduce the bias due to time-varying confounding while leveraging the power of\nU-Net architecture to capture global and local spatial interference in data\nover time. Our causal estimators are an extension of average treatment effect\n(ATE) for estimating direct (DATE) and indirect effects (IATE) of spatial\ninterference on treated and untreated data. Being the first of its kind deep\nlearning based spatiotemporal causal inference technique, our approach shows\nadvantages over several baseline methods based on the experiment results on two\nsynthetic datasets, with and without spatial interference. Our results on\nreal-world climate dataset also align with domain knowledge, further\ndemonstrating the effectiveness of our proposed method.", "paper_summary_zh": "空間干擾 (SI) 是指某個地方的療法會影響其他地方的結果。在時空背景下考慮空間干擾會帶來進一步的挑戰，因為干擾會違反穩定的單位治療值假設，使得標準因果推論方法無法量化時變治療對空間變異結果的影響。在本文中，我們首先在沒有未測量混淆的假設下，透過擴展潛在結果架構，將時變治療分配的空間干擾概念形式化。接著，我們提出基於深度學習的潛在結果模型，用於時空因果推論。我們利用潛在因子模型來減少因時變混淆造成的偏差，同時利用 U-Net 架構的優勢來擷取資料中隨時間變化的全局和局部空間干擾。我們的因果估計器是平均治療效果 (ATE) 的延伸，用於估計空間干擾對已治療和未治療資料的直接 (DATE) 和間接效果 (IATE)。作為首創基於深度學習的時空因果推論技術，我們的做法在兩個合成資料集（有和沒有空間干擾）的實驗結果中，展現出優於多種基線方法的優勢。我們在真實世界氣候資料集的結果也與領域知識一致，進一步證明我們提出的方法的有效性。", "author": "Sahara Ali et.al.", "authors": "Sahara Ali, Omar Faruque, Jianwu Wang", "id": "2405.08174v1", "paper_url": "http://arxiv.org/abs/2405.08174v1", "repo": "null"}}