{"2501.13957": {"publish_time": "2025-01-21", "title": "Benchmarking Generative AI for Scoring Medical Student Interviews in Objective Structured Clinical Examinations (OSCEs)", "paper_summary": "Introduction. Objective Structured Clinical Examinations (OSCEs) are widely\nused to assess medical students' communication skills, but scoring\ninterview-based assessments is time-consuming and potentially subject to human\nbias. This study explored the potential of large language models (LLMs) to\nautomate OSCE evaluations using the Master Interview Rating Scale (MIRS).\n  Methods. We compared the performance of four state-of-the-art LLMs (GPT-4o,\nClaude 3.5, Llama 3.1, and Gemini 1.5 Pro) in evaluating OSCE transcripts\nacross all 28 items of the MIRS under the conditions of zero-shot,\nchain-of-thought (CoT), few-shot, and multi-step prompting. The models were\nbenchmarked against a dataset of 10 OSCE cases with 174 expert consensus scores\navailable. Model performance was measured using three accuracy metrics (exact,\noff-by-one, thresholded).\n  Results. Averaging across all MIRS items and OSCE cases, LLMs performed with\nlow exact accuracy (0.27 to 0.44), and moderate to high off-by-one accuracy\n(0.67 to 0.87) and thresholded accuracy (0.75 to 0.88). A zero temperature\nparameter ensured high intra-rater reliability ($\\alpha = 0.98$ for GPT-4o).\nCoT, few-shot, and multi-step techniques proved valuable when tailored to\nspecific assessment items. The performance was consistent across MIRS items\nindependent of encounter phases and communication domains.\n  Conclusion. We demonstrated the feasibility of AI-assisted OSCE evaluation\nand provided benchmarking of multiple LLMs across multiple prompt techniques.\nOur work provides a baseline performance assessment for LLMs that lays a\nfoundation for future research in automated assessment of clinical\ncommunication skills.", "paper_summary_zh": "<paragraph>緒論。客觀結構化臨床考試 (OSCE) 廣泛用於評量醫學生的溝通技巧，但評分基於訪談的評量非常耗時，且潛在受到人類偏見的影響。本研究探討大型語言模型 (LLM) 使用大師訪談評分量表 (MIRS) 自動化 OSCE 評量的可能性。\n方法。我們比較了四種最先進的 LLM（GPT-4o、Claude 3.5、Llama 3.1 和 Gemini 1.5 Pro）在評量 OSCE 成績單的表現，範圍涵蓋 MIRS 的所有 28 個項目，條件為零次學習、思考鏈 (CoT)、少次學習和多步驟提示。這些模型以 10 個 OSCE 案例的資料集為基準，其中有 174 個專家共識分數可用。模型表現使用三個準確性指標（完全、偏離一、閾值）進行衡量。\n結果。平均所有 MIRS 項目和 OSCE 案例，LLM 的完全準確性低（0.27 到 0.44），偏離一準確性中等至高（0.67 到 0.87），閾值準確性高（0.75 到 0.88）。零溫度參數確保了很高的評分者內部信度（GPT-4o 的 α = 0.98）。當針對特定評量項目進行調整時，CoT、少次學習和多步驟技術被證明是有價值的。表現與 MIRS 項目一致，與遭遇階段和溝通領域無關。\n結論。我們展示了 AI 輔助 OSCE 評量的可行性，並提供了多種提示技術的 LLM 基準測試。我們的研究為 LLM 提供了基準表現評量，為臨床溝通技巧自動化評量的未來研究奠定了基礎。</paragraph>", "author": "Jadon Geathers et.al.", "authors": "Jadon Geathers, Yann Hicke, Colleen Chan, Niroop Rajashekar, Justin Sewell, Susannah Cornes, Rene Kizilcec, Dennis Shung", "id": "2501.13957v1", "paper_url": "http://arxiv.org/abs/2501.13957v1", "repo": "null"}}