{"2501.02683": {"publish_time": "2025-01-05", "title": "From Superficial Patterns to Semantic Understanding: Fine-Tuning Language Models on Contrast Sets", "paper_summary": "Large scale pretrained language models have demonstrated high performance on\nstandard datasets for natural language inference (NLI) tasks. Unfortunately,\nthese evaluations can be misleading, as although the models can perform well on\nin-distribution data, they perform poorly on out-of-distribution test sets,\nsuch as contrast sets. Contrast sets consist of perturbed instances of data\nthat have very minor, but meaningful, changes to the input that alter the gold\nlabel, revealing how models can learn superficial patterns in the training data\nrather than learning more sophisticated language nuances. As an example, the\nELECTRA-small language model achieves nearly 90% accuracy on an SNLI dataset\nbut drops to 75% when tested on an out-of-distribution contrast set. The\nresearch performed in this study explores how a language models' robustness can\nbe improved by exposing it to small amounts of more complex contrast sets\nduring training to help it better learn language patterns. With this approach,\nthe model regains performance and achieves nearly 90% accuracy on contrast\nsets, highlighting the importance of diverse and challenging training data.", "paper_summary_zh": "大型预训练语言模型在自然语言推理 (NLI) 任务的标准数据集上表现出高性能。不幸的是，这些评估可能会产生误导，因为尽管这些模型在分布内数据上表现良好，但它们在分布外测试集（例如对比集）上的表现很差。对比集由数据的扰动实例组成，这些实例对输入进行了非常细微但有意义的更改，从而改变了黄金标签，揭示了模型如何学习训练数据中的表面模式，而不是学习更复杂的语言细微差别。例如，ELECTRA-small 语言模型在 SNLI 数据集上实现了近 90% 的准确率，但在分布外对比集上测试时降至 75%。本研究中进行的研究探讨了如何通过在训练期间将其暴露于少量更复杂的对比集中来提高语言模型的鲁棒性，以帮助它更好地学习语言模式。通过这种方法，模型重新获得性能，并在对比集上实现了近 90% 的准确率，突出了多样化和具有挑战性的训练数据的重要性。", "author": "Daniel Petrov et.al.", "authors": "Daniel Petrov", "id": "2501.02683v1", "paper_url": "http://arxiv.org/abs/2501.02683v1", "repo": "null"}}