{"2406.12646": {"publish_time": "2024-06-18", "title": "An Empirical Study on the Fairness of Foundation Models for Multi-Organ Image Segmentation", "paper_summary": "The segmentation foundation model, e.g., Segment Anything Model (SAM), has\nattracted increasing interest in the medical image community. Early pioneering\nstudies primarily concentrated on assessing and improving SAM's performance\nfrom the perspectives of overall accuracy and efficiency, yet little attention\nwas given to the fairness considerations. This oversight raises questions about\nthe potential for performance biases that could mirror those found in\ntask-specific deep learning models like nnU-Net. In this paper, we explored the\nfairness dilemma concerning large segmentation foundation models. We\nprospectively curate a benchmark dataset of 3D MRI and CT scans of the organs\nincluding liver, kidney, spleen, lung and aorta from a total of 1056 healthy\nsubjects with expert segmentations. Crucially, we document demographic details\nsuch as gender, age, and body mass index (BMI) for each subject to facilitate a\nnuanced fairness analysis. We test state-of-the-art foundation models for\nmedical image segmentation, including the original SAM, medical SAM and SAT\nmodels, to evaluate segmentation efficacy across different demographic groups\nand identify disparities. Our comprehensive analysis, which accounts for\nvarious confounding factors, reveals significant fairness concerns within these\nfoundational models. Moreover, our findings highlight not only disparities in\noverall segmentation metrics, such as the Dice Similarity Coefficient but also\nsignificant variations in the spatial distribution of segmentation errors,\noffering empirical evidence of the nuanced challenges in ensuring fairness in\nmedical image segmentation.", "paper_summary_zh": "例如，任何分割模型（SAM）等分割基础模型在医学影像社群中已引起越来越多的兴趣。早期开创性研究主要集中于从整体准确性和效率的角度评估和改进 SAM 的性能，但很少关注公平性考量。这种疏忽引起了人们对性能偏差的质疑，这些偏差可能反映在 nnU-Net 等特定任务深度学习模型中发现的偏差。在本文中，我们探讨了与大型分割基础模型有关的公平性困境。我们前瞻性地整理了一个基准数据集，其中包含来自 1056 名健康受试者的器官（包括肝脏、肾脏、脾脏、肺和主动脉）的 3D MRI 和 CT 扫描，并由专家进行分割。至关重要的是，我们记录了每个受试者的性别、年龄和体重指数 (BMI) 等人口统计详细信息，以促进细致入微的公平性分析。我们测试了用于医学图像分割的最新基础模型，包括原始 SAM、医学 SAM 和 SAT 模型，以评估不同人口群体的分割效果并找出差异。我们的综合分析考虑了各种混杂因素，揭示了这些基础模型中存在的重大公平性问题。此外，我们的研究结果不仅突出了整体分割指标（例如骰子相似系数）的差异，还突出了分割错误的空间分布的显着差异，为确保医学图像分割中的公平性提供了细微挑战的经验证据。", "author": "Qin Li et.al.", "authors": "Qin Li, Yizhe Zhang, Yan Li, Jun Lyu, Meng Liu, Longyu Sun, Mengting Sun, Qirong Li, Wenyue Mao, Xinran Wu, Yajing Zhang, Yinghua Chu, Shuo Wang, Chengyan Wang", "id": "2406.12646v1", "paper_url": "http://arxiv.org/abs/2406.12646v1", "repo": "null"}}