{"2408.05692": {"publish_time": "2024-08-11", "title": "A Novel Momentum-Based Deep Learning Techniques for Medical Image Classification and Segmentation", "paper_summary": "Accurately segmenting different organs from medical images is a critical\nprerequisite for computer-assisted diagnosis and intervention planning. This\nstudy proposes a deep learning-based approach for segmenting various organs\nfrom CT and MRI scans and classifying diseases. Our study introduces a novel\ntechnique integrating momentum within residual blocks for enhanced training\ndynamics in medical image analysis. We applied our method in two distinct\ntasks: segmenting liver, lung, & colon data and classifying abdominal pelvic CT\nand MRI scans. The proposed approach has shown promising results, outperforming\nstate-of-the-art methods on publicly available benchmarking datasets. For\ninstance, in the lung segmentation dataset, our approach yielded significant\nenhancements over the TransNetR model, including a 5.72% increase in dice\nscore, a 5.04% improvement in mean Intersection over Union (mIoU), an 8.02%\nimprovement in recall, and a 4.42% improvement in precision. Hence,\nincorporating momentum led to state-of-the-art performance in both segmentation\nand classification tasks, representing a significant advancement in the field\nof medical imaging.", "paper_summary_zh": "準確地從醫療影像中分割出不同的器官，是電腦輔助診斷和介入規劃的關鍵先決條件。本研究提出了一種基於深度學習的方法，用於分割 CT 和 MRI 掃描中的各種器官並對疾病進行分類。我們的研究引入了一種新技術，將動量整合到殘差塊中，以增強醫療影像分析中的訓練動態。我們將方法應用於兩個不同的任務：分割肝臟、肺臟和結腸資料，以及對腹部骨盆 CT 和 MRI 掃描進行分類。所提出的方法已顯示出有希望的結果，在公開的基準資料集上優於最先進的方法。例如，在肺部分割資料集中，我們的模型比 TransNetR 模型產生了顯著的提升，包括骰子係數增加了 5.72%，平均聯合交集 (mIoU) 提高了 5.04%，召回率提高了 8.02%，精度提高了 4.42%。因此，結合動量在分割和分類任務中都帶來了最先進的效能，代表了醫療影像領域的重大進展。", "author": "Koushik Biswas et.al.", "authors": "Koushik Biswas, Ridal Pal, Shaswat Patel, Debesh Jha, Meghana Karri, Amit Reza, Gorkem Durak, Alpay Medetalibeyoglu, Matthew Antalek, Yury Velichko, Daniela Ladner, Amir Borhani, Ulas Bagci", "id": "2408.05692v1", "paper_url": "http://arxiv.org/abs/2408.05692v1", "repo": "null"}}