{"2411.05564": {"publish_time": "2024-11-08", "title": "Open-set object detection: towards unified problem formulation and benchmarking", "paper_summary": "In real-world applications where confidence is key, like autonomous driving,\nthe accurate detection and appropriate handling of classes differing from those\nused during training are crucial. Despite the proposal of various unknown\nobject detection approaches, we have observed widespread inconsistencies among\nthem regarding the datasets, metrics, and scenarios used, alongside a notable\nabsence of a clear definition for unknown objects, which hampers meaningful\nevaluation. To counter these issues, we introduce two benchmarks: a unified\nVOC-COCO evaluation, and the new OpenImagesRoad benchmark which provides clear\nhierarchical object definition besides new evaluation metrics. Complementing\nthe benchmark, we exploit recent self-supervised Vision Transformers\nperformance, to improve pseudo-labeling-based OpenSet Object Detection (OSOD),\nthrough OW-DETR++. State-of-the-art methods are extensively evaluated on the\nproposed benchmarks. This study provides a clear problem definition, ensures\nconsistent evaluations, and draws new conclusions about effectiveness of OSOD\nstrategies.", "paper_summary_zh": "在以信心為關鍵的實際應用中，例如自動駕駛，\n準確檢測和適當處理與訓練期間使用的類別不同的類別至關重要。儘管提出了各種未知對象檢測方法，\n我們觀察到它們在所使用的數據集、指標和場景方面存在廣泛的不一致，同時還明顯缺乏對未知對象的明確定義，這阻礙了有意義的\n評估。為了應對這些問題，我們引入了兩個基準：統一的 VOC-COCO 評估，以及新的 OpenImagesRoad 基準，除了新的評估指標外，還提供了清晰的分層對象定義。補充\n基準，我們利用最近的自監督視覺Transformer\n性能，通過 OW-DETR++ 改進基於偽標籤的開放集對象檢測 (OSOD)。最先進的方法在\n提出的基準上得到了廣泛評估。本研究提供了一個明確的問題定義，確保\n一致的評估，並對 OSOD\n策略的有效性得出新的結論。", "author": "Hejer Ammar et.al.", "authors": "Hejer Ammar, Nikita Kiselov, Guillaume Lapouge, Romaric Audigier", "id": "2411.05564v1", "paper_url": "http://arxiv.org/abs/2411.05564v1", "repo": "null"}}