{"2405.07348": {"publish_time": "2024-05-12", "title": "MedConceptsQA: Open Source Medical Concepts QA Benchmark", "paper_summary": "We present MedConceptsQA, a dedicated open source benchmark for medical\nconcepts question answering. The benchmark comprises of questions of various\nmedical concepts across different vocabularies: diagnoses, procedures, and\ndrugs. The questions are categorized into three levels of difficulty: easy,\nmedium, and hard. We conducted evaluations of the benchmark using various Large\nLanguage Models. Our findings show that pre-trained clinical Large Language\nModels achieved accuracy levels close to random guessing on this benchmark,\ndespite being pre-trained on medical data. However, GPT-4 achieves an absolute\naverage improvement of nearly 27%-37% (27% for zero-shot learning and 37% for\nfew-shot learning) when compared to clinical Large Language Models. Our\nbenchmark serves as a valuable resource for evaluating the understanding and\nreasoning of medical concepts by Large Language Models. Our benchmark is\navailable at https://huggingface.co/datasets/ofir408/MedConceptsQA", "paper_summary_zh": "我們提出 MedConceptsQA，一個專門用於醫療概念問答的開放原始碼基準。基準包含不同詞彙中各種醫療概念的問題：診斷、程序和藥物。問題分為三個難度等級：容易、中等和困難。我們使用各種大型語言模型對基準進行了評估。我們的研究結果表明，儘管在醫療數據上進行預訓練，但預訓練的臨床大型語言模型在此基準上達到的準確度接近隨機猜測。然而，與臨床大型語言模型相比，GPT-4 在零次學習中獲得了近 27%-37% 的絕對平均改進，在少次學習中獲得了 37% 的改進。我們的基準作為一種有價值的資源，用於評估大型語言模型對醫療概念的理解和推理。我們的基準可在 https://huggingface.co/datasets/ofir408/MedConceptsQA 獲得", "author": "Ofir Ben Shoham et.al.", "authors": "Ofir Ben Shoham, Nadav Rappoport", "id": "2405.07348v2", "paper_url": "http://arxiv.org/abs/2405.07348v2", "repo": "https://github.com/nadavlab/MedConceptsQA"}}