{"2412.12627": {"publish_time": "2024-12-17", "title": "Make Imagination Clearer! Stable Diffusion-based Visual Imagination for Multimodal Machine Translation", "paper_summary": "Visual information has been introduced for enhancing machine translation\n(MT), and its effectiveness heavily relies on the availability of large amounts\nof bilingual parallel sentence pairs with manual image annotations. In this\npaper, we introduce a stable diffusion-based imagination network into a\nmultimodal large language model (MLLM) to explicitly generate an image for each\nsource sentence, thereby advancing the multimodel MT. Particularly, we build\nheuristic human feedback with reinforcement learning to ensure the consistency\nof the generated image with the source sentence without the supervision of\nimage annotation, which breaks the bottleneck of using visual information in\nMT. Furthermore, the proposed method enables imaginative visual information to\nbe integrated into large-scale text-only MT in addition to multimodal MT.\nExperimental results show that our model significantly outperforms existing\nmultimodal MT and text-only MT, especially achieving an average improvement of\nmore than 14 BLEU points on Multi30K multimodal MT benchmarks.", "paper_summary_zh": "視覺資訊已導入以增強機器翻譯 (MT)，其有效性極度仰賴大量具手動影像註解的雙語平行句子對。在本文中，我們將一個穩定的基於擴散的想像網路導入一個多模態大型語言模型 (MLLM) 中，以明確地為每個原始句子產生一個影像，從而推進多模態 MT。特別是，我們建構一個具備強化學習的啟發式人類回饋，以確保產生的影像與原始句子的一致性，無需影像註解的監督，這打破了在 MT 中使用視覺資訊的瓶頸。此外，所提出的方法讓富想像力的視覺資訊能夠整合到大型純文字 MT 中，除了多模態 MT 之外。實驗結果顯示，我們的模型顯著優於現有的多模態 MT 和純文字 MT，特別是在 Multi30K 多模態 MT 基準上平均提升了 14 個 BLEU 點以上。", "author": "Andong Chen et.al.", "authors": "Andong Chen, Yuchen Song, Kehai Chen, Muyun Yang, Tiejun Zhao, Min Zhang", "id": "2412.12627v1", "paper_url": "http://arxiv.org/abs/2412.12627v1", "repo": "null"}}