{"2408.16446": {"publish_time": "2024-08-29", "title": "Is text normalization relevant for classifying medieval charters?", "paper_summary": "This study examines the impact of historical text normalization on the\nclassification of medieval charters, specifically focusing on document dating\nand locating. Using a data set of Middle High German charters from a digital\narchive, we evaluate various classifiers, including traditional and\ntransformer-based models, with and without normalization. Our results indicate\nthat the given normalization minimally improves locating tasks but reduces\naccuracy for dating, implying that original texts contain crucial features that\nnormalization may obscure. We find that support vector machines and gradient\nboosting outperform other models, questioning the efficiency of transformers\nfor this use case. Results suggest a selective approach to historical text\nnormalization, emphasizing the significance of preserving some textual\ncharacteristics that are critical for classification tasks in document\nanalysis.", "paper_summary_zh": "本研究探討了歷史文本正規化對中世紀憲章分類的影響，特別關注文件的年代測定和定位。我們使用來自數位檔案館的中部高地德語憲章資料集，評估了各種分類器，包括傳統和基於轉換器的模型，是否使用正規化。我們的結果表明，給定的正規化最小程度地改進了定位任務，但降低了年代測定的準確性，這意味著原始文本包含正規化可能會掩蓋的重要特徵。我們發現支持向量機和梯度提升優於其他模型，質疑了轉換器在此用例中的效率。結果表明對歷史文本正規化採取選擇性方法，強調保留某些文本特徵的重要性，這些特徵對於文件分析中的分類任務至關重要。", "author": "Florian Atzenhofer-Baumgartner et.al.", "authors": "Florian Atzenhofer-Baumgartner, Tamás Kovács", "id": "2408.16446v1", "paper_url": "http://arxiv.org/abs/2408.16446v1", "repo": "null"}}