{"2411.03895": {"publish_time": "2024-11-06", "title": "Computational Analysis of Gender Depiction in the Comedias of Calderón de la Barca", "paper_summary": "In theatre, playwrights use the portrayal of characters to explore culturally\nbased gender norms. In this paper, we develop quantitative methods to study\ngender depiction in the non-religious works (comedias) of Pedro Calder\\'on de\nla Barca, a prolific Spanish 17th century author. We gather insights from a\ncorpus of more than 100 plays by using a gender classifier and applying model\nexplainability (attribution) methods to determine which text features are most\ninfluential in the model's decision to classify speech as 'male' or 'female',\nindicating the most gendered elements of dialogue in Calder\\'on's comedias in a\nhuman accessible manner. We find that female and male characters are portrayed\ndifferently and can be identified by the gender prediction model at practically\nuseful accuracies (up to f=0.83). Analysis reveals semantic aspects of gender\nportrayal, and demonstrates that the model is even useful in providing a\nrelatively accurate scene-by-scene prediction of cross-dressing characters.", "paper_summary_zh": "在戲劇中，劇作家會利用角色的描寫來探討文化中的性別規範。在本文中，我們發展出定量方法來研究性別在佩德羅·卡爾德隆·德·拉·巴卡的非宗教作品（喜劇）中的描繪，他是 17 世紀西班牙的一位多產作家。我們從超過 100 部戲劇的語料庫中收集見解，使用性別分類器並應用模型可解釋性（歸因）方法來確定哪些文字特徵最能影響模型將語言分類為「男性」或「女性」的決定，以人類可理解的方式指出卡爾德隆喜劇中對話中最具性別特質的元素。我們發現女性和男性角色的描繪不同，而且性別預測模型可以以實用的準確度（高達 f=0.83）辨識出這些角色。分析揭示了性別描繪的語義面向，並證明了該模型甚至可以相當準確地預測喬裝角色的場景。", "author": "Allison Keith et.al.", "authors": "Allison Keith, Antonio Rojas Castro, Sebastian Padó", "id": "2411.03895v1", "paper_url": "http://arxiv.org/abs/2411.03895v1", "repo": "null"}}