{"2410.06957": {"publish_time": "2024-10-09", "title": "Support Vector Boosting Machine (SVBM): Enhancing Classification Performance with AdaBoost and Residual Connections", "paper_summary": "In traditional boosting algorithms, the focus on misclassified training\nsamples emphasizes their importance based on difficulty during the learning\nprocess. While using a standard Support Vector Machine (SVM) as a weak learner\nin an AdaBoost framework can enhance model performance by concentrating on\nerror samples, this approach introduces significant challenges. Specifically,\nSVMs, characterized by their stability and robustness, may require\ndestabilization to fit the boosting paradigm, which in turn can constrain\nperformance due to reliance on the weighted results from preceding iterations.\nTo address these challenges, we propose the Support Vector Boosting Machine\n(SVBM), which integrates a novel subsampling process with SVM algorithms and\nresidual connection techniques. This method updates sample weights by\nconsidering both the current model's predictions and the outputs from prior\nrounds, allowing for effective sparsity control. The SVBM framework enhances\nthe ability to form complex decision boundaries, thereby improving\nclassification performance. The MATLAB source code for SVBM can be accessed at\nhttps://github.com/junbolian/SVBM.", "paper_summary_zh": "在傳統的提升演算法中，著重於錯誤分類的訓練樣本，強調它們在學習過程中基於難度的重要性。雖然在 AdaBoost 架構中使用標準支援向量機 (SVM) 作為弱學習器，可以透過專注於錯誤樣本來增強模型效能，但這種方法會帶來重大的挑戰。具體來說，SVM 以其穩定性和穩健性為特徵，可能需要不穩定化才能符合提升範例，而這反過來又會由於依賴於前一次反覆運算的加權結果而限制效能。為了應對這些挑戰，我們提出了支援向量提升機 (SVBM)，它將創新的子抽樣流程與 SVM 演算法和殘差連接技術整合在一起。此方法透過考量目前模型的預測和前一輪的輸出，來更新樣本權重，從而允許有效的稀疏性控制。SVBM 架構增強了形成複雜決策邊界的能​​力，從而改善了分類效能。SVBM 的 MATLAB 原始碼可以在 https://github.com/junbolian/SVBM 取得。", "author": "Junbo Jacob Lian et.al.", "authors": "Junbo Jacob Lian", "id": "2410.06957v1", "paper_url": "http://arxiv.org/abs/2410.06957v1", "repo": "null"}}