{"2411.19244": {"publish_time": "2024-11-28", "title": "Consolidating and Developing Benchmarking Datasets for the Nepali Natural Language Understanding Tasks", "paper_summary": "The Nepali language has distinct linguistic features, especially its complex\nscript (Devanagari script), morphology, and various dialects, which pose a\nunique challenge for natural language processing (NLP) evaluation. While the\nNepali Language Understanding Evaluation (Nep-gLUE) benchmark provides a\nfoundation for evaluating models, it remains limited in scope, covering four\ntasks. This restricts their utility for comprehensive assessments of NLP\nmodels. To address this limitation, we introduce eight new datasets, creating a\nnew benchmark, the Nepali Language Understanding Evaluation (NLUE) benchmark,\nwhich covers a total of 12 tasks for evaluating the performance of models\nacross a diverse set of Natural Language Understanding (NLU) tasks. The added\ntasks include single-sentence classification, similarity and paraphrase tasks,\nand Natural Language Inference (NLI) tasks. On evaluating the models using\nadded tasks, we observe that the existing models fall short in handling complex\nNLU tasks effectively. This expanded benchmark sets a new standard for\nevaluating, comparing, and advancing models, contributing significantly to the\nbroader goal of advancing NLP research for low-resource languages.", "paper_summary_zh": "尼泊爾語具有獨特的語言特徵，特別是其複雜的文字（天城文）、形態學和各種方言，對自然語言處理 (NLP) 評估構成獨特的挑戰。儘管尼泊爾語理解評估 (Nep-gLUE) 基準為評估模型提供了基礎，但其範圍仍然有限，僅涵蓋四項任務。這限制了它們對 NLP 模型進行全面評估的效用。為了解決這個限制，我們引入了八個新資料集，建立了一個新的基準，即尼泊爾語理解評估 (NLUE) 基準，它涵蓋了總共 12 項任務，用於評估模型在各種自然語言理解 (NLU) 任務中的表現。新增的任務包括單句分類、相似性和同義詞改寫任務，以及自然語言推理 (NLI) 任務。在使用新增任務評估模型時，我們觀察到現有模型在有效處理複雜的 NLU 任務方面存在不足。這個擴展的基準為評估、比較和推進模型設定了一個新的標準，為推進低資源語言的 NLP 研究的更廣泛目標做出了重大貢獻。", "author": "Jinu Nyachhyon et.al.", "authors": "Jinu Nyachhyon, Mridul Sharma, Prajwal Thapa, Bal Krishna Bal", "id": "2411.19244v1", "paper_url": "http://arxiv.org/abs/2411.19244v1", "repo": "null"}}