{"2406.06326": {"publish_time": "2024-06-10", "title": "Self-Tuning: Instructing LLMs to Effectively Acquire New Knowledge through Self-Teaching", "paper_summary": "Large language models (LLMs) often struggle to provide up-to-date information\ndue to their one-time training and the constantly evolving nature of the world.\nTo keep LLMs current, existing approaches typically involve continued\npre-training on new documents. However, they frequently face difficulties in\nextracting stored knowledge. Motivated by the remarkable success of the Feynman\nTechnique in efficient human learning, we introduce Self-Tuning, a learning\nframework aimed at improving an LLM's ability to effectively acquire new\nknowledge from raw documents through self-teaching. Specifically, we develop a\nSelf-Teaching strategy that augments the documents with a set of\nknowledge-intensive tasks created in a self-supervised manner, focusing on\nthree crucial aspects: memorization, comprehension, and self-reflection.\nAdditionally, we introduce three Wiki-Newpages-2023-QA datasets to facilitate\nan in-depth analysis of an LLM's knowledge acquisition ability concerning\nmemorization, extraction, and reasoning. Extensive experimental results on\nLlama2 family models reveal that Self-Tuning consistently exhibits superior\nperformance across all knowledge acquisition tasks and excels in preserving\nprevious knowledge.", "paper_summary_zh": "大型語言模型（LLM）通常難以提供最新資訊，因為它們是一次性訓練，而世界不斷在演變。為了讓 LLM 保持最新，現有方法通常涉及持續對新文件進行預訓練。然而，它們經常在提取儲存的知識時遇到困難。受到費曼技巧在有效人類學習中顯著成功的啟發，我們引入了自適應，這是一個學習架構，旨在通過自學提高 LLM 從原始文件中有效獲取新知識的能力。具體來說，我們開發了一種自學策略，該策略使用以自監督方式建立的一組知識密集型任務來擴充文件，重點關注三個關鍵方面：記憶、理解和自我反省。此外，我們引入了三個 Wiki-Newpages-2023-QA 數據集，以利於深入分析 LLM 在記憶、提取和推理方面的知識獲取能力。在 Llama2 家族模型上的廣泛實驗結果表明，自適應在所有知識獲取任務中持續表現出優異的性能，並且擅長保留先前的知識。", "author": "Xiaoying Zhang et.al.", "authors": "Xiaoying Zhang, Baolin Peng, Ye Tian, Jingyan Zhou, Yipeng Zhang, Haitao Mi, Helen Meng", "id": "2406.06326v1", "paper_url": "http://arxiv.org/abs/2406.06326v1", "repo": "null"}}