{"2412.20901": {"publish_time": "2024-12-30", "title": "ILDiff: Generate Transparent Animated Stickers by Implicit Layout Distillation", "paper_summary": "High-quality animated stickers usually contain transparent channels, which\nare often ignored by current video generation models. To generate fine-grained\nanimated transparency channels, existing methods can be roughly divided into\nvideo matting algorithms and diffusion-based algorithms. The methods based on\nvideo matting have poor performance in dealing with semi-open areas in\nstickers, while diffusion-based methods are often used to model a single image,\nwhich will lead to local flicker when modeling animated stickers. In this\npaper, we firstly propose an ILDiff method to generate animated transparent\nchannels through implicit layout distillation, which solves the problems of\nsemi-open area collapse and no consideration of temporal information in\nexisting methods. Secondly, we create the Transparent Animated Sticker Dataset\n(TASD), which contains 0.32M high-quality samples with transparent channel, to\nprovide data support for related fields. Extensive experiments demonstrate that\nILDiff can produce finer and smoother transparent channels compared to other\nmethods such as Matting Anything and Layer Diffusion. Our code and dataset will\nbe released at link https://xiaoyuan1996.github.io.", "paper_summary_zh": "高品質的動態貼圖通常包含透明通道，而這通常會被目前的影片生成模型所忽略。為了生成細緻的動態透明通道，現有的方法大致上可以分為影片去背演算法和基於擴散的演算法。基於影片去背的方法在處理貼圖中的半開放區域時效能不佳，而基於擴散的方法通常用於建模單一影像，這將會在建模動態貼圖時導致局部閃爍。在本文中，我們首先提出一個 ILDiff 方法，透過隱式佈局萃取來生成動態透明通道，這解決了現有方法中半開放區域崩潰和未考慮時間資訊的問題。其次，我們建立了透明動態貼圖資料集 (TASD)，其中包含 0.32M 個具有透明通道的高品質樣本，以提供相關領域的資料支援。廣泛的實驗證明，與 Matting Anything 和 Layer Diffusion 等其他方法相比，ILDiff 能夠產生更細緻、更平滑的透明通道。我們的程式碼和資料集將在 https://xiaoyuan1996.github.io/ 連結中釋出。", "author": "Ting Zhang et.al.", "authors": "Ting Zhang, Zhiqiang Yuan, Yeshuang Zhu, Jinchao Zhang", "id": "2412.20901v1", "paper_url": "http://arxiv.org/abs/2412.20901v1", "repo": "null"}}