{"2412.15150": {"publish_time": "2024-12-19", "title": "Leveraging Color Channel Independence for Improved Unsupervised Object Detection", "paper_summary": "Object-centric architectures can learn to extract distinct object\nrepresentations from visual scenes, enabling downstream applications on the\nobject level. Similarly to autoencoder-based image models, object-centric\napproaches have been trained on the unsupervised reconstruction loss of images\nencoded by RGB color spaces. In our work, we challenge the common assumption\nthat RGB images are the optimal color space for unsupervised learning in\ncomputer vision. We discuss conceptually and empirically that other color\nspaces, such as HSV, bear essential characteristics for object-centric\nrepresentation learning, like robustness to lighting conditions. We further\nshow that models improve when requiring them to predict additional color\nchannels. Specifically, we propose to transform the predicted targets to the\nRGB-S space, which extends RGB with HSV's saturation component and leads to\nmarkedly better reconstruction and disentanglement for five common evaluation\ndatasets. The use of composite color spaces can be implemented with basically\nno computational overhead, is agnostic of the models' architecture, and is\nuniversally applicable across a wide range of visual computing tasks and\ntraining types. The findings of our approach encourage additional\ninvestigations in computer vision tasks beyond object-centric learning.", "paper_summary_zh": "物件中心架构可以学习从视觉场景中萃取出不同的物件表征，让下游应用能够在物件层级上运行。类似于基于自动编码器的图像模型，物件中心方法已经过训练，可以无监督地重建由 RGB 色彩空间编码的图像的损失。在我们的工作中，我们挑战了 RGB 图像是计算机视觉中无监督学习的最佳色彩空间的普遍假设。我们从概念上和经验上讨论了其他色彩空间（例如 HSV）具有物件中心表征学习的基本特性，例如对光照条件的鲁棒性。我们进一步表明，当要求模型预测额外的色彩通道时，模型会得到改善。具体来说，我们建议将预测目标转换为 RGB-S 空间，该空间使用 HSV 的饱和度分量扩展了 RGB，并导致五个常见评估数据集的重建和解缠明显更好。复合色彩空间的使用基本上可以不增加计算开销来实现，与模型的架构无关，并且普遍适用于广泛的视觉计算任务和训练类型。我们方法的发现鼓励在超越物件中心学习的计算机视觉任务中进行额外的调查。", "author": "Bastian Jäckl et.al.", "authors": "Bastian Jäckl, Yannick Metz, Udo Schlegel, Daniel A. Keim, Maximilian T. Fischer", "id": "2412.15150v1", "paper_url": "http://arxiv.org/abs/2412.15150v1", "repo": "null"}}