{"2408.04689": {"publish_time": "2024-08-08", "title": "Design of a Quality Management System based on the EU Artificial Intelligence Act", "paper_summary": "The Artificial Intelligence Act of the European Union mandates that providers\nand deployers of high-risk AI systems establish a quality management system\n(QMS). Among other criteria, a QMS shall help to i) identify, analyze,\nevaluate, and mitigate risks, ii) ensure evidence of compliance with training,\nvalidation, and testing data, and iii) verify and document the AI system design\nand quality. Current research mainly addresses conceptual considerations and\nframework designs for AI risk assessment and auditing processes. However, it\noften overlooks practical tools that actively involve and support humans in\nchecking and documenting high-risk or general-purpose AI systems. This paper\naddresses this gap by proposing requirements derived from legal regulations and\na generic design and architecture of a QMS for AI systems verification and\ndocumentation. A first version of a prototype QMS is implemented, integrating\nLLMs as examples of AI systems and focusing on an integrated risk management\nsub-service. The prototype is evaluated on i) a user story-based qualitative\nrequirements assessment using potential stakeholder scenarios and ii) a\ntechnical assessment of the required GPU storage and performance.", "paper_summary_zh": "歐盟的人工智慧法規要求高風險 AI 系統的供應商和部署者建立品質管理系統 (QMS)。在其他標準中，QMS 應有助於 i) 識別、分析、評估和減輕風險，ii) 確保符合訓練、驗證和測試資料的證據，以及 iii) 驗證和記錄 AI 系統設計和品質。目前的研究主要針對 AI 風險評估和稽核程序的概念性考量和架構設計。然而，它經常忽略實用的工具，這些工具能積極地讓人類參與並協助檢查和記錄高風險或一般用途的 AI 系統。本文透過提出源自法規要求的規範，以及 AI 系統驗證和記錄的 QMS 通用設計和架構，來解決此一落差。已實作原型 QMS 的第一個版本，整合 LLM 作為 AI 系統的範例，並專注於整合風險管理子服務。原型在 i) 使用潛在利害關係人情境的使用者故事為基礎的定性需求評估，以及 ii) 所需 GPU 儲存和效能的技術評估中進行評估。", "author": "Henryk Mustroph et.al.", "authors": "Henryk Mustroph, Stefanie Rinderle-Ma", "id": "2408.04689v1", "paper_url": "http://arxiv.org/abs/2408.04689v1", "repo": "null"}}