{"2410.08964": {"publish_time": "2024-10-11", "title": "Language Imbalance Driven Rewarding for Multilingual Self-improving", "paper_summary": "Large Language Models (LLMs) have achieved state-of-the-art performance\nacross numerous tasks. However, these advancements have predominantly benefited\n\"first-class\" languages such as English and Chinese, leaving many other\nlanguages underrepresented. This imbalance, while limiting broader\napplications, generates a natural preference ranking between languages,\noffering an opportunity to bootstrap the multilingual capabilities of LLM in a\nself-improving manner. Thus, we propose $\\textit{Language Imbalance Driven\nRewarding}$, where the inherent imbalance between dominant and non-dominant\nlanguages within LLMs is leveraged as a reward signal. Iterative DPO training\ndemonstrates that this approach not only enhances LLM performance in\nnon-dominant languages but also improves the dominant language's capacity,\nthereby yielding an iterative reward signal. Fine-tuning\nMeta-Llama-3-8B-Instruct over two iterations of this approach results in\ncontinuous improvements in multilingual performance across\ninstruction-following and arithmetic reasoning tasks, evidenced by an average\nimprovement of 7.46% win rate on the X-AlpacaEval leaderboard and 13.9%\naccuracy on the MGSM benchmark. This work serves as an initial exploration,\npaving the way for multilingual self-improvement of LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 在許多任務中都達到了最先進的效能。然而，這些進步主要使英語和中文等「一級」語言受益，導致許多其他語言的代表性不足。這種不平衡限制了更廣泛的應用，同時在語言之間產生了自然的偏好排名，提供了一個以自我提升的方式引導 LLM 多語言能力的機會。因此，我們提出了「語言不平衡驅動獎勵」，其中 LLM 中主導語言和非主導語言之間的固有不平衡被利用為獎勵訊號。反覆的 DPO 訓練證明，這種方法不僅增強了 LLM 在非主導語言中的效能，也提升了主導語言的能力，從而產生反覆的獎勵訊號。針對此方法進行兩次反覆微調 Meta-Llama-3-8B-Instruct，結果顯示多語言效能持續改善，包括遵循指示和算術推理任務，這從 X-AlpacaEval 排行榜上平均提升 7.46% 的獲勝率和 MGSM 基準上 13.9% 的準確度中得到證明。這項工作作為一項初步探索，為 LLM 的多語言自我提升鋪平了道路。", "author": "Wen Yang et.al.", "authors": "Wen Yang, Junhong Wu, Chen Wang, Chengqing Zong, Jiajun Zhang", "id": "2410.08964v1", "paper_url": "http://arxiv.org/abs/2410.08964v1", "repo": "null"}}