{"2407.15987": {"publish_time": "2024-07-22", "title": "AI for Handball: predicting and explaining the 2024 Olympic Games tournament with Deep Learning and Large Language Models", "paper_summary": "Over summer 2024, the world will be looking at Paris to encourage their\nfavorite athletes win the Olympic gold medal. In handball, few nations will\nfight hard to win the precious metal with speculations predicting the victory\nfor France or Denmark for men and France or Norway for women. However, there is\nso far no scientific method proposed to predict the final results of the\ncompetition. In this work, we leverage a deep learning model to predict the\nresults of the handball tournament of the 2024 Olympic Games. This model,\ncoupled with explainable AI (xAI) techniques, allows us to extract insightful\ninformation about the main factors influencing the outcome of each match.\nNotably, xAI helps sports experts understand how factors like match information\nor individual athlete performance contribute to the predictions. Furthermore,\nwe integrate Large Language Models (LLMs) to generate human-friendly\nexplanations that highlight the most important factors impacting the match\nresults. By providing human-centric explanations, our approach offers a deeper\nunderstanding of the AI predictions, making them more actionable for coaches\nand analysts.", "paper_summary_zh": "2024 年夏季，全世界將關注巴黎，為他們最喜愛的運動員加油，希望他們贏得奧運金牌。在手球比賽中，少數國家將竭盡全力爭奪這塊珍貴的獎牌，預測法國或丹麥將贏得男子組冠軍，法國或挪威將贏得女子組冠軍。然而，到目前為止，還沒有提出任何科學方法來預測比賽的最終結果。在這項工作中，我們利用深度學習模型來預測 2024 年奧運會手球比賽的結果。此模型結合可解釋 AI (xAI) 技術，讓我們能夠提取有關影響每場比賽結果的主要因素的深入資訊。值得注意的是，xAI 幫助體育專家了解比賽資訊或個別運動員表現等因素如何影響預測。此外，我們整合大型語言模型 (LLM) 來產生友善的解釋，強調影響比賽結果最重要的因素。透過提供以人為中心的解釋，我們的做法提供了對 AI 預測更深入的了解，讓教練和分析師可以採取更多行動。", "author": "Florian Felice et.al.", "authors": "Florian Felice", "id": "2407.15987v1", "paper_url": "http://arxiv.org/abs/2407.15987v1", "repo": "null"}}