{"2405.19290": {"publish_time": "2024-05-29", "title": "Integrating Multi-scale Contextualized Information for Byte-based Neural Machine Translation", "paper_summary": "Subword tokenization is a common method for vocabulary building in Neural\nMachine Translation (NMT) models. However, increasingly complex tasks have\nrevealed its disadvantages. First, a vocabulary cannot be modified once it is\nlearned, making it hard to adapt to new words. Second, in multilingual\ntranslation, the imbalance in data volumes across different languages spreads\nto the vocabulary, exacerbating translations involving low-resource languages.\nWhile byte-based tokenization addresses these issues, byte-based models\nstruggle with the low information density inherent in UTF-8 byte sequences.\nPrevious works enhance token semantics through local contextualization but fail\nto select an appropriate contextualizing scope based on the input.\nConsequently, we propose the Multi-Scale Contextualization (MSC) method, which\nlearns contextualized information of varying scales across different hidden\nstate dimensions. It then leverages the attention module to dynamically\nintegrate the multi-scale contextualized information. Experiments show that MSC\nsignificantly outperforms subword-based and other byte-based methods in both\nmultilingual and out-of-domain scenarios. Code can be found in\nhttps://github.com/ictnlp/Multiscale-Contextualization.", "paper_summary_zh": "次單元詞彙化是神經機器翻譯 (NMT) 模型中建立詞彙的常見方法。然而，日益複雜的任務揭露了它的缺點。首先，一旦詞彙被學習，它就不能被修改，這使得它難以適應新詞彙。其次，在多語言翻譯中，不同語言之間的資料量不平衡會擴散到詞彙中，加劇涉及低資源語言的翻譯。雖然基於位元組的詞彙化可解決這些問題，但基於位元組的模型難以處理 UTF-8 位元組序列中固有的低資訊密度。先前的作品透過局部脈絡化來增強詞彙語義，但無法根據輸入選擇適當的脈絡化範圍。因此，我們提出多尺度脈絡化 (MSC) 方法，它跨不同隱藏狀態維度學習不同尺度的脈絡化資訊。然後，它利用注意力模組動態整合多尺度脈絡化資訊。實驗表明，MSC 在多語言和領域外場景中都明顯優於基於次單元詞和基於位元組的其他方法。程式碼可在 https://github.com/ictnlp/Multiscale-Contextualization 中找到。", "author": "Langlin Huang et.al.", "authors": "Langlin Huang, Yang Feng", "id": "2405.19290v1", "paper_url": "http://arxiv.org/abs/2405.19290v1", "repo": "https://github.com/ictnlp/multiscale-contextualization"}}