{"2405.04732": {"publish_time": "2024-05-08", "title": "S-EQA: Tackling Situational Queries in Embodied Question Answering", "paper_summary": "We present and tackle the problem of Embodied Question Answering (EQA) with\nSituational Queries (S-EQA) in a household environment. Unlike prior EQA work\ntackling simple queries that directly reference target objects and quantifiable\nproperties pertaining them, EQA with situational queries (such as \"Is the\nbathroom clean and dry?\") is more challenging, as the agent needs to figure out\nnot just what the target objects pertaining to the query are, but also requires\na consensus on their states to be answerable. Towards this objective, we first\nintroduce a novel Prompt-Generate-Evaluate (PGE) scheme that wraps around an\nLLM's output to create a dataset of unique situational queries, corresponding\nconsensus object information, and predicted answers. PGE maintains uniqueness\namong the generated queries, using multiple forms of semantic similarity. We\nvalidate the generated dataset via a large scale user-study conducted on\nM-Turk, and introduce it as S-EQA, the first dataset tackling EQA with\nsituational queries. Our user study establishes the authenticity of S-EQA with\na high 97.26% of the generated queries being deemed answerable, given the\nconsensus object data. Conversely, we observe a low correlation of 46.2% on the\nLLM-predicted answers to human-evaluated ones; indicating the LLM's poor\ncapability in directly answering situational queries, while establishing\nS-EQA's usability in providing a human-validated consensus for an indirect\nsolution. We evaluate S-EQA via Visual Question Answering (VQA) on VirtualHome,\nwhich unlike other simulators, contains several objects with modifiable states\nthat also visually appear different upon modification -- enabling us to set a\nquantitative benchmark for S-EQA. To the best of our knowledge, this is the\nfirst work to introduce EQA with situational queries, and also the first to use\na generative approach for query creation.", "paper_summary_zh": "<paragraph>我們提出並解決了在家庭環境中使用情境查詢（S-EQA）的具身問題回答（EQA）問題。與先前處理直接引用目標對象和與之相關的可量化屬性的簡單查詢的 EQA 工作不同，使用情境查詢（例如「浴室是否乾淨乾燥？」）的 EQA 更具挑戰性，因為代理必須找出不只是與查詢相關的目標對象，還需要就其狀態達成共識才能回答。為了達成此目標，我們首先介紹一個新穎的提示生成評估（PGE）架構，它包覆 LLM 的輸出以建立一個包含獨特情境查詢、對應共識對象資訊和預測答案的資料集。PGE 使用多種形式的語義相似性，在生成的查詢中維持獨特性。我們透過在 M-Turk 上進行的大規模使用者研究驗證所生成的資料集，並將其作為 S-EQA 介紹，這是第一個處理使用情境查詢的 EQA 的資料集。我們的使用者研究建立了 S-EQA 的真實性，在給定共識對象資料的情況下，97.26% 的生成查詢被認為是可以回答的。相反地，我們觀察到 LLM 預測答案與人類評估答案之間的相關性很低，只有 46.2%；這表示 LLM 直接回答情境查詢的能力很差，同時建立了 S-EQA 在提供間接解決方案的人類驗證共識方面的可用性。我們透過在 VirtualHome 上的視覺問答（VQA）評估 S-EQA，與其他模擬器不同，它包含了幾個狀態可修改的對象，這些對象在修改後在視覺上也會出現不同的變化，使我們能夠為 S-EQA 設定一個量化基準。據我們所知，這是第一個介紹使用情境查詢的 EQA 的研究，也是第一個使用生成式方法進行查詢建立的研究。</paragraph>", "author": "Vishnu Sashank Dorbala et.al.", "authors": "Vishnu Sashank Dorbala, Prasoon Goyal, Robinson Piramuthu, Michael Johnston, Dinesh Manocha, Reza Ghanadhan", "id": "2405.04732v1", "paper_url": "http://arxiv.org/abs/2405.04732v1", "repo": "null"}}