{"2501.14603": {"publish_time": "2025-01-24", "title": "Age and Power Minimization via Meta-Deep Reinforcement Learning in UAV Networks", "paper_summary": "Age-of-information (AoI) and transmission power are crucial performance\nmetrics in low energy wireless networks, where information freshness is of\nparamount importance. This study examines a power-limited internet of things\n(IoT) network supported by a flying unmanned aerial vehicle(UAV) that collects\ndata. Our aim is to optimize the UAV flight trajectory and scheduling policy to\nminimize a varying AoI and transmission power combination. To tackle this\nvariation, this paper proposes a meta-deep reinforcement learning (RL) approach\nthat integrates deep Q-networks (DQNs) with model-agnostic meta-learning\n(MAML). DQNs determine optimal UAV decisions, while MAML enables scalability\nacross varying objective functions. Numerical results indicate that the\nproposed algorithm converges faster and adapts to new objectives more\neffectively than traditional deep RL methods, achieving minimal AoI and\ntransmission power overall.", "paper_summary_zh": "資訊年齡 (AoI) 和傳輸功率是低能耗無線網路中至關重要的效能指標，其中資訊新鮮度至關重要。本研究探討由飛行無人機 (UAV) 支援的電力受限物聯網 (IoT) 網路，該無人機負責收集資料。我們的目標是最佳化無人機飛行軌跡和排程政策，以最小化變動的 AoI 和傳輸功率組合。為了應對這種變動，本文提出了一種元深度強化學習 (RL) 方法，它將深度 Q 網路 (DQN) 與模型不可知的元學習 (MAML) 整合在一起。DQN 決定最佳無人機決策，而 MAML 則支援在不同的目標函數之間進行擴充。數值結果表明，與傳統的深度 RL 方法相比，所提出的演算法收斂得更快，並且更有效地適應新的目標，整體上實現了最小的 AoI 和傳輸功率。", "author": "Sankani Sarathchandra et.al.", "authors": "Sankani Sarathchandra, Eslam Eldeeb, Mohammad Shehab, Hirley Alves, Konstantin Mikhaylov, Mohamed-Slim Alouini", "id": "2501.14603v1", "paper_url": "http://arxiv.org/abs/2501.14603v1", "repo": "null"}}