{"2504.02810": {"publish_time": "2025-04-03", "title": "Generative Evaluation of Complex Reasoning in Large Language Models", "paper_summary": "With powerful large language models (LLMs) demonstrating superhuman reasoning\ncapabilities, a critical question arises: Do LLMs genuinely reason, or do they\nmerely recall answers from their extensive, web-scraped training datasets?\nPublicly released benchmarks inevitably become contaminated once incorporated\ninto subsequent LLM training sets, undermining their reliability as faithful\nassessments. To address this, we introduce KUMO, a generative evaluation\nframework designed specifically for assessing reasoning in LLMs. KUMO\nsynergistically combines LLMs with symbolic engines to dynamically produce\ndiverse, multi-turn reasoning tasks that are partially observable and\nadjustable in difficulty. Through an automated pipeline, KUMO continuously\ngenerates novel tasks across open-ended domains, compelling models to\ndemonstrate genuine generalization rather than memorization. We evaluated 23\nstate-of-the-art LLMs on 5,000 tasks across 100 domains created by KUMO,\nbenchmarking their reasoning abilities against university students. Our\nfindings reveal that many LLMs have outperformed university-level performance\non easy reasoning tasks, and reasoning-scaled LLMs reach university-level\nperformance on complex reasoning challenges. Moreover, LLM performance on KUMO\ntasks correlates strongly with results on newly released real-world reasoning\nbenchmarks, underscoring KUMO's value as a robust, enduring assessment tool for\ngenuine LLM reasoning capabilities.", "paper_summary_zh": "強大的大型語言模型 (LLM) 展現出超越人類的推理能力，引發了一個關鍵問題：LLM 是真的在推理，還是僅僅從其龐大、從網路擷取的訓練數據集中回憶答案？公開發布的基準測試一旦被納入後續的 LLM 訓練集中，就不可避免地會受到污染，從而損害其作為可靠評估的可靠性。為了應對這個問題，我們引入了 KUMO，這是一個專門設計用於評估 LLM 推理能力的生成式評估框架。KUMO 將 LLM 與符號引擎協同結合，動態生成多樣化、多輪的推理任務，這些任務具有部分可觀察性和可調整的難度。透過自動化流程，KUMO 在開放式領域中不斷生成新穎的任務，迫使模型展現真正的泛化能力，而不是死記硬背。我們在 KUMO 創建的 100 個領域的 5,000 個任務中評估了 23 個最先進的 LLM，將它們的推理能力與大學生進行比較。我們的研究結果表明，許多 LLM 在簡單推理任務上的表現已超越大學程度，而推理規模化的 LLM 在複雜推理挑戰中達到了大學程度的表現。此外，LLM 在 KUMO 任務上的表現與新發布的現實世界推理基準測試的結果密切相關，這突顯了 KUMO 作為一個強大、持久的 LLM 真實推理能力評估工具的價值。\n", "author": "Haowei Lin et.al.", "authors": "Haowei Lin, Xiangyu Wang, Ruilin Yan, Baizhou Huang, Haotian Ye, Jianhua Zhu, Zihao Wang, James Zou, Jianzhu Ma, Yitao Liang", "id": "2504.02810v1", "paper_url": "http://arxiv.org/abs/2504.02810v1", "repo": "null"}}