{"2410.08032": {"publish_time": "2024-10-10", "title": "Strategic Classification With Externalities", "paper_summary": "We propose a new variant of the strategic classification problem: a principal\nreveals a classifier, and $n$ agents report their (possibly manipulated)\nfeatures to be classified. Motivated by real-world applications, our model\ncrucially allows the manipulation of one agent to affect another; that is, it\nexplicitly captures inter-agent externalities. The principal-agent interactions\nare formally modeled as a Stackelberg game, with the resulting agent\nmanipulation dynamics captured as a simultaneous game. We show that under\ncertain assumptions, the pure Nash Equilibrium of this agent manipulation game\nis unique and can be efficiently computed. Leveraging this result, PAC learning\nguarantees are established for the learner: informally, we show that it is\npossible to learn classifiers that minimize loss on the distribution, even when\na random number of agents are manipulating their way to a pure Nash\nEquilibrium. We also comment on the optimization of such classifiers through\ngradient-based approaches. This work sets the theoretical foundations for a\nmore realistic analysis of classifiers that are robust against multiple\nstrategic actors interacting in a common environment.", "paper_summary_zh": "我們提出策略分類問題的新變體：一個委託人揭露一個分類器，而 $n$ 個代理報告他們（可能經過調整）的特性以進行分類。我們的模型受到真實世界應用的啟發，至關重要的是允許一個代理的調整影響另一個代理；也就是說，它明確地捕捉到代理間的外部性。委託-代理互動被正式建模為一個 Stackelberg 遊戲，並將由此產生的代理調整動態捕捉為一個同步遊戲。我們表明在某些假設下，這個代理調整遊戲的純納許均衡是唯一的，並且可以有效地計算。利用這個結果，為學習者建立了 PAC 學習保證：非正式地，我們表明有可能學習最小化分配損失的分類器，即使在隨機數量的代理正在調整他們的方式以達到純納許均衡時也是如此。我們還評論了通過基於梯度的途徑對此類分類器進行優化的問題。這項工作為對在共同環境中互動的、針對多個策略參與者具有魯棒性的分類器的更現實的分析奠定了理論基礎。", "author": "Yiling Chen et.al.", "authors": "Yiling Chen, Safwan Hossain, Evi Micha, Ariel Procaccia", "id": "2410.08032v1", "paper_url": "http://arxiv.org/abs/2410.08032v1", "repo": "null"}}