{"2501.12810": {"publish_time": "2025-01-22", "title": "Machine Learning Modeling for Multi-order Human Visual Motion Processing", "paper_summary": "Our research aims to develop machines that learn to perceive visual motion as\ndo humans. While recent advances in computer vision (CV) have enabled DNN-based\nmodels to accurately estimate optical flow in naturalistic images, a\nsignificant disparity remains between CV models and the biological visual\nsystem in both architecture and behavior. This disparity includes humans'\nability to perceive the motion of higher-order image features (second-order\nmotion), which many CV models fail to capture because of their reliance on the\nintensity conservation law. Our model architecture mimics the cortical V1-MT\nmotion processing pathway, utilizing a trainable motion energy sensor bank and\na recurrent graph network. Supervised learning employing diverse naturalistic\nvideos allows the model to replicate psychophysical and physiological findings\nabout first-order (luminance-based) motion perception. For second-order motion,\ninspired by neuroscientific findings, the model includes an additional sensing\npathway with nonlinear preprocessing before motion energy sensing, implemented\nusing a simple multilayer 3D CNN block. When exploring how the brain acquired\nthe ability to perceive second-order motion in natural environments, in which\npure second-order signals are rare, we hypothesized that second-order\nmechanisms were critical when estimating robust object motion amidst optical\nfluctuations, such as highlights on glossy surfaces. We trained our\ndual-pathway model on novel motion datasets with varying material properties of\nmoving objects. We found that training to estimate object motion from\nnon-Lambertian materials naturally endowed the model with the capacity to\nperceive second-order motion, as can humans. The resulting model effectively\naligns with biological systems while generalizing to both first- and\nsecond-order motion phenomena in natural scenes.", "paper_summary_zh": "<paragraph>我們的研究旨在開發出能像人類一樣學習感知視覺運動的機器。儘管電腦視覺 (CV) 的最新進展已讓基於深度神經網路 (DNN) 的模型能準確估計自然影像中的光流，但 CV 模型與生物視覺系統在架構和行為上仍有顯著差異。這種差異包括人類感知高階影像特徵（二階運動）的能力，由於依賴強度守恆定律，許多 CV 模型無法捕捉到這一點。我們的模型架構模擬了皮質 V1-MT 運動處理路徑，利用可訓練的運動能量感測器組和遞迴圖形網路。採用多樣化自然影片的監督式學習，讓模型能夠複製關於一階（基於亮度）運動感知的心理物理學和生理學發現。對於二階運動，受神經科學發現的啟發，該模型包含了一個額外的感測路徑，在運動能量感測之前進行非線性預處理，並使用簡單的多層 3D CNN 塊進行實作。在探討大腦如何獲得在自然環境中感知二階運動的能力時，其中純二階訊號很少見，我們假設在估計光學波動中的穩健物體運動時，二階機制至關重要，例如光滑表面上的亮點。我們在具有不同移動物體材料屬性的新運動資料集上訓練了我們的雙路徑模型。我們發現，從非朗伯體材料估計物體運動的訓練自然而然地賦予了模型感知二階運動的能力，就像人類一樣。由此產生的模型有效地與生物系統保持一致，同時推廣到自然場景中的一階和二階運動現象。</paragraph>", "author": "Zitang Sun et.al.", "authors": "Zitang Sun, Yen-Ju Chen, Yung-Hao Yang, Yuan Li, Shin'ya Nishida", "id": "2501.12810v1", "paper_url": "http://arxiv.org/abs/2501.12810v1", "repo": "https://github.com/anoymized/multi-order-motion-model"}}