{"2408.14572": {"publish_time": "2024-08-26", "title": "CURLoRA: Stable LLM Continual Fine-Tuning and Catastrophic Forgetting Mitigation", "paper_summary": "This paper introduces CURLoRA, a novel approach to fine-tuning large language\nmodels (LLMs) that leverages CUR matrix decomposition in the context of\nLow-Rank Adaptation (LoRA). Our method addresses two critical challenges in LLM\nfine-tuning: mitigating catastrophic forgetting during continual learning and\nreducing the number of trainable parameters. We propose a unique modification\nto the CUR decomposition process, utilizing inverted probabilities for column\nand row selection which acts as an implicit regularization, and initializing\nthe $U$ matrix as a zero matrix, and only fine-tuning it. We demonstrate\nthrough experiments on multiple datasets that CURLoRA outperforms standard LoRA\nin mitigating catastrophic forgetting. It maintains model stability and\nperformance across tasks while significantly reducing the number of trainable\nparameters. Our results show that CURLoRA achieves very good and stable task\naccuracy while maintaining base model's perplexity scores fixed compared to\nLoRA upon continual fine-tuning, particularly in scenarios with limited data.", "paper_summary_zh": "本文介紹 CURLoRA，一種微調大型語言模型 (LLM) 的新方法，它在低秩適應 (LoRA) 的背景下利用 CUR 矩陣分解。我們的模型解決了 LLM 微調中的兩個關鍵挑戰：減輕持續學習過程中的災難性遺忘，以及減少可訓練參數的數量。我們提出了一個對 CUR 分解過程的獨特修改，利用倒置機率進行欄和列選擇，作為隱式正則化，並將 $U$ 矩陣初始化為零矩陣，並僅對其進行微調。我們通過在多個資料集上進行的實驗證明，CURLoRA 在減輕災難性遺忘方面優於標準 LoRA。它在任務中保持模型穩定性和效能，同時顯著減少可訓練參數的數量。我們的結果表明，與持續微調的 LoRA 相比，CURLoRA 在保持基本模型困惑度分數固定的同時，實現了非常良好且穩定的任務準確度，特別是在資料有限的情況下。", "author": "Muhammad Fawi et.al.", "authors": "Muhammad Fawi", "id": "2408.14572v1", "paper_url": "http://arxiv.org/abs/2408.14572v1", "repo": "https://github.com/mnoorfawi/curlora"}}