{"2412.02530": {"publish_time": "2024-12-03", "title": "WEM-GAN: Wavelet transform based facial expression manipulation", "paper_summary": "Facial expression manipulation aims to change human facial expressions\nwithout affecting face recognition. In order to transform the facial\nexpressions to target expressions, previous methods relied on expression labels\nto guide the manipulation process. However, these methods failed to preserve\nthe details of facial features, which causes the weakening or the loss of\nidentity information in the output image. In our work, we propose WEM-GAN, in\nshort for wavelet-based expression manipulation GAN, which puts more efforts on\npreserving the details of the original image in the editing process. Firstly,\nwe take advantage of the wavelet transform technique and combine it with our\ngenerator with a U-net autoencoder backbone, in order to improve the\ngenerator's ability to preserve more details of facial features. Secondly, we\nalso implement the high-frequency component discriminator, and use\nhigh-frequency domain adversarial loss to further constrain the optimization of\nour model, providing the generated face image with more abundant details.\nAdditionally, in order to narrow the gap between generated facial expressions\nand target expressions, we use residual connections between encoder and\ndecoder, while also using relative action units (AUs) several times. Extensive\nqualitative and quantitative experiments have demonstrated that our model\nperforms better in preserving identity features, editing capability, and image\ngeneration quality on the AffectNet dataset. It also shows superior performance\nin metrics such as Average Content Distance (ACD) and Expression Distance (ED).", "paper_summary_zh": "人臉表情操縱旨在改變人類人臉表情，同時不影響人臉辨識。為了將人臉表情轉換為目標表情，先前的做法依賴表情標籤來引導操縱過程。然而，這些方法無法保留人臉特徵的細節，這會導致輸出影像中身分資訊減弱或遺失。在我們的研究中，我們提出了 WEM-GAN，簡稱小波表情操縱 GAN，它在編輯過程中投入更多心力來保留原始影像的細節。首先，我們利用小波轉換技術，並將其與我們的生成器結合使用 U-net 自動編碼器主幹，以提升生成器保留更多人臉特徵細節的能力。其次，我們也實作了高頻分量判別器，並使用高頻域對抗損失進一步約束模型的最佳化，讓生成的臉部影像擁有更豐富的細節。此外，為了縮小生成的臉部表情與目標表情之間的差距，我們在編碼器和解碼器之間使用殘差連接，同時也多次使用相對動作單元 (AU)。廣泛的定性和定量實驗已證明，我們的模型在保留身分特徵、編輯能力和 AffectNet 資料集上的影像生成品質方面表現得更好。它在平均內容距離 (ACD) 和表情距離 (ED) 等指標上也展現出優異的表現。", "author": "Dongya Sun et.al.", "authors": "Dongya Sun, Yunfei Hu, Xianzhe Zhang, Yingsong Hu", "id": "2412.02530v1", "paper_url": "http://arxiv.org/abs/2412.02530v1", "repo": "null"}}