{"2409.00718": {"publish_time": "2024-09-01", "title": "Multiscale Color Guided Attention Ensemble Classifier for Age-Related Macular Degeneration using Concurrent Fundus and Optical Coherence Tomography Images", "paper_summary": "Automatic diagnosis techniques have evolved to identify age-related macular\ndegeneration (AMD) by employing single modality Fundus images or optical\ncoherence tomography (OCT). To classify ocular diseases, fundus and OCT images\nare the most crucial imaging modalities used in the clinical setting. Most deep\nlearning-based techniques are established on a single imaging modality, which\ncontemplates the ocular disorders to a specific extent and disregards other\nmodality that comprises exhaustive information among distinct imaging\nmodalities. This paper proposes a modality-specific multiscale color space\nembedding integrated with the attention mechanism based on transfer learning\nfor classification (MCGAEc), which can efficiently extract the distinct\nmodality information at various scales using the distinct color spaces. In this\nwork, we first introduce the modality-specific multiscale color space encoder\nmodel, which includes diverse feature representations by integrating distinct\ncharacteristic color spaces on a multiscale into a unified framework. The\nextracted features from the prior encoder module are incorporated with the\nattention mechanism to extract the global features representation, which is\nintegrated with the prior extracted features and transferred to the random\nforest classifier for the classification of AMD. To analyze the performance of\nthe proposed MCGAEc method, a publicly available multi-modality dataset from\nProject Macula for AMD is utilized and compared with the existing models.", "paper_summary_zh": "自動診斷技術已演進到能透過使用單一模式眼底影像或光學相干斷層掃描 (OCT) 來辨識年齡相關性黃斑部病變 (AMD)。為了分類眼疾，眼底和 OCT 影像是臨床環境中使用最關鍵的影像模式。大多數基於深度學習的技術建立在單一影像模式上，它在一定程度上考量了眼疾，卻忽略了其他模式，而其他模式包含了不同影像模式之間的詳盡資訊。本文提出了一種模式特定的多尺度色彩空間嵌入整合，並基於用於分類的轉移學習的注意力機制 (MCGAEc)，它能使用不同的色彩空間在不同的尺度上有效提取不同的模式資訊。在這項工作中，我們首先介紹了模式特定的多尺度色彩空間編碼器模型，它透過將不同的特徵色彩空間整合到多尺度中，來納入不同的特徵表徵到一個統一的架構中。從先前的編碼器模組中提取的特徵與注意力機制結合，以提取全域特徵表徵，它與先前提取的特徵整合，並轉移到隨機森林分類器，以進行 AMD 分類。為了分析所提出的 MCGAEc 方法的效能，我們利用了來自 Project Macula for AMD 的公開多模式資料集，並與現有模型進行比較。", "author": "Pragya Gupta et.al.", "authors": "Pragya Gupta, Subhamoy Mandal, Debashree Guha, Debjani Chakraborty", "id": "2409.00718v1", "paper_url": "http://arxiv.org/abs/2409.00718v1", "repo": "null"}}