{"2411.04562": {"publish_time": "2024-11-07", "title": "Constrained Latent Action Policies for Model-Based Offline Reinforcement Learning", "paper_summary": "In offline reinforcement learning, a policy is learned using a static dataset\nin the absence of costly feedback from the environment. In contrast to the\nonline setting, only using static datasets poses additional challenges, such as\npolicies generating out-of-distribution samples. Model-based offline\nreinforcement learning methods try to overcome these by learning a model of the\nunderlying dynamics of the environment and using it to guide policy search. It\nis beneficial but, with limited datasets, errors in the model and the issue of\nvalue overestimation among out-of-distribution states can worsen performance.\nCurrent model-based methods apply some notion of conservatism to the Bellman\nupdate, often implemented using uncertainty estimation derived from model\nensembles. In this paper, we propose Constrained Latent Action Policies (C-LAP)\nwhich learns a generative model of the joint distribution of observations and\nactions. We cast policy learning as a constrained objective to always stay\nwithin the support of the latent action distribution, and use the generative\ncapabilities of the model to impose an implicit constraint on the generated\nactions. Thereby eliminating the need to use additional uncertainty penalties\non the Bellman update and significantly decreasing the number of gradient steps\nrequired to learn a policy. We empirically evaluate C-LAP on the D4RL and\nV-D4RL benchmark, and show that C-LAP is competitive to state-of-the-art\nmethods, especially outperforming on datasets with visual observations.", "paper_summary_zh": "在離線強化學習中，會使用靜態資料集來學習政策，而不會從環境中獲得昂貴的回饋。與線上設定相反，僅使用靜態資料集會產生額外的挑戰，例如政策產生出分佈外的範例。基於模型的離線強化學習方法會嘗試透過學習環境基礎動態的模型並使用該模型來引導政策搜尋來克服這些挑戰。這是有益的，但對於有限的資料集，模型中的錯誤和出分佈狀態的價值高估問題會惡化效能。目前的基於模型的方法會對貝爾曼更新套用一些保守概念，通常會使用從模型整體中衍生的不確定性估計來實作。在本文中，我們提出受約束潛在動作政策 (C-LAP)，它會學習觀測值和動作的聯合分佈的生成模型。我們將政策學習設定為受約束目標，以始終保持在潛在動作分佈的支援範圍內，並使用模型的生成能力對產生的動作施加隱式約束。從而消除了對貝爾曼更新使用額外不確定性懲罰的需求，並大幅減少學習政策所需的梯度步驟數。我們在 D4RL 和 V-D4RL 基準上對 C-LAP 進行經驗評估，並顯示 C-LAP 可與最先進的方法競爭，特別是在具有視覺觀測值的資料集上表現出色。", "author": "Marvin Alles et.al.", "authors": "Marvin Alles, Philip Becker-Ehmck, Patrick van der Smagt, Maximilian Karl", "id": "2411.04562v1", "paper_url": "http://arxiv.org/abs/2411.04562v1", "repo": "null"}}