{"2410.02430": {"publish_time": "2024-10-03", "title": "Predictive Attractor Models", "paper_summary": "Sequential memory, the ability to form and accurately recall a sequence of\nevents or stimuli in the correct order, is a fundamental prerequisite for\nbiological and artificial intelligence as it underpins numerous cognitive\nfunctions (e.g., language comprehension, planning, episodic memory formation,\netc.) However, existing methods of sequential memory suffer from catastrophic\nforgetting, limited capacity, slow iterative learning procedures, low-order\nMarkov memory, and, most importantly, the inability to represent and generate\nmultiple valid future possibilities stemming from the same context. Inspired by\nbiologically plausible neuroscience theories of cognition, we propose\n\\textit{Predictive Attractor Models (PAM)}, a novel sequence memory\narchitecture with desirable generative properties. PAM is a streaming model\nthat learns a sequence in an online, continuous manner by observing each input\n\\textit{only once}. Additionally, we find that PAM avoids catastrophic\nforgetting by uniquely representing past context through lateral inhibition in\ncortical minicolumns, which prevents new memories from overwriting previously\nlearned knowledge. PAM generates future predictions by sampling from a union\nset of predicted possibilities; this generative ability is realized through an\nattractor model trained alongside the predictor. We show that PAM is trained\nwith local computations through Hebbian plasticity rules in a biologically\nplausible framework. Other desirable traits (e.g., noise tolerance, CPU-based\nlearning, capacity scaling) are discussed throughout the paper. Our findings\nsuggest that PAM represents a significant step forward in the pursuit of\nbiologically plausible and computationally efficient sequential memory models,\nwith broad implications for cognitive science and artificial intelligence\nresearch.", "paper_summary_zh": "序列記憶，即形成並準確回憶事件或刺激序列的正確順序的能力，是生物和人工智能的基本先決條件，因為它支撐了許多認知功能（例如，語言理解、規劃、情節記憶形成等）。然而，現有的序列記憶方法存在災難性遺忘、容量有限、緩慢的迭代學習程序、低階馬可夫記憶，最重要的是，無法表示和生成源自同一背景的未來多種有效可能性。受生物學上合理的認知神經科學理論啟發，我們提出了預測吸引子模型 (PAM)，一種具有理想生成特性的新序列記憶架構。PAM 是一個串流模型，它通過以線上、連續的方式觀察每個輸入來學習序列，而且僅觀察「一次」。此外，我們發現 PAM 透過皮質微柱中的側向抑制來唯一表示過去的背景，從而避免了災難性遺忘，這可以防止新的記憶覆蓋先前學習的知識。PAM 透過從預測可能性的聯集進行抽樣來生成未來的預測；這種生成能力是透過與預測器一起訓練的吸引子模型來實現的。我們展示了 PAM 是透過生物學上合理的框架中的赫布塑性規則，以局部運算進行訓練的。在本文中討論了其他理想的特質（例如，耐噪性、基於 CPU 的學習、容量擴充）。我們的研究結果表明，PAM 在追求生物學上合理且計算效率高的序列記憶模型方面邁出了一大步，對認知科學和人工智能研究具有廣泛的影響。", "author": "Ramy Mounir et.al.", "authors": "Ramy Mounir, Sudeep Sarkar", "id": "2410.02430v1", "paper_url": "http://arxiv.org/abs/2410.02430v1", "repo": "null"}}