{"2407.20119": {"publish_time": "2024-07-29", "title": "Adaptive Self-supervised Robust Clustering for Unstructured Data with Unknown Cluster Number", "paper_summary": "We introduce a novel self-supervised deep clustering approach tailored for\nunstructured data without requiring prior knowledge of the number of clusters,\ntermed Adaptive Self-supervised Robust Clustering (ASRC). In particular, ASRC\nadaptively learns the graph structure and edge weights to capture both local\nand global structural information. The obtained graph enables us to learn\nclustering-friendly feature representations by an enhanced graph auto-encoder\nwith contrastive learning technique. It further leverages the clustering\nresults adaptively obtained by robust continuous clustering (RCC) to generate\nprototypes for negative sampling, which can further contribute to promoting\nconsistency among positive pairs and enlarging the gap between positive and\nnegative samples. ASRC obtains the final clustering results by applying RCC to\nthe learned feature representations with their consistent graph structure and\nedge weights. Extensive experiments conducted on seven benchmark datasets\ndemonstrate the efficacy of ASRC, demonstrating its superior performance over\nother popular clustering models. Notably, ASRC even outperforms methods that\nrely on prior knowledge of the number of clusters, highlighting its\neffectiveness in addressing the challenges of clustering unstructured data.", "paper_summary_zh": "我們提出了一種新穎的自監督深度聚類方法，專門針對非結構化資料，無需事先了解群集數量，稱為自適應自監督穩健聚類 (ASRC)。具體來說，ASRC 自適應地學習圖形結構和邊緣權重，以擷取局部和全局結構資訊。所獲得的圖形使我們能夠透過增強的圖形自動編碼器與對比學習技術，學習對聚類友善的特徵表示。它進一步利用穩健連續聚類 (RCC) 自適應獲得的聚類結果，為負面抽樣產生原型，這可以進一步促進正對之間的一致性，並擴大正負樣本之間的差距。ASRC 將 RCC 套用於學習的特徵表示及其一致的圖形結構和邊緣權重，以獲得最終的聚類結果。在七個基準資料集上進行的廣泛實驗證明了 ASRC 的功效，證明了它優於其他流行的聚類模型。值得注意的是，ASRC 甚至優於依賴於群集數量先驗知識的方法，突顯了它在解決非結構化資料聚類挑戰方面的有效性。", "author": "Chen-Lu Ding et.al.", "authors": "Chen-Lu Ding, Jiancan Wu, Wei Lin, Shiyang Shen, Xiang Wang, Yancheng Yuan", "id": "2407.20119v2", "paper_url": "http://arxiv.org/abs/2407.20119v2", "repo": "null"}}