{"2503.06866": {"publish_time": "2025-03-10", "title": "Graphormer-Guided Task Planning: Beyond Static Rules with LLM Safety Perception", "paper_summary": "Recent advancements in large language models (LLMs) have expanded their role\nin robotic task planning. However, while LLMs have been explored for generating\nfeasible task sequences, their ability to ensure safe task execution remains\nunderdeveloped. Existing methods struggle with structured risk perception,\nmaking them inadequate for safety-critical applications where low-latency\nhazard adaptation is required. To address this limitation, we propose a\nGraphormer-enhanced risk-aware task planning framework that combines LLM-based\ndecision-making with structured safety modeling. Our approach constructs a\ndynamic spatio-semantic safety graph, capturing spatial and contextual risk\nfactors to enable online hazard detection and adaptive task refinement. Unlike\nexisting methods that rely on predefined safety constraints, our framework\nintroduces a context-aware risk perception module that continuously refines\nsafety predictions based on real-time task execution. This enables a more\nflexible and scalable approach to robotic planning, allowing for adaptive\nsafety compliance beyond static rules. To validate our framework, we conduct\nexperiments in the AI2-THOR environment. The experiments results validates\nimprovements in risk detection accuracy, rising safety notice, and task\nadaptability of our framework in continuous environments compared to static\nrule-based and LLM-only baselines. Our project is available at\nhttps://github.com/hwj20/GGTP", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 的最新進展擴展了它們在機器人任務規劃中的作用。然而，雖然已探索將 LLM 用於生成可行的任務序列，但它們確保安全任務執行的能力仍未充分發展。現有方法難以進行結構化的風險感知，這使得它們不足以應對需要低延遲危險適應的安全關鍵型應用。為了克服這個限制，我們提出了一個由 Graphormer 增強的風險感知任務規劃框架，它結合了基於 LLM 的決策和結構化安全建模。我們的方法構建了一個動態的時空語義安全圖，捕捉空間和上下文風險因素，以實現線上危險檢測和自適應任務優化。與依賴預定義安全約束的現有方法不同，我們的框架引入了一個上下文感知風險感知模組，它根據即時任務執行情況持續優化安全預測。這實現了一種更靈活、更具擴展性的機器人規劃方法，允許超越靜態規則的自適應安全合規性。為了驗證我們的框架，我們在 AI2-THOR 環境中進行了實驗。實驗結果驗證了與基於靜態規則和僅使用 LLM 的基準相比，我們的框架在連續環境中風險檢測準確性、安全注意事項和任務適應性的提高。我們的專案可在 https://github.com/hwj20/GGTP 找到。</paragraph>\n", "author": "Wanjing Huang et.al.", "authors": "Wanjing Huang, Tongjie Pan, Yalan Ye", "id": "2503.06866v1", "paper_url": "http://arxiv.org/abs/2503.06866v1", "repo": "null"}}