{"2412.12609": {"publish_time": "2024-12-17", "title": "MultiLingPoT: Enhancing Mathematical Reasoning with Multilingual Program Fine-tuning", "paper_summary": "Program-of-Thought (PoT), which aims to use programming language instead of\nnatural language as an intermediate step in reasoning, is an important way for\nLLMs to solve mathematical problems. Since different programming languages\nexcel in different areas, it is natural to use the most suitable language for\nsolving specific problems. However, current PoT research only focuses on single\nlanguage PoT, ignoring the differences between different programming languages.\nTherefore, this paper proposes an multilingual program reasoning method,\nMultiLingPoT. This method allows the model to answer questions using multiple\nprogramming languages by fine-tuning on multilingual data. Additionally, prior\nand posterior hybrid methods are used to help the model select the most\nsuitable language for each problem. Our experimental results show that the\ntraining of MultiLingPoT improves each program's mathematical reasoning by\nabout 2.5\\%. Moreover, with proper mixing, the performance of MultiLingPoT can\nbe further improved, achieving a 6\\% increase compared to the single-language\nPoT with the data augmentation.Resources of this paper can be found at\nhttps://github.com/Nianqi-Li/MultiLingPoT.", "paper_summary_zh": "思想程式（PoT）旨在使用程式語言而非自然語言作為推理的步驟，是 LLM 解決數學問題的重要方式。由於不同的程式語言擅長不同的領域，因此使用最適合的語言來解決特定問題是理所當然的。然而，目前的 PoT 研究僅專注於單一語言 PoT，而忽略了不同程式語言之間的差異。因此，本文提出了一種多語言程式推理方法 MultiLingPoT。此方法允許模型透過對多語言資料進行微調，使用多種程式語言來回答問題。此外，使用先驗和後驗混合方法來幫助模型為每個問題選擇最合適的語言。我們的實驗結果表明，MultiLingPoT 的訓練將每個程式的數學推理能力提高了約 2.5%。此外，透過適當的混合，MultiLingPoT 的效能可以進一步提高，與使用資料擴充的單一語言 PoT 相比，提高了 6%。本文的資源可以在 https://github.com/Nianqi-Li/MultiLingPoT 找到。", "author": "Nianqi Li et.al.", "authors": "Nianqi Li, Zujie Liang, Siyu Yuan, Jiaqing Liang, Feng Wei, Yanghua Xiao", "id": "2412.12609v1", "paper_url": "http://arxiv.org/abs/2412.12609v1", "repo": "https://github.com/nianqi-li/multilingpot"}}