{"2407.19835": {"publish_time": "2024-07-29", "title": "ATHAR: A High-Quality and Diverse Dataset for Classical Arabic to English Translation", "paper_summary": "Classical Arabic represents a significant era, encompassing the golden age of\nArab culture, philosophy, and scientific literature. With a broad consensus on\nthe importance of translating these literatures to enrich knowledge\ndissemination across communities, the advent of large language models (LLMs)\nand translation systems offers promising tools to facilitate this goal.\nHowever, we have identified a scarcity of translation datasets in Classical\nArabic, which are often limited in scope and topics, hindering the development\nof high-quality translation systems. In response, we present the ATHAR dataset,\ncomprising 66,000 high-quality Classical Arabic to English translation samples\nthat cover a wide array of subjects including science, culture, and philosophy.\nFurthermore, we assess the performance of current state-of-the-art LLMs under\nvarious settings, concluding that there is a need for such datasets in current\nsystems. Our findings highlight how models can benefit from fine-tuning or\nincorporating this dataset into their pretraining pipelines. The dataset is\npublicly available on the HuggingFace Data Hub at\n\\url{https://huggingface.co/datasets/mohamed-khalil/ATHAR}.", "paper_summary_zh": "古典阿拉伯語代表一個重要的時代，涵蓋了阿拉伯文化、哲學和科學文學的黃金時代。對於將這些文學翻譯成豐富知識在各個社群中傳播的重要性，大家達成廣泛共識，大型語言模型（LLM）和翻譯系統的出現提供了有希望的工具，以促進這個目標。\n然而，我們發現古典阿拉伯語的翻譯資料集很稀少，它們的範圍和主題通常有限，這阻礙了高品質翻譯系統的發展。為了解決這個問題，我們提出了 ATHAR 資料集，其中包含 66,000 個高品質的古典阿拉伯語到英語翻譯範例，涵蓋了包括科學、文化和哲學在內的廣泛主題。\n此外，我們評估了目前最先進的 LLM 在各種設定下的效能，並得出結論，目前的系統需要這樣的資料集。我們的發現重點說明了模型如何從微調中受益，或將此資料集納入其預訓練管道。此資料集在 HuggingFace 資料集中心公開提供，網址為\\url{https://huggingface.co/datasets/mohamed-khalil/ATHAR}。", "author": "Mohammed Khalil et.al.", "authors": "Mohammed Khalil, Mohammed Sabry", "id": "2407.19835v1", "paper_url": "http://arxiv.org/abs/2407.19835v1", "repo": "null"}}