{"2406.19755": {"publish_time": "2024-06-28", "title": "Protein Representation Learning with Sequence Information Embedding: Does it Always Lead to a Better Performance?", "paper_summary": "Deep learning has become a crucial tool in studying proteins. While the\nsignificance of modeling protein structure has been discussed extensively in\nthe literature, amino acid types are typically included in the input as a\ndefault operation for many inference tasks. This study demonstrates with\nstructure alignment task that embedding amino acid types in some cases may not\nhelp a deep learning model learn better representation. To this end, we propose\nProtLOCA, a local geometry alignment method based solely on amino acid\nstructure representation. The effectiveness of ProtLOCA is examined by a global\nstructure-matching task on protein pairs with an independent test dataset based\non CATH labels. Our method outperforms existing sequence- and structure-based\nrepresentation learning methods by more quickly and accurately matching\nstructurally consistent protein domains. Furthermore, in local structure\npairing tasks, ProtLOCA for the first time provides a valid solution to\nhighlight common local structures among proteins with different overall\nstructures but the same function. This suggests a new possibility for using\ndeep learning methods to analyze protein structure to infer function.", "paper_summary_zh": "深度学习已成为研究蛋白质的关键工具。虽然在文献中已广泛讨论了蛋白质结构建模的重要性，但氨基酸类型通常作为许多推理任务的默认操作包含在输入中。本研究通过结构比对任务证明，在某些情况下，嵌入氨基酸类型可能无助于深度学习模型学习更好的表示。为此，我们提出了 ProtLOCA，这是一种仅基于氨基酸结构表示的局部几何比对方法。ProtLOCA 的有效性通过基于 CATH 标签的独立测试数据集对蛋白质对进行全局结构匹配任务来检验。我们的方法通过更快速、更准确地匹配结构一致的蛋白质结构域，优于现有的基于序列和结构的表示学习方法。此外，在局部结构配对任务中，ProtLOCA 首次提供了一个有效的解决方案，用于突出具有不同整体结构但相同功能的蛋白质之间的共同局部结构。这为使用深度学习方法分析蛋白质结构以推断功能提出了新的可能性。", "author": "Yang Tan et.al.", "authors": "Yang Tan, Lirong Zheng, Bozitao Zhong, Liang Hong, Bingxin Zhou", "id": "2406.19755v1", "paper_url": "http://arxiv.org/abs/2406.19755v1", "repo": "null"}}