{"2408.06816": {"publish_time": "2024-08-13", "title": "MAQA: Evaluating Uncertainty Quantification in LLMs Regarding Data Uncertainty", "paper_summary": "Although large language models (LLMs) are capable of performing various\ntasks, they still suffer from producing plausible but incorrect responses. To\nimprove the reliability of LLMs, recent research has focused on uncertainty\nquantification to predict whether a response is correct or not. However, most\nuncertainty quantification methods have been evaluated on questions requiring a\nsingle clear answer, ignoring the existence of data uncertainty that arises\nfrom irreducible randomness. Instead, these methods only consider model\nuncertainty, which arises from a lack of knowledge. In this paper, we\ninvestigate previous uncertainty quantification methods under the presence of\ndata uncertainty. Our contributions are two-fold: 1) proposing a new\nMulti-Answer Question Answering dataset, MAQA, consisting of world knowledge,\nmathematical reasoning, and commonsense reasoning tasks to evaluate uncertainty\nquantification regarding data uncertainty, and 2) assessing 5 uncertainty\nquantification methods of diverse white- and black-box LLMs. Our findings show\nthat entropy and consistency-based methods estimate the model uncertainty well\neven under data uncertainty, while other methods for white- and black-box LLMs\nstruggle depending on the tasks. Additionally, methods designed for white-box\nLLMs suffer from overconfidence in reasoning tasks compared to simple knowledge\nqueries. We believe our observations will pave the way for future work on\nuncertainty quantification in realistic setting.", "paper_summary_zh": "儘管大型語言模型 (LLM) 能執行各種任務，但它們仍會產生看似合理但錯誤的回應。為了提升 LLM 的可靠性，最近的研究著重於不確定性量化，以預測回應是否正確。然而，大多數不確定性量化方法都是針對需要單一明確答案的問題進行評估，而忽略了由不可還原的隨機性所產生的資料不確定性。相反地，這些方法只考量模型不確定性，而這源自於知識的缺乏。在本文中，我們探討了在資料不確定性存在的情況下，先前的各種不確定性量化方法。我們的貢獻有兩個面向：1) 提出一個新的多答案問答資料集 MAQA，其中包含世界知識、數學推理和常識推理任務，以評估關於資料不確定性的不確定性量化，以及 2) 評估 5 種不同白盒和黑盒 LLM 的不確定性量化方法。我們的研究結果顯示，即使在資料不確定性的情況下，熵和基於一致性的方法也能很好地估計模型不確定性，而其他針對白盒和黑盒 LLM 的方法則會根據任務而有所不同。此外，與簡單的知識查詢相比，專為白盒 LLM 設計的方法在推理任務中會過於自信。我們相信我們的觀察將為在現實環境中進行不確定性量化奠定基礎。", "author": "Yongjin Yang et.al.", "authors": "Yongjin Yang, Haneul Yoo, Hwaran Lee", "id": "2408.06816v1", "paper_url": "http://arxiv.org/abs/2408.06816v1", "repo": "null"}}