{"2406.17740": {"publish_time": "2024-06-25", "title": "Structured Unrestricted-Rank Matrices for Parameter Efficient Fine-tuning", "paper_summary": "Recent efforts to scale Transformer models have demonstrated rapid progress\nacross a wide range of tasks (Wei et al., 2022). However, fine-tuning these\nmodels for downstream tasks is expensive due to their large parameter counts.\nParameter-efficient fine-tuning (PEFT) approaches have emerged as a viable\nalternative by allowing us to fine-tune models by updating only a small number\nof parameters. In this work, we propose a general framework for parameter\nefficient fine-tuning (PEFT), based on structured unrestricted-rank matrices\n(SURM) which can serve as a drop-in replacement for popular approaches such as\nAdapters and LoRA. Unlike other methods like LoRA, SURMs provides more\nflexibility in finding the right balance between compactness and\nexpressiveness. This is achieved by using low displacement rank matrices\n(LDRMs), which hasn't been used in this context before. SURMs remain\ncompetitive with baselines, often providing significant quality improvements\nwhile using a smaller parameter budget. SURMs achieve 5-7% accuracy gains on\nvarious image classification tasks while replacing low-rank matrices in LoRA.\nIt also results in up to 12x reduction of the number of parameters in adapters\n(with virtually no loss in quality) on the GLUE benchmark.", "paper_summary_zh": "最近对 Transformer 模型进行扩展的尝试展示了各种任务的快速进展（Wei 等人，2022 年）。然而，由于这些模型的参数数量庞大，因此为下游任务进行微调非常昂贵。参数高效微调 (PEFT) 方法已经成为一种可行的替代方案，它允许我们仅通过更新少量参数来微调模型。在这项工作中，我们提出了一个基于结构化无限制秩矩阵 (SURM) 的参数高效微调 (PEFT) 的通用框架，该框架可以作为流行方法（例如适配器和 LoRA）的替代方案。与 LoRA 等其他方法不同，SURM 在寻找紧凑性和表现力之间的适当平衡方面提供了更大的灵活性。这是通过使用低置换秩矩阵 (LDRM) 实现的，这在以前从未在该上下文中使用过。SURM 仍然具有与基线相当的竞争力，通常在使用较小参数预算的同时提供显著的质量改进。SURM 在各种图像分类任务中实现了 5-7% 的准确度提升，同时替换了 LoRA 中的低秩矩阵。在 GLUE 基准测试中，它还导致适配器中参数数量减少了 12 倍（几乎没有质量损失）。", "author": "Arijit Sehanobish et.al.", "authors": "Arijit Sehanobish, Avinava Dubey, Krzysztof Choromanski, Somnath Basu Roy Chowdhury, Deepali Jain, Vikas Sindhwani, Snigdha Chaturvedi", "id": "2406.17740v1", "paper_url": "http://arxiv.org/abs/2406.17740v1", "repo": "null"}}