{"2502.01922": {"publish_time": "2025-02-04", "title": "LAST SToP For Modeling Asynchronous Time Series", "paper_summary": "We present a novel prompt design for Large Language Models (LLMs) tailored to\nAsynchronous Time Series. Unlike regular time series, which assume values at\nevenly spaced time points, asynchronous time series consist of timestamped\nevents occurring at irregular intervals, each described in natural language.\nOur approach effectively utilizes the rich natural language of event\ndescriptions, allowing LLMs to benefit from their broad world knowledge for\nreasoning across different domains and tasks. This allows us to extend the\nscope of asynchronous time series analysis beyond forecasting to include tasks\nlike anomaly detection and data imputation. We further introduce Stochastic\nSoft Prompting, a novel prompt-tuning mechanism that significantly improves\nmodel performance, outperforming existing fine-tuning methods such as QLoRA.\nThrough extensive experiments on real world datasets, we demonstrate that our\napproach achieves state-of-the-art performance across different tasks and\ndatasets.", "paper_summary_zh": "我們提出針對大型語言模型 (LLM) 的新提示設計，專門用於非同步時間序列。與假設值在均勻間隔時間點的常規時間序列不同，非同步時間序列包含以不規則間隔發生的時間戳事件，每個事件都以自然語言描述。我們的做法有效利用了事件描述的豐富自然語言，讓 LLM 能夠受益於其廣泛的世界知識，以跨不同領域和任務進行推理。這使我們能夠將非同步時間序列分析的範圍擴展到預測之外，包括異常檢測和數據插補等任務。我們進一步引入了隨機軟提示，這是一種新穎的提示調整機制，可顯著提升模型效能，優於現有的微調方法，例如 QLoRA。透過對真實世界資料集的廣泛實驗，我們證明了我們的做法在不同的任務和資料集上都達到了最先進的效能。", "author": "Shubham Gupta et.al.", "authors": "Shubham Gupta, Thibaut Durand, Graham Taylor, Lilian W. Białokozowicz", "id": "2502.01922v1", "paper_url": "http://arxiv.org/abs/2502.01922v1", "repo": "null"}}