{"2502.06842": {"publish_time": "2025-02-06", "title": "Integrating Generative Artificial Intelligence in ADRD: A Framework for Streamlining Diagnosis and Care in Neurodegenerative Diseases", "paper_summary": "Healthcare systems are struggling to meet the growing demand for neurological\ncare, with challenges particularly acute in Alzheimer's disease and related\ndementias (ADRD). While artificial intelligence research has often focused on\nidentifying patterns beyond human perception, implementing such predictive\ncapabilities remains challenging as clinicians cannot readily verify insights\nthey cannot themselves detect. We propose that large language models (LLMs)\noffer more immediately practical applications by enhancing clinicians'\ncapabilities in three critical areas: comprehensive data collection,\ninterpretation of complex clinical information, and timely application of\nrelevant medical knowledge. These challenges stem from limited time for proper\ndiagnosis, growing data complexity, and an overwhelming volume of medical\nliterature that exceeds any clinician's capacity to fully master. We present a\nframework for responsible AI integration that leverages LLMs' ability to\ncommunicate effectively with both patients and providers while maintaining\nhuman oversight. This approach prioritizes standardized, high-quality data\ncollection to enable a system that learns from every patient encounter while\nincorporating the latest clinical evidence, continuously improving care\ndelivery. We begin to address implementation challenges and initiate important\ndiscussions around ethical considerations and governance needs. While developed\nfor ADRD, this roadmap provides principles for responsible AI integration\nacross neurology and other medical specialties, with potential to improve\ndiagnostic accuracy, reduce care disparities, and advance clinical knowledge\nthrough a learning healthcare system.", "paper_summary_zh": "醫療體系正努力滿足日益增長的神經照護需求，其中阿茲海默症和相關失智症 (ADRD) 的挑戰特別嚴重。雖然人工智慧研究通常專注於識別人類感知之外的模式，但實作此類預測功能仍然具有挑戰性，因為臨床醫生無法輕易驗證他們自己無法偵測到的見解。我們提出大型語言模型 (LLM) 可透過提升臨床醫生在三個關鍵領域的能力，提供更直接且實用的應用：全面的資料收集、複雜臨床資訊的詮釋，以及適時應用相關的醫學知識。這些挑戰源自於適當診斷時間有限、資料複雜性日益增加，以及龐大的醫學文獻量超過任何臨床醫生所能完全掌握的容量。我們提出了一個負責任的 AI 整合架構，利用 LLM 與患者和提供者有效溝通的能力，同時維持人為監督。此方法優先考慮標準化、高品質的資料收集，以建立一個從每次患者接觸中學習的系統，同時納入最新的臨床證據，持續改善照護提供。我們開始探討實作挑戰，並展開關於倫理考量和治理需求的重要討論。儘管是為 ADRD 所開發，此藍圖提供了神經科和其他醫學專科負責任 AI 整合的原則，有潛力透過學習型醫療保健系統改善診斷準確性、減少照護差異，並推進臨床知識。", "author": "Andrew G. Breithaupt et.al.", "authors": "Andrew G. Breithaupt, Alice Tang, Bruce L. Miller, Pedro Pinheiro-Chagas", "id": "2502.06842v1", "paper_url": "http://arxiv.org/abs/2502.06842v1", "repo": "null"}}