{"2406.08903": {"publish_time": "2024-06-13", "title": "Delta-CoMe: Training-Free Delta-Compression with Mixed-Precision for Large Language Models", "paper_summary": "Fine-tuning is a crucial process for adapting large language models (LLMs) to\ndiverse applications. In certain scenarios, such as multi-tenant serving,\ndeploying multiple LLMs becomes necessary to meet complex demands. Recent\nstudies suggest decomposing a fine-tuned LLM into a base model and\ncorresponding delta weights, which are then compressed using low-rank or\nlow-bit approaches to reduce costs. In this work, we observe that existing\nlow-rank and low-bit compression methods can significantly harm the model\nperformance for task-specific fine-tuned LLMs (e.g., WizardMath for math\nproblems). Motivated by the long-tail distribution of singular values in the\ndelta weights, we propose a delta quantization approach using mixed-precision.\nThis method employs higher-bit representation for singular vectors\ncorresponding to larger singular values. We evaluate our approach on various\nfine-tuned LLMs, including math LLMs, code LLMs, chat LLMs, and even VLMs.\nExperimental results demonstrate that our approach performs comparably to full\nfine-tuned LLMs, surpassing both low-rank and low-bit baselines by a\nconsiderable margin. Additionally, we show that our method is compatible with\nvarious backbone LLMs, such as Llama-2, Llama-3, and Mistral, highlighting its\ngeneralizability.", "paper_summary_zh": "微調是將大型語言模型 (LLM) 適應於各種應用程式的重要過程。在某些情況下，例如多租戶服務，部署多個 LLM 以滿足複雜的需求變得有必要。最近的研究表明將微調的 LLM 分解成基礎模型和對應的 delta 權重，然後使用低秩或低位元方法壓縮它們以降低成本。在這項工作中，我們觀察到現有的低秩和低位元壓縮方法可能會嚴重損害任務特定的微調 LLM（例如，用於數學問題的 WizardMath）的模型效能。受到 delta 權重中奇異值長尾分佈的啟發，我們提出了一種使用混合精度的 delta 量化方法。此方法採用對應於較大奇異值的奇異向量的較高位元表示。我們在各種微調的 LLM 上評估我們的作法，包括數學 LLM、程式碼 LLM、聊天 LLM，甚至是 VLM。實驗結果表明，我們的作法執行起來可與完整的微調 LLM 相媲美，在相當大的幅度上超越了低秩和低位元的基準。此外，我們展示了我們的作法與各種主幹 LLM 相容，例如 Llama-2、Llama-3 和 Mistral，突顯了它的通用性。", "author": "Bowen Ping et.al.", "authors": "Bowen Ping, Shuo Wang, Hanqing Wang, Xu Han, Yuzhuang Xu, Yukun Yan, Yun Chen, Baobao Chang, Zhiyuan Liu, Maosong Sun", "id": "2406.08903v1", "paper_url": "http://arxiv.org/abs/2406.08903v1", "repo": "null"}}