{"2411.07007": {"publish_time": "2024-11-11", "title": "Non-Adversarial Inverse Reinforcement Learning via Successor Feature Matching", "paper_summary": "In inverse reinforcement learning (IRL), an agent seeks to replicate expert\ndemonstrations through interactions with the environment. Traditionally, IRL is\ntreated as an adversarial game, where an adversary searches over reward models,\nand a learner optimizes the reward through repeated RL procedures. This\ngame-solving approach is both computationally expensive and difficult to\nstabilize. In this work, we propose a novel approach to IRL by direct policy\noptimization: exploiting a linear factorization of the return as the inner\nproduct of successor features and a reward vector, we design an IRL algorithm\nby policy gradient descent on the gap between the learner and expert features.\nOur non-adversarial method does not require learning a reward function and can\nbe solved seamlessly with existing actor-critic RL algorithms. Remarkably, our\napproach works in state-only settings without expert action labels, a setting\nwhich behavior cloning (BC) cannot solve. Empirical results demonstrate that\nour method learns from as few as a single expert demonstration and achieves\nimproved performance on various control tasks.", "paper_summary_zh": "在逆向強化學習 (IRL) 中，代理會透過與環境互動來複製專家示範。傳統上，IRL 被視為對抗性遊戲，對手會搜尋獎勵模型，而學習者會透過重複的 RL 程序最佳化獎勵。這種遊戲解法既耗費運算資源，又難以穩定。在這項工作中，我們提出了一種透過直接政策最佳化來進行 IRL 的新方法：利用回報的線性分解作為後繼特徵和獎勵向量的內積，我們透過學習者和專家特徵之間的差距來設計一種 IRL 演算法，並透過策略梯度下降法進行。我們的非對抗方法不需要學習獎勵函數，並且可以與現有的動作-評論 RL 演算法無縫解決。值得注意的是，我們的做法可以在沒有專家動作標籤的僅狀態設定中運作，這是行為複製 (BC) 無法解決的設定。實證結果顯示，我們的做法可以從少至一個專家示範中學習，並在各種控制任務中獲得更好的效能。", "author": "Arnav Kumar Jain et.al.", "authors": "Arnav Kumar Jain, Harley Wiltzer, Jesse Farebrother, Irina Rish, Glen Berseth, Sanjiban Choudhury", "id": "2411.07007v1", "paper_url": "http://arxiv.org/abs/2411.07007v1", "repo": "https://github.com/arnavkj1995/sfm"}}