{"2405.06459": {"publish_time": "2024-05-10", "title": "Are EEG-to-Text Models Working?", "paper_summary": "This work critically analyzes existing models for open-vocabulary EEG-to-Text\ntranslation. We identify a crucial limitation: previous studies often employed\nimplicit teacher-forcing during evaluation, artificially inflating performance\nmetrics. Additionally, they lacked a critical benchmark - comparing model\nperformance on pure noise inputs. We propose a methodology to differentiate\nbetween models that truly learn from EEG signals and those that simply memorize\ntraining data. Our analysis reveals that model performance on noise data can be\ncomparable to that on EEG data. These findings highlight the need for stricter\nevaluation practices in EEG-to-Text research, emphasizing transparent reporting\nand rigorous benchmarking with noise inputs. This approach will lead to more\nreliable assessments of model capabilities and pave the way for robust\nEEG-to-Text communication systems.", "paper_summary_zh": "這項研究批判性地分析了現有的開放式詞彙 EEG 轉文字翻譯模型。我們發現了一個關鍵限制：先前的研究在評估時經常使用隱含的教師強制，人為地提高了效能指標。此外，他們缺乏一個關鍵的基準 - 比較模型在純雜訊輸入上的效能。我們提出了一種方法來區分真正從 EEG 訊號中學習的模型和僅僅記憶訓練資料的模型。我們的分析顯示，模型在雜訊資料上的效能可以與在 EEG 資料上的效能相媲美。這些發現突顯了 EEG 轉文字研究中需要更嚴格的評估實務，強調透明的報告和嚴謹的雜訊輸入基準測試。這種方法將導致對模型功能更可靠的評估，並為強健的 EEG 轉文字通訊系統鋪路。", "author": "Hyejeong Jo et.al.", "authors": "Hyejeong Jo, Yiqian Yang, Juhyeok Han, Yiqun Duan, Hui Xiong, Won Hee Lee", "id": "2405.06459v1", "paper_url": "http://arxiv.org/abs/2405.06459v1", "repo": "null"}}