{"2411.18068": {"publish_time": "2024-11-27", "title": "PersonaCraft: Personalized Full-Body Image Synthesis for Multiple Identities from Single References Using 3D-Model-Conditioned Diffusion", "paper_summary": "Personalized image generation has been significantly advanced, enabling the\ncreation of highly realistic and customized images. However, existing methods\noften struggle with generating images of multiple people due to occlusions and\nfail to accurately personalize full-body shapes. In this paper, we propose\nPersonaCraft, a novel approach that combines diffusion models with 3D human\nmodeling to address these limitations. Our method effectively manages\nocclusions by incorporating 3D-aware pose conditioning with SMPLx-ControlNet\nand accurately personalizes human full-body shapes through SMPLx fitting.\nAdditionally, PersonaCraft enables user-defined body shape adjustments, adding\nflexibility for individual body customization. Experimental results demonstrate\nthe superior performance of PersonaCraft in generating high-quality, realistic\nimages of multiple individuals while resolving occlusion issues, thus\nestablishing a new standard for multi-person personalized image synthesis.\nProject page: https://gwang-kim.github.io/persona_craft", "paper_summary_zh": "個人化影像生成技術已大幅進步，能產生高度逼真且客製化的影像。然而，現有方法往往會因為遮擋而難以產生多人的影像，且無法準確個人化全身形狀。本篇論文提出 PersonaCraft，這是一種結合擴散模型與 3D 人體建模的新穎方法，以解決這些限制。我們的技術透過結合 SMPLx-ControlNet 的 3D 感知姿勢調整，有效處理遮擋問題，並透過 SMPLx 擬合準確個人化人類全身形狀。此外，PersonaCraft 能讓使用者自訂身體形狀調整，增加個人身體客製化的彈性。實驗結果證明 PersonaCraft 在產生多人的高品質、逼真影像方面表現優異，同時解決遮擋問題，因此為多人個人化影像合成建立了新標準。\n專案頁面：https://gwang-kim.github.io/persona_craft", "author": "Gwanghyun Kim et.al.", "authors": "Gwanghyun Kim, Suh Yoon Jeon, Seunggyu Lee, Se Young Chun", "id": "2411.18068v1", "paper_url": "http://arxiv.org/abs/2411.18068v1", "repo": "null"}}