{"2409.03563": {"publish_time": "2024-09-05", "title": "100 instances is all you need: predicting the success of a new LLM on unseen data by testing on a few instances", "paper_summary": "Predicting the performance of LLMs on individual task instances is essential\nto ensure their reliability in high-stakes applications. To do so, a\npossibility is to evaluate the considered LLM on a set of task instances and\ntrain an assessor to predict its performance based on features of the\ninstances. However, this approach requires evaluating each new LLM on a\nsufficiently large set of task instances to train an assessor specific to it.\nIn this work, we leverage the evaluation results of previously tested LLMs to\nreduce the number of evaluations required to predict the performance of a new\nLLM. In practice, we propose to test the new LLM on a small set of reference\ninstances and train a generic assessor which predicts the performance of the\nLLM on an instance based on the performance of the former on the reference set\nand features of the instance of interest. We conduct empirical studies on\nHELM-Lite and KindsOfReasoning, a collection of existing reasoning datasets\nthat we introduce, where we evaluate all instruction-fine-tuned OpenAI models\nuntil the January 2024 version of GPT4. When predicting performance on\ninstances with the same distribution as those used to train the generic\nassessor, we find this achieves performance comparable to the LLM-specific\nassessors trained on the full set of instances. Additionally, we find that\nrandomly selecting the reference instances performs as well as some advanced\nselection methods we tested. For out of distribution, however, no clear winner\nemerges and the overall performance is worse, suggesting that the inherent\npredictability of LLMs is low.", "paper_summary_zh": "預測 LLM 在個別任務實例中的表現對於確保它們在高風險應用中的可靠性至關重要。為此，一種可能性是在一組任務實例上評估所考慮的 LLM，並訓練評估器根據實例的特徵來預測其表現。然而，這種方法需要在足夠大的任務實例集上評估每個新的 LLM，以訓練專門針對它的評估器。在這項工作中，我們利用先前測試的 LLM 的評估結果來減少預測新 LLM 的表現所需的評估次數。在實務上，我們建議在少量參考實例上測試新的 LLM，並訓練一個通用評估器，該評估器根據前者在參考集上的表現和感興趣實例的特徵來預測 LLM 在實例上的表現。我們對 HELM-Lite 和 KindsOfReasoning 進行實證研究，這是一個我們介紹的現有推理資料集集合，我們在其中評估所有微調 OpenAI 模型，直到 GPT4 的 2024 年 1 月版本。在預測與用於訓練通用評估器的那些具有相同分佈的實例上的表現時，我們發現這達到了與在全組實例上訓練的 LLM 專用評估器相當的表現。此外，我們發現隨機選擇參考實例的表現與我們測試的一些進階選擇方法一樣好。然而，對於分佈外，沒有明確的贏家出現，而且整體表現較差，這表明 LLM 的內在可預測性較低。", "author": "Lorenzo Pacchiardi et.al.", "authors": "Lorenzo Pacchiardi, Lucy G. Cheke, José Hernández-Orallo", "id": "2409.03563v1", "paper_url": "http://arxiv.org/abs/2409.03563v1", "repo": "null"}}