{"2405.21018": {"publish_time": "2024-05-31", "title": "Improved Techniques for Optimization-Based Jailbreaking on Large Language Models", "paper_summary": "Large language models (LLMs) are being rapidly developed, and a key component\nof their widespread deployment is their safety-related alignment. Many\nred-teaming efforts aim to jailbreak LLMs, where among these efforts, the\nGreedy Coordinate Gradient (GCG) attack's success has led to a growing interest\nin the study of optimization-based jailbreaking techniques. Although GCG is a\nsignificant milestone, its attacking efficiency remains unsatisfactory. In this\npaper, we present several improved (empirical) techniques for\noptimization-based jailbreaks like GCG. We first observe that the single target\ntemplate of \"Sure\" largely limits the attacking performance of GCG; given this,\nwe propose to apply diverse target templates containing harmful self-suggestion\nand/or guidance to mislead LLMs. Besides, from the optimization aspects, we\npropose an automatic multi-coordinate updating strategy in GCG (i.e.,\nadaptively deciding how many tokens to replace in each step) to accelerate\nconvergence, as well as tricks like easy-to-hard initialisation. Then, we\ncombine these improved technologies to develop an efficient jailbreak method,\ndubbed $\\mathcal{I}$-GCG. In our experiments, we evaluate on a series of\nbenchmarks (such as NeurIPS 2023 Red Teaming Track). The results demonstrate\nthat our improved techniques can help GCG outperform state-of-the-art\njailbreaking attacks and achieve nearly 100% attack success rate. The code is\nreleased at https://github.com/jiaxiaojunQAQ/I-GCG.", "paper_summary_zh": "大型語言模型 (LLM) 正在快速發展，而其廣泛部署的一個關鍵組成部分是其與安全相關的一致性。許多紅隊行動旨在破解 LLM，在這些行動中，貪婪坐標梯度 (GCG) 攻擊的成功引起了人們對基於最佳化的破解技術研究的興趣日益濃厚。儘管 GCG 是個重要的里程碑，但其攻擊效率仍然令人不滿意。在本文中，我們提出了幾種改進的（經驗）技術，用於基於最佳化的破解，例如 GCG。我們首先觀察到「確定」的單一目標範本在很大程度上限制了 GCG 的攻擊效能；有鑑於此，我們建議應用包含有害自我暗示和/或指導的各種目標範本來誤導 LLM。此外，從最佳化的角度來看，我們在 GCG 中提出了一種自動多坐標更新策略（即自適應地決定在每一步中替換多少個代幣）以加速收斂，以及諸如易於困難初始化的技巧。然後，我們將這些改進的技術結合起來，開發出一種高效的破解方法，稱為 $\\mathcal{I}$-GCG。在我們的實驗中，我們在一系列基準上進行評估（例如 NeurIPS 2023 紅隊追蹤）。結果表明，我們改進的技術可以幫助 GCG 優於最先進的破解攻擊，並實現接近 100% 的攻擊成功率。代碼已發布在 https://github.com/jiaxiaojunQAQ/I-GCG。", "author": "Xiaojun Jia et.al.", "authors": "Xiaojun Jia, Tianyu Pang, Chao Du, Yihao Huang, Jindong Gu, Yang Liu, Xiaochun Cao, Min Lin", "id": "2405.21018v1", "paper_url": "http://arxiv.org/abs/2405.21018v1", "repo": "https://github.com/jiaxiaojunqaq/i-gcg"}}