{"2408.14834": {"publish_time": "2024-08-27", "title": "Strategic Optimization and Challenges of Large Language Models in Object-Oriented Programming", "paper_summary": "In the area of code generation research, the emphasis has transitioned from\ncrafting individual functions to developing class-level method code that\nintegrates contextual information. This shift has brought several benchmarks\nsuch as ClassEval and CoderEval, which consider class-level contexts.\nNevertheless, the influence of specific contextual factors at the method level\nremains less explored.\n  This research focused on method-level code generation within the\nObject-Oriented Programming (OOP) framework. Based on CoderEval, we devised\nexperiments that varied the extent of contextual information in the prompts,\nranging from method-specific to project-wide details. We introduced the\ninnovative metric of \"Prompt-Token Cost-Effectiveness\" to evaluate the economic\nviability of incorporating additional contextual layers. Our findings indicate\nthat prompts enriched with method invocation details yield the highest\ncost-effectiveness. Additionally, our study revealed disparities among Large\nLanguage Models (LLMs) regarding error type distributions and the level of\nassistance they provide to developers. Notably, larger LLMs do not invariably\nperform better. We also observed that tasks with higher degrees of coupling\npresent more substantial challenges, suggesting that the choice of LLM should\nbe tailored to the task's coupling degree. For example, GPT-4 exhibited\nimproved performance in low-coupling scenarios, whereas GPT-3.5 seemed better\nsuited for tasks with high coupling. By meticulously curating prompt content\nand selecting the appropriate LLM, developers can optimize code quality while\nmaximizing cost-efficiency during the development process.", "paper_summary_zh": "<paragraph>在程式碼產生研究領域中，重點已從製作個別函數轉移到開發整合背景資訊的類別層級方法程式碼。此轉變帶來了幾個基準，例如考慮類別層級背景的 ClassEval 和 CoderEval。儘管如此，特定背景因素在方法層級的影響仍較少探討。\n本研究專注於物件導向程式設計 (OOP) 架構中的方法層級程式碼產生。根據 CoderEval，我們設計了實驗，改變提示中背景資訊的範圍，從特定於方法的詳細資訊到專案範圍的詳細資訊。我們引進創新的「提示代幣成本效益」指標，以評估加入額外背景層的經濟可行性。我們的研究結果顯示，豐富方法呼叫詳細資訊的提示產生最高的成本效益。此外，我們的研究揭示了大型語言模型 (LLM) 在錯誤類型分佈和它們提供給開發人員的協助層級方面存在差異。值得注意的是，較大的 LLM 並非總是表現得更好。我們還觀察到，耦合程度較高的任務會帶來更重大的挑戰，這表明 LLM 的選擇應根據任務的耦合程度進行調整。例如，GPT-4 在低耦合場景中表現出更好的效能，而 GPT-3.5 似乎更適合高耦合的任務。透過仔細策劃提示內容並選擇適當的 LLM，開發人員可以在開發過程中最佳化程式碼品質，同時最大化成本效益。</paragraph>", "author": "Zinan Wang et.al.", "authors": "Zinan Wang", "id": "2408.14834v1", "paper_url": "http://arxiv.org/abs/2408.14834v1", "repo": "null"}}