{"2412.20541": {"publish_time": "2024-12-29", "title": "SAFE-MEME: Structured Reasoning Framework for Robust Hate Speech Detection in Memes", "paper_summary": "Memes act as cryptic tools for sharing sensitive ideas, often requiring\ncontextual knowledge to interpret. This makes moderating multimodal memes\nchallenging, as existing works either lack high-quality datasets on nuanced\nhate categories or rely on low-quality social media visuals. Here, we curate\ntwo novel multimodal hate speech datasets, MHS and MHS-Con, that capture\nfine-grained hateful abstractions in regular and confounding scenarios,\nrespectively. We benchmark these datasets against several competing baselines.\nFurthermore, we introduce SAFE-MEME (Structured reAsoning FramEwork), a novel\nmultimodal Chain-of-Thought-based framework employing Q&A-style reasoning\n(SAFE-MEME-QA) and hierarchical categorization (SAFE-MEME-H) to enable robust\nhate speech detection in memes. SAFE-MEME-QA outperforms existing baselines,\nachieving an average improvement of approximately 5% and 4% on MHS and MHS-Con,\nrespectively. In comparison, SAFE-MEME-H achieves an average improvement of 6%\nin MHS while outperforming only multimodal baselines in MHS-Con. We show that\nfine-tuning a single-layer adapter within SAFE-MEME-H outperforms fully\nfine-tuned models in regular fine-grained hateful meme detection. However, the\nfully fine-tuning approach with a Q&A setup is more effective for handling\nconfounding cases. We also systematically examine the error cases, offering\nvaluable insights into the robustness and limitations of the proposed\nstructured reasoning framework for analyzing hateful memes.", "paper_summary_zh": "迷因作為分享敏感想法的神秘工具，通常需要背景知識才能解讀。這使得節制多模態迷因變得具有挑戰性，因為現有作品要么缺乏關於細微仇恨類別的高品質數據集，要么依賴於低品質的社交媒體視覺效果。在此，我們策劃了兩個新穎的多模態仇恨言論數據集，分別是 MHS 和 MHS-Con，它們分別捕捉了常規和令人困惑場景中的細粒度仇恨抽象。我們根據幾個競爭基線對這些數據集進行基準測試。此外，我們還引入了 SAFE-MEME（結構化推理框架），這是一個新穎的多模態基於思想鏈的框架，採用問答式推理（SAFE-MEME-QA）和分層分類（SAFE-MEME-H）來實現對迷因中仇恨言論的強大檢測。SAFE-MEME-QA 優於現有的基線，分別在 MHS 和 MHS-Con 上實現了大約 5% 和 4% 的平均改進。相比之下，SAFE-MEME-H 在 MHS 中實現了 6% 的平均改進，而僅在 MHS-Con 中優於多模態基線。我們表明，在 SAFE-MEME-H 中微調單層適配器優於常規細粒度仇恨迷因檢測中的完全微調模型。然而，具有問答設置的完全微調方法對於處理令人困惑的情況更有效。我們還系統地檢查了錯誤案例，為分析仇恨迷因的提議結構化推理框架的魯棒性和局限性提供了寶貴的見解。", "author": "Palash Nandi et.al.", "authors": "Palash Nandi, Shivam Sharma, Tanmoy Chakraborty", "id": "2412.20541v1", "paper_url": "http://arxiv.org/abs/2412.20541v1", "repo": "null"}}