{"2412.07108": {"publish_time": "2024-12-10", "title": "Improving the Natural Language Inference robustness to hard dataset by data augmentation and preprocessing", "paper_summary": "Natural Language Inference (NLI) is the task of inferring whether the\nhypothesis can be justified by the given premise. Basically, we classify the\nhypothesis into three labels(entailment, neutrality and contradiction) given\nthe premise. NLI was well studied by the previous researchers. A number of\nmodels, especially the transformer based ones, have achieved significant\nimprovement on these tasks. However, it is reported that these models are\nsuffering when they are dealing with hard datasets. Particularly, they perform\nmuch worse when dealing with unseen out-of-distribution premise and hypothesis.\nThey may not understand the semantic content but learn the spurious\ncorrelations. In this work, we propose the data augmentation and preprocessing\nmethods to solve the word overlap, numerical reasoning and length mismatch\nproblems. These methods are general methods that do not rely on the\ndistribution of the testing data and they help improve the robustness of the\nmodels.", "paper_summary_zh": "自然語言推理 (NLI) 是一項任務，用於推斷假設是否能由給定的前提證明。基本上，我們根據前提將假設分類為三種類別（蘊含、中立和矛盾）。NLI 已被先前的研究人員廣泛研究。許多模型，特別是基於轉換器的模型，已在這些任務上取得顯著進展。然而，據報導，這些模型在處理困難的資料集時會遇到困難。特別是，當處理未見過、分佈不均勻的前提和假設時，它們的表現會差很多。它們可能無法理解語義內容，但會學習虛假的關聯性。在這項工作中，我們提出資料擴充和預處理方法來解決字詞重疊、數字推理和長度不匹配的問題。這些方法是通用的方法，不依賴於測試資料的分配，它們有助於提高模型的穩健性。", "author": "Zijiang Yang et.al.", "authors": "Zijiang Yang", "id": "2412.07108v1", "paper_url": "http://arxiv.org/abs/2412.07108v1", "repo": "null"}}