{"2409.09822": {"publish_time": "2024-09-15", "title": "Causal Inference with Large Language Model: A Survey", "paper_summary": "Causal inference has been a pivotal challenge across diverse domains such as\nmedicine and economics, demanding a complicated integration of human knowledge,\nmathematical reasoning, and data mining capabilities. Recent advancements in\nnatural language processing (NLP), particularly with the advent of large\nlanguage models (LLMs), have introduced promising opportunities for traditional\ncausal inference tasks. This paper reviews recent progress in applying LLMs to\ncausal inference, encompassing various tasks spanning different levels of\ncausation. We summarize the main causal problems and approaches, and present a\ncomparison of their evaluation results in different causal scenarios.\nFurthermore, we discuss key findings and outline directions for future\nresearch, underscoring the potential implications of integrating LLMs in\nadvancing causal inference methodologies.", "paper_summary_zh": "因果推論一直是各個領域的關鍵挑戰，例如醫學和經濟學，需要結合人類知識、數學推理和資料探勘能力。自然語言處理 (NLP) 的最新進展，特別是大語言模型 (LLM) 的出現，為傳統因果推論任務帶來了絕佳的機會。本文回顧了將 LLM 應用於因果推論的最新進展，涵蓋了不同因果層級的各種任務。我們總結了主要的因果問題和方法，並比較了它們在不同因果情境中的評估結果。此外，我們討論了關鍵發現，並概述了未來研究的方向，強調了整合 LLM 以促進因果推論方法的潛在影響。", "author": "Jing Ma et.al.", "authors": "Jing Ma", "id": "2409.09822v1", "paper_url": "http://arxiv.org/abs/2409.09822v1", "repo": "null"}}