{"2408.02949": {"publish_time": "2024-08-06", "title": "Few-shot Scooping Under Domain Shift via Simulated Maximal Deployment Gaps", "paper_summary": "Autonomous lander missions on extraterrestrial bodies need to sample granular\nmaterials while coping with domain shifts, even when sampling strategies are\nextensively tuned on Earth. To tackle this challenge, this paper studies the\nfew-shot scooping problem and proposes a vision-based adaptive scooping\nstrategy that uses the deep kernel Gaussian process method trained with a novel\nmeta-training strategy to learn online from very limited experience on\nout-of-distribution target terrains. Our Deep Kernel Calibration with Maximal\nDeployment Gaps (kCMD) strategy explicitly trains a deep kernel model to adapt\nto large domain shifts by creating simulated maximal deployment gaps from an\noffline training dataset and training models to overcome these deployment gaps\nduring training. Employed in a Bayesian Optimization sequential decision-making\nframework, the proposed method allows the robot to perform high-quality\nscooping actions on out-of-distribution terrains after a few attempts,\nsignificantly outperforming non-adaptive methods proposed in the excavation\nliterature as well as other state-of-the-art meta-learning methods. The\nproposed method also demonstrates zero-shot transfer capability, successfully\nadapting to the NASA OWLAT platform, which serves as a state-of-the-art\nsimulator for potential future planetary missions. These results demonstrate\nthe potential of training deep models with simulated deployment gaps for more\ngeneralizable meta-learning in high-capacity models. Furthermore, they\nhighlight the promise of our method in autonomous lander sampling missions by\nenabling landers to overcome the deployment gap between Earth and\nextraterrestrial bodies.", "paper_summary_zh": "<paragraph>外星天體上的自主登陸任務需要採集顆粒材料，同時應對領域轉變，即使在廣泛調整地球上的採集策略時也是如此。為了應對這一挑戰，本文研究了少次嘗試的挖取問題，並提出了一種基於視覺的自適應挖取策略，該策略使用深度核高斯過程方法進行訓練，採用新穎的元訓練策略，從分布目標地形上的非常有限的經驗中在線學習。我們採用最大部署差距的深度核校準 (kCMD) 策略，明確訓練深度核模型以適應大的領域轉變，方法是從離線訓練數據集創建模擬的最大部署差距，並訓練模型在訓練過程中克服這些部署差距。所提出的方法採用貝葉斯優化序貫決策制定框架，使機器人在經過幾次嘗試後能夠在外部分布地形上執行高品質的挖取動作，顯著優於挖掘文獻中提出的非自適應方法以及其他最先進的元學習方法。所提出的方法還展示了零次嘗試轉移能力，成功適應了 NASA OWLAT 平台，該平台是潛在未來行星任務的最新模擬器。這些結果展示了使用模擬部署差距訓練深度模型以在高容量模型中進行更具泛化性的元學習的潛力。此外，它們通過使登陸器能夠克服地球和外星天體之間的部署差距，突出了我們的方法在自主登陸器採樣任務中的前景。</paragraph>", "author": "Yifan Zhu et.al.", "authors": "Yifan Zhu, Pranay Thangeda, Erica L Tevere, Ashish Goel, Erik Kramer, Hari D Nayar, Melkior Ornik, Kris Hauser", "id": "2408.02949v1", "paper_url": "http://arxiv.org/abs/2408.02949v1", "repo": "null"}}