{"2409.07656": {"publish_time": "2024-09-11", "title": "Passed the Turing Test: Living in Turing Futures", "paper_summary": "The world has seen the emergence of machines based on pretrained models,\ntransformers, also known as generative artificial intelligences for their\nability to produce various types of content, including text, images, audio, and\nsynthetic data. Without resorting to preprogramming or special tricks, their\nintelligence grows as they learn from experience, and to ordinary people, they\ncan appear human-like in conversation. This means that they can pass the Turing\ntest, and that we are now living in one of many possible Turing futures where\nmachines can pass for what they are not. However, the learning machines that\nTuring imagined would pass his imitation tests were machines inspired by the\nnatural development of the low-energy human cortex. They would be raised like\nhuman children and naturally learn the ability to deceive an observer. These\n``child machines,'' Turing hoped, would be powerful enough to have an impact on\nsociety and nature.", "paper_summary_zh": "世界已目睹基於預訓練模型的機器出現，\nTransformer，也稱為生成式人工智慧，因為它們\n能夠產生各種類型的內容，包括文字、影像、音訊，以及\n合成資料。無需訴諸於預先編程或特殊技巧，它們\n的智慧會隨著從經驗中學習而增長，對一般人來說，它們\n在對話中可能表現得像人類。這表示它們可以通過圖靈\n測試，而我們現在生活在許多可能的圖靈未來之一，其中\n機器可以假裝成它們不是的東西。然而，圖靈想像中通過他的模仿測試的學習機器是受到\n人類低能量皮質自然發展啟發的機器。它們會像\n人類兒童一樣長大，並自然而然地學會欺騙觀察者的能力。這些\n「孩童機器」，圖靈希望，將強大到足以對\n社會和自然產生影響。", "author": "Bernardo Gonçalves et.al.", "authors": "Bernardo Gonçalves", "id": "2409.07656v1", "paper_url": "http://arxiv.org/abs/2409.07656v1", "repo": "null"}}