{"2409.20189": {"publish_time": "2024-09-30", "title": "TaskComplexity: A Dataset for Task Complexity Classification with In-Context Learning, FLAN-T5 and GPT-4o Benchmarks", "paper_summary": "This paper addresses the challenge of classifying and assigning programming\ntasks to experts, a process that typically requires significant effort, time,\nand cost. To tackle this issue, a novel dataset containing a total of 4,112\nprogramming tasks was created by extracting tasks from various websites. Web\nscraping techniques were employed to collect this dataset of programming\nproblems systematically. Specific HTML tags were tracked to extract key\nelements of each issue, including the title, problem description, input-output,\nexamples, problem class, and complexity score. Examples from the dataset are\nprovided in the appendix to illustrate the variety and complexity of tasks\nincluded. The dataset's effectiveness has been evaluated and benchmarked using\ntwo approaches; the first approach involved fine-tuning the FLAN-T5 small model\non the dataset, while the second approach used in-context learning (ICL) with\nthe GPT-4o mini. The performance was assessed using standard metrics: accuracy,\nrecall, precision, and F1-score. The results indicated that in-context learning\nwith GPT-4o-mini outperformed the FLAN-T5 model.", "paper_summary_zh": "本論文探討了對程式設計任務進行分類和指派給專家的挑戰，這是一個通常需要大量精力、時間和成本的過程。為了解決這個問題，建立了一個包含總共 4,112 個程式設計任務的新穎資料集，方法是從各種網站中擷取任務。使用網頁擷取技術系統地收集這個程式設計問題資料集。追蹤特定的 HTML 標籤，以擷取每個問題的關鍵元素，包括標題、問題說明、輸入輸出、範例、問題類別和複雜度分數。資料集中的範例在附錄中提供，以說明所包含任務的多樣性和複雜性。資料集的有效性已使用兩種方法進行評估和基準測試；第一種方法涉及在資料集上微調 FLAN-T5 小型模型，而第二種方法使用 GPT-4o mini 的情境內學習 (ICL)。使用標準指標評估效能：準確度、召回率、精確度和 F1 分數。結果表明，使用 GPT-4o-mini 的情境內學習優於 FLAN-T5 模型。", "author": "Areeg Fahad Rasheed et.al.", "authors": "Areeg Fahad Rasheed, M. Zarkoosh, Safa F. Abbas, Sana Sabah Al-Azzawi", "id": "2409.20189v1", "paper_url": "http://arxiv.org/abs/2409.20189v1", "repo": "null"}}