{"2412.12954": {"publish_time": "2024-12-17", "title": "Recipient Profiling: Predicting Characteristics from Messages", "paper_summary": "It has been shown in the field of Author Profiling that texts may\ninadvertently reveal sensitive information about their authors, such as gender\nor age. This raises important privacy concerns that have been extensively\naddressed in the literature, in particular with the development of methods to\nhide such information. We argue that, when these texts are in fact messages\nexchanged between individuals, this is not the end of the story. Indeed, in\nthis case, a second party, the intended recipient, is also involved and should\nbe considered. In this work, we investigate the potential privacy leaks\naffecting them, that is we propose and address the problem of Recipient\nProfiling. We provide empirical evidence that such a task is feasible on\nseveral publicly accessible datasets\n(https://huggingface.co/datasets/sileod/recipient_profiling). Furthermore, we\nshow that the learned models can be transferred to other datasets, albeit with\na loss in accuracy.", "paper_summary_zh": "在作者画像領域中，研究已表明文本可能會在無意間揭露作者的敏感資訊，例如性別或年齡。這引發了重要的隱私問題，並已在文獻中廣泛探討，特別是開發了隱藏此類資訊的方法。我們認為，當這些文本實際上是個人之間交換的訊息時，這並非故事的結局。的確，在這種情況下，第二方（預期的收件人）也參與其中，並且應該被考慮在內。在這項工作中，我們調查了影響他們的潛在隱私洩漏，也就是說，我們提出並解決了收件人画像問題。我們提供了經驗證據，證明此類任務在幾個公開可存取的資料集上是可行的（https://huggingface.co/datasets/sileod/recipient_profiling）。此外，我們表明，儘管準確度有所下降，但學習模型仍可轉移到其他資料集。", "author": "Martin Borquez et.al.", "authors": "Martin Borquez, Mikaela Keller, Michael Perrot, Damien Sileo", "id": "2412.12954v1", "paper_url": "http://arxiv.org/abs/2412.12954v1", "repo": "null"}}