{"2412.18142": {"publish_time": "2024-12-24", "title": "Text-Aware Adapter for Few-Shot Keyword Spotting", "paper_summary": "Recent advances in flexible keyword spotting (KWS) with text enrollment allow\nusers to personalize keywords without uttering them during enrollment. However,\nthere is still room for improvement in target keyword performance. In this\nwork, we propose a novel few-shot transfer learning method, called text-aware\nadapter (TA-adapter), designed to enhance a pre-trained flexible KWS model for\nspecific keywords with limited speech samples. To adapt the acoustic encoder,\nwe leverage a jointly pre-trained text encoder to generate a text embedding\nthat acts as a representative vector for the keyword. By fine-tuning only a\nsmall portion of the network while keeping the core components' weights intact,\nthe TA-adapter proves highly efficient for few-shot KWS, enabling a seamless\nreturn to the original pre-trained model. In our experiments, the TA-adapter\ndemonstrated significant performance improvements across 35 distinct keywords\nfrom the Google Speech Commands V2 dataset, with only a 0.14% increase in the\ntotal number of parameters.", "paper_summary_zh": "近來在具有文字註冊的彈性關鍵字點選 (KWS) 中的進展，讓使用者在註冊期間無需說出關鍵字即可個人化關鍵字。然而，目標關鍵字的表現仍有進步空間。在這項工作中，我們提出一個稱為文字感知適配器 (TA-adapter) 的新穎小樣本轉移學習方法，其設計用於增強預先訓練好的彈性 KWS 模型，以處理具有有限語音範例的特定關鍵字。為了適應音訊編碼器，我們利用一個共同預先訓練好的文字編碼器來產生文字嵌入，作為關鍵字的代表向量。透過微調網路中僅一小部分，同時保持核心元件的權重不變，TA-adapter 證明對於小樣本 KWS 而言非常有效率，讓無縫返回至原始預先訓練好的模型成為可能。在我們的實驗中，TA-adapter 在 Google 語音指令 V2 資料集中的 35 個不同關鍵字中展示出顯著的效能提升，而參數總數僅增加了 0.14%。", "author": "Youngmoon Jung et.al.", "authors": "Youngmoon Jung, Jinyoung Lee, Seungjin Lee, Myunghun Jung, Yong-Hyeok Lee, Hoon-Young Cho", "id": "2412.18142v1", "paper_url": "http://arxiv.org/abs/2412.18142v1", "repo": "null"}}