{"2501.11587": {"publish_time": "2025-01-20", "title": "Recurrent Diffusion for Large-Scale Parameter Generation", "paper_summary": "Parameter generation has struggled to scale up for a long time, significantly\nlimiting its range of applications. In this study, we introduce\n\\textbf{R}ecurrent diffusion for large-scale \\textbf{P}arameter\n\\textbf{G}eneration, called \\textbf{RPG}. We first divide the trained\nparameters into non-overlapping parts, after which a recurrent model is\nproposed to learn their relationships. The recurrent model's outputs, as\nconditions, are then fed into a diffusion model to generate the neural network\nparameters. Using only a single GPU, recurrent diffusion enables us to generate\npopular vision and language models such as ConvNeXt-L and LoRA parameters of\nLLaMA-7B. Meanwhile, across various architectures and tasks, the generated\nparameters consistently perform comparable results over trained networks.\nNotably, our approach also shows the potential to generate models for handling\nunseen tasks, which largely increases the practicality of parameter generation.\nOur code is available\n\\href{https://github.com/NUS-HPC-AI-Lab/Recurrent-Parameter-Generation}{here}.", "paper_summary_zh": "參數生成長期以來一直難以擴展，這顯著限制了其應用範圍。在本研究中，我們引入了用於大規模參數生成的遞迴擴散，稱為 RPG。我們首先將訓練好的參數分成不重疊的部分，然後提出一個遞迴模型來學習它們之間的關係。然後，將遞迴模型的輸出作為條件輸入到擴散模型中以生成神經網路參數。僅使用單個 GPU，遞迴擴散使我們能夠生成流行的視覺和語言模型，例如 ConvNeXt-L 和 LLaMA-7B 的 LoRA 參數。同時，在各種架構和任務中，生成的參數始終對訓練好的網路執行可比較的結果。值得注意的是，我們的做法也顯示了為處理未見任務生成模型的潛力，這大大增加了參數生成的實用性。我們的程式碼可用於\n\\href{https://github.com/NUS-HPC-AI-Lab/Recurrent-Parameter-Generation}{這裡}。", "author": "Kai Wang et.al.", "authors": "Kai Wang, Dongwen Tang, Wangbo Zhao, Yang You", "id": "2501.11587v1", "paper_url": "http://arxiv.org/abs/2501.11587v1", "repo": "https://github.com/nus-hpc-ai-lab/recurrent-parameter-generation"}}