{"2408.10914": {"publish_time": "2024-08-20", "title": "To Code, or Not To Code? Exploring Impact of Code in Pre-training", "paper_summary": "Including code in the pre-training data mixture, even for models not\nspecifically designed for code, has become a common practice in LLMs\npre-training. While there has been anecdotal consensus among practitioners that\ncode data plays a vital role in general LLMs' performance, there is only\nlimited work analyzing the precise impact of code on non-code tasks. In this\nwork, we systematically investigate the impact of code data on general\nperformance. We ask \"what is the impact of code data used in pre-training on a\nlarge variety of downstream tasks beyond code generation\". We conduct extensive\nablations and evaluate across a broad range of natural language reasoning\ntasks, world knowledge tasks, code benchmarks, and LLM-as-a-judge win-rates for\nmodels with sizes ranging from 470M to 2.8B parameters. Across settings, we\nfind a consistent results that code is a critical building block for\ngeneralization far beyond coding tasks and improvements to code quality have an\noutsized impact across all tasks. In particular, compared to text-only\npre-training, the addition of code results in up to relative increase of 8.2%\nin natural language (NL) reasoning, 4.2% in world knowledge, 6.6% improvement\nin generative win-rates, and a 12x boost in code performance respectively. Our\nwork suggests investments in code quality and preserving code during\npre-training have positive impacts.", "paper_summary_zh": "在預訓練資料混合中包含程式碼，即使對於並非專門設計用於程式碼的模型，已成為 LLM 預訓練的常見做法。雖然從業者之間有共識，認為程式碼資料在一般 LLM 的效能中扮演至關重要的角色，但僅有少數研究分析程式碼對非程式碼任務的精確影響。在此研究中，我們系統性地探討程式碼資料對一般效能的影響。我們詢問「在預訓練中使用的程式碼資料對程式碼產生之外的各種下游任務有何影響」。我們進行廣泛的消融，並評估各種自然語言推理任務、世界知識任務、程式碼基準，以及從 4.7 億到 28 億個參數的模型的 LLM 作為評審的獲勝率。在各項設定中，我們發現一致的結果，程式碼是遠超出編碼任務的概括性關鍵建構模組，而程式碼品質的提升對所有任務都有過大的影響。特別是，與僅文字的預訓練相比，加入程式碼可分別在自然語言 (NL) 推理中增加高達 8.2%、世界知識中增加 4.2%、生成獲勝率中提升 6.6%，以及程式碼效能提升 12 倍。我們的研究建議，在預訓練期間投資程式碼品質和保留程式碼具有正面的影響。", "author": "Viraat Aryabumi et.al.", "authors": "Viraat Aryabumi, Yixuan Su, Raymond Ma, Adrien Morisot, Ivan Zhang, Acyr Locatelli, Marzieh Fadaee, Ahmet Üstün, Sara Hooker", "id": "2408.10914v1", "paper_url": "http://arxiv.org/abs/2408.10914v1", "repo": "null"}}