{"2405.10345": {"publish_time": "2024-05-16", "title": "Machine Learning Driven Biomarker Selection for Medical Diagnosis", "paper_summary": "Recent advances in experimental methods have enabled researchers to collect\ndata on thousands of analytes simultaneously. This has led to correlational\nstudies that associated molecular measurements with diseases such as\nAlzheimer's, Liver, and Gastric Cancer. However, the use of thousands of\nbiomarkers selected from the analytes is not practical for real-world medical\ndiagnosis and is likely undesirable due to potentially formed spurious\ncorrelations. In this study, we evaluate 4 different methods for biomarker\nselection and 4 different machine learning (ML) classifiers for identifying\ncorrelations, evaluating 16 approaches in all. We found that contemporary\nmethods outperform previously reported logistic regression in cases where 3 and\n10 biomarkers are permitted. When specificity is fixed at 0.9, ML approaches\nproduced a sensitivity of 0.240 (3 biomarkers) and 0.520 (10 biomarkers), while\nstandard logistic regression provided a sensitivity of 0.000 (3 biomarkers) and\n0.040 (10 biomarkers). We also noted that causal-based methods for biomarker\nselection proved to be the most performant when fewer biomarkers were\npermitted, while univariate feature selection was the most performant when a\ngreater number of biomarkers were permitted.", "paper_summary_zh": "近期的实验方法进步让研究人员能够同时收集数千种分析物的资料。这导致了将分子测量与疾病（例如阿尔茨海默氏症、肝癌和胃癌）关联起来的相关性研究。然而，从分析物中选出数千种生物标记物来进行实际的医疗诊断并不实际，而且由于可能会形成虚假的相关性，所以可能也不可取。在这项研究中，我们评估了 4 种不同的生物标记物选择方法和 4 种不同的机器学习 (ML) 分类器，用于识别相关性，总共评估了 16 种方法。我们发现，在允许使用 3 个和 10 个生物标记物的情况下，当代方法优于之前报告的逻辑回归。当特异性固定为 0.9 时，ML 方法产生的敏感性为 0.240（3 个生物标记物）和 0.520（10 个生物标记物），而标准逻辑回归提供的敏感性为 0.000（3 个生物标记物）和 0.040（10 个生物标记物）。我们还注意到，当允许较少的生物标记物时，基于因果关系的生物标记物选择方法被证明是最有效的，而当允许较多的生物标记物时，单变量特征选择是最有效的。", "author": "Divyagna Bavikadi et.al.", "authors": "Divyagna Bavikadi, Ayushi Agarwal, Shashank Ganta, Yunro Chung, Lusheng Song, Ji Qiu, Paulo Shakarian", "id": "2405.10345v1", "paper_url": "http://arxiv.org/abs/2405.10345v1", "repo": "null"}}