{"2409.09717": {"publish_time": "2024-09-15", "title": "Automatic Control With Human-Like Reasoning: Exploring Language Model Embodied Air Traffic Agents", "paper_summary": "Recent developments in language models have created new opportunities in air\ntraffic control studies. The current focus is primarily on text and\nlanguage-based use cases. However, these language models may offer a higher\npotential impact in the air traffic control domain, thanks to their ability to\ninteract with air traffic environments in an embodied agent form. They also\nprovide a language-like reasoning capability to explain their decisions, which\nhas been a significant roadblock for the implementation of automatic air\ntraffic control.\n  This paper investigates the application of a language model-based agent with\nfunction-calling and learning capabilities to resolve air traffic conflicts\nwithout human intervention. The main components of this research are\nfoundational large language models, tools that allow the agent to interact with\nthe simulator, and a new concept, the experience library. An innovative part of\nthis research, the experience library, is a vector database that stores\nsynthesized knowledge that agents have learned from interactions with the\nsimulations and language models.\n  To evaluate the performance of our language model-based agent, both\nopen-source and closed-source models were tested. The results of our study\nreveal significant differences in performance across various configurations of\nthe language model-based agents. The best-performing configuration was able to\nsolve almost all 120 but one imminent conflict scenarios, including up to four\naircraft at the same time. Most importantly, the agents are able to provide\nhuman-level text explanations on traffic situations and conflict resolution\nstrategies.", "paper_summary_zh": "<paragraph>語言模型的最新發展在空中交通管制研究中創造了新的機會。目前的重點主要在於基於文字和語言的用例。但是，由於這些語言模型能夠以具體的代理形式與空中交通環境互動，因此它們在空中交通管制領域可能具有更高的潛在影響。它們還提供了類似語言的推理能力來解釋其決策，這一直是實施自動空中交通管制的重大障礙。\n  本文探討了應用具備函數呼叫和學習能力的基於語言模型的代理來解決空中交通衝突，而無需人工干預。本研究的主要組成部分是基礎大型語言模型、允許代理與模擬器互動的工具，以及一個新概念，即體驗庫。本研究的創新部分，體驗庫，是一個向量資料庫，它儲存了代理從與模擬和語言模型的互動中學到的綜合知識。\n  為了評估我們基於語言模型的代理的效能，我們測試了開源和閉源模型。我們研究的結果顯示，基於語言模型的代理的各種配置在效能上存在顯著差異。效能最佳的配置能夠解決幾乎所有 120 個衝突情境（但有一個除外），包括同時處理多達四架飛機。最重要的是，這些代理能夠對交通狀況和衝突解決策略提供人類層級的文字解釋。</paragraph>", "author": "Justas Andriuškevičius et.al.", "authors": "Justas Andriuškevičius, Junzi Sun", "id": "2409.09717v1", "paper_url": "http://arxiv.org/abs/2409.09717v1", "repo": "null"}}