{"2406.02315": {"publish_time": "2024-06-04", "title": "An Independence-promoting Loss for Music Generation with Language Models", "paper_summary": "Music generation schemes using language modeling rely on a vocabulary of\naudio tokens, generally provided as codes in a discrete latent space learnt by\nan auto-encoder. Multi-stage quantizers are often employed to produce these\ntokens, therefore the decoding strategy used for token prediction must be\nadapted to account for multiple codebooks: either it should model the joint\ndistribution over all codebooks, or fit the product of the codebook marginal\ndistributions. Modelling the joint distribution requires a costly increase in\nthe number of auto-regressive steps, while fitting the product of the marginals\nyields an inexact model unless the codebooks are mutually independent. In this\nwork, we introduce an independence-promoting loss to regularize the\nauto-encoder used as the tokenizer in language models for music generation. The\nproposed loss is a proxy for mutual information based on the maximum mean\ndiscrepancy principle, applied in reproducible kernel Hilbert spaces. Our\ncriterion is simple to implement and train, and it is generalizable to other\nmulti-stream codecs. We show that it reduces the statistical dependence between\ncodebooks during auto-encoding. This leads to an increase in the generated\nmusic quality when modelling the product of the marginal distributions, while\ngenerating audio much faster than the joint distribution model.", "paper_summary_zh": "利用語言模型的音樂生成方案仰賴音訊代碼的詞彙，通常以自動編碼器學習到的離散潛在空間中的代碼提供。多階段量化器通常用於產生這些代碼，因此用於代碼預測的解碼策略必須調整為考量多個代碼簿：它應該對所有代碼簿上的聯合分佈建模，或符合代碼簿邊際分佈的乘積。對聯合分佈建模需要大幅增加自迴歸步驟的數量，而對邊際分佈的乘積進行擬合會產生不精確的模型，除非代碼簿相互獨立。在這項工作中，我們引進了一個促進獨立性的損失，以規範用於音樂生成語言模型中作為分詞器的自動編碼器。所提出的損失是基於最大平均差異原理的互信息的代理，應用於可複製核希爾伯特空間。我們的準則易於實作和訓練，並且可以推廣到其他多串流編解碼器。我們證明它會在自動編碼期間減少代碼簿之間的統計依賴性。這會在對邊際分佈的乘積建模時增加生成的音樂品質，同時比聯合分佈模型更快地產生音訊。", "author": "Jean-Marie Lemercier et.al.", "authors": "Jean-Marie Lemercier, Simon Rouard, Jade Copet, Yossi Adi, Alexandre Déffosez", "id": "2406.02315v1", "paper_url": "http://arxiv.org/abs/2406.02315v1", "repo": "null"}}