{"2502.13061": {"publish_time": "2025-02-18", "title": "Improved Fine-Tuning of Large Multimodal Models for Hateful Meme Detection", "paper_summary": "Hateful memes have become a significant concern on the Internet,\nnecessitating robust automated detection systems. While large multimodal models\nhave shown strong generalization across various tasks, they exhibit poor\ngeneralization to hateful meme detection due to the dynamic nature of memes\ntied to emerging social trends and breaking news. Recent work further\nhighlights the limitations of conventional supervised fine-tuning for large\nmultimodal models in this context. To address these challenges, we propose\nLarge Multimodal Model Retrieval-Guided Contrastive Learning (LMM-RGCL), a\nnovel two-stage fine-tuning framework designed to improve both in-domain\naccuracy and cross-domain generalization. Experimental results on six widely\nused meme classification datasets demonstrate that LMM-RGCL achieves\nstate-of-the-art performance, outperforming agent-based systems such as\nVPD-PALI-X-55B. Furthermore, our method effectively generalizes to\nout-of-domain memes under low-resource settings, surpassing models like GPT-4o.", "paper_summary_zh": "網路上的仇恨迷因已成為一大隱憂，因此需要強大的自動化偵測系統。雖然大型多模態模型已在各種任務中展現出強大的泛化能力，但由於迷因與新興社會趨勢和突發新聞息息相關，因此在仇恨迷因偵測方面表現不佳。最近的研究進一步強調了在這種情況下，傳統監督微調對大型多模態模型的限制。為了應對這些挑戰，我們提出了大型多模態模型檢索引導對比學習 (LMM-RGCL)，這是一種新穎的兩階段微調架構，旨在提高領域內準確度和跨領域泛化能力。在六個廣泛使用的迷因分類資料集上的實驗結果表明，LMM-RGCL 達到了最先進的效能，優於基於代理的系統，例如 VPD-PALI-X-55B。此外，我們的模型在低資源設定下有效泛化到領域外迷因，超越了 GPT-4o 等模型。", "author": "Jingbiao Mei et.al.", "authors": "Jingbiao Mei, Jinghong Chen, Guangyu Yang, Weizhe Lin, Bill Byrne", "id": "2502.13061v1", "paper_url": "http://arxiv.org/abs/2502.13061v1", "repo": "null"}}