{"2411.18021": {"publish_time": "2024-11-27", "title": "Can bidirectional encoder become the ultimate winner for downstream applications of foundation models?", "paper_summary": "Over the past few decades, Artificial Intelligence(AI) has progressed from\nthe initial machine learning stage to the deep learning stage, and now to the\nstage of foundational models. Foundational models have the characteristics of\npre-training, transfer learning, and self-supervised learning, and pre-trained\nmodels can be fine-tuned and applied to various downstream tasks. Under the\nframework of foundational models, models such as Bidirectional Encoder\nRepresentations from Transformers(BERT) and Generative Pre-trained\nTransformer(GPT) have greatly advanced the development of natural language\nprocessing(NLP), especially the emergence of many models based on BERT. BERT\nbroke through the limitation of only using one-way methods for language\nmodeling in pre-training by using a masked language model. It can capture\nbidirectional context information to predict the masked words in the sequence,\nthis can improve the feature extraction ability of the model. This makes the\nmodel very useful for downstream tasks, especially for specialized\napplications. The model using the bidirectional encoder can better understand\nthe domain knowledge and be better applied to these downstream tasks. So we\nhope to help understand how this technology has evolved and improved model\nperformance in various natural language processing tasks under the background\nof foundational models and reveal its importance in capturing context\ninformation and improving the model's performance on downstream tasks. This\narticle analyzes one-way and bidirectional models based on GPT and BERT and\ncompares their differences based on the purpose of the model. It also briefly\nanalyzes BERT and the improvements of some models based on BERT. The model's\nperformance on the Stanford Question Answering Dataset(SQuAD) and General\nLanguage Understanding Evaluation(GLUE) was compared.", "paper_summary_zh": "<paragraph>在過去的幾十年中，人工智慧 (AI) 已從最初的機器學習階段進步到深度學習階段，現在進入了基礎模型階段。基礎模型具有預訓練、遷移學習和自監督學習的特徵，並且預訓練模型可以微調並應用於各種下游任務。在基礎模型的框架下，例如 Transformer 的雙向編碼器表示 (BERT) 和生成式預訓練 Transformer (GPT) 等模型已經極大地推動了自然語言處理 (NLP) 的發展，尤其是基於 BERT 的許多模型的出現。BERT 透過使用遮罩語言模型突破了在預訓練中僅使用單向方法進行語言建模的限制。它可以擷取雙向上下文資訊來預測序列中的遮罩字詞，這可以提升模型的特徵提取能力。這使得該模型對於下游任務非常有用，特別是對於專業應用。使用雙向編碼器的模型可以更好地理解領域知識，並更好地應用於這些下游任務。因此，我們希望協助了解在基礎模型的背景下，這項技術如何在各種自然語言處理任務中演進並提升模型效能，並揭示其在擷取上下文資訊和提升模型在下游任務中的效能的重要性。本文基於 GPT 和 BERT 分析單向和雙向模型，並根據模型的目的比較它們的差異。它也簡要分析 BERT 和一些基於 BERT 的模型的改進。比較了該模型在史丹佛問答資料集 (SQuAD) 和通用語言理解評估 (GLUE) 上的效能。</paragraph>", "author": "Lewen Yang et.al.", "authors": "Lewen Yang, Xuanyu Zhou, Juao Fan, Xinyi Xie, Shengxin Zhu", "id": "2411.18021v1", "paper_url": "http://arxiv.org/abs/2411.18021v1", "repo": "null"}}