{"2407.10629": {"publish_time": "2024-07-15", "title": "Balancing the Scales: Reinforcement Learning for Fair Classification", "paper_summary": "Fairness in classification tasks has traditionally focused on bias removal\nfrom neural representations, but recent trends favor algorithmic methods that\nembed fairness into the training process. These methods steer models towards\nfair performance, preventing potential elimination of valuable information that\narises from representation manipulation. Reinforcement Learning (RL), with its\ncapacity for learning through interaction and adjusting reward functions to\nencourage desired behaviors, emerges as a promising tool in this domain. In\nthis paper, we explore the usage of RL to address bias in imbalanced\nclassification by scaling the reward function to mitigate bias. We employ the\ncontextual multi-armed bandit framework and adapt three popular RL algorithms\nto suit our objectives, demonstrating a novel approach to mitigating bias.", "paper_summary_zh": "分類任務中的公平性傳統上專注於消除神經表徵中的偏差，但最近的趨勢偏好將公平性嵌入訓練過程中的演算法方法。這些方法引導模型朝向公平的效能，防止因表徵操作而消除有價值的資訊。強化學習 (RL) 具備透過互動學習和調整獎勵函數以鼓勵所需行為的能力，因此成為此領域中一個有前途的工具。在本文中，我們探討使用 RL 來解決不平衡分類中的偏差，方法是調整獎勵函數以減輕偏差。我們採用情境多重選擇賭博機架構，並調整三種流行的 RL 演算法以符合我們的目標，展示減輕偏差的新穎方法。", "author": "Leon Eshuijs et.al.", "authors": "Leon Eshuijs, Shihan Wang, Antske Fokkens", "id": "2407.10629v1", "paper_url": "http://arxiv.org/abs/2407.10629v1", "repo": "null"}}