{"2501.17598": {"publish_time": "2025-01-29", "title": "Semantic Consistency Regularization with Large Language Models for Semi-supervised Sentiment Analysis", "paper_summary": "Accurate sentiment analysis of texts is crucial for a variety of\napplications, such as understanding customer feedback, monitoring market\ntrends, and detecting public sentiment. However, manually annotating large\nsentiment corpora for supervised learning is labor-intensive and\ntime-consuming. Therefore, it is essential and effective to develop a\nsemi-supervised method for the sentiment analysis task. Although some methods\nhave been proposed for semi-supervised text classification, they rely on the\nintrinsic information within the unlabeled data and the learning capability of\nthe NLP model, which lack generalization ability to the sentiment analysis\nscenario and may prone to overfit. Inspired by the ability of pretrained Large\nLanguage Models (LLMs) in following instructions and generating coherent text,\nwe propose a Semantic Consistency Regularization with Large Language Models\n(SCR) framework for semi-supervised sentiment analysis. We introduce two\nprompting strategies to semantically enhance unlabeled text using LLMs. The\nfirst is Entity-based Enhancement (SCR-EE), which involves extracting entities\nand numerical information, and querying the LLM to reconstruct the textual\ninformation. The second is Concept-based Enhancement (SCR-CE), which directly\nqueries the LLM with the original sentence for semantic reconstruction.\nSubsequently, the LLM-augmented data is utilized for a consistency loss with\nconfidence thresholding, which preserves high-quality agreement samples to\nprovide additional supervision signals during training. Furthermore, to fully\nutilize the uncertain unlabeled data samples, we propose a class re-assembling\nstrategy inspired by the class space shrinking theorem. Experiments show our\nmethod achieves remarkable performance over prior semi-supervised methods.", "paper_summary_zh": "準確的情感分析對於各種應用程式至關重要，例如了解客戶回饋、監控市場趨勢和偵測公眾情緒。然而，手動註解大型情感語料庫以進行監督式學習既費力又費時。因此，開發一種半監督式的情感分析任務方法至關重要且有效。儘管已經提出了一些半監督式文本分類方法，但它們依賴於未標記資料中的內在資訊和 NLP 模型的學習能力，這缺乏對情感分析情境的概括能力，並且可能容易過度擬合。受到預訓練大型語言模型 (LLM) 在遵循說明和生成連貫文本方面的能力的啟發，我們提出了一個具有大型語言模型 (SCR) 的語義一致性正則化框架，用於半監督式情感分析。我們引入了兩種提示策略，以使用 LLM 語義增強未標記文本。第一個是基於實體的增強 (SCR-EE)，它涉及提取實體和數字資訊，並查詢 LLM 以重建文本資訊。第二個是基於概念的增強 (SCR-CE)，它直接查詢具有語義重建功能的原始句子的 LLM。隨後，將 LLM 擴充的資料用於具有信心閾值的稠密損失，這保留了高品質的一致性樣本，以便在訓練期間提供額外的監督訊號。此外，為了充分利用不確定的未標記資料樣本，我們提出了一個類別重新組裝策略，其靈感來自類別空間縮減定理。實驗表明，我們的模型比先前的半監督式方法取得了顯著的效能。", "author": "Kunrong Li et.al.", "authors": "Kunrong Li, Xinyu Liu, Zhen Chen", "id": "2501.17598v1", "paper_url": "http://arxiv.org/abs/2501.17598v1", "repo": "null"}}