{"2412.12912": {"publish_time": "2024-12-17", "title": "Unsupervised Region-Based Image Editing of Denoising Diffusion Models", "paper_summary": "Although diffusion models have achieved remarkable success in the field of\nimage generation, their latent space remains under-explored. Current methods\nfor identifying semantics within latent space often rely on external\nsupervision, such as textual information and segmentation masks. In this paper,\nwe propose a method to identify semantic attributes in the latent space of\npre-trained diffusion models without any further training. By projecting the\nJacobian of the targeted semantic region into a low-dimensional subspace which\nis orthogonal to the non-masked regions, our approach facilitates precise\nsemantic discovery and control over local masked areas, eliminating the need\nfor annotations. We conducted extensive experiments across multiple datasets\nand various architectures of diffusion models, achieving state-of-the-art\nperformance. In particular, for some specific face attributes, the performance\nof our proposed method even surpasses that of supervised approaches,\ndemonstrating its superior ability in editing local image properties.", "paper_summary_zh": "儘管擴散模型在影像生成領域已取得顯著的成功，但其潛在空間仍未被充分探索。目前用於識別潛在空間中語義的方法通常依賴於外部監督，例如文字資訊和分割遮罩。在本文中，我們提出了一種方法，可以在不進一步訓練的情況下識別預先訓練好的擴散模型潛在空間中的語義屬性。透過將目標語義區域的雅可比矩陣投影到與非遮罩區域正交的低維子空間，我們的做法有助於精確發現語義並控制局部遮罩區域，無需註解。我們在多個資料集和各種擴散模型架構上進行了廣泛的實驗，達到了最先進的效能。特別是，對於某些特定的面部屬性，我們提出的方法的效能甚至超越了監督式方法，證明了其在編輯局部影像屬性方面的優異能力。", "author": "Zixiang Li et.al.", "authors": "Zixiang Li, Yue Song, Renshuai Tao, Xiaohong Jia, Yao Zhao, Wei Wang", "id": "2412.12912v1", "paper_url": "http://arxiv.org/abs/2412.12912v1", "repo": "null"}}