{"2406.09402": {"publish_time": "2024-06-13", "title": "Instruct 4D-to-4D: Editing 4D Scenes as Pseudo-3D Scenes Using 2D Diffusion", "paper_summary": "This paper proposes Instruct 4D-to-4D that achieves 4D awareness and\nspatial-temporal consistency for 2D diffusion models to generate high-quality\ninstruction-guided dynamic scene editing results. Traditional applications of\n2D diffusion models in dynamic scene editing often result in inconsistency,\nprimarily due to their inherent frame-by-frame editing methodology. Addressing\nthe complexities of extending instruction-guided editing to 4D, our key insight\nis to treat a 4D scene as a pseudo-3D scene, decoupled into two sub-problems:\nachieving temporal consistency in video editing and applying these edits to the\npseudo-3D scene. Following this, we first enhance the Instruct-Pix2Pix (IP2P)\nmodel with an anchor-aware attention module for batch processing and consistent\nediting. Additionally, we integrate optical flow-guided appearance propagation\nin a sliding window fashion for more precise frame-to-frame editing and\nincorporate depth-based projection to manage the extensive data of pseudo-3D\nscenes, followed by iterative editing to achieve convergence. We extensively\nevaluate our approach in various scenes and editing instructions, and\ndemonstrate that it achieves spatially and temporally consistent editing\nresults, with significantly enhanced detail and sharpness over the prior art.\nNotably, Instruct 4D-to-4D is general and applicable to both monocular and\nchallenging multi-camera scenes. Code and more results are available at\nimmortalco.github.io/Instruct-4D-to-4D.", "paper_summary_zh": "本論文提出 Instruct 4D-to-4D，它為 2D 擴散模型實現了 4D 意識和時空一致性，以產生高品質的指示引導動態場景編輯結果。2D 擴散模型在動態場景編輯中的傳統應用通常會導致不一致，主要是由於它們固有的逐幀編輯方法。為了解決將指示引導編輯擴展到 4D 的複雜性，我們的關鍵見解是將 4D 場景視為偽 3D 場景，分解為兩個子問題：在影片編輯中實現時間一致性，並將這些編輯應用於偽 3D 場景。緊接著，我們首先使用錨點感知注意力模組增強 Instruct-Pix2Pix (IP2P) 模型，以進行批次處理和一致編輯。此外，我們以滑動視窗的方式整合光流引導的外觀傳播，以進行更精確的逐幀編輯，並結合基於深度投影來管理偽 3D 場景的廣泛資料，接著進行反覆編輯以實現收斂。我們廣泛評估了我們的方法在各種場景和編輯指示中的表現，並證明它實現了時空一致的編輯結果，與先前的技術相比，細節和清晰度顯著提升。值得注意的是，Instruct 4D-to-4D 具有通用性，適用於單眼和具有挑戰性的多鏡頭場景。程式碼和更多結果可在 immortalco.github.io/Instruct-4D-to-4D 取得。", "author": "Linzhan Mou et.al.", "authors": "Linzhan Mou, Jun-Kun Chen, Yu-Xiong Wang", "id": "2406.09402v1", "paper_url": "http://arxiv.org/abs/2406.09402v1", "repo": "null"}}