{"2410.18798": {"publish_time": "2024-10-24", "title": "Distill Visual Chart Reasoning Ability from LLMs to MLLMs", "paper_summary": "Solving complex chart Q&A tasks requires advanced visual reasoning abilities\nin multimodal large language models (MLLMs). Recent studies highlight that\nthese abilities consist of two main parts: recognizing key information from\nvisual inputs and conducting reasoning over it. Thus, a promising approach to\nenhance MLLMs is to construct relevant training data focusing on the two\naspects. However, collecting and annotating complex charts and questions is\ncostly and time-consuming, and ensuring the quality of annotated answers\nremains a challenge. In this paper, we propose Code-as-Intermediary Translation\n(CIT), a cost-effective, efficient and easily scalable data synthesis method\nfor distilling visual reasoning abilities from LLMs to MLLMs. The code serves\nas an intermediary that translates visual chart representations into textual\nrepresentations, enabling LLMs to understand cross-modal information.\nSpecifically, we employ text-based synthesizing techniques to construct\nchart-plotting code and produce ReachQA, a dataset containing 3k\nreasoning-intensive charts and 20k Q&A pairs to enhance both recognition and\nreasoning abilities. Experiments show that when fine-tuned with our data,\nmodels not only perform well on chart-related benchmarks, but also demonstrate\nimproved multimodal reasoning abilities on general mathematical benchmarks like\nMathVista. The code and dataset are publicly available at\nhttps://github.com/hewei2001/ReachQA.", "paper_summary_zh": "解決複雜的圖表問答任務需要多模態大型語言模型 (MLLM) 中進階的視覺推理能力。最近的研究強調，這些能力包含兩個主要部分：從視覺輸入中識別關鍵資訊和對其進行推理。因此，增強 MLLM 的一個有前途的方法是建構專注於這兩個方面的相關訓練資料。然而，收集和註解複雜的圖表和問題既昂貴又耗時，而且確保註解答案的品質仍然是一個挑戰。在本文中，我們提出代碼作為中介翻譯 (CIT)，這是一種具成本效益、高效且易於擴充的資料合成方法，用於從 LLM 中萃取視覺推理能力到 MLLM。該代碼作為一個中介，將視覺圖表表示轉換為文字表示，使 LLM 能夠理解跨模態資訊。具體來說，我們採用基於文字的合成技術來建構圖表繪製代碼，並產生 ReachQA，這是一個包含 3k 個推理密集型圖表和 20k 個問答對的資料集，以增強識別和推理能力。實驗表明，當使用我們的資料進行微調時，模型不僅在與圖表相關的基準測試中表現良好，而且在像 MathVista 這樣的通用數學基準測試中也表現出改進的多模態推理能力。代碼和資料集可在 https://github.com/hewei2001/ReachQA 公開取得。", "author": "Wei He et.al.", "authors": "Wei He, Zhiheng Xi, Wanxu Zhao, Xiaoran Fan, Yiwen Ding, Zifei Shan, Tao Gui, Qi Zhang, Xuanjing Huang", "id": "2410.18798v1", "paper_url": "http://arxiv.org/abs/2410.18798v1", "repo": "https://github.com/hewei2001/reachqa"}}