{"2407.10768": {"publish_time": "2024-07-15", "title": "MSegRNN:Enhanced SegRNN Model with Mamba for Long-Term Time Series Forecasting", "paper_summary": "The field of long-term time series forecasting demands handling extensive\nlook-back windows and long-range prediction steps, posing significant\nchallenges for RNN-based methodologies. Among these, SegRNN, a robust\nRNN-driven model, has gained considerable attention in LTSF analysis for\nachieving state-of-the-art results while maintaining a remarkably streamlined\narchitecture. Concurrently, the Mamba structure has demonstrated its advantages\nin small to medium-sized models due to its capability for information\nselection. This study introduces a variant of SegRNN that preprocesses\ninformation using a fine-tuned single-layer Mamba structure. Additionally, it\nincorporates implicit segmentation and residual structures into the model's\nencoding section to further reduce the inherent data iterative cycles of RNN\narchitectures and implicitly integrate inter-channel correlations. This\nvariant, named MSegRNN, utilizes the Mamba structure to select useful\ninformation, resulting in a transformed sequence. The linear-strategy-adapted\nderivative retains the superior memory efficiency of the original SegRNN while\ndemonstrating enhanced performance. Empirical evaluations on real-world LTSF\ndatasets demonstrate the superior performance of our model, thereby\ncontributing to the advancement of LTSF methodologies.", "paper_summary_zh": "長期時間序列預測領域需要處理廣泛的回顧窗口和長程預測步驟，為基於 RNN 的方法論帶來了重大挑戰。其中，SegRNN 是一個強大的 RNN 驅動模型，在 LTSF 分析中獲得了相當大的關注，因為它在保持非常簡化的架構的同時實現了最先進的結果。同時，Mamba 結構由於其信息選擇能力而在中小型模型中展示了其優勢。本研究引入了一個 SegRNN 變體，它使用微調的單層 Mamba 結構預處理信息。此外，它將隱式分段和殘差結構整合到模型的編碼部分，以進一步減少 RNN 架構的固有數據迭代週期，並隱式整合通道間關聯。這個變體，名為 MSegRNN，利用 Mamba 結構選擇有用的信息，從而產生轉換後的序列。線性策略適應的導數保留了原始 SegRNN 的優越內存效率，同時展示了增強的性能。對真實世界 LTSF 數據集的實證評估證明了我們模型的優越性能，從而推動了 LTSF 方法論的進步。", "author": "GaoXiang Zhao et.al.", "authors": "GaoXiang Zhao, XiaoQiang Wang", "id": "2407.10768v1", "paper_url": "http://arxiv.org/abs/2407.10768v1", "repo": "null"}}