{"2407.09437": {"publish_time": "2024-07-12", "title": "Let Me DeCode You: Decoder Conditioning with Tabular Data", "paper_summary": "Training deep neural networks for 3D segmentation tasks can be challenging,\noften requiring efficient and effective strategies to improve model\nperformance. In this study, we introduce a novel approach, DeCode, that\nutilizes label-derived features for model conditioning to support the decoder\nin the reconstruction process dynamically, aiming to enhance the efficiency of\nthe training process. DeCode focuses on improving 3D segmentation performance\nthrough the incorporation of conditioning embedding with learned numerical\nrepresentation of 3D-label shape features. Specifically, we develop an\napproach, where conditioning is applied during the training phase to guide the\nnetwork toward robust segmentation. When labels are not available during\ninference, our model infers the necessary conditioning embedding directly from\nthe input data, thanks to a feed-forward network learned during the training\nphase. This approach is tested using synthetic data and cone-beam computed\ntomography (CBCT) images of teeth. For CBCT, three datasets are used: one\npublicly available and two in-house. Our results show that DeCode significantly\noutperforms traditional, unconditioned models in terms of generalization to\nunseen data, achieving higher accuracy at a reduced computational cost. This\nwork represents the first of its kind to explore conditioning strategies in 3D\ndata segmentation, offering a novel and more efficient method for leveraging\nannotated data. Our code, pre-trained models are publicly available at\nhttps://github.com/SanoScience/DeCode .", "paper_summary_zh": "訓練深度神經網路進行 3D 分割任務可能具有挑戰性，\n通常需要有效且高效的策略來提升模型\n效能。在本研究中，我們提出一個新穎的 DeCode 方法，它\n利用標籤衍生的特徵進行模型調整，以動態支援解碼器\n在重建過程中的功能，目標是提升訓練過程的效率。DeCode 專注於透過結合調整嵌入與學習到的 3D 標籤形狀特徵的數值表示，來提升 3D 分割效能。具體來說，我們開發一種方法，在訓練階段套用調整，以引導\n網路朝向穩健的分割。當在推論期間沒有標籤時，我們的模型會直接從\n輸入資料推論必要的調整嵌入，這要歸功於在訓練\n階段學習到的前饋網路。這種方法使用合成資料和牙齒的錐狀束電腦斷層掃描 (CBCT) 影像進行測試。對於 CBCT，使用了三個資料集：一個公開的資料集和兩個內部資料集。我們的結果顯示，在未見過資料的概化方面，DeCode 明顯優於傳統的未調整模型，在降低運算成本的情況下達成更高的準確度。這項工作代表了探索 3D 資料分割中的調整策略的首例，提供一種新穎且更有效率的方法來利用標註資料。我們的程式碼和預先訓練的模型已公開在\nhttps://github.com/SanoScience/DeCode。", "author": "Tomasz Szczepański et.al.", "authors": "Tomasz Szczepański, Michal K. Grzeszczyk, Szymon Płotka, Arleta Adamowicz, Piotr Fudalej, Przemysław Korzeniowski, Tomasz Trzciński, Arkadiusz Sitek", "id": "2407.09437v1", "paper_url": "http://arxiv.org/abs/2407.09437v1", "repo": "https://github.com/sanoscience/decode"}}