{"2408.09646": {"publish_time": "2024-08-19", "title": "Debiased Contrastive Representation Learning for Mitigating Dual Biases in Recommender Systems", "paper_summary": "In recommender systems, popularity and conformity biases undermine\nrecommender effectiveness by disproportionately favouring popular items,\nleading to their over-representation in recommendation lists and causing an\nunbalanced distribution of user-item historical data. We construct a causal\ngraph to address both biases and describe the abstract data generation\nmechanism. Then, we use it as a guide to develop a novel Debiased Contrastive\nLearning framework for Mitigating Dual Biases, called DCLMDB. In DCLMDB, both\npopularity bias and conformity bias are handled in the model training process\nby contrastive learning to ensure that user choices and recommended items are\nnot unduly influenced by conformity and popularity. Extensive experiments on\ntwo real-world datasets, Movielens-10M and Netflix, show that DCLMDB can\neffectively reduce the dual biases, as well as significantly enhance the\naccuracy and diversity of recommendations.", "paper_summary_zh": "在推薦系統中，流行度和從眾偏差會透過不成比例地偏好熱門項目來破壞推薦效果，導致熱門項目在推薦清單中過度呈現，造成使用者與項目歷史資料分佈不平衡。我們建構一個因果圖來處理這兩種偏差，並描述抽象的資料產生機制。然後，我們利用它作為指南來開發一個新穎的減輕雙重偏差的對比式學習框架，稱為 DCLMDB。在 DCLMDB 中，流行度偏差和從眾偏差都會在模型訓練過程中透過對比式學習來處理，以確保使用者選擇和推薦項目不會受到從眾和流行度的過度影響。在兩個真實世界資料集 Movielens-10M 和 Netflix 上進行的大量實驗顯示，DCLMDB 可以有效地減少雙重偏差，並顯著提高推薦的準確性和多樣性。", "author": "Zhirong Huang et.al.", "authors": "Zhirong Huang, Shichao Zhang, Debo Cheng, Jiuyong Li, Lin Liu, Guixian Zhang", "id": "2408.09646v1", "paper_url": "http://arxiv.org/abs/2408.09646v1", "repo": "null"}}