{"2502.13767": {"publish_time": "2025-02-19", "title": "AI Software Engineer: Programming with Trust", "paper_summary": "Large Language Models (LLMs) have shown surprising proficiency in generating\ncode snippets, promising to automate large parts of software engineering via\nartificial intelligence (AI). We argue that successfully deploying AI software\nengineers requires a level of trust equal to or even greater than the trust\nestablished by human-driven software engineering practices. The recent trend\ntoward LLM agents offers a path toward integrating the power of LLMs to create\nnew code with the power of analysis tools to increase trust in the code. This\nopinion piece comments on whether LLM agents could dominate software\nengineering workflows in the future and whether the focus of programming will\nshift from programming at scale to programming with trust.", "paper_summary_zh": "大型語言模型 (LLM) 在產生程式碼片段方面展現出驚人的能力，承諾透過人工智慧 (AI) 自動化軟體工程的大部分。我們認為，成功部署 AI 軟體工程師需要與人為驅動的軟體工程實務建立的信任程度相同甚至更高的信任水準。最近朝向 LLM 代理人的趨勢提供了一條路徑，可以整合 LLM 的能力，以建立新的程式碼，並利用分析工具的能力來增加對程式碼的信任。這篇意見文章評論了 LLM 代理人是否能在未來主導軟體工程工作流程，以及程式設計的重點是否會從大規模程式設計轉移到建立信任的程式設計。", "author": "Abhik Roychoudhury et.al.", "authors": "Abhik Roychoudhury, Corina Pasareanu, Michael Pradel, Baishakhi Ray", "id": "2502.13767v1", "paper_url": "http://arxiv.org/abs/2502.13767v1", "repo": "null"}}