{"2411.16618": {"publish_time": "2024-11-25", "title": "StructFormer: Document Structure-based Masked Attention and its Impact on Language Model Pre-Training", "paper_summary": "Most state-of-the-art techniques for Language Models (LMs) today rely on\ntransformer-based architectures and their ubiquitous attention mechanism.\nHowever, the exponential growth in computational requirements with longer input\nsequences confines Transformers to handling short passages. Recent efforts have\naimed to address this limitation by introducing selective attention mechanisms,\nnotably local and global attention. While sparse attention mechanisms, akin to\nfull attention in being Turing-complete, have been theoretically established,\ntheir practical impact on pre-training remains unexplored. This study focuses\non empirically assessing the influence of global attention on BERT\npre-training. The primary steps involve creating an extensive corpus of\nstructure-aware text through arXiv data, alongside a text-only counterpart. We\ncarry out pre-training on these two datasets, investigate shifts in attention\npatterns, and assess their implications for downstream tasks. Our analysis\nunderscores the significance of incorporating document structure into LM\nmodels, demonstrating their capacity to excel in more abstract tasks, such as\ndocument understanding.", "paper_summary_zh": "現今多數語言模型 (LM) 的最先進技術仰賴於基於轉換器的架構及其普遍的注意力機制。\n然而，隨著輸入序列變長，運算需求呈指數成長，將轉換器限制在處理短篇章節。最近的努力旨在透過引入選擇性注意力機制來解決此限制，特別是局部和全局注意力。雖然稀疏注意力機制類似於在圖靈完備性中的完整注意力，已在理論上建立，但其對預訓練的實際影響仍未探討。本研究專注於經驗評估全局注意力對 BERT 預訓練的影響。主要步驟包括透過 arXiv 資料建立廣泛的結構感知文字語料庫，以及純文字對應版本。我們對這兩個資料集進行預訓練，探討注意力模式的轉變，並評估其對下游任務的影響。我們的分析強調將文件結構納入 LM 模型的重要性，證明其在更抽象任務（例如文件理解）中表現優異的能力。", "author": "Kaustubh Ponkshe et.al.", "authors": "Kaustubh Ponkshe, Venkatapathy Subramanian, Natwar Modani, Ganesh Ramakrishnan", "id": "2411.16618v1", "paper_url": "http://arxiv.org/abs/2411.16618v1", "repo": "null"}}