{"2411.10257": {"publish_time": "2024-11-15", "title": "The Unreasonable Effectiveness of Guidance for Diffusion Models", "paper_summary": "Guidance is an error-correcting technique used to improve the perceptual\nquality of images generated by diffusion models. Typically, the correction is\nachieved by linear extrapolation, using an auxiliary diffusion model that has\nlower performance than the primary model. Using a 2D toy example, we show that\nit is highly beneficial when the auxiliary model exhibits similar errors as the\nprimary one but stronger. We verify this finding in higher dimensions, where we\nshow that competitive generative performance to state-of-the-art guidance\nmethods can be achieved when the auxiliary model differs from the primary one\nonly by having stronger weight regularization. As an independent contribution,\nwe investigate whether upweighting long-range spatial dependencies improves\nvisual fidelity. The result is a novel guidance method, which we call sliding\nwindow guidance (SWG), that guides the primary model with itself by\nconstraining its receptive field. Intriguingly, SWG aligns better with human\npreferences than state-of-the-art guidance methods while requiring neither\ntraining, architectural modifications, nor class conditioning. The code will be\nreleased.", "paper_summary_zh": "指導是一種錯誤修正技術，用於改善擴散模型生成的影像之感知品質。通常，修正會透過線性外推來達成，使用一個輔助擴散模型，其效能低於主要模型。使用一個 2D 玩具範例，我們展示當輔助模型展現與主要模型相似的錯誤，但更強時，會有高度的好處。我們在較高維度中驗證此發現，其中我們展示當輔助模型僅在具有較強的權重正規化時與主要模型不同時，可以達成與現有技術指導方法相競爭的生成效能。作為一個獨立的貢獻，我們探討是否上調長程空間依賴性會改善視覺保真度。結果是一種新穎的指導方法，我們稱之為滑動視窗指導 (SWG)，它透過限制其感受野來使用自身指導主要模型。有趣的是，SWG 比現有技術指導方法更符合人類偏好，同時不需要訓練、架構修改或類別調整。程式碼將會釋出。", "author": "Tim Kaiser et.al.", "authors": "Tim Kaiser, Nikolas Adaloglou, Markus Kollmann", "id": "2411.10257v1", "paper_url": "http://arxiv.org/abs/2411.10257v1", "repo": "null"}}