{"2503.14567": {"publish_time": "2025-03-18", "title": "SpecReX: Explainable AI for Raman Spectroscopy", "paper_summary": "Raman spectroscopy is becoming more common for medical diagnostics with deep\nlearning models being increasingly used to leverage its full potential.\nHowever, the opaque nature of such models and the sensitivity of medical\ndiagnosis together with regulatory requirements necessitate the need for\nexplainable AI tools. We introduce SpecReX, specifically adapted to explaining\nRaman spectra. SpecReX uses the theory of actual causality to rank causal\nresponsibility in a spectrum, quantified by iteratively refining mutated\nversions of the spectrum and testing if it retains the original classification.\nThe explanations provided by SpecReX take the form of a responsibility map,\nhighlighting spectral regions most responsible for the model to make a correct\nclassification. To assess the validity of SpecReX, we create increasingly\ncomplex simulated spectra, in which a \"ground truth\" signal is seeded, to train\na classifier. We then obtain SpecReX explanations and compare the results with\nanother explainability tool. By using simulated spectra we establish that\nSpecReX localizes to the known differences between classes, under a number of\nconditions. This provides a foundation on which we can find the spectral\nfeatures which differentiate disease classes. This is an important first step\nin proving the validity of SpecReX.", "paper_summary_zh": "<paragraph>拉曼光譜學在醫療診斷中越來越普遍，深度學習模型也越來越多地被用於發揮其全部潛力。然而，由於此類模型的不透明性以及醫療診斷的敏感性，加上法規要求，因此需要可解釋的人工智慧工具。我們推出了專門用於解釋拉曼光譜的 SpecReX。SpecReX 使用實際因果關係理論對光譜中的因果責任進行排序，透過迭代優化光譜的突變版本並測試其是否保留原始分類來量化。SpecReX 提供的解釋採用責任圖的形式，突顯出光譜中對模型做出正確分類最為重要的區域。為了評估 SpecReX 的有效性，我們創建了越來越複雜的模擬光譜，其中植入了一個「真實」信號，用於訓練分類器。然後，我們獲得 SpecReX 解釋，並將結果與其他可解釋性工具進行比較。透過使用模擬光譜，我們確定 SpecReX 在許多條件下都能定位到已知的類別差異。這為我們找到區分疾病類別的光譜特徵奠定了基礎。這是證明 SpecReX 有效性的重要第一步。</paragraph>\n", "author": "Nathan Blake et.al.", "authors": "Nathan Blake, David A. Kelly, Akchunya Chanchal, Sarah Kapllani-Mucaj, Geraint Thomas, Hana Chockler", "id": "2503.14567v1", "paper_url": "http://arxiv.org/abs/2503.14567v1", "repo": "null"}}