{"2406.08922": {"publish_time": "2024-06-13", "title": "Navigating the Shadows: Unveiling Effective Disturbances for Modern AI Content Detectors", "paper_summary": "With the launch of ChatGPT, large language models (LLMs) have attracted\nglobal attention. In the realm of article writing, LLMs have witnessed\nextensive utilization, giving rise to concerns related to intellectual property\nprotection, personal privacy, and academic integrity. In response, AI-text\ndetection has emerged to distinguish between human and machine-generated\ncontent. However, recent research indicates that these detection systems often\nlack robustness and struggle to effectively differentiate perturbed texts.\nCurrently, there is a lack of systematic evaluations regarding detection\nperformance in real-world applications, and a comprehensive examination of\nperturbation techniques and detector robustness is also absent. To bridge this\ngap, our work simulates real-world scenarios in both informal and professional\nwriting, exploring the out-of-the-box performance of current detectors.\nAdditionally, we have constructed 12 black-box text perturbation methods to\nassess the robustness of current detection models across various perturbation\ngranularities. Furthermore, through adversarial learning experiments, we\ninvestigate the impact of perturbation data augmentation on the robustness of\nAI-text detectors. We have released our code and data at\nhttps://github.com/zhouying20/ai-text-detector-evaluation.", "paper_summary_zh": "<paragraph>隨著 ChatGPT 的推出，大型語言模型 (LLM) 吸引了全球的關注。在文章寫作領域，LLM 已廣泛使用，引發了與智慧財產權保護、個人隱私和學術誠信相關的疑慮。為了解決這些問題，AI 文字偵測技術應運而生，用以區分人類和機器產生的內容。然而，最近的研究指出，這些偵測系統通常缺乏穩健性，難以有效區分擾動文字。目前，對於實際應用中的偵測效能缺乏系統性的評估，且對擾動技術和偵測器穩健性的全面檢視也付之闕如。為了彌補這個差距，我們的工作模擬了非正式和專業寫作中的真實世界場景，探索了當前偵測器的開箱即用效能。此外，我們構建了 12 種黑盒文字擾動方法，以評估當前偵測模型在各種擾動粒度下的穩健性。進一步地，透過對抗式學習實驗，我們探討了擾動資料擴充對 AI 文字偵測器穩健性的影響。我們已在 https://github.com/zhouying20/ai-text-detector-evaluation/ 發布我們的程式碼和資料。</paragraph>", "author": "Ying Zhou et.al.", "authors": "Ying Zhou, Ben He, Le Sun", "id": "2406.08922v1", "paper_url": "http://arxiv.org/abs/2406.08922v1", "repo": "https://github.com/zhouying20/ai-text-detector-evaluation"}}