{"2407.10810": {"publish_time": "2024-07-15", "title": "FabGPT: An Efficient Large Multimodal Model for Complex Wafer Defect Knowledge Queries", "paper_summary": "Intelligence is key to advancing integrated circuit (IC) fabrication. Recent\nbreakthroughs in Large Multimodal Models (LMMs) have unlocked unparalleled\nabilities in understanding images and text, fostering intelligent fabrication.\nLeveraging the power of LMMs, we introduce FabGPT, a customized IC fabrication\nlarge multimodal model for wafer defect knowledge query. FabGPT manifests\nexpertise in conducting defect detection in Scanning Electron Microscope (SEM)\nimages, performing root cause analysis, and providing expert question-answering\n(Q&A) on fabrication processes. FabGPT matches enhanced multimodal features to\nautomatically detect minute defects under complex wafer backgrounds and reduce\nthe subjectivity of manual threshold settings. Besides, the proposed modulation\nmodule and interactive corpus training strategy embed wafer defect knowledge\ninto the pre-trained model, effectively balancing Q&A queries related to defect\nknowledge and original knowledge and mitigating the modality bias issues.\nExperiments on in-house fab data (SEM-WaD) show that our FabGPT achieves\nsignificant performance improvement in wafer defect detection and knowledge\nquerying.", "paper_summary_zh": "智慧是推進積體電路 (IC) 製造的關鍵。最近大型多模態模型 (LMM) 的突破，開啟了理解影像與文字的無與倫比能力，促進智慧製造。我們運用 LMM 的力量，導入 FabGPT，一個客製化的 IC 製造大型多模態模型，用於晶圓缺陷知識查詢。FabGPT 展現了在掃描式電子顯微鏡 (SEM) 影像中進行缺陷檢測、執行根本原因分析，以及提供製造流程的專家問答 (Q&A) 的專業知識。FabGPT 將增強的多模態特徵與自動偵測複雜晶圓背景下的微小缺陷相結合，並降低手動閾值設定的主觀性。此外，所提出的調變模組和互動語料訓練策略，將晶圓缺陷知識嵌入預訓練模型中，有效平衡與缺陷知識相關的問答查詢與原始知識，並減輕模態偏差問題。在內部晶圓廠資料 (SEM-WaD) 上的實驗顯示，我們的 FabGPT 在晶圓缺陷檢測和知識查詢方面，獲得顯著的效能提升。", "author": "Yuqi Jiang et.al.", "authors": "Yuqi Jiang, Xudong Lu, Qian Jin, Qi Sun, Hanming Wu, Cheng Zhuo", "id": "2407.10810v1", "paper_url": "http://arxiv.org/abs/2407.10810v1", "repo": "null"}}