{"2502.17380": {"publish_time": "2025-02-24", "title": "Low-Rank and Sparse Model Merging for Multi-Lingual Speech Recognition and Translation", "paper_summary": "Language diversity presents a significant challenge in speech-to-text (S2T)\ntasks, such as automatic speech recognition and translation. Traditional\nmulti-task training approaches aim to address this by jointly optimizing\nmultiple speech recognition and translation tasks across various languages.\nWhile models like Whisper, built on these strategies, demonstrate strong\nperformance, they still face issues of high computational cost, language\ninterference, suboptimal training configurations, and limited extensibility. To\novercome these challenges, we introduce LoRS-Merging (low-rank and sparse model\nmerging), a novel technique designed to efficiently integrate models trained on\ndifferent languages or tasks while preserving performance and reducing\ncomputational overhead. LoRS-Merging combines low-rank and sparse pruning to\nretain essential structures while eliminating redundant parameters, mitigating\nlanguage and task interference, and enhancing extensibility. Experimental\nresults across a range of languages demonstrate that LoRS-Merging significantly\noutperforms conventional multi-lingual multi-task training baselines. Our\nfindings suggest that model merging, particularly LoRS-Merging, is a scalable\nand effective complement to traditional multi-lingual training strategies for\nS2T applications.", "paper_summary_zh": "語言的多樣性在語音轉文字 (S2T) 任務中造成重大的挑戰，例如自動語音辨識和翻譯。傳統的多任務訓練方法旨在透過跨語言優化多個語音辨識和翻譯任務來解決這個問題。儘管建立在這些策略上的模型（例如 Whisper）表現強勁，但它們仍面臨高運算成本、語言干擾、次佳訓練組態和有限可擴充性的問題。為了克服這些挑戰，我們引入了 LoRS-Merging（低階和稀疏模型合併），這是一種新穎的技術，旨在有效整合在不同語言或任務上訓練的模型，同時維持效能並降低運算負擔。LoRS-Merging 結合低階和稀疏剪枝，以保留必要的結構，同時消除多餘的參數，減輕語言和任務干擾，並增強可擴充性。跨語言範圍的實驗結果證明，LoRS-Merging 明顯優於傳統的多語言多任務訓練基準。我們的發現表明，模型合併，特別是 LoRS-Merging，是傳統多語言訓練策略的擴充性和有效補充，適用於 S2T 應用程式。", "author": "Qiuming Zhao et.al.", "authors": "Qiuming Zhao, Guangzhi Sun, Chao Zhang, Mingxing Xu, Thomas Fang Zheng", "id": "2502.17380v1", "paper_url": "http://arxiv.org/abs/2502.17380v1", "repo": "null"}}