{"2412.08591": {"publish_time": "2024-12-11", "title": "RoomTour3D: Geometry-Aware Video-Instruction Tuning for Embodied Navigation", "paper_summary": "Vision-and-Language Navigation (VLN) suffers from the limited diversity and\nscale of training data, primarily constrained by the manual curation of\nexisting simulators. To address this, we introduce RoomTour3D, a\nvideo-instruction dataset derived from web-based room tour videos that capture\nreal-world indoor spaces and human walking demonstrations. Unlike existing VLN\ndatasets, RoomTour3D leverages the scale and diversity of online videos to\ngenerate open-ended human walking trajectories and open-world navigable\ninstructions. To compensate for the lack of navigation data in online videos,\nwe perform 3D reconstruction and obtain 3D trajectories of walking paths\naugmented with additional information on the room types, object locations and\n3D shape of surrounding scenes. Our dataset includes $\\sim$100K open-ended\ndescription-enriched trajectories with $\\sim$200K instructions, and 17K\naction-enriched trajectories from 1847 room tour environments. We demonstrate\nexperimentally that RoomTour3D enables significant improvements across multiple\nVLN tasks including CVDN, SOON, R2R, and REVERIE. Moreover, RoomTour3D\nfacilitates the development of trainable zero-shot VLN agents, showcasing the\npotential and challenges of advancing towards open-world navigation.", "paper_summary_zh": "視覺語言導航 (VLN) 受到訓練資料的多樣性和規模限制，這主要是受到現有模擬器手動策劃的約束。為了解決這個問題，我們引入了 RoomTour3D，一個從網路上的房間導覽影片中衍生的影片指令資料集，該資料集擷取了真實世界的室內空間和人類行走示範。與現有的 VLN 資料集不同，RoomTour3D 利用線上影片的規模和多樣性來產生開放式的行走軌跡和開放世界的導航指令。為了彌補線上影片中導航資料的不足，我們執行 3D 重建，並取得行走路徑的 3D 軌跡，並加上房間類型、物件位置和周圍場景的 3D 形狀等額外資訊。我們的資料集包含大約 10 萬個開放式描述豐富的軌跡，其中有大約 20 萬個指令，以及來自 1847 個房間導覽環境的 1 萬 7 千個動作豐富的軌跡。我們透過實驗證明，RoomTour3D 能在多個 VLN 任務中帶來顯著的改善，包括 CVDN、SOON、R2R 和 REVERIE。此外，RoomTour3D 促進了可訓練的零次學習 VLN 代理的開發，展示了邁向開放世界導航的潛力和挑戰。", "author": "Mingfei Han et.al.", "authors": "Mingfei Han, Liang Ma, Kamila Zhumakhanova, Ekaterina Radionova, Jingyi Zhang, Xiaojun Chang, Xiaodan Liang, Ivan Laptev", "id": "2412.08591v1", "paper_url": "http://arxiv.org/abs/2412.08591v1", "repo": "null"}}