{"2407.02820": {"publish_time": "2024-07-03", "title": "Investigating the Contextualised Word Embedding Dimensions Responsible for Contextual and Temporal Semantic Changes", "paper_summary": "Words change their meaning over time as well as in different contexts. The\nsense-aware contextualised word embeddings (SCWEs) such as the ones produced by\nXL-LEXEME by fine-tuning masked langauge models (MLMs) on Word-in-Context (WiC)\ndata attempt to encode such semantic changes of words within the contextualised\nword embedding (CWE) spaces. Despite the superior performance of SCWEs in\ncontextual/temporal semantic change detection (SCD) benchmarks, it remains\nunclear as to how the meaning changes are encoded in the embedding space. To\nstudy this, we compare pre-trained CWEs and their fine-tuned versions on\ncontextual and temporal semantic change benchmarks under Principal Component\nAnalysis (PCA) and Independent Component Analysis (ICA) transformations. Our\nexperimental results reveal several novel insights such as (a) although there\nexist a smaller number of axes that are responsible for semantic changes of\nwords in the pre-trained CWE space, this information gets distributed across\nall dimensions when fine-tuned, and (b) in contrast to prior work studying the\ngeometry of CWEs, we find that PCA to better represent semantic changes than\nICA. Source code is available at https://github.com/LivNLP/svp-dims .", "paper_summary_zh": "隨著時間推移以及在不同語境中，詞彙的意義會發生改變。語義感知的語境化詞彙嵌入 (SCWE)（例如，通過在語境中詞彙 (WiC) 資料上微調遮罩語言模型 (MLM) 所產生的詞彙嵌入）嘗試對語境化詞彙嵌入 (CWE) 空間內的此類語義變化進行編碼。儘管 SCWE 在語境/時態語義變化檢測 (SCD) 基準測試中表現優異，但語義變化是如何在嵌入空間中編碼的，這一點仍然不清楚。為了研究這一點，我們在主成分分析 (PCA) 和獨立成分分析 (ICA) 變換下，比較了預先訓練的 CWE 及其微調版本在語境和時態語義變化基準測試中的表現。我們的實驗結果揭示了幾項新穎的見解，例如 (a) 雖然在預先訓練的 CWE 空間中負責詞彙語義變化的軸較少，但此資訊在微調時會分佈到所有維度；以及 (b) 與之前研究 CWE 幾何形狀的工作相反，我們發現 PCA 比 ICA 更能很好地表示語義變化。原始碼可在 https://github.com/LivNLP/svp-dims 取得。", "author": "Taichi Aida et.al.", "authors": "Taichi Aida, Danushka Bollegala", "id": "2407.02820v1", "paper_url": "http://arxiv.org/abs/2407.02820v1", "repo": "https://github.com/livnlp/svp-dims"}}