{"2406.05496": {"publish_time": "2024-06-08", "title": "Generalist Multimodal AI: A Review of Architectures, Challenges and Opportunities", "paper_summary": "Multimodal models are expected to be a critical component to future advances\nin artificial intelligence. This field is starting to grow rapidly with a surge\nof new design elements motivated by the success of foundation models in natural\nlanguage processing (NLP) and vision. It is widely hoped that further extending\nthe foundation models to multiple modalities (e.g., text, image, video, sensor,\ntime series, graph, etc.) will ultimately lead to generalist multimodal models,\ni.e. one model across different data modalities and tasks. However, there is\nlittle research that systematically analyzes recent multimodal models\n(particularly the ones that work beyond text and vision) with respect to the\nunderling architecture proposed. Therefore, this work provides a fresh\nperspective on generalist multimodal models (GMMs) via a novel architecture and\ntraining configuration specific taxonomy. This includes factors such as\nUnifiability, Modularity, and Adaptability that are pertinent and essential to\nthe wide adoption and application of GMMs. The review further highlights key\nchallenges and prospects for the field and guide the researchers into the new\nadvancements.", "paper_summary_zh": "多模态模型预计将成为人工智能未来发展的关键组成部分。随着自然语言处理 (NLP) 和视觉领域的底层模型取得成功，这一领域开始迅速发展，并涌现出大量受其启发的新设计元素。人们普遍希望，将底层模型进一步扩展到多种模态（例如，文本、图像、视频、传感器、时间序列、图形等）最终将产生通用多模态模型，即一个跨不同数据模态和任务的模型。然而，很少有研究系统地分析最近的多模态模型（特别是那些在文本和视觉之外工作的模型）与其提出的底层架构之间的关系。因此，这项工作通过一种新颖的架构和训练配置特定分类法，为通用多模态模型 (GMM) 提供了一个新的视角。这包括统一性、模块化和适应性等因素，这些因素与 GMM 的广泛采用和应用密切相关且至关重要。该综述进一步强调了该领域的关键挑战和前景，并指导研究人员了解新的进展。", "author": "Sai Munikoti et.al.", "authors": "Sai Munikoti, Ian Stewart, Sameera Horawalavithana, Henry Kvinge, Tegan Emerson, Sandra E Thompson, Karl Pazdernik", "id": "2406.05496v1", "paper_url": "http://arxiv.org/abs/2406.05496v1", "repo": "null"}}