{"2406.19087": {"publish_time": "2024-06-27", "title": "Dimensions underlying the representational alignment of deep neural networks with humans", "paper_summary": "Determining the similarities and differences between humans and artificial\nintelligence is an important goal both in machine learning and cognitive\nneuroscience. However, similarities in representations only inform us about the\ndegree of alignment, not the factors that determine it. Drawing upon recent\ndevelopments in cognitive science, we propose a generic framework for yielding\ncomparable representations in humans and deep neural networks (DNN). Applying\nthis framework to humans and a DNN model of natural images revealed a\nlow-dimensional DNN embedding of both visual and semantic dimensions. In\ncontrast to humans, DNNs exhibited a clear dominance of visual over semantic\nfeatures, indicating divergent strategies for representing images. While\nin-silico experiments showed seemingly-consistent interpretability of DNN\ndimensions, a direct comparison between human and DNN representations revealed\nsubstantial differences in how they process images. By making representations\ndirectly comparable, our results reveal important challenges for\nrepresentational alignment, offering a means for improving their comparability.", "paper_summary_zh": "確定人類和人工智慧之間的相似性和差異，是機器學習和認知神經科學中一個重要的目標。然而，表徵中的相似性僅能告訴我們對齊的程度，而不是決定它的因素。借鑒認知科學的最新發展，我們提出了在人類和深度神經網路（DNN）中產生可比較表徵的通用框架。將這個框架應用於人類和自然影像的 DNN 模型，揭示了視覺和語義維度的低維 DNN 嵌入。與人類相反，DNN 表現出視覺明顯優於語義特徵，表明表徵影像的不同策略。雖然電腦模擬實驗顯示 DNN 維度的可解釋性看似一致，但人類和 DNN 表徵之間的直接比較揭示了他們在處理影像方式上的重大差異。透過讓表徵直接可比較，我們的結果揭示了表徵對齊的重要挑戰，提供了一種改善其可比較性的方法。", "author": "Florian P. Mahner et.al.", "authors": "Florian P. Mahner, Lukas Muttenthaler, Umut Güçlü, Martin N. Hebart", "id": "2406.19087v1", "paper_url": "http://arxiv.org/abs/2406.19087v1", "repo": "https://github.com/florianmahner/object-dimensions"}}