{"2405.14769": {"publish_time": "2024-05-23", "title": "Pragmatic Feature Preferences: Learning Reward-Relevant Preferences from Human Input", "paper_summary": "Humans use social context to specify preferences over behaviors, i.e. their\nreward functions. Yet, algorithms for inferring reward models from preference\ndata do not take this social learning view into account. Inspired by pragmatic\nhuman communication, we study how to extract fine-grained data regarding why an\nexample is preferred that is useful for learning more accurate reward models.\nWe propose to enrich binary preference queries to ask both (1) which features\nof a given example are preferable in addition to (2) comparisons between\nexamples themselves. We derive an approach for learning from these\nfeature-level preferences, both for cases where users specify which features\nare reward-relevant, and when users do not. We evaluate our approach on linear\nbandit settings in both vision- and language-based domains. Results support the\nefficiency of our approach in quickly converging to accurate rewards with fewer\ncomparisons vs. example-only labels. Finally, we validate the real-world\napplicability with a behavioral experiment on a mushroom foraging task. Our\nfindings suggest that incorporating pragmatic feature preferences is a\npromising approach for more efficient user-aligned reward learning.", "paper_summary_zh": "人類使用社會脈絡來指定對行為的偏好，即他們的獎勵功能。然而，從偏好資料推論獎勵模型的演算法並未考量這種社會學習觀點。受務實人類溝通的啟發，我們研究如何提取有關為何偏好範例的細微資料，這對於學習更準確的獎勵模型很有用。我們建議豐富二元偏好查詢，以詢問 (1) 給定範例的哪些特徵較佳，以及 (2) 範例之間的比較。我們推導出從這些特徵層級偏好學習的方法，適用於使用者指定哪些特徵與獎勵相關的情況，以及使用者未指定的情況。我們在基於視覺和語言的領域中，針對線性賭博機設定評估我們的做法。結果支持我們的方法在使用較少比較次數的情況下，能快速收斂到準確的獎勵，相較於僅範例標籤。最後，我們透過蘑菇覓食任務的行為實驗，驗證了其在現實世界的適用性。我們的研究結果表明，納入務實特徵偏好是一種有前途的做法，可以更有效率地進行使用者對齊的獎勵學習。", "author": "Andi Peng et.al.", "authors": "Andi Peng, Yuying Sun, Tianmin Shu, David Abel", "id": "2405.14769v1", "paper_url": "http://arxiv.org/abs/2405.14769v1", "repo": "null"}}