{"2409.03377": {"publish_time": "2024-09-05", "title": "Real-time Speech Enhancement on Raw Signals with Deep State-space Modeling", "paper_summary": "We present aTENNuate, a simple deep state-space autoencoder configured for\nefficient online raw speech enhancement in an end-to-end fashion. The network's\nperformance is primarily evaluated on raw speech denoising, with additional\nassessments on tasks such as super-resolution and de-quantization. We benchmark\naTENNuate on the VoiceBank + DEMAND and the Microsoft DNS1 synthetic test sets.\nThe network outperforms previous real-time denoising models in terms of PESQ\nscore, parameter count, MACs, and latency. Even as a raw waveform processing\nmodel, the model maintains high fidelity to the clean signal with minimal\naudible artifacts. In addition, the model remains performant even when the\nnoisy input is compressed down to 4000Hz and 4 bits, suggesting general speech\nenhancement capabilities in low-resource environments. Code is available at\ngithub.com/Brainchip-Inc/aTENNuate", "paper_summary_zh": "我們提出 aTENNuate，一個簡單的深度狀態空間自動編碼器，配置為以端對端的方式進行有效的線上原始語音增強。網路的效能主要評估在原始語音去噪上，並針對超解析度和去量化等任務進行額外的評估。我們在 VoiceBank + DEMAND 和 Microsoft DNS1 合成測試集上對 aTENNuate 進行基準測試。網路在 PESQ 分數、參數計數、MAC 和延遲方面優於先前的即時去噪模型。即使作為原始波形處理模型，該模型仍能以最小的可聽人工製品保持對乾淨訊號的高保真度。此外，即使在嘈雜的輸入被壓縮到 4000Hz 和 4 位元時，該模型仍能保持效能，這表明在低資源環境中具有一般性的語音增強能力。程式碼可在 github.com/Brainchip-Inc/aTENNuate 取得", "author": "Yan Ru Pei et.al.", "authors": "Yan Ru Pei, Ritik Shrivastava, FNU Sidharth", "id": "2409.03377v2", "paper_url": "http://arxiv.org/abs/2409.03377v2", "repo": "https://github.com/Brainchip-Inc/aTENNuate"}}