{"2410.05450": {"publish_time": "2024-10-07", "title": "AI-Driven Early Mental Health Screening with Limited Data: Analyzing Selfies of Pregnant Women", "paper_summary": "Major Depressive Disorder and anxiety disorders affect millions globally,\ncontributing significantly to the burden of mental health issues. Early\nscreening is crucial for effective intervention, as timely identification of\nmental health issues can significantly improve treatment outcomes. Artificial\nintelligence (AI) can be valuable for improving the screening of mental\ndisorders, enabling early intervention and better treatment outcomes. AI-driven\nscreening can leverage the analysis of multiple data sources, including facial\nfeatures in digital images. However, existing methods often rely on controlled\nenvironments or specialized equipment, limiting their broad applicability. This\nstudy explores the potential of AI models for ubiquitous depression-anxiety\nscreening given face-centric selfies. The investigation focuses on high-risk\npregnant patients, a population that is particularly vulnerable to mental\nhealth issues. To cope with limited training data resulting from our clinical\nsetup, pre-trained models were utilized in two different approaches:\nfine-tuning convolutional neural networks (CNNs) originally designed for facial\nexpression recognition and employing vision-language models (VLMs) for\nzero-shot analysis of facial expressions. Experimental results indicate that\nthe proposed VLM-based method significantly outperforms CNNs, achieving an\naccuracy of 77.6% and an F1-score of 56.0%. Although there is significant room\nfor improvement, the results suggest that VLMs can be a promising approach for\nmental health screening, especially in scenarios with limited data.", "paper_summary_zh": "重度憂鬱症和焦慮症影響全球數百萬人，\n對心理健康問題的負擔有顯著的影響。早期\n篩檢對於有效干預至關重要，因為及時識別\n心理健康問題可以顯著改善治療結果。人工\n智慧 (AI) 可以為改善心理疾病的篩檢提供有價值的幫助，\n實現早期干預和更好的治療結果。AI 驅動的\n篩檢可以利用多個數據來源的分析，包括數位影像中的臉部\n特徵。然而，現有方法通常依賴受控\n環境或專業設備，限制了它們的廣泛適用性。本\n研究探討 AI 模型在無所不在的憂鬱症焦慮症\n篩檢中，以臉部為中心的自拍的潛力。調查重點關注高風險\n孕婦，這是一個特別容易受到心理健康問題影響的人群。為了應對因我們的臨床\n設置而產生的有限訓練資料，預先訓練的模型被用於兩種不同的方法：\n微調原本設計用於臉部表情辨識的卷積神經網路 (CNN)，並採用視覺語言模型 (VLM) 進行\n零次學習的臉部表情分析。實驗結果表明\n提出的基於 VLM 的方法顯著優於 CNN，達到 77.6% 的準確率和 56.0% 的 F1 分數。儘管有顯著的改進空間，\n結果表明 VLM 可以成為心理健康篩檢的一種有前途的方法，特別是在資料有限的情況下。", "author": "Gustavo A. Basílio et.al.", "authors": "Gustavo A. Basílio, Thiago B. Pereira, Alessandro L. Koerich, Ludmila Dias, Maria das Graças da S. Teixeira, Rafael T. Sousa, Wilian H. Hisatugu, Amanda S. Mota, Anilton S. Garcia, Marco Aurélio K. Galletta, Hermano Tavares, Thiago M. Paixão", "id": "2410.05450v1", "paper_url": "http://arxiv.org/abs/2410.05450v1", "repo": "null"}}