{"2502.10341": {"publish_time": "2025-02-14", "title": "Organize the Web: Constructing Domains Enhances Pre-Training Data Curation", "paper_summary": "Modern language models are trained on large, unstructured datasets consisting\nof trillions of tokens and obtained by crawling the web. The unstructured\nnature makes it difficult to reason about their contents and develop systematic\napproaches to data curation. In this paper, we unpack monolithic web corpora by\ndeveloping taxonomies of their contents and organizing them into domains. We\nintroduce WebOrganizer, a framework for organizing web pages in terms of both\ntheir topic and format. Using these two complementary notions of domains, we\nautomatically annotate pre-training data by distilling annotations from a large\nlanguage model into efficient classifiers. This allows us to study how data\nfrom different domains should be mixed to improve models on downstream tasks,\nand we show that we can combine insights about effective topics and formats to\nfurther boost performance. We demonstrate that our domain mixing also improves\nexisting methods that select data based on quality. Furthermore, we study and\ncompare how quality-based methods will implicitly change the domain mixture.\nOverall, our work demonstrates that constructing and mixing domains provides a\nvaluable complement to quality-based data curation methods, opening new avenues\nfor effective and insightful pre-training data curation.", "paper_summary_zh": "現代語言模型在龐大且非結構化的資料集上進行訓練，這些資料集包含數兆個符號，並透過網路爬蟲取得。非結構化的本質使得難以推論其內容並開發系統性的資料整理方法。在本文中，我們透過開發其內容的分類法並將它們組織成網域，來解構單一網路語料庫。我們介紹 WebOrganizer，一個用於組織網頁的架構，同時考量它們的主題和格式。使用這兩個網域互補概念，我們透過從大型語言模型中萃取註解到高效分類器中，自動註解預訓練資料。這讓我們得以研究如何混合來自不同網域的資料，以改善下游任務的模型，並且我們展示我們可以結合關於有效主題和格式的見解，以進一步提升效能。我們證明我們的網域混合也改善了基於品質選擇資料的現有方法。此外，我們研究並比較基於品質的方法將如何隱含地改變網域混合。整體而言，我們的研究證明建構和混合網域，為基於品質的資料整理方法提供了有價值的補充，為有效且有見地的預訓練資料整理開啟了新途徑。", "author": "Alexander Wettig et.al.", "authors": "Alexander Wettig, Kyle Lo, Sewon Min, Hannaneh Hajishirzi, Danqi Chen, Luca Soldaini", "id": "2502.10341v1", "paper_url": "http://arxiv.org/abs/2502.10341v1", "repo": "null"}}