{"2404.14443": {"publish_time": "2024-04-20", "title": "Evaluation of Machine Translation Based on Semantic Dependencies and Keywords", "paper_summary": "In view of the fact that most of the existing machine translation evaluation\nalgorithms only consider the lexical and syntactic information, but ignore the\ndeep semantic information contained in the sentence, this paper proposes a\ncomputational method for evaluating the semantic correctness of machine\ntranslations based on reference translations and incorporating semantic\ndependencies and sentence keyword information. Use the language technology\nplatform developed by the Social Computing and Information Retrieval Research\nCenter of Harbin Institute of Technology to conduct semantic dependency\nanalysis and keyword analysis on sentences, and obtain semantic dependency\ngraphs, keywords, and weight information corresponding to keywords. It includes\nall word information with semantic dependencies in the sentence and keyword\ninformation that affects semantic information. Construct semantic association\npairs including word and dependency multi-features. The key semantics of the\nsentence cannot be highlighted in the semantic information extracted through\nsemantic dependence, resulting in vague semantics analysis. Therefore, the\nsentence keyword information is also included in the scope of machine\ntranslation semantic evaluation. To achieve a comprehensive and in-depth\nevaluation of the semantic correctness of sentences, the experimental results\nshow that the accuracy of the evaluation algorithm has been improved compared\nwith similar methods, and it can more accurately measure the semantic\ncorrectness of machine translation.", "paper_summary_zh": "由於現有機器翻譯評估演算法大多僅考慮詞彙和句法資訊，忽略句子中包含的深層語意資訊，本文提出了一種基於參考翻譯，並融合語意依存和句子關鍵字資訊的機器翻譯語意正確性評估計算方法。利用哈爾濱工業大學社會計算與資訊檢索研究中心研發的語言技術平臺，對句子進行語意依存分析和關鍵字分析，得到語意依存圖、關鍵字及關鍵字對應的權重資訊。包含了句子中所有具備語意依存關係的詞彙資訊和影響語意資訊的關鍵字資訊。構建包含詞彙和依存關係多特徵的語意關聯對。通過語意依存提取的語意資訊無法突出句子的關鍵語意，導致語意分析模糊。因此，將句子關鍵字資訊也納入機器翻譯語意評估的範圍內。為了對句子的語意正確性進行全面深入的評估，實驗結果表明，與同類方法相比，該評估演算法的準確率有所提升，能更準確地衡量機器翻譯的語意正確性。", "author": "Kewei Yuan et.al.", "authors": "Kewei Yuan, Qiurong Zhao, Yang Xu, Xiao Zhang, Huansheng Ning", "id": "2404.14443v1", "paper_url": "http://arxiv.org/abs/2404.14443v1", "repo": "null"}}