{"2501.10240": {"publish_time": "2025-01-17", "title": "Challenges and recommendations for Electronic Health Records data extraction and preparation for dynamic prediction modelling in hospitalized patients -- a practical guide", "paper_summary": "Dynamic predictive modeling using electronic health record (EHR) data has\ngained significant attention in recent years. The reliability and\ntrustworthiness of such models depend heavily on the quality of the underlying\ndata, which is largely determined by the stages preceding the model\ndevelopment: data extraction from EHR systems and data preparation. We list\nover forty challenges encountered during these stages and provide actionable\nrecommendations for addressing them. These challenges are organized into four\ncategories: cohort definition, outcome definition, feature engineering, and\ndata cleaning. This list is designed to serve as a practical guide for data\nextraction engineers and researchers, supporting better practices and improving\nthe quality and real-world applicability of dynamic prediction models in\nclinical settings.", "paper_summary_zh": "近年來，使用電子健康記錄 (EHR) 資料的動態預測模型獲得了極大的關注。此類模型的可靠性和可信度在很大程度上取決於基礎資料的品質，而這在很大程度上取決於模型開發之前的階段：從 EHR 系統中提取資料和資料準備。我們列出了這些階段中遇到的四十多項挑戰，並提供了具體可行的建議來解決這些挑戰。這些挑戰分為四類：群組定義、結果定義、特徵工程和資料清理。此清單旨在作為資料提取工程師和研究人員的實用指南，支援更好的實務，並改善動態預測模型在臨床環境中的品質和實際應用性。", "author": "Elena Albu et.al.", "authors": "Elena Albu, Shan Gao, Pieter Stijnen, Frank E. Rademakers, Bas C T van Bussel, Taya Collyer, Tina Hernandez-Boussard, Laure Wynants, Ben Van Calster", "id": "2501.10240v1", "paper_url": "http://arxiv.org/abs/2501.10240v1", "repo": "null"}}