{"2404.06911": {"publish_time": "2024-04-10", "title": "GraSAME: Injecting Token-Level Structural Information to Pretrained Language Models via Graph-guided Self-Attention Mechanism", "paper_summary": "Pretrained Language Models (PLMs) benefit from external knowledge stored in\ngraph structures for various downstream tasks. However, bridging the modality\ngap between graph structures and text remains a significant challenge.\nTraditional methods like linearizing graphs for PLMs lose vital graph\nconnectivity, whereas Graph Neural Networks (GNNs) require cumbersome processes\nfor integration into PLMs. In this work, we propose a novel graph-guided\nself-attention mechanism, GraSAME. GraSAME seamlessly incorporates token-level\nstructural information into PLMs without necessitating additional alignment or\nconcatenation efforts. As an end-to-end, lightweight multimodal module, GraSAME\nfollows a multi-task learning strategy and effectively bridges the gap between\ngraph and textual modalities, facilitating dynamic interactions between GNNs\nand PLMs. Our experiments on the graph-to-text generation task demonstrate that\nGraSAME outperforms baseline models and achieves results comparable to\nstate-of-the-art (SOTA) models on WebNLG datasets. Furthermore, compared to\nSOTA models, GraSAME eliminates the need for extra pre-training tasks to adjust\ngraph inputs and reduces the number of trainable parameters by over 100\nmillion.", "paper_summary_zh": "預訓練語言模型 (PLM) 受益於儲存在圖形結構中的外部知識，以進行各種下游任務。然而，彌合圖形結構與文字之間的模態差距仍然是一項重大挑戰。線性化圖形供 PLM 使用等傳統方法會失去重要的圖形連通性，而圖形神經網路 (GNN) 需要繁瑣的程序才能整合到 PLM 中。在這項工作中，我們提出了一種新穎的圖形導向自注意力機制 GraSAME。GraSAME 將令牌級別的結構資訊無縫整合到 PLM 中，而無需額外的對齊或串聯工作。作為一個端到端的輕量級多模組，GraSAME 遵循多任務學習策略，有效地彌合了圖形和文本模態之間的差距，促進了 GNN 和 PLM 之間的動態互動。我們在圖形到文字生成任務上的實驗表明，GraSAME 優於基準模型，並在 WebNLG 資料集上達到了與最先進 (SOTA) 模型相當的結果。此外，與 SOTA 模型相比，GraSAME 消除了調整圖形輸入所需的額外預訓練任務，並將可訓練參數的數量減少了 1 億以上。", "author": "Shuzhou Yuan et.al.", "authors": "Shuzhou Yuan, Michael Färber", "id": "2404.06911v1", "paper_url": "http://arxiv.org/abs/2404.06911v1", "repo": "null"}}