{"2502.03793": {"publish_time": "2025-02-06", "title": "It's All in The [MASK]: Simple Instruction-Tuning Enables BERT-like Masked Language Models As Generative Classifiers", "paper_summary": "While encoder-only models such as BERT and ModernBERT are ubiquitous in\nreal-world NLP applications, their conventional reliance on task-specific\nclassification heads can limit their applicability compared to decoder-based\nlarge language models (LLMs). In this work, we introduce\nModernBERT-Large-Instruct, a 0.4B-parameter encoder model that leverages its\nmasked language modelling (MLM) head for generative classification. Our\napproach employs an intentionally simple training loop and inference mechanism\nthat requires no heavy pre-processing, heavily engineered prompting, or\narchitectural modifications. ModernBERT-Large-Instruct exhibits strong\nzero-shot performance on both classification and knowledge-based tasks,\noutperforming similarly sized LLMs on MMLU and achieving 93% of Llama3-1B's\nMMLU performance with 60% less parameters. We also demonstrate that, when\nfine-tuned, the generative approach using the MLM head matches or even\nsurpasses traditional classification-head methods across diverse NLU tasks.This\ncapability emerges specifically in models trained on contemporary, diverse data\nmixes, with models trained on lower volume, less-diverse data yielding\nconsiderably weaker performance. Although preliminary, these results\ndemonstrate the potential of using the original generative masked language\nmodelling head over traditional task-specific heads for downstream tasks. Our\nwork suggests that further exploration into this area is warranted,\nhighlighting many avenues for future improvements.", "paper_summary_zh": "<paragraph>雖然只有編碼器的模型，例如 BERT 和 ModernBERT，在真實世界的自然語言處理應用中無所不在，但它們傳統上依賴於特定任務分類標題，與基於解碼器的大型語言模型 (LLM) 相比，它們的適用性可能會受到限制。在這項工作中，我們引入了 ModernBERT-Large-Instruct，一個 0.4B 參數編碼器模型，它利用其遮罩語言建模 (MLM) 標題進行生成分類。我們的做法採用了一個故意簡單的訓練迴圈和推理機制，不需要繁重的預處理、大量設計提示或架構修改。ModernBERT-Large-Instruct 在分類和基於知識的任務上都表現出強大的零次學習性能，在 MMLU 上優於類似大小的 LLM，並以少 60% 的參數實現了 Llama3-1B 的 93% MMLU 性能。我們還證明，在微調時，使用 MLM 標題的生成方法在不同的 NLU 任務中與傳統的分類標題方法相匹配甚至超越它們。這種能力特別出現在訓練於當代、多樣化數據混合的模型中，而訓練於較低容量、較不多樣化的數據的模型則產生相當弱的性能。儘管是初步的，但這些結果證明了在下游任務中使用原始生成遮罩語言建模標題而不是傳統的特定任務標題的潛力。我們的研究表明，有必要進一步探索這個領域，並強調了未來改進的許多途徑。</paragraph>", "author": "Benjamin Clavié et.al.", "authors": "Benjamin Clavié, Nathan Cooper, Benjamin Warner", "id": "2502.03793v1", "paper_url": "http://arxiv.org/abs/2502.03793v1", "repo": "null"}}