{"2406.09044": {"publish_time": "2024-06-13", "title": "MiLoRA: Harnessing Minor Singular Components for Parameter-Efficient LLM Finetuning", "paper_summary": "Efficient finetuning of large language models (LLMs) aims to adapt the LLMs\nwith reduced computation and memory cost. Previous LoRA-based approaches\ninitialize the low-rank matrices with gaussian distribution and zero values,\nwhile keeping the original weight matrices frozen. However, the trainable model\nparameters optimized in an unguided subspace might have interference with the\nwell-learned subspace of the pretrained weight matrix. In this paper, we\npropose MiLoRA, a simple yet effective LLM finetuning approach that only\nupdates the minor singular components of the weight matrix while keeping the\nprinciple singular components frozen. It is observed that the minor matrix\ncorresponds to the noisy or long-tail information, while the principle matrix\ncontains important knowledge. The MiLoRA initializes the low-rank matrices\nwithin a subspace that is orthogonal to the principle matrix, thus the\npretrained knowledge is expected to be well preserved. During finetuning,\nMiLoRA makes the most use of the less-optimized subspace for learning the\nfinetuning dataset. Extensive experiments on commonsense reasoning, math\nreasoning and instruction following benchmarks present the superior performance\nof our method.", "paper_summary_zh": "大型語言模型 (LLM) 的有效微調旨在以降低運算和記憶體成本的方式調整 LLM。先前的基於 LoRA 的方法使用高斯分佈和零值初始化低秩矩陣，同時保持原始權重矩陣凍結。然而，在不受引導的子空間中最佳化的可訓練模型參數可能會與預訓練權重矩陣的良好學習子空間產生干擾。在本文中，我們提出 MiLoRA，這是一種簡單但有效的 LLM 微調方法，僅更新權重矩陣的次要奇異分量，同時保持主要奇異分量凍結。可以觀察到，次要矩陣對應於雜訊或長尾資訊，而主矩陣包含重要知識。MiLoRA 在與主矩陣正交的子空間內初始化低秩矩陣，因此預計預訓練知識將得到很好的保留。在微調過程中，MiLoRA 最充分地利用了次優化的子空間來學習微調資料集。在常識推理、數學推理和指令遵循基準上的廣泛實驗展示了我們方法的優異性能。", "author": "Hanqing Wang et.al.", "authors": "Hanqing Wang, Zeguan Xiao, Yixia Li, Shuo Wang, Guanhua Chen, Yun Chen", "id": "2406.09044v1", "paper_url": "http://arxiv.org/abs/2406.09044v1", "repo": "null"}}