{"2412.02528": {"publish_time": "2024-12-03", "title": "Bias Analysis of AI Models for Undergraduate Student Admissions", "paper_summary": "Bias detection and mitigation is an active area of research in machine\nlearning. This work extends previous research done by the authors to provide a\nrigorous and more complete analysis of the bias found in AI predictive models.\nAdmissions data spanning six years was used to create an AI model to determine\nwhether a given student would be directly admitted into the School of Science\nunder various scenarios at a large urban research university. During this time,\nsubmission of standardized test scores as part of an application became\noptional which led to interesting questions about the impact of standardized\ntest scores on admission decisions. We developed and analyzed AI models to\nunderstand which variables are important in admissions decisions, and how the\ndecision to exclude test scores affects the demographics of the students who\nare admitted. We then evaluated the predictive models to detect and analyze\nbiases these models may carry with respect to three variables chosen to\nrepresent sensitive populations: gender, race, and whether a student was the\nfirst in his or her family to attend college. We also extended our analysis to\nshow that the biases detected were persistent. Finally, we included several\nfairness metrics in our analysis and discussed the uses and limitations of\nthese metrics.", "paper_summary_zh": "偏見偵測和緩解是機器學習研究中的活躍領域。這項工作延伸了作者先前所做的研究，提供了對 AI 預測模型中發現的偏見進行嚴謹且更完整的分析。橫跨六年的入學數據被用於建立 AI 模型，以確定在大型都市研究型大學的各種情況下，特定學生是否會被直接錄取到理學院。在此期間，標準化考試成績的提交成為申請的一部分變得具有選擇性，這引發了關於標準化考試成績對錄取決定的影響的有趣問題。我們開發並分析了 AI 模型，以了解哪些變數在錄取決策中很重要，以及排除考試成績的決定如何影響被錄取學生的統計資料。然後，我們評估預測模型以偵測並分析這些模型可能對代表敏感群體的變數所帶來的偏見：性別、種族，以及學生是否為其家族中第一位就讀大學者。我們也擴展分析以顯示所偵測到的偏見是持續存在的。最後，我們在分析中納入了幾個公平性指標，並討論了這些指標的用途和限制。", "author": "Kelly Van Busum et.al.", "authors": "Kelly Van Busum, Shiaofen Fang", "id": "2412.02528v1", "paper_url": "http://arxiv.org/abs/2412.02528v1", "repo": "null"}}