{"2501.00953": {"publish_time": "2025-01-01", "title": "Incremental Dialogue Management: Survey, Discussion, and Implications for HRI", "paper_summary": "Efforts towards endowing robots with the ability to speak have benefited from\nrecent advancements in NLP, in particular large language models. However, as\npowerful as current models have become, they still operate on sentence or\nmulti-sentence level input, not on the word-by-word input that humans operate\non, affecting the degree of responsiveness that they offer, which is critical\nin situations where humans interact with robots using speech. In this paper, we\nreview the literature on interactive systems that operate incrementally (i.e.,\nat the word level or below it). We motivate the need for incremental systems,\nsurvey incremental modeling of important aspects of dialogue like speech\nrecognition and language generation. Primary focus is on the part of the system\nthat makes decisions, known as the dialogue manager. We find that there is very\nlittle research on incremental dialogue management, offer some requirements for\npractical incremental dialogue management, and the implications of incremental\ndialogue for embodied, robotic platforms.", "paper_summary_zh": "機器人賦予說話能力的努力受益於自然語言處理的最新進展，特別是大語言模型。然而，儘管當前模型已經變得強大，但它們仍然在句子或多句子層級的輸入上運作，而不是人類運作的逐字輸入，這影響了它們提供的響應程度，這在人類使用語音與機器人互動的情況中至關重要。在本文中，我們回顧了以增量方式運作的互動式系統（即在字詞層級或其以下）的文獻。我們激勵了對增量系統的需求，調查了對話重要面向的增量建模，例如語音辨識和語言產生。主要的重點在於系統中做出決策的部分，稱為對話管理員。我們發現對增量對話管理的研究非常少，提供了一些實用增量對話管理的要求，以及增量對話對具體機器人平台的影響。", "author": "Casey Kennington et.al.", "authors": "Casey Kennington, Pierre Lison, David Schlangen", "id": "2501.00953v1", "paper_url": "http://arxiv.org/abs/2501.00953v1", "repo": "null"}}