{"2405.14669": {"publish_time": "2024-05-23", "title": "Efficiency for Free: Ideal Data Are Transportable Representations", "paper_summary": "Data, the seminal opportunity and challenge in modern machine learning,\ncurrently constrains the scalability of representation learning and impedes the\npace of model evolution. Existing paradigms tackle the issue of learning\nefficiency over massive datasets from the perspective of self-supervised\nlearning and dataset distillation independently, while neglecting the untapped\npotential of accelerating representation learning from an intermediate\nstandpoint. In this work, we delve into defining the ideal data properties from\nboth optimization and generalization perspectives. We propose that\nmodel-generated representations, despite being trained on diverse tasks and\narchitectures, converge to a shared linear space, facilitating effective linear\ntransport between models. Furthermore, we demonstrate that these\nrepresentations exhibit properties conducive to the formation of ideal data.\nThe theoretical/empirical insights therein inspire us to propose a\nRepresentation Learning Accelerator (ReLA), which leverages a task- and\narchitecture-agnostic, yet publicly available, free model to form a dynamic\ndata subset and thus accelerate (self-)supervised learning. For instance,\nemploying a CLIP ViT B/16 as a prior model for dynamic data generation,\nReLA-aided BYOL can train a ResNet-50 from scratch with 50% of ImageNet-1K,\nyielding performance surpassing that of training on the full dataset.\nAdditionally, employing a ResNet-18 pre-trained on CIFAR-10 can enhance\nResNet-50 training on 10% of ImageNet-1K, resulting in a 7.7% increase in\naccuracy.", "paper_summary_zh": "<paragraph>資料，在現代機器學習中是開創性的機遇和挑戰，\n目前限制了表徵學習的可擴充性，並阻礙了模型演化的速度。現有的範例從自監督學習和資料集蒸餾的觀點來解決海量資料集上學習效率的問題，同時忽略了從中間立場加速表徵學習的未開發潛力。在這項工作中，我們深入探討從最佳化和概括的觀點定義理想的資料屬性。我們提出模型產生的表徵，儘管是在不同的任務和架構上訓練的，但會收斂到一個共用的線性空間，促進模型之間有效的線性傳輸。此外，我們證明這些表徵表現出有利於形成理想資料的屬性。其中的理論/經驗見解啟發我們提出表徵學習加速器 (ReLA)，它利用任務和架構不可知的，但公開可用的免費模型來形成動態資料子集，從而加速（自我）監督學習。例如，使用 CLIP ViT B/16 作為動態資料生成的先驗模型，ReLA 輔助的 BYOL 可以從頭開始訓練一個 ResNet-50，使用 50% 的 ImageNet-1K，其效能優於在完整資料集上訓練的效能。此外，使用在 CIFAR-10 上預訓練的 ResNet-18 可以增強 ResNet-50 在 10% 的 ImageNet-1K 上的訓練，從而使準確度提高 7.7%。</paragraph>", "author": "Peng Sun et.al.", "authors": "Peng Sun, Yi Jiang, Tao Lin", "id": "2405.14669v1", "paper_url": "http://arxiv.org/abs/2405.14669v1", "repo": "null"}}