{"2406.16728": {"publish_time": "2024-06-24", "title": "CausalMMM: Learning Causal Structure for Marketing Mix Modeling", "paper_summary": "In online advertising, marketing mix modeling (MMM) is employed to predict\nthe gross merchandise volume (GMV) of brand shops and help decision-makers to\nadjust the budget allocation of various advertising channels. Traditional MMM\nmethods leveraging regression techniques can fail in handling the complexity of\nmarketing. Although some efforts try to encode the causal structures for better\nprediction, they have the strict restriction that causal structures are\nprior-known and unchangeable. In this paper, we define a new causal MMM problem\nthat automatically discovers the interpretable causal structures from data and\nyields better GMV predictions. To achieve causal MMM, two essential challenges\nshould be addressed: (1) Causal Heterogeneity. The causal structures of\ndifferent kinds of shops vary a lot. (2) Marketing Response Patterns. Various\nmarketing response patterns i.e., carryover effect and shape effect, have been\nvalidated in practice. We argue that causal MMM needs dynamically discover\nspecific causal structures for different shops and the predictions should\ncomply with the prior known marketing response patterns. Thus, we propose\nCausalMMM that integrates Granger causality in a variational inference\nframework to measure the causal relationships between different channels and\npredict the GMV with the regularization of both temporal and saturation\nmarketing response patterns. Extensive experiments show that CausalMMM can not\nonly achieve superior performance of causal structure learning on synthetic\ndatasets with improvements of 5.7%\\sim 7.1%, but also enhance the GMV\nprediction results on a representative E-commerce platform.", "paper_summary_zh": "在網路廣告中，行銷組合模型 (MMM) 被用來預測品牌商店的商品交易總額 (GMV)，並幫助決策者調整各種廣告頻道的預算分配。傳統的 MMM 方法利用回歸技術，但在處理行銷的複雜性時可能會失敗。儘管有些方法嘗試編碼因果結構以進行更好的預測，但它們有嚴格的限制，即因果結構是事先已知的且不可變更。在本文中，我們定義了一個新的因果 MMM 問題，它會自動從資料中發現可解釋的因果結構，並產生更好的 GMV 預測。為了實現因果 MMM，應解決兩個基本挑戰：(1) 因果異質性。不同類型商店的因果結構差異很大。(2) 行銷反應模式。各種行銷反應模式，例如遞延效應和形狀效應，已在實務中得到驗證。我們認為，因果 MMM 需要動態發現不同商店的特定因果結構，而預測應符合先前已知的行銷反應模式。因此，我們提出 CausalMMM，它將 Granger 因果關係整合到變異推論架構中，以衡量不同管道之間的因果關係，並根據時間和飽和行銷反應模式的正則化來預測 GMV。廣泛的實驗表明，CausalMMM 不僅可以在合成資料集上實現因果結構學習的優異效能，改善幅度為 5.7%～7.1%，還能提升有代表性的電子商務平台上的 GMV 預測結果。", "author": "Chang Gong et.al.", "authors": "Chang Gong, Di Yao, Lei Zhang, Sheng Chen, Wenbin Li, Yueyang Su, Jingping Bi", "id": "2406.16728v1", "paper_url": "http://arxiv.org/abs/2406.16728v1", "repo": "null"}}