{"2502.15218": {"publish_time": "2025-02-21", "title": "ESPnet-SpeechLM: An Open Speech Language Model Toolkit", "paper_summary": "We present ESPnet-SpeechLM, an open toolkit designed to democratize the\ndevelopment of speech language models (SpeechLMs) and voice-driven agentic\napplications. The toolkit standardizes speech processing tasks by framing them\nas universal sequential modeling problems, encompassing a cohesive workflow of\ndata preprocessing, pre-training, inference, and task evaluation. With\nESPnet-SpeechLM, users can easily define task templates and configure key\nsettings, enabling seamless and streamlined SpeechLM development. The toolkit\nensures flexibility, efficiency, and scalability by offering highly\nconfigurable modules for every stage of the workflow. To illustrate its\ncapabilities, we provide multiple use cases demonstrating how competitive\nSpeechLMs can be constructed with ESPnet-SpeechLM, including a 1.7B-parameter\nmodel pre-trained on both text and speech tasks, across diverse benchmarks. The\ntoolkit and its recipes are fully transparent and reproducible at:\nhttps://github.com/espnet/espnet/tree/speechlm.", "paper_summary_zh": "我們推出 ESPnet-SpeechLM，這是一個開放的工具包，旨在民主化語音語言模型 (SpeechLM) 和語音驅動的代理應用程式的開發。此工具包透過將語音處理任務標準化，並將它們設定為通用的序列建模問題，包含資料前處理、預訓練、推論和任務評估的內聚工作流程。有了 ESPnet-SpeechLM，使用者可以輕鬆定義任務範本和設定主要設定，讓 SpeechLM 開發變得無縫且簡化。此工具包透過為工作流程的每個階段提供高度可設定的模組，確保靈活性、效率和可擴充性。為了說明其功能，我們提供了多個使用案例，展示如何使用 ESPnet-SpeechLM 建構具競爭力的 SpeechLM，包括在各種基準上預先訓練的 1.7B 參數模型，涵蓋文字和語音任務。此工具包及其範例在 https://github.com/espnet/espnet/tree/speechlm 完全透明且可重製。", "author": "Jinchuan Tian et.al.", "authors": "Jinchuan Tian, Jiatong Shi, William Chen, Siddhant Arora, Yoshiki Masuyama, Takashi Maekaku, Yihan Wu, Junyi Peng, Shikhar Bharadwaj, Yiwen Zhao, Samuele Cornell, Yifan Peng, Xiang Yue, Chao-Han Huck Yang, Graham Neubig, Shinji Watanabe", "id": "2502.15218v1", "paper_url": "http://arxiv.org/abs/2502.15218v1", "repo": "null"}}