{"2407.02062": {"publish_time": "2024-07-02", "title": "Are Data Augmentation Methods in Named Entity Recognition Applicable for Uncertainty Estimation?", "paper_summary": "This work investigates the impact of data augmentation on confidence\ncalibration and uncertainty estimation in Named Entity Recognition (NER) tasks.\nFor the future advance of NER in safety-critical fields like healthcare and\nfinance, it is essential to achieve accurate predictions with calibrated\nconfidence when applying Deep Neural Networks (DNNs), including Pre-trained\nLanguage Models (PLMs), as a real-world application. However, DNNs are prone to\nmiscalibration, which limits their applicability. Moreover, existing methods\nfor calibration and uncertainty estimation are computational expensive. Our\ninvestigation in NER found that data augmentation improves calibration and\nuncertainty in cross-genre and cross-lingual setting, especially in-domain\nsetting. Furthermore, we showed that the calibration for NER tends to be more\neffective when the perplexity of the sentences generated by data augmentation\nis lower, and that increasing the size of the augmentation further improves\ncalibration and uncertainty.", "paper_summary_zh": "本研究探討資料擴充對命名實體辨識 (NER) 任務中信心校準和不確定性估計的影響。對於 NER 在醫療保健和金融等安全關鍵領域的未來進展而言，在應用深度神經網路 (DNN)，包括預先訓練的語言模型 (PLM)，作為實際應用時，必須達成校準信心和準確預測至關重要。然而，DNN 容易發生校準不佳，這限制了它們的適用性。此外，現有的校準和不確定性估計方法在運算上很昂貴。我們對 NER 的研究發現，資料擴充改善了跨類型和跨語言設定中的校準和不確定性，特別是在領域內設定中。此外，我們證明了當資料擴充產生的句子的困惑度較低時，NER 的校準往往更有效，而且增加擴充大小進一步改善了校準和不確定性。", "author": "Wataru Hashimoto et.al.", "authors": "Wataru Hashimoto, Hidetaka Kamigaito, Taro Watanabe", "id": "2407.02062v1", "paper_url": "http://arxiv.org/abs/2407.02062v1", "repo": "null"}}