{"2406.19545": {"publish_time": "2024-06-27", "title": "Leveraging Machine-Generated Rationales to Facilitate Social Meaning Detection in Conversations", "paper_summary": "We present a generalizable classification approach that leverages Large\nLanguage Models (LLMs) to facilitate the detection of implicitly encoded social\nmeaning in conversations. We design a multi-faceted prompt to extract a textual\nexplanation of the reasoning that connects visible cues to underlying social\nmeanings. These extracted explanations or rationales serve as augmentations to\nthe conversational text to facilitate dialogue understanding and transfer. Our\nempirical results over 2,340 experimental settings demonstrate the significant\npositive impact of adding these rationales. Our findings hold true for\nin-domain classification, zero-shot, and few-shot domain transfer for two\ndifferent social meaning detection tasks, each spanning two different corpora.", "paper_summary_zh": "我們提出了一種可推廣的分類方法，該方法利用大型語言模型 (LLM) 來促進對話中隱含編碼的社會意義的檢測。我們設計了一個多方面的提示，以提取文本說明，說明將可見線索與潛在社會意義聯繫起來的推理。這些提取的解釋或依據作為對話文本的擴充，以促進對話理解和轉移。我們在 2,340 個實驗設置中的實證結果證明了添加這些依據的顯著正面影響。我們的發現對於兩個不同的社會意義檢測任務的領域內分類、零次學習和少量學習領域轉移是成立的，每個任務都跨越兩個不同的語料庫。", "author": "Ritam Dutt et.al.", "authors": "Ritam Dutt, Zhen Wu, Kelly Shi, Divyanshu Sheth, Prakhar Gupta, Carolyn Penstein Rose", "id": "2406.19545v1", "paper_url": "http://arxiv.org/abs/2406.19545v1", "repo": "null"}}