{"2408.10614": {"publish_time": "2024-08-20", "title": "Generalizable Facial Expression Recognition", "paper_summary": "SOTA facial expression recognition (FER) methods fail on test sets that have\ndomain gaps with the train set. Recent domain adaptation FER methods need to\nacquire labeled or unlabeled samples of target domains to fine-tune the FER\nmodel, which might be infeasible in real-world deployment. In this paper, we\naim to improve the zero-shot generalization ability of FER methods on different\nunseen test sets using only one train set. Inspired by how humans first detect\nfaces and then select expression features, we propose a novel FER pipeline to\nextract expression-related features from any given face images. Our method is\nbased on the generalizable face features extracted by large models like CLIP.\nHowever, it is non-trivial to adapt the general features of CLIP for specific\ntasks like FER. To preserve the generalization ability of CLIP and the high\nprecision of the FER model, we design a novel approach that learns sigmoid\nmasks based on the fixed CLIP face features to extract expression features. To\nfurther improve the generalization ability on unseen test sets, we separate the\nchannels of the learned masked features according to the expression classes to\ndirectly generate logits and avoid using the FC layer to reduce overfitting. We\nalso introduce a channel-diverse loss to make the learned masks separated.\nExtensive experiments on five different FER datasets verify that our method\noutperforms SOTA FER methods by large margins. Code is available in\nhttps://github.com/zyh-uaiaaaa/Generalizable-FER.", "paper_summary_zh": "最先進的人臉表情辨識 (FER) 方法在與訓練集有領域差距的測試集中會失敗。最近的領域適應 FER 方法需要取得目標領域的標籤或未標籤樣本，以微調 FER 模型，這在實際部署中可能是不可行的。在本文中，我們旨在僅使用一個訓練集，來提升 FER 方法在不同未見測試集上的零次學習泛化能力。受人類先偵測人臉然後選擇表情特徵的啟發，我們提出一個新穎的 FER 管線，從任何給定的人臉影像中萃取與表情相關的特徵。我們的模型建立在 CLIP 等大型模型萃取出的可泛化人臉特徵之上。然而，要將 CLIP 的一般特徵適應到 FER 等特定任務並不容易。為了保留 CLIP 的泛化能力和 FER 模型的高精度，我們設計了一種新穎的方法，根據固定的 CLIP 人臉特徵學習 sigmoid 遮罩，以萃取表情特徵。為了進一步提升在未見測試集上的泛化能力，我們根據表情類別將學習到的遮罩特徵的通道分開，以直接產生 logit 並避免使用 FC 層來減少過度擬合。我們也引入了一個通道多樣化損失，以使學習到的遮罩分開。在五個不同的 FER 資料集上進行的廣泛實驗驗證了我們的模型比最先進的 FER 方法高出許多。程式碼可在 https://github.com/zyh-uaiaaaa/Generalizable-FER 取得。", "author": "Yuhang Zhang et.al.", "authors": "Yuhang Zhang, Xiuqi Zheng, Chenyi Liang, Jiani Hu, Weihong Deng", "id": "2408.10614v1", "paper_url": "http://arxiv.org/abs/2408.10614v1", "repo": "https://github.com/zyh-uaiaaaa/generalizable-fer"}}