{"2406.02251": {"publish_time": "2024-06-04", "title": "Modeling Emotional Trajectories in Written Stories Utilizing Transformers and Weakly-Supervised Learning", "paper_summary": "Telling stories is an integral part of human communication which can evoke\nemotions and influence the affective states of the audience. Automatically\nmodeling emotional trajectories in stories has thus attracted considerable\nscholarly interest. However, as most existing works have been limited to\nunsupervised dictionary-based approaches, there is no benchmark for this task.\nWe address this gap by introducing continuous valence and arousal labels for an\nexisting dataset of children's stories originally annotated with discrete\nemotion categories. We collect additional annotations for this data and map the\ncategorical labels to the continuous valence and arousal space. For predicting\nthe thus obtained emotionality signals, we fine-tune a DeBERTa model and\nimprove upon this baseline via a weakly supervised learning approach. The best\nconfiguration achieves a Concordance Correlation Coefficient (CCC) of $.8221$\nfor valence and $.7125$ for arousal on the test set, demonstrating the efficacy\nof our proposed approach. A detailed analysis shows the extent to which the\nresults vary depending on factors such as the author, the individual story, or\nthe section within the story. In addition, we uncover the weaknesses of our\napproach by investigating examples that prove to be difficult to predict.", "paper_summary_zh": "講故事是人類溝通中不可或缺的一部分，它能喚起\n情緒並影響聽眾的情感狀態。自動\n對故事中的情緒軌跡建模因此吸引了相當大的\n學術興趣。然而，由於大多數現有作品僅限於\n無監督的基於字典的方法，因此沒有此任務的基準。\n我們通過為原本註解有離散\n情緒類別的兒童故事現有資料集引入連續的效價和喚醒標籤來解決這個差距。我們為此資料收集額外的註解，並將\n分類標籤對應到連續的效價和喚醒空間。為了預測\n由此獲得的情緒信號，我們微調一個 DeBERTa 模型，並\n透過一個弱監督學習方法改進這個基線。最佳\n組態在測試集上達到效價的協同相關係數 (CCC) 為 $.8221$\n和喚醒的 $.7125$，證明了我們提出的方法的效力。詳細的分析顯示了\n結果在多大程度上會根據作者、個別故事或\n故事中的章節等因素而有所不同。此外，我們透過調查證明難以預測的範例來揭露我們\n方法的弱點。", "author": "Lukas Christ et.al.", "authors": "Lukas Christ, Shahin Amiriparian, Manuel Milling, Ilhan Aslan, Björn W. Schuller", "id": "2406.02251v1", "paper_url": "http://arxiv.org/abs/2406.02251v1", "repo": "null"}}