{"2502.02014": {"publish_time": "2025-02-04", "title": "Analytical Lyapunov Function Discovery: An RL-based Generative Approach", "paper_summary": "Despite advances in learning-based methods, finding valid Lyapunov functions\nfor nonlinear dynamical systems remains challenging. Current neural network\napproaches face two main issues: challenges in scalable verification and\nlimited interpretability. To address these, we propose an end-to-end framework\nusing transformers to construct analytical Lyapunov functions (local), which\nsimplifies formal verification, enhances interpretability, and provides\nvaluable insights for control engineers. Our framework consists of a\ntransformer-based trainer that generates candidate Lyapunov functions and a\nfalsifier that verifies candidate expressions and refines the model via\nrisk-seeking policy gradient. Unlike Alfarano et al. (2024), which utilizes\npre-training and seeks global Lyapunov functions for low-dimensional systems,\nour model is trained from scratch via reinforcement learning (RL) and succeeds\nin finding local Lyapunov functions for high-dimensional and non-polynomial\nsystems. Given the analytical nature of the candidates, we employ efficient\noptimization methods for falsification during training and formal verification\ntools for the final verification. We demonstrate the efficiency of our approach\non a range of nonlinear dynamical systems with up to ten dimensions and show\nthat it can discover Lyapunov functions not previously identified in the\ncontrol literature.", "paper_summary_zh": "儘管在基於學習的方法上有進展，但尋找非線性動力系統的有效李亞普諾夫函數仍然具有挑戰性。目前的類神經網路方法面臨兩個主要問題：可擴充驗證的挑戰和有限的可解釋性。為了解決這些問題，我們提出了一個端到端框架，使用轉換器來建構分析李亞普諾夫函數（局部），這簡化了形式驗證、增強了可解釋性，並為控制工程師提供了有價值的見解。我們的框架包含一個基於轉換器的訓練器，用於產生候選李亞普諾夫函數和一個偽證器，用於驗證候選表達式並通過尋求風險的策略梯度改進模型。與 Alfarano 等人（2024）不同，它利用預訓練並為低維系統尋找全局李亞普諾夫函數，我們的模型是通過強化學習（RL）從頭開始訓練的，並成功地為高維和非多項式系統找到了局部李亞普諾夫函數。鑑於候選者的分析性質，我們在訓練期間採用有效的最佳化方法進行偽造，並採用正式驗證工具進行最終驗證。我們在多達十個維度的非線性動力系統上展示了我們方法的效率，並表明它可以發現以前在控制文獻中未識別的李亞普諾夫函數。", "author": "Haohan Zou et.al.", "authors": "Haohan Zou, Jie Feng, Hao Zhao, Yuanyuan Shi", "id": "2502.02014v1", "paper_url": "http://arxiv.org/abs/2502.02014v1", "repo": "null"}}