{"2502.03368": {"publish_time": "2025-02-05", "title": "PalimpChat: Declarative and Interactive AI analytics", "paper_summary": "Thanks to the advances in generative architectures and large language models,\ndata scientists can now code pipelines of machine-learning operations to\nprocess large collections of unstructured data. Recent progress has seen the\nrise of declarative AI frameworks (e.g., Palimpzest, Lotus, and DocETL) to\nbuild optimized and increasingly complex pipelines, but these systems often\nremain accessible only to expert programmers. In this demonstration, we present\nPalimpChat, a chat-based interface to Palimpzest that bridges this gap by\nletting users create and run sophisticated AI pipelines through natural\nlanguage alone. By integrating Archytas, a ReAct-based reasoning agent, and\nPalimpzest's suite of relational and LLM-based operators, PalimpChat provides a\npractical illustration of how a chat interface can make declarative AI\nframeworks truly accessible to non-experts.\n  Our demo system is publicly available online. At SIGMOD'25, participants can\nexplore three real-world scenarios--scientific discovery, legal discovery, and\nreal estate search--or apply PalimpChat to their own datasets. In this paper,\nwe focus on how PalimpChat, supported by the Palimpzest optimizer, simplifies\ncomplex AI workflows such as extracting and analyzing biomedical data.", "paper_summary_zh": "由於生成式架構和大型語言模型的進步，資料科學家現在可以編寫機器學習運算的管線，以處理大量非結構化資料。最近的進展見證了宣告式 AI 框架的興起（例如 Palimpzest、Lotus 和 DocETL），用於建置最佳化且日益複雜的管線，但這些系統通常僅供專家程式設計師使用。在此示範中，我們展示了 PalimpChat，一個基於聊天界面的 Palimpzest，透過讓使用者僅使用自然語言就能建立和執行精密的 AI 管線，來彌合此差距。透過整合基於 ReAct 的推理代理程式 Archytas，以及 Palimpzest 的關係式和基於 LLM 的運算元套件，PalimpChat 提供了一個實用的範例，說明聊天介面如何能讓宣告式 AI 框架真正地供非專家使用。我們的示範系統已公開在線上。在 SIGMOD'25，參與者可以探索三種真實世界的場景——科學發現、法律發現和房地產搜尋——或將 PalimpChat 套用至他們自己的資料集。在本文中，我們專注於 PalimpChat 在 Palimpzest 最佳化器的支援下，如何簡化複雜的 AI 工作流程，例如萃取和分析生物醫學資料。", "author": "Chunwei Liu et.al.", "authors": "Chunwei Liu, Gerardo Vitagliano, Brandon Rose, Matt Prinz, David Andrew Samson, Michael Cafarella", "id": "2502.03368v1", "paper_url": "http://arxiv.org/abs/2502.03368v1", "repo": "null"}}