{"2501.14528": {"publish_time": "2025-01-24", "title": "Idiom Detection in Sorani Kurdish Texts", "paper_summary": "Idiom detection using Natural Language Processing (NLP) is the computerized\nprocess of recognizing figurative expressions within a text that convey\nmeanings beyond the literal interpretation of the words. While idiom detection\nhas seen significant progress across various languages, the Kurdish language\nfaces a considerable research gap in this area despite the importance of idioms\nin tasks like machine translation and sentiment analysis. This study addresses\nidiom detection in Sorani Kurdish by approaching it as a text classification\ntask using deep learning techniques. To tackle this, we developed a dataset\ncontaining 10,580 sentences embedding 101 Sorani Kurdish idioms across diverse\ncontexts. Using this dataset, we developed and evaluated three deep learning\nmodels: KuBERT-based transformer sequence classification, a Recurrent\nConvolutional Neural Network (RCNN), and a BiLSTM model with an attention\nmechanism. The evaluations revealed that the transformer model, the fine-tuned\nBERT, consistently outperformed the others, achieving nearly 99% accuracy while\nthe RCNN achieved 96.5% and the BiLSTM 80%. These results highlight the\neffectiveness of Transformer-based architectures in low-resource languages like\nKurdish. This research provides a dataset, three optimized models, and insights\ninto idiom detection, laying a foundation for advancing Kurdish NLP.", "paper_summary_zh": "慣用語偵測使用自然語言處理 (NLP)，是一種電腦化的程序，用於辨識文字中的比喻表達方式，傳達出超出字面意思的意義。雖然慣用語偵測在各種語言中都有顯著的進展，但庫德語在這個領域卻面臨相當大的研究差距，儘管慣用語在機器翻譯和情緒分析等任務中很重要。本研究透過將慣用語偵測視為一種使用深度學習技術的文字分類任務，來探討索拉尼庫德語中的慣用語偵測。為了解決這個問題，我們開發了一個包含 10,580 個句子的資料集，其中嵌入了 101 個索拉尼庫德語慣用語，涵蓋了各種不同的脈絡。使用這個資料集，我們開發並評估了三個深度學習模型：基於 KuBERT 的 Transformer 序列分類、遞迴卷積神經網路 (RCNN) 和帶有注意力機制的 BiLSTM 模型。評估結果顯示，Transformer 模型、微調後的 BERT，始終優於其他模型，準確率接近 99%，而 RCNN 達到 96.5%，BiLSTM 達到 80%。這些結果突顯了 Transformer-based 架構在低資源語言（如庫德語）中的有效性。本研究提供了一個資料集、三個最佳化模型和對慣用語偵測的見解，為推進庫德語 NLP 奠定了基礎。", "author": "Skala Kamaran Omer et.al.", "authors": "Skala Kamaran Omer, Hossein Hassani", "id": "2501.14528v1", "paper_url": "http://arxiv.org/abs/2501.14528v1", "repo": "null"}}