{"2412.04086": {"publish_time": "2024-12-05", "title": "BodyMetric: Evaluating the Realism of HumanBodies in Text-to-Image Generation", "paper_summary": "Accurately generating images of human bodies from text remains a challenging\nproblem for state of the art text-to-image models. Commonly observed\nbody-related artifacts include extra or missing limbs, unrealistic poses,\nblurred body parts, etc. Currently, evaluation of such artifacts relies heavily\non time-consuming human judgments, limiting the ability to benchmark models at\nscale. We address this by proposing BodyMetric, a learnable metric that\npredicts body realism in images. BodyMetric is trained on realism labels and\nmulti-modal signals including 3D body representations inferred from the input\nimage, and textual descriptions. In order to facilitate this approach, we\ndesign an annotation pipeline to collect expert ratings on human body realism\nleading to a new dataset for this task, namely, BodyRealism. Ablation studies\nsupport our architectural choices for BodyMetric and the importance of\nleveraging a 3D human body prior in capturing body-related artifacts in 2D\nimages. In comparison to concurrent metrics which evaluate general user\npreference in images, BodyMetric specifically reflects body-related artifacts.\nWe demonstrate the utility of BodyMetric through applications that were\npreviously infeasible at scale. In particular, we use BodyMetric to benchmark\nthe generation ability of text-to-image models to produce realistic human\nbodies. We also demonstrate the effectiveness of BodyMetric in ranking\ngenerated images based on the predicted realism scores.", "paper_summary_zh": "<paragraph>從文字準確生成人體影像對現今的文字轉影像模型來說仍是一項具有挑戰性的問題。常見的身體相關人工製品包括多餘或缺少的肢體、不切實際的姿勢、模糊的身體部位等。目前，此類人工製品的評估仰賴耗時的個人判斷，限制了大規模評估模型的能力。我們提出 BodyMetric 來解決這個問題，這是一個可學習的指標，可以預測影像中人體的真實性。BodyMetric 是在真實性標籤和多模式訊號上訓練的，包括從輸入影像推論出的 3D 身體表示和文字描述。為了促進此方法，我們設計了一個註解管道來收集人體真實性的專家評分，從而產生一個新的資料集，也就是 BodyRealism。消融研究支持我們在 BodyMetric 中的架構選擇，以及在捕捉 2D 影像中與身體相關的人工製品時，利用 3D 人體先驗的重要性。與評估影像中一般使用者偏好的同時指標相比，BodyMetric 特別反映了與身體相關的人工製品。我們透過以前無法大規模執行的應用程式，展示了 BodyMetric 的效用。特別是，我們使用 BodyMetric 來評估文字轉影像模型產生逼真人體的能力。我們也展示了 BodyMetric 在根據預測的真實性分數對生成影像進行排名的有效性。</paragraph>", "author": "Nefeli Andreou et.al.", "authors": "Nefeli Andreou, Varsha Vivek, Ying Wang, Alex Vorobiov, Tiffany Deng, Raja Bala, Larry Davis, Betty Mohler Tesch", "id": "2412.04086v1", "paper_url": "http://arxiv.org/abs/2412.04086v1", "repo": "null"}}