{"2501.12067": {"publish_time": "2025-01-21", "title": "EDoRA: Efficient Weight-Decomposed Low-Rank Adaptation via Singular Value Decomposition", "paper_summary": "Parameter-efficient fine-tuning methods, such as LoRA, reduces the number of\ntrainable parameters. However, they often suffer from scalability issues and\ndifferences between their learning pattern and full fine-tuning. To overcome\nthese limitations, we propose Efficient Weight-Decomposed Low-Rank Adaptation\n(EDoRA): a novel PEFT method that decomposes pre-trained weights into magnitude\nand directional components. By freezing low-rank matrices, initializing them by\nsingular value decomposition, and introducing a small trainable matrix between\nthem, EDoRA achieves substantial reduction in trainable parameters while\nmaintaining learning capacity. Experimental results on the GLUE benchmark\ndemonstrate that EDoRA achieves competitive or superior performance compared to\nstate-of-the-art methods, such as LoRA and DoRA, with up to 30x fewer trainable\nparameters. This makes EDoRA a highly efficient solution for adapting LLMs to\ndiverse tasks under memory-constrained settings. Code is available at\nhttps://github.com/Hamid-Nasiri/EDoRA .", "paper_summary_zh": "參數高效微調方法（例如 LoRA）減少了可訓練參數的數量。然而，它們經常會遇到可擴充性問題，而且它們的學習模式與完全微調之間存在差異。為了克服這些限制，我們提出了高效權重分解低秩適應 (EDoRA)：一種將預訓練權重分解為幅度和方向分量的全新 PEFT 方法。透過凍結低秩矩陣、使用奇異值分解對它們進行初始化，並在它們之間引入一個小的可訓練矩陣，EDoRA 實現了可訓練參數的大幅減少，同時維持了學習能力。GLUE 基準上的實驗結果證明，與 LoRA 和 DoRA 等最先進的方法相比，EDoRA 達到了具有競爭力或更優異的效能，可訓練參數減少了多達 30 倍。這使得 EDoRA 成為在記憶體受限設定下將 LLM 適應到各種任務的高效解決方案。程式碼可在 https://github.com/Hamid-Nasiri/EDoRA 取得。", "author": "Hamid Nasiri et.al.", "authors": "Hamid Nasiri, Peter Garraghan", "id": "2501.12067v1", "paper_url": "http://arxiv.org/abs/2501.12067v1", "repo": "https://github.com/hamid-nasiri/edora"}}