{"2501.02572": {"publish_time": "2025-01-05", "title": "Energy Optimization of Multi-task DNN Inference in MEC-assisted XR Devices: A Lyapunov-Guided Reinforcement Learning Approach", "paper_summary": "Extended reality (XR), blending virtual and real worlds, is a key application\nof future networks. While AI advancements enhance XR capabilities, they also\nimpose significant computational and energy challenges on lightweight XR\ndevices. In this paper, we developed a distributed queue model for multi-task\nDNN inference, addressing issues of resource competition and queue coupling. In\nresponse to the challenges posed by the high energy consumption and limited\nresources of XR devices, we designed a dual time-scale joint optimization\nstrategy for model partitioning and resource allocation, formulated as a\nbi-level optimization problem. This strategy aims to minimize the total energy\nconsumption of XR devices while ensuring queue stability and adhering to\ncomputational and communication resource constraints. To tackle this problem,\nwe devised a Lyapunov-guided Proximal Policy Optimization algorithm, named\nLyaPPO. Numerical results demonstrate that the LyaPPO algorithm outperforms the\nbaselines, achieving energy conservation of 24.79% to 46.14% under varying\nresource capacities. Specifically, the proposed algorithm reduces the energy\nconsumption of XR devices by 24.29% to 56.62% compared to baseline algorithms.", "paper_summary_zh": "擴增實境（XR）融合虛擬與真實世界，是未來網路的主要應用。儘管 AI 的進步增強了 XR 的功能，但它們也對輕量級 XR 裝置造成顯著的運算和能源挑戰。在本文中，我們開發了一個用於多任務 DNN 推論的分布式佇列模型，解決了資源競爭和佇列耦合的問題。針對 XR 裝置的高能耗和有限資源所帶來的挑戰，我們設計了一個用於模型分割和資源分配的雙時間尺度聯合最佳化策略，並制定為一個雙層最佳化問題。此策略旨在最小化 XR 裝置的總能耗，同時確保佇列穩定性並遵守運算和通訊資源限制。為了解決這個問題，我們設計了一個名為 LyaPPO 的 Lyapunov 引導近端策略最佳化演算法。數值結果證明，LyaPPO 演算法優於基準，在不同的資源容量下實現 24.79% 至 46.14% 的節能。具體來說，與基準演算法相比，所提出的演算法將 XR 裝置的能耗降低了 24.29% 至 56.62%。", "author": "Yanzan Sun et.al.", "authors": "Yanzan Sun, Jiacheng Qiu, Guangjin Pan, Shugong Xu, Shunqing Zhang, Xiaoyun Wang, Shuangfeng Han", "id": "2501.02572v1", "paper_url": "http://arxiv.org/abs/2501.02572v1", "repo": "null"}}