{"2412.20637": {"publish_time": "2024-12-30", "title": "Knowledge Editing for Large Language Model with Knowledge Neuronal Ensemble", "paper_summary": "As real-world knowledge is constantly evolving, ensuring the timeliness and\naccuracy of a model's knowledge is crucial. This has made knowledge editing in\nlarge language models increasingly important. However, existing knowledge\nediting methods face several challenges, including parameter localization\ncoupling, imprecise localization, and a lack of dynamic interaction across\nlayers. In this paper, we propose a novel knowledge editing method called\nKnowledge Neuronal Ensemble (KNE). A knowledge neuronal ensemble represents a\ngroup of neurons encoding specific knowledge, thus mitigating the issue of\nfrequent parameter modification caused by coupling in parameter localization.\nThe KNE method enhances the precision and accuracy of parameter localization by\ncomputing gradient attribution scores for each parameter at each layer. During\nthe editing process, only the gradients and losses associated with the\nknowledge neuronal ensemble are computed, with error backpropagation performed\naccordingly, ensuring dynamic interaction and collaborative updates among\nparameters. Experimental results on three widely used knowledge editing\ndatasets show that the KNE method significantly improves the accuracy of\nknowledge editing and achieves, or even exceeds, the performance of the best\nbaseline methods in portability and locality metrics.", "paper_summary_zh": "隨著真實世界的知識不斷演變，確保模型知識的及時性和準確性至關重要。這使得大型語言模型中的知識編輯變得越來越重要。然而，現有的知識編輯方法面臨著多項挑戰，包括參數定位耦合、定位不精確以及跨層缺乏動態交互。在本文中，我們提出了一種名為知識神經元集合（KNE）的新型知識編輯方法。知識神經元集合表示一組編碼特定知識的神經元，從而減輕了參數定位中耦合引起的頻繁參數修改問題。KNE方法通過計算每一層的每個參數的梯度歸因分數來提高參數定位的精確度和準確性。在編輯過程中，只計算與知識神經元集合相關的梯度和損失，並相應地執行誤差反向傳播，確保參數之間的動態交互和協作更新。在三個廣泛使用的知識編輯數據集上的實驗結果表明，KNE方法顯著提高了知識編輯的準確性，並且在可移植性和局部性指標方面達到了或甚至超過了最佳基線方法的性能。", "author": "Yongchang Li et.al.", "authors": "Yongchang Li, Yujin Zhu, Tao Yan, Shijian Fan, Gang Wu, Liang Xu", "id": "2412.20637v1", "paper_url": "http://arxiv.org/abs/2412.20637v1", "repo": "null"}}