{"2503.03802": {"publish_time": "2025-03-05", "title": "RiskAgent: Autonomous Medical AI Copilot for Generalist Risk Prediction", "paper_summary": "The application of Large Language Models (LLMs) to various clinical\napplications has attracted growing research attention. However, real-world\nclinical decision-making differs significantly from the standardized,\nexam-style scenarios commonly used in current efforts. In this paper, we\npresent the RiskAgent system to perform a broad range of medical risk\npredictions, covering over 387 risk scenarios across diverse complex diseases,\ne.g., cardiovascular disease and cancer. RiskAgent is designed to collaborate\nwith hundreds of clinical decision tools, i.e., risk calculators and scoring\nsystems that are supported by evidence-based medicine. To evaluate our method,\nwe have built the first benchmark MedRisk specialized for risk prediction,\nincluding 12,352 questions spanning 154 diseases, 86 symptoms, 50 specialties,\nand 24 organ systems. The results show that our RiskAgent, with 8 billion model\nparameters, achieves 76.33% accuracy, outperforming the most recent commercial\nLLMs, o1, o3-mini, and GPT-4.5, and doubling the 38.39% accuracy of GPT-4o. On\nrare diseases, e.g., Idiopathic Pulmonary Fibrosis (IPF), RiskAgent outperforms\no1 and GPT-4.5 by 27.27% and 45.46% accuracy, respectively. Finally, we further\nconduct a generalization evaluation on an external evidence-based diagnosis\nbenchmark and show that our RiskAgent achieves the best results. These\nencouraging results demonstrate the great potential of our solution for diverse\ndiagnosis domains. To improve the adaptability of our model in different\nscenarios, we have built and open-sourced a family of models ranging from 1\nbillion to 70 billion parameters. Our code, data, and models are all available\nat https://github.com/AI-in-Health/RiskAgent.", "paper_summary_zh": "大型語言模型 (LLM) 在各種臨床應用上的應用已引起越來越多的研究關注。然而，現實世界的臨床決策與目前研究工作中常用的標準化、考試型場景大相徑庭。在本文中，我們提出了 RiskAgent 系統，用於執行廣泛的醫療風險預測，涵蓋了 387 多種風險情境，涉及各種複雜疾病，例如心血管疾病和癌症。RiskAgent 設計用於與數百種臨床決策工具（即基於循證醫學的風險計算器和評分系統）協作。為了評估我們的方法，我們構建了第一個專門用於風險預測的基準 MedRisk，其中包含 12,352 個問題，涵蓋 154 種疾病、86 種症狀、50 個專科和 24 個器官系統。結果顯示，我們擁有 80 億模型參數的 RiskAgent 達到了 76.33% 的準確率，優於最新的商業 LLM：o1、o3-mini 和 GPT-4.5，並且是 GPT-4o 準確率 (38.39%) 的兩倍。在罕見疾病（例如特發性肺纖維化 (IPF)）上，RiskAgent 的準確率分別比 o1 和 GPT-4.5 高出 27.27% 和 45.46%。最後，我們在一個外部的循證診斷基準上進一步進行了泛化評估，結果表明我們的 RiskAgent 取得了最佳結果。這些令人鼓舞的結果證明了我們的解決方案在各種診斷領域的巨大潛力。為了提高模型在不同場景下的適應性，我們構建並開源了一系列模型，參數從 10 億到 700 億不等。我們的程式碼、數據和模型都可以在 https://github.com/AI-in-Health/RiskAgent 上找到。\n", "author": "Fenglin Liu et.al.", "authors": "Fenglin Liu, Jinge Wu, Hongjian Zhou, Xiao Gu, Soheila Molaei, Anshul Thakur, Lei Clifton, Honghan Wu, David A. Clifton", "id": "2503.03802v1", "paper_url": "http://arxiv.org/abs/2503.03802v1", "repo": "null"}}