{"2405.12081": {"publish_time": "2024-05-20", "title": "Selective Annotation via Data Allocation: These Data Should Be Triaged to Experts for Annotation Rather Than the Model", "paper_summary": "To obtain high-quality annotations under limited budget, semi-automatic\nannotation methods are commonly used, where a portion of the data is annotated\nby experts and a model is then trained to complete the annotations for the\nremaining data. However, these methods mainly focus on selecting informative\ndata for expert annotations to improve the model predictive ability (i.e.,\ntriage-to-human data), while the rest of the data is indiscriminately assigned\nto model annotation (i.e., triage-to-model data). This may lead to\ninefficiencies in budget allocation for annotations, as easy data that the\nmodel could accurately annotate may be unnecessarily assigned to the expert,\nand hard data may be misclassified by the model. As a result, the overall\nannotation quality may be compromised. To address this issue, we propose a\nselective annotation framework called SANT. It effectively takes advantage of\nboth the triage-to-human and triage-to-model data through the proposed\nerror-aware triage and bi-weighting mechanisms. As such, informative or hard\ndata is assigned to the expert for annotation, while easy data is handled by\nthe model. Experimental results show that SANT consistently outperforms other\nbaselines, leading to higher-quality annotation through its proper allocation\nof data to both expert and model workers. We provide pioneering work on data\nannotation within budget constraints, establishing a landmark for future\ntriage-based annotation studies.", "paper_summary_zh": "為了在有限的預算下取得高品質的註解，通常會使用半自動註解方法，其中一部分資料由專家註解，然後訓練模型來完成其餘資料的註解。然而，這些方法主要著重於選擇具資訊性的資料進行專家註解，以提升模型的預測能力（亦即，分流到人類的資料），而其餘資料則不加區別地分配給模型註解（亦即，分流到模型的資料）。這可能會導致註解預算分配的低效率，因為模型可以準確註解的容易資料可能會不必要地分配給專家，而困難的資料可能會被模型錯誤分類。因此，整體註解品質可能會受到影響。為了解決這個問題，我們提出了一個稱為 SANT 的選擇性註解架構。它有效地利用了分流到人類和分流到模型的資料，透過提出的錯誤感知分流和雙重加權機制。因此，具資訊性或困難的資料會分配給專家進行註解，而容易的資料則由模型處理。實驗結果顯示，SANT 持續優於其他基準，透過適當地將資料分配給專家和模型工作人員，產生更高品質的註解。我們提供了在預算限制下進行資料註解的開創性工作，為未來的基於分流的註解研究建立了一個里程碑。", "author": "Chen Huang et.al.", "authors": "Chen Huang, Yang Deng, Wenqiang Lei, Jiancheng Lv, Ido Dagan", "id": "2405.12081v1", "paper_url": "http://arxiv.org/abs/2405.12081v1", "repo": "null"}}