{"2405.20850": {"publish_time": "2024-05-31", "title": "Improving Reward Models with Synthetic Critiques", "paper_summary": "Reward models (RM) play a critical role in aligning language models through\nthe process of reinforcement learning from human feedback. RMs are trained to\npredict a score reflecting human preference, which requires significant time\nand cost for human annotation. Additionally, RMs tend to quickly overfit on\nsuperficial features in the training set, hindering their generalization\nperformance on unseen distributions. We propose a novel approach using\nsynthetic natural language critiques generated by large language models to\nprovide additional feedback, evaluating aspects such as instruction following,\ncorrectness, and style. This offers richer signals and more robust features for\nRMs to assess and score on. We demonstrate that high-quality critiques improve\nthe performance and data efficiency of RMs initialized from different\npretrained models. Conversely, we also show that low-quality critiques\nnegatively impact performance. Furthermore, incorporating critiques enhances\nthe interpretability and robustness of RM training.", "paper_summary_zh": "獎勵模型（RM）在透過人類回饋的強化學習過程中，對齊語言模型扮演關鍵角色。RM 經過訓練，可預測反映人類偏好的分數，這需要大量時間和成本進行人工註解。此外，RM 傾向於快速過度擬合訓練集中的表面特徵，阻礙其在未見分布上的泛化效能。我們提出一個新穎的方法，使用大型語言模型產生的合成自然語言批評，提供額外的回饋，評估指示遵循、正確性和風格等面向。這為 RM 提供更豐富的訊號和更穩健的特徵，以便評估和評分。我們證明高品質的批評改善了從不同預訓練模型初始化的 RM 的效能和資料效率。相反地，我們也顯示低品質的批評對效能產生負面影響。此外，納入批評可增強 RM 訓練的可解釋性和穩健性。", "author": "Zihuiwen Ye et.al.", "authors": "Zihuiwen Ye, Fraser Greenlee-Scott, Max Bartolo, Phil Blunsom, Jon Ander Campos, Matthias Gallé", "id": "2405.20850v1", "paper_url": "http://arxiv.org/abs/2405.20850v1", "repo": "null"}}