{"2407.03125": {"publish_time": "2024-07-03", "title": "Foundations and Frontiers of Graph Learning Theory", "paper_summary": "Recent advancements in graph learning have revolutionized the way to\nunderstand and analyze data with complex structures. Notably, Graph Neural\nNetworks (GNNs), i.e. neural network architectures designed for learning graph\nrepresentations, have become a popular paradigm. With these models being\nusually characterized by intuition-driven design or highly intricate\ncomponents, placing them within the theoretical analysis framework to distill\nthe core concepts, helps understand the key principles that drive the\nfunctionality better and guide further development. Given this surge in\ninterest, this article provides a comprehensive summary of the theoretical\nfoundations and breakthroughs concerning the approximation and learning\nbehaviors intrinsic to prevalent graph learning models. Encompassing\ndiscussions on fundamental aspects such as expressiveness power,\ngeneralization, optimization, and unique phenomena such as over-smoothing and\nover-squashing, this piece delves into the theoretical foundations and frontier\ndriving the evolution of graph learning. In addition, this article also\npresents several challenges and further initiates discussions on possible\nsolutions.", "paper_summary_zh": "最近在圖形學習的進展，徹底改變了我們理解和分析具有複雜結構的資料的方式。值得注意的是，圖形神經網路 (GNN)，也就是專門用於學習圖形表示的神經網路架構，已經成為一種流行的範例。由於這些模型通常以直覺驅動的設計或高度複雜的元件為特徵，將它們置於理論分析框架中以提煉核心概念，有助於我們更好地理解驅動功能性的關鍵原則，並引導進一步的發展。鑑於這股熱潮，本文提供了關於近似和學習行為的理論基礎和突破的全面摘要，這些行為內含於流行的圖形學習模型中。本文涵蓋了表達能力、概化、最佳化等基本面向的討論，以及過度平滑和過度壓縮等獨特現象，深入探討了理論基礎和推動圖形學習演進的前沿。此外，本文也提出了若干挑戰，並進一步展開關於可能解決方案的討論。", "author": "Yu Huang et.al.", "authors": "Yu Huang, Min Zhou, Menglin Yang, Zhen Wang, Muhan Zhang, Jie Wang, Hong Xie, Hao Wang, Defu Lian, Enhong Chen", "id": "2407.03125v1", "paper_url": "http://arxiv.org/abs/2407.03125v1", "repo": "null"}}