{"2409.05989": {"publish_time": "2024-09-09", "title": "A Comprehensive Comparison Between ANNs and KANs For Classifying EEG Alzheimer's Data", "paper_summary": "Alzheimer's Disease is an incurable cognitive condition that affects\nthousands of people globally. While some diagnostic methods exist for\nAlzheimer's Disease, many of these methods cannot detect Alzheimer's in its\nearlier stages. Recently, researchers have explored the use of\nElectroencephalogram (EEG) technology for diagnosing Alzheimer's. EEG is a\nnoninvasive method of recording the brain's electrical signals, and EEG data\nhas shown distinct differences between patients with and without Alzheimer's.\nIn the past, Artificial Neural Networks (ANNs) have been used to predict\nAlzheimer's from EEG data, but these models sometimes produce false positive\ndiagnoses. This study aims to compare losses between ANNs and Kolmogorov-Arnold\nNetworks (KANs) across multiple types of epochs, learning rates, and nodes. The\nresults show that across these different parameters, ANNs are more accurate in\npredicting Alzheimer's Disease from EEG signals.", "paper_summary_zh": "阿茲海默症是一種無法治癒的認知疾病，影響全球數千人。雖然阿茲海默症有一些診斷方法，但這些方法中的許多無法在早期階段檢測出阿茲海默症。最近，研究人員探索了使用腦電圖 (EEG) 技術診斷阿茲海默症。EEG 是一種非侵入性的方法，用於記錄大腦的電信號，而 EEG 數據顯示出患有阿茲海默症和未患有阿茲海默症的患者之間存在顯著差異。過去，人工神經網路 (ANN) 已被用於從 EEG 數據中預測阿茲海默症，但這些模型有時會產生假陽性診斷。本研究旨在比較多個類型的時期、學習率和節點之間 ANN 和 Kolmogorov-Arnold 網路 (KAN) 之間的損失。結果表明，在這些不同的參數中，ANN 在從 EEG 信號中預測阿茲海默症方面更準確。", "author": "Akshay Sunkara et.al.", "authors": "Akshay Sunkara, Sriram Sattiraju, Aakarshan Kumar, Zaryab Kanjiani, Himesh Anumala", "id": "2409.05989v1", "paper_url": "http://arxiv.org/abs/2409.05989v1", "repo": "null"}}