{"2408.05035": {"publish_time": "2024-08-09", "title": "Examining the Behavior of LLM Architectures Within the Framework of Standardized National Exams in Brazil", "paper_summary": "The Exame Nacional do Ensino M\\'edio (ENEM) is a pivotal test for Brazilian\nstudents, required for admission to a significant number of universities in\nBrazil. The test consists of four objective high-school level tests on Math,\nHumanities, Natural Sciences and Languages, and one writing essay. Students'\nanswers to the test and to the accompanying socioeconomic status questionnaire\nare made public every year (albeit anonymized) due to transparency policies\nfrom the Brazilian Government. In the context of large language models (LLMs),\nthese data lend themselves nicely to comparing different groups of humans with\nAI, as we can have access to human and machine answer distributions. We\nleverage these characteristics of the ENEM dataset and compare GPT-3.5 and 4,\nand MariTalk, a model trained using Portuguese data, to humans, aiming to\nascertain how their answers relate to real societal groups and what that may\nreveal about the model biases. We divide the human groups by using\nsocioeconomic status (SES), and compare their answer distribution with LLMs for\neach question and for the essay. We find no significant biases when comparing\nLLM performance to humans on the multiple-choice Brazilian Portuguese tests, as\nthe distance between model and human answers is mostly determined by the human\naccuracy. A similar conclusion is found by looking at the generated text as,\nwhen analyzing the essays, we observe that human and LLM essays differ in a few\nkey factors, one being the choice of words where model essays were easily\nseparable from human ones. The texts also differ syntactically, with LLM\ngenerated essays exhibiting, on average, smaller sentences and less thought\nunits, among other differences. These results suggest that, for Brazilian\nPortuguese in the ENEM context, LLM outputs represent no group of humans, being\nsignificantly different from the answers from Brazilian students across all\ntests.", "paper_summary_zh": "巴西國家中學教育考試 (ENEM) 對巴西學生來說是一項關鍵考試，是進入巴西眾多大學的必要條件。考試包含四項數學、人文、自然科學和語言的高中程度客觀測驗，以及一篇寫作論文。由於巴西政府的透明化政策，學生對考試和附帶的社會經濟地位問卷的回答每年都會公開（儘管是匿名）。在大型語言模型 (LLM) 的背景下，這些數據非常適合將不同的人類群體與 AI 進行比較，因為我們可以獲得人類和機器答案的分布。我們利用 ENEM 數據集的這些特徵，並將 GPT-3.5 和 4，以及使用葡萄牙語數據訓練的模型 MariTalk 與人類進行比較，旨在確定他們的答案與真實社會群體的關聯性，以及這可能揭示模型偏見的內容。我們使用社會經濟地位 (SES) 來劃分人類群體，並將他們的答案分佈與每個問題和論文的 LLM 進行比較。在將 LLM 的表現與人類在巴西葡萄牙語多項選擇測驗中的表現進行比較時，我們沒有發現顯著的偏見，因為模型和人類答案之間的距離主要由人類的準確性決定。通過查看生成的文本，我們發現了一個類似的結論，在分析論文時，我們觀察到人類和 LLM 論文在幾個關鍵因素上有所不同，其中一個因素是詞彙選擇，模型論文很容易與人類論文區分開來。這些文本在句法上也有所不同，由 LLM 生成的論文平均來說句子較短，思想單元較少，還有其他不同之處。這些結果表明，在 ENEM 背景下的巴西葡萄牙語中，LLM 輸出不代表任何人類群體，與巴西學生在所有考試中的答案有顯著不同。", "author": "Marcelo Sartori Locatelli et.al.", "authors": "Marcelo Sartori Locatelli, Matheus Prado Miranda, Igor Joaquim da Silva Costa, Matheus Torres Prates, Victor Thomé, Mateus Zaparoli Monteiro, Tomas Lacerda, Adriana Pagano, Eduardo Rios Neto, Wagner Meira Jr., Virgilio Almeida", "id": "2408.05035v1", "paper_url": "http://arxiv.org/abs/2408.05035v1", "repo": "null"}}