{"2501.01950": {"publish_time": "2025-01-03", "title": "MADGEN -- Mass-Spec attends to De Novo Molecular generation", "paper_summary": "The annotation (assigning structural chemical identities) of MS/MS spectra\nremains a significant challenge due to the enormous molecular diversity in\nbiological samples and the limited scope of reference databases. Currently, the\nvast majority of spectral measurements remain in the \"dark chemical space\"\nwithout structural annotations. To improve annotation, we propose MADGEN\n(Mass-spec Attends to De Novo Molecular GENeration), a scaffold-based method\nfor de novo molecular structure generation guided by mass spectrometry data.\nMADGEN operates in two stages: scaffold retrieval and spectra-conditioned\nmolecular generation starting with the scaffold. In the first stage, given an\nMS/MS spectrum, we formulate scaffold retrieval as a ranking problem and employ\ncontrastive learning to align mass spectra with candidate molecular scaffolds.\nIn the second stage, starting from the retrieved scaffold, we employ the MS/MS\nspectrum to guide an attention-based generative model to generate the final\nmolecule. Our approach constrains the molecular generation search space,\nreducing its complexity and improving generation accuracy. We evaluate MADGEN\non three datasets (NIST23, CANOPUS, and MassSpecGym) and evaluate MADGEN's\nperformance with a predictive scaffold retriever and with an oracle retriever.\nWe demonstrate the effectiveness of using attention to integrate spectral\ninformation throughout the generation process to achieve strong results with\nthe oracle retriever.", "paper_summary_zh": "質譜儀 (MS/MS) 光譜的註解（賦予結構化學身分）由於生物樣本中龐大的分子多樣性和參考資料庫的範圍有限，因此仍然是一項重大的挑戰。目前，絕大多數的光譜測量仍處於「黑暗化學空間」，沒有結構註解。為了改善註解，我們提出 MADGEN（質譜關注從頭分子產生），這是一種基於支架的從頭分子結構產生方法，由質譜儀數據引導。MADGEN 分兩個階段進行：支架檢索和以光譜為條件的分子產生，從支架開始。在第一階段，給定一個 MS/MS 光譜，我們將支架檢索制定為一個排名問題，並採用對比學習將質譜與候選分子支架對齊。在第二階段，從檢索到的支架開始，我們使用 MS/MS 光譜來引導基於注意力的生成模型，以產生最終分子。我們的做法約束了分子產生搜尋空間，降低了其複雜性並提高了產生準確度。我們在三個資料集（NIST23、CANOPUS 和 MassSpecGym）上評估 MADGEN，並使用預測支架檢索器和預言機檢索器評估 MADGEN 的效能。我們展示了在整個產生過程中使用注意力整合光譜資訊的有效性，以使用預言機檢索器取得強勁的結果。", "author": "Yinkai Wang et.al.", "authors": "Yinkai Wang, Xiaohui Chen, Liping Liu, Soha Hassoun", "id": "2501.01950v1", "paper_url": "http://arxiv.org/abs/2501.01950v1", "repo": "null"}}