{"2411.18141": {"publish_time": "2024-11-27", "title": "Predicting Water Quality using Quantum Machine Learning: The Case of the Umgeni Catchment (U20A) Study Region", "paper_summary": "In this study, we consider a real-world application of QML techniques to\nstudy water quality in the U20A region in Durban, South Africa. Specifically,\nwe applied the quantum support vector classifier (QSVC) and quantum neural\nnetwork (QNN), and we showed that the QSVC is easier to implement and yields a\nhigher accuracy. The QSVC models were applied for three kernels: Linear,\npolynomial, and radial basis function (RBF), and it was shown that the\npolynomial and RBF kernels had exactly the same performance. The QNN model was\napplied using different optimizers, learning rates, noise on the circuit\ncomponents, and weight initializations were considered, but the QNN\npersistently ran into the dead neuron problem. Thus, the QNN was compared only\nby accraucy and loss, and it was shown that with the Adam optimizer, the model\nhas the best performance, however, still less than the QSVC.", "paper_summary_zh": "在本研究中，我們考慮了 QML 技術在南非德班 U20A 地區水質研究中的實際應用。具體而言，我們應用量子支持向量分類器 (QSVC) 和量子神經網路 (QNN)，我們表明 QSVC 更容易實現並產生更高的準確度。QSVC 模型應用於三種核：線性、多項式和徑向基函數 (RBF)，結果表明多項式和 RBF 核具有完全相同的性能。QNN 模型使用不同的優化器、學習率、電路組件上的噪聲，並考慮權重初始化，但 QNN 持續遇到死神經元問題。因此，僅通過準確度和損失對 QNN 進行比較，結果表明使用 Adam 優化器時，該模型具有最佳性能，但仍低於 QSVC。", "author": "Muhammad Al-Zafar Khan et.al.", "authors": "Muhammad Al-Zafar Khan, Jamal Al-Karaki, Marwan Omar", "id": "2411.18141v1", "paper_url": "http://arxiv.org/abs/2411.18141v1", "repo": "null"}}