{"2410.16132": {"publish_time": "2024-10-21", "title": "A Data-driven Crowd Simulation Framework Integrating Physics-informed Machine Learning with Navigation Potential Fields", "paper_summary": "Traditional rule-based physical models are limited by their reliance on\nsingular physical formulas and parameters, making it difficult to effectively\ntackle the intricate tasks associated with crowd simulation. Recent research\nhas introduced deep learning methods to tackle these issues, but most current\napproaches focus primarily on generating pedestrian trajectories, often lacking\ninterpretability and failing to provide real-time dynamic simulations.To\naddress the aforementioned issues, we propose a novel data-driven crowd\nsimulation framework that integrates Physics-informed Machine Learning (PIML)\nwith navigation potential fields. Our approach leverages the strengths of both\nphysical models and PIML. Specifically, we design an innovative\nPhysics-informed Spatio-temporal Graph Convolutional Network (PI-STGCN) as a\ndata-driven module to predict pedestrian movement trends based on crowd\nspatio-temporal data. Additionally, we construct a physical model of navigation\npotential fields based on flow field theory to guide pedestrian movements,\nthereby reinforcing physical constraints during the simulation. In our\nframework, navigation potential fields are dynamically computed and updated\nbased on the movement trends predicted by the PI-STGCN, while the updated crowd\ndynamics, guided by these fields, subsequently feed back into the PI-STGCN.\nComparative experiments on two publicly available large-scale real-world\ndatasets across five scenes demonstrate that our proposed framework outperforms\nexisting rule-based methods in accuracy and fidelity. The similarity between\nsimulated and actual pedestrian trajectories increases by 10.8%, while the\naverage error is reduced by 4%. Moreover, our framework exhibits greater\nadaptability and better interpretability compared to methods that rely solely\non deep learning for trajectory generation.", "paper_summary_zh": "<paragraph>傳統的基於規則的物理模型受到對單一物理公式和參數的依賴所限，這使得有效應對與群體模擬相關的複雜任務變得困難。最近的研究引入了深度學習方法來解決這些問題，但目前大多數方法主要集中在生成行人軌跡上，往往缺乏可解釋性，並且無法提供實時的動態模擬。為了解決上述問題，我們提出了一個新穎的數據驅動型群體模擬框架，該框架將物理信息機器學習 (PIML) 與導航勢場相結合。我們的做法利用了物理模型和 PIML 的優勢。具體來說，我們設計了一個創新的物理信息時空圖卷積神經網絡 (PI-STGCN) 作為一個數據驅動模塊，基於群體時空數據預測行人運動趨勢。此外，我們基於流場理論構建了一個導航勢場物理模型來指導行人運動，從而加強了模擬過程中的物理約束。在我們的框架中，導航勢場是根據 PI-STGCN 預測的運動趨勢動態計算和更新的，而由這些場引導的更新後的群體動態隨後反饋到 PI-STGCN 中。在五個場景中對兩個公開可用的大型真實世界數據集進行的比較實驗表明，我們提出的框架在準確性和保真度方面優於現有的基於規則的方法。模擬行人軌跡與實際行人軌跡之間的相似性提高了 10.8%，而平均誤差降低了 4%。此外，與僅依賴深度學習進行軌跡生成的那些方法相比，我們的框架表現出更高的適應性和更好的可解釋性。</paragraph>", "author": "Runkang Guo et.al.", "authors": "Runkang Guo, Bin Chen, Qi Zhang, Yong Zhao, Xiao Wang, Zhengqiu Zhu", "id": "2410.16132v1", "paper_url": "http://arxiv.org/abs/2410.16132v1", "repo": "null"}}