{"2409.06362": {"publish_time": "2024-09-10", "title": "Connecting Concept Convexity and Human-Machine Alignment in Deep Neural Networks", "paper_summary": "Understanding how neural networks align with human cognitive processes is a\ncrucial step toward developing more interpretable and reliable AI systems.\nMotivated by theories of human cognition, this study examines the relationship\nbetween \\emph{convexity} in neural network representations and\n\\emph{human-machine alignment} based on behavioral data. We identify a\ncorrelation between these two dimensions in pretrained and fine-tuned vision\ntransformer models. Our findings suggest that the convex regions formed in\nlatent spaces of neural networks to some extent align with human-defined\ncategories and reflect the similarity relations humans use in cognitive tasks.\nWhile optimizing for alignment generally enhances convexity, increasing\nconvexity through fine-tuning yields inconsistent effects on alignment, which\nsuggests a complex relationship between the two. This study presents a first\nstep toward understanding the relationship between the convexity of latent\nrepresentations and human-machine alignment.", "paper_summary_zh": "了解神经網路如何與人類認知過程相符，是朝開發更具可解釋性與可信賴性的 AI 系統邁進的關鍵一步。本研究受到人類認知理論的啟發，探討神經網路表示中的「凸性」與根據行為資料的「人機對齊」之間的關係。我們在預訓練和微調的視覺轉換器模型中，找出這兩個面向之間的關聯性。我們的發現顯示，在神經網路的潛在空間中形成的凸區域，在某種程度上與人類定義的類別相符，並反映了人類在認知任務中使用的相似性關係。雖然針對對齊進行最佳化通常會增強凸性，但透過微調來增加凸性，對對齊的影響卻不一致，這表明兩者之間的關係很複雜。本研究為了解潛在表示的凸性與人機對齊之間的關係，踏出了第一步。", "author": "Teresa Dorszewski et.al.", "authors": "Teresa Dorszewski, Lenka Tětková, Lorenz Linhardt, Lars Kai Hansen", "id": "2409.06362v1", "paper_url": "http://arxiv.org/abs/2409.06362v1", "repo": "null"}}