{"2406.11437": {"publish_time": "2024-06-17", "title": "Analysing the Behaviour of Tree-Based Neural Networks in Regression Tasks", "paper_summary": "The landscape of deep learning has vastly expanded the frontiers of source\ncode analysis, particularly through the utilization of structural\nrepresentations such as Abstract Syntax Trees (ASTs). While these methodologies\nhave demonstrated effectiveness in classification tasks, their efficacy in\nregression applications, such as execution time prediction from source code,\nremains underexplored. This paper endeavours to decode the behaviour of\ntree-based neural network models in the context of such regression challenges.\nWe extend the application of established models--tree-based Convolutional\nNeural Networks (CNNs), Code2Vec, and Transformer-based methods--to predict the\nexecution time of source code by parsing it to an AST. Our comparative analysis\nreveals that while these models are benchmarks in code representation, they\nexhibit limitations when tasked with regression. To address these deficiencies,\nwe propose a novel dual-transformer approach that operates on both source code\ntokens and AST representations, employing cross-attention mechanisms to enhance\ninterpretability between the two domains. Furthermore, we explore the\nadaptation of Graph Neural Networks (GNNs) to this tree-based problem,\ntheorizing the inherent compatibility due to the graphical nature of ASTs.\nEmpirical evaluations on real-world datasets showcase that our dual-transformer\nmodel outperforms all other tree-based neural networks and the GNN-based\nmodels. Moreover, our proposed dual transformer demonstrates remarkable\nadaptability and robust performance across diverse datasets.", "paper_summary_zh": "深度學習的領域已經大幅擴展了原始碼分析的疆界，特別是透過使用結構化表示法，例如抽象語法樹 (AST)。儘管這些方法已證明在分類任務中有效，但它們在回歸應用中的效能，例如從原始碼中預測執行時間，仍未被充分探討。本文試圖解碼樹狀神經網路模型在這種回歸挑戰中的行為。我們擴展了既定模型的應用——基於樹狀的卷積神經網路 (CNN)、Code2Vec 和基於 Transformer 的方法——透過將原始碼解析成 AST 來預測其執行時間。我們的比較分析顯示，儘管這些模型是程式碼表示法的基準，但它們在執行回歸任務時表現出限制。為了解決這些缺陷，我們提出了一種新穎的雙 Transformer 方法，它同時作用於原始碼代碼和 AST 表示法，並採用跨注意力機制來增強兩個領域之間的可解釋性。此外，我們探討了將圖神經網路 (GNN) 適應到這個基於樹狀的問題，並根據 AST 的圖形性質，理論化其內在相容性。在真實世界資料集上的實證評估顯示，我們的雙 Transformer 模型優於所有其他基於樹狀的神經網路和基於 GNN 的模型。此外，我們提出的雙 Transformer 在不同的資料集上展現出顯著的適應性和穩健的效能。", "author": "Peter Samoaa et.al.", "authors": "Peter Samoaa, Mehrdad Farahani, Antonio Longa, Philipp Leitner, Morteza Haghir Chehreghani", "id": "2406.11437v1", "paper_url": "http://arxiv.org/abs/2406.11437v1", "repo": "https://github.com/petersamoaa/tree_based_nn_error_analysis"}}