{"2408.13085": {"publish_time": "2024-08-23", "title": "Map-Free Visual Relocalization Enhanced by Instance Knowledge and Depth Knowledge", "paper_summary": "Map-free relocalization technology is crucial for applications in autonomous\nnavigation and augmented reality, but relying on pre-built maps is often\nimpractical. It faces significant challenges due to limitations in matching\nmethods and the inherent lack of scale in monocular images. These issues lead\nto substantial rotational and metric errors and even localization failures in\nreal-world scenarios. Large matching errors significantly impact the overall\nrelocalization process, affecting both rotational and translational accuracy.\nDue to the inherent limitations of the camera itself, recovering the metric\nscale from a single image is crucial, as this significantly impacts the\ntranslation error. To address these challenges, we propose a map-free\nrelocalization method enhanced by instance knowledge and depth knowledge. By\nleveraging instance-based matching information to improve global matching\nresults, our method significantly reduces the possibility of mismatching across\ndifferent objects. The robustness of instance knowledge across the scene helps\nthe feature point matching model focus on relevant regions and enhance matching\naccuracy. Additionally, we use estimated metric depth from a single image to\nreduce metric errors and improve scale recovery accuracy. By integrating\nmethods dedicated to mitigating large translational and rotational errors, our\napproach demonstrates superior performance in map-free relocalization\ntechniques.", "paper_summary_zh": "無地圖再定位技術對於自主導航和擴增實境應用至關重要，但依賴預先建置的地圖通常不切實際。由於配對方法的限制和單眼影像中固有的比例不足，因此面臨重大挑戰。這些問題會導致實際場景中的大幅旋轉和度量誤差，甚至定位失敗。大幅配對誤差會顯著影響整體再定位流程，影響旋轉和平移準確度。由於相機本身的固有限制，從單一影像中恢復度量比例至關重要，因為這會顯著影響平移誤差。為了應對這些挑戰，我們提出了一種由實例知識和深度知識增強的無地圖再定位方法。透過利用基於實例的配對資訊來改善整體配對結果，我們的技術大幅降低跨不同物件不匹配的可能性。實例知識在場景中的穩健性有助於特徵點配對模型專注於相關區域並提高配對準確度。此外，我們使用從單一影像估計的度量深度來減少度量誤差並提高比例恢復準確度。透過整合專門用於減輕大幅平移和旋轉誤差的方法，我們的技術在無地圖再定位技術中展現出優異的效能。", "author": "Mingyu Xiao et.al.", "authors": "Mingyu Xiao, Runze Chen, Haiyong Luo, Fang Zhao, Juan Wang, Xuepeng Ma", "id": "2408.13085v1", "paper_url": "http://arxiv.org/abs/2408.13085v1", "repo": "null"}}