{"2410.22239": {"publish_time": "2024-10-29", "title": "DISCERN: Decoding Systematic Errors in Natural Language for Text Classifiers", "paper_summary": "Despite their high predictive accuracies, current machine learning systems\noften exhibit systematic biases stemming from annotation artifacts or\ninsufficient support for certain classes in the dataset. Recent work proposes\nautomatic methods for identifying and explaining systematic biases using\nkeywords. We introduce DISCERN, a framework for interpreting systematic biases\nin text classifiers using language explanations. DISCERN iteratively generates\nprecise natural language descriptions of systematic errors by employing an\ninteractive loop between two large language models. Finally, we use the\ndescriptions to improve classifiers by augmenting classifier training sets with\nsynthetically generated instances or annotated examples via active learning. On\nthree text-classification datasets, we demonstrate that language explanations\nfrom our framework induce consistent performance improvements that go beyond\nwhat is achievable with exemplars of systematic bias. Finally, in human\nevaluations, we show that users can interpret systematic biases more\neffectively (by over 25% relative) and efficiently when described through\nlanguage explanations as opposed to cluster exemplars.", "paper_summary_zh": "儘管機器學習系統預測準確度高，但目前的系統通常會表現出系統性偏差，這些偏差源自於註解人工製品或資料集中某些類別支援不足。近期研究提出使用關鍵字自動辨識並解釋系統性偏差的方法。我們推出 DISCERN，一個使用語言解釋來詮釋文字分類器中系統性偏差的架構。DISCERN 透過使用兩個大型語言模型之間的互動迴圈，反覆產生系統性錯誤的精確自然語言描述。最後，我們使用這些描述來改善分類器，方法是透過主動學習，用合成產生的實例或註解範例來擴充分類器訓練集。在三個文字分類資料集中，我們展示了我們架構中的語言解釋會引發一致的效能改善，這超越了系統性偏差範例所能達成的效果。最後，在人類評估中，我們顯示出當透過語言解釋（相對於群集範例）來描述時，使用者可以更有效率（相對高出 25% 以上）且更有效地詮釋系統性偏差。", "author": "Rakesh R. Menon et.al.", "authors": "Rakesh R. Menon, Shashank Srivastava", "id": "2410.22239v1", "paper_url": "http://arxiv.org/abs/2410.22239v1", "repo": "null"}}