{"2411.08599": {"publish_time": "2024-11-13", "title": "XiYan-SQL: A Multi-Generator Ensemble Framework for Text-to-SQL", "paper_summary": "To tackle the challenges of large language model performance in natural\nlanguage to SQL tasks, we introduce XiYan-SQL, an innovative framework that\nemploys a multi-generator ensemble strategy to improve candidate generation. We\nintroduce M-Schema, a semi-structured schema representation method designed to\nenhance the understanding of database structures. To enhance the quality and\ndiversity of generated candidate SQL queries, XiYan-SQL integrates the\nsignificant potential of in-context learning (ICL) with the precise control of\nsupervised fine-tuning. On one hand, we propose a series of training strategies\nto fine-tune models to generate high-quality candidates with diverse\npreferences. On the other hand, we implement the ICL approach with an example\nselection method based on named entity recognition to prevent overemphasis on\nentities. The refiner optimizes each candidate by correcting logical or\nsyntactical errors. To address the challenge of identifying the best candidate,\nwe fine-tune a selection model to distinguish nuances of candidate SQL queries.\nThe experimental results on multiple dialect datasets demonstrate the\nrobustness of XiYan-SQL in addressing challenges across different scenarios.\nOverall, our proposed XiYan-SQL achieves the state-of-the-art execution\naccuracy of 89.65% on the Spider test set, 69.86% on SQL-Eval, 41.20% on\nNL2GQL, and a competitive score of 72.23% on the Bird development benchmark.\nThe proposed framework not only enhances the quality and diversity of SQL\nqueries but also outperforms previous methods.", "paper_summary_zh": "<paragraph>為了應對大型語言模型在自然語言轉換成 SQL 任務中的效能挑戰，我們引入了 XiYan-SQL，一個創新的架構，它採用多產生器組合策略來改善候選產生。我們引入了 M-Schema，一種半結構化架構表示方法，旨在加強對資料庫結構的理解。為了提升所產生的候選 SQL 查詢的品質和多樣性，XiYan-SQL 整合了脈絡中學習 (ICL) 的重大潛力，以及監督微調的精準控制。一方面，我們提出了一系列訓練策略，微調模型以產生具有多樣化偏好的高品質候選。另一方面，我們實作了 ICL 方法，採用基於命名實體辨識的範例選取方法，以防止過度強調實體。精煉器透過修正邏輯或語法錯誤，來最佳化每個候選。為了應對找出最佳候選的挑戰，我們微調了一個選取模型，以區分候選 SQL 查詢的細微差別。在多個方言資料集上的實驗結果，證明了 XiYan-SQL 在因應不同場景的挑戰時具有穩健性。總體而言，我們提出的 XiYan-SQL 在 Spider 測試集上達到了 89.65% 的最新執行準確度，在 SQL-Eval 上達到了 69.86%，在 NL2GQL 上達到了 41.20%，在 Bird 開發基準上達到了 72.23% 的競爭力分數。所提出的架構不僅提升了 SQL 查詢的品質和多樣性，也優於先前的各種方法。</paragraph>", "author": "Yingqi Gao et.al.", "authors": "Yingqi Gao, Yifu Liu, Xiaoxia Li, Xiaorong Shi, Yin Zhu, Yiming Wang, Shiqi Li, Wei Li, Yuntao Hong, Zhiling Luo, Jinyang Gao, Liyu Mou, Yu Li", "id": "2411.08599v1", "paper_url": "http://arxiv.org/abs/2411.08599v1", "repo": "null"}}