{"2412.04384": {"publish_time": "2024-12-05", "title": "Probabilistic Gaussian Superposition for Efficient 3D Occupancy Prediction", "paper_summary": "3D semantic occupancy prediction is an important task for robust\nvision-centric autonomous driving, which predicts fine-grained geometry and\nsemantics of the surrounding scene. Most existing methods leverage dense\ngrid-based scene representations, overlooking the spatial sparsity of the\ndriving scenes. Although 3D semantic Gaussian serves as an object-centric\nsparse alternative, most of the Gaussians still describe the empty region with\nlow efficiency. To address this, we propose a probabilistic Gaussian\nsuperposition model which interprets each Gaussian as a probability\ndistribution of its neighborhood being occupied and conforms to probabilistic\nmultiplication to derive the overall geometry. Furthermore, we adopt the exact\nGaussian mixture model for semantics calculation to avoid unnecessary\noverlapping of Gaussians. To effectively initialize Gaussians in non-empty\nregion, we design a distribution-based initialization module which learns the\npixel-aligned occupancy distribution instead of the depth of surfaces. We\nconduct extensive experiments on nuScenes and KITTI-360 datasets and our\nGaussianFormer-2 achieves state-of-the-art performance with high efficiency.\nCode: https://github.com/huang-yh/GaussianFormer.", "paper_summary_zh": "3D 語意佔用預測是健全視覺中心自動駕駛的一項重要任務，它預測了周圍場景的精細幾何形狀和語意。現有的大多數方法利用密集的基於網格的場景表示，忽略了駕駛場景的空間稀疏性。雖然 3D 語意高斯函數作為以物件為中心的稀疏替代方案，但大多數高斯函數仍以低效率描述空區域。為了解決此問題，我們提出了一個機率高斯疊加模型，該模型將每個高斯函數解釋為其鄰域被佔用的機率分佈，並符合機率乘法以推導整體幾何形狀。此外，我們採用精確高斯混合模型進行語意計算，以避免高斯函數不必要的重疊。為了有效地初始化非空區域中的高斯函數，我們設計了一個基於分佈的初始化模組，該模組學習像素對齊的佔用分佈，而不是表面的深度。我們對 nuScenes 和 KITTI-360 資料集進行了廣泛的實驗，我們的 GaussianFormer-2 以高效率實現了最先進的效能。程式碼：https://github.com/huang-yh/GaussianFormer。", "author": "Yuanhui Huang et.al.", "authors": "Yuanhui Huang, Amonnut Thammatadatrakoon, Wenzhao Zheng, Yunpeng Zhang, Dalong Du, Jiwen Lu", "id": "2412.04384v1", "paper_url": "http://arxiv.org/abs/2412.04384v1", "repo": "null"}}