{"2406.18702": {"publish_time": "2024-06-26", "title": "Simulating The U.S. Senate: An LLM-Driven Agent Approach to Modeling Legislative Behavior and Bipartisanship", "paper_summary": "This study introduces a novel approach to simulating legislative processes\nusing LLM-driven virtual agents, focusing on the U.S. Senate Intelligence\nCommittee. We developed agents representing individual senators and placed them\nin simulated committee discussions. The agents demonstrated the ability to\nengage in realistic debate, provide thoughtful reflections, and find bipartisan\nsolutions under certain conditions. Notably, the simulation also showed promise\nin modeling shifts towards bipartisanship in response to external\nperturbations. Our results indicate that this LLM-driven approach could become\na valuable tool for understanding and potentially improving legislative\nprocesses, supporting a broader pattern of findings highlighting how LLM-based\nagents can usefully model real-world phenomena. Future works will focus on\nenhancing agent complexity, expanding the simulation scope, and exploring\napplications in policy testing and negotiation.", "paper_summary_zh": "本研究介紹一種使用 LLM 驅動虛擬代理模擬立法程序的新方法，重點在美國參議院情報委員會。我們開發了代表個別參議員的代理，並將他們置於模擬委員會討論中。這些代理展示了在特定條件下參與現實辯論、提供深思熟慮的反思和找到兩黨解決方案的能力。值得注意的是，模擬也顯示出有望在應對外部擾動時朝著兩黨合作的方向轉變。我們的結果表明，這種 LLM 驅動的方法可能成為理解和潛在改善立法程序的寶貴工具，支持更廣泛的發現模式，強調基於 LLM 的代理如何能夠對現實世界現象進行建模。未來的研究重點將放在提高代理的複雜性、擴大模擬範圍以及探索在政策測試和協商中的應用。", "author": "Zachary R. Baker et.al.", "authors": "Zachary R. Baker, Zarif L. Azher", "id": "2406.18702v1", "paper_url": "http://arxiv.org/abs/2406.18702v1", "repo": "null"}}