{"2410.11450": {"publish_time": "2024-10-15", "title": "A Cross-Lingual Statutory Article Retrieval Dataset for Taiwan Legal Studies", "paper_summary": "This paper introduces a cross-lingual statutory article retrieval (SAR)\ndataset designed to enhance legal information retrieval in multilingual\nsettings. Our dataset features spoken-language-style legal inquiries in\nEnglish, paired with corresponding Chinese versions and relevant statutes,\ncovering all Taiwanese civil, criminal, and administrative laws. This dataset\naims to improve access to legal information for non-native speakers,\nparticularly for foreign nationals in Taiwan. We propose several LLM-based\nmethods as baselines for evaluating retrieval effectiveness, focusing on\nmitigating translation errors and improving cross-lingual retrieval\nperformance. Our work provides a valuable resource for developing inclusive\nlegal information retrieval systems.", "paper_summary_zh": "本文介紹一個跨語言法規條文檢索 (SAR) 資料集，旨在加強多語言環境中的法律資訊檢索。我們的資料集包含以英語表達的口語法律查詢，以及對應的中文版本和相關法規，涵蓋所有台灣民事、刑事和行政法律。此資料集旨在改善非母語人士取得法律資訊的管道，特別是台灣的外國人。我們提出幾種基於 LLM 的方法作為評估檢索效果的基準，重點在於減輕翻譯錯誤並改善跨語言檢索效能。我們的研究成果為開發包容性的法律資訊檢索系統提供了寶貴資源。", "author": "Yen-Hsiang Wang et.al.", "authors": "Yen-Hsiang Wang, Feng-Dian Su, Tzu-Yu Yeh, Yao-Chung Fan", "id": "2410.11450v1", "paper_url": "http://arxiv.org/abs/2410.11450v1", "repo": "https://github.com/nchu-nlp-lab/lawfactsqa-tw"}}