{"2411.07163": {"publish_time": "2024-11-11", "title": "A Domain-Agnostic Neurosymbolic Approach for Big Social Data Analysis: Evaluating Mental Health Sentiment on Social Media during COVID-19", "paper_summary": "Monitoring public sentiment via social media is potentially helpful during\nhealth crises such as the COVID-19 pandemic. However, traditional\nfrequency-based, data-driven neural network-based approaches can miss newly\nrelevant content due to the evolving nature of language in a dynamically\nevolving environment. Human-curated symbolic knowledge sources, such as\nlexicons for standard language and slang terms, can potentially elevate social\nmedia signals in evolving language. We introduce a neurosymbolic method that\nintegrates neural networks with symbolic knowledge sources, enhancing the\ndetection and interpretation of mental health-related tweets relevant to\nCOVID-19. Our method was evaluated using a corpus of large datasets\n(approximately 12 billion tweets, 2.5 million subreddit data, and 700k news\narticles) and multiple knowledge graphs. This method dynamically adapts to\nevolving language, outperforming purely data-driven models with an F1 score\nexceeding 92\\%. This approach also showed faster adaptation to new data and\nlower computational demands than fine-tuning pre-trained large language models\n(LLMs). This study demonstrates the benefit of neurosymbolic methods in\ninterpreting text in a dynamic environment for tasks such as health\nsurveillance.", "paper_summary_zh": "透過社群媒體監控公眾情緒在 COVID-19 等健康危機期間可能很有幫助。然而，傳統的基於頻率、資料驅動的神經網路方法可能會錯過新相關的內容，因為語言在動態演化的環境中會持續演化。由人類策劃的象徵性知識來源（例如標準語言和俚語術語的詞彙）可能會提升社群媒體在演化語言中的訊號。我們引入一種將神經網路與象徵性知識來源整合的神經符號方法，增強與 COVID-19 相關的心理健康相關推文的偵測和詮釋。我們的做法使用大型資料集語料庫（約 120 億則推文、250 萬個 subreddit 資料和 70 萬則新聞文章）和多個知識圖譜進行評估。這種方法動態適應演化的語言，優於純資料驅動模型，F1 分數超過 92%。這種方法也顯示出比微調預訓練大型語言模型 (LLM) 更快適應新資料和更低的運算需求。本研究證明了神經符號方法在動態環境中詮釋文字的優點，適用於健康監控等任務。", "author": "Vedant Khandelwal et.al.", "authors": "Vedant Khandelwal, Manas Gaur, Ugur Kursuncu, Valerie Shalin, Amit Sheth", "id": "2411.07163v1", "paper_url": "http://arxiv.org/abs/2411.07163v1", "repo": "null"}}