{"2406.11897": {"publish_time": "2024-06-14", "title": "A Benchmark for Maximum Cut: Towards Standardization of the Evaluation of Learned Heuristics for Combinatorial Optimization", "paper_summary": "Recently, there has been much work on the design of general heuristics for\ngraph-based, combinatorial optimization problems via the incorporation of Graph\nNeural Networks (GNNs) to learn distribution-specific solution\nstructures.However, there is a lack of consistency in the evaluation of these\nheuristics, in terms of the baselines and instances chosen, which makes it\ndifficult to assess the relative performance of the algorithms. In this paper,\nwe propose an open-source benchmark suite MaxCut-Bench dedicated to the NP-hard\nMaximum Cut problem in both its weighted and unweighted variants, based on a\ncareful selection of instances curated from diverse graph datasets. The suite\noffers a unified interface to various heuristics, both traditional and machine\nlearning-based. Next, we use the benchmark in an attempt to systematically\ncorroborate or reproduce the results of several, popular learning-based\napproaches, including S2V-DQN [31], ECO-DQN [4], among others, in terms of\nthree dimensions: objective value, generalization, and scalability. Our\nempirical results show that several of the learned heuristics fail to\noutperform a naive greedy algorithm, and that only one of them consistently\noutperforms Tabu Search, a simple, general heuristic based upon local search.\nFurthermore, we find that the performance of ECO-DQN remains the same or is\nimproved if the GNN is replaced by a simple linear regression on a subset of\nthe features that are related to Tabu Search. Code, data, and pretrained models\nare available at: \\url{https://github.com/ankurnath/MaxCut-Bench}.", "paper_summary_zh": "<paragraph>最近，通过整合图神经网络 (GNN) 来学习特定于分布的解决方案结构，在基于图的组合优化问题的通用启发式设计的相关研究中取得了许多进展。然而，在评估这些启发式算法时，在所选基准和实例方面缺乏一致性，这使得难以评估算法的相对性能。在本文中，我们提出了一套开源基准测试套件 MaxCut-Bench，专门用于 NP 困难的最大切割问题，包括其加权和未加权变体，该套件基于从各种图数据集精心挑选的实例。该套件为各种启发式算法提供了一个统一的界面，包括传统的和基于机器学习的启发式算法。接下来，我们尝试使用该基准系统地证实或重现几种流行的基于学习的方法的结果，包括 S2V-DQN [31]、ECO-DQN [4] 等，涉及三个维度：目标值、泛化和可扩展性。我们的经验结果表明，一些学习到的启发式算法未能优于朴素的贪婪算法，并且其中只有一个算法始终优于基于局部搜索的简单通用启发式算法 Tabu Search。此外，我们发现，如果用一个简单的线性回归模型（该模型基于与 Tabu Search 相关的部分特征）来替换 GNN，则 ECO-DQN 的性能将保持不变或得到改善。代码、数据和预训练模型可在此处获得：\\url{https://github.com/ankurnath/MaxCut-Bench}。</paragraph>", "author": "Ankur Nath et.al.", "authors": "Ankur Nath, Alan Kuhnle", "id": "2406.11897v1", "paper_url": "http://arxiv.org/abs/2406.11897v1", "repo": "null"}}