{"2407.09298": {"publish_time": "2024-07-12", "title": "Transformer Layers as Painters", "paper_summary": "Despite their nearly universal adoption for large language models, the\ninternal workings of transformers are not well understood. We aim to better\nunderstand the impact of removing or reorganizing information throughout the\nlayers of a pretrained transformer. Such an understanding could both yield\nbetter usage of existing models as well as to make architectural improvements\nto produce new variants. We present a series of empirical studies on frozen\nmodels that show that the lower and final layers of pretrained transformers\ndiffer from middle layers, but that middle layers have a surprising amount of\nuniformity. We further show that some classes of problems have robustness to\nskipping layers, running the layers in an order different from how they were\ntrained, or running the layers in parallel. Our observations suggest that even\nfrozen pretrained models may gracefully trade accuracy for latency by skipping\nlayers or running layers in parallel.", "paper_summary_zh": "儘管它們幾乎普遍用於大型語言模型，但Transformer的內部運作並不被理解。我們旨在更好地理解在預訓練Transformer的層中刪除或重新組織資訊的影響。這樣的理解既可以帶來對現有模型更好的使用，也可以進行架構改進以產生新的變體。我們提出了一系列關於凍結模型的實證研究，這些研究表明預訓練Transformer的較低層和最後一層與中間層不同，但中間層具有驚人的均勻性。我們進一步表明，某些類別的問題具有對跳過層的穩健性，以不同於訓練方式的順序執行層，或並行執行層。我們的觀察結果表明，即使凍結的預訓練模型也可以通過跳過層或並行執行層來優雅地用準確度換取延遲。", "author": "Qi Sun et.al.", "authors": "Qi Sun, Marc Pickett, Aakash Kumar Nain, Llion Jones", "id": "2407.09298v1", "paper_url": "http://arxiv.org/abs/2407.09298v1", "repo": "null"}}