{"2408.09410": {"publish_time": "2024-08-18", "title": "$\\mathbb{BEHR}$NOULLI: A Binary EHR Data-Oriented Medication Recommendation System", "paper_summary": "The medical community believes binary medical event outcomes in EHR data\ncontain sufficient information for making a sensible recommendation. However,\nthere are two challenges to effectively utilizing such data: (1) modeling the\nrelationship between massive 0,1 event outcomes is difficult, even with expert\nknowledge; (2) in practice, learning can be stalled by the binary values since\nthe equally important 0 entries propagate no learning signals. Currently, there\nis a large gap between the assumed sufficient information and the reality that\nno promising results have been shown by utilizing solely the binary data:\nvisiting or secondary information is often necessary to reach acceptable\nperformance. In this paper, we attempt to build the first successful binary EHR\ndata-oriented drug recommendation system by tackling the two difficulties,\nmaking sensible drug recommendations solely using the binary EHR medical\nrecords. To this end, we take a statistical perspective to view the EHR data as\na sample from its cohorts and transform them into continuous Bernoulli\nprobabilities. The transformed entries not only model a deterministic binary\nevent with a distribution but also allow reflecting \\emph{event-event}\nrelationship by conditional probability. A graph neural network is learned on\ntop of the transformation. It captures event-event correlations while\nemphasizing \\emph{event-to-patient} features. Extensive results demonstrate\nthat the proposed method achieves state-of-the-art performance on large-scale\ndatabases, outperforming baseline methods that use secondary information by a\nlarge margin. The source code is available at\n\\url{https://github.com/chenzRG/BEHRMecom}", "paper_summary_zh": "<paragraph>醫療界認為 EHR 資料中的二元醫療事件結果包含足夠資訊，可以做出明智的建議。然而，有效利用此類資料有兩個挑戰：(1) 即使有專家知識，也很難建模大量 0、1 事件結果之間的關係；(2) 在實務上，學習可能會因二元值而停滯，因為同樣重要的 0 輸入不會傳播任何學習訊號。目前，假設的足夠資訊與現實之間存在很大的差距，僅利用二元資料並未顯示有希望的結果：通常需要拜訪或次要資訊才能達到可接受的效能。在本文中，我們嘗試透過解決這兩個難題來建立第一個成功的二元 EHR 資料導向藥物推薦系統，僅使用二元 EHR 病歷做出明智的藥物推薦。為此，我們採取統計觀點，將 EHR 資料視為其同類群的樣本，並將其轉換為連續的 Bernoulli 機率。轉換後的輸入不僅以分佈對確定性的二元事件進行建模，還允許透過條件機率反映「事件-事件」關係。圖神經網路學習轉換的頂端。它擷取事件-事件相關性，同時強調「事件-對患者」特徵。廣泛的結果證明，所提出的方法在大型資料庫上達到最先進的效能，遠遠優於使用次要資訊的基線方法。原始碼可在\n\\url{https://github.com/chenzRG/BEHRMecom} 取得</paragraph>", "author": "Xihao Piao et.al.", "authors": "Xihao Piao, Pei Gao, Zheng Chen, Lingwei Zhu, Yasuko Matsubara, Yasushi Sakurai", "id": "2408.09410v1", "paper_url": "http://arxiv.org/abs/2408.09410v1", "repo": "https://github.com/chenzrg/behrmecom"}}