{"2412.05536": {"publish_time": "2024-12-07", "title": "Comprehensive Evaluation of Multimodal AI Models in Medical Imaging Diagnosis: From Data Augmentation to Preference-Based Comparison", "paper_summary": "This study introduces an evaluation framework for multimodal models in\nmedical imaging diagnostics. We developed a pipeline incorporating data\npreprocessing, model inference, and preference-based evaluation, expanding an\ninitial set of 500 clinical cases to 3,000 through controlled augmentation. Our\nmethod combined medical images with clinical observations to generate\nassessments, using Claude 3.5 Sonnet for independent evaluation against\nphysician-authored diagnoses. The results indicated varying performance across\nmodels, with Llama 3.2-90B outperforming human diagnoses in 85.27% of cases. In\ncontrast, specialized vision models like BLIP2 and Llava showed preferences in\n41.36% and 46.77% of cases, respectively. This framework highlights the\npotential of large multimodal models to outperform human diagnostics in certain\ntasks.", "paper_summary_zh": "本研究引入了一個用於醫療影像診斷中多模態模型的評估框架。我們開發了一個結合了資料前處理、模型推論和基於偏好的評估的管道，透過受控擴充將最初的 500 個臨床案例擴充到 3,000 個。我們的做法結合了醫學影像和臨床觀察，以產生評估，使用 Claude 3.5 Sonnet 對抗醫師撰寫的診斷進行獨立評估。結果顯示不同模型的表現不同，其中 Llama 3.2-90B 在 85.27% 的案例中優於人類診斷。相比之下，專門的視覺模型，例如 BLIP2 和 Llava，分別在 41.36% 和 46.77% 的案例中顯示出偏好。此框架突顯了大型多模態模型在某些任務中優於人類診斷的潛力。", "author": "Cailian Ruan et.al.", "authors": "Cailian Ruan, Chengyue Huang, Yahe Yang", "id": "2412.05536v1", "paper_url": "http://arxiv.org/abs/2412.05536v1", "repo": "null"}}