{"2408.06087": {"publish_time": "2024-08-12", "title": "Building Decision Making Models Through Language Model Regime", "paper_summary": "We propose a novel approach for decision making problems leveraging the\ngeneralization capabilities of large language models (LLMs). Traditional\nmethods such as expert systems, planning algorithms, and reinforcement learning\noften exhibit limited generalization, typically requiring the training of new\nmodels for each unique task. In contrast, LLMs demonstrate remarkable success\nin generalizing across varied language tasks, inspiring a new strategy for\ntraining decision making models. Our approach, referred to as \"Learning then\nUsing\" (LTU), entails a two-stage process. Initially, the \\textit{learning}\nphase develops a robust foundational decision making model by integrating\ndiverse knowledge from various domains and decision making contexts. The\nsubsequent \\textit{using} phase refines this foundation model for specific\ndecision making scenarios. Distinct from other studies that employ LLMs for\ndecision making through supervised learning, our LTU method embraces a\nversatile training methodology that combines broad pre-training with targeted\nfine-tuning. Experiments in e-commerce domains such as advertising and search\noptimization have shown that LTU approach outperforms traditional supervised\nlearning regimes in decision making capabilities and generalization. The LTU\napproach is the first practical training architecture for both single-step and\nmulti-step decision making tasks combined with LLMs, which can be applied\nbeyond game and robot domains. It provides a robust and adaptable framework for\ndecision making, enhances the effectiveness and flexibility of various systems\nin tackling various challenges.", "paper_summary_zh": "我們提出了一個創新的決策制定問題方法，利用大型語言模型 (LLM) 的概化能力。傳統方法，例如專家系統、規劃演算法和強化學習，通常表現出有限的概化能力，通常需要為每個獨特任務訓練新的模型。相反，LLM 在各種語言任務中展現出顯著的概化成功，激發了訓練決策制定模型的新策略。我們的方法稱為「先學習再使用」(LTU)，需要一個兩階段的過程。最初，\\textit{學習}階段透過整合來自各種領域和決策制定情境的知識，開發一個強大的基礎決策制定模型。後續的\\textit{使用}階段為特定的決策制定情境調整這個基礎模型。與其他使用 LLM 透過監督式學習進行決策制定的研究不同，我們的 LTU 方法採用了多功能的訓練方法，結合廣泛的預訓練和目標微調。在電子商務領域（例如廣告和搜尋最佳化）的實驗顯示，LTU 方法在決策制定能力和概化能力方面優於傳統的監督式學習方法。LTU 方法是第一個結合 LLM 的單步和多步決策制定任務的實用訓練架構，它可以應用於遊戲和機器人領域之外。它提供了一個強大且適應性強的決策制定框架，增強了各種系統應對各種挑戰的有效性和靈活性。", "author": "Yu Zhang et.al.", "authors": "Yu Zhang, Haoxiang Liu, Feijun Jiang, Weihua Luo, Kaifu Zhang", "id": "2408.06087v1", "paper_url": "http://arxiv.org/abs/2408.06087v1", "repo": "null"}}