{"2410.08053": {"publish_time": "2024-10-10", "title": "A Target-Aware Analysis of Data Augmentation for Hate Speech Detection", "paper_summary": "Hate speech is one of the main threats posed by the widespread use of social\nnetworks, despite efforts to limit it. Although attention has been devoted to\nthis issue, the lack of datasets and case studies centered around scarcely\nrepresented phenomena, such as ableism or ageism, can lead to hate speech\ndetection systems that do not perform well on underrepresented identity groups.\nGiven the unpreceded capabilities of LLMs in producing high-quality data, we\ninvestigate the possibility of augmenting existing data with generative\nlanguage models, reducing target imbalance. We experiment with augmenting 1,000\nposts from the Measuring Hate Speech corpus, an English dataset annotated with\ntarget identity information, adding around 30,000 synthetic examples using both\nsimple data augmentation methods and different types of generative models,\ncomparing autoregressive and sequence-to-sequence approaches. We find\ntraditional DA methods to often be preferable to generative models, but the\ncombination of the two tends to lead to the best results. Indeed, for some hate\ncategories such as origin, religion, and disability, hate speech classification\nusing augmented data for training improves by more than 10% F1 over the no\naugmentation baseline. This work contributes to the development of systems for\nhate speech detection that are not only better performing but also fairer and\nmore inclusive towards targets that have been neglected so far.", "paper_summary_zh": "仇恨言論是社交網路廣泛使用所帶來的主要威脅之一，儘管已採取措施加以限制。儘管已對此問題給予關注，但缺乏以鮮少被代表的現象（例如歧視殘疾或歧視年齡）為中心的資料集和案例研究，可能導致仇恨言論偵測系統無法對代表性不足的身分群體發揮良好效用。考量到 LLM 在產生高品質資料方面的無與倫比能力，我們探討了使用生成式語言模型擴充現有資料的可能性，以減少目標失衡。我們嘗試擴充「衡量仇恨言論」語料庫中的 1,000 篇貼文，這是一個標註有目標身分資訊的英文資料集，使用簡單的資料擴充方法和不同類型的生成式模型新增約 30,000 個合成範例，比較自迴歸和序列到序列的方法。我們發現傳統的 DA 方法通常優於生成式模型，但兩者的結合往往會帶來最佳結果。事實上，對於某些仇恨類別，例如出身、宗教和殘疾，使用擴充資料進行訓練的仇恨言論分類在 F1 上比沒有擴充的基準線改進了 10% 以上。這項工作有助於開發仇恨言論偵測系統，不僅效能更好，而且對迄今被忽視的目標更公平、更具包容性。", "author": "Camilla Casula et.al.", "authors": "Camilla Casula, Sara Tonelli", "id": "2410.08053v1", "paper_url": "http://arxiv.org/abs/2410.08053v1", "repo": "null"}}