{"2408.07340": {"publish_time": "2024-08-14", "title": "Towards Few-shot Self-explaining Graph Neural Networks", "paper_summary": "Recent advancements in Graph Neural Networks (GNNs) have spurred an upsurge\nof research dedicated to enhancing the explainability of GNNs, particularly in\ncritical domains such as medicine. A promising approach is the self-explaining\nmethod, which outputs explanations along with predictions. However, existing\nself-explaining models require a large amount of training data, rendering them\nunavailable in few-shot scenarios. To address this challenge, in this paper, we\npropose a Meta-learned Self-Explaining GNN (MSE-GNN), a novel framework that\ngenerates explanations to support predictions in few-shot settings. MSE-GNN\nadopts a two-stage self-explaining structure, consisting of an explainer and a\npredictor. Specifically, the explainer first imitates the attention mechanism\nof humans to select the explanation subgraph, whereby attention is naturally\npaid to regions containing important characteristics. Subsequently, the\npredictor mimics the decision-making process, which makes predictions based on\nthe generated explanation. Moreover, with a novel meta-training process and a\ndesigned mechanism that exploits task information, MSE-GNN can achieve\nremarkable performance on new few-shot tasks. Extensive experimental results on\nfour datasets demonstrate that MSE-GNN can achieve superior performance on\nprediction tasks while generating high-quality explanations compared with\nexisting methods. The code is publicly available at\nhttps://github.com/jypeng28/MSE-GNN.", "paper_summary_zh": "圖神經網路 (GNN) 的最新進展激勵了許多專注於增強 GNN 可解釋性的研究，特別是在醫學等關鍵領域。一種有前景的方法是自解釋方法，它會隨著預測結果輸出解釋。然而，現有的自解釋模型需要大量的訓練資料，這使得它們在少樣本場景中無法使用。為了應對這個挑戰，我們在這篇論文中提出了一個元學習自解釋 GNN (MSE-GNN)，這是一個創新的架構，它會產生解釋來支援少樣本設定中的預測。MSE-GNN 採用一個兩階段自解釋結構，包含一個解釋器和一個預測器。具體來說，解釋器會先模仿人類的注意力機制來選擇解釋子圖，從而自然而然地將注意力放在包含重要特徵的區域。隨後，預測器會模擬決策制定過程，根據產生的解釋進行預測。此外，透過一個創新的元訓練過程和一個利用任務資訊的設計機制，MSE-GNN 可以對新的少樣本任務達成顯著的效能。在四個資料集上的廣泛實驗結果證明，與現有方法相比，MSE-GNN 可以對預測任務達成優異的效能，同時產生高品質的解釋。程式碼已公開於 https://github.com/jypeng28/MSE-GNN。", "author": "Jingyu Peng et.al.", "authors": "Jingyu Peng, Qi Liu, Linan Yue, Zaixi Zhang, Kai Zhang, Yunhao Sha", "id": "2408.07340v1", "paper_url": "http://arxiv.org/abs/2408.07340v1", "repo": "https://github.com/jypeng28/mse-gnn"}}