{"2412.03920": {"publish_time": "2024-12-05", "title": "A Survey on Large Language Model-Based Social Agents in Game-Theoretic Scenarios", "paper_summary": "Game-theoretic scenarios have become pivotal in evaluating the social\nintelligence of Large Language Model (LLM)-based social agents. While numerous\nstudies have explored these agents in such settings, there is a lack of a\ncomprehensive survey summarizing the current progress. To address this gap, we\nsystematically review existing research on LLM-based social agents within\ngame-theoretic scenarios. Our survey organizes the findings into three core\ncomponents: Game Framework, Social Agent, and Evaluation Protocol. The game\nframework encompasses diverse game scenarios, ranging from choice-focusing to\ncommunication-focusing games. The social agent part explores agents'\npreferences, beliefs, and reasoning abilities. The evaluation protocol covers\nboth game-agnostic and game-specific metrics for assessing agent performance.\nBy reflecting on the current research and identifying future research\ndirections, this survey provides insights to advance the development and\nevaluation of social agents in game-theoretic scenarios.", "paper_summary_zh": "博弈论场景已成为评估大型语言模型 (LLM) 为基础的社交代理的社交智能的关键。尽管许多研究已在该场景中探索这些代理，但缺乏一项总结当前进展的综合调查。为了解决这一差距，我们系统性地回顾了博弈论场景中基于 LLM 的社交代理的现有研究。我们的调查将研究结果组织成三个核心组成部分：博弈框架、社交代理和评估协议。博弈框架包含各种博弈场景，从选择聚焦到沟通聚焦的博弈。社交代理部分探索了代理的偏好、信念和推理能力。评估协议涵盖了用于评估代理性能的游戏无关和特定游戏指标。通过反思当前的研究并确定未来的研究方向，本调查为在博弈论场景中推进社交代理的开发和评估提供了见解。", "author": "Xiachong Feng et.al.", "authors": "Xiachong Feng, Longxu Dou, Ella Li, Qinghao Wang, Haochuan Wang, Yu Guo, Chang Ma, Lingpeng Kong", "id": "2412.03920v1", "paper_url": "http://arxiv.org/abs/2412.03920v1", "repo": "null"}}