{"2504.21851": {"publish_time": "2025-04-30", "title": "TRUST: An LLM-Based Dialogue System for Trauma Understanding and Structured Assessments", "paper_summary": "Objectives: While Large Language Models (LLMs) have been widely used to\nassist clinicians and support patients, no existing work has explored dialogue\nsystems for standard diagnostic interviews and assessments. This study aims to\nbridge the gap in mental healthcare accessibility by developing an LLM-powered\ndialogue system that replicates clinician behavior. Materials and Methods: We\nintroduce TRUST, a framework of cooperative LLM modules capable of conducting\nformal diagnostic interviews and assessments for Post-Traumatic Stress Disorder\n(PTSD). To guide the generation of appropriate clinical responses, we propose a\nDialogue Acts schema specifically designed for clinical interviews.\nAdditionally, we develop a patient simulation approach based on real-life\ninterview transcripts to replace time-consuming and costly manual testing by\nclinicians. Results: A comprehensive set of evaluation metrics is designed to\nassess the dialogue system from both the agent and patient simulation\nperspectives. Expert evaluations by conversation and clinical specialists show\nthat TRUST performs comparably to real-life clinical interviews. Discussion:\nOur system performs at the level of average clinicians, with room for future\nenhancements in communication styles and response appropriateness. Conclusions:\nOur TRUST framework shows its potential to facilitate mental healthcare\navailability.", "paper_summary_zh": "<paragraph>目標：雖然大型語言模型 (LLM) 已廣泛用於協助臨床醫生和支援患者，但現有的研究尚未探索用於標準診斷訪談和評估的對話系統。本研究旨在透過開發一個可複製臨床醫生行為的基於 LLM 的對話系統來彌合心理健康照護可及性的差距。材料和方法：我們介紹了 TRUST，這是一個由協作 LLM 模組組成的框架，能夠對創傷後壓力症候群 (PTSD) 進行正式的診斷訪談和評估。為了引導產生適當的臨床反應，我們提出了一個專為臨床訪談設計的對話行為模式。此外，我們還開發了一種基於真實訪談記錄的患者模擬方法，以取代耗時且昂貴的臨床醫生手動測試。結果：設計了一套全面的評估指標，用於從代理和患者模擬的角度評估對話系統。對話和臨床專家的專家評估表明，TRUST 的表現與真實臨床訪談相當。討論：我們的系統的表現與一般臨床醫生相當，未來在溝通方式和反應的適切性方面還有改進的空間。結論：我們的 TRUST 框架顯示出其促進心理健康照護可及性的潛力。</paragraph>\n", "author": "Sichang Tu et.al.", "authors": "Sichang Tu, Abigail Powers, Stephen Doogan, Jinho D. Choi", "id": "2504.21851v1", "paper_url": "http://arxiv.org/abs/2504.21851v1", "repo": "null"}}