{"2408.06598": {"publish_time": "2024-08-13", "title": "A Perspective on Large Language Models, Intelligent Machines, and Knowledge Acquisition", "paper_summary": "Large Language Models (LLMs) are known for their remarkable ability to\ngenerate synthesized 'knowledge', such as text documents, music, images, etc.\nHowever, there is a huge gap between LLM's and human capabilities for\nunderstanding abstract concepts and reasoning. We discuss these issues in a\nlarger philosophical context of human knowledge acquisition and the Turing\ntest. In addition, we illustrate the limitations of LLMs by analyzing GPT-4\nresponses to questions ranging from science and math to common sense reasoning.\nThese examples show that GPT-4 can often imitate human reasoning, even though\nit lacks understanding. However, LLM responses are synthesized from a large LLM\nmodel trained on all available data. In contrast, human understanding is based\non a small number of abstract concepts. Based on this distinction, we discuss\nthe impact of LLMs on acquisition of human knowledge and education.", "paper_summary_zh": "大型語言模型 (LLM) 以其生成綜合「知識」的非凡能力而聞名，例如文字文件、音樂、圖像等。然而，在理解抽象概念和推理方面，LLM 與人類的能力之間存在著巨大的差距。我們在人類知識獲取和圖靈測試的更大哲學背景下探討這些問題。此外，我們透過分析 GPT-4 對從科學和數學到常識推理等問題的回應來說明 LLM 的局限性。這些範例顯示，即使 GPT-4 缺乏理解力，但它經常可以模仿人類的推理。然而，LLM 的回應是由一個訓練於所有可用資料上的大型 LLM 模型綜合而成的。相反地，人類的理解是基於少數抽象概念。根據這個區別，我們探討 LLM 對人類知識和教育獲取的影響。", "author": "Vladimir Cherkassky et.al.", "authors": "Vladimir Cherkassky, Eng Hock Lee", "id": "2408.06598v1", "paper_url": "http://arxiv.org/abs/2408.06598v1", "repo": "null"}}