{"2407.06754": {"publish_time": "2024-07-09", "title": "Threats and Defenses in Federated Learning Life Cycle: A Comprehensive Survey and Challenges", "paper_summary": "Federated Learning (FL) offers innovative solutions for privacy-preserving\ncollaborative machine learning (ML). Despite its promising potential, FL is\nvulnerable to various attacks due to its distributed nature, affecting the\nentire life cycle of FL services. These threats can harm the model's utility or\ncompromise participants' privacy, either directly or indirectly. In response,\nnumerous defense frameworks have been proposed, demonstrating effectiveness in\nspecific settings and scenarios. To provide a clear understanding of the\ncurrent research landscape, this paper reviews the most representative and\nstate-of-the-art threats and defense frameworks throughout the FL service life\ncycle. We start by identifying FL threats that harm utility and privacy,\nincluding those with potential or direct impacts. Then, we dive into the\ndefense frameworks, analyze the relationship between threats and defenses, and\ncompare the trade-offs among different defense strategies. Finally, we\nsummarize current research bottlenecks and offer insights into future research\ndirections to conclude this survey. We hope this survey sheds light on\ntrustworthy FL research and contributes to the FL community.", "paper_summary_zh": "聯邦學習 (FL) 為注重隱私的協作機器學習 (ML) 提供創新解決方案。儘管 FL 具有令人期待的潛力，但由於其分散式特性，它容易受到各種攻擊，影響 FL 服務的整個生命週期。這些威脅可能會直接或間接損害模型的效用或危害參與者的隱私。為了解決這個問題，已經提出了許多防禦架構，證明了在特定設定和情境中的有效性。為了清楚了解當前的研究現況，本文回顧了整個 FL 服務生命週期中最具代表性和最先進的威脅和防禦架構。我們首先找出會損害效用和隱私的 FL 威脅，包括具有潛在或直接影響的威脅。接著，我們深入探討防禦架構，分析威脅和防禦之間的關係，並比較不同防禦策略之間的取捨。最後，我們總結目前的瓶頸，並提供對未來研究方向的見解，作為本調查的結論。我們希望這項調查能為值得信賴的 FL 研究帶來啟發，並對 FL 社群有所貢獻。", "author": "Yanli Li et.al.", "authors": "Yanli Li, Jifei Hu, Zhongliang Guo, Nan Yang, Huaming Chen, Dong Yuan, Weiping Ding", "id": "2407.06754v1", "paper_url": "http://arxiv.org/abs/2407.06754v1", "repo": "null"}}