{"2411.03284": {"publish_time": "2024-11-05", "title": "SMoA: Improving Multi-agent Large Language Models with Sparse Mixture-of-Agents", "paper_summary": "While multi-agent systems have been shown to significantly enhance the\nperformance of Large Language Models (LLMs) across various tasks and\napplications, the dense interaction between scaling agents potentially hampers\ntheir efficiency and diversity. To address these challenges, we draw\ninspiration from the sparse mixture-of-agents (SMoE) and propose a sparse\nmixture-of-agents (SMoA) framework to improve the efficiency and diversity of\nmulti-agent LLMs. Unlike completely connected structures, SMoA introduces novel\nResponse Selection and Early Stopping mechanisms to sparsify information flows\namong individual LLM agents, striking a balance between performance and\nefficiency. Additionally, inspired by the expert diversity principle in SMoE\nframeworks for workload balance between experts, we assign distinct role\ndescriptions to each LLM agent, fostering diverse and divergent thinking.\nExtensive experiments on reasoning, alignment, and fairness benchmarks\ndemonstrate that SMoA achieves performance comparable to traditional\nmixture-of-agents approaches but with significantly lower computational costs.\nFurther analysis reveals that SMoA is more stable, has a greater capacity to\nscale, and offers considerable potential through hyper-parameter optimization.\nCode and data will be available at: https://github.com/David-Li0406/SMoA.", "paper_summary_zh": "儘管多智能體系統已被證明能顯著提升大型語言模型 (LLM) 在各種任務和應用中的效能，但擴充智能體之間的密集互動潛在會阻礙其效率和多樣性。為了應對這些挑戰，我們從稀疏混合智能體 (SMoE) 汲取靈感，並提出一個稀疏混合智能體 (SMoA) 架構來提升多智能體 LLM 的效率和多樣性。與完全連接的結構不同，SMoA 引進了新穎的回應選擇和提前停止機制，以稀疏化個別 LLM 智能體之間的資訊流，在效能和效率之間取得平衡。此外，在 SMoE 架構中受到專家多樣性原則的啟發，以平衡專家之間的工作負載，我們為每個 LLM 智能體分配了不同的角色描述，以促進多樣化和發散性思考。在推理、對齊和公平基準上的廣泛實驗證明，SMoA 達到了與傳統混合智能體方法相當的效能，但計算成本卻顯著降低。進一步的分析顯示，SMoA 更加穩定，具有更大的擴充能力，並透過超參數最佳化提供了可觀的潛力。程式碼和資料將於以下網址提供：https://github.com/David-Li0406/SMoA。", "author": "Dawei Li et.al.", "authors": "Dawei Li, Zhen Tan, Peijia Qian, Yifan Li, Kumar Satvik Chaudhary, Lijie Hu, Jiayi Shen", "id": "2411.03284v1", "paper_url": "http://arxiv.org/abs/2411.03284v1", "repo": "https://github.com/david-li0406/smoa"}}