{"2410.17906": {"publish_time": "2024-10-23", "title": "Leveraging Deep Learning for Time Series Extrinsic Regression in predicting photometric metallicity of Fundamental-mode RR Lyrae Stars", "paper_summary": "Astronomy is entering an unprecedented era of Big Data science, driven by\nmissions like the ESA's Gaia telescope, which aims to map the Milky Way in\nthree dimensions. Gaia's vast dataset presents a monumental challenge for\ntraditional analysis methods. The sheer scale of this data exceeds the\ncapabilities of manual exploration, necessitating the utilization of advanced\ncomputational techniques. In response to this challenge, we developed a novel\napproach leveraging deep learning to estimate the metallicity of fundamental\nmode (ab-type) RR Lyrae stars from their light curves in the Gaia optical\nG-band. Our study explores applying deep learning techniques, particularly\nadvanced neural network architectures, in predicting photometric metallicity\nfrom time-series data. Our deep learning models demonstrated notable predictive\nperformance, with a low mean absolute error (MAE) of 0.0565, the root mean\nsquare error (RMSE) achieved is 0.0765 and a high $R^2$ regression performance\nof 0.9401 measured by cross-validation. The weighted mean absolute error (wMAE)\nis 0.0563, while the weighted root mean square error (wRMSE) is 0.0763. These\nresults showcase the effectiveness of our approach in accurately estimating\nmetallicity values. Our work underscores the importance of deep learning in\nastronomical research, particularly with large datasets from missions like\nGaia. By harnessing the power of deep learning methods, we can provide\nprecision in analyzing vast datasets, contributing to more precise and\ncomprehensive insights into complex astronomical phenomena.", "paper_summary_zh": "天文學正進入大數據科學的空前時代，推動這項進展的是像歐洲太空總署的蓋亞望遠鏡等任務，其目標是繪製銀河系的三維地圖。蓋亞的龐大資料集對傳統分析方法來說是一項巨大的挑戰。這類資料的規模龐大，超過了人工探索的能力，因此必須使用先進的運算技術。為了應對這項挑戰，我們開發了一種新穎的方法，利用深度學習估計基本模式（ab 型）RR Lyrae 星的光度曲線中的金屬量。我們的研究探索了應用深度學習技術，特別是先進的神經網路架構，從時間序列資料中預測光度金屬量。我們的深度學習模型展現了顯著的預測效能，平均絕對誤差 (MAE) 低至 0.0565，均方根誤差 (RMSE) 達到 0.0765，而根據交叉驗證測量的 $R^2$ 回歸效能高達 0.9401。加權平均絕對誤差 (wMAE) 為 0.0563，而加權均方根誤差 (wRMSE) 為 0.0763。這些結果證明了我們的方法在準確估計金屬量值方面的有效性。我們的研究強調了深度學習在天文研究中的重要性，特別是在像蓋亞任務等任務所產生的龐大資料集方面。透過利用深度學習方法的力量，我們可以精確分析龐大的資料集，進而對複雜的天文現象做出更精確且全面的見解。", "author": "Lorenzo Monti et.al.", "authors": "Lorenzo Monti, Tatiana Muraveva, Gisella Clementini, Alessia Garofalo", "id": "2410.17906v1", "paper_url": "http://arxiv.org/abs/2410.17906v1", "repo": "https://github.com/lorenzomonti/metallicity_rrls"}}