{"2406.17450": {"publish_time": "2024-06-25", "title": "Pseudo Labelling for Enhanced Masked Autoencoders", "paper_summary": "Masked Image Modeling (MIM)-based models, such as SdAE, CAE, GreenMIM, and\nMixAE, have explored different strategies to enhance the performance of Masked\nAutoencoders (MAE) by modifying prediction, loss functions, or incorporating\nadditional architectural components. In this paper, we propose an enhanced\napproach that boosts MAE performance by integrating pseudo labelling for both\nclass and data tokens, alongside replacing the traditional pixel-level\nreconstruction with token-level reconstruction. This strategy uses cluster\nassignments as pseudo labels to promote instance-level discrimination within\nthe network, while token reconstruction requires generation of discrete tokens\nencapturing local context. The targets for pseudo labelling and reconstruction\nneeds to be generated by a teacher network. To disentangle the generation of\ntarget pseudo labels and the reconstruction of the token features, we decouple\nthe teacher into two distinct models, where one serves as a labelling teacher\nand the other as a reconstruction teacher. This separation proves empirically\nsuperior to a single teacher, while having negligible impact on throughput and\nmemory consumption. Incorporating pseudo-labelling as an auxiliary task has\ndemonstrated notable improvements in ImageNet-1K and other downstream tasks,\nincluding classification, semantic segmentation, and detection.", "paper_summary_zh": "基於遮罩圖像建模 (MIM) 的模型，例如 SdAE、CAE、GreenMIM 和 MixAE，已探索不同的策略，藉由修改預測、損失函數或整合額外的架構元件來提升遮罩自動編碼器 (MAE) 的效能。在本文中，我們提出了一種增強方法，透過整合類別和資料代碼的偽標籤，以及用代碼層級重建取代傳統的像素層級重建，來提升 MAE 效能。此策略使用叢集分配作為偽標籤，以促進網路內的實例層級辨別，而代碼重建則需要產生擷取局部內容的離散代碼。偽標籤和重建的目標需要由教師網路產生。為了解開目標偽標籤的產生和代碼特徵的重建，我們將教師解耦成兩個不同的模型，其中一個作為標籤教師，另一個作為重建教師。此分離經過實證證明優於單一教師，同時對吞吐量和記憶體消耗的影響可以忽略不計。將偽標籤納入輔助任務已證實顯著提升 ImageNet-1K 和其他下游任務，包括分類、語意分割和偵測。", "author": "Srinivasa Rao Nandam et.al.", "authors": "Srinivasa Rao Nandam, Sara Atito, Zhenhua Feng, Josef Kittler, Muhammad Awais", "id": "2406.17450v1", "paper_url": "http://arxiv.org/abs/2406.17450v1", "repo": "null"}}