{"2412.00554": {"publish_time": "2024-11-30", "title": "Unveiling Performance Challenges of Large Language Models in Low-Resource Healthcare: A Demographic Fairness Perspective", "paper_summary": "This paper studies the performance of large language models (LLMs),\nparticularly regarding demographic fairness, in solving real-world healthcare\ntasks. We evaluate state-of-the-art LLMs with three prevalent learning\nframeworks across six diverse healthcare tasks and find significant challenges\nin applying LLMs to real-world healthcare tasks and persistent fairness issues\nacross demographic groups. We also find that explicitly providing demographic\ninformation yields mixed results, while LLM's ability to infer such details\nraises concerns about biased health predictions. Utilizing LLMs as autonomous\nagents with access to up-to-date guidelines does not guarantee performance\nimprovement. We believe these findings reveal the critical limitations of LLMs\nin healthcare fairness and the urgent need for specialized research in this\narea.", "paper_summary_zh": "本文探討大型語言模型 (LLM) 的效能，特別是在人口統計公平性方面，以解決現實世界的醫療保健任務。我們評估了最先進的 LLM，採用三個流行的學習架構，涵蓋六項不同的醫療保健任務，發現將 LLM 應用於現實世界的醫療保健任務時會面臨重大挑戰，並且在不同人口統計群體中存在持續的公平性問題。我們還發現，明確提供人口統計資訊會產生不同的結果，而 LLM 推斷此類細節的能力引發了對有偏見的健康預測的擔憂。利用 LLM 作為具有存取最新指南的自主代理並不能保證效能提升。我們相信這些發現揭示了 LLM 在醫療保健公平性方面的重大限制，以及對此領域進行專門研究的迫切需要。", "author": "Yue Zhou et.al.", "authors": "Yue Zhou, Barbara Di Eugenio, Lu Cheng", "id": "2412.00554v1", "paper_url": "http://arxiv.org/abs/2412.00554v1", "repo": "null"}}