{"2502.05494": {"publish_time": "2025-02-08", "title": "Multi-scale Masked Autoencoder for Electrocardiogram Anomaly Detection", "paper_summary": "Electrocardiogram (ECG) analysis is a fundamental tool for diagnosing\ncardiovascular conditions, yet anomaly detection in ECG signals remains\nchallenging due to their inherent complexity and variability. We propose\nMulti-scale Masked Autoencoder for ECG anomaly detection (MMAE-ECG), a novel\nend-to-end framework that effectively captures both global and local\ndependencies in ECG data. Unlike state-of-the-art methods that rely on\nheartbeat segmentation or R-peak detection, MMAE-ECG eliminates the need for\nsuch pre-processing steps, enhancing its suitability for clinical deployment.\nMMAE-ECG partitions ECG signals into non-overlapping segments, with each\nsegment assigned learnable positional embeddings. A novel multi-scale masking\nstrategy and multi-scale attention mechanism, along with distinct positional\nembeddings, enable a lightweight Transformer encoder to effectively capture\nboth local and global dependencies. The masked segments are then reconstructed\nusing a single-layer Transformer block, with an aggregation strategy employed\nduring inference to refine the outputs. Experimental results demonstrate that\nour method achieves performance comparable to state-of-the-art approaches while\nsignificantly reducing computational complexity-approximately 1/78 of the\nfloating-point operations (FLOPs) required for inference. Ablation studies\nfurther validate the effectiveness of each component, highlighting the\npotential of multi-scale masked autoencoders for anomaly detection.", "paper_summary_zh": "心電圖 (ECG) 分析是診斷心血管疾病的基本工具，但由於 ECG 訊號本身的複雜性和變異性，異常偵測仍然是一項挑戰。我們提出用於 ECG 異常偵測的多尺度遮罩自編碼器 (MMAE-ECG)，這是一個新穎的端對端架構，可有效擷取 ECG 資料中的全局和局部依賴關係。與依賴於心跳區段或 R 波峰偵測的最新方法不同，MMAE-ECG 消除了對此類前處理步驟的需求，增強其適用於臨床部署。MMAE-ECG 將 ECG 訊號分割成不相疊的區段，每個區段都指派可學習的位置嵌入。新穎的多尺度遮罩策略和多尺度注意力機制，以及不同的位置嵌入，使輕量級 Transformer 編碼器能夠有效擷取局部和全局依賴關係。然後使用單層 Transformer 區塊重建遮罩區段，並在推理期間採用聚合策略來優化輸出。實驗結果表明，我們的模型達到了與最新方法相當的效能，同時大幅降低運算複雜度，約為推理所需的浮點運算 (FLOP) 的 1/78。消融研究進一步驗證了每個組件的有效性，突顯了多尺度遮罩自編碼器在異常偵測方面的潛力。", "author": "Ya Zhou et.al.", "authors": "Ya Zhou, Yujie Yang, Jianhuang Gan, Xiangjie Li, Jing Yuan, Wei Zhao", "id": "2502.05494v1", "paper_url": "http://arxiv.org/abs/2502.05494v1", "repo": "null"}}