{"2404.18519": {"publish_time": "2024-04-29", "title": "On the Impact of Data Heterogeneity in Federated Learning Environments with Application to Healthcare Networks", "paper_summary": "Federated Learning (FL) allows multiple privacy-sensitive applications to\nleverage their dataset for a global model construction without any disclosure\nof the information. One of those domains is healthcare, where groups of silos\ncollaborate in order to generate a global predictor with improved accuracy and\ngeneralization. However, the inherent challenge lies in the high heterogeneity\nof medical data, necessitating sophisticated techniques for assessment and\ncompensation. This paper presents a comprehensive exploration of the\nmathematical formalization and taxonomy of heterogeneity within FL\nenvironments, focusing on the intricacies of medical data. In particular, we\naddress the evaluation and comparison of the most popular FL algorithms with\nrespect to their ability to cope with quantity-based, feature and label\ndistribution-based heterogeneity. The goal is to provide a quantitative\nevaluation of the impact of data heterogeneity in FL systems for healthcare\nnetworks as well as a guideline on FL algorithm selection. Our research extends\nbeyond existing studies by benchmarking seven of the most common FL algorithms\nagainst the unique challenges posed by medical data use cases. The paper\ntargets the prediction of the risk of stroke recurrence through a set of\ntabular clinical reports collected by different federated hospital silos: data\nheterogeneity frequently encountered in this scenario and its impact on FL\nperformance are discussed.", "paper_summary_zh": "<paragraph>聯邦學習 (FL) 允許多個注重隱私的應用程式利用其資料集建立全球模型，而無需公開資訊。其中一個領域是醫療保健，其中孤島群組合作以產生具有改進準確度和概括性的全球預測器。然而，內在的挑戰在於醫療資料的高度異質性，這需要複雜的評估和補償技術。本文對 FL 環境中的異質性的數學形式化和分類進行了全面的探討，重點關注醫療資料的複雜性。特別是，我們針對最流行的 FL 演算法進行評估和比較，以了解其應對基於數量、特徵和標籤分佈的異質性的能力。目標是對 FL 系統中資料異質性對醫療保健網路的影響進行定量評估，並提供有關 FL 演算法選擇的指南。我們的研究超越了現有研究，針對醫療資料使用案例提出的獨特挑戰，對七種最常見的 FL 演算法進行了基準測試。本文針對由不同聯邦醫院孤島收集的一組表格臨床報告，預測中風復發的風險：討論了此情境中經常遇到的資料異質性及其對 FL 性能的影響。</paragraph>", "author": "Usevalad Milasheuski. Luca Barbieri et.al.", "authors": "Usevalad Milasheuski. Luca Barbieri, Bernardo Camajori Tedeschini, Monica Nicoli, Stefano Savazzi", "id": "2404.18519v2", "paper_url": "http://arxiv.org/abs/2404.18519v2", "repo": "null"}}