{"2408.03505": {"publish_time": "2024-08-07", "title": "Optimus: Accelerating Large-Scale Multi-Modal LLM Training by Bubble Exploitation", "paper_summary": "Multimodal large language models (MLLMs) have extended the success of large\nlanguage models (LLMs) to multiple data types, such as image, text and audio,\nachieving significant performance in various domains, including multimodal\ntranslation, visual question answering and content generation. Nonetheless,\nexisting systems are inefficient to train MLLMs due to substantial GPU bubbles\ncaused by the heterogeneous modality models and complex data dependencies in 3D\nparallelism. This paper proposes Optimus, a distributed MLLM training system\nthat reduces end-to-end MLLM training time. Optimus is based on our principled\nanalysis that scheduling the encoder computation within the LLM bubbles can\nreduce bubbles in MLLM training. To make scheduling encoder computation\npossible for all GPUs, Optimus searches the separate parallel plans for encoder\nand LLM, and adopts a bubble scheduling algorithm to enable exploiting LLM\nbubbles without breaking the original data dependencies in the MLLM model\narchitecture. We further decompose encoder layer computation into a series of\nkernels, and analyze the common bubble pattern of 3D parallelism to carefully\noptimize the sub-millisecond bubble scheduling, minimizing the overall training\ntime. Our experiments in a production cluster show that Optimus accelerates\nMLLM training by 20.5%-21.3% with ViT-22B and GPT-175B model over 3072 GPUs\ncompared to baselines.", "paper_summary_zh": "多模態大型語言模型 (MLLM) 已將大型語言模型 (LLM) 的成功擴展到多種資料類型，例如影像、文字和音訊，在多模態翻譯、視覺問答和內容產生等各種領域中均取得顯著的表現。儘管如此，現有的系統由於異質模態模型和 3D 並行處理中複雜的資料依賴性而導致大量的 GPU 暫停，因此訓練 MLLM 的效率很低。本文提出 Optimus，這是一個分散式的 MLLM 訓練系統，可減少端對端的 MLLM 訓練時間。Optimus 是基於我們有原則的分析，即在 LLM 暫停中排程編碼器運算可以減少 MLLM 訓練中的暫停。為使所有 GPU 都能排程編碼器運算，Optimus 會搜尋編碼器和 LLM 的獨立並行計畫，並採用暫停排程演算法，以利用 LLM 暫停，而不會中斷 MLLM 模型架構中的原始資料依賴性。我們進一步將編碼器層運算分解成一系列的核，並分析 3D 並行處理的常見暫停模式，以仔細最佳化次毫秒的暫停排程，將整體訓練時間降至最低。我們在生產叢集中的實驗顯示，與基準相比，Optimus 在 3072 個 GPU 上使用 ViT-22B 和 GPT-175B 模型，將 MLLM 訓練速度加快了 20.5%-21.3%。", "author": "Weiqi Feng et.al.", "authors": "Weiqi Feng, Yangrui Chen, Shaoyu Wang, Yanghua Peng, Haibin Lin, Minlan Yu", "id": "2408.03505v1", "paper_url": "http://arxiv.org/abs/2408.03505v1", "repo": "null"}}