{"2501.04155": {"publish_time": "2025-01-07", "title": "MM-GEN: Enhancing Task Performance Through Targeted Multimodal Data Curation", "paper_summary": "Vision-language models (VLMs) are highly effective but often underperform on\nspecialized tasks; for example, Llava-1.5 struggles with chart and diagram\nunderstanding due to scarce task-specific training data. Existing training\ndata, sourced from general-purpose datasets, fails to capture the nuanced\ndetails needed for these tasks. We introduce MM-Gen, a scalable method that\ngenerates task-specific, high-quality synthetic text for candidate images by\nleveraging stronger models. MM-Gen employs a three-stage targeted process:\npartitioning data into subgroups, generating targeted text based on task\ndescriptions, and filtering out redundant and outlier data. Fine-tuning VLMs\nwith data generated by MM-Gen leads to significant performance gains, including\n29% on spatial reasoning and 15% on diagram understanding for Llava-1.5 (7B).\nCompared to human-curated caption data, MM-Gen achieves up to 1.6x better\nimprovements for the original models, proving its effectiveness in enhancing\ntask-specific VLM performance and bridging the gap between general-purpose\ndatasets and specialized requirements. Code available at\nhttps://github.com/sjoshi804/MM-Gen.", "paper_summary_zh": "視覺語言模型 (VLM) 非常有效，但通常在專門任務上表現不佳；例如，由於缺乏特定任務的訓練資料，Llava-1.5 在理解圖表和圖解時會遇到困難。現有的訓練資料來自一般用途的資料集，無法擷取這些任務所需的細微細節。我們引入了 MM-Gen，這是一種可擴充的方法，它利用更強大的模型為候選影像產生特定於任務的高品質合成文字。MM-Gen 採用一個三階段目標流程：將資料分割成子群組、根據任務說明產生目標文字，並過濾掉多餘和異常資料。使用 MM-Gen 產生的資料微調 VLM 會帶來顯著的效能提升，包括 Llava-1.5 (7B) 的空間推理提升 29%，圖解理解提升 15%。與人工策展的標題資料相比，MM-Gen 為原始模型實現了高達 1.6 倍的改進，證明了其在增強特定任務的 VLM 效能和彌合一般用途資料集與特定需求之間的差距方面的有效性。程式碼可於 https://github.com/sjoshi804/MM-Gen 取得。", "author": "Siddharth Joshi et.al.", "authors": "Siddharth Joshi, Besmira Nushi, Vidhisha Balachandran, Varun Chandrasekaran, Vibhav Vineet, Neel Joshi, Baharan Mirzasoleiman", "id": "2501.04155v1", "paper_url": "http://arxiv.org/abs/2501.04155v1", "repo": "https://github.com/sjoshi804/mm-gen"}}