{"2501.14275": {"publish_time": "2025-01-24", "title": "Leveraging Online Olympiad-Level Math Problems for LLMs Training and Contamination-Resistant Evaluation", "paper_summary": "Advances in Large Language Models (LLMs) have sparked interest in their\nability to solve Olympiad-level math problems. However, the training and\nevaluation of these models are constrained by the limited size and quality of\navailable datasets, as creating large-scale data for such advanced problems\nrequires extensive effort from human experts. In addition, current benchmarks\nare prone to contamination, leading to unreliable evaluations. In this paper,\nwe present an automated pipeline that leverages the rich resources of the Art\nof Problem Solving (AoPS) forum, which predominantly features Olympiad-level\nproblems and community-driven solutions. Using open-source LLMs, we develop a\nmethod to extract question-answer pairs from the forum, resulting in\nAoPS-Instruct, a dataset of more than 600,000 high-quality QA pairs. Our\nexperiments demonstrate that fine-tuning LLMs on AoPS-Instruct improves their\nreasoning abilities across various benchmarks. Moreover, we build an automatic\npipeline that introduces LiveAoPSBench, an evolving evaluation set with\ntimestamps, derived from the latest forum data, providing a\ncontamination-resistant benchmark for assessing LLM performance. Notably, we\nobserve a significant decline in LLM performance over time, suggesting their\nsuccess on older examples may stem from pre-training exposure rather than true\nreasoning ability. Our work presents a scalable approach to creating and\nmaintaining large-scale, high-quality datasets for advanced math reasoning,\noffering valuable insights into the capabilities and limitations of LLMs in\nthis domain. Our benchmark and code is available at\nhttps://github.com/DSL-Lab/aops", "paper_summary_zh": "大型語言模型 (LLM) 的進步激發了人們對其解決奧林匹克數學問題能力的興趣。然而，這些模型的訓練和評估受到可用數據集規模和品質的限制，因為為這類進階問題建立大規模數據需要人類專家的廣泛努力。此外，目前的基準容易受到汙染，導致評估不可靠。在本文中，我們提出了一個自動化管道，利用了問題解決的藝術 (AoPS) 論壇的豐富資源，該論壇主要以奧林匹克程度的問題和社群驅動的解決方案為特色。使用開源 LLM，我們開發了一種從論壇中萃取問答配對的方法，產生了 AoPS-Instruct，一個包含超過 600,000 個高品質 QA 配對的數據集。我們的實驗證明，在 AoPS-Instruct 上微調 LLM 能夠提升其在各種基準上的推理能力。此外，我們建立了一個自動化管道，引入了 LiveAoPSBench，一個從最新論壇數據衍生的、帶有時間戳記的演化評估集，提供了一個抗汙染的基準來評估 LLM 效能。值得注意的是，我們觀察到 LLM 效能隨著時間推移而顯著下降，這表明它們在較舊範例上的成功可能源於預訓練曝光，而不是真正的推理能力。我們的研究提出了一個可擴展的方法來建立和維護用於進階數學推理的大規模、高品質數據集，提供了關於 LLM 在此領域中能力和限制的寶貴見解。我們的基準和程式碼可以在 https://github.com/DSL-Lab/aops 取得", "author": "Sadegh Mahdavi et.al.", "authors": "Sadegh Mahdavi, Muchen Li, Kaiwen Liu, Christos Thrampoulidis, Leonid Sigal, Renjie Liao", "id": "2501.14275v1", "paper_url": "http://arxiv.org/abs/2501.14275v1", "repo": "https://github.com/dsl-lab/aops"}}