{"2411.13332": {"publish_time": "2024-11-20", "title": "Verifying Machine Unlearning with Explainable AI", "paper_summary": "We investigate the effectiveness of Explainable AI (XAI) in verifying Machine\nUnlearning (MU) within the context of harbor front monitoring, focusing on data\nprivacy and regulatory compliance. With the increasing need to adhere to\nprivacy legislation such as the General Data Protection Regulation (GDPR),\ntraditional methods of retraining ML models for data deletions prove\nimpractical due to their complexity and resource demands. MU offers a solution\nby enabling models to selectively forget specific learned patterns without full\nretraining. We explore various removal techniques, including data relabeling,\nand model perturbation. Then, we leverage attribution-based XAI to discuss the\neffects of unlearning on model performance. Our proof-of-concept introduces\nfeature importance as an innovative verification step for MU, expanding beyond\ntraditional metrics and demonstrating techniques' ability to reduce reliance on\nundesired patterns. Additionally, we propose two novel XAI-based metrics,\nHeatmap Coverage (HC) and Attention Shift (AS), to evaluate the effectiveness\nof these methods. This approach not only highlights how XAI can complement MU\nby providing effective verification, but also sets the stage for future\nresearch to enhance their joint integration.", "paper_summary_zh": "我們探討可解釋人工智慧 (XAI) 在驗證機器遺忘 (MU) 中的有效性，在港口前監控的背景下，重點關注資料隱私和法規遵循。隨著越來越需要遵守隱私法規，例如一般資料保護規範 (GDPR)，傳統的機器學習模型重新訓練方法對於資料刪除來說證明不切實際，因為它們很複雜且需要大量資源。MU 提供了一個解決方案，讓模型能夠選擇性地遺忘特定的學習模式，而無需完全重新訓練。我們探索各種移除技術，包括資料重新標記和模型擾動。然後，我們利用基於歸因的 XAI 來討論遺忘對模型效能的影響。我們的概念驗證將特徵重要性作為 MU 的創新驗證步驟，擴展到傳統指標之外，並展示技術減少對不需要模式依賴的能力。此外，我們提出了兩個新穎的基於 XAI 的指標，熱圖覆蓋率 (HC) 和注意力轉移 (AS)，以評估這些方法的有效性。這種方法不僅強調 XAI 如何透過提供有效的驗證來補充 MU，而且還為未來的研究奠定了基礎，以增強它們的聯合整合。", "author": "Àlex Pujol Vidal et.al.", "authors": "Àlex Pujol Vidal, Anders S. Johansen, Mohammad N. S. Jahromi, Sergio Escalera, Kamal Nasrollahi, Thomas B. Moeslund", "id": "2411.13332v1", "paper_url": "http://arxiv.org/abs/2411.13332v1", "repo": "null"}}