{"2406.12502": {"publish_time": "2024-06-18", "title": "Code-Optimise: Self-Generated Preference Data for Correctness and Efficiency", "paper_summary": "Code Language Models have been trained to generate accurate solutions,\ntypically with no regard for runtime. On the other hand, previous works that\nexplored execution optimisation have observed corresponding drops in functional\ncorrectness. To that end, we introduce Code-Optimise, a framework that\nincorporates both correctness (passed, failed) and runtime (quick, slow) as\nlearning signals via self-generated preference data. Our framework is both\nlightweight and robust as it dynamically selects solutions to reduce\noverfitting while avoiding a reliance on larger models for learning signals.\nCode-Optimise achieves significant improvements in pass@k while decreasing the\ncompetitive baseline runtimes by an additional 6% for in-domain data and up to\n3% for out-of-domain data. As a byproduct, the average length of the generated\nsolutions is reduced by up to 48% on MBPP and 23% on HumanEval, resulting in\nfaster and cheaper inference. The generated data and codebase will be\nopen-sourced at www.open-source.link.", "paper_summary_zh": "程式碼語言模型已經被訓練成產生精確的解決方案，通常不考慮執行時間。另一方面，先前探索執行最佳化的作品已經觀察到相應的功能正確性下降。為此，我們引進 Code-Optimise，一個將正確性（通過、失敗）和執行時間（快速、慢速）都納入作為學習訊號的框架，透過自產的偏好資料。我們的框架既輕量又強大，因為它動態選擇解決方案來降低過度擬合，同時避免依賴較大的模型來學習訊號。Code-Optimise 在 pass@k 方面取得顯著的進步，同時將競爭基準執行時間進一步降低 6%，用於領域內資料，並將領域外資料降低高達 3%。作為副產品，產生的解決方案的平均長度在 MBPP 上減少了 48%，在 HumanEval 上減少了 23%，導致更快速、更便宜的推論。產生的資料和程式碼庫將在 www.open-source.link 開源。", "author": "Leonidas Gee et.al.", "authors": "Leonidas Gee, Milan Gritta, Gerasimos Lampouras, Ignacio Iacobacci", "id": "2406.12502v1", "paper_url": "http://arxiv.org/abs/2406.12502v1", "repo": "null"}}