{"2407.19965": {"publish_time": "2024-07-29", "title": "Simply Trainable Nearest Neighbour Machine Translation with GPU Inference", "paper_summary": "Nearest neighbor machine translation is a successful approach for fast domain\nadaption, which interpolates the pre-trained transformers with domain-specific\ntoken-level k-nearest-neighbor (kNN) retrieval without retraining. Despite kNN\nMT's success, searching large reference corpus and fixed interpolation between\nthe kNN and pre-trained model led to computational complexity and translation\nquality challenges. Among other papers, Dai et al. proposed methods to obtain a\nsmall number of reference samples dynamically for which they introduced a\ndistance-aware interpolation method using an equation that includes free\nparameters. This paper proposes a simply trainable nearest neighbor machine\ntranslation and carry out inference experiments on GPU. Similar to Dai et al.,\nwe first adaptively construct a small datastore for each input sentence.\nSecond, we train a single-layer network for the interpolation coefficient\nbetween the knnMT and pre-trained result to automatically interpolate in\ndifferent domains. Experimental results on different domains show that our\nproposed method either improves or sometimes maintain the translation quality\nof methods in Dai et al. while being automatic. In addition, our GPU inference\nresults demonstrate that knnMT can be integrated into GPUs with a drop of only\n5% in terms of speed.", "paper_summary_zh": "最近邻机器翻译是一种成功的快速领域适应方法，它通过域特定标记级 k-最近邻 (kNN) 检索来内插预先训练的转换器，而无需重新训练。尽管 kNN MT 取得了成功，但在 kNN 和预训练模型之间搜索大型参考语料库和固定内插导致了计算复杂性和翻译质量挑战。在其他论文中，Dai 等人提出了获取少量参考样本的方法，他们为此引入了一种使用包含自由参数的方程的距离感知内插方法。本文提出了一种简单可训练的最近邻机器翻译，并在 GPU 上进行推理实验。与 Dai 等人类似，我们首先为每个输入句子自适应地构建一个小数据存储。其次，我们训练一个单层网络，用于 knnMT 和预训练结果之间的内插系数，以在不同的域中自动内插。不同域的实验结果表明，我们提出的方法在自动化的同时，提高了或有时保持了 Dai 等人方法的翻译质量。此外，我们的 GPU 推理结果表明，knnMT 可以集成到 GPU 中，速度仅下降 5%。", "author": "Hossam Amer et.al.", "authors": "Hossam Amer, Abdelrahman Abouelenin, Mohamed Maher, Evram Nairouz, Mohamed Afify, Hany Awadallah", "id": "2407.19965v1", "paper_url": "http://arxiv.org/abs/2407.19965v1", "repo": "null"}}