{"2501.12615": {"publish_time": "2025-01-22", "title": "GATE: Adaptive Learning with Working Memory by Information Gating in Multi-lamellar Hippocampal Formation", "paper_summary": "Hippocampal formation (HF) can rapidly adapt to varied environments and build\nflexible working memory (WM). To mirror the HF's mechanism on generalization\nand WM, we propose a model named Generalization and Associative Temporary\nEncoding (GATE), which deploys a 3-D multi-lamellar dorsoventral (DV)\narchitecture, and learns to build up internally representation from externally\ndriven information layer-wisely. In each lamella, regions of HF:\nEC3-CA1-EC5-EC3 forms a re-entrant loop that discriminately maintains\ninformation by EC3 persistent activity, and selectively readouts the retained\ninformation by CA1 neurons. CA3 and EC5 further provides gating function that\ncontrols these processes. After learning complex WM tasks, GATE forms neuron\nrepresentations that align with experimental records, including splitter, lap,\nevidence, trace, delay-active cells, as well as conventional place cells.\nCrucially, DV architecture in GATE also captures information, range from\ndetailed to abstract, which enables a rapid generalization ability when cue,\nenvironment or task changes, with learned representations inherited. GATE\npromises a viable framework for understanding the HF's flexible memory\nmechanisms and for progressively developing brain-inspired intelligent systems.", "paper_summary_zh": "海馬迴（HF）能快速適應各種環境並建立彈性的工作記憶（WM）。為了反映 HF 在概化和 WM 上的機制，我們提出一個名為概化和聯想暫時編碼（GATE）的模型，它部署了一個 3D 多層背腹（DV）架構，並學習從外部驅動的信息逐層建立內部表徵。在每個層板中，HF 區域：EC3-CA1-EC5-EC3 形成一個重入迴路，通過 EC3 持續活動來區別性地維護信息，並通過 CA1 神經元選擇性地讀取保留的信息。CA3 和 EC5 進一步提供控制這些過程的閘控功能。在學習複雜的 WM 任務後，GATE 形成與實驗記錄一致的神經元表徵，包括分離器、迴路、證據、痕跡、延遲激活細胞以及傳統位置細胞。至關重要的是，GATE 中的 DV 架構還捕獲了從具體到抽象的信息，當線索、環境或任務發生變化時，這使得能夠快速概化能力，並繼承學習到的表徵。GATE 為理解 HF 的靈活記憶機制和逐步開發受大腦啟發的智能系統提供了一個可行的框架。", "author": "Yuechen Liu et.al.", "authors": "Yuechen Liu, Zishun Wang, Chen Qiao, Zongben Xu", "id": "2501.12615v1", "paper_url": "http://arxiv.org/abs/2501.12615v1", "repo": "null"}}