{"2410.04636": {"publish_time": "2024-10-06", "title": "Multi-Tiered Self-Contrastive Learning for Medical Microwave Radiometry (MWR) Breast Cancer Detection", "paper_summary": "The pursuit of enhanced breast cancer detection and monitoring techniques is\na paramount healthcare objective, driving the need for innovative imaging\ntechnologies and diagnostic approaches. This study introduces a novel\nmulti-tiered self-contrastive model tailored for the application of microwave\nradiometry (MWR) breast cancer detection. Our approach encompasses three\ndistinct models: Local-MWR (L-MWR), Regional-MWR (R-MWR), and Global-MWR\n(G-MWR), each engineered to analyze varying sub-regional comparisons within the\nbreasts. These models are cohesively integrated through the Joint-MWR (J-MWR)\nnetwork, which leverages the self-contrastive data generated at each analytical\nlevel to enhance detection capabilities. Employing a dataset comprising 4,932\ncases of female patients, our research showcases the effectiveness of our\nproposed models. Notably, the J-MWR model distinguishes itself by achieving a\nMatthews correlation coefficient of 0.74 $\\pm$ 0.018, surpassing existing MWR\nneural networks and contrastive methods. These results highlight the\nsignificant potential of self-contrastive learning techniques in improving both\nthe diagnostic accuracy and generalizability of MWR-based breast cancer\ndetection processes. Such advancements hold considerable promise for further\ninvestigative and clinical endeavors. The source code is available at:\nhttps://github.com/cgalaz01/self_contrastive_mwr", "paper_summary_zh": "追求增強乳癌檢測和監測技術是一項至關重要的醫療保健目標，推動了創新影像技術和診斷方法的需求。本研究介紹了一種新穎的多層自對比模型，專門用於微波輻射測量 (MWR) 乳癌檢測。我們的做法包含三個不同的模型：局部 MWR (L-MWR)、區域 MWR (R-MWR) 和全局 MWR (G-MWR)，每個模型都設計用於分析乳房內不同的次區域比較。這些模型通過聯合 MWR (J-MWR) 網路緊密整合，利用在每個分析層級產生的自對比資料來增強檢測能力。我們的研究採用包含 4,932 例女性患者的資料集，展示了我們提出的模型的有效性。值得注意的是，J-MWR 模型以達到 0.74 ± 0.018 的馬修斯相關係數而區別於其他模型，超越了現有的 MWR 神經網路和對比方法。這些結果突顯了自對比學習技術在改善基於 MWR 的乳癌檢測程序的診斷準確性和概括性方面具有顯著的潛力。這些進展為進一步的調查和臨床工作提供了相當大的希望。原始碼可在以下網址取得：https://github.com/cgalaz01/self_contrastive_mwr", "author": "Christoforos Galazis et.al.", "authors": "Christoforos Galazis, Huiyi Wu, Igor Goryanin", "id": "2410.04636v1", "paper_url": "http://arxiv.org/abs/2410.04636v1", "repo": "https://github.com/cgalaz01/self_contrastive_mwr"}}