{"2411.17897": {"publish_time": "2024-11-26", "title": "Automating grapevine LAI features estimation with UAV imagery and machine learning", "paper_summary": "The leaf area index determines crop health and growth. Traditional methods\nfor calculating it are time-consuming, destructive, costly, and limited to a\nscale. In this study, we automate the index estimation method using drone image\ndata of grapevine plants and a machine learning model. Traditional feature\nextraction and deep learning methods are used to obtain helpful information\nfrom the data and enhance the performance of the different machine learning\nmodels employed for the leaf area index prediction. The results showed that\ndeep learning based feature extraction is more effective than traditional\nmethods. The new approach is a significant improvement over old methods,\noffering a faster, non-destructive, and cost-effective leaf area index\ncalculation, which enhances precision agriculture practices.", "paper_summary_zh": "葉面積指數決定作物的健康和生長。傳統計算方法耗時、具破壞性、昂貴且僅限於某一規模。在本研究中，我們使用葡萄藤植株的無人機影像資料和機器學習模型自動化指數估計方法。傳統特徵提取和深度學習方法用於從資料中獲取有用的資訊，並提升用於葉面積指數預測的不同機器學習模型的效能。結果顯示，基於深度學習的特徵提取比傳統方法更有效。新方法比舊方法有顯著的改進，提供更快速、非破壞性且具成本效益的葉面積指數計算，進而提升精準農業實務。", "author": "Muhammad Waseem Akram et.al.", "authors": "Muhammad Waseem Akram, Marco Vannucci, Giorgio Buttazzo, Valentina Colla, Stefano Roccella, Andrea Vannini, Giovanni Caruso, Simone Nesi, Alessandra Francini, Luca Sebastiani", "id": "2411.17897v1", "paper_url": "http://arxiv.org/abs/2411.17897v1", "repo": "null"}}