{"2502.11715": {"publish_time": "2025-02-17", "title": "Proactive Depot Discovery: A Generative Framework for Flexible Location-Routing", "paper_summary": "The Location-Routing Problem (LRP), which combines the challenges of facility\n(depot) locating and vehicle route planning, is critically constrained by the\nreliance on predefined depot candidates, limiting the solution space and\npotentially leading to suboptimal outcomes. Previous research on LRP without\npredefined depots is scant and predominantly relies on heuristic algorithms\nthat iteratively attempt depot placements across a planar area. Such approaches\nlack the ability to proactively generate depot locations that meet specific\ngeographic requirements, revealing a notable gap in current research landscape.\nTo bridge this gap, we propose a data-driven generative DRL framework, designed\nto proactively generate depots for LRP without predefined depot candidates,\nsolely based on customer requests data which include geographic and demand\ninformation. It can operate in two distinct modes: direct generation of exact\ndepot locations, and the creation of a multivariate Gaussian distribution for\nflexible depots sampling. By extracting depots' geographic pattern from\ncustomer requests data, our approach can dynamically respond to logistical\nneeds, identifying high-quality depot locations that further reduce total\nrouting costs compared to traditional methods. Extensive experiments\ndemonstrate that, for a same group of customer requests, compared with those\ndepots identified through random attempts, our framework can proactively\ngenerate depots that lead to superior solution routes with lower routing cost.\nThe implications of our framework potentially extend into real-world\napplications, particularly in emergency medical rescue and disaster relief\nlogistics, where rapid establishment and adjustment of depot locations are\nparamount, showcasing its potential in addressing LRP for dynamic and\nunpredictable environments.", "paper_summary_zh": "<paragraph>地點路線問題（LRP）結合了設施（倉庫）定位和車輛路線規劃的挑戰，嚴重受到預先定義的倉庫候選限制，限制了解決方案空間，並可能導致次優結果。先前關於沒有預先定義倉庫的 LRP 研究很少，而且主要依賴於啟發式演算法，在平面區域中反覆嘗試倉庫配置。這種方法無法主動產生符合特定地理需求的倉庫位置，顯示了當前研究領域的顯著差距。為了彌補這個差距，我們提出一個資料驅動的生成式 DRL 架構，旨在主動為 LRP 產生倉庫，而無需預先定義的倉庫候選，僅根據包含地理和需求資訊的客戶要求資料。它可以在兩種不同的模式下運作：直接產生確切的倉庫位置，以及建立多元高斯分布以進行彈性倉庫抽樣。透過從客戶要求資料中提取倉庫的地理模式，我們的方法可以動態回應後勤需求，找出高品質的倉庫位置，進一步降低與傳統方法相比的總路線成本。廣泛的實驗證明，對於同一組客戶要求，與透過隨機嘗試識別的那些倉庫相比，我們的架構可以主動產生倉庫，並產生路線成本較低的優質解決方案路線。我們的架構的影響潛在地擴展到實際應用，特別是在緊急醫療救援和災害救災後勤方面，其中倉庫位置的快速建立和調整至關重要，展示了其在解決動態和不可預測環境的 LRP 中的潛力。</paragraph>", "author": "Site Qu et.al.", "authors": "Site Qu, Guoqiang Hu", "id": "2502.11715v1", "paper_url": "http://arxiv.org/abs/2502.11715v1", "repo": "null"}}