{"2407.12736": {"publish_time": "2024-07-17", "title": "CHOSEN: Compilation to Hardware Optimization Stack for Efficient Vision Transformer Inference", "paper_summary": "Vision Transformers (ViTs) represent a groundbreaking shift in machine\nlearning approaches to computer vision. Unlike traditional approaches, ViTs\nemploy the self-attention mechanism, which has been widely used in natural\nlanguage processing, to analyze image patches. Despite their advantages in\nmodeling visual tasks, deploying ViTs on hardware platforms, notably\nField-Programmable Gate Arrays (FPGAs), introduces considerable challenges.\nThese challenges stem primarily from the non-linear calculations and high\ncomputational and memory demands of ViTs. This paper introduces CHOSEN, a\nsoftware-hardware co-design framework to address these challenges and offer an\nautomated framework for ViT deployment on the FPGAs in order to maximize\nperformance. Our framework is built upon three fundamental contributions:\nmulti-kernel design to maximize the bandwidth, mainly targeting benefits of\nmulti DDR memory banks, approximate non-linear functions that exhibit minimal\naccuracy degradation, and efficient use of available logic blocks on the FPGA,\nand efficient compiler to maximize the performance and memory-efficiency of the\ncomputing kernels by presenting a novel algorithm for design space exploration\nto find optimal hardware configuration that achieves optimal throughput and\nlatency. Compared to the state-of-the-art ViT accelerators, CHOSEN achieves a\n1.5x and 1.42x improvement in the throughput on the DeiT-S and DeiT-B models.", "paper_summary_zh": "視覺轉換器 (ViT) 代表機器學習方法在電腦視覺上突破性的轉變。與傳統方法不同，ViT 使用自注意力機制，該機制已廣泛用於自然語言處理中，用於分析影像區塊。儘管在建模視覺任務方面有優勢，但在硬體平台上部署 ViT，尤其是現場可程式邏輯閘陣列 (FPGA)，會帶來相當大的挑戰。這些挑戰主要源於 ViT 的非線性運算和高運算和記憶體需求。本文介紹 CHOSEN，一種軟體硬體共同設計架構，用於解決這些挑戰，並提供一個自動化架構，用於在 FPGA 上部署 ViT，以最大化效能。我們的架構建立在三個基本貢獻之上：多核心設計以最大化頻寬，主要針對多個 DDR 記憶體庫的好處、近似非線性函數，表現出最小的準確度下降，以及有效利用 FPGA 上的可用邏輯區塊，以及高效的編譯器，透過提出一個用於設計空間探索的新演算法，以最大化運算核心的效能和記憶體效率，以找到實現最佳處理量和延遲的最佳硬體配置。與最先進的 ViT 加速器相比，CHOSEN 在 DeiT-S 和 DeiT-B 模型上分別實現了 1.5 倍和 1.42 倍的處理量提升。", "author": "Mohammad Erfan Sadeghi et.al.", "authors": "Mohammad Erfan Sadeghi, Arash Fayyazi, Suhas Somashekar, Massoud Pedram", "id": "2407.12736v1", "paper_url": "http://arxiv.org/abs/2407.12736v1", "repo": "null"}}