{"2411.19346": {"publish_time": "2024-11-28", "title": "CLIP meets DINO for Tuning Zero-Shot Classifier using Unlabeled Image Collections", "paper_summary": "In the era of foundation models, CLIP has emerged as a powerful tool for\naligning text and visual modalities into a common embedding space. However, the\nalignment objective used to train CLIP often results in subpar visual features\nfor fine-grained tasks. In contrast, SSL-pretrained models like DINO excel at\nextracting rich visual features due to their specialized training paradigm.\nYet, these SSL models require an additional supervised linear probing step,\nwhich relies on fully labeled data which is often expensive and difficult to\nobtain at scale. In this paper, we propose a label-free prompt-tuning method\nthat leverages the rich visual features of self-supervised learning models\n(DINO) and the broad textual knowledge of large language models (LLMs) to\nlargely enhance CLIP-based image classification performance using unlabeled\nimages. Our approach unfolds in three key steps: (1) We generate robust textual\nfeature embeddings that more accurately represent object classes by leveraging\nclass-specific descriptions from LLMs, enabling more effective zero-shot\nclassification compared to CLIP's default name-specific prompts. (2) These\ntextual embeddings are then used to produce pseudo-labels to train an alignment\nmodule that integrates the complementary strengths of LLM description-based\ntextual embeddings and DINO's visual features. (3) Finally, we prompt-tune\nCLIP's vision encoder through DINO-assisted supervision using the trained\nalignment module. This three-step process allows us to harness the best of\nvisual and textual foundation models, resulting in a powerful and efficient\napproach that surpasses state-of-the-art label-free classification methods.\nNotably, our framework, NoLA (No Labels Attached), achieves an average absolute\ngain of 3.6% over the state-of-the-art LaFter across 11 diverse image\nclassification datasets.", "paper_summary_zh": "在基礎模型時代，CLIP 已成為一種強大的工具，用於將文字和視覺模態對齊到一個通用的嵌入空間中。然而，用於訓練 CLIP 的對齊目標通常會導致精細任務的視覺特徵次佳。相比之下，由於其專門的訓練範例，像 DINO 這樣的 SSL 預訓練模型擅長提取豐富的視覺特徵。然而，這些 SSL 模型需要一個額外的監督線性探測步驟，這依賴於完全標記的數據，而這些數據通常很昂貴且難以大規模獲取。在本文中，我們提出了一種無標籤提示調整方法，該方法利用自監督學習模型（DINO）的豐富視覺特徵和大語言模型（LLM）的廣泛文本知識，使用未標記的圖像極大地增強了基於 CLIP 的圖像分類性能。我們的做法分為三個關鍵步驟：(1) 我們生成強大的文本特徵嵌入，這些嵌入通過利用來自 LLM 的類特定描述更準確地表示對象類別，與 CLIP 的默認名稱特定提示相比，實現了更有效的零次分類。(2) 然後使用這些文本嵌入來產生偽標籤，以訓練一個對齊模組，該模組整合了基於 LLM 描述的文本嵌入和 DINO 的視覺特徵的互補優勢。(3) 最後，我們通過使用訓練好的對齊模組，通過 DINO 輔助監督提示調整 CLIP 的視覺編碼器。這個三步驟流程使我們能夠利用視覺和文本基礎模型的優點，從而產生一種強大且有效的方法，超越了最先進的無標籤分類方法。值得注意的是，我們的框架 NoLA（無標籤附加）在 11 個不同的圖像分類數據集上實現了比最先進的 LaFter 高出 3.6% 的平均絕對增益。", "author": "Mohamed Fazli Imam et.al.", "authors": "Mohamed Fazli Imam, Rufael Fedaku Marew, Jameel Hassan, Mustansar Fiaz, Alham Fikri Aji, Hisham Cholakkal", "id": "2411.19346v1", "paper_url": "http://arxiv.org/abs/2411.19346v1", "repo": "null"}}