{"2407.02894": {"publish_time": "2024-07-03", "title": "Translatotron-V(ison): An End-to-End Model for In-Image Machine Translation", "paper_summary": "In-image machine translation (IIMT) aims to translate an image containing\ntexts in source language into an image containing translations in target\nlanguage. In this regard, conventional cascaded methods suffer from issues such\nas error propagation, massive parameters, and difficulties in deployment and\nretaining visual characteristics of the input image. Thus, constructing\nend-to-end models has become an option, which, however, faces two main\nchallenges: 1) the huge modeling burden, as it is required to simultaneously\nlearn alignment across languages and preserve the visual characteristics of the\ninput image; 2) the difficulties of directly predicting excessively lengthy\npixel sequences. In this paper, we propose \\textit{Translatotron-V(ision)}, an\nend-to-end IIMT model consisting of four modules. In addition to an image\nencoder, and an image decoder, our model contains a target text decoder and an\nimage tokenizer. Among them, the target text decoder is used to alleviate the\nlanguage alignment burden, and the image tokenizer converts long sequences of\npixels into shorter sequences of visual tokens, preventing the model from\nfocusing on low-level visual features. Besides, we present a two-stage training\nframework for our model to assist the model in learning alignment across\nmodalities and languages. Finally, we propose a location-aware evaluation\nmetric called Structure-BLEU to assess the translation quality of the generated\nimages. Experimental results demonstrate that our model achieves competitive\nperformance compared to cascaded models with only 70.9\\% of parameters, and\nsignificantly outperforms the pixel-level end-to-end IIMT model.", "paper_summary_zh": "圖像內機器翻譯 (IIMT) 旨在將包含原始語言文字的圖像翻譯成包含目標語言翻譯的圖像。在此方面，傳統的層疊方法存在錯誤傳播、參數龐大以及部署和保留輸入圖像視覺特徵困難等問題。因此，構建端到端模型已成為一種選擇，但它面臨著兩個主要挑戰：1) 龐大的建模負擔，因為它需要同時學習跨語言對齊並保留輸入圖像的視覺特徵；2) 直接預測過長的像素序列的困難。在本文中，我們提出了 Translatotron-V(ision)，一個由四個模組組成的端到端 IIMT 模型。除了影像編碼器和影像解碼器之外，我們的模型還包含目標文字解碼器和影像標記化器。其中，目標文字解碼器用於減輕語言對齊負擔，而影像標記化器將長像素序列轉換為較短的視覺標記序列，防止模型專注於低階視覺特徵。此外，我們為我們的模型提供了一個兩階段訓練架構，以協助模型學習跨模式和語言的對齊。最後，我們提出了一個稱為結構 BLEU 的位置感知評估指標，以評估生成圖像的翻譯品質。實驗結果表明，與只有 70.9% 參數的層疊模型相比，我們的模型達到了競爭力的效能，並且明顯優於像素級別的端到端 IIMT 模型。", "author": "Zhibin Lan et.al.", "authors": "Zhibin Lan, Liqiang Niu, Fandong Meng, Jie Zhou, Min Zhang, Jinsong Su", "id": "2407.02894v1", "paper_url": "http://arxiv.org/abs/2407.02894v1", "repo": "https://github.com/deeplearnxmu/translatotron-v"}}