{"2412.06787": {"publish_time": "2024-12-09", "title": "[MASK] is All You Need", "paper_summary": "In generative models, two paradigms have gained attraction in various\napplications: next-set prediction-based Masked Generative Models and next-noise\nprediction-based Non-Autoregressive Models, e.g., Diffusion Models. In this\nwork, we propose using discrete-state models to connect them and explore their\nscalability in the vision domain. First, we conduct a step-by-step analysis in\na unified design space across two types of models including\ntimestep-independence, noise schedule, temperature, guidance strength, etc in a\nscalable manner. Second, we re-cast typical discriminative tasks, e.g., image\nsegmentation, as an unmasking process from [MASK]tokens on a discrete-state\nmodel. This enables us to perform various sampling processes, including\nflexible conditional sampling by only training once to model the joint\ndistribution. All aforementioned explorations lead to our framework named\nDiscrete Interpolants, which enables us to achieve state-of-the-art or\ncompetitive performance compared to previous discrete-state based methods in\nvarious benchmarks, like ImageNet256, MS COCO, and video dataset FaceForensics.\nIn summary, by leveraging [MASK] in discrete-state models, we can bridge Masked\nGenerative and Non-autoregressive Diffusion models, as well as generative and\ndiscriminative tasks.", "paper_summary_zh": "在生成模型中，有兩種範例在各種應用程式中獲得關注：基於下一個集合預測的遮罩生成模型和基於下一個雜訊預測的非自迴歸模型，例如擴散模型。在這項工作中，我們建議使用離散狀態模型將它們連接起來，並探索它們在視覺領域的可擴充性。首先，我們在一個統一的設計空間中對兩種模型類型進行逐步分析，包括時間步長獨立性、雜訊排程、溫度、引導強度等，並以可擴充的方式進行。其次，我們將典型的區分任務（例如影像分割）重新轉換為離散狀態模型上 [MASK] 令牌的取消遮罩程序。這使我們能夠執行各種抽樣程序，包括僅透過訓練一次來建模聯合分配的彈性條件抽樣。所有上述探討都導致我們架構稱為離散內插，它使我們能夠在各種基準中（例如 ImageNet256、MS COCO 和影片資料集 FaceForensics）實現與先前基於離散狀態的方法相比最先進或有競爭力的效能。總之，透過利用離散狀態模型中的 [MASK]，我們可以橋接遮罩生成和非自迴歸擴散模型，以及生成和區分任務。", "author": "Vincent Tao Hu et.al.", "authors": "Vincent Tao Hu, Björn Ommer", "id": "2412.06787v1", "paper_url": "http://arxiv.org/abs/2412.06787v1", "repo": "null"}}