{"2406.07926": {"publish_time": "2024-06-12", "title": "Efficient Neural Common Neighbor for Temporal Graph Link Prediction", "paper_summary": "Temporal graphs are ubiquitous in real-world scenarios, such as social\nnetwork, trade and transportation. Predicting dynamic links between nodes in a\ntemporal graph is of vital importance. Traditional methods usually leverage the\ntemporal neighborhood of interaction history to generate node embeddings first\nand then aggregate the source and target node embeddings to predict the link.\nHowever, such methods focus on learning individual node representations, but\noverlook the pairwise representation learning nature of link prediction and\nfail to capture the important pairwise features of links such as common\nneighbors (CN). Motivated by the success of Neural Common Neighbor (NCN) for\nstatic graph link prediction, we propose TNCN, a temporal version of NCN for\nlink prediction in temporal graphs. TNCN dynamically updates a temporal\nneighbor dictionary for each node, and utilizes multi-hop common neighbors\nbetween the source and target node to learn a more effective pairwise\nrepresentation. We validate our model on five large-scale real-world datasets\nfrom the Temporal Graph Benchmark (TGB), and find that it achieves new\nstate-of-the-art performance on three of them. Additionally, TNCN demonstrates\nexcellent scalability on large datasets, outperforming popular GNN baselines by\nup to 6.4 times in speed. Our code is available at https:\n//github.com/GraphPKU/TNCN.", "paper_summary_zh": "時序圖在真實世界的場景中無處不在，例如社交網路、貿易和運輸。預測時序圖中節點之間的動態連結至關重要。傳統方法通常利用互動歷史的時間鄰域來生成節點嵌入，然後聚合來源和目標節點嵌入以預測連結。然而，這種方法專注於學習個別節點表示，但忽視了連結預測的成對表示學習性質，並且無法捕捉連結的重要成對特徵，例如共同鄰居 (CN)。受用於靜態圖連結預測的神經共同鄰居 (NCN) 的成功啟發，我們提出了 TNCN，它是 NCN 的時間版本，用於時序圖中的連結預測。TNCN 動態更新每個節點的時間鄰居字典，並利用來源和目標節點之間的多跳共同鄰居來學習更有效的成對表示。我們在時序圖基準 (TGB) 中的五個大型真實世界資料集上驗證了我們的模型，並發現它在其中三個資料集上達到了新的最先進性能。此外，TNCN 在大型資料集上展示了出色的可擴充性，速度比流行的 GNN 基準高出 6.4 倍。我們的程式碼可在 https://github.com/GraphPKU/TNCN 取得。", "author": "Xiaohui Zhang et.al.", "authors": "Xiaohui Zhang, Yanbo Wang, Xiyuan Wang, Muhan Zhang", "id": "2406.07926v1", "paper_url": "http://arxiv.org/abs/2406.07926v1", "repo": "null"}}