{"2408.12029": {"publish_time": "2024-08-21", "title": "Federated Diabetes Prediction in Canadian Adults Using Real-world Cross-Province Primary Care Data", "paper_summary": "Integrating Electronic Health Records (EHR) and the application of machine\nlearning present opportunities for enhancing the accuracy and accessibility of\ndata-driven diabetes prediction. In particular, developing data-driven machine\nlearning models can provide early identification of patients with high risk for\ndiabetes, potentially leading to more effective therapeutic strategies and\nreduced healthcare costs. However, regulation restrictions create barriers to\ndeveloping centralized predictive models. This paper addresses the challenges\nby introducing a federated learning approach, which amalgamates predictive\nmodels without centralized data storage and processing, thus avoiding privacy\nissues. This marks the first application of federated learning to predict\ndiabetes using real clinical datasets in Canada extracted from the Canadian\nPrimary Care Sentinel Surveillance Network (CPCSSN) without crossprovince\npatient data sharing. We address class-imbalance issues through downsampling\ntechniques and compare federated learning performance against province-based\nand centralized models. Experimental results show that the federated MLP model\npresents a similar or higher performance compared to the model trained with the\ncentralized approach. However, the federated logistic regression model showed\ninferior performance compared to its centralized peer.", "paper_summary_zh": "整合電子健康記錄 (EHR) 和機器學習的應用為增強資料驅動糖尿病預測的準確性和可及性提供了機會。特別是，開發資料驅動的機器學習模型可以及早找出糖尿病高風險患者，進而可能導致更有效的治療策略和降低醫療保健成本。然而，法規限制會為開發集中式預測模型製造障礙。本文透過介紹聯邦學習方法來解決挑戰，這種方法結合預測模型，而無需集中式資料儲存和處理，從而避免隱私問題。這標誌著首次應用聯邦學習來預測糖尿病，方法是使用從加拿大初級照護哨兵監控網絡 (CPCSSN) 萃取的加拿大真實臨床資料集，而無需跨省份分享患者資料。我們透過降採樣技術來解決類別不平衡問題，並比較聯邦學習效能與基於省份和集中式的模型。實驗結果顯示，與使用集中式方法訓練的模型相比，聯邦 MLP 模型表現出相似或更高的效能。然而，與其集中式的同儕相比，聯邦邏輯迴歸模型表現出較差的效能。", "author": "Guojun Tang et.al.", "authors": "Guojun Tang, Jason E. Black, Tyler S. Williamson, Steve H. Drew", "id": "2408.12029v1", "paper_url": "http://arxiv.org/abs/2408.12029v1", "repo": "null"}}