{"2410.13846": {"publish_time": "2024-10-17", "title": "SimLayerKV: A Simple Framework for Layer-Level KV Cache Reduction", "paper_summary": "Recent advancements in large language models (LLMs) have extended their\ncapabilities to handle long contexts. However, increasing the number of model\nlayers and the length of input sequences significantly escalates the memory\nrequired to store key-value (KV) cache, posing challenges for efficient\ninference. To mitigate this issue, we present SimLayerKV, a simple yet\neffective method that reduces inter-layer KV cache redundancies by selectively\ndropping cache in identified lazy layers. Our approach is based on the\nobservation that certain layers in long-context LLMs exhibit \"lazy\" behavior,\ncontributing less to modeling long-range dependencies compared to non-lazy\nlayers. By analyzing attention weight patterns, we find that the behavior of\nthese lazy layers is consistent across tokens during generation for a given\ninput. This insight motivates our SimLayerKV, which identifies lazy layers and\nreduces their KV cache accordingly. SimLayerKV is training-free, generalizable,\nand can be implemented with only seven lines of code. We conduct extensive\nexperiments on three representative LLMs, e.g., LLaMA2-7B, LLaMA3-8B, and\nMistral-7B across 16 tasks from the LongBench benchmark. The results\ndemonstrate that SimLayerKV achieves a KV cache compression ratio of 5$\\times$\nwith only a 1.2% performance drop when combined with 4-bit quantization. Our\ncode is available at https://github.com/sail-sg/SimLayerKV.", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 的最新進展已將其功能擴展到處理長文脈。然而，增加模型層數和輸入序列的長度會顯著增加儲存鍵值 (KV) 快取所需的記憶體，對有效推論構成挑戰。為了減輕此問題，我們提出了 SimLayerKV，這是一種簡單但有效的方法，透過選擇性地在已識別的惰性層中捨棄快取，來減少層間 KV 快取的冗餘。我們的做法基於以下觀察：長文脈 LLM 中的某些層表現出「惰性」行為，與非惰性層相比，對建模長程依賴關係的貢獻較少。透過分析注意力權重模式，我們發現這些惰性層的行為在給定輸入的產生過程中，在各個符號之間是一致的。此見解激勵了我們的 SimLayerKV，它可以識別惰性層並相應地減少其 KV 快取。SimLayerKV 無需訓練、具有泛化性，且僅需七行程式碼即可實作。我們對三個具代表性的 LLM 進行了廣泛的實驗，例如 LLaMA2-7B、LLaMA3-8B 和 Mistral-7B，涵蓋了 LongBench 基準中的 16 項任務。結果表明，當與 4 位元量化結合時，SimLayerKV 可實現 5 倍的 KV 快取壓縮比，效能下降僅為 1.2%。我們的程式碼可在 https://github.com/sail-sg/SimLayerKV 取得。</paragraph>", "author": "Xuan Zhang et.al.", "authors": "Xuan Zhang, Cunxiao Du, Chao Du, Tianyu Pang, Wei Gao, Min Lin", "id": "2410.13846v1", "paper_url": "http://arxiv.org/abs/2410.13846v1", "repo": "null"}}