{"2412.12806": {"publish_time": "2024-12-17", "title": "Cross-Dialect Information Retrieval: Information Access in Low-Resource and High-Variance Languages", "paper_summary": "A large amount of local and culture-specific knowledge (e.g., people,\ntraditions, food) can only be found in documents written in dialects. While\nthere has been extensive research conducted on cross-lingual information\nretrieval (CLIR), the field of cross-dialect retrieval (CDIR) has received\nlimited attention. Dialect retrieval poses unique challenges due to the limited\navailability of resources to train retrieval models and the high variability in\nnon-standardized languages. We study these challenges on the example of German\ndialects and introduce the first German dialect retrieval dataset, dubbed\nWikiDIR, which consists of seven German dialects extracted from Wikipedia.\nUsing WikiDIR, we demonstrate the weakness of lexical methods in dealing with\nhigh lexical variation in dialects. We further show that commonly used\nzero-shot cross-lingual transfer approach with multilingual encoders do not\ntransfer well to extremely low-resource setups, motivating the need for\nresource-lean and dialect-specific retrieval models. We finally demonstrate\nthat (document) translation is an effective way to reduce the dialect gap in\nCDIR.", "paper_summary_zh": "大量的在地和文化特定知識（例如，人、傳統、食物）只能在以方言寫成的文件中找到。雖然已經對跨語言資訊檢索 (CLIR) 進行了廣泛的研究，但跨方言檢索 (CDIR) 領域受到的關注有限。方言檢索由於用於訓練檢索模型的資源有限以及非標準化語言的高度可變性，因此提出了獨特的挑戰。我們以德語方言為例研究這些挑戰，並介紹了第一個德語方言檢索數據集，稱為 WikiDIR，它包含從維基百科中提取的七種德語方言。使用 WikiDIR，我們展示了詞彙方法在處理方言中高度詞彙變異時的弱點。我們進一步表明，使用多語言編碼器常用的零次跨語言轉移方法無法很好地轉移到極低資源設置，這促使需要資源精簡且特定於方言的檢索模型。我們最終證明（文件）翻譯是縮小 CDIR 中方言差距的有效方法。", "author": "Robert Litschko et.al.", "authors": "Robert Litschko, Oliver Kraus, Verena Blaschke, Barbara Plank", "id": "2412.12806v1", "paper_url": "http://arxiv.org/abs/2412.12806v1", "repo": "null"}}