{"2405.19331": {"publish_time": "2024-05-29", "title": "NPGA: Neural Parametric Gaussian Avatars", "paper_summary": "The creation of high-fidelity, digital versions of human heads is an\nimportant stepping stone in the process of further integrating virtual\ncomponents into our everyday lives. Constructing such avatars is a challenging\nresearch problem, due to a high demand for photo-realism and real-time\nrendering performance. In this work, we propose Neural Parametric Gaussian\nAvatars (NPGA), a data-driven approach to create high-fidelity, controllable\navatars from multi-view video recordings. We build our method around 3D\nGaussian Splatting for its highly efficient rendering and to inherit the\ntopological flexibility of point clouds. In contrast to previous work, we\ncondition our avatars' dynamics on the rich expression space of neural\nparametric head models (NPHM), instead of mesh-based 3DMMs. To this end, we\ndistill the backward deformation field of our underlying NPHM into forward\ndeformations which are compatible with rasterization-based rendering. All\nremaining fine-scale, expression-dependent details are learned from the\nmulti-view videos. To increase the representational capacity of our avatars, we\naugment the canonical Gaussian point cloud using per-primitive latent features\nwhich govern its dynamic behavior. To regularize this increased dynamic\nexpressivity, we propose Laplacian terms on the latent features and predicted\ndynamics. We evaluate our method on the public NeRSemble dataset, demonstrating\nthat NPGA significantly outperforms the previous state-of-the-art avatars on\nthe self-reenactment task by 2.6 PSNR. Furthermore, we demonstrate accurate\nanimation capabilities from real-world monocular videos.", "paper_summary_zh": "<paragraph>建立高保真、數位化的人頭版本，是進一步將虛擬元件整合至我們日常生活中重要的一步。由於對寫實照片和即時渲染效能有很高的需求，因此建構此類化身是一個具有挑戰性的研究問題。在這項工作中，我們提出了神經參數化高斯化身 (NPGA)，一種從多視角影片錄製中建立高保真、可控化身，且以資料驅動的方法。我們以 3D 高斯潑濺為方法基礎，因為它具有高效率的渲染效果，並繼承點雲的拓撲彈性。與先前的研究不同，我們將化身的動態設定在神經參數化頭部模型 (NPHM) 豐富的表情空間，而不是基於網格的 3DMM。為此，我們將基礎 NPHM 的反向形變場提煉成正向形變，與基於光柵化的渲染相容。所有剩下的精細、依表情而定的細節都是從多視角影片中學習來的。為了增加化身的表現能力，我們使用每個基本原語的潛在特徵擴充正規高斯點雲，這些特徵控制其動態行為。為了規範這種增加的動態表現力，我們對潛在特徵和預測動態提出拉普拉斯項。我們在公開的 NeRSemble 資料集上評估我們的模型，證明 NPGA 在自我重演任務上顯著優於先前的最新化身，PSNR 提升了 2.6。此外，我們展示了從真實世界單眼影片中獲得的精確動畫功能。</paragraph>", "author": "Simon Giebenhain et.al.", "authors": "Simon Giebenhain, Tobias Kirschstein, Martin Rünz, Lourdes Agapito, Matthias Nießner", "id": "2405.19331v1", "paper_url": "http://arxiv.org/abs/2405.19331v1", "repo": "null"}}