{"2501.08074": {"publish_time": "2025-01-14", "title": "Artificial Liver Classifier: A New Alternative to Conventional Machine Learning Models", "paper_summary": "Supervised machine learning classifiers often encounter challenges related to\nperformance, accuracy, and overfitting. This paper introduces the Artificial\nLiver Classifier (ALC), a novel supervised learning classifier inspired by the\nhuman liver's detoxification function. The ALC is characterized by its\nsimplicity, speed, hyperparameters-free, ability to reduce overfitting, and\neffectiveness in addressing multi-classification problems through\nstraightforward mathematical operations. To optimize the ALC's parameters, an\nimproved FOX optimization algorithm (IFOX) is employed as the training method.\nThe proposed ALC was evaluated on five benchmark machine learning datasets:\nIris Flower, Breast Cancer Wisconsin, Wine, Voice Gender, and MNIST. The\nresults demonstrated competitive performance, with the ALC achieving 100%\naccuracy on the Iris dataset, surpassing logistic regression, multilayer\nperceptron, and support vector machine. Similarly, on the Breast Cancer\ndataset, it achieved 99.12% accuracy, outperforming XGBoost and logistic\nregression. Across all datasets, the ALC consistently exhibited lower\noverfitting gaps and loss compared to conventional classifiers. These findings\nhighlight the potential of leveraging biological process simulations to develop\nefficient machine learning models and open new avenues for innovation in the\nfield.", "paper_summary_zh": "监督式机器学习分类器经常遇到与性能、准确度和过度拟合相关的挑战。本文介绍了人工肝分类器 (ALC)，这是一种新颖的监督式学习分类器，灵感来自人类肝脏的解毒功能。ALC 的特点是简单、快速、无超参数、能够减少过度拟合，并且通过简单的数学运算有效地解决多分类问题。为了优化 ALC 的参数，采用改进的 FOX 优化算法 (IFOX) 作为训练方法。在五个基准机器学习数据集上评估了所提出的 ALC：鸢尾花、威斯康星乳腺癌、葡萄酒、语音性别和 MNIST。结果显示了具有竞争力的性能，ALC 在鸢尾花数据集上实现了 100% 的准确度，超过了逻辑回归、多层感知器和支持向量机。同样，在乳腺癌数据集上，它实现了 99.12% 的准确度，优于 XGBoost 和逻辑回归。在所有数据集上，ALC 与传统分类器相比，始终表现出较低的过度拟合差距和损失。这些发现突出了利用生物过程模拟来开发高效机器学习模型的潜力，并为该领域的创新开辟了新的途径。", "author": "Mahmood A. Jumaah et.al.", "authors": "Mahmood A. Jumaah, Yossra H. Ali, Tarik A. Rashid", "id": "2501.08074v1", "paper_url": "http://arxiv.org/abs/2501.08074v1", "repo": "null"}}