{"2411.14033": {"publish_time": "2024-11-21", "title": "Multi-LLM-Agent Systems: Techniques and Business Perspectives", "paper_summary": "In the era of (multi-modal) large language models, most operational processes\ncan be reformulated and reproduced using LLM agents. The LLM agents can\nperceive, control, and get feedback from the environment so as to accomplish\nthe given tasks in an autonomous manner. Besides the environment-interaction\nproperty, the LLM agents can call various external tools to ease the task\ncompletion process. The tools can be regarded as a predefined operational\nprocess with private or real-time knowledge that does not exist in the\nparameters of LLMs. As a natural trend of development, the tools for calling\nare becoming autonomous agents, thus the full intelligent system turns out to\nbe a multi-LLM-agent system (MLAS). This paper discusses the technical and\nbusiness landscapes of MLAS. Compared to the previous single-LLM-agent system,\na MLAS has the advantages of i) higher potential of task-solving performance,\nii) higher flexibility for system changing, iii) proprietary data preserving\nfor each participating entity, and iv) feasibility of monetization for each\nentity. To support the ecosystem of MLAS, we provide a preliminary version of\nsuch MLAS protocol considering technical requirements, data privacy, and\nbusiness incentives. As such, MLAS would be a practical solution to achieve\nartificial collective intelligence in the near future.", "paper_summary_zh": "在（多模态）大语言模型的时代，大多数操作流程\n可以使用 LLM 代理重新表述和复制。LLM 代理可以\n感知、控制和从环境中获取反馈，以便以自主的方式完成\n给定的任务。除了环境交互\n属性外，LLM 代理还可以调用各种外部工具来简化任务\n完成过程。这些工具可以被视为具有私有或实时知识的预定义操作\n流程，这些知识不存在于 LLM 的参数中。作为一种自然的发展趋势，用于调用的工具\n正在成为自主代理，因此完整的智能系统变成了\n多 LLM 代理系统 (MLAS)。本文讨论了 MLAS 的技术和\n商业前景。与之前的单 LLM 代理系统相比，\nMLAS 具有以下优势：i) 更高的任务解决性能潜力，\nii) 更高的系统更改灵活性，iii) 每个参与实体的专有数据保留，以及 iv) 每个\n实体的货币化可行性。为了支持 MLAS 生态系统，我们提供了一个初步版本\n此类 MLAS 协议考虑技术要求、数据隐私和\n商业激励。因此，MLAS 将成为在不久的将来实现\n人工智能集体智能的实用解决方案。", "author": "Yingxuan Yang et.al.", "authors": "Yingxuan Yang, Qiuying Peng, Jun Wang, Weinan Zhang", "id": "2411.14033v1", "paper_url": "http://arxiv.org/abs/2411.14033v1", "repo": "null"}}