{"2410.13639": {"publish_time": "2024-10-17", "title": "A Comparative Study on Reasoning Patterns of OpenAI's o1 Model", "paper_summary": "Enabling Large Language Models (LLMs) to handle a wider range of complex\ntasks (e.g., coding, math) has drawn great attention from many researchers. As\nLLMs continue to evolve, merely increasing the number of model parameters\nyields diminishing performance improvements and heavy computational costs.\nRecently, OpenAI's o1 model has shown that inference strategies (i.e.,\nTest-time Compute methods) can also significantly enhance the reasoning\ncapabilities of LLMs. However, the mechanisms behind these methods are still\nunexplored. In our work, to investigate the reasoning patterns of o1, we\ncompare o1 with existing Test-time Compute methods (BoN, Step-wise BoN, Agent\nWorkflow, and Self-Refine) by using OpenAI's GPT-4o as a backbone on general\nreasoning benchmarks in three domains (i.e., math, coding, commonsense\nreasoning). Specifically, first, our experiments show that the o1 model has\nachieved the best performance on most datasets. Second, as for the methods of\nsearching diverse responses (e.g., BoN), we find the reward models' capability\nand the search space both limit the upper boundary of these methods. Third, as\nfor the methods that break the problem into many sub-problems, the Agent\nWorkflow has achieved better performance than Step-wise BoN due to the\ndomain-specific system prompt for planning better reasoning processes. Fourth,\nit is worth mentioning that we have summarized six reasoning patterns of o1,\nand provided a detailed analysis on several reasoning benchmarks.", "paper_summary_zh": "<paragraph>讓大型語言模型 (LLM) 處理更多種類的複雜任務（例如編碼、數學）已引起許多研究人員的極大關注。由於 LLM 持續演進，單純增加模型參數數量會導致效能提升遞減和巨大的運算成本。最近，OpenAI 的 o1 模型顯示，推理策略（即測試時間運算方法）也能顯著增強 LLM 的推理能力。然而，這些方法背後的機制仍未探究。在我們的研究中，為了探討 o1 的推理模式，我們使用 OpenAI 的 GPT-4o 作為主幹，在三個領域（即數學、編碼、常識推理）的一般推理基準上，將 o1 與現有的測試時間運算方法（BoN、逐步 BoN、代理工作流程和自我精煉）進行比較。具體來說，首先，我們的實驗顯示 o1 模型在大部分資料集上都取得最佳效能。其次，至於搜尋多樣化回應的方法（例如 BoN），我們發現獎勵模型的能力和搜尋空間都限制了這些方法的上限。第三，至於將問題分解成許多子問題的方法，代理工作流程由於特定領域的系統提示，可規劃出更好的推理程序，因此比逐步 BoN 獲得更好的效能。第四，值得一提的是，我們總結了 o1 的六種推理模式，並對幾個推理基準進行了詳細分析。</paragraph>", "author": "Siwei Wu et.al.", "authors": "Siwei Wu, Zhongyuan Peng, Xinrun Du, Tuney Zheng, Minghao Liu, Jialong Wu, Jiachen Ma, Yizhi Li, Jian Yang, Wangchunshu Zhou, Qunshu Lin, Junbo Zhao, Zhaoxiang Zhang, Wenhao Huang, Ge Zhang, Chenghua Lin, J. H. Liu", "id": "2410.13639v1", "paper_url": "http://arxiv.org/abs/2410.13639v1", "repo": "https://github.com/open-source-o1/o1_reasoning_patterns_study"}}