{"2412.03434": {"publish_time": "2024-12-04", "title": "BIMCaP: BIM-based AI-supported LiDAR-Camera Pose Refinement", "paper_summary": "This paper introduces BIMCaP, a novel method to integrate mobile 3D sparse\nLiDAR data and camera measurements with pre-existing building information\nmodels (BIMs), enhancing fast and accurate indoor mapping with affordable\nsensors. BIMCaP refines sensor poses by leveraging a 3D BIM and employing a\nbundle adjustment technique to align real-world measurements with the model.\nExperiments using real-world open-access data show that BIMCaP achieves\nsuperior accuracy, reducing translational error by over 4 cm compared to\ncurrent state-of-the-art methods. This advancement enhances the accuracy and\ncost-effectiveness of 3D mapping methodologies like SLAM. BIMCaP's improvements\nbenefit various fields, including construction site management and emergency\nresponse, by providing up-to-date, aligned digital maps for better\ndecision-making and productivity. Link to the repository:\nhttps://github.com/MigVega/BIMCaP", "paper_summary_zh": "這篇論文介紹了 BIMCaP，一種新穎的方法，用於整合行動 3D 稀疏 LiDAR 資料和相機測量，以及預先存在的建築資訊模型 (BIM)，藉由經濟實惠的感測器加強快速且精準的室內建構。BIMCaP 透過利用 3D BIM，並採用束調整技術，將真實世界測量與模型對齊，進而優化感測器姿勢。使用真實世界開放取用資料的實驗顯示，與目前最先進的方法相比，BIMCaP 達到更高的精確度，將平移誤差減少超過 4 公分。此項進展提升了 3D 建構方法（例如 SLAM）的精確度和成本效益。BIMCaP 的改進使各種領域受益，包括建築工地管理和緊急應變，藉由提供最新的對齊數位地圖，以利於更好的決策制定和生產力。儲存庫連結：https://github.com/MigVega/BIMCaP", "author": "Miguel Arturo Vega Torres et.al.", "authors": "Miguel Arturo Vega Torres, Anna Ribic, Borja García de Soto, André Borrmann", "id": "2412.03434v1", "paper_url": "http://arxiv.org/abs/2412.03434v1", "repo": "https://github.com/migvega/bimcap"}}