{"2502.02047": {"publish_time": "2025-02-04", "title": "AmaSQuAD: A Benchmark for Amharic Extractive Question Answering", "paper_summary": "This research presents a novel framework for translating extractive\nquestion-answering datasets into low-resource languages, as demonstrated by the\ncreation of the AmaSQuAD dataset, a translation of SQuAD 2.0 into Amharic. The\nmethodology addresses challenges related to misalignment between translated\nquestions and answers, as well as the presence of multiple answer instances in\nthe translated context. For this purpose, we used cosine similarity utilizing\nembeddings from a fine-tuned BERT-based model for Amharic and Longest Common\nSubsequence (LCS). Additionally, we fine-tune the XLM-R model on the AmaSQuAD\nsynthetic dataset for Amharic Question-Answering. The results show an\nimprovement in baseline performance, with the fine-tuned model achieving an\nincrease in the F1 score from 36.55% to 44.41% and 50.01% to 57.5% on the\nAmaSQuAD development dataset. Moreover, the model demonstrates improvement on\nthe human-curated AmQA dataset, increasing the F1 score from 67.80% to 68.80%\nand the exact match score from 52.50% to 52.66%.The AmaSQuAD dataset is\npublicly available Datasets", "paper_summary_zh": "本研究提出了一個新穎的框架，用於將萃取式問答資料集翻譯成低資源語言，正如 AmaSQuAD 資料集的建立所展示的那樣，它是將 SQuAD 2.0 翻譯成阿姆哈拉語。該方法解決了翻譯後的問答之間錯位以及翻譯後的語境中存在多個答案實例等相關挑戰。為此，我們使用了餘弦相似度，利用了針對阿姆哈拉語和最長公共子序列 (LCS) 的經過微調的 BERT 模型中的嵌入。此外，我們針對阿姆哈拉語問答的 AmaSQuAD 合成資料集微調了 XLM-R 模型。結果表明基線效能有所提升，經過微調的模型在 AmaSQuAD 開發資料集上的 F1 分數從 36.55% 提升到 44.41%，從 50.01% 提升到 57.5%。此外，該模型在人工整理的 AmQA 資料集上也表現出提升，將 F1 分數從 67.80% 提升到 68.80%，將完全匹配分數從 52.50% 提升到 52.66%。AmaSQuAD 資料集是公開的資料集", "author": "Nebiyou Daniel Hailemariam et.al.", "authors": "Nebiyou Daniel Hailemariam, Blessed Guda, Tsegazeab Tefferi", "id": "2502.02047v1", "paper_url": "http://arxiv.org/abs/2502.02047v1", "repo": "null"}}