{"2409.11704": {"publish_time": "2024-09-18", "title": "From Lists to Emojis: How Format Bias Affects Model Alignment", "paper_summary": "In this paper, we study format biases in reinforcement learning from human\nfeedback (RLHF). We observe that many widely-used preference models, including\nhuman evaluators, GPT-4, and top-ranking models on the RewardBench benchmark,\nexhibit strong biases towards specific format patterns, such as lists, links,\nbold text, and emojis. Furthermore, large language models (LLMs) can exploit\nthese biases to achieve higher rankings on popular benchmarks like AlpacaEval\nand LMSYS Chatbot Arena. One notable example of this is verbosity bias, where\ncurrent preference models favor longer responses that appear more\ncomprehensive, even when their quality is equal to or lower than shorter,\ncompeting responses. However, format biases beyond verbosity remain largely\nunderexplored in the literature. In this work, we extend the study of biases in\npreference learning beyond the commonly recognized length bias, offering a\ncomprehensive analysis of a wider range of format biases. Additionally, we show\nthat with a small amount of biased data (less than 1%), we can inject\nsignificant bias into the reward model. Moreover, these format biases can also\nbe easily exploited by downstream alignment algorithms, such as best-of-n\nsampling and online iterative DPO, as it is usually easier to manipulate the\nformat than to improve the quality of responses. Our findings emphasize the\nneed to disentangle format and content both for designing alignment algorithms\nand evaluating models.", "paper_summary_zh": "<paragraph>在本文中，我們研究了人類回饋 (RLHF) 中強化學習的格式偏差。我們觀察到許多廣泛使用的偏好模型，包括人類評估員、GPT-4 和 RewardBench 基準上的排名最高模型，對特定格式模式（例如清單、連結、粗體文字和表情符號）表現出強烈的偏見。此外，大型語言模型 (LLM) 可以利用這些偏見在 AlpacaEval 和 LMSYS Chatbot Arena 等熱門基準上獲得更高的排名。一個顯著的例子是冗長偏見，其中當前的偏好模型偏好看起來更全面的較長回應，即使它們的品質等於或低於較短的競爭回應。然而，除了冗長之外的格式偏差在文獻中仍然很大程度上未被探索。在這項工作中，我們將偏好學習中偏差的研究延伸到常見的長度偏差之外，提供對更廣泛的格式偏差的全面分析。此外，我們表明，只要有少量的偏差資料（小於 1%），我們就可以將顯著的偏差注入獎勵模型。此外，這些格式偏差也可以很容易地被下游對齊演算法（例如最佳 n 採樣和線上反覆 DPO）利用，因為操縱格式通常比提高回應品質更容易。我們的研究結果強調了在設計對齊演算法和評估模型時解開格式和內容的必要性。</paragraph>", "author": "Xuanchang Zhang et.al.", "authors": "Xuanchang Zhang, Wei Xiong, Lichang Chen, Tianyi Zhou, Heng Huang, Tong Zhang", "id": "2409.11704v1", "paper_url": "http://arxiv.org/abs/2409.11704v1", "repo": "null"}}