{"2410.11624": {"publish_time": "2024-10-15", "title": "Findings of the WMT 2024 Shared Task on Chat Translation", "paper_summary": "This paper presents the findings from the third edition of the Chat\nTranslation Shared Task. As with previous editions, the task involved\ntranslating bilingual customer support conversations, specifically focusing on\nthe impact of conversation context in translation quality and evaluation. We\nalso include two new language pairs: English-Korean and English-Dutch, in\naddition to the set of language pairs from previous editions: English-German,\nEnglish-French, and English-Brazilian Portuguese. We received 22 primary\nsubmissions and 32 contrastive submissions from eight teams, with each language\npair having participation from at least three teams. We evaluated the systems\ncomprehensively using both automatic metrics and human judgments via a direct\nassessment framework. The official rankings for each language pair were\ndetermined based on human evaluation scores, considering performance in both\ntranslation directions--agent and customer. Our analysis shows that while the\nsystems excelled at translating individual turns, there is room for improvement\nin overall conversation-level translation quality.", "paper_summary_zh": "本論文提出聊天翻譯共享任務第三版的發現。與前幾版一樣，這項任務包含翻譯雙語客戶支援對話，特別著重於對話脈絡對翻譯品質和評估的影響。除了前幾版中的語言對：英語-德語、英語-法語和英語-巴西葡萄牙語之外，我們還納入了兩個新的語言對：英語-韓語和英語-荷蘭語。我們收到了八個團隊提交的 22 份主要提交和 32 份對比提交，每個語言對至少有三個團隊參與。我們使用自動化指標和透過直接評估架構進行的人工判斷，全面評估這些系統。每個語言對的官方排名是根據人工評分來決定的，考量了代理和客戶這兩個翻譯方向的表現。我們的分析顯示，雖然這些系統在翻譯個別輪次方面表現優異，但整體對話層級的翻譯品質仍有進步空間。", "author": "Wafaa Mohammed et.al.", "authors": "Wafaa Mohammed, Sweta Agrawal, M. Amin Farajian, Vera Cabarrão, Bryan Eikema, Ana C. Farinha, José G. C. de Souza", "id": "2410.11624v1", "paper_url": "http://arxiv.org/abs/2410.11624v1", "repo": "null"}}