{"2412.14689": {"publish_time": "2024-12-19", "title": "How to Synthesize Text Data without Model Collapse?", "paper_summary": "Model collapse in synthetic data indicates that iterative training on\nself-generated data leads to a gradual decline in performance. With the\nproliferation of AI models, synthetic data will fundamentally reshape the web\ndata ecosystem. Future GPT-$\\{n\\}$ models will inevitably be trained on a blend\nof synthetic and human-produced data. In this paper, we focus on two questions:\nwhat is the impact of synthetic data on language model training, and how to\nsynthesize data without model collapse? We first pre-train language models\nacross different proportions of synthetic data, revealing a negative\ncorrelation between the proportion of synthetic data and model performance. We\nfurther conduct statistical analysis on synthetic data to uncover\ndistributional shift phenomenon and over-concentration of n-gram features.\nInspired by the above findings, we propose token editing on human-produced data\nto obtain semi-synthetic data. As a proof of concept, we theoretically\ndemonstrate that token-level editing can prevent model collapse, as the test\nerror is constrained by a finite upper bound. We conduct extensive experiments\non pre-training from scratch, continual pre-training, and supervised\nfine-tuning. The results validate our theoretical proof that token-level\nediting improves data quality and enhances model performance.", "paper_summary_zh": "合成資料中的模型崩潰表明，對自我產生的資料進行反覆訓練會導致效能逐漸下降。隨著 AI 模型的普及，合成資料將從根本上重塑網路資料生態系統。未來的 GPT-$\\{n\\}$ 模型將不可避免地訓練於合成資料和人類產生資料的混合資料中。在本文中，我們專注於兩個問題：合成資料對語言模型訓練的影響是什麼，以及如何在不發生模型崩潰的情況下合成資料？我們首先在不同比例的合成資料中預訓練語言模型，揭示了合成資料的比例與模型效能之間的負相關。我們進一步對合成資料進行統計分析，以發現分佈轉移現象和 n-gram 特徵的過度集中。根據上述發現，我們提出對人類產生的資料進行標記編輯以取得半合成資料。作為概念證明，我們在理論上證明了標記層級編輯可以防止模型崩潰，因為測試誤差受到有限的上限約束。我們對從頭開始的預訓練、持續預訓練和監督微調進行了廣泛的實驗。結果驗證了我們的理論證明，即標記層級編輯可以改善資料品質並增強模型效能。", "author": "Xuekai Zhu et.al.", "authors": "Xuekai Zhu, Daixuan Cheng, Hengli Li, Kaiyan Zhang, Ermo Hua, Xingtai Lv, Ning Ding, Zhouhan Lin, Zilong Zheng, Bowen Zhou", "id": "2412.14689v1", "paper_url": "http://arxiv.org/abs/2412.14689v1", "repo": "null"}}