{"2410.07176": {"publish_time": "2024-10-09", "title": "Astute RAG: Overcoming Imperfect Retrieval Augmentation and Knowledge Conflicts for Large Language Models", "paper_summary": "Retrieval-Augmented Generation (RAG), while effective in integrating external\nknowledge to address the limitations of large language models (LLMs), can be\nundermined by imperfect retrieval, which may introduce irrelevant, misleading,\nor even malicious information. Despite its importance, previous studies have\nrarely explored the behavior of RAG through joint analysis on how errors from\nimperfect retrieval attribute and propagate, and how potential conflicts arise\nbetween the LLMs' internal knowledge and external sources. We find that\nimperfect retrieval augmentation might be inevitable and quite harmful, through\ncontrolled analysis under realistic conditions. We identify the knowledge\nconflicts between LLM-internal and external knowledge from retrieval as a\nbottleneck to overcome in the post-retrieval stage of RAG. To render LLMs\nresilient to imperfect retrieval, we propose Astute RAG, a novel RAG approach\nthat adaptively elicits essential information from LLMs' internal knowledge,\niteratively consolidates internal and external knowledge with source-awareness,\nand finalizes the answer according to information reliability. Our experiments\nusing Gemini and Claude demonstrate that Astute RAG significantly outperforms\nprevious robustness-enhanced RAG methods. Notably, Astute RAG is the only\napproach that matches or exceeds the performance of LLMs without RAG under\nworst-case scenarios. Further analysis reveals that Astute RAG effectively\nresolves knowledge conflicts, improving the reliability and trustworthiness of\nRAG systems.", "paper_summary_zh": "檢索增強生成（RAG）在整合外部知識以解決大型語言模型（LLM）的限制方面雖然有效，但可能會受到不完美的檢索的影響，這可能會引入不相關、誤導，甚至惡意的資訊。儘管其重要性，先前的研究很少通過聯合分析來探討 RAG 的行為，探討不完美的檢索屬性如何產生錯誤並傳播，以及 LLM 的內部知識與外部來源之間如何產生潛在衝突。我們發現不完美的檢索增強可能是不可避免且非常有害的，通過在現實條件下的受控分析。我們將 LLM 內部和外部知識之間的知識衝突從檢索中確定為在 RAG 的檢索後階段中需要克服的瓶頸。為了使 LLM 對不完美的檢索具有彈性，我們提出了精明的 RAG，這是一種新穎的 RAG 方法，它能適應性地從 LLM 的內部知識中引出必要的資訊，反覆地整合內部和外部知識與來源感知，並根據資訊可靠性確定答案。我們使用 Gemini 和 Claude 進行的實驗表明，精明的 RAG 明顯優於先前的魯棒性增強 RAG 方法。值得注意的是，精明的 RAG 是唯一一種在最壞情況下與沒有 RAG 的 LLM 的效能相匹配或超過其效能的方法。進一步的分析表明，精明的 RAG 有效地解決了知識衝突，提高了 RAG 系統的可靠性和可信度。", "author": "Fei Wang et.al.", "authors": "Fei Wang, Xingchen Wan, Ruoxi Sun, Jiefeng Chen, Sercan Ö. Arık", "id": "2410.07176v1", "paper_url": "http://arxiv.org/abs/2410.07176v1", "repo": "null"}}