{"2407.14364": {"publish_time": "2024-07-19", "title": "Towards Assessing Data Replication in Music Generation with Music Similarity Metrics on Raw Audio", "paper_summary": "Recent advancements in music generation are raising multiple concerns about\nthe implications of AI in creative music processes, current business models and\nimpacts related to intellectual property management. A relevant challenge is\nthe potential replication and plagiarism of the training set in AI-generated\nmusic, which could lead to misuse of data and intellectual property rights\nviolations. To tackle this issue, we present the Music Replication Assessment\n(MiRA) tool: a model-independent open evaluation method based on diverse audio\nmusic similarity metrics to assess data replication of the training set. We\nevaluate the ability of five metrics to identify exact replication, by\nconducting a controlled replication experiment in different music genres based\non synthetic samples. Our results show that the proposed methodology can\nestimate exact data replication with a proportion higher than 10%. By\nintroducing the MiRA tool, we intend to encourage the open evaluation of music\ngenerative models by researchers, developers and users concerning data\nreplication, highlighting the importance of ethical, social, legal and economic\nconsequences of generative AI in the music domain.", "paper_summary_zh": "最近音樂生成的進展引發了多重疑慮，包括 AI 在音樂創作過程中、當前商業模式的影響，以及與智慧財產管理相關的衝擊。一個相關的挑戰是 AI 生成的音樂中訓練資料集的潛在複製和抄襲，這可能導致資料濫用和智慧財產權的侵犯。為了解決這個問題，我們提出了音樂複製評估 (MiRA) 工具：一種基於多種音訊音樂相似度量度，用於評估訓練資料集資料複製的模型無關開放評估方法。我們透過在不同音樂類型中進行受控複製實驗，基於合成樣本，評估五種量度辨識精確複製的能力。我們的結果顯示，所提出的方法可以估計精確資料複製，其比例高於 10%。透過引進 MiRA 工具，我們希望鼓勵研究人員、開發人員和使用者公開評估音樂生成模型，並關注資料複製，強調生成式 AI 在音樂領域的道德、社會、法律和經濟後果的重要性。", "author": "Roser Batlle-Roca et.al.", "authors": "Roser Batlle-Roca, Wei-Hisang Liao, Xavier Serra, Yuki Mitsufuji, Emilia Gómez", "id": "2407.14364v1", "paper_url": "http://arxiv.org/abs/2407.14364v1", "repo": "https://github.com/roserbatlleroca/mira"}}