{"2502.06759": {"publish_time": "2025-02-10", "title": "Rationalization Models for Text-to-SQL", "paper_summary": "We introduce a framework for generating Chain-of-Thought (CoT) rationales to\nenhance text-to-SQL model fine-tuning. These rationales consist of intermediate\nSQL statements and explanations, serving as incremental steps toward\nconstructing the final SQL query. The process begins with manually annotating a\nsmall set of examples, which are then used to prompt a large language model in\nan iterative, dynamic few-shot knowledge distillation procedure from a teacher\nmodel. A rationalization model is subsequently trained on the validated\ndecomposed queries, enabling extensive synthetic CoT annotations for\ntext-to-SQL datasets. To evaluate the approach, we fine-tune small language\nmodels with and without these rationales on the BIRD dataset. Results indicate\nthat step-by-step query generation improves execution accuracy, especially for\nmoderately and highly complex queries, while also enhancing explainability.", "paper_summary_zh": "我們引入一個生成思維鏈（CoT）依據的架構，以增強文本轉 SQL 模型微調。這些依據包含中間 SQL 陳述和說明，作為建構最終 SQL 查詢的逐步步驟。此程序從手動註解一組小型範例開始，然後用於提示大型語言模型，從教師模型進行反覆、動態的少量知識萃取程序。隨後在已驗證的分解查詢上訓練合理化模型，為文本轉 SQL 資料集啟用廣泛的合成 CoT 註解。為了評估此方法，我們在 BIRD 資料集上微調了有和沒有這些依據的小型語言模型。結果表明，逐步查詢生成可改善執行準確度，特別是對於中度和高度複雜的查詢，同時也增強了可解釋性。", "author": "Gaetano Rossiello et.al.", "authors": "Gaetano Rossiello, Nhan Pham, Michael Glass, Junkyu Lee, Shankar Subramanian", "id": "2502.06759v1", "paper_url": "http://arxiv.org/abs/2502.06759v1", "repo": "null"}}