{"2408.00444": {"publish_time": "2024-08-01", "title": "Ontological Relations from Word Embeddings", "paper_summary": "It has been reliably shown that the similarity of word embeddings obtained\nfrom popular neural models such as BERT approximates effectively a form of\nsemantic similarity of the meaning of those words. It is therefore natural to\nwonder if those embeddings contain enough information to be able to connect\nthose meanings through ontological relationships such as the one of\nsubsumption. If so, large knowledge models could be built that are capable of\nsemantically relating terms based on the information encapsulated in word\nembeddings produced by pre-trained models, with implications not only for\nontologies (ontology matching, ontology evolution, etc.) but also on the\nability to integrate ontological knowledge in neural models. In this paper, we\ntest how embeddings produced by several pre-trained models can be used to\npredict relations existing between classes and properties of popular\nupper-level and general ontologies. We show that even a simple feed-forward\narchitecture on top of those embeddings can achieve promising accuracies, with\nvarying generalisation abilities depending on the input data. To achieve that,\nwe produce a dataset that can be used to further enhance those models, opening\nnew possibilities for applications integrating knowledge from web ontologies.", "paper_summary_zh": "可靠地表明，从流行神经模型（例如 BERT）获得的词嵌入的相似性有效地近似了这些词的意义的语义相似性。因此，自然会想知道这些嵌入是否包含足够的信息，以便能够通过本体关系（例如从属关系）来连接这些含义。如果是这样，则可以构建大型知识模型，这些模型能够基于预训练模型产生的词嵌入中封装的信息在语义上关联术语，不仅对本体（本体匹配、本体演化等）产生影响，而且对在神经模型中集成本体知识的能力产生影响。在本文中，我们测试了由几个预训练模型产生的嵌入如何用于预测流行的上层和通用本体的类和属性之间存在的关联。我们表明，即使在这些嵌入之上建立一个简单的前馈架构也能实现有希望的准确性，其泛化能力因输入数据而异。为了实现这一目标，我们生成了一个数据集，可用于进一步增强这些模型，为集成来自 Web 本体知识的应用程序开辟了新的可能性。", "author": "Mathieu d'Aquin et.al.", "authors": "Mathieu d'Aquin, Emmanuel Nauer", "id": "2408.00444v1", "paper_url": "http://arxiv.org/abs/2408.00444v1", "repo": "null"}}