{"2409.15949": {"publish_time": "2024-09-24", "title": "Beats of Bias: Analyzing Lyrics with Topic Modeling and Gender Bias Measurements", "paper_summary": "This paper uses topic modeling and bias measurement techniques to analyze and\ndetermine gender bias in English song lyrics. We utilize BERTopic to cluster\n537,553 English songs into distinct topics and chart their development over\ntime. Our analysis shows the thematic shift in song lyrics over the years, from\nthemes of romance to the increasing sexualization of women in songs. We observe\nlarge amounts of profanity and misogynistic lyrics on various topics,\nespecially in the overall biggest cluster. Furthermore, to analyze gender bias\nacross topics and genres, we employ the Single Category Word Embedding\nAssociation Test (SC-WEAT) to compute bias scores for the word embeddings\ntrained on the most popular topics as well as for each genre. We find that\nwords related to intelligence and strength tend to show a male bias across\ngenres, as opposed to appearance and weakness words, which are more\nfemale-biased; however, a closer look also reveals differences in biases across\ntopics.", "paper_summary_zh": "這篇論文使用主題建模和偏誤測量技術來分析和確定英文歌曲歌詞中的性別偏見。我們利用 BERTopic 將 537,553 首英文歌曲分類成不同的主題，並繪製它們隨時間的發展。我們的分析顯示了歌曲歌詞中主題的轉變，從浪漫的主題到歌曲中女性的性化程度越來越高。我們觀察到大量褻瀆和厭女的歌詞出現在各種主題中，特別是在整體最大的群集中。此外，為了分析不同主題和類別中的性別偏見，我們採用單一類別詞嵌入關聯測試 (SC-WEAT) 來計算在最熱門主題以及每個類別中訓練的詞嵌入的偏見分數。我們發現與智力和力量相關的詞彙在不同類別中往往表現出男性偏見，而與外貌和弱點相關的詞彙則更偏向女性；然而，更仔細的觀察也揭示了不同主題之間偏見的差異。", "author": "Danqing Chen et.al.", "authors": "Danqing Chen, Adithi Satish, Rasul Khanbayov, Carolin M. Schuster, Georg Groh", "id": "2409.15949v1", "paper_url": "http://arxiv.org/abs/2409.15949v1", "repo": "null"}}