{"2412.20412": {"publish_time": "2024-12-29", "title": "Multi-Objective Large Language Model Unlearning", "paper_summary": "Machine unlearning in the domain of large language models (LLMs) has\nattracted great attention recently, which aims to effectively eliminate\nundesirable behaviors from LLMs without full retraining from scratch. In this\npaper, we explore the Gradient Ascent (GA) approach in LLM unlearning, which is\na proactive way to decrease the prediction probability of the model on the\ntarget data in order to remove their influence. We analyze two challenges that\nrender the process impractical: gradient explosion and catastrophic forgetting.\nTo address these issues, we propose Multi-Objective Large Language Model\nUnlearning (MOLLM) algorithm. We first formulate LLM unlearning as a\nmulti-objective optimization problem, in which the cross-entropy loss is\nmodified to the unlearning version to overcome the gradient explosion issue. A\ncommon descent update direction is then calculated, which enables the model to\nforget the target data while preserving the utility of the LLM. Our empirical\nresults verify that MoLLM outperforms the SOTA GA-based LLM unlearning methods\nin terms of unlearning effect and model utility preservation.", "paper_summary_zh": "機器在大型語言模型（LLM）領域的去學習最近備受關注，其目標是有效消除 LLM 中的不良行為，而無需從頭開始進行完全重新訓練。在本文中，我們探討了 LLM 去學習中的梯度上升（GA）方法，這是一種主動方式，可以降低模型對目標數據的預測機率，以消除其影響。我們分析了兩個使這個過程不切實際的挑戰：梯度爆炸和災難性遺忘。為了解決這些問題，我們提出了多目標大型語言模型去學習（MOLLM）演算法。我們首先將 LLM 去學習制定為多目標最佳化問題，其中交叉熵損失被修改為去學習版本，以克服梯度爆炸問題。然後計算出一個常見的下降更新方向，這使模型能夠忘記目標數據，同時保留 LLM 的效用。我們的實證結果驗證了 MoLLM 在去學習效果和模型效用保留方面優於基於 SOTA GA 的 LLM 去學習方法。", "author": "Zibin Pan et.al.", "authors": "Zibin Pan, Shuwen Zhang, Yuesheng Zheng, Chi Li, Yuheng Cheng, Junhua Zhao", "id": "2412.20412v1", "paper_url": "http://arxiv.org/abs/2412.20412v1", "repo": "null"}}