{"2409.07796": {"publish_time": "2024-09-12", "title": "In-Situ Fine-Tuning of Wildlife Models in IoT-Enabled Camera Traps for Efficient Adaptation", "paper_summary": "Wildlife monitoring via camera traps has become an essential tool in ecology,\nbut the deployment of machine learning models for on-device animal\nclassification faces significant challenges due to domain shifts and resource\nconstraints. This paper introduces WildFit, a novel approach that reconciles\nthe conflicting goals of achieving high domain generalization performance and\nensuring efficient inference for camera trap applications. WildFit leverages\ncontinuous background-aware model fine-tuning to deploy ML models tailored to\nthe current location and time window, allowing it to maintain robust\nclassification accuracy in the new environment without requiring significant\ncomputational resources. This is achieved by background-aware data synthesis,\nwhich generates training images representing the new domain by blending\nbackground images with animal images from the source domain. We further enhance\nfine-tuning effectiveness through background drift detection and class\ndistribution drift detection, which optimize the quality of synthesized data\nand improve generalization performance. Our extensive evaluation across\nmultiple camera trap datasets demonstrates that WildFit achieves significant\nimprovements in classification accuracy and computational efficiency compared\nto traditional approaches.", "paper_summary_zh": "野生動物監測透過相機陷阱已成為生態學中不可或缺的工具，\n但機器學習模型在裝置上進行動物分類的部署面臨了領域轉移和資源限制的重大挑戰。本文介紹了 WildFit，這是一種新穎的方法，它調和了實現高領域泛化效能和確保相機陷阱應用程式有效推論的衝突目標。WildFit 利用持續的背景感知模型微調來部署針對當前位置和時間視窗量身打造的 ML 模型，使其能夠在新的環境中維持穩健的分類準確性，而無需大量的運算資源。這透過背景感知資料合成來達成，它透過將背景影像與來自原始領域的動物影像混合，產生代表新領域的訓練影像。我們透過背景漂移偵測和類別分佈漂移偵測進一步提升微調的有效性，它們最佳化了合成資料的品質並提升了泛化效能。我們在多個相機陷阱資料集上的廣泛評估顯示，與傳統方法相比，WildFit 在分類準確性和運算效率方面都有顯著的提升。", "author": "Mohammad Mehdi Rastikerdar et.al.", "authors": "Mohammad Mehdi Rastikerdar, Jin Huang, Hui Guan, Deepak Ganesan", "id": "2409.07796v1", "paper_url": "http://arxiv.org/abs/2409.07796v1", "repo": "null"}}