{"2405.20079": {"publish_time": "2024-05-30", "title": "Student Answer Forecasting: Transformer-Driven Answer Choice Prediction for Language Learning", "paper_summary": "Intelligent Tutoring Systems (ITS) enhance personalized learning by\npredicting student answers to provide immediate and customized instruction.\nHowever, recent research has primarily focused on the correctness of the answer\nrather than the student's performance on specific answer choices, limiting\ninsights into students' thought processes and potential misconceptions. To\naddress this gap, we present MCQStudentBert, an answer forecasting model that\nleverages the capabilities of Large Language Models (LLMs) to integrate\ncontextual understanding of students' answering history along with the text of\nthe questions and answers. By predicting the specific answer choices students\nare likely to make, practitioners can easily extend the model to new answer\nchoices or remove answer choices for the same multiple-choice question (MCQ)\nwithout retraining the model. In particular, we compare MLP, LSTM, BERT, and\nMistral 7B architectures to generate embeddings from students' past\ninteractions, which are then incorporated into a finetuned BERT's\nanswer-forecasting mechanism. We apply our pipeline to a dataset of language\nlearning MCQ, gathered from an ITS with over 10,000 students to explore the\npredictive accuracy of MCQStudentBert, which incorporates student interaction\npatterns, in comparison to correct answer prediction and traditional\nmastery-learning feature-based approaches. This work opens the door to more\npersonalized content, modularization, and granular support.", "paper_summary_zh": "智慧型教學系統（ITS）透過預測學生的答案提供即時且客製化的教學，以增強個人化學習。然而，近期研究主要關注於答案的正確性，而非學生在特定答案選項上的表現，這限制了對學生思考歷程和潛在誤解的洞察。為了解決這個差距，我們提出了 MCQStudentBert，這是一個答案預測模型，它利用大型語言模型（LLM）的能力來整合學生答題記錄的脈絡理解以及問題和答案的文字。透過預測學生可能會做出的特定答案選項，從業人員可以輕鬆地將模型擴展到新的答案選項，或移除同一選擇題（MCQ）的答案選項，而無需重新訓練模型。特別是，我們比較了 MLP、LSTM、BERT 和 Mistral 7B 架構，以從學生的過去互動中產生嵌入，然後將這些嵌入整合到經過微調的 BERT 的答案預測機制中。我們將我們的管線應用於一個語言學習 MCQ 的資料集，該資料集是從一個擁有超過 10,000 名學生的 ITS 中收集的，以探討 MCQStudentBert 的預測準確性，它結合了學生的互動模式，並與正確答案預測和傳統的精熟學習基於特徵的方法進行比較。這項工作為更個人化的內容、模組化和細緻的支持開啟了大門。", "author": "Elena Grazia Gado et.al.", "authors": "Elena Grazia Gado, Tommaso Martorella, Luca Zunino, Paola Mejia-Domenzain, Vinitra Swamy, Jibril Frej, Tanja Käser", "id": "2405.20079v1", "paper_url": "http://arxiv.org/abs/2405.20079v1", "repo": "null"}}