{"2412.02279": {"publish_time": "2024-12-03", "title": "A Comprehensive Evaluation of Large Language Models on Aspect-Based Sentiment Analysis", "paper_summary": "Recently, Large Language Models (LLMs) have garnered increasing attention in\nthe field of natural language processing, revolutionizing numerous downstream\ntasks with powerful reasoning and generation abilities. For example, In-Context\nLearning (ICL) introduces a fine-tuning-free paradigm, allowing out-of-the-box\nLLMs to execute downstream tasks by analogy learning without any fine-tuning.\nBesides, in a fine-tuning-dependent paradigm where substantial training data\nexists, Parameter-Efficient Fine-Tuning (PEFT), as the cost-effective methods,\nenable LLMs to achieve excellent performance comparable to full fine-tuning.\n  However, these fascinating techniques employed by LLMs have not been fully\nexploited in the ABSA field. Previous works probe LLMs in ABSA by merely using\nrandomly selected input-output pairs as demonstrations in ICL, resulting in an\nincomplete and superficial evaluation. In this paper, we shed light on a\ncomprehensive evaluation of LLMs in the ABSA field, involving 13 datasets, 8\nABSA subtasks, and 6 LLMs. Specifically, we design a unified task formulation\nto unify ``multiple LLMs for multiple ABSA subtasks in multiple paradigms.''\nFor the fine-tuning-dependent paradigm, we efficiently fine-tune LLMs using\ninstruction-based multi-task learning. For the fine-tuning-free paradigm, we\npropose 3 demonstration selection strategies to stimulate the few-shot\nabilities of LLMs. Our extensive experiments demonstrate that LLMs achieve a\nnew state-of-the-art performance compared to fine-tuned Small Language Models\n(SLMs) in the fine-tuning-dependent paradigm. More importantly, in the\nfine-tuning-free paradigm where SLMs are ineffective, LLMs with ICL still\nshowcase impressive potential and even compete with fine-tuned SLMs on some\nABSA subtasks.", "paper_summary_zh": "<paragraph>最近，大型语言模型 (LLM) 在自然语言处理领域备受关注，其强大的推理和生成能力彻底改变了众多下游任务。例如，语境学习 (ICL) 引入了一种无微调范例，允许开箱即用的 LLM 通过类比学习执行下游任务，而无需任何微调。此外，在存在大量训练数据的微调相关范例中，作为一种经济高效的方法，参数高效微调 (PEFT) 使 LLM 能够实现与完全微调相当的出色性能。\n然而，LLM 所采用的这些引人入胜的技术尚未在 ABSA 领域得到充分利用。先前的研究通过在 ICL 中仅使用随机选择的输入输出对作为演示来探究 ABSA 中的 LLM，从而导致评估不完整且肤浅。在本文中，我们重点对 ABSA 领域中的 LLM 进行了全面评估，涉及 13 个数据集、8 个 ABSA 子任务和 6 个 LLM。具体来说，我们设计了一个统一的任务公式，以统一“多个范例中的多个 ABSA 子任务的多个 LLM”。对于微调相关范例，我们使用基于指令的多任务学习有效地微调 LLM。对于无微调范例，我们提出了 3 种演示选择策略来激发 LLM 的小样本能力。我们的广泛实验表明，与微调相关范例中的微调小型语言模型 (SLM) 相比，LLM 实现了新的最先进性能。更重要的是，在 SLM 无效的无微调范例中，带有 ICL 的 LLM 仍然展示出令人印象深刻的潜力，甚至在某些 ABSA 子任务上与微调的 SLM 竞争。</paragraph>", "author": "Changzhi Zhou et.al.", "authors": "Changzhi Zhou, Dandan Song, Yuhang Tian, Zhijing Wu, Hao Wang, Xinyu Zhang, Jun Yang, Ziyi Yang, Shuhao Zhang", "id": "2412.02279v1", "paper_url": "http://arxiv.org/abs/2412.02279v1", "repo": "null"}}