{"2406.04278": {"publish_time": "2024-06-06", "title": "Characterizing Similarities and Divergences in Conversational Tones in Humans and LLMs by Sampling with People", "paper_summary": "Conversational tones -- the manners and attitudes in which speakers\ncommunicate -- are essential to effective communication. Amidst the increasing\npopularization of Large Language Models (LLMs) over recent years, it becomes\nnecessary to characterize the divergences in their conversational tones\nrelative to humans. However, existing investigations of conversational\nmodalities rely on pre-existing taxonomies or text corpora, which suffer from\nexperimenter bias and may not be representative of real-world distributions for\nthe studies' psycholinguistic domains. Inspired by methods from cognitive\nscience, we propose an iterative method for simultaneously eliciting\nconversational tones and sentences, where participants alternate between two\ntasks: (1) one participant identifies the tone of a given sentence and (2) a\ndifferent participant generates a sentence based on that tone. We run 100\niterations of this process with human participants and GPT-4, then obtain a\ndataset of sentences and frequent conversational tones. In an additional\nexperiment, humans and GPT-4 annotated all sentences with all tones. With data\nfrom 1,339 human participants, 33,370 human judgments, and 29,900 GPT-4\nqueries, we show how our approach can be used to create an interpretable\ngeometric representation of relations between conversational tones in humans\nand GPT-4. This work demonstrates how combining ideas from machine learning and\ncognitive science can address challenges in human-computer interactions.", "paper_summary_zh": "對話語氣——說話者在溝通中表現出的禮儀和態度——對於有效的溝通至關重要。近年來，隨著大型語言模型 (LLM) 的普及，有必要描述它們的對話語氣與人類之間的差異。然而，現有的對話模式研究依賴於現有的分類法或文本語料庫，這些分類法或語料庫存在實驗者偏差，且可能無法代表研究的心理語言學領域的真實世界分佈。受認知科學方法的啟發，我們提出了一種迭代方法，用於同時引出對話語氣和句子，參與者在兩項任務之間交替進行：(1) 一位參與者識別給定句子的語氣，(2) 另一位參與者根據該語氣生成一個句子。我們與人類參與者和 GPT-4 一起運行此過程的 100 次迭代，然後獲得一個句子和頻繁對話語氣的數據集。在額外的實驗中，人類和 GPT-4 用所有語氣註釋了所有句子。利用來自 1,339 位人類參與者、33,370 個人類判斷和 29,900 個 GPT-4 查詢的數據，我們展示了我們的方法如何用於創建人類和 GPT-4 中對話語氣之間關係的可解釋幾何表示。這項工作展示了如何結合機器學習和認知科學的理念來應對人機交互中的挑戰。", "author": "Dun-Ming Huang et.al.", "authors": "Dun-Ming Huang, Pol Van Rijn, Ilia Sucholutsky, Raja Marjieh, Nori Jacoby", "id": "2406.04278v1", "paper_url": "http://arxiv.org/abs/2406.04278v1", "repo": "null"}}