{"2410.08111": {"publish_time": "2024-10-10", "title": "Active Fourier Auditor for Estimating Distributional Properties of ML Models", "paper_summary": "With the pervasive deployment of Machine Learning (ML) models in real-world\napplications, verifying and auditing properties of ML models have become a\ncentral concern. In this work, we focus on three properties: robustness,\nindividual fairness, and group fairness. We discuss two approaches for auditing\nML model properties: estimation with and without reconstruction of the target\nmodel under audit. Though the first approach is studied in the literature, the\nsecond approach remains unexplored. For this purpose, we develop a new\nframework that quantifies different properties in terms of the Fourier\ncoefficients of the ML model under audit but does not parametrically\nreconstruct it. We propose the Active Fourier Auditor (AFA), which queries\nsample points according to the Fourier coefficients of the ML model, and\nfurther estimates the properties. We derive high probability error bounds on\nAFA's estimates, along with the worst-case lower bounds on the sample\ncomplexity to audit them. Numerically we demonstrate on multiple datasets and\nmodels that AFA is more accurate and sample-efficient to estimate the\nproperties of interest than the baselines.", "paper_summary_zh": "隨著機器學習 (ML) 模型在實際應用中廣泛部署，驗證和審核 ML 模型的屬性已成為一項核心關注事項。在這項工作中，我們專注於三個屬性：穩健性、個別公平性和群體公平性。我們討論了審核 ML 模型屬性的兩種方法：在有和沒有重建審核目標模型的情況下進行估計。儘管第一種方法在文獻中得到了研究，但第二種方法仍未得到探索。為此，我們開發了一個新的框架，該框架根據審核中的 ML 模型的傅立葉係數對不同的屬性進行量化，但不會對其進行參數化重建。我們提出了主動傅立葉審核器 (AFA)，它根據 ML 模型的傅立葉係數查詢樣本點，並進一步估計屬性。我們推導出 AFA 估計的高機率誤差界限，以及審核它們的樣本複雜度的最壞情況下界。我們在多個數據集和模型上數值證明，AFA 比基準線更準確且更具樣本效率，可以估計感興趣的屬性。", "author": "Ayoub Ajarra et.al.", "authors": "Ayoub Ajarra, Bishwamittra Ghosh, Debabrota Basu", "id": "2410.08111v1", "paper_url": "http://arxiv.org/abs/2410.08111v1", "repo": "null"}}