{"2407.21659": {"publish_time": "2024-07-31", "title": "Defending Jailbreak Attack in VLMs via Cross-modality Information Detector", "paper_summary": "Vision Language Models (VLMs) extend the capacity of LLMs to comprehensively\nunderstand vision information, achieving remarkable performance in many\nvision-centric tasks. Despite that, recent studies have shown that these models\nare susceptible to jailbreak attacks, which refer to an exploitative technique\nwhere malicious users can break the safety alignment of the target model and\ngenerate misleading and harmful answers. This potential threat is caused by\nboth the inherent vulnerabilities of LLM and the larger attack scope introduced\nby vision input. To enhance the security of VLMs against jailbreak attacks,\nresearchers have developed various defense techniques. However, these methods\neither require modifications to the model's internal structure or demand\nsignificant computational resources during the inference phase. Multimodal\ninformation is a double-edged sword. While it increases the risk of attacks, it\nalso provides additional data that can enhance safeguards. Inspired by this, we\npropose $\\underline{\\textbf{C}}$ross-modality\n$\\underline{\\textbf{I}}$nformation\n$\\underline{\\textbf{DE}}$tecto$\\underline{\\textbf{R}}$ ($\\textit{CIDER})$, a\nplug-and-play jailbreaking detector designed to identify maliciously perturbed\nimage inputs, utilizing the cross-modal similarity between harmful queries and\nadversarial images. This simple yet effective cross-modality information\ndetector, $\\textit{CIDER}$, is independent of the target VLMs and requires less\ncomputation cost. Extensive experimental results demonstrate the effectiveness\nand efficiency of $\\textit{CIDER}$, as well as its transferability to both\nwhite-box and black-box VLMs.", "paper_summary_zh": "<paragraph>視覺語言模型 (VLM) 擴展了 LLM 全面理解視覺資訊的能力，在許多以視覺為中心的任务中取得顯著的表現。儘管如此，最近的研究顯示，這些模型容易受到越獄攻擊，這是一種剝削技術，惡意使用者可以破壞目標模型的安全對齊，並產生具有誤導性和危害性的答案。這種潛在威脅是由 LLM 的固有漏洞和視覺輸入引入的更大攻擊範圍所造成的。為了增強 VLM 對抗越獄攻擊的安全性，研究人員開發了各種防禦技術。然而，這些方法需要修改模型的內部結構，或在推理階段需要大量的計算資源。多模態資訊是一把雙面刃。雖然它增加了攻擊風險，但它也提供了可以增強防護措施的額外資料。受此啟發，我們提出跨模態資訊偵測器 ($\\textit{CIDER}$)，這是一個即插即用的越獄偵測器，旨在識別惡意擾動的影像輸入，利用有害查詢和對抗性影像之間的跨模態相似性。這個簡單但有效的跨模態資訊偵測器 $\\textit{CIDER}$ 獨立於目標 VLM，並且需要較少的計算成本。廣泛的實驗結果證明了 $\\textit{CIDER}$ 的有效性和效率，以及它對白盒和黑盒 VLM 的可移植性。</paragraph>", "author": "Yue Xu et.al.", "authors": "Yue Xu, Xiuyuan Qi, Zhan Qin, Wenjie Wang", "id": "2407.21659v2", "paper_url": "http://arxiv.org/abs/2407.21659v2", "repo": "null"}}