{"2503.15415": {"publish_time": "2025-03-19", "title": "Automated Processing of eXplainable Artificial Intelligence Outputs in Deep Learning Models for Fault Diagnostics of Large Infrastructures", "paper_summary": "Deep Learning (DL) models processing images to recognize the health state of\nlarge infrastructure components can exhibit biases and rely on non-causal\nshortcuts. eXplainable Artificial Intelligence (XAI) can address these issues\nbut manually analyzing explanations generated by XAI techniques is\ntime-consuming and prone to errors. This work proposes a novel framework that\ncombines post-hoc explanations with semi-supervised learning to automatically\nidentify anomalous explanations that deviate from those of correctly classified\nimages and may therefore indicate model abnormal behaviors. This significantly\nreduces the workload for maintenance decision-makers, who only need to manually\nreclassify images flagged as having anomalous explanations. The proposed\nframework is applied to drone-collected images of insulator shells for power\ngrid infrastructure monitoring, considering two different Convolutional Neural\nNetworks (CNNs), GradCAM explanations and Deep Semi-Supervised Anomaly\nDetection. The average classification accuracy on two faulty classes is\nimproved by 8% and maintenance operators are required to manually reclassify\nonly 15% of the images. We compare the proposed framework with a\nstate-of-the-art approach based on the faithfulness metric: the experimental\nresults obtained demonstrate that the proposed framework consistently achieves\nF_1 scores larger than those of the faithfulness-based approach. Additionally,\nthe proposed framework successfully identifies correct classifications that\nresult from non-causal shortcuts, such as the presence of ID tags printed on\ninsulator shells.", "paper_summary_zh": "<paragraph>深度學習 (DL) 模型在處理影像以辨識大型基礎設施組件的健康狀態時，可能會出現偏差，並依賴非因果捷徑。可解釋人工智慧 (XAI) 可以解決這些問題，但手動分析 XAI 技術產生的解釋既耗時又容易出錯。這項工作提出了一個新的框架，將事後解釋與半監督學習相結合，以自動識別與正確分類影像的解釋不同的異常解釋，這些異常解釋可能表明模型存在異常行為。這顯著減少了維護決策者的工作量，他們只需手動重新分類被標記為具有異常解釋的影像。擬議的框架應用於無人機收集的電力網基礎設施監控用絕緣殼影像，考慮了兩種不同的卷積神經網路 (CNN)、GradCAM 解釋和深度半監督異常檢測。兩個故障類別的平均分類準確度提高了 8%，維護操作員只需手動重新分類 15% 的影像。我們將提出的框架與基於忠實度指標的最先進方法進行了比較：獲得的實驗結果表明，提出的框架始終實現的 F_1 分數高於基於忠實度的方法。此外，提出的框架成功識別了由非因果捷徑導致的正確分類，例如絕緣殼上印製的 ID 標籤。</paragraph>\n", "author": "Giovanni Floreale et.al.", "authors": "Giovanni Floreale, Piero Baraldi, Enrico Zio, Olga Fink", "id": "2503.15415v1", "paper_url": "http://arxiv.org/abs/2503.15415v1", "repo": "null"}}