{"2410.16215": {"publish_time": "2024-10-21", "title": "Pre-training Distillation for Large Language Models: A Design Space Exploration", "paper_summary": "Knowledge distillation (KD) aims to transfer knowledge from a large teacher\nmodel to a smaller student model. Previous work applying KD in the field of\nlarge language models (LLMs) typically focused on the post-training phase,\nwhere the student LLM learns directly from instructions and corresponding\nresponses generated by the teacher model. In this paper, we extend KD to the\npre-training phase of LLMs, named pre-training distillation (PD). We first\nconduct a preliminary experiment using GLM-4-9B as the teacher LLM to distill a\n1.9B parameter student LLM, validating the effectiveness of PD. Considering the\nkey impact factors of distillation, we systematically explore the design space\nof pre-training distillation across four aspects: logits processing, loss\nselection, scaling law, and offline or online logits. We conduct extensive\nexperiments to explore the design space of pre-training distillation and find\nbetter configurations and interesting conclusions, such as larger student LLMs\ngenerally benefiting more from pre-training distillation, while a larger\nteacher LLM does not necessarily guarantee better results. We hope our\nexploration of the design space will inform future practices in pre-training\ndistillation.", "paper_summary_zh": "知識蒸餾 (KD) 的目標是將知識從大型教師模型傳輸到小型學生模型。先前在大型語言模型 (LLM) 領域中應用 KD 的工作通常專注於後訓練階段，其中學生 LLM 直接從教師模型產生的說明和對應回應中學習。在本文中，我們將 KD 擴展到 LLM 的預訓練階段，稱為預訓練蒸餾 (PD)。我們首先使用 GLM-4-9B 作為教師 LLM 進行初步實驗，以蒸餾 1.9B 參數學生 LLM，驗證 PD 的有效性。考慮到蒸餾的主要影響因素，我們系統地探索了預訓練蒸餾的設計空間，涵蓋四個方面：對數處理、損失選擇、比例定律和離線或線上對數。我們進行了廣泛的實驗，以探索預訓練蒸餾的設計空間，並找出更好的配置和有趣的結論，例如，較大的學生 LLM 通常從預訓練蒸餾中獲益更多，而較大的教師 LLM 並不一定能保證更好的結果。我們希望我們對設計空間的探索將為預訓練蒸餾中的未來實務提供資訊。", "author": "Hao Peng et.al.", "authors": "Hao Peng, Xin Lv, Yushi Bai, Zijun Yao, Jiajie Zhang, Lei Hou, Juanzi Li", "id": "2410.16215v1", "paper_url": "http://arxiv.org/abs/2410.16215v1", "repo": "null"}}