{"2501.10328": {"publish_time": "2025-01-17", "title": "BoK: Introducing Bag-of-Keywords Loss for Interpretable Dialogue Response Generation", "paper_summary": "The standard language modeling (LM) loss by itself has been shown to be\ninadequate for effective dialogue modeling. As a result, various training\napproaches, such as auxiliary loss functions and leveraging human feedback, are\nbeing adopted to enrich open-domain dialogue systems. One such auxiliary loss\nfunction is Bag-of-Words (BoW) loss, defined as the cross-entropy loss for\npredicting all the words/tokens of the next utterance. In this work, we propose\na novel auxiliary loss named Bag-of-Keywords (BoK) loss to capture the central\nthought of the response through keyword prediction and leverage it to enhance\nthe generation of meaningful and interpretable responses in open-domain\ndialogue systems. BoK loss upgrades the BoW loss by predicting only the\nkeywords or critical words/tokens of the next utterance, intending to estimate\nthe core idea rather than the entire response. We incorporate BoK loss in both\nencoder-decoder (T5) and decoder-only (DialoGPT) architecture and train the\nmodels to minimize the weighted sum of BoK and LM (BoK-LM) loss. We perform our\nexperiments on two popular open-domain dialogue datasets, DailyDialog and\nPersona-Chat. We show that the inclusion of BoK loss improves the dialogue\ngeneration of backbone models while also enabling post-hoc interpretability. We\nalso study the effectiveness of BoK-LM loss as a reference-free metric and\nobserve comparable performance to the state-of-the-art metrics on various\ndialogue evaluation datasets.", "paper_summary_zh": "標準語言模型 (LM) 損失本身已被證明不足以進行有效的對話建模。因此，各種訓練方法，例如輔助損失函數和利用人類回饋，正被用於豐富開放域對話系統。其中一個這樣的輔助損失函數是詞袋 (BoW) 損失，定義為預測下一個語句的所有字詞/標記的交叉熵損失。在這項工作中，我們提出了一個名為關鍵詞袋 (BoK) 損失的新型輔助損失，以通過關鍵詞預測來捕捉回應的中心思想，並利用它來增強開放域對話系統中生成有意義且可解釋的回應。BoK 損失通過僅預測下一個語句的關鍵詞或關鍵字詞/標記來升級 BoW 損失，旨在估計核心思想，而不是整個回應。我們將 BoK 損失整合到編碼器-解碼器 (T5) 和僅解碼器 (DialoGPT) 架構中，並訓練模型以最小化 BoK 和 LM (BoK-LM) 損失的加權和。我們在兩個流行的開放域對話資料集 DailyDialog 和 Persona-Chat 上執行我們的實驗。我們表明，BoK 損失的加入改善了主幹模型的對話生成，同時也實現了事後可解釋性。我們還研究了 BoK-LM 損失作為無參考指標的有效性，並觀察到在各種對話評估資料集上與最先進的指標具有可比的性能。", "author": "Suvodip Dey et.al.", "authors": "Suvodip Dey, Maunendra Sankar Desarkar", "id": "2501.10328v1", "paper_url": "http://arxiv.org/abs/2501.10328v1", "repo": "https://github.com/suvodipdey/bok"}}