{"2407.01994": {"publish_time": "2024-07-02", "title": "Simple Augmentations of Logical Rules for Neuro-Symbolic Knowledge Graph Completion", "paper_summary": "High-quality and high-coverage rule sets are imperative to the success of\nNeuro-Symbolic Knowledge Graph Completion (NS-KGC) models, because they form\nthe basis of all symbolic inferences. Recent literature builds neural models\nfor generating rule sets, however, preliminary experiments show that they\nstruggle with maintaining high coverage. In this work, we suggest three simple\naugmentations to existing rule sets: (1) transforming rules to their abductive\nforms, (2) generating equivalent rules that use inverse forms of constituent\nrelations and (3) random walks that propose new rules. Finally, we prune\npotentially low quality rules. Experiments over four datasets and five\nruleset-baseline settings suggest that these simple augmentations consistently\nimprove results, and obtain up to 7.1 pt MRR and 8.5 pt Hits@1 gains over using\nrules without augmentations.", "paper_summary_zh": "高品質且高覆蓋率的規則集對於神經符號知識圖譜完成功能 (NS-KGC) 模型的成功至關重要，因為它們形成所有符號推論的基礎。最近的文獻為產生規則集建立神經模型，然而，初步實驗顯示它們在維持高覆蓋率方面有困難。在這項工作中，我們建議對現有規則集進行三個簡單的擴充：(1) 將規則轉換為它們的演繹形式，(2) 產生使用構成關係的逆形式的等效規則，以及 (3) 提出新規則的隨機遊走。最後，我們修剪潛在的低品質規則。在四個資料集和五個規則集基準設定上的實驗表明，這些簡單的擴充持續改善結果，並獲得比不使用擴充的規則多達 7.1 pt MRR 和 8.5 pt Hits@1 的增益。", "author": "Ananjan Nandi et.al.", "authors": "Ananjan Nandi, Navdeep Kaur, Parag Singla, Mausam", "id": "2407.01994v1", "paper_url": "http://arxiv.org/abs/2407.01994v1", "repo": "null"}}