{"2407.13524": {"publish_time": "2024-07-18", "title": "Enhancing Source-Free Domain Adaptive Object Detection with Low-confidence Pseudo Label Distillation", "paper_summary": "Source-Free domain adaptive Object Detection (SFOD) is a promising strategy\nfor deploying trained detectors to new, unlabeled domains without accessing\nsource data, addressing significant concerns around data privacy and\nefficiency. Most SFOD methods leverage a Mean-Teacher (MT) self-training\nparadigm relying heavily on High-confidence Pseudo Labels (HPL). However, these\nHPL often overlook small instances that undergo significant appearance changes\nwith domain shifts. Additionally, HPL ignore instances with low confidence due\nto the scarcity of training samples, resulting in biased adaptation toward\nfamiliar instances from the source domain. To address this limitation, we\nintroduce the Low-confidence Pseudo Label Distillation (LPLD) loss within the\nMean-Teacher based SFOD framework. This novel approach is designed to leverage\nthe proposals from Region Proposal Network (RPN), which potentially encompasses\nhard-to-detect objects in unfamiliar domains. Initially, we extract HPL using a\nstandard pseudo-labeling technique and mine a set of Low-confidence Pseudo\nLabels (LPL) from proposals generated by RPN, leaving those that do not overlap\nsignificantly with HPL. These LPL are further refined by leveraging\nclass-relation information and reducing the effect of inherent noise for the\nLPLD loss calculation. Furthermore, we use feature distance to adaptively\nweight the LPLD loss to focus on LPL containing a larger foreground area. Our\nmethod outperforms previous SFOD methods on four cross-domain object detection\nbenchmarks. Extensive experiments demonstrate that our LPLD loss leads to\neffective adaptation by reducing false negatives and facilitating the use of\ndomain-invariant knowledge from the source model. Code is available at\nhttps://github.com/junia3/LPLD.", "paper_summary_zh": "<paragraph>無來源域自適應物件偵測 (SFOD) 是一種將已訓練偵測器部署到新的未標記域而不存取來源資料的策略，可解決資料隱私和效率方面的重大問題。大多數 SFOD 方法利用平均教師 (MT) 自我訓練範例，高度依賴高信心偽標籤 (HPL)。然而，這些 HPL 常常忽略在域轉移中經歷顯著外觀變化的微小實例。此外，由於訓練樣本稀少，HPL 會忽略信心較低的實例，導致對來源域中熟悉的實例產生偏差適應。為了解決這個限制，我們在基於平均教師的 SFOD 架構中引入了低信心偽標籤蒸餾 (LPLD) 損失。這種新方法旨在利用區域建議網路 (RPN) 的建議，這可能涵蓋不熟悉的域中難以偵測的物件。最初，我們使用標準偽標籤技術提取 HPL，並從 RPN 生成的建議中找出低信心偽標籤 (LPL)，留下那些與 HPL 沒有顯著重疊的建議。這些 LPL 會進一步透過利用類別關係資訊和減少 LPLD 損失計算的固有雜訊效果來精煉。此外，我們使用特徵距離自適應地加權 LPLD 損失，以專注於包含較大前景區域的 LPL。我們的模型在四個跨域物件偵測基準上優於先前的 SFOD 模型。廣泛的實驗證明，我們的 LPLD 損失可透過減少假陰性和促進使用來源模型中的域不變知識來有效適應。程式碼可在 https://github.com/junia3/LPLD 取得。</paragraph>", "author": "Ilhoon Yoon et.al.", "authors": "Ilhoon Yoon, Hyeongjun Kwon, Jin Kim, Junyoung Park, Hyunsung Jang, Kwanghoon Sohn", "id": "2407.13524v1", "paper_url": "http://arxiv.org/abs/2407.13524v1", "repo": "null"}}