{"2406.08354": {"publish_time": "2024-06-12", "title": "DocSynthv2: A Practical Autoregressive Modeling for Document Generation", "paper_summary": "While the generation of document layouts has been extensively explored,\ncomprehensive document generation encompassing both layout and content presents\na more complex challenge. This paper delves into this advanced domain,\nproposing a novel approach called DocSynthv2 through the development of a\nsimple yet effective autoregressive structured model. Our model, distinct in\nits integration of both layout and textual cues, marks a step beyond existing\nlayout-generation approaches. By focusing on the relationship between the\nstructural elements and the textual content within documents, we aim to\ngenerate cohesive and contextually relevant documents without any reliance on\nvisual components. Through experimental studies on our curated benchmark for\nthe new task, we demonstrate the ability of our model combining layout and\ntextual information in enhancing the generation quality and relevance of\ndocuments, opening new pathways for research in document creation and automated\ndesign. Our findings emphasize the effectiveness of autoregressive models in\nhandling complex document generation tasks.", "paper_summary_zh": "雖然文件版面生成已廣泛探討，\n但包含版面和內容的全面文件生成\n是一個更複雜的挑戰。這篇論文深入探討這個進階領域，\n提出一個稱為 DocSynthv2 的新方法，透過開發一個\n簡單但有效的自迴歸結構模型。我們的模型不同於\n整合版面和文字提示，標誌著超越現有\n版面生成方法的一步。透過專注於文件中的\n結構元素和文字內容之間的關係，我們旨在\n生成有凝聚力和符合脈絡的文件，而無需依賴\n視覺組件。透過對我們為新任務策展的基準進行實驗研究，我們展示了我們的模型結合版面和\n文字資訊的能力，以提升文件生成品質和相關性，為文件建立和自動\n設計的研究開啟新途徑。我們的發現強調了自迴歸模型在\n處理複雜文件生成任務中的有效性。", "author": "Sanket Biswas et.al.", "authors": "Sanket Biswas, Rajiv Jain, Vlad I. Morariu, Jiuxiang Gu, Puneet Mathur, Curtis Wigington, Tong Sun, Josep Lladós", "id": "2406.08354v1", "paper_url": "http://arxiv.org/abs/2406.08354v1", "repo": "null"}}