{"2409.13252": {"publish_time": "2024-09-20", "title": "Leveraging Knowledge Graphs and LLMs to Support and Monitor Legislative Systems", "paper_summary": "Knowledge Graphs (KGs) have been used to organize large datasets into\nstructured, interconnected information, enhancing data analytics across various\nfields. In the legislative context, one potential natural application of KGs is\nmodeling the intricate set of interconnections that link laws and their\narticles with each other and the broader legislative context.\n  At the same time, the rise of large language models (LLMs) such as GPT has\nopened new opportunities in legal applications, such as text generation and\ndocument drafting. Despite their potential, the use of LLMs in legislative\ncontexts is critical since it requires the absence of hallucinations and\nreliance on up-to-date information, as new laws are published on a daily basis.\n  This work investigates how Legislative Knowledge Graphs and LLMs can\nsynergize and support legislative processes. We address three key questions:\nthe benefits of using KGs for legislative systems, how LLM can support\nlegislative activities by ensuring an accurate output, and how we can allow\nnon-technical users to use such technologies in their activities. To this aim,\nwe develop Legis AI Platform, an interactive platform focused on Italian\nlegislation that enhances the possibility of conducting legislative analysis\nand that aims to support lawmaking activities.", "paper_summary_zh": "知識圖譜 (KG) 已被用於將大型資料集整理成結構化、相互關聯的資訊，以增強各種領域的資料分析。在立法背景下，KG 的一個潛在自然應用是建模連結法律及其條文彼此之間以及更廣泛立法背景的複雜相互連結集。\n與此同時，大型語言模型 (LLM)（例如 GPT）的興起為法律應用開闢了新的機會，例如文字產生和文件起草。儘管有其潛力，在立法背景下使用 LLM 至關重要，因為它需要沒有幻覺並且依賴於最新的資訊，因為每天都會公佈新的法律。\n這項工作探討了立法知識圖譜和 LLM 如何產生協同效應並支援立法程序。我們探討了三個關鍵問題：使用 KG 對立法系統的好處、LLM 如何透過確保準確的輸出支援立法活動，以及我們如何讓非技術使用者在他們的活動中使用這些技術。為此，我們開發了 Legis AI Platform，這是一個專注於義大利立法的互動式平台，可增強進行立法分析的可能性，並旨在支援立法活動。", "author": "Andrea Colombo et.al.", "authors": "Andrea Colombo", "id": "2409.13252v1", "paper_url": "http://arxiv.org/abs/2409.13252v1", "repo": "null"}}