{"2411.18225": {"publish_time": "2024-11-27", "title": "PATHS: A Hierarchical Transformer for Efficient Whole Slide Image Analysis", "paper_summary": "Computational analysis of whole slide images (WSIs) has seen significant\nresearch progress in recent years, with applications ranging across important\ndiagnostic and prognostic tasks such as survival or cancer subtype prediction.\nMany state-of-the-art models process the entire slide - which may be as large\nas $150,000 \\times 150,000$ pixels - as a bag of many patches, the size of\nwhich necessitates computationally cheap feature aggregation methods. However,\na large proportion of these patches are uninformative, such as those containing\nonly healthy or adipose tissue, adding significant noise and size to the bag.\nWe propose Pathology Transformer with Hierarchical Selection (PATHS), a novel\ntop-down method for hierarchical weakly supervised representation learning on\nslide-level tasks in computational pathology. PATHS is inspired by the\ncross-magnification manner in which a human pathologist examines a slide,\nrecursively filtering patches at each magnification level to a small subset\nrelevant to the diagnosis. Our method overcomes the complications of processing\nthe entire slide, enabling quadratic self-attention and providing a simple\ninterpretable measure of region importance. We apply PATHS to five datasets of\nThe Cancer Genome Atlas (TCGA), and achieve superior performance on slide-level\nprediction tasks when compared to previous methods, despite processing only a\nsmall proportion of the slide.", "paper_summary_zh": "近年來，全玻片影像 (WSI) 的計算分析已取得顯著的研究進展，其應用範圍涵蓋重要的診斷和預後任務，例如存活率或癌症亞型預測。許多最先進的模型將整個玻片（可能大至 150,000 × 150,000 像素）視為許多區塊的集合，其大小需要計算成本低廉的特徵聚合方法。然而，這些區塊中很大一部分沒有提供資訊，例如僅包含健康或脂肪組織的區塊，這會為集合增加大量雜訊和大小。我們提出具有階層式選擇的病理Transformer (PATHS)，這是一種新穎的自上而下方法，用於計算病理學中玻片級任務的階層式弱監督表示學習。PATHS 的靈感來自人類病理學家檢查玻片的跨放大倍率方式，在每個放大倍率層級遞迴地將區塊篩選為與診斷相關的小子集。我們的這種方法克服了處理整個玻片的複雜性，支援二次自注意力，並提供一個區域重要性的簡單可解讀測量。我們將 PATHS 應用於癌症基因組圖譜 (TCGA) 的五個資料集，並在玻片級預測任務上取得優異的效能，儘管僅處理了玻片的一小部分。", "author": "Zak Buzzard et.al.", "authors": "Zak Buzzard, Konstantin Hemker, Nikola Simidjievski, Mateja Jamnik", "id": "2411.18225v1", "paper_url": "http://arxiv.org/abs/2411.18225v1", "repo": "null"}}