{"2411.03855": {"publish_time": "2024-11-06", "title": "MambaPEFT: Exploring Parameter-Efficient Fine-Tuning for Mamba", "paper_summary": "An ecosystem of Transformer-based models has been established by building\nlarge models with extensive data. Parameter-efficient fine-tuning (PEFT) is a\ncrucial technology for deploying these models to downstream tasks with minimal\ncost while achieving effective performance. Recently, Mamba, a State Space\nModel (SSM)-based model, has attracted attention as a potential alternative to\nTransformers. While many large-scale Mamba-based models have been proposed,\nefficiently adapting pre-trained Mamba-based models to downstream tasks remains\nunexplored. In this paper, we conduct an exploratory analysis of PEFT methods\nfor Mamba. We investigate the effectiveness of existing PEFT methods for\nTransformers when applied to Mamba. We also modify these methods to better\nalign with the Mamba architecture. Additionally, we propose new Mamba-specific\nPEFT methods that leverage the distinctive structure of Mamba. Our experiments\nindicate that PEFT performs more effectively for Mamba than Transformers.\nLastly, we demonstrate how to effectively combine multiple PEFT methods and\nprovide a framework that outperforms previous works. To ensure reproducibility,\nwe will release the code after publication.", "paper_summary_zh": "<paragraph>已經透過建立擁有廣泛資料的大型模型，建立了基於 Transformer 的模型生態系統。參數有效微調 (PEFT) 是一項關鍵技術，用於以最低成本將這些模型部署到下游任務，同時達到有效效能。最近，一種基於狀態空間模型 (SSM) 的模型 Mamba，因其作為 Transformer 的潛在替代方案而備受關注。雖然已經提出許多大型基於 Mamba 的模型，但有效地調整預先訓練的基於 Mamba 的模型以適應下游任務仍未被探索。在本文中，我們對 Mamba 的 PEFT 方法進行探索性分析。我們探討了將現有針對 Transformer 的 PEFT 方法應用到 Mamba 時的有效性。我們也修改這些方法以更好地與 Mamba 架構對齊。此外，我們提出新的特定於 Mamba 的 PEFT 方法，這些方法利用了 Mamba 的獨特結構。我們的實驗表明，PEFT 對 Mamba 的執行比 Transformer 更有效。最後，我們展示如何有效地結合多種 PEFT 方法，並提供一個優於先前工作的架構。為了確保可複製性，我們將在發布後釋出程式碼。</paragraph>", "author": "Masakazu Yoshimura et.al.", "authors": "Masakazu Yoshimura, Teruaki Hayashi, Yota Maeda", "id": "2411.03855v1", "paper_url": "http://arxiv.org/abs/2411.03855v1", "repo": "null"}}