{"2502.13012": {"publish_time": "2025-02-18", "title": "Towards a Design Guideline for RPA Evaluation: A Survey of Large Language Model-Based Role-Playing Agents", "paper_summary": "Role-Playing Agent (RPA) is an increasingly popular type of LLM Agent that\nsimulates human-like behaviors in a variety of tasks. However, evaluating RPAs\nis challenging due to diverse task requirements and agent designs. This paper\nproposes an evidence-based, actionable, and generalizable evaluation design\nguideline for LLM-based RPA by systematically reviewing 1,676 papers published\nbetween Jan. 2021 and Dec. 2024. Our analysis identifies six agent attributes,\nseven task attributes, and seven evaluation metrics from existing literature.\nBased on these findings, we present an RPA evaluation design guideline to help\nresearchers develop more systematic and consistent evaluation methods.", "paper_summary_zh": "角色扮演代理（RPA）是一種越來越流行的 LLM 代理，它能模擬人類在各種任務中的行為。然而，由於任務需求和代理設計的多樣性，評估 RPA 具有挑戰性。本文通過系統地審查 2021 年 1 月至 2024 年 12 月期間發表的 1,676 篇論文，提出了基於證據、可操作且可推廣的 LLM 基於 RPA 的評估設計指南。我們的分析從現有文獻中識別出六個代理屬性、七個任務屬性和七個評估指標。根據這些發現，我們提出了 RPA 評估設計指南，以幫助研究人員開發更系統化和一致的評估方法。", "author": "Chaoran Chen et.al.", "authors": "Chaoran Chen, Bingsheng Yao, Ruishi Zou, Wenyue Hua, Weimin Lyu, Toby Jia-Jun Li, Dakuo Wang", "id": "2502.13012v1", "paper_url": "http://arxiv.org/abs/2502.13012v1", "repo": "null"}}