{"2410.03315": {"publish_time": "2024-10-04", "title": "Influence-oriented Personalized Federated Learning", "paper_summary": "Traditional federated learning (FL) methods often rely on fixed weighting for\nparameter aggregation, neglecting the mutual influence by others. Hence, their\neffectiveness in heterogeneous data contexts is limited. To address this\nproblem, we propose an influence-oriented federated learning framework, namely\nFedC^2I, which quantitatively measures Client-level and Class-level Influence\nto realize adaptive parameter aggregation for each client. Our core idea is to\nexplicitly model the inter-client influence within an FL system via the\nwell-crafted influence vector and influence matrix. The influence vector\nquantifies client-level influence, enables clients to selectively acquire\nknowledge from others, and guides the aggregation of feature representation\nlayers. Meanwhile, the influence matrix captures class-level influence in a\nmore fine-grained manner to achieve personalized classifier aggregation. We\nevaluate the performance of FedC^2I against existing federated learning methods\nunder non-IID settings and the results demonstrate the superiority of our\nmethod.", "paper_summary_zh": "傳統的聯合學習 (FL) 方法通常依賴於固定權重來進行參數聚合，忽略了其他參數的相互影響。因此，它們在異質數據環境中的有效性受到限制。為了解決這個問題，我們提出了一個以影響為導向的聯合學習框架，稱為 FedC^2I，它定量測量客戶端級別和類別級別的影響，以實現每個客戶端的自適應參數聚合。我們的核心思想是通過精心製作的影響向量和影響矩陣，明確地對 FL 系統內的客戶端間影響進行建模。影響向量量化客戶端級別的影響，使客戶端能夠有選擇地從其他客戶端獲取知識，並指導特徵表示層的聚合。同時，影響矩陣以更細粒度的形式捕捉類別級別的影響，以實現個性化分類器聚合。我們在非 IID 設置下評估了 FedC^2I 與現有聯合學習方法的性能，結果證明了我們方法的優越性。", "author": "Yue Tan et.al.", "authors": "Yue Tan, Guodong Long, Jing Jiang, Chengqi Zhang", "id": "2410.03315v1", "paper_url": "http://arxiv.org/abs/2410.03315v1", "repo": "null"}}