{"2412.15268": {"publish_time": "2024-12-17", "title": "Enhancing LLM-based Hatred and Toxicity Detection with Meta-Toxic Knowledge Graph", "paper_summary": "The rapid growth of social media platforms has raised significant concerns\nregarding online content toxicity. When Large Language Models (LLMs) are used\nfor toxicity detection, two key challenges emerge: 1) the absence of\ndomain-specific toxic knowledge leads to false negatives; 2) the excessive\nsensitivity of LLMs to toxic speech results in false positives, limiting\nfreedom of speech. To address these issues, we propose a novel method called\nMetaTox, leveraging graph search on a meta-toxic knowledge graph to enhance\nhatred and toxicity detection. First, we construct a comprehensive meta-toxic\nknowledge graph by utilizing LLMs to extract toxic information through a\nthree-step pipeline, with toxic benchmark datasets serving as corpora. Second,\nwe query the graph via retrieval and ranking processes to supplement accurate,\nrelevant toxic knowledge. Extensive experiments and in-depth case studies\nacross multiple datasets demonstrate that our MetaTox significantly decreases\nthe false positive rate while boosting overall toxicity detection performance.\nOur code will be available soon.", "paper_summary_zh": "社群媒體平台快速成長，引發了對於網路內容毒性的重大疑慮。當大型語言模型 (LLM) 用於毒性偵測時，出現了兩個關鍵挑戰：1) 缺乏領域特定的毒性知識，導致假陰性；2) LLM 對毒性言論的過度敏感性，導致假陽性，限制了言論自由。為了解決這些問題，我們提出了一種名為 MetaTox 的新方法，利用元毒性知識圖譜上的圖形搜尋來增強仇恨和毒性偵測。首先，我們利用 LLM 透過三步驟管道萃取毒性資訊，建構一個全面的元毒性知識圖譜，以毒性基準資料集作為語料庫。其次，我們透過檢索和排名程序查詢圖形，以補充準確、相關的毒性知識。跨多個資料集進行的廣泛實驗和深入案例研究證明，我們的 MetaTox 大幅降低了假陽性率，同時提升了整體毒性偵測效能。我們的程式碼將很快提供。", "author": "Yibo Zhao et.al.", "authors": "Yibo Zhao, Jiapeng Zhu, Can Xu, Xiang Li", "id": "2412.15268v1", "paper_url": "http://arxiv.org/abs/2412.15268v1", "repo": "null"}}