{"2408.07543": {"publish_time": "2024-08-14", "title": "MathScape: Evaluating MLLMs in multimodal Math Scenarios through a Hierarchical Benchmark", "paper_summary": "With the development of Multimodal Large Language Models (MLLMs), the\nevaluation of multimodal models in the context of mathematical problems has\nbecome a valuable research field. Multimodal visual-textual mathematical\nreasoning serves as a critical indicator for evaluating the comprehension and\ncomplex multi-step quantitative reasoning abilities of MLLMs. However, previous\nmultimodal math benchmarks have not sufficiently integrated visual and textual\ninformation. To address this gap, we proposed MathScape, a new benchmark that\nemphasizes the understanding and application of combined visual and textual\ninformation. MathScape is designed to evaluate photo-based math problem\nscenarios, assessing the theoretical understanding and application ability of\nMLLMs through a categorical hierarchical approach. We conduct a\nmulti-dimensional evaluation on 11 advanced MLLMs, revealing that our benchmark\nis challenging even for the most sophisticated models. By analyzing the\nevaluation results, we identify the limitations of MLLMs, offering valuable\ninsights for enhancing model performance.", "paper_summary_zh": "隨著多模態大型語言模型 (MLLM) 的發展，在數學問題背景下對多模態模型的評估已成為一個有價值的研究領域。多模態視覺文本數學推理作為評估 MLLM 的理解力和複雜的多步驟量化推理能力的重要指標。然而，先前的多模態數學基準並未充分整合視覺和文本資訊。為了解決這個差距，我們提出了 MathScape，一個新的基準，強調理解和應用視覺和文本資訊的結合。MathScape 被設計用來評估基於照片的數學問題場景，透過一個分類的階層式方法評估 MLLM 的理論理解和應用能力。我們對 11 個先進的 MLLM 進行多維評估，揭示我們的基準即使對於最精密的模型來說也是具有挑戰性的。透過分析評估結果，我們找出 MLLM 的限制，為提升模型效能提供有價值的見解。", "author": "Minxuan Zhou et.al.", "authors": "Minxuan Zhou, Hao Liang, Tianpeng Li, Zhiyu Wu, Mingan Lin, Linzhuang Sun, Yaqi Zhou, Yan Zhang, Xiaoqin Huang, Yicong Chen, Yujing Qiao, Weipeng Chen, Bin Cui, Wentao Zhang, Zenan Zhou", "id": "2408.07543v2", "paper_url": "http://arxiv.org/abs/2408.07543v2", "repo": "null"}}