{"2410.12034": {"publish_time": "2024-10-15", "title": "A Survey on Deep Tabular Learning", "paper_summary": "Tabular data, widely used in industries like healthcare, finance, and\ntransportation, presents unique challenges for deep learning due to its\nheterogeneous nature and lack of spatial structure. This survey reviews the\nevolution of deep learning models for tabular data, from early fully connected\nnetworks (FCNs) to advanced architectures like TabNet, SAINT, TabTranSELU, and\nMambaNet. These models incorporate attention mechanisms, feature embeddings,\nand hybrid architectures to address tabular data complexities. TabNet uses\nsequential attention for instance-wise feature selection, improving\ninterpretability, while SAINT combines self-attention and intersample attention\nto capture complex interactions across features and data points, both advancing\nscalability and reducing computational overhead. Hybrid architectures such as\nTabTransformer and FT-Transformer integrate attention mechanisms with\nmulti-layer perceptrons (MLPs) to handle categorical and numerical data, with\nFT-Transformer adapting transformers for tabular datasets. Research continues\nto balance performance and efficiency for large datasets. Graph-based models\nlike GNN4TDL and GANDALF combine neural networks with decision trees or graph\nstructures, enhancing feature representation and mitigating overfitting in\nsmall datasets through advanced regularization techniques. Diffusion-based\nmodels like the Tabular Denoising Diffusion Probabilistic Model (TabDDPM)\ngenerate synthetic data to address data scarcity, improving model robustness.\nSimilarly, models like TabPFN and Ptab leverage pre-trained language models,\nincorporating transfer learning and self-supervised techniques into tabular\ntasks. This survey highlights key advancements and outlines future research\ndirections on scalability, generalization, and interpretability in diverse\ntabular data applications.", "paper_summary_zh": "<paragraph>表格資料廣泛應用於醫療保健、金融和運輸等產業，由於其異質性且缺乏空間結構，因此對深度學習提出了獨特的挑戰。這項調查回顧了表格資料深度學習模型的演進，從早期的全連接網路 (FCN) 到 TabNet、SAINT、TabTranSELU 和 MambaNet 等先進架構。這些模型結合了注意力機制、特徵嵌入和混合架構，以解決表格資料的複雜性。TabNet 使用序列注意力進行逐例特徵選取，提升可解釋性，而 SAINT 結合了自我注意力和跨樣本注意力，以捕捉特徵和資料點之間的複雜互動，同時提升可擴充性並減少運算負擔。TabTransformer 和 FT-Transformer 等混合架構將注意力機制與多層感知器 (MLP) 整合，以處理類別資料和數值資料，其中 FT-Transformer 將 transformer 適應到表格資料集。研究持續在大型資料集的效能和效率之間取得平衡。基於圖形的模型，例如 GNN4TDL 和 GANDALF，將神經網路與決策樹或圖形結構結合，透過先進的正則化技術增強特徵表示並減輕小資料集中的過度擬合。基於擴散的模型，例如表格去噪擴散機率模型 (TabDDPM)，會產生合成資料以解決資料稀少的問題，進而提升模型的穩健性。類似地，TabPFN 和 Ptab 等模型利用預先訓練的語言模型，將遷移學習和自我監督技術融入表格任務中。這項調查重點說明了關鍵進展，並概述了在各種表格資料應用中可擴充性、概括性和可解釋性的未來研究方向。</paragraph>", "author": "Shriyank Somvanshi et.al.", "authors": "Shriyank Somvanshi, Subasish Das, Syed Aaqib Javed, Gian Antariksa, Ahmed Hossain", "id": "2410.12034v1", "paper_url": "http://arxiv.org/abs/2410.12034v1", "repo": "null"}}