{"2406.04244": {"publish_time": "2024-06-06", "title": "Benchmark Data Contamination of Large Language Models: A Survey", "paper_summary": "The rapid development of Large Language Models (LLMs) like GPT-4, Claude-3,\nand Gemini has transformed the field of natural language processing. However,\nit has also resulted in a significant issue known as Benchmark Data\nContamination (BDC). This occurs when language models inadvertently incorporate\nevaluation benchmark information from their training data, leading to\ninaccurate or unreliable performance during the evaluation phase of the\nprocess. This paper reviews the complex challenge of BDC in LLM evaluation and\nexplores alternative assessment methods to mitigate the risks associated with\ntraditional benchmarks. The paper also examines challenges and future\ndirections in mitigating BDC risks, highlighting the complexity of the issue\nand the need for innovative solutions to ensure the reliability of LLM\nevaluation in real-world applications.", "paper_summary_zh": "大型語言模型（LLM）如 GPT-4、Claude-3 和 Gemini 的快速發展已經轉變了自然語言處理的領域。然而，它也導致了一個稱為基準資料污染（BDC）的重大問題。這發生在語言模型無意中將評估基準資訊納入其訓練資料時，導致在處理的評估階段中產生不準確或不可靠的效能。本文探討了 LLM 評估中 BDC 的複雜挑戰，並探討了替代評估方法以降低與傳統基準相關的風險。本文也探討了減輕 BDC 風險的挑戰和未來方向，強調了此問題的複雜性，以及需要創新的解決方案來確保 LLM 評估在實際應用中的可靠性。", "author": "Cheng Xu et.al.", "authors": "Cheng Xu, Shuhao Guan, Derek Greene, M-Tahar Kechadi", "id": "2406.04244v1", "paper_url": "http://arxiv.org/abs/2406.04244v1", "repo": "null"}}