{"2412.20787": {"publish_time": "2024-12-30", "title": "SecBench: A Comprehensive Multi-Dimensional Benchmarking Dataset for LLMs in Cybersecurity", "paper_summary": "Evaluating Large Language Models (LLMs) is crucial for understanding their\ncapabilities and limitations across various applications, including natural\nlanguage processing and code generation. Existing benchmarks like MMLU, C-Eval,\nand HumanEval assess general LLM performance but lack focus on specific expert\ndomains such as cybersecurity. Previous attempts to create cybersecurity\ndatasets have faced limitations, including insufficient data volume and a\nreliance on multiple-choice questions (MCQs). To address these gaps, we propose\nSecBench, a multi-dimensional benchmarking dataset designed to evaluate LLMs in\nthe cybersecurity domain. SecBench includes questions in various formats (MCQs\nand short-answer questions (SAQs)), at different capability levels (Knowledge\nRetention and Logical Reasoning), in multiple languages (Chinese and English),\nand across various sub-domains. The dataset was constructed by collecting\nhigh-quality data from open sources and organizing a Cybersecurity Question\nDesign Contest, resulting in 44,823 MCQs and 3,087 SAQs. Particularly, we used\nthe powerful while cost-effective LLMs to (1). label the data and (2).\nconstructing a grading agent for automatic evaluation of SAQs.Benchmarking\nresults on 13 SOTA LLMs demonstrate the usability of SecBench, which is\narguably the largest and most comprehensive benchmark dataset for LLMs in\ncybersecurity. More information about SecBench can be found at our website, and\nthe dataset can be accessed via the artifact link.", "paper_summary_zh": "評估大型語言模型 (LLM) 對於了解其在各種應用中的能力和限制至關重要，包括自然語言處理和程式碼生成。現有的基準測試，例如 MMLU、C-Eval 和 HumanEval，可以評估 LLM 的一般效能，但缺乏對特定專家領域（例如網路安全）的關注。以前建立網路安全資料集的嘗試都面臨限制，包括資料量不足和依賴於多選題 (MCQ)。為了解決這些差距，我們提出 SecBench，這是一個多維度的基準測試資料集，旨在評估網路安全領域的 LLM。SecBench 包含各種格式（MCQ 和簡答題 (SAQ)）的問題，具有不同的能力層級（知識保留和邏輯推理），使用多種語言（中文和英文），並涵蓋各種子領域。該資料集是透過從開放來源收集高品質資料和組織網路安全問題設計競賽而建構的，產生了 44,823 個 MCQ 和 3,087 個 SAQ。特別是，我們使用功能強大且經濟實惠的 LLM 來 (1)。標記資料和 (2)。建構一個評分代理，用於自動評估 SAQ。13 個 SOTA LLM 的基準測試結果證明了 SecBench 的可用性，這可以說是網路安全領域 LLM 中最大且最全面的基準測試資料集。可以在我們的網站上找到有關 SecBench 的更多資訊，並且可以透過人工製品連結存取資料集。", "author": "Pengfei Jing et.al.", "authors": "Pengfei Jing, Mengyun Tang, Xiaorong Shi, Xing Zheng, Sen Nie, Shi Wu, Yong Yang, Xiapu Luo", "id": "2412.20787v1", "paper_url": "http://arxiv.org/abs/2412.20787v1", "repo": "null"}}