{"2410.07112": {"publish_time": "2024-10-09", "title": "VHELM: A Holistic Evaluation of Vision Language Models", "paper_summary": "Current benchmarks for assessing vision-language models (VLMs) often focus on\ntheir perception or problem-solving capabilities and neglect other critical\naspects such as fairness, multilinguality, or toxicity. Furthermore, they\ndiffer in their evaluation procedures and the scope of the evaluation, making\nit difficult to compare models. To address these issues, we extend the HELM\nframework to VLMs to present the Holistic Evaluation of Vision Language Models\n(VHELM). VHELM aggregates various datasets to cover one or more of the 9\naspects: visual perception, knowledge, reasoning, bias, fairness,\nmultilinguality, robustness, toxicity, and safety. In doing so, we produce a\ncomprehensive, multi-dimensional view of the capabilities of the VLMs across\nthese important factors. In addition, we standardize the standard inference\nparameters, methods of prompting, and evaluation metrics to enable fair\ncomparisons across models. Our framework is designed to be lightweight and\nautomatic so that evaluation runs are cheap and fast. Our initial run evaluates\n22 VLMs on 21 existing datasets to provide a holistic snapshot of the models.\nWe uncover new key findings, such as the fact that efficiency-focused models\n(e.g., Claude 3 Haiku or Gemini 1.5 Flash) perform significantly worse than\ntheir full models (e.g., Claude 3 Opus or Gemini 1.5 Pro) on the bias benchmark\nbut not when evaluated on the other aspects. For transparency, we release the\nraw model generations and complete results on our website\n(https://crfm.stanford.edu/helm/vhelm/v2.0.1). VHELM is intended to be a living\nbenchmark, and we hope to continue adding new datasets and models over time.", "paper_summary_zh": "目前用於評估視覺語言模型 (VLM) 的基準，通常著重於它們的感知或問題解決能力，而忽略了公平性、多語言性或毒性等其他重要方面。此外，它們在評估程序和評估範圍上有所不同，這使得比較模型變得困難。為了解決這些問題，我們將 HELM 框架擴展到 VLM，以呈現視覺語言模型的整體評估 (VHELM)。VHELM 彙總各種資料集，涵蓋 9 個方面中的至少一個：視覺感知、知識、推理、偏見、公平性、多語言性、健壯性、毒性和安全性。這樣一來，我們可以全面、多面向地了解 VLM 在這些重要因素方面的能力。此外，我們標準化標準推論參數、提示方法和評估指標，以實現跨模型的公平比較。我們的框架旨在輕量且自動化，以便評估執行便宜且快速。我們的初始執行在 21 個現有資料集上評估 22 個 VLM，以提供模型的整體快照。我們發現了新的關鍵發現，例如，以效率為重點的模型（例如，Claude 3 Haiku 或 Gemini 1.5 Flash）在偏見基準上表現明顯遜於其完整模型（例如，Claude 3 Opus 或 Gemini 1.5 Pro），但在其他方面評估時則不然。為了透明起見，我們在我們的網站（https://crfm.stanford.edu/helm/vhelm/v2.0.1）上發布原始模型生成和完整結果。VHELM 旨在成為一個實時基準，我們希望隨著時間的推移繼續添加新的資料集和模型。", "author": "Tony Lee et.al.", "authors": "Tony Lee, Haoqin Tu, Chi Heem Wong, Wenhao Zheng, Yiyang Zhou, Yifan Mai, Josselin Somerville Roberts, Michihiro Yasunaga, Huaxiu Yao, Cihang Xie, Percy Liang", "id": "2410.07112v1", "paper_url": "http://arxiv.org/abs/2410.07112v1", "repo": "null"}}