{"2410.15929": {"publish_time": "2024-10-21", "title": "Yeah, Un, Oh: Continuous and Real-time Backchannel Prediction with Fine-tuning of Voice Activity Projection", "paper_summary": "In human conversations, short backchannel utterances such as \"yeah\" and \"oh\"\nplay a crucial role in facilitating smooth and engaging dialogue. These\nbackchannels signal attentiveness and understanding without interrupting the\nspeaker, making their accurate prediction essential for creating more natural\nconversational agents. This paper proposes a novel method for real-time,\ncontinuous backchannel prediction using a fine-tuned Voice Activity Projection\n(VAP) model. While existing approaches have relied on turn-based or\nartificially balanced datasets, our approach predicts both the timing and type\nof backchannels in a continuous and frame-wise manner on unbalanced, real-world\ndatasets. We first pre-train the VAP model on a general dialogue corpus to\ncapture conversational dynamics and then fine-tune it on a specialized dataset\nfocused on backchannel behavior. Experimental results demonstrate that our\nmodel outperforms baseline methods in both timing and type prediction tasks,\nachieving robust performance in real-time environments. This research offers a\npromising step toward more responsive and human-like dialogue systems, with\nimplications for interactive spoken dialogue applications such as virtual\nassistants and robots.", "paper_summary_zh": "在人類對話中，諸如「嗯」和「喔」等簡短的回饋語句在促進順暢且引人入勝的對話中扮演著至關重要的角色。這些回饋語句傳達了注意力和理解，卻不中斷說話者，因此準確預測這些語句對於創造更自然的對話代理至關重要。本文提出了一種使用微調語音活動預測 (VAP) 模型進行實時、連續回饋語句預測的新方法。雖然現有方法依賴於回合制或人工平衡的數據集，但我們的做法是以連續且逐幀的方式在不平衡的真實世界數據集上預測回饋語句的時機和類型。我們首先在一般對話語料庫上預訓練 VAP 模型以捕捉對話動態，然後在專注於回饋語句行為的專門數據集上微調它。實驗結果表明，我們的模型在時機和類型預測任務中都優於基線方法，在實時環境中實現了穩健的性能。這項研究為更具回應性和更擬人的對話系統邁出了有希望的一步，對互動式口語對話應用（例如虛擬助理和機器人）具有影響。", "author": "Koji Inoue et.al.", "authors": "Koji Inoue, Divesh Lala, Gabriel Skantze, Tatsuya Kawahara", "id": "2410.15929v1", "paper_url": "http://arxiv.org/abs/2410.15929v1", "repo": "null"}}