{"2406.18625": {"publish_time": "2024-06-26", "title": "Automatic Prediction of Amyotrophic Lateral Sclerosis Progression using Longitudinal Speech Transformer", "paper_summary": "Automatic prediction of amyotrophic lateral sclerosis (ALS) disease\nprogression provides a more efficient and objective alternative than manual\napproaches. We propose ALS longitudinal speech transformer (ALST), a neural\nnetwork-based automatic predictor of ALS disease progression from longitudinal\nspeech recordings of ALS patients. By taking advantage of high-quality\npretrained speech features and longitudinal information in the recordings, our\nbest model achieves 91.0\\% AUC, improving upon the previous best model by 5.6\\%\nrelative on the ALS TDI dataset. Careful analysis reveals that ALST is capable\nof fine-grained and interpretable predictions of ALS progression, especially\nfor distinguishing between rarer and more severe cases. Code is publicly\navailable.", "paper_summary_zh": "肌萎缩性侧索硬化症 (ALS) 疾病进展的自动预测提供了比手动方法更有效且客观的替代方案。我们提出了 ALS 纵向语音转换器 (ALST)，这是一种基于神经网络的 ALS 疾病进展自动预测器，可从 ALS 患者的纵向语音记录中进行预测。通过利用录音中高质量的预训练语音特征和纵向信息，我们的最佳模型实现了 91.0% 的 AUC，相对于 ALS TDI 数据集上的先前最佳模型提高了 5.6%。仔细分析表明，ALST 能够对 ALS 进展进行细粒度且可解释的预测，尤其是在区分罕见病例和严重病例方面。代码已公开。", "author": "Liming Wang et.al.", "authors": "Liming Wang, Yuan Gong, Nauman Dawalatabad, Marco Vilela, Katerina Placek, Brian Tracey, Yishu Gong, Alan Premasiri, Fernando Vieira, James Glass", "id": "2406.18625v1", "paper_url": "http://arxiv.org/abs/2406.18625v1", "repo": "null"}}