{"2409.16954": {"publish_time": "2024-09-25", "title": "Weighted Cross-entropy for Low-Resource Languages in Multilingual Speech Recognition", "paper_summary": "This paper addresses the challenge of integrating low-resource languages into\nmultilingual automatic speech recognition (ASR) systems. We introduce a novel\napplication of weighted cross-entropy, typically used for unbalanced datasets,\nto facilitate the integration of low-resource languages into pre-trained\nmultilingual ASR models within the context of continual multilingual learning.\nWe fine-tune the Whisper multilingual ASR model on five high-resource languages\nand one low-resource language, employing language-weighted dynamic\ncross-entropy and data augmentation. The results show a remarkable 6.69% word\nerror rate (WER) reduction for the low-resource language compared to the\nfine-tuned model without applying our approach, and a 48.86% WER reduction\ncompared to the original Whisper model. In addition, our approach yields an\naverage WER reduction of 3.29% across the six languages, showing no degradation\nfor the high-resource languages.", "paper_summary_zh": "本文探討了將低資源語言整合至多語言自動語音辨識 (ASR) 系統的挑戰。我們引進了加權交叉熵的新應用，通常用於不平衡的資料集，以促進在持續多語言學習的脈絡中，將低資源語言整合至預先訓練的多語言 ASR 模型中。我們微調了 Whisper 多語言 ASR 模型，使用五種高資源語言和一種低資源語言，採用語言加權動態交叉熵和資料擴充。結果顯示，與未套用我們方法的微調模型相比，低資源語言的字元錯誤率 (WER) 降低了 6.69%，與原始 Whisper 模型相比，WER 降低了 48.86%。此外，我們的做法對六種語言的平均 WER 降低了 3.29%，顯示對高資源語言沒有造成影響。", "author": "Andrés Piñeiro-Martín et.al.", "authors": "Andrés Piñeiro-Martín, Carmen García-Mateo, Laura Docío-Fernández, María del Carmen López-Pérez, Georg Rehm", "id": "2409.16954v1", "paper_url": "http://arxiv.org/abs/2409.16954v1", "repo": "null"}}