{"2408.10657": {"publish_time": "2024-08-20", "title": "ETGuard: Malicious Encrypted Traffic Detection in Blockchain-based Power Grid Systems", "paper_summary": "The escalating prevalence of encryption protocols has led to a concomitant\nsurge in the number of malicious attacks that hide in encrypted traffic. Power\ngrid systems, as fundamental infrastructure, are becoming prime targets for\nsuch attacks. Conventional methods for detecting malicious encrypted packets\ntypically use a static pre-trained model. We observe that these methods are not\nwell-suited for blockchain-based power grid systems. More critically, they fall\nshort in dynamic environments where new types of encrypted attacks continuously\nemerge. Motivated by this, in this paper we try to tackle these challenges from\ntwo aspects: (1) We present a novel framework that is able to automatically\ndetect malicious encrypted traffic in blockchain-based power grid systems and\nincrementally learn from new malicious traffic. (2) We mathematically derive\nincremental learning losses to resist the forgetting of old attack patterns\nwhile ensuring the model is capable of handling new encrypted attack patterns.\nEmpirically, our method achieves state-of-the-art performance on three\ndifferent benchmark datasets. We also constructed the first malicious encrypted\ntraffic dataset for blockchain-based power grid scenario. Our code and dataset\nare available at https://github.com/PPPmzt/ETGuard, hoping to inspire future\nresearch.", "paper_summary_zh": "隨著加密協定的盛行，隱藏在加密流量中的惡意攻擊數量也隨之激增。作為基礎建設的電力系統正成為此類攻擊的首要目標。傳統的惡意加密封包偵測方法通常使用靜態預訓練模型。我們觀察到這些方法並不適合於基於區塊鏈的電力系統。更重要的是，它們在不斷出現新型加密攻擊的動態環境中表現不佳。有鑑於此，我們在本文中試圖從兩個方面來解決這些挑戰：(1) 我們提出了一個新穎的框架，能夠自動偵測基於區塊鏈的電力系統中的惡意加密流量，並從新的惡意流量中逐步學習。(2) 我們透過數學推導增量學習損失，以抵抗遺忘舊的攻擊模式，同時確保模型能夠處理新的加密攻擊模式。根據經驗，我們的模型在三個不同的基準資料集上達到了最先進的效能。我們還建構了第一個針對基於區塊鏈的電力系統場景的惡意加密流量資料集。我們的程式碼和資料集可在 https://github.com/PPPmzt/ETGuard 取得，希望能激勵未來的研究。", "author": "Peng Zhou et.al.", "authors": "Peng Zhou, Yongdong Liu, Lixun Ma, Weiye Zhang, Haohan Tan, Zhenguang Liu, Butian Huang", "id": "2408.10657v1", "paper_url": "http://arxiv.org/abs/2408.10657v1", "repo": "https://github.com/pppmzt/etguard"}}