{"2409.09570": {"publish_time": "2024-09-15", "title": "MindScape Study: Integrating LLM and Behavioral Sensing for Personalized AI-Driven Journaling Experiences", "paper_summary": "Mental health concerns are prevalent among college students, highlighting the\nneed for effective interventions that promote self-awareness and holistic\nwell-being. MindScape pioneers a novel approach to AI-powered journaling by\nintegrating passively collected behavioral patterns such as conversational\nengagement, sleep, and location with Large Language Models (LLMs). This\nintegration creates a highly personalized and context-aware journaling\nexperience, enhancing self-awareness and well-being by embedding behavioral\nintelligence into AI. We present an 8-week exploratory study with 20 college\nstudents, demonstrating the MindScape app's efficacy in enhancing positive\naffect (7%), reducing negative affect (11%), loneliness (6%), and anxiety and\ndepression, with a significant week-over-week decrease in PHQ-4 scores (-0.25\ncoefficient), alongside improvements in mindfulness (7%) and self-reflection\n(6%). The study highlights the advantages of contextual AI journaling, with\nparticipants particularly appreciating the tailored prompts and insights\nprovided by the MindScape app. Our analysis also includes a comparison of\nresponses to AI-driven contextual versus generic prompts, participant feedback\ninsights, and proposed strategies for leveraging contextual AI journaling to\nimprove well-being on college campuses. By showcasing the potential of\ncontextual AI journaling to support mental health, we provide a foundation for\nfurther investigation into the effects of contextual AI journaling on mental\nhealth and well-being.", "paper_summary_zh": "大學生普遍有心理健康問題，強調需要有效干預措施來促進自我覺察和整體福祉。MindScape 開創了 AI 驅動日誌的新方法，方法是將被動收集的行為模式（例如對話參與、睡眠和位置）與大型語言模型 (LLM) 整合在一起。這種整合創造了高度個人化且具備情境感知能力的日誌體驗，透過將行為智慧嵌入 AI 來增強自我覺察和福祉。我們提出了一項為期 8 週的探索性研究，有 20 名大學生參與，證明 MindScape 應用程式在增強正面影響 (7%)、減少負面影響 (11%)、孤獨感 (6%) 以及焦慮和憂鬱方面有效，PHQ-4 分數週週顯著下降 (-0.25 係數)，同時正念 (7%) 和自我反省 (6%) 也有所改善。這項研究強調了情境 AI 日誌的優點，參與者特別欣賞 MindScape 應用程式提供的客製化提示和見解。我們的分析還包括比較對 AI 驅動情境提示和一般提示的回應、參與者回饋見解，以及提出利用情境 AI 日誌來改善大學校園福祉的策略。透過展示情境 AI 日誌在支援心理健康的潛力，我們為進一步探討情境 AI 日誌對心理健康和福祉的影響奠定了基礎。", "author": "Subigya Nepal et.al.", "authors": "Subigya Nepal, Arvind Pillai, William Campbell, Talie Massachi, Michael V. Heinz, Ashmita Kunwar, Eunsol Soul Choi, Orson Xu, Joanna Kuc, Jeremy Huckins, Jason Holden, Sarah M. Preum, Colin Depp, Nicholas Jacobson, Mary Czerwinski, Eric Granholm, Andrew T. Campbell", "id": "2409.09570v1", "paper_url": "http://arxiv.org/abs/2409.09570v1", "repo": "null"}}