{"2406.07228": {"publish_time": "2024-06-11", "title": "Haptic Repurposing with GenAI", "paper_summary": "Mixed Reality aims to merge the digital and physical worlds to create\nimmersive human-computer interactions. Despite notable advancements, the\nabsence of realistic haptic feedback often breaks the immersive experience by\ncreating a disconnect between visual and tactile perceptions. This paper\nintroduces Haptic Repurposing with GenAI, an innovative approach to enhance MR\ninteractions by transforming any physical objects into adaptive haptic\ninterfaces for AI-generated virtual assets. Utilizing state-of-the-art\ngenerative AI models, this system captures both 2D and 3D features of physical\nobjects and, through user-directed prompts, generates corresponding virtual\nobjects that maintain the physical form of the original objects. Through\nmodel-based object tracking, the system dynamically anchors virtual assets to\nphysical props in real time, allowing objects to visually morph into any\nuser-specified virtual object. This paper details the system's development,\npresents findings from usability studies that validate its effectiveness, and\nexplores its potential to significantly enhance interactive MR environments.\nThe hope is this work can lay a foundation for further research into AI-driven\nspatial transformation in immersive and haptic technologies.", "paper_summary_zh": "混合現實旨在合併數位和實體世界，以創造身歷其境的使用者電腦互動。儘管有顯著的進展，但缺乏逼真的觸覺回饋往往會破壞身歷其境體驗，造成視覺和觸覺感知之間的脫節。本文介紹了具備 GenAI 的觸覺再利用，這是一種創新的方法，可透過將任何實體物件轉換成適應性觸覺介面，以增強 MR 互動，適用於 AI 生成的虛擬資產。利用最先進的生成式 AI 模型，此系統擷取實體物件的 2D 和 3D 特色，並透過使用者導向提示，產生對應的虛擬物件，以維持原始物件的實體形式。透過基於模型的物件追蹤，系統會動態地將虛擬資產錨定到實體道具中，讓物件能視覺化地轉變為任何使用者指定的虛擬物件。本文詳述了系統的開發，展示了可用性研究的結果，驗證了其有效性，並探討了其大幅增強互動式 MR 環境的潛力。希望這項工作能為進一步研究身歷其境和觸覺技術中的人工智慧驅動空間轉換奠定基礎。", "author": "Haoyu Wang et.al.", "authors": "Haoyu Wang", "id": "2406.07228v1", "paper_url": "http://arxiv.org/abs/2406.07228v1", "repo": "null"}}