{"2406.00532": {"publish_time": "2024-06-01", "title": "Breast Cancer Diagnosis: A Comprehensive Exploration of Explainable Artificial Intelligence (XAI) Techniques", "paper_summary": "Breast cancer (BC) stands as one of the most common malignancies affecting\nwomen worldwide, necessitating advancements in diagnostic methodologies for\nbetter clinical outcomes. This article provides a comprehensive exploration of\nthe application of Explainable Artificial Intelligence (XAI) techniques in the\ndetection and diagnosis of breast cancer. As Artificial Intelligence (AI)\ntechnologies continue to permeate the healthcare sector, particularly in\noncology, the need for transparent and interpretable models becomes imperative\nto enhance clinical decision-making and patient care. This review discusses the\nintegration of various XAI approaches, such as SHAP, LIME, Grad-CAM, and\nothers, with machine learning and deep learning models utilized in breast\ncancer detection and classification. By investigating the modalities of breast\ncancer datasets, including mammograms, ultrasounds and their processing with\nAI, the paper highlights how XAI can lead to more accurate diagnoses and\npersonalized treatment plans. It also examines the challenges in implementing\nthese techniques and the importance of developing standardized metrics for\nevaluating XAI's effectiveness in clinical settings. Through detailed analysis\nand discussion, this article aims to highlight the potential of XAI in bridging\nthe gap between complex AI models and practical healthcare applications,\nthereby fostering trust and understanding among medical professionals and\nimproving patient outcomes.", "paper_summary_zh": "乳癌 (BC) 是影響全球女性最常見的惡性腫瘤之一，因此需要進步的診斷方法，以改善臨床結果。本文全面探討了可解釋人工智慧 (XAI) 技術在乳癌偵測和診斷中的應用。隨著人工智慧 (AI) 技術持續滲透醫療保健領域，特別是在腫瘤學中，透明且可解釋的模型需求變得勢在必行，以增強臨床決策制定和患者照護。此篇評論探討了各種 XAI 方法的整合，例如 SHAP、LIME、Grad-CAM 等，以及用於乳癌偵測和分類的機器學習和深度學習模型。透過探討乳癌資料集的模式，包括乳房攝影、超音波及其在 AI 中的處理，本文重點說明 XAI 如何能導致更準確的診斷和個人化治療計畫。它也探討了實施這些技術的挑戰，以及制定標準化評量指標以評估 XAI 在臨床環境中的有效性的重要性。透過詳細的分析和討論，本文旨在強調 XAI 在縮小複雜 AI 模型與實務醫療保健應用之間差距的潛力，進而促進醫療專業人員之間的信任與理解，並改善患者的結果。", "author": "Samita Bai et.al.", "authors": "Samita Bai, Sidra Nasir, Rizwan Ahmed Khan, Sheeraz Arif, Alexandre Meyer, Hubert Konik", "id": "2406.00532v1", "paper_url": "http://arxiv.org/abs/2406.00532v1", "repo": "null"}}