{"2502.10089": {"publish_time": "2025-02-14", "title": "A Hybrid Edge Classifier: Combining TinyML-Optimised CNN with RRAM-CMOS ACAM for Energy-Efficient Inference", "paper_summary": "In recent years, the development of smart edge computing systems to process\ninformation locally is on the rise. Many near-sensor machine learning (ML)\napproaches have been implemented to introduce accurate and energy efficient\ntemplate matching operations in resource-constrained edge sensing systems, such\nas wearables. To introduce novel solutions that can be viable for extreme edge\ncases, hybrid solutions combining conventional and emerging technologies have\nstarted to be proposed. Deep Neural Networks (DNN) optimised for edge\napplication alongside new approaches of computing (both device and architecture\n-wise) could be a strong candidate in implementing edge ML solutions that aim\nat competitive accuracy classification while using a fraction of the power of\nconventional ML solutions. In this work, we are proposing a hybrid\nsoftware-hardware edge classifier aimed at the extreme edge near-sensor\nsystems. The classifier consists of two parts: (i) an optimised digital tinyML\nnetwork, working as a front-end feature extractor, and (ii) a back-end\nRRAM-CMOS analogue content addressable memory (ACAM), working as a final stage\ntemplate matching system. The combined hybrid system exhibits a competitive\ntrade-off in accuracy versus energy metric with $E_{front-end}$ = $96.23 nJ$\nand $E_{back-end}$ = $1.45 nJ$ for each classification operation compared with\n78.06$\\mu$J for the original teacher model, representing a 792-fold reduction,\nmaking it a viable solution for extreme edge applications.", "paper_summary_zh": "<paragraph>近年來，發展智慧邊緣運算系統以在本地處理資訊的技術正蓬勃發展。許多近感測器機器學習 (ML) 方法已被實作，以在受資源限制的邊緣感測系統中導入精準且節能的範本比對運算，例如穿戴式裝置。為了導入可行於極端邊緣案例的新穎解決方案，已開始提出結合傳統與新興技術的混合解決方案。針對邊緣應用最佳化的深度神經網路 (DNN) 連同新的運算方法（裝置和架構方面），可能是實作邊緣 ML 解決方案的有力候選，目標是在使用傳統 ML 解決方案一小部分功率的同時，實作具競爭力精準度的分類。在這項工作中，我們提出一個混合軟體硬體邊緣分類器，目標在於極端邊緣近感測器系統。此分類器包含兩部分：(i) 一個最佳化的數位 tinyML 網路，作為前端特徵萃取器，以及 (ii) 一個後端 RRAM-CMOS 類比內容可尋址記憶體 (ACAM)，作為最終階段的範本比對系統。結合的混合系統展現出精準度與能耗指標的競爭性權衡，每個分類運算的 $E_{front-end}$ = $96.23 nJ$ 和 $E_{back-end}$ = $1.45 nJ$，相比於原始教師模型的 78.06$\\mu$J，減少了 792 倍，使其成為極端邊緣應用可行的解決方案。</paragraph>", "author": "Kieran Woodward et.al.", "authors": "Kieran Woodward, Eiman Kanjo, Georgios Papandroulidakis, Shady Agwa, Themis Prodromakis", "id": "2502.10089v1", "paper_url": "http://arxiv.org/abs/2502.10089v1", "repo": "null"}}