{"2502.06728": {"publish_time": "2025-02-10", "title": "FlexDeMo: Decoupled Momentum Optimization for Fully and Hybrid Sharded Training", "paper_summary": "Training large neural network models requires extensive computational\nresources, often distributed across several nodes and accelerators. Recent\nfindings suggest that it may be sufficient to only exchange the fast moving\ncomponents of the gradients, while accumulating momentum locally (Decoupled\nMomentum, or DeMo). However, when considering larger models that do not fit on\na single accelerate, the exchange of gradient information and the integration\nof DeMo needs to be reconsidered. Here, we propose employing a hybrid strategy,\nFlexDeMo, whereby nodes fully synchronize locally between different GPUs and\ninter-node communication is improved through only using the fast-moving\ncomponents. This effectively combines previous hybrid sharding strategies with\nthe advantages of decoupled momentum. Our experimental results show that\nFlexDeMo is on par with AdamW in terms of validation loss, demonstrating its\nviability.", "paper_summary_zh": "訓練大型神經網路模型需要廣泛的計算資源，通常分佈在多個節點和加速器上。最近的研究結果表明，僅交換梯度的快速移動組成部分就可能足夠，同時在本地累積動能（解耦動能，或 DeMo）。然而，在考慮不適合單一加速器的較大型模型時，需要重新考慮梯度資訊的交換和 DeMo 的整合。在此，我們建議採用混合策略 FlexDeMo，藉此節點在不同 GPU 之間完全同步，並且僅透過使用快速移動組成部分來改善節點間通訊。這有效地將先前的混合分片策略與解耦動能的優點相結合。我們的實驗結果顯示，FlexDeMo 在驗證損失方面與 AdamW 相當，證明了它的可行性。", "author": "Mogens Henrik From et.al.", "authors": "Mogens Henrik From, Jacob Nielsen, Lukas Galke, Peter Schneider-Kamp", "id": "2502.06728v1", "paper_url": "http://arxiv.org/abs/2502.06728v1", "repo": "null"}}