{"2408.13940": {"publish_time": "2024-08-25", "title": "CoT Rerailer: Enhancing the Reliability of Large Language Models in Complex Reasoning Tasks through Error Detection and Correction", "paper_summary": "Chain-of-Thought (CoT) prompting enhances Large Language Models (LLMs)\ncomplex reasoning abilities by generating intermediate steps. However, these\nsteps can introduce hallucinations and accumulate errors. We propose the CoT\nRerailer to address these challenges, employing self-consistency and\nmulti-agent debate systems to identify and rectify errors in the reasoning\nprocess. The CoT Rerailer first selects the most logically correct Reasoning\nPath (RP) using consistency checks and critical evaluation by automated agents.\nIt then engages a multi-agent debate system to propose and validate corrections\nto ensure the generation of an error-free intermediate logical path. The\ncorrected steps are then used to generate a revised reasoning chain to further\nreduce hallucinations and enhance answer quality. We demonstrate the\neffectiveness of our approach across diverse question-answering datasets in\nvarious knowledge domains. The CoT Rerailer enhances the reliability of\nLLM-generated reasoning, contributing to more trustworthy AI driven\ndecision-making processes.", "paper_summary_zh": "連續思考 (CoT) 提示增強了大型語言模型 (LLM) 的複雜推理能力，藉由產生中間步驟來達成。然而，這些步驟可能會引入幻覺並累積錯誤。我們提出 CoT Rerailer 來解決這些挑戰，採用自我一致性和多重代理辯論系統來識別並修正推理過程中的錯誤。CoT Rerailer 首先使用一致性檢查和自動代理的批判性評估來選擇最合乎邏輯的推理路徑 (RP)。然後，它會參與多重代理辯論系統來提出並驗證修正，以確保產生無錯誤的中間邏輯路徑。然後使用修正的步驟來產生修改後的推理鏈，以進一步減少幻覺並增強答案品質。我們在各種知識領域中的不同問答資料集上展示了我們方法的有效性。CoT Rerailer 增強了 LLM 生成的推理的可信度，有助於更值得信賴的 AI 驅動決策制定過程。", "author": "Guangya Wan et.al.", "authors": "Guangya Wan, Yuqi Wu, Jie Chen, Sheng Li", "id": "2408.13940v1", "paper_url": "http://arxiv.org/abs/2408.13940v1", "repo": "null"}}