{"2410.19646": {"publish_time": "2024-10-25", "title": "Deep learning-based identification of patients at increased risk of cancer using routine laboratory markers", "paper_summary": "Early screening for cancer has proven to improve the survival rate and spare\npatients from intensive and costly treatments due to late diagnosis. Cancer\nscreening in the healthy population involves an initial risk stratification\nstep to determine the screening method and frequency, primarily to optimize\nresource allocation by targeting screening towards individuals who draw most\nbenefit. For most screening programs, age and clinical risk factors such as\nfamily history are part of the initial risk stratification algorithm. In this\npaper, we focus on developing a blood marker-based risk stratification\napproach, which could be used to identify patients with elevated cancer risk to\nbe encouraged for taking a diagnostic test or participate in a screening\nprogram. We demonstrate that the combination of simple, widely available blood\ntests, such as complete blood count and complete metabolic panel, could\npotentially be used to identify patients at risk for colorectal, liver, and\nlung cancers with areas under the ROC curve of 0.76, 0.85, 0.78, respectively.\nFurthermore, we hypothesize that such an approach could not only be used as\npre-screening risk assessment for individuals but also as population health\nmanagement tool, for example to better interrogate the cancer risk in certain\nsub-populations.", "paper_summary_zh": "癌症的早期篩檢已被證實可以提高存活率，並讓患者免於因診斷過晚而接受密集且昂貴的治療。健康人群的癌症篩檢包括一個初始風險分層步驟，以確定篩檢方法和頻率，主要是透過針對最能受益的個人進行篩檢來最佳化資源分配。對於大多數篩檢計畫，年齡和臨床風險因子（例如家族史）是初始風險分層演算法的一部分。在本文中，我們專注於開發一種基於血液標記的風險分層方法，可用於識別癌症風險升高的患者，以鼓勵他們進行診斷測試或參與篩檢計畫。我們證明了簡單、廣泛使用的血液檢測（例如全血球計數和完整代謝 panel）的組合，有可能用於識別罹患大腸癌、肝癌和肺癌風險的患者，其 ROC 曲線下的面積分別為 0.76、0.85、0.78。此外，我們假設這種方法不僅可用於個人的篩檢前風險評估，還可用於人口健康管理工具，例如更深入地詢問某些亞群中的癌症風險。", "author": "Vivek Singh et.al.", "authors": "Vivek Singh, Shikha Chaganti, Matthias Siebert, Soumya Rajesh, Andrei Puiu, Raj Gopalan, Jamie Gramz, Dorin Comaniciu, Ali Kamen", "id": "2410.19646v1", "paper_url": "http://arxiv.org/abs/2410.19646v1", "repo": "null"}}