{"2501.08537": {"publish_time": "2025-01-15", "title": "Complexity Control Facilitates Reasoning-Based Compositional Generalization in Transformers", "paper_summary": "Transformers have demonstrated impressive capabilities across various tasks,\nyet their performance on compositional problems remains a subject of debate. In\nthis study, we investigate the internal mechanisms underlying Transformers'\nbehavior in compositional tasks. We find that complexity control strategies\nsignificantly influence whether the model learns primitive-level rules that\ngeneralize out-of-distribution (reasoning-based solutions) or relies solely on\nmemorized mappings (memory-based solutions). By applying masking strategies to\nthe model's information circuits and employing multiple complexity metrics, we\nreveal distinct internal working mechanisms associated with different solution\ntypes. Further analysis reveals that reasoning-based solutions exhibit a lower\ncomplexity bias, which aligns with the well-studied neuron condensation\nphenomenon. This lower complexity bias is hypothesized to be the key factor\nenabling these solutions to learn reasoning rules. We validate these\nconclusions across multiple real-world datasets, including image generation and\nnatural language processing tasks, confirming the broad applicability of our\nfindings.", "paper_summary_zh": "變形金剛在各種任務中展現出令人印象深刻的能力，\n但它們在組合問題上的表現仍有爭議。在\n本研究中，我們探討了變形金剛在組合任務中的行為背後的基本機制。我們發現複雜性控制策略\n顯著影響模型是否學習原始級別的規則，這些規則概括了分布外（基於推理的解決方案）或僅依賴\n記憶映射（基於記憶的解決方案）。通過對\n模型的信息電路應用屏蔽策略並採用多個複雜性指標，我們\n揭示了與不同解決方案類型相關的不同內部工作機制。進一步的分析表明，基於推理的解決方案表現出較低的\n複雜性偏差，這與研究充分的神經元凝聚現象一致。假設這種較低的複雜性偏差是\n使這些解決方案能夠學習推理規則的關鍵因素。我們驗證了這些\n結論跨多個真實世界數據集，包括圖像生成和自然語言處理任務，確認了我們\n發現的廣泛適用性。", "author": "Zhongwang Zhang et.al.", "authors": "Zhongwang Zhang, Pengxiao Lin, Zhiwei Wang, Yaoyu Zhang, Zhi-Qin John Xu", "id": "2501.08537v1", "paper_url": "http://arxiv.org/abs/2501.08537v1", "repo": "https://github.com/sjtuzzw/complexity_control"}}