{"2411.19951": {"publish_time": "2024-11-29", "title": "T2Vid: Translating Long Text into Multi-Image is the Catalyst for Video-LLMs", "paper_summary": "The success of Multimodal Large Language Models (MLLMs) in the image domain\nhas garnered wide attention from the research community. Drawing on previous\nsuccessful experiences, researchers have recently explored extending the\nsuccess to the video understanding realms. Apart from training from scratch, an\nefficient way is to utilize the pre-trained image-LLMs, leading to two\nmainstream approaches, i.e. zero-shot inference and further fine-tuning with\nvideo data. In this work, our study of these approaches harvests an effective\ndata augmentation method. We first make a deeper inspection of the zero-shot\ninference way and identify two limitations, i.e. limited generalization and\nlack of temporal understanding capabilities. Thus, we further investigate the\nfine-tuning approach and find a low learning efficiency when simply using all\nthe video data samples, which can be attributed to a lack of instruction\ndiversity. Aiming at this issue, we develop a method called T2Vid to synthesize\nvideo-like samples to enrich the instruction diversity in the training corpus.\nIntegrating these data enables a simple and efficient training scheme, which\nachieves performance comparable to or even superior to using full video\ndatasets by training with just 15% the sample size. Meanwhile, we find that the\nproposed scheme can boost the performance of long video understanding without\ntraining with long video samples. We hope our study will spark more thinking\nabout using MLLMs for video understanding and curation of high-quality data.\nThe code is released at https://github.com/xjtupanda/T2Vid.", "paper_summary_zh": "多模态大型语言模型 (MLLM) 在图像领域的成功\n引起了研究界的广泛关注。借鉴以往的\n成功经验，研究人员最近探索将\n成功扩展到视频理解领域。除了从头开始训练，一种\n有效的方法是利用预先训练的图像 LLM，从而形成两种\n主流方法，即零样本推理和使用\n视频数据进行进一步微调。在这项工作中，我们对这些方法的研究收获了一种有效的\n数据增强方法。我们首先对零样本\n推理方式进行更深入的检查，并找出两个限制，即有限的泛化能力和\n缺乏时间理解能力。因此，我们进一步研究了\n微调方法，并发现仅使用所有\n视频数据样本时的学习效率低下，这可能归因于指令\n多样性的缺乏。针对此问题，我们开发了一种名为 T2Vid 的方法来合成\n类似视频的样本，以丰富训练语料库中的指令多样性。\n集成这些数据可实现简单高效的训练方案，其\n通过仅使用 15% 的样本大小进行训练，即可实现与使用完整视频\n数据集相当甚至更好的性能。同时，我们发现所提出的方案可以提升长视频理解的性能，而无需\n使用长视频样本进行训练。我们希望我们的研究将激发更多关于使用 MLLM 进行视频理解和高质量数据管理的思考。\n代码已在 https://github.com/xjtupanda/T2Vid 中发布。", "author": "Shukang Yin et.al.", "authors": "Shukang Yin, Chaoyou Fu, Sirui Zhao, Yunhang Shen, Chunjiang Ge, Yan Yang, Zuwei Long, Yuhan Dai, Tong Xu, Xing Sun, Ran He, Caifeng Shan, Enhong Chen", "id": "2411.19951v2", "paper_url": "http://arxiv.org/abs/2411.19951v2", "repo": "https://github.com/xjtupanda/t2vid"}}