{"2409.16882": {"publish_time": "2024-09-25", "title": "Revisiting Space Mission Planning: A Reinforcement Learning-Guided Approach for Multi-Debris Rendezvous", "paper_summary": "This research introduces a novel application of a masked Proximal Policy\nOptimization (PPO) algorithm from the field of deep reinforcement learning\n(RL), for determining the most efficient sequence of space debris visitation,\nutilizing the Lambert solver as per Izzo's adaptation for individual\nrendezvous. The aim is to optimize the sequence in which all the given debris\nshould be visited to get the least total time for rendezvous for the entire\nmission. A neural network (NN) policy is developed, trained on simulated space\nmissions with varying debris fields. After training, the neural network\ncalculates approximately optimal paths using Izzo's adaptation of Lambert\nmaneuvers. Performance is evaluated against standard heuristics in mission\nplanning. The reinforcement learning approach demonstrates a significant\nimprovement in planning efficiency by optimizing the sequence for debris\nrendezvous, reducing the total mission time by an average of approximately\n{10.96\\%} and {13.66\\%} compared to the Genetic and Greedy algorithms,\nrespectively. The model on average identifies the most time-efficient sequence\nfor debris visitation across various simulated scenarios with the fastest\ncomputational speed. This approach signifies a step forward in enhancing\nmission planning strategies for space debris clearance.", "paper_summary_zh": "这项研究引入了深度强化学习（RL）领域中一种掩蔽近端策略优化（PPO）算法的新应用，用于确定空间碎片访问的最有效顺序，利用 Lambert 求解器根据 Izzo 对个别会合的改编。目的是优化访问所有给定碎片的顺序，以获得整个任务会合的最小总时间。开发了一个神经网络（NN）策略，在具有不同碎片场的模拟太空任务中进行训练。训练后，神经网络使用 Izzo 对 Lambert 机动的改编计算近似最优路径。在任务规划中针对标准启发式方法评估性能。强化学习方法通过优化碎片会合的顺序，显着提高了规划效率，与遗传和贪婪算法相比，总任务时间平均减少了大约{10.96%}和{13.66%}。该模型平均确定了在各种模拟场景中碎片访问的最省时顺序，并具有最快的计算速度。这种方法标志着增强空间碎片清除任务规划策略向前迈进了一步。", "author": "Agni Bandyopadhyay et.al.", "authors": "Agni Bandyopadhyay, Guenther Waxenegger-Wilfing", "id": "2409.16882v1", "paper_url": "http://arxiv.org/abs/2409.16882v1", "repo": "null"}}