{"2501.13956": {"publish_time": "2025-01-20", "title": "Zep: A Temporal Knowledge Graph Architecture for Agent Memory", "paper_summary": "We introduce Zep, a novel memory layer service for AI agents that outperforms\nthe current state-of-the-art system, MemGPT, in the Deep Memory Retrieval (DMR)\nbenchmark. Additionally, Zep excels in more comprehensive and challenging\nevaluations than DMR that better reflect real-world enterprise use cases. While\nexisting retrieval-augmented generation (RAG) frameworks for large language\nmodel (LLM)-based agents are limited to static document retrieval, enterprise\napplications demand dynamic knowledge integration from diverse sources\nincluding ongoing conversations and business data. Zep addresses this\nfundamental limitation through its core component Graphiti -- a\ntemporally-aware knowledge graph engine that dynamically synthesizes both\nunstructured conversational data and structured business data while maintaining\nhistorical relationships. In the DMR benchmark, which the MemGPT team\nestablished as their primary evaluation metric, Zep demonstrates superior\nperformance (94.8% vs 93.4%). Beyond DMR, Zep's capabilities are further\nvalidated through the more challenging LongMemEval benchmark, which better\nreflects enterprise use cases through complex temporal reasoning tasks. In this\nevaluation, Zep achieves substantial results with accuracy improvements of up\nto 18.5% while simultaneously reducing response latency by 90% compared to\nbaseline implementations. These results are particularly pronounced in\nenterprise-critical tasks such as cross-session information synthesis and\nlong-term context maintenance, demonstrating Zep's effectiveness for deployment\nin real-world applications.", "paper_summary_zh": "我們推出 Zep，這是一種新穎的記憶層服務，適用於 AI 代理，其在深度記憶擷取 (DMR) 基準測試中優於現行的最先進系統 MemGPT。此外，Zep 在比 DMR 更全面且更具挑戰性的評估中表現出色，這些評估更能反映真實世界的企業用例。雖然現有的檢索增強生成 (RAG) 架構僅限於大型語言模型 (LLM) 基於代理的靜態文件檢索，但企業應用需要從包括正在進行的對話和業務數據在內的不同來源動態整合知識。Zep 通過其核心組件 Graphiti 來解決這個基本限制，Graphiti 是一個時間感知知識圖譜引擎，可以在維護歷史關係的同時動態綜合非結構化對話數據和結構化業務數據。在 MemGPT 團隊確立為其主要評估指標的 DMR 基準測試中，Zep 表現出優異的效能（94.8% 對 93.4%）。除了 DMR 之外，Zep 的功能還通過更具挑戰性的 LongMemEval 基準測試進一步得到驗證，該基準測試通過複雜的時間推理任務更好地反映了企業用例。在這個評估中，Zep 以高達 18.5% 的準確度改進取得了顯著的成果，同時與基線實作相比，將回應延遲降低了 90%。這些成果在企業關鍵任務中尤為明顯，例如跨會話資訊綜合和長期脈絡維護，證明了 Zep 在實際應用中部署的有效性。", "author": "Preston Rasmussen et.al.", "authors": "Preston Rasmussen, Pavlo Paliychuk, Travis Beauvais, Jack Ryan, Daniel Chalef", "id": "2501.13956v1", "paper_url": "http://arxiv.org/abs/2501.13956v1", "repo": "null"}}