{"2409.06178": {"publish_time": "2024-09-10", "title": "SQLucid: Grounding Natural Language Database Queries with Interactive Explanations", "paper_summary": "Though recent advances in machine learning have led to significant\nimprovements in natural language interfaces for databases, the accuracy and\nreliability of these systems remain limited, especially in high-stakes domains.\nThis paper introduces SQLucid, a novel user interface that bridges the gap\nbetween non-expert users and complex database querying processes. SQLucid\naddresses existing limitations by integrating visual correspondence,\nintermediate query results, and editable step-by-step SQL explanations in\nnatural language to facilitate user understanding and engagement. This unique\nblend of features empowers users to understand and refine SQL queries easily\nand precisely. Two user studies and one quantitative experiment were conducted\nto validate SQLucid's effectiveness, showing significant improvement in task\ncompletion accuracy and user confidence compared to existing interfaces. Our\ncode is available at https://github.com/magic-YuanTian/SQLucid.", "paper_summary_zh": "儘管機器學習的最新進展已大幅提升資料庫的自然語言介面，但這些系統的準確性和可靠性仍然有限，尤其是在高風險領域。本文介紹 SQLucid，這是一種新穎的使用者介面，用以彌補非專家使用者與複雜資料庫查詢流程之間的差距。SQLucid 整合視覺對應、中間查詢結果，以及以自然語言編寫的可編輯分步式 SQL 說明，來解決現有限制，以促進使用者理解和參與。這種獨特的功能組合讓使用者能夠輕鬆且精確地理解和修改 SQL 查詢。進行了兩項使用者研究和一項量化實驗，以驗證 SQLucid 的有效性，結果顯示與現有介面相比，任務完成準確度和使用者信心都有顯著提升。我們的程式碼可在 https://github.com/magic-YuanTian/SQLucid 取得。", "author": "Yuan Tian et.al.", "authors": "Yuan Tian, Jonathan K. Kummerfeld, Toby Jia-Jun Li, Tianyi Zhang", "id": "2409.06178v1", "paper_url": "http://arxiv.org/abs/2409.06178v1", "repo": "https://github.com/magic-yuantian/sqlucid"}}