{"2405.03870": {"publish_time": "2024-05-06", "title": "AI-Driven Frameworks for Enhancing Data Quality in Big Data Ecosystems: Error_Detection, Correction, and Metadata Integration", "paper_summary": "The widespread adoption of big data has ushered in a new era of data-driven\ndecision-making, transforming numerous industries and sectors. However, the\nefficacy of these decisions hinges on the quality of the underlying data. Poor\ndata quality can result in inaccurate analyses and deceptive conclusions.\nManaging the vast volume, velocity, and variety of data sources presents\nsignificant challenges, heightening the importance of addressing big data\nquality issues. While there has been increased attention from both academia and\nindustry, current approaches often lack comprehensiveness and universality.\nThey tend to focus on limited metrics, neglecting other dimensions of data\nquality. Moreover, existing methods are often context-specific, limiting their\napplicability across different domains. There is a clear need for intelligent,\nautomated approaches leveraging artificial intelligence (AI) for advanced data\nquality corrections.\n  To bridge these gaps, this Ph.D. thesis proposes a novel set of\ninterconnected frameworks aimed at enhancing big data quality comprehensively.\nFirstly, we introduce new quality metrics and a weighted scoring system for\nprecise data quality assessment. Secondly, we present a generic framework for\ndetecting various quality anomalies using AI models. Thirdly, we propose an\ninnovative framework for correcting detected anomalies through predictive\nmodeling. Additionally, we address metadata quality enhancement within big data\necosystems. These frameworks are rigorously tested on diverse datasets,\ndemonstrating their efficacy in improving big data quality. Finally, the thesis\nconcludes with insights and suggestions for future research directions.", "paper_summary_zh": "大數據的廣泛採用開啟了由數據驅動的決策制定的新時代，轉變了許多產業和部門。然而，這些決策的效力取決於基礎數據的品質。品質不佳的數據可能導致分析不準確和結論具有誤導性。管理大量、高速率和多樣化的數據來源會帶來重大挑戰，這提高了解決大數據品質問題的重要性。儘管學術界和產業都越來越關注，但目前的方法通常缺乏全面性和普遍性。它們傾向於關注有限的指標，忽略數據品質的其他面向。此外，現有方法通常具有特定情境，這限制了它們在不同領域的適用性。顯然需要利用人工智慧 (AI) 進行智慧且自動化的處理，以進行進階的數據品質修正。\n為了彌補這些差距，本博士論文提出了一組新的互連架構，旨在全面提升大數據品質。首先，我們引進新的品質指標和加權評分系統，以進行精確的數據品質評估。其次，我們提出一個通用架構，以使用 AI 模型偵測各種品質異常。第三，我們提出一個創新的架構，以透過預測模型修正已偵測到的異常。此外，我們處理大數據生態系統中的元數據品質提升。這些架構在不同的資料集上經過嚴格測試，證明了它們在改善大數據品質方面的效力。最後，本論文以對未來研究方向的見解和建議作為結論。", "author": "Widad Elouataoui et.al.", "authors": "Widad Elouataoui", "id": "2405.03870v1", "paper_url": "http://arxiv.org/abs/2405.03870v1", "repo": "null"}}