{"2410.11677": {"publish_time": "2024-10-15", "title": "Understanding Likelihood Over-optimisation in Direct Alignment Algorithms", "paper_summary": "Direct Alignment Algorithms (DAAs), such as Direct Preference Optimisation\n(DPO) and Identity Preference Optimisation (IPO), have emerged as alternatives\nto online Reinforcement Learning from Human Feedback (RLHF) algorithms such as\nProximal Policy Optimisation (PPO) for aligning language models to human\npreferences, without the need for explicit reward modelling. These methods\ngenerally aim to increase the likelihood of generating better (preferred)\ncompletions while discouraging worse (non-preferred) ones, while staying close\nto the original model's behaviour. In this work, we explore the relationship\nbetween completion likelihood and model performance in state-of-the-art DAAs,\nand identify a critical issue of likelihood over-optimisation. Contrary to\nexpectations, we find that higher likelihood of better completions and larger\nmargins between better and worse completion likelihoods do not necessarily lead\nto better performance, and may even degrade it. Our analysis reveals that while\nhigher likelihood correlates with better memorisation of factual knowledge\npatterns, a slightly lower completion likelihood tends to improve output\ndiversity, thus leading to better generalisation to unseen scenarios. Moreover,\nwe identify two key indicators that signal when over-optimised output diversity\nbegins to harm performance: Decreasing Entropy over Top-k Tokens and\nDiminishing Top-k Probability Mass. Our experimental results validate that\nthese indicators are reliable signs of declining performance under different\nregularisations, helping prevent over-optimisation and improve alignment with\nhuman preferences.", "paper_summary_zh": "直接對齊演算法（DAA），例如直接偏好最佳化（DPO）和身分偏好最佳化（IPO），已浮現為線上強化學習中，來自人類回饋（RLHF）演算法的替代方案，例如鄰近策略最佳化（PPO），用於將語言模型與人類偏好對齊，而無需明確的獎勵建模。這些方法通常旨在提高產生更好（偏好）完成的可能性，同時阻止更差（非偏好）的完成，同時保持接近原始模型的行為。在這項工作中，我們探討了最先進的 DAA 中完成可能性與模型效能之間的關係，並找出可能性過度最佳化的關鍵問題。與預期相反，我們發現更好的完成的可能性較高，以及更好和更差的完成可能性之間的邊際較大，並非必然會導致更好的效能，甚至可能降低效能。我們的分析顯示，雖然較高的可能性與事實知識模式的較好記憶力相關，但稍低的完成可能性往往會改善輸出多樣性，從而導致對未見情境的概括性更好。此外，我們找出兩個關鍵指標，表示過度最佳化的輸出多樣性開始對效能造成傷害：前 k 個代幣的熵遞減和前 k 個機率質量遞減。我們的實驗結果驗證，這些指標是在不同規範下效能下降的可靠跡象，有助於防止過度最佳化並改善與人類偏好的對齊。", "author": "Zhengyan Shi et.al.", "authors": "Zhengyan Shi, Sander Land, Acyr Locatelli, Matthieu Geist, Max Bartolo", "id": "2410.11677v1", "paper_url": "http://arxiv.org/abs/2410.11677v1", "repo": "null"}}