{"2501.04635": {"publish_time": "2025-01-08", "title": "Knowledge Retrieval Based on Generative AI", "paper_summary": "This study develops a question-answering system based on Retrieval-Augmented\nGeneration (RAG) using Chinese Wikipedia and Lawbank as retrieval sources.\nUsing TTQA and TMMLU+ as evaluation datasets, the system employs BGE-M3 for\ndense vector retrieval to obtain highly relevant search results and\nBGE-reranker to reorder these results based on query relevance. The most\npertinent retrieval outcomes serve as reference knowledge for a Large Language\nModel (LLM), enhancing its ability to answer questions and establishing a\nknowledge retrieval system grounded in generative AI.\n  The system's effectiveness is assessed through a two-stage evaluation:\nautomatic and assisted performance evaluations. The automatic evaluation\ncalculates accuracy by comparing the model's auto-generated labels with ground\ntruth answers, measuring performance under standardized conditions without\nhuman intervention. The assisted performance evaluation involves 20\nfinance-related multiple-choice questions answered by 20 participants without\nfinancial backgrounds. Initially, participants answer independently. Later,\nthey receive system-generated reference information to assist in answering,\nexamining whether the system improves accuracy when assistance is provided.\n  The main contributions of this research are: (1) Enhanced LLM Capability: By\nintegrating BGE-M3 and BGE-reranker, the system retrieves and reorders highly\nrelevant results, reduces hallucinations, and dynamically accesses authorized\nor public knowledge sources. (2) Improved Data Privacy: A customized RAG\narchitecture enables local operation of the LLM, eliminating the need to send\nprivate data to external servers. This approach enhances data security, reduces\nreliance on commercial services, lowers operational costs, and mitigates\nprivacy risks.", "paper_summary_zh": "<paragraph>本研究開發了一個問答系統，該系統基於檢索增強生成 (RAG)，使用中文維基百科和 Lawbank 作為檢索來源。系統使用 TTQA 和 TMMLU+ 作為評估資料集，採用 BGE-M3 進行稠密向量檢索，以取得高度相關的搜尋結果，並使用 BGE-reranker 根據查詢相關性對這些結果重新排序。最相關的檢索結果作為大型語言模型 (LLM) 的參考知識，增強其回答問題的能力，並建立一個基於生成式 AI 的知識檢索系統。系統的有效性通過兩階段評估來評估：自動和輔助性能評估。自動評估通過將模型自動生成的標籤與真實答案進行比較來計算準確性，在沒有人工干預的情況下測量標準化條件下的性能。輔助性能評估包括 20 個與金融相關的多選題，由 20 個沒有金融背景的參與者回答。最初，參與者獨立回答。稍後，他們會收到系統生成的參考資訊以協助回答，檢查在提供協助時系統是否能提高準確性。本研究的主要貢獻有：(1) 增強的 LLM 能力：通過整合 BGE-M3 和 BGE-reranker，系統檢索和重新排序高度相關的結果，減少幻覺，並動態訪問授權或公開的知識來源。(2) 改善資料隱私：自訂的 RAG 架構允許 LLM 本地運作，無需將私人資料傳送至外部伺服器。這種方法增強了資料安全性，減少了對商業服務的依賴，降低了運營成本，並減輕了隱私風險。</paragraph>", "author": "Te-Lun Yang et.al.", "authors": "Te-Lun Yang, Jyi-Shane Liu, Yuen-Hsien Tseng, Jyh-Shing Roger Jang", "id": "2501.04635v1", "paper_url": "http://arxiv.org/abs/2501.04635v1", "repo": "null"}}