{"2405.18315": {"publish_time": "2024-05-28", "title": "DSDL: Data Set Description Language for Bridging Modalities and Tasks in AI Data", "paper_summary": "In the era of artificial intelligence, the diversity of data modalities and\nannotation formats often renders data unusable directly, requiring\nunderstanding and format conversion before it can be used by researchers or\ndevelopers with different needs. To tackle this problem, this article\nintroduces a framework called Dataset Description Language (DSDL) that aims to\nsimplify dataset processing by providing a unified standard for AI datasets.\nDSDL adheres to the three basic practical principles of generic, portable, and\nextensible, using a unified standard to express data of different modalities\nand structures, facilitating the dissemination of AI data, and easily extending\nto new modalities and tasks. The standardized specifications of DSDL reduce the\nworkload for users in data dissemination, processing, and usage. To further\nimprove user convenience, we provide predefined DSDL templates for various\ntasks, convert mainstream datasets to comply with DSDL specifications, and\nprovide comprehensive documentation and DSDL tools. These efforts aim to\nsimplify the use of AI data, thereby improving the efficiency of AI\ndevelopment.", "paper_summary_zh": "在人工智能時代，數據模態和標註格式的多樣性經常導致數據無法直接使用，需要在研究人員或開發人員使用前進行理解和格式轉換以滿足不同的需求。為了解決這個問題，本文介紹了一個名為數據集描述語言（DSDL）的框架，旨在通過為 AI 數據集提供統一標準來簡化數據集處理。DSDL 遵循通用、可攜式和可擴展的三個基本實用原則，使用統一的標準來表示不同模態和結構的數據，促進 AI 數據的傳播，並輕鬆擴展到新的模態和任務。DSDL 的標準化規範減少了用戶在數據傳播、處理和使用中的工作量。為了進一步提高用戶便利性，我們為各種任務提供了預定義的 DSDL 模板，將主流數據集轉換為符合 DSDL 規範，並提供全面的文檔和 DSDL 工具。這些努力旨在簡化 AI 數據的使用，從而提高 AI 開發的效率。", "author": "Bin Wang et.al.", "authors": "Bin Wang, Linke Ouyang, Fan Wu, Wenchang Ning, Xiao Han, Zhiyuan Zhao, Jiahui Peng, Yiying Jiang, Dahua Lin, Conghui He", "id": "2405.18315v1", "paper_url": "http://arxiv.org/abs/2405.18315v1", "repo": "https://github.com/opendatalab/dsdl-sdk"}}