{"2410.03600": {"publish_time": "2024-10-04", "title": "Efficiently Identifying Watermarked Segments in Mixed-Source Texts", "paper_summary": "Text watermarks in large language models (LLMs) are increasingly used to\ndetect synthetic text, mitigating misuse cases like fake news and academic\ndishonesty. While existing watermarking detection techniques primarily focus on\nclassifying entire documents as watermarked or not, they often neglect the\ncommon scenario of identifying individual watermark segments within longer,\nmixed-source documents. Drawing inspiration from plagiarism detection systems,\nwe propose two novel methods for partial watermark detection. First, we develop\na geometry cover detection framework aimed at determining whether there is a\nwatermark segment in long text. Second, we introduce an adaptive online\nlearning algorithm to pinpoint the precise location of watermark segments\nwithin the text. Evaluated on three popular watermarking techniques\n(KGW-Watermark, Unigram-Watermark, and Gumbel-Watermark), our approach achieves\nhigh accuracy, significantly outperforming baseline methods. Moreover, our\nframework is adaptable to other watermarking techniques, offering new insights\nfor precise watermark detection.", "paper_summary_zh": "大型語言模型 (LLM) 中的文字浮水印日益用於檢測合成文字，緩解假新聞和學術不誠實等濫用案例。雖然現有的浮水印檢測技術主要集中於將整個文件分類為有浮水印或沒有浮水印，但它們通常忽略了在較長、混合來源文件內識別個別浮水印區段的常見場景。從抄襲檢測系統中汲取靈感，我們提出了兩種用於部分浮水印檢測的新穎方法。首先，我們開發了一個幾何覆蓋檢測框架，旨在確定長文本中是否存在浮水印區段。其次，我們引入了一個自適應線上學習演算法，以精確找出文字中浮水印區段的位置。在三種流行的浮水印技術（KGW-Watermark、Unigram-Watermark 和 Gumbel-Watermark）上進行評估，我們的做法達到了很高的準確度，顯著優於基線方法。此外，我們的框架可以適應其他浮水印技術，為精確的浮水印檢測提供新的見解。", "author": "Xuandong Zhao et.al.", "authors": "Xuandong Zhao, Chenwen Liao, Yu-Xiang Wang, Lei Li", "id": "2410.03600v1", "paper_url": "http://arxiv.org/abs/2410.03600v1", "repo": "null"}}