{"2409.07162": {"publish_time": "2024-09-11", "title": "A Fine-grained Sentiment Analysis of App Reviews using Large Language Models: An Evaluation Study", "paper_summary": "Analyzing user reviews for sentiment towards app features can provide\nvaluable insights into users' perceptions of app functionality and their\nevolving needs. Given the volume of user reviews received daily, an automated\nmechanism to generate feature-level sentiment summaries of user reviews is\nneeded. Recent advances in Large Language Models (LLMs) such as ChatGPT have\nshown impressive performance on several new tasks without updating the model's\nparameters i.e. using zero or a few labeled examples. Despite these\nadvancements, LLMs' capabilities to perform feature-specific sentiment analysis\nof user reviews remain unexplored. This study compares the performance of\nstate-of-the-art LLMs, including GPT-4, ChatGPT, and LLama-2-chat variants, for\nextracting app features and associated sentiments under 0-shot, 1-shot, and\n5-shot scenarios. Results indicate the best-performing GPT-4 model outperforms\nrule-based approaches by 23.6% in f1-score with zero-shot feature extraction;\n5-shot further improving it by 6%. GPT-4 achieves a 74% f1-score for predicting\npositive sentiment towards correctly predicted app features, with 5-shot\nenhancing it by 7%. Our study suggests that LLM models are promising for\ngenerating feature-specific sentiment summaries of user reviews.", "paper_summary_zh": "分析使用者評論以了解應用程式功能的觀感，可提供有價值的見解，了解使用者對應用程式功能的看法和他們不斷變化的需求。鑑於每天收到的使用者評論數量龐大，需要一種自動化機制來產生使用者評論的功能層級觀感摘要。大型語言模型 (LLM) 的最新進展，例如 ChatGPT，已在多項新任務中展現令人印象深刻的效能，而無需更新模型的參數，即使用零個或幾個標記範例。儘管有這些進展，LLM 執行使用者評論的功能特定觀感分析的能力仍未被探索。本研究比較了最先進的 LLM 的效能，包括 GPT-4、ChatGPT 和 LLama-2-chat 變體，用於在 0 次嘗試、1 次嘗試和 5 次嘗試的情況下擷取應用程式功能和關聯觀感。結果表明，效能最佳的 GPT-4 模型在零次嘗試功能擷取中，f1 分數比基於規則的方法高出 23.6%；5 次嘗試進一步提高了 6%。GPT-4 在預測正確預測的應用程式功能的正面觀感方面達到 74% 的 f1 分數，5 次嘗試將其提高了 7%。我們的研究表明，LLM 模型有望產生使用者評論的功能特定觀感摘要。", "author": "Faiz Ali Shah et.al.", "authors": "Faiz Ali Shah, Ahmed Sabir, Rajesh Sharma", "id": "2409.07162v1", "paper_url": "http://arxiv.org/abs/2409.07162v1", "repo": "https://github.com/faiz-ut/eval-feature-sentiment-extraction-llms"}}