{"2406.17969": {"publish_time": "2024-06-25", "title": "Encourage or Inhibit Monosemanticity? Revisit Monosemanticity from a Feature Decorrelation Perspective", "paper_summary": "To better interpret the intrinsic mechanism of large language models (LLMs),\nrecent studies focus on monosemanticity on its basic units. A monosemantic\nneuron is dedicated to a single and specific concept, which forms a one-to-one\ncorrelation between neurons and concepts. Despite extensive research in\nmonosemanticity probing, it remains unclear whether monosemanticity is\nbeneficial or harmful to model capacity. To explore this question, we revisit\nmonosemanticity from the feature decorrelation perspective and advocate for its\nencouragement. We experimentally observe that the current conclusion by\nwang2024learning, which suggests that decreasing monosemanticity enhances model\nperformance, does not hold when the model changes. Instead, we demonstrate that\nmonosemanticity consistently exhibits a positive correlation with model\ncapacity, in the preference alignment process. Consequently, we apply feature\ncorrelation as a proxy for monosemanticity and incorporate a feature\ndecorrelation regularizer into the dynamic preference optimization process. The\nexperiments show that our method not only enhances representation diversity and\nactivation sparsity but also improves preference alignment performance.", "paper_summary_zh": "為了更好地詮釋大型語言模型 (LLM) 的內在機制，\n近期研究專注於其基本單元的單一語義。單一語義\n神經元專注於單一且特定的概念，形成神經元與概念之間的一對一\n對應關係。儘管在單一語義探測方面進行了廣泛的研究，\n但單一語義是否有益或有害於模型容量仍不清楚。為了探討這個問題，我們從特徵去相關的角度重新審視單一語義並提倡其\n鼓勵。我們透過實驗觀察到 wang2024learning 目前的結論，\n這表明降低單一語義會增強模型效能，在模型改變時不成立。相反，我們證明單一語義在偏好對齊過程中始終與模型\n容量呈正相關。因此，我們將特徵相關性作為單一語義的代理，並將特徵\n去相關正則化項納入動態偏好最佳化過程中。實驗表明，我們的\n方法不僅增強了表示多樣性和激活稀疏性，而且還改善了偏好對齊效能。", "author": "Hanqi Yan et.al.", "authors": "Hanqi Yan, Yanzheng Xiang, Guangyi Chen, Yifei Wang, Lin Gui, Yulan He", "id": "2406.17969v1", "paper_url": "http://arxiv.org/abs/2406.17969v1", "repo": "null"}}