{"2408.06226": {"publish_time": "2024-08-12", "title": "A Large-Scale Study of Model Integration in ML-Enabled Software Systems", "paper_summary": "The rise of machine learning (ML) and its embedding in systems has\ndrastically changed the engineering of software-intensive systems.\nTraditionally, software engineering focuses on manually created artifacts such\nas source code and the process of creating them, as well as best practices for\nintegrating them, i.e., software architectures. In contrast, the development of\nML artifacts, i.e. ML models, comes from data science and focuses on the ML\nmodels and their training data. However, to deliver value to end users, these\nML models must be embedded in traditional software, often forming complex\ntopologies. In fact, ML-enabled software can easily incorporate many different\nML models. While the challenges and practices of building ML-enabled systems\nhave been studied to some extent, beyond isolated examples, little is known\nabout the characteristics of real-world ML-enabled systems. Properly embedding\nML models in systems so that they can be easily maintained or reused is far\nfrom trivial. We need to improve our empirical understanding of such systems,\nwhich we address by presenting the first large-scale study of real ML-enabled\nsoftware systems, covering over 2,928 open source systems on GitHub. We\nclassified and analyzed them to determine their characteristics, as well as\ntheir practices for reusing ML models and related code, and the architecture of\nthese systems. Our findings provide practitioners and researchers with insight\ninto practices for embedding and integrating ML models, bringing data science\nand software engineering closer together.", "paper_summary_zh": "機器學習 (ML) 的崛起及其在系統中的嵌入，徹底改變了軟體密集型系統的工程。\n傳統上，軟體工程專注於人工建立的成品，例如原始碼和建立它們的流程，以及整合它們的最佳實務，也就是軟體架構。\n相反地，ML 成品的開發，也就是 ML 模型，來自於資料科學，並專注於 ML 模型及其訓練資料。\n然而，為了提供價值給最終使用者，這些 ML 模型必須嵌入在傳統的軟體中，通常形成複雜的拓撲。\n事實上，啟用 ML 的軟體可以輕易地整合許多不同的 ML 模型。\n雖然建構啟用 ML 的系統的挑戰和實務已經在某種程度上被研究，但除了孤立的範例之外，對於真實世界中啟用 ML 的系統的特性所知甚少。\n適當地將 ML 模型嵌入系統中，以便它們可以被輕易地維護或重複使用，遠非易事。\n我們需要改善對此類系統的經驗理解，我們透過提出第一個針對真實啟用 ML 的軟體系統的大規模研究來解決，涵蓋了 GitHub 上超過 2,928 個開源系統。\n我們對它們進行分類和分析，以確定它們的特性，以及它們重複使用 ML 模型和相關程式碼的實務，以及這些系統的架構。\n我們的發現為實務工作者和研究人員提供了對嵌入和整合 ML 模型實務的見解，讓資料科學和軟體工程更接近。", "author": "Yorick Sens et.al.", "authors": "Yorick Sens, Henriette Knopp, Sven Peldszus, Thorsten Berger", "id": "2408.06226v1", "paper_url": "http://arxiv.org/abs/2408.06226v1", "repo": "null"}}