{"2408.13248": {"publish_time": "2024-08-23", "title": "Foundational Model for Electron Micrograph Analysis: Instruction-Tuning Small-Scale Language-and-Vision Assistant for Enterprise Adoption", "paper_summary": "Semiconductor imaging and analysis are critical yet understudied in deep\nlearning, limiting our ability for precise control and optimization in\nsemiconductor manufacturing. We introduce a small-scale multimodal framework\nfor analyzing semiconductor electron microscopy images (MAEMI) through\nvision-language instruction tuning. We generate a customized\ninstruction-following dataset using large multimodal models on microscopic\nimage analysis. We perform knowledge transfer from larger to smaller models\nthrough knowledge distillation, resulting in improved accuracy of smaller\nmodels on visual question answering (VQA) tasks. This approach eliminates the\nneed for expensive, human expert-annotated datasets for microscopic image\nanalysis tasks. Enterprises can further finetune MAEMI on their intellectual\ndata, enhancing privacy and performance on low-cost consumer hardware. Our\nexperiments show that MAEMI outperforms traditional methods, adapts to data\ndistribution shifts, and supports high-throughput screening.", "paper_summary_zh": "半導體成像和分析在深度學習中至關重要，但尚未得到充分研究，這限制了我們在半導體製造中精確控制和最佳化的能力。我們引入了一個小規模多模態框架，通過視覺語言指令調整來分析半導體電子顯微鏡圖像 (MAEMI)。我們使用大型多模態模型在微觀圖像分析上生成一個自訂的指令遵循資料集。我們透過知識蒸餾從較大的模型執行知識轉移到較小的模型，進而提升較小模型在視覺問答 (VQA) 任務上的準確度。此方法消除了對微觀圖像分析任務昂貴的人工專家註解資料集的需求。企業可以在其智慧資料上進一步微調 MAEMI，以增強隱私和低成本消費硬體的效能。我們的實驗表明，MAEMI 優於傳統方法，能適應資料分佈轉移，並支援高通量篩選。", "author": "Sakhinana Sagar Srinivas et.al.", "authors": "Sakhinana Sagar Srinivas, Chidaksh Ravuru, Geethan Sannidhi, Venkataramana Runkana", "id": "2408.13248v1", "paper_url": "http://arxiv.org/abs/2408.13248v1", "repo": "null"}}