{"2410.02429": {"publish_time": "2024-10-03", "title": "IoT-LLM: Enhancing Real-World IoT Task Reasoning with Large Language Models", "paper_summary": "Large Language Models (LLMs) have demonstrated remarkable capabilities across\ntextual and visual domains but often generate outputs that violate physical\nlaws, revealing a gap in their understanding of the physical world. Inspired by\nhuman cognition, where perception is fundamental to reasoning, we explore\naugmenting LLMs with enhanced perception abilities using Internet of Things\n(IoT) sensor data and pertinent knowledge for IoT task reasoning in the\nphysical world. In this work, we systematically study LLMs capability to\naddress real-world IoT tasks by augmenting their perception and knowledge base,\nand then propose a unified framework, IoT-LLM, to enhance such capability. In\nIoT-LLM, we customize three steps for LLMs: preprocessing IoT data into formats\namenable to LLMs, activating their commonsense knowledge through\nchain-of-thought prompting and specialized role definitions, and expanding\ntheir understanding via IoT-oriented retrieval-augmented generation based on\nin-context learning. To evaluate the performance, We design a new benchmark\nwith five real-world IoT tasks with different data types and reasoning\ndifficulties and provide the benchmarking results on six open-source and\nclose-source LLMs. Experimental results demonstrate the limitations of existing\nLLMs with naive textual inputs that cannot perform these tasks effectively. We\nshow that IoT-LLM significantly enhances the performance of IoT tasks reasoning\nof LLM, such as GPT-4, achieving an average improvement of 65% across various\ntasks against previous methods. The results also showcase LLMs ability to\ncomprehend IoT data and the physical law behind data by providing a reasoning\nprocess. Limitations of our work are claimed to inspire future research in this\nnew era.", "paper_summary_zh": "大型語言模型 (LLM) 已在文本和視覺領域展示出非凡的能力，但經常會產生違反物理定律的輸出，這揭示了它們對物理世界的理解存在差距。受人類認知的啟發，感知是推理的基礎，我們探討利用物聯網 (IoT) 感測器資料和與 IoT 任務推理相關的知識，來增強 LLM 的感知能力，以應對物理世界。在這項工作中，我們系統性地研究 LLM 的能力，透過增強它們的感知和知識庫來解決真實世界的 IoT 任務，並提出一個統一的架構 IoT-LLM 來增強這種能力。在 IoT-LLM 中，我們為 LLM 客製化三個步驟：將 IoT 資料預處理成 LLM 適用的格式、透過思考鏈提示和專門的角色定義來啟動它們的常識知識，以及透過基於情境學習的 IoT 導向檢索增強生成來擴展它們的理解。為了評估效能，我們設計了一個新的基準，包含五個具有不同資料類型和推理難度的真實世界 IoT 任務，並在六個開源和閉源 LLM 上提供基準測試結果。實驗結果證明了現有 LLM 使用天真的文字輸入的限制，無法有效執行這些任務。我們展示了 IoT-LLM 大幅提升了 LLM 對 IoT 任務推理的效能，例如 GPT-4，在各種任務中相較於先前的技術，平均提升了 65%。結果也展示了 LLM 透過提供推理過程來理解 IoT 資料和資料背後的物理定律的能力。我們工作的限制被認為能激勵這個新時代的未來研究。", "author": "Tuo An et.al.", "authors": "Tuo An, Yunjiao Zhou, Han Zou, Jianfei Yang", "id": "2410.02429v2", "paper_url": "http://arxiv.org/abs/2410.02429v2", "repo": "null"}}