{"2406.12660": {"publish_time": "2024-06-18", "title": "Investigating the Role of Explainability and AI Literacy in User Compliance", "paper_summary": "AI is becoming increasingly common across different domains. However, as\nsophisticated AI-based systems are often black-boxed, rendering the\ndecision-making logic opaque, users find it challenging to comply with their\nrecommendations. Although researchers are investigating Explainable AI (XAI) to\nincrease the transparency of the underlying machine learning models, it is\nunclear what types of explanations are effective and what other factors\nincrease compliance. To better understand the interplay of these factors, we\nconducted an experiment with 562 participants who were presented with the\nrecommendations of an AI and two different types of XAI. We find that users'\ncompliance increases with the introduction of XAI but is also affected by AI\nliteracy. We also find that the relationships between AI literacy XAI and\nusers' compliance are mediated by the users' mental model of AI. Our study has\nseveral implications for successfully designing AI-based systems utilizing XAI.", "paper_summary_zh": "隨著 AI 在不同領域變得越來越普遍。然而，由於複雜的 AI 系統通常是黑箱作業，使得決策邏輯不透明，使用者發現很難遵守建議。儘管研究人員正在研究可解釋 AI (XAI) 以提高基礎機器學習模型的透明度，但目前尚不清楚哪些類型的解釋有效，以及哪些其他因素會提高相容性。為了更好地了解這些因素之間的交互作用，我們對 562 名參與者進行了一項實驗，這些參與者被提供了 AI 的建議和兩種不同類型的 XAI。我們發現使用者的相容性隨著 XAI 的引入而增加，但也會受到 AI 素養的影響。我們還發現 AI 素養 XAI 與使用者相容性之間的關係是由使用者對 AI 的心智模型所調節的。我們的研究對成功設計利用 XAI 的 AI 系統有幾個啟示。", "author": "Niklas Kühl et.al.", "authors": "Niklas Kühl, Christian Meske, Maximilian Nitsche, Jodie Lobana", "id": "2406.12660v1", "paper_url": "http://arxiv.org/abs/2406.12660v1", "repo": "null"}}