{"2411.07391": {"publish_time": "2024-11-11", "title": "Federated Learning Client Pruning for Noisy Labels", "paper_summary": "Federated Learning (FL) enables collaborative model training across\ndecentralized edge devices while preserving data privacy. However, existing FL\nmethods often assume clean annotated datasets, impractical for\nresource-constrained edge devices. In reality, noisy labels are prevalent,\nposing significant challenges to FL performance. Prior approaches attempt label\ncorrection and robust training techniques but exhibit limited efficacy,\nparticularly under high noise levels. This paper introduces ClipFL (Federated\nLearning Client Pruning), a novel framework addressing noisy labels from a\nfresh perspective. ClipFL identifies and excludes noisy clients based on their\nperformance on a clean validation dataset, tracked using a Noise Candidacy\nScore (NCS). The framework comprises three phases: pre-client pruning to\nidentify potential noisy clients and calculate their NCS, client pruning to\nexclude a percentage of clients with the highest NCS, and post-client pruning\nfor fine-tuning the global model with standard FL on clean clients. Empirical\nevaluation demonstrates ClipFL's efficacy across diverse datasets and noise\nlevels, achieving accurate noisy client identification, superior performance,\nfaster convergence, and reduced communication costs compared to\nstate-of-the-art FL methods. Our code is available at\nhttps://github.com/MMorafah/ClipFL.", "paper_summary_zh": "聯邦學習 (FL) 能在分散式邊緣裝置上進行協作模型訓練，同時保留資料隱私。然而，現有的 FL 方法通常假設標記資料集是乾淨的，這對於資源受限的邊緣裝置來說是不切實際的。實際上，雜訊標籤很普遍，對 FL 效能構成重大挑戰。先前的做法嘗試標籤校正和穩健訓練技術，但在高雜訊水準下表現出的效能有限。本文介紹 ClipFL（聯邦學習用戶端剪枝），這是一個從新觀點解決雜訊標籤的新穎架構。ClipFL 根據雜訊候選分數 (NCS) 追蹤乾淨驗證資料集上的效能，識別和排除雜訊用戶端。該架構包含三個階段：用戶端前剪枝，用於識別潛在的雜訊用戶端並計算其 NCS；用戶端剪枝，用於排除具有最高 NCS 的用戶端百分比；用戶端後剪枝，用於在乾淨用戶端上使用標準 FL 微調全域模型。實證評估顯示 ClipFL 在不同的資料集和雜訊水準中都表現出效能，與現有的 FL 方法相比，能準確識別雜訊用戶端，具有優異的效能、更快的收斂速度和更低的通訊成本。我們的程式碼可在 https://github.com/MMorafah/ClipFL 取得。", "author": "Mahdi Morafah et.al.", "authors": "Mahdi Morafah, Hojin Chang, Chen Chen, Bill Lin", "id": "2411.07391v1", "paper_url": "http://arxiv.org/abs/2411.07391v1", "repo": "https://github.com/mmorafah/clipfl"}}