{"2502.13117": {"publish_time": "2025-02-18", "title": "Performance Evaluation of Large Language Models in Statistical Programming", "paper_summary": "The programming capabilities of large language models (LLMs) have\nrevolutionized automatic code generation and opened new avenues for automatic\nstatistical analysis. However, the validity and quality of these generated\ncodes need to be systematically evaluated before they can be widely adopted.\nDespite their growing prominence, a comprehensive evaluation of statistical\ncode generated by LLMs remains scarce in the literature. In this paper, we\nassess the performance of LLMs, including two versions of ChatGPT and one\nversion of Llama, in the domain of SAS programming for statistical analysis.\nOur study utilizes a set of statistical analysis tasks encompassing diverse\nstatistical topics and datasets. Each task includes a problem description,\ndataset information, and human-verified SAS code. We conduct a comprehensive\nassessment of the quality of SAS code generated by LLMs through human expert\nevaluation based on correctness, effectiveness, readability, executability, and\nthe accuracy of output results. The analysis of rating scores reveals that\nwhile LLMs demonstrate usefulness in generating syntactically correct code,\nthey struggle with tasks requiring deep domain understanding and may produce\nredundant or incorrect results. This study offers valuable insights into the\ncapabilities and limitations of LLMs in statistical programming, providing\nguidance for future advancements in AI-assisted coding systems for statistical\nanalysis.", "paper_summary_zh": "大型語言模型 (LLM) 的程式設計功能徹底改變了自動程式碼生成，並為自動統計分析開啟了新途徑。然而，在廣泛採用這些產生的程式碼之前，需要系統性地評估其有效性和品質。儘管其重要性日益提升，但文獻中對於 LLM 產生的統計程式碼的全面評估仍然稀少。在本文中，我們評估了 LLM 的效能，包括兩個版本的 ChatGPT 和一個版本的 Llama，在統計分析的 SAS 程式設計領域。我們的研究利用了一組涵蓋各種統計主題和資料集的統計分析任務。每個任務都包含問題說明、資料集資訊和經過人工驗證的 SAS 程式碼。我們透過基於正確性、有效性、可讀性、可執行性和輸出結果精確度的專家評估，對 LLM 產生的 SAS 程式碼品質進行全面評估。評分結果的分析顯示，儘管 LLM 在產生語法正確的程式碼方面表現出其效用，但它們在需要深入領域理解的任務中會遇到困難，並且可能會產生冗餘或不正確的結果。本研究提供了 LLM 在統計程式設計中能力和限制的寶貴見解，為統計分析的 AI 輔助編碼系統的未來進展提供指導。", "author": "Xinyi Song et.al.", "authors": "Xinyi Song, Kexin Xie, Lina Lee, Ruizhe Chen, Jared M. Clark, Hao He, Haoran He, Jie Min, Xinlei Zhang, Simin Zheng, Zhiyang Zhang, Xinwei Deng, Yili Hong", "id": "2502.13117v1", "paper_url": "http://arxiv.org/abs/2502.13117v1", "repo": "null"}}