{"2412.02956": {"publish_time": "2024-12-04", "title": "Curriculum-style Data Augmentation for LLM-based Metaphor Detection", "paper_summary": "Recently, utilizing large language models (LLMs) for metaphor detection has\nachieved promising results. However, these methods heavily rely on the\ncapabilities of closed-source LLMs, which come with relatively high inference\ncosts and latency. To address this, we propose a method for metaphor detection\nby fine-tuning open-source LLMs, effectively reducing inference costs and\nlatency with a single inference step. Furthermore, metaphor detection suffers\nfrom a severe data scarcity problem, which hinders effective fine-tuning of\nLLMs. To tackle this, we introduce Curriculum-style Data Augmentation (CDA).\nSpecifically, before fine-tuning, we evaluate the training data to identify\ncorrectly predicted instances for fine-tuning, while incorrectly predicted\ninstances are used as seed data for data augmentation. This approach enables\nthe model to quickly learn simpler knowledge and progressively acquire more\ncomplex knowledge, thereby improving performance incrementally. Experimental\nresults demonstrate that our method achieves state-of-the-art performance\nacross all baselines. Additionally, we provide detailed ablation studies to\nvalidate the effectiveness of CDA.", "paper_summary_zh": "<paragraph>最近，利用大型語言模型 (LLM) 進行隱喻偵測已獲得令人滿意的結果。然而，這些方法嚴重依賴閉源 LLM 的功能，而這會帶來相對高的推論成本和延遲。為了解決這個問題，我們提出了一種透過微調開源 LLM 來進行隱喻偵測的方法，有效地減少了單一推論步驟的推論成本和延遲。此外，隱喻偵測會遭受嚴重的資料稀少問題，這會阻礙 LLM 的有效微調。為了解決這個問題，我們引入了課程式資料擴充 (CDA)。具體來說，在微調之前，我們會評估訓練資料以找出正確預測的微調實例，而錯誤預測的實例則用作資料擴充的種子資料。這種方法讓模型能夠快速學習較簡單的知識，並逐步習得較複雜的知識，從而逐步提升效能。實驗結果證明，我們的模型在所有基準中都達到了最先進的效能。此外，我們提供了詳細的消融研究，以驗證 CDA 的有效性。</paragraph>", "author": "Kaidi Jia et.al.", "authors": "Kaidi Jia, Yanxia Wu, Rongsheng Li", "id": "2412.02956v1", "paper_url": "http://arxiv.org/abs/2412.02956v1", "repo": "null"}}