{"2409.06336": {"publish_time": "2024-09-10", "title": "Towards Agentic AI on Particle Accelerators", "paper_summary": "As particle accelerators grow in complexity, traditional control methods face\nincreasing challenges in achieving optimal performance. This paper envisions a\nparadigm shift: a decentralized multi-agent framework for accelerator control,\npowered by Large Language Models (LLMs) and distributed among autonomous\nagents. We present a proposition of a self-improving decentralized system where\nintelligent agents handle high-level tasks and communication and each agent is\nspecialized control individual accelerator components.\n  This approach raises some questions: What are the future applications of AI\nin particle accelerators? How can we implement an autonomous complex system\nsuch as a particle accelerator where agents gradually improve through\nexperience and human feedback? What are the implications of integrating a\nhuman-in-the-loop component for labeling operational data and providing expert\nguidance? We show two examples, where we demonstrate viability of such\narchitecture.", "paper_summary_zh": "隨著粒子加速器的複雜度不斷提升，傳統的控制方法在達成最佳效能時面臨越來越大的挑戰。本文構想了一種典範轉移：一種由大型語言模型 (LLM) 驅動且分佈在自主代理之間的加速器控制去中心化多代理架構。我們提出了一個自我提升的去中心化系統的命題，其中智慧代理處理高階任務和通訊，且每個代理專門控制個別加速器元件。\n這種方法引發了一些問題：AI 在粒子加速器中的未來應用是什麼？我們如何實作一個自主複雜系統，例如粒子加速器，其中代理會透過經驗和人類回饋逐漸提升？將人類置於迴路中元件以標記作業資料並提供專家指導的影響是什麼？我們展示了兩個範例，說明這種架構的可行性。", "author": "Antonin Sulc et.al.", "authors": "Antonin Sulc, Thorsten Hellert, Raimund Kammering, Hayden Houscher, Jason St. John", "id": "2409.06336v1", "paper_url": "http://arxiv.org/abs/2409.06336v1", "repo": "null"}}