{"2407.05611": {"publish_time": "2024-07-08", "title": "GenFollower: Enhancing Car-Following Prediction with Large Language Models", "paper_summary": "Accurate modeling of car-following behaviors is essential for various\napplications in traffic management and autonomous driving systems. However,\ncurrent approaches often suffer from limitations like high sensitivity to data\nquality and lack of interpretability. In this study, we propose GenFollower, a\nnovel zero-shot prompting approach that leverages large language models (LLMs)\nto address these challenges. We reframe car-following behavior as a language\nmodeling problem and integrate heterogeneous inputs into structured prompts for\nLLMs. This approach achieves improved prediction performance and\ninterpretability compared to traditional baseline models. Experiments on the\nWaymo Open datasets demonstrate GenFollower's superior performance and ability\nto provide interpretable insights into factors influencing car-following\nbehavior. This work contributes to advancing the understanding and prediction\nof car-following behaviors, paving the way for enhanced traffic management and\nautonomous driving systems.", "paper_summary_zh": "準確建模汽車追隨行為對於交通管理和自動駕駛系統中的各種應用至關重要。然而，目前的做法通常會受到諸如對資料品質高度敏感和缺乏可解釋性等限制。在本研究中，我們提出 GenFollower，這是一種新穎的零次學習提示方法，它利用大型語言模型 (LLM) 來應對這些挑戰。我們將汽車追隨行為重新定義為一種語言建模問題，並將異質輸入整合到 LLM 的結構化提示中。與傳統基線模型相比，這種方法實現了改進的預測性能和可解釋性。Waymo Open 資料集上的實驗證明了 GenFollower 的優異性能和提供可解釋見解的能力，這些見解可以影響汽車追隨行為。這項工作有助於推進對汽車追隨行為的理解和預測，為增強交通管理和自動駕駛系統鋪平道路。", "author": "Xianda Chen et.al.", "authors": "Xianda Chen, Mingxing Peng, PakHin Tiu, Yuanfei Wu, Junjie Chen, Meixin Zhu, Xinhu Zheng", "id": "2407.05611v1", "paper_url": "http://arxiv.org/abs/2407.05611v1", "repo": "null"}}