{"2405.07226": {"publish_time": "2024-05-12", "title": "Separable Power of Classical and Quantum Learning Protocols Through the Lens of No-Free-Lunch Theorem", "paper_summary": "The No-Free-Lunch (NFL) theorem, which quantifies problem- and\ndata-independent generalization errors regardless of the optimization process,\nprovides a foundational framework for comprehending diverse learning protocols'\npotential. Despite its significance, the establishment of the NFL theorem for\nquantum machine learning models remains largely unexplored, thereby overlooking\nbroader insights into the fundamental relationship between quantum and\nclassical learning protocols. To address this gap, we categorize a diverse\narray of quantum learning algorithms into three learning protocols designed for\nlearning quantum dynamics under a specified observable and establish their NFL\ntheorem. The exploited protocols, namely Classical Learning Protocols\n(CLC-LPs), Restricted Quantum Learning Protocols (ReQu-LPs), and Quantum\nLearning Protocols (Qu-LPs), offer varying levels of access to quantum\nresources. Our derived NFL theorems demonstrate quadratic reductions in sample\ncomplexity across CLC-LPs, ReQu-LPs, and Qu-LPs, contingent upon the\northogonality of quantum states and the diagonality of observables. We\nattribute this performance discrepancy to the unique capacity of\nquantum-related learning protocols to indirectly utilize information concerning\nthe global phases of non-orthogonal quantum states, a distinctive physical\nfeature inherent in quantum mechanics. Our findings not only deepen our\nunderstanding of quantum learning protocols' capabilities but also provide\npractical insights for the development of advanced quantum learning algorithms.", "paper_summary_zh": "無免費午餐（NFL）定理量化問題和資料無關的概化誤差，而不論最佳化處理，提供一個基礎架構來理解不同的學習協定的潛力。儘管它的重要性，對於量子機器學習模型的 NFL 定理建立仍然在很大程度上未經探索，因此忽略了對量子和經典學習協定之間基本關係的更廣泛見解。為了解決這個差距，我們將各種量子學習演算法分類為三個學習協定，這些協定旨在學習在特定可觀察量下的量子動力學，並建立其 NFL 定理。所利用的協定，即經典學習協定 (CLC-LP)、受限量子學習協定 (ReQu-LP) 和量子學習協定 (Qu-LP)，提供不同層級的量子資源存取。我們推導出的 NFL 定理顯示，在 CLC-LP、ReQu-LP 和 Qu-LP 中，樣本複雜度會以二次方式降低，這取決於量子態的正交性和可觀察量的對角性。我們將這種效能差異歸因於與量子相關的學習協定獨特的能力，可以間接利用有關非正交量子態的全局相位的資訊，這是量子力學中固有的獨特物理特徵。我們的發現不僅加深了我們對量子學習協定能力的理解，也為先進量子學習演算法的開發提供了實用的見解。", "author": "Xinbiao Wang et.al.", "authors": "Xinbiao Wang, Yuxuan Du, Kecheng Liu, Yong Luo, Bo Du, Dacheng Tao", "id": "2405.07226v1", "paper_url": "http://arxiv.org/abs/2405.07226v1", "repo": "null"}}