{"2504.03164": {"publish_time": "2025-04-04", "title": "NuScenes-SpatialQA: A Spatial Understanding and Reasoning Benchmark for Vision-Language Models in Autonomous Driving", "paper_summary": "Recent advancements in Vision-Language Models (VLMs) have demonstrated strong\npotential for autonomous driving tasks. However, their spatial understanding\nand reasoning-key capabilities for autonomous driving-still exhibit significant\nlimitations. Notably, none of the existing benchmarks systematically evaluate\nVLMs' spatial reasoning capabilities in driving scenarios. To fill this gap, we\npropose NuScenes-SpatialQA, the first large-scale ground-truth-based\nQuestion-Answer (QA) benchmark specifically designed to evaluate the spatial\nunderstanding and reasoning capabilities of VLMs in autonomous driving. Built\nupon the NuScenes dataset, the benchmark is constructed through an automated 3D\nscene graph generation pipeline and a QA generation pipeline. The benchmark\nsystematically evaluates VLMs' performance in both spatial understanding and\nreasoning across multiple dimensions. Using this benchmark, we conduct\nextensive experiments on diverse VLMs, including both general and\nspatial-enhanced models, providing the first comprehensive evaluation of their\nspatial capabilities in autonomous driving. Surprisingly, the experimental\nresults show that the spatial-enhanced VLM outperforms in qualitative QA but\ndoes not demonstrate competitiveness in quantitative QA. In general, VLMs still\nface considerable challenges in spatial understanding and reasoning.", "paper_summary_zh": "<paragraph>近年來，視覺語言模型 (VLM) 的進步展現了其在自動駕駛任務中的強大潛力。然而，它們的空間理解和推理能力——自動駕駛的關鍵能力——仍然存在顯著的局限性。值得注意的是，現有的基準測試中沒有一個系統地評估 VLM 在駕駛場景中的空間推理能力。為了填補這一空白，我們提出了 NuScenes-SpatialQA，這是第一個基於真實數據的大規模問答 (QA) 基準測試，專門設計用於評估 VLM 在自動駕駛中的空間理解和推理能力。該基準測試建立在 NuScenes 數據集的基礎上，通過自動化的 3D 場景圖生成流程和問答生成流程構建而成。該基準測試系統地評估了 VLM 在多個維度上的空間理解和推理性能。利用此基準測試，我們對各種 VLM 進行了廣泛的實驗，包括通用模型和空間增強模型，首次全面評估了它們在自動駕駛中的空間能力。令人驚訝的是，實驗結果表明，空間增強的 VLM 在定性問答方面表現出色，但在定量問答方面卻沒有表現出競爭力。總體而言，VLM 在空間理解和推理方面仍然面臨相當大的挑戰。</paragraph>\n", "author": "Kexin Tian et.al.", "authors": "Kexin Tian, Jingrui Mao, Yunlong Zhang, Jiwan Jiang, Yang Zhou, Zhengzhong Tu", "id": "2504.03164v1", "paper_url": "http://arxiv.org/abs/2504.03164v1", "repo": "null"}}