{"2407.13621": {"publish_time": "2024-07-18", "title": "Differential Privacy Mechanisms in Neural Tangent Kernel Regression", "paper_summary": "Training data privacy is a fundamental problem in modern Artificial\nIntelligence (AI) applications, such as face recognition, recommendation\nsystems, language generation, and many others, as it may contain sensitive user\ninformation related to legal issues. To fundamentally understand how privacy\nmechanisms work in AI applications, we study differential privacy (DP) in the\nNeural Tangent Kernel (NTK) regression setting, where DP is one of the most\npowerful tools for measuring privacy under statistical learning, and NTK is one\nof the most popular analysis frameworks for studying the learning mechanisms of\ndeep neural networks. In our work, we can show provable guarantees for both\ndifferential privacy and test accuracy of our NTK regression. Furthermore, we\nconduct experiments on the basic image classification dataset CIFAR10 to\ndemonstrate that NTK regression can preserve good accuracy under a modest\nprivacy budget, supporting the validity of our analysis. To our knowledge, this\nis the first work to provide a DP guarantee for NTK regression.", "paper_summary_zh": "訓練資料隱私是現代人工智慧 (AI) 應用中的一個基本問題，例如人臉辨識、推薦系統、語言生成等等，因為它可能包含與法律問題相關的敏感使用者資訊。為了從根本上了解隱私機制如何在 AI 應用中運作，我們在神經切線核 (NTK) 回歸設定中研究差分隱私 (DP)，其中 DP 是衡量統計學習下隱私的最強大工具之一，而 NTK 是研究深度神經網路學習機制的熱門分析架構之一。在我們的研究中，我們可以為我們的 NTK 回歸展示可證明保證，同時兼顧差分隱私和測試準確性。此外，我們在基本影像分類資料集 CIFAR10 上進行實驗，以證明 NTK 回歸在適度的隱私預算下可以保持良好的準確性，支持我們分析的有效性。據我們所知，這是第一個為 NTK 回歸提供 DP 保證的研究。", "author": "Jiuxiang Gu et.al.", "authors": "Jiuxiang Gu, Yingyu Liang, Zhizhou Sha, Zhenmei Shi, Zhao Song", "id": "2407.13621v1", "paper_url": "http://arxiv.org/abs/2407.13621v1", "repo": "null"}}