{"2409.05732": {"publish_time": "2024-09-09", "title": "Towards Democratizing Multilingual Large Language Models For Medicine Through A Two-Stage Instruction Fine-tuning Approach", "paper_summary": "Open-source, multilingual medical large language models (LLMs) have the\npotential to serve linguistically diverse populations across different regions.\nAdapting generic LLMs for healthcare often requires continual pretraining, but\nthis approach is computationally expensive and sometimes impractical.\nInstruction fine-tuning on a specific task may not always guarantee optimal\nperformance due to the lack of broader domain knowledge that the model needs to\nunderstand and reason effectively in diverse scenarios. To address these\nchallenges, we introduce two multilingual instruction fine-tuning datasets,\nMMed-IFT and MMed-IFT-MC, containing over 200k high-quality medical samples in\nsix languages. We propose a two-stage training paradigm: the first stage\ninjects general medical knowledge using MMed-IFT, while the second stage\nfine-tunes task-specific multiple-choice questions with MMed-IFT-MC. Our method\nachieves competitive results on both English and multilingual benchmarks,\nstriking a balance between computational efficiency and performance. We plan to\nmake our dataset and model weights public at\n\\url{https://github.com/SpassMed/Med-Llama3} in the future.", "paper_summary_zh": "開放原始碼、多語言大型醫學語言模型 (LLM) 具有為不同地區的語言多元化人群服務的潛力。將通用 LLM 適應於醫療保健通常需要持續預訓練，但此方法在運算上很昂貴，有時也不切實際。由於模型在各種情況下理解和有效推理時缺乏更廣泛的領域知識，因此針對特定任務進行的指示微調並不能總是保證最佳效能。為了應對這些挑戰，我們引入了兩個多語言指示微調資料集，即 MMed-IFT 和 MMed-IFT-MC，其中包含六種語言中超過 20 萬個高品質的醫療範例。我們提出一個兩階段訓練範例：第一階段使用 MMed-IFT 注入一般醫療知識，而第二階段使用 MMed-IFT-MC 微調特定任務的多選題。我們的模型在英文和多語言基準測試中皆取得具競爭力的結果，在運算效率和效能之間取得平衡。我們計畫在未來於 \\url{https://github.com/SpassMed/Med-Llama3} 公開我們的資料集和模型權重。", "author": "Meng Zhou et.al.", "authors": "Meng Zhou, Surajsinh Parmar, Anubhav Bhatti", "id": "2409.05732v1", "paper_url": "http://arxiv.org/abs/2409.05732v1", "repo": "null"}}