{"2405.07609": {"publish_time": "2024-05-13", "title": "NoiseBench: Benchmarking the Impact of Real Label Noise on Named Entity Recognition", "paper_summary": "Available training data for named entity recognition (NER) often contains a\nsignificant percentage of incorrect labels for entity types and entity\nboundaries. Such label noise poses challenges for supervised learning and may\nsignificantly deteriorate model quality. To address this, prior work proposed\nvarious noise-robust learning approaches capable of learning from data with\npartially incorrect labels. These approaches are typically evaluated using\nsimulated noise where the labels in a clean dataset are automatically\ncorrupted. However, as we show in this paper, this leads to unrealistic noise\nthat is far easier to handle than real noise caused by human error or\nsemi-automatic annotation. To enable the study of the impact of various types\nof real noise, we introduce NoiseBench, an NER benchmark consisting of clean\ntraining data corrupted with 6 types of real noise, including expert errors,\ncrowdsourcing errors, automatic annotation errors and LLM errors. We present an\nanalysis that shows that real noise is significantly more challenging than\nsimulated noise, and show that current state-of-the-art models for noise-robust\nlearning fall far short of their theoretically achievable upper bound. We\nrelease NoiseBench to the research community.", "paper_summary_zh": "可用於命名實體辨識 (NER) 的訓練資料通常包含大量標記錯誤的實體類型和實體邊界。此類標記雜訊對監督式學習構成挑戰，並可能大幅降低模型品質。為了解決此問題，先前的研究提出各種抗雜訊學習方法，能夠從標記部分錯誤的資料中學習。這些方法通常使用模擬雜訊進行評估，其中乾淨資料集中的標記會自動損毀。然而，正如我們在本文中所示，這會導致不切實際的雜訊，遠比人為錯誤或半自動標註造成的實際雜訊容易處理。為了研究各種實際雜訊類型的影響，我們引入了 NoiseBench，一個 NER 基準，包含以 6 種類型的實際雜訊損毀的乾淨訓練資料，包括專家錯誤、群眾外包錯誤、自動標註錯誤和 LLM 錯誤。我們提出一個分析，顯示實際雜訊比模擬雜訊困難得多，並顯示目前抗雜訊學習的最新模型遠低於其理論上可達到的上限。我們將 NoiseBench 發布給研究社群。", "author": "Elena Merdjanovska et.al.", "authors": "Elena Merdjanovska, Ansar Aynetdinov, Alan Akbik", "id": "2405.07609v1", "paper_url": "http://arxiv.org/abs/2405.07609v1", "repo": "null"}}