{"2501.18107": {"publish_time": "2025-01-30", "title": "Scaling Inference-Efficient Language Models", "paper_summary": "Scaling laws are powerful tools to predict the performance of large language\nmodels. However, current scaling laws fall short of accounting for inference\ncosts. In this work, we first show that model architecture affects inference\nlatency, where models of the same size can have up to 3.5x difference in\nlatency. To tackle this challenge, we modify the Chinchilla scaling laws to\nco-optimize the model parameter count, the number of training tokens, and the\nmodel architecture. Due to the reason that models of similar training loss\nexhibit gaps in downstream evaluation, we also propose a novel method to train\ninference-efficient models based on the revised scaling laws. We perform\nextensive empirical studies to fit and evaluate our inference-aware scaling\nlaws. We vary model parameters from 80M to 1B, training tokens from 1.6B to\n30B, and model shapes, training a total of 63 models. Guided by our\ninference-efficient scaling law and model selection method, we release the\nMorph-1B model, which improves inference latency by 1.8x while maintaining\naccuracy on downstream tasks compared to open-source models, pushing the Pareto\nfrontier of accuracy-latency tradeoff.", "paper_summary_zh": "規模化法則是用來預測大型語言模型效能的強大工具。然而，當前的規模化法則並未考慮推論成本。在這項研究中，我們首先展示模型架構會影響推論延遲，其中相同大小的模型在延遲上可能會有高達 3.5 倍的差異。為了應對這個挑戰，我們修改了 Chinchilla 規模化法則，以共同最佳化模型參數計數、訓練令牌數和模型架構。由於訓練損失類似的模型在下游評估中表現出差距，我們還提出了一種基於修改後的規模化法則訓練推論效率模型的新方法。我們進行廣泛的實證研究，以擬合和評估我們推論感知的規模化法則。我們將模型參數從 80M 變更到 1B，訓練令牌從 1.6B 變更到 30B，以及模型形狀，總共訓練了 63 個模型。在我們的推論效率規模化法則和模型選擇方法的指導下，我們發布了 Morph-1B 模型，與開放原始碼模型相比，它將推論延遲降低了 1.8 倍，同時維持了下游任務的準確性，推動了準確度-延遲權衡的帕累托前緣。", "author": "Song Bian et.al.", "authors": "Song Bian, Minghao Yan, Shivaram Venkataraman", "id": "2501.18107v1", "paper_url": "http://arxiv.org/abs/2501.18107v1", "repo": "null"}}