{"2411.17711": {"publish_time": "2024-11-17", "title": "AnyECG: Foundational Models for Electrocardiogram Analysis", "paper_summary": "Electrocardiogram (ECG), a non-invasive and affordable tool for cardiac\nmonitoring, is highly sensitive in detecting acute heart attacks. However, due\nto the lengthy nature of ECG recordings, numerous machine learning methods have\nbeen developed for automated heart disease detection to reduce human workload.\nDespite these efforts, performance remains suboptimal. A key obstacle is the\ninherent complexity of ECG data, which includes heterogeneity (e.g., varying\nsampling rates), high levels of noise, demographic-related pattern shifts, and\nintricate rhythm-event associations. To overcome these challenges, this paper\nintroduces AnyECG, a foundational model designed to extract robust\nrepresentations from any real-world ECG data. Specifically, a tailored ECG\nTokenizer encodes each fixed-duration ECG fragment into a token and, guided by\nproxy tasks, converts noisy, continuous ECG features into discrete, compact,\nand clinically meaningful local rhythm codes. These codes encapsulate basic\nmorphological, frequency, and demographic information (e.g., sex), effectively\nmitigating signal noise. We further pre-train the AnyECG to learn rhythmic\npattern associations across ECG tokens, enabling the capture of cardiac event\nsemantics. By being jointly pre-trained on diverse ECG data sources, AnyECG is\ncapable of generalizing across a wide range of downstream tasks where ECG\nsignals are recorded from various devices and scenarios. Experimental results\nin anomaly detection, arrhythmia detection, corrupted lead generation, and\nultra-long ECG signal analysis demonstrate that AnyECG learns common ECG\nknowledge from data and significantly outperforms cutting-edge methods in each\nrespective task.", "paper_summary_zh": "心電圖 (ECG) 是一種非侵入性且經濟實惠的心臟監測工具，在偵測急性心肌梗塞方面非常靈敏。然而，由於 ECG 記錄的性質繁瑣，因此已開發出許多機器學習方法進行自動化的心臟病偵測，以減少人力的工作負擔。儘管做出了這些努力，但效能仍然不佳。一個主要的障礙是 ECG 資料的內在複雜性，其中包括異質性（例如，不同的取樣率）、高水準的雜訊、與人口統計資料相關的模式轉變，以及複雜的節律事件關聯。為了克服這些挑戰，本文介紹了 AnyECG，這是一個基礎模型，旨在從任何真實世界的 ECG 資料中提取穩健的表現。具體來說，一個量身打造的 ECG 分詞器將每個固定時段的 ECG 片段編碼成一個代碼，並在代理任務的指導下，將雜訊且連續的 ECG 特徵轉換成離散、緊湊且在臨床上有意義的局部節律代碼。這些代碼涵蓋了基本的形態、頻率和人口統計資料資訊（例如，性別），有效地減輕了訊號雜訊。我們進一步預先訓練 AnyECG 以學習 ECG 代碼中的節律模式關聯，從而能夠擷取心臟事件語義。透過在不同的 ECG 資料來源上進行聯合預先訓練，AnyECG 能夠在 ECG 訊號從各種裝置和場景中記錄下來的廣泛下游任務中進行概化。異常偵測、心律不整偵測、損壞導程產生和超長 ECG 訊號分析的實驗結果表明，AnyECG 從資料中學習了常見的 ECG 知識，並且在每個特定任務中都顯著優於尖端的技術。", "author": "Yue Wang et.al.", "authors": "Yue Wang, Xu Cao, Yaojun Hu, Haochao Ying, James Matthew Rehg, Jimeng Sun, Jian Wu, Jintai Chen", "id": "2411.17711v1", "paper_url": "http://arxiv.org/abs/2411.17711v1", "repo": "null"}}