{"2405.14808": {"publish_time": "2024-05-23", "title": "Implicit Personalization in Language Models: A Systematic Study", "paper_summary": "Implicit Personalization (IP) is a phenomenon of language models inferring a\nuser's background from the implicit cues in the input prompts and tailoring the\nresponse based on this inference. While previous work has touched upon various\ninstances of this problem, there lacks a unified framework to study this\nbehavior. This work systematically studies IP through a rigorous mathematical\nformulation, a multi-perspective moral reasoning framework, and a set of case\nstudies. Our theoretical foundation for IP relies on a structural causal model\nand introduces a novel method, indirect intervention, to estimate the causal\neffect of a mediator variable that cannot be directly intervened upon. Beyond\nthe technical approach, we also introduce a set of moral reasoning principles\nbased on three schools of moral philosophy to study when IP may or may not be\nethically appropriate. Equipped with both mathematical and ethical insights, we\npresent three diverse case studies illustrating the varied nature of the IP\nproblem and offer recommendations for future research. Our code and data are at\nhttps://github.com/jiarui-liu/IP.", "paper_summary_zh": "隱含個性化 (IP) 是語言模型從輸入提示中的隱含線索推斷出使用者的背景，並根據此推論調整回應的一種現象。儘管先前的工作已觸及此問題的各種情況，但仍缺乏統一的架構來研究此行為。這項工作透過嚴謹的數學公式、多觀點的道德推理架構和一組案例研究，系統性地研究 IP。我們對 IP 的理論基礎依賴於結構因果模型，並引入一種新方法，間接介入，來評估無法直接介入的中介變數的因果關係。除了技術方法之外，我們還根據三種道德哲學流派引入了一組道德推理原則，以研究 IP 何時可能或可能不適當。具備數學和道德見解後，我們提出了三個不同的案例研究，說明 IP 問題的性質多樣，並提出未來研究的建議。我們的程式碼和資料在 https://github.com/jiarui-liu/IP。", "author": "Zhijing Jin et.al.", "authors": "Zhijing Jin, Nils Heil, Jiarui Liu, Shehzaad Dhuliawala, Yahang Qi, Bernhard Schölkopf, Rada Mihalcea, Mrinmaya Sachan", "id": "2405.14808v1", "paper_url": "http://arxiv.org/abs/2405.14808v1", "repo": "null"}}