{"2405.19325": {"publish_time": "2024-05-29", "title": "Nearest Neighbor Speculative Decoding for LLM Generation and Attribution", "paper_summary": "Large language models (LLMs) often hallucinate and lack the ability to\nprovide attribution for their generations. Semi-parametric LMs, such as kNN-LM,\napproach these limitations by refining the output of an LM for a given prompt\nusing its nearest neighbor matches in a non-parametric data store. However,\nthese models often exhibit slow inference speeds and produce non-fluent texts.\nIn this paper, we introduce Nearest Neighbor Speculative Decoding (NEST), a\nnovel semi-parametric language modeling approach that is capable of\nincorporating real-world text spans of arbitrary length into the LM generations\nand providing attribution to their sources. NEST performs token-level retrieval\nat each inference step to compute a semi-parametric mixture distribution and\nidentify promising span continuations in a corpus. It then uses an approximate\nspeculative decoding procedure that accepts a prefix of the retrieved span or\ngenerates a new token. NEST significantly enhances the generation quality and\nattribution rate of the base LM across a variety of knowledge-intensive tasks,\nsurpassing the conventional kNN-LM method and performing competitively with\nin-context retrieval augmentation. In addition, NEST substantially improves the\ngeneration speed, achieving a 1.8x speedup in inference time when applied to\nLlama-2-Chat 70B.", "paper_summary_zh": "大型语言模型（LLM）经常出现幻觉，并且缺乏为其生成内容提供归因的能力。半参数语言模型（例如 kNN-LM）通过使用非参数数据存储中与其最邻近的匹配项来优化给定提示的 LM 输出，从而解决这些限制。然而，这些模型通常表现出较慢的推理速度并产生不流利的文本。在本文中，我们介绍了最近邻推测解码（NEST），这是一种新颖的半参数语言建模方法，能够将任意长度的真实文本跨度合并到 LM 生成中，并为其来源提供归因。NEST 在每个推理步骤执行令牌级检索以计算半参数混合分布，并在语料库中识别有希望的跨度延续。然后，它使用近似推测解码程序，该程序接受检索跨度的前缀或生成新令牌。NEST 显着提高了基础 LM 在各种知识密集型任务中的生成质量和归因率，超越了传统的 kNN-LM 方法，并且与上下文检索增强具有竞争力。此外，NEST 大大提高了生成速度，在应用于 Llama-2-Chat 70B 时，推理时间加快了 1.8 倍。", "author": "Minghan Li et.al.", "authors": "Minghan Li, Xilun Chen, Ari Holtzman, Beidi Chen, Jimmy Lin, Wen-tau Yih, Xi Victoria Lin", "id": "2405.19325v1", "paper_url": "http://arxiv.org/abs/2405.19325v1", "repo": "null"}}