{"2411.04925": {"publish_time": "2024-11-07", "title": "StoryAgent: Customized Storytelling Video Generation via Multi-Agent Collaboration", "paper_summary": "The advent of AI-Generated Content (AIGC) has spurred research into automated\nvideo generation to streamline conventional processes. However, automating\nstorytelling video production, particularly for customized narratives, remains\nchallenging due to the complexity of maintaining subject consistency across\nshots. While existing approaches like Mora and AesopAgent integrate multiple\nagents for Story-to-Video (S2V) generation, they fall short in preserving\nprotagonist consistency and supporting Customized Storytelling Video Generation\n(CSVG). To address these limitations, we propose StoryAgent, a multi-agent\nframework designed for CSVG. StoryAgent decomposes CSVG into distinct subtasks\nassigned to specialized agents, mirroring the professional production process.\nNotably, our framework includes agents for story design, storyboard generation,\nvideo creation, agent coordination, and result evaluation. Leveraging the\nstrengths of different models, StoryAgent enhances control over the generation\nprocess, significantly improving character consistency. Specifically, we\nintroduce a customized Image-to-Video (I2V) method, LoRA-BE, to enhance\nintra-shot temporal consistency, while a novel storyboard generation pipeline\nis proposed to maintain subject consistency across shots. Extensive experiments\ndemonstrate the effectiveness of our approach in synthesizing highly consistent\nstorytelling videos, outperforming state-of-the-art methods. Our contributions\ninclude the introduction of StoryAgent, a versatile framework for video\ngeneration tasks, and novel techniques for preserving protagonist consistency.", "paper_summary_zh": "人工智能生成內容 (AIGC) 的出現，刺激了自動化影片生成的研究，以簡化傳統流程。然而，自動化說故事影片製作，特別是客製化敘事，由於在鏡頭間維持主題一致性的複雜性，仍然具有挑戰性。雖然現有的方法，如 Mora 和 AesopAgent，整合多個代理，用於故事到影片 (S2V) 生成，但在保留主角一致性和支援客製化說故事影片生成 (CSVG) 方面仍有不足。為了解決這些限制，我們提出了 StoryAgent，一個專為 CSVG 設計的多代理架構。StoryAgent 將 CSVG 分解成分配給專門代理的不同子任務，反映了專業製作流程。值得注意的是，我們的架構包括故事設計、分鏡產生、影片製作、代理協調和結果評估的代理。利用不同模型的優勢，StoryAgent 增強了對生成過程的控制，顯著改善了角色一致性。具體來說，我們引入了一個客製化的影像到影片 (I2V) 方法，LoRA-BE，以增強鏡頭內的時間一致性，同時提出了一個新穎的分鏡生成管道，以在鏡頭間維持主題一致性。廣泛的實驗證明了我們的方法在合成高度一致的說故事影片方面的有效性，優於最先進的方法。我們的貢獻包括引入了 StoryAgent，一個用於影片生成任務的多功能架構，以及保留主角一致性的新技術。", "author": "Panwen Hu et.al.", "authors": "Panwen Hu, Jin Jiang, Jianqi Chen, Mingfei Han, Shengcai Liao, Xiaojun Chang, Xiaodan Liang", "id": "2411.04925v1", "paper_url": "http://arxiv.org/abs/2411.04925v1", "repo": "null"}}