{"2407.18738": {"publish_time": "2024-07-26", "title": "Towards Generalized Offensive Language Identification", "paper_summary": "The prevalence of offensive content on the internet, encompassing hate speech\nand cyberbullying, is a pervasive issue worldwide. Consequently, it has\ngarnered significant attention from the machine learning (ML) and natural\nlanguage processing (NLP) communities. As a result, numerous systems have been\ndeveloped to automatically identify potentially harmful content and mitigate\nits impact. These systems can follow two approaches; (1) Use publicly available\nmodels and application endpoints, including prompting large language models\n(LLMs) (2) Annotate datasets and train ML models on them. However, both\napproaches lack an understanding of how generalizable they are. Furthermore,\nthe applicability of these systems is often questioned in off-domain and\npractical environments. This paper empirically evaluates the generalizability\nof offensive language detection models and datasets across a novel generalized\nbenchmark. We answer three research questions on generalizability. Our findings\nwill be useful in creating robust real-world offensive language detection\nsystems.", "paper_summary_zh": "網路上的攻擊性內容盛行，包括仇恨言論和網路霸凌，這是全球普遍的問題。因此，它引起了機器學習 (ML) 和自然語言處理 (NLP) 社群的極大關注。結果，已經開發出許多系統來自動識別潛在有害內容並減輕其影響。這些系統可以遵循兩種方法：(1) 使用公開的模型和應用程式端點，包括提示大型語言模型 (LLM)；(2) 對資料集進行註解並在它們上訓練 ML 模型。然而，這兩種方法都不了解它們的概括性。此外，這些系統的適用性常常在非領域和實際環境中受到質疑。本文根據新的概括基準實證評估攻擊性語言偵測模型和資料集的概括性。我們回答了三個關於概括性的研究問題。我們的發現將有助於建立強大的真實世界攻擊性語言偵測系統。", "author": "Alphaeus Dmonte et.al.", "authors": "Alphaeus Dmonte, Tejas Arya, Tharindu Ranasinghe, Marcos Zampieri", "id": "2407.18738v1", "paper_url": "http://arxiv.org/abs/2407.18738v1", "repo": "null"}}