{"2407.07341": {"publish_time": "2024-07-10", "title": "MixSumm: Topic-based Data Augmentation using LLMs for Low-resource Extractive Text Summarization", "paper_summary": "Low-resource extractive text summarization is a vital but heavily\nunderexplored area of research. Prior literature either focuses on abstractive\ntext summarization or prompts a large language model (LLM) like GPT-3 directly\nto generate summaries. In this work, we propose MixSumm for low-resource\nextractive text summarization. Specifically, MixSumm prompts an open-source\nLLM, LLaMA-3-70b, to generate documents that mix information from multiple\ntopics as opposed to generating documents without mixup, and then trains a\nsummarization model on the generated dataset. We use ROUGE scores and L-Eval, a\nreference-free LLaMA-3-based evaluation method to measure the quality of\ngenerated summaries. We conduct extensive experiments on a challenging text\nsummarization benchmark comprising the TweetSumm, WikiHow, and ArXiv/PubMed\ndatasets and show that our LLM-based data augmentation framework outperforms\nrecent prompt-based approaches for low-resource extractive summarization.\nAdditionally, our results also demonstrate effective knowledge distillation\nfrom LLaMA-3-70b to a small BERT-based extractive summarizer.", "paper_summary_zh": "低資源萃取式文字摘要是一個重要但嚴重未被探索的研究領域。先前的文獻要么專注於摘要式文字摘要，要么直接提示大型語言模型 (LLM) 如 GPT-3 來產生摘要。在這項工作中，我們提出 MixSumm 用於低資源萃取式文字摘要。具體來說，MixSumm 提示開源 LLM、LLaMA-3-70b，產生混合來自多個主題的資訊的文件，而不是產生沒有混淆的文件，然後在產生的資料集上訓練摘要模型。我們使用 ROUGE 分數和 L-Eval，一種基於 LLaMA-3 的無參考評估方法來衡量產生摘要的品質。我們在一個具有挑戰性的文字摘要基準上進行廣泛的實驗，包括 TweetSumm、WikiHow 和 ArXiv/PubMed 資料集，並展示我們的基於 LLM 的資料擴充架構優於最近的基於提示的方法，用於低資源萃取式摘要。此外，我們的結果還展示了從 LLaMA-3-70b 到小型基於 BERT 的萃取式摘要器的有效知識提煉。", "author": "Gaurav Sahu et.al.", "authors": "Gaurav Sahu, Issam H. Laradji", "id": "2407.07341v1", "paper_url": "http://arxiv.org/abs/2407.07341v1", "repo": "null"}}