{"2408.03119": {"publish_time": "2024-08-06", "title": "Evaluating the Translation Performance of Large Language Models Based on Euas-20", "paper_summary": "In recent years, with the rapid development of deep learning technology,\nlarge language models (LLMs) such as BERT and GPT have achieved breakthrough\nresults in natural language processing tasks. Machine translation (MT), as one\nof the core tasks of natural language processing, has also benefited from the\ndevelopment of large language models and achieved a qualitative leap. Despite\nthe significant progress in translation performance achieved by large language\nmodels, machine translation still faces many challenges. Therefore, in this\npaper, we construct the dataset Euas-20 to evaluate the performance of large\nlanguage models on translation tasks, the translation ability on different\nlanguages, and the effect of pre-training data on the translation ability of\nLLMs for researchers and developers.", "paper_summary_zh": "近年來，隨著深度學習技術的快速發展，\nBERT 和 GPT 等大型語言模型（LLM）在自然語言處理任務中取得了突破性的\n成果。機器翻譯（MT）作為自然語言處理的核心任務之一，也受益於\n大型語言模型的發展而取得了質的飛躍。儘管大型語言模型在翻譯性能上取得了顯著進展，\n機器翻譯仍然面臨著諸多挑戰。因此，本文構建了 Euas-20 數據集，用於評估大型\n語言模型在翻譯任務上的表現、不同語言的翻譯能力，以及預訓練數據對 LLM 翻譯能力的影響，供研究人員和開發人員使用。", "author": "Yan Huang et.al.", "authors": "Yan Huang, Wei Liu", "id": "2408.03119v1", "paper_url": "http://arxiv.org/abs/2408.03119v1", "repo": "null"}}