{"2407.15475": {"publish_time": "2024-07-22", "title": "A Multi-Level Corroborative Approach for Verification and Validation of Autonomous Robotic Swarms", "paper_summary": "Modelling and characterizing emergent behaviour within a swarm can pose\nsignificant challenges in terms of 'assurance'. Assurance tasks encompass\nadherence to standards, certification processes, and the execution of\nverification and validation (V&V) methods, such as model checking. In this\nstudy, we propose a holistic, multi-level modelling approach for formally\nverifying and validating autonomous robotic swarms, which are defined at the\nmacroscopic formal modelling, low-fidelity simulation, high-fidelity\nsimulation, and real-robot levels. Our formal macroscopic models, used for\nverification, are characterized by data derived from actual simulations,\nensuring both accuracy and traceability across different system models.\nFurthermore, our work combines formal verification with experimental validation\ninvolving real robots. In this way, our corroborative approach for V&V seeks to\nenhance confidence in the evidence, in contrast to employing these methods\nseparately. We explore our approach through a case study focused on a swarm of\nrobots operating within a public cloakroom.", "paper_summary_zh": "模擬和描述群體中出現的行為在「保證」方面可能帶來重大挑戰。保證任務包括遵守標準、認證程序，以及執行驗證和驗證 (V&V) 方法，例如模型檢查。在本研究中，我們提出了一種整體、多層次建模方法，用於正式驗證和驗證自主機器人群體，這些群體定義在巨觀形式化建模、低保真模擬、高保真模擬和真實機器人層級。我們用於驗證的正式巨觀模型的特點是來自實際模擬的數據，確保了不同系統模型之間的準確性和可追溯性。此外，我們的研究將形式化驗證與涉及真實機器人的實驗驗證相結合。通過這種方式，我們用於 V&V 的佐證方法旨在增強對證據的信心，而不是分別採用這些方法。我們通過一個案例研究探討了我們的做法，該案例研究集中在一個在公共衣帽間內運作的機器人群體。", "author": "Dhaminda B. Abeywickrama et.al.", "authors": "Dhaminda B. Abeywickrama, Suet Lee, Chris Bennett, Razanne Abu-Aisheh, Tom Didiot-Cook, Simon Jones, Sabine Hauert, Kerstin Eder", "id": "2407.15475v1", "paper_url": "http://arxiv.org/abs/2407.15475v1", "repo": "null"}}