{"2405.18077": {"publish_time": "2024-05-28", "title": "Design Principles for Falsifiable, Replicable and Reproducible Empirical ML Research", "paper_summary": "Empirical research plays a fundamental role in the machine learning domain.\nAt the heart of impactful empirical research lies the development of clear\nresearch hypotheses, which then shape the design of experiments. The execution\nof experiments must be carried out with precision to ensure reliable results,\nfollowed by statistical analysis to interpret these outcomes. This process is\nkey to either supporting or refuting initial hypotheses. Despite its\nimportance, there is a high variability in research practices across the\nmachine learning community and no uniform understanding of quality criteria for\nempirical research. To address this gap, we propose a model for the empirical\nresearch process, accompanied by guidelines to uphold the validity of empirical\nresearch. By embracing these recommendations, greater consistency, enhanced\nreliability and increased impact can be achieved.", "paper_summary_zh": "經驗研究在機器學習領域中扮演著基礎性的角色。\n在有影響力的經驗研究的核心是明確的研究假設的發展，這進而塑造了實驗的設計。\n實驗的執行必須精確地進行以確保可靠的結果，接著進行統計分析來詮釋這些結果。\n這個程序是支持或反駁最初假設的關鍵。儘管其重要性，\n在機器學習社群中，研究實務存在高度變異，且對於經驗研究的品質標準沒有統一的理解。\n為了解決這個差距，我們提出了一個經驗研究程序模型，並附上維持經驗研究有效性的準則。\n透過採用這些建議，可以達成更佳的一致性、增強的可靠性，並增加影響力。", "author": "Daniel Vranješ et.al.", "authors": "Daniel Vranješ, Oliver Niggemann", "id": "2405.18077v1", "paper_url": "http://arxiv.org/abs/2405.18077v1", "repo": "null"}}