{"2405.20731": {"publish_time": "2024-05-31", "title": "Maximum Temperature Prediction Using Remote Sensing Data Via Convolutional Neural Network", "paper_summary": "Urban heat islands, defined as specific zones exhibiting substantially higher\ntemperatures than their immediate environs, pose significant threats to\nenvironmental sustainability and public health. This study introduces a novel\nmachine-learning model that amalgamates data from the Sentinel-3 satellite,\nmeteorological predictions, and additional remote sensing inputs. The primary\naim is to generate detailed spatiotemporal maps that forecast the peak\ntemperatures within a 24-hour period in Turin. Experimental results validate\nthe model's proficiency in predicting temperature patterns, achieving a Mean\nAbsolute Error (MAE) of 2.09 degrees Celsius for the year 2023 at a resolution\nof 20 meters per pixel, thereby enriching our knowledge of urban climatic\nbehavior. This investigation enhances the understanding of urban microclimates,\nemphasizing the importance of cross-disciplinary data integration, and laying\nthe groundwork for informed policy-making aimed at alleviating the negative\nimpacts of extreme urban temperatures.", "paper_summary_zh": "都市熱島效應是指特定區域的溫度明顯高於周圍環境，對環境永續性與公共健康造成重大威脅。本研究提出一個創新的機器學習模型，結合 Sentinel-3 衛星、氣象預測和額外遙測輸入的資料。主要目的是產生詳細的時空地圖，預測都靈 24 小時內的最高溫度。實驗結果驗證了模型在預測溫度模式方面的熟練度，在 2023 年以每像素 20 公尺解析度達到 2.09 度攝氏的平均絕對誤差 (MAE)，從而豐富了我們對都市氣候行為的認識。此研究增強了對都市微氣候的了解，強調跨領域資料整合的重要性，並為旨在減輕極端都市溫度負面影響的明智政策制定奠定基礎。", "author": "Lorenzo Innocenti et.al.", "authors": "Lorenzo Innocenti, Giacomo Blanco, Luca Barco, Claudio Rossi", "id": "2405.20731v1", "paper_url": "http://arxiv.org/abs/2405.20731v1", "repo": "null"}}