{"2504.12535": {"publish_time": "2025-04-16", "title": "Decision-based AI Visual Navigation for Cardiac Ultrasounds", "paper_summary": "Ultrasound imaging of the heart (echocardiography) is widely used to diagnose\ncardiac diseases. However, obtaining an echocardiogram requires an expert\nsonographer and a high-quality ultrasound imaging device, which are generally\nonly available in hospitals. Recently, AI-based navigation models and\nalgorithms have been used to aid novice sonographers in acquiring the\nstandardized cardiac views necessary to visualize potential disease\npathologies. These navigation systems typically rely on directional guidance to\npredict the necessary rotation of the ultrasound probe. This paper demonstrates\na novel AI navigation system that builds on a decision model for identifying\nthe inferior vena cava (IVC) of the heart. The decision model is trained\noffline using cardiac ultrasound videos and employs binary classification to\ndetermine whether the IVC is present in a given ultrasound video. The\nunderlying model integrates a novel localization algorithm that leverages the\nlearned feature representations to annotate the spatial location of the IVC in\nreal-time. Our model demonstrates strong localization performance on\ntraditional high-quality hospital ultrasound videos, as well as impressive\nzero-shot performance on lower-quality ultrasound videos from a more affordable\nButterfly iQ handheld ultrasound machine. This capability facilitates the\nexpansion of ultrasound diagnostics beyond hospital settings. Currently, the\nguidance system is undergoing clinical trials and is available on the Butterfly\niQ app.", "paper_summary_zh": "<paragraph>心臟超音波成像（心臟超音波檢查）廣泛用於診斷心臟疾病。然而，進行心臟超音波檢查需要專業的超音波操作員和高品質的超音波成像設備，而這些通常只有在醫院才有。近年來，基於 AI 的導航模型和演算法已被用於協助新手超音波操作員獲取必要的標準心臟視圖以觀察潛在的疾病病理。這些導航系統通常依靠方向引導來預測超音波探頭的必要旋轉角度。本文展示了一種新穎的 AI 導航系統，該系統建立在用於識別心臟下腔靜脈 (IVC) 的決策模型之上。該決策模型使用心臟超音波影片進行離線訓練，並採用二元分類法來判斷給定的超音波影片中是否存在 IVC。底層模型整合了一種新穎的定位演算法，該演算法利用學習到的特徵表示來即時標記 IVC 的空間位置。我們的模型在傳統的高品質醫院超音波影片上展現了強大的定位效能，並且在來自更實惠的Butterfly iQ 手持式超音波機的低品質超音波影片上也展現了令人印象深刻的零樣本學習效能。此功能促進了超音波診斷向醫院以外環境的擴展。目前，該引導系統正在進行臨床試驗，並可在 ButterflyiQ 應用程式上使用。</paragraph>\n", "author": "Andy Dimnaku et.al.", "authors": "Andy Dimnaku, Dominic Yurk, Zhiyuan Gao, Arun Padmanabhan, Mandar Aras, Yaser Abu-Mostafa", "id": "2504.12535v1", "paper_url": "http://arxiv.org/abs/2504.12535v1", "repo": "null"}}