{"2407.13709": {"publish_time": "2024-07-18", "title": "Understanding Reference Policies in Direct Preference Optimization", "paper_summary": "Direct Preference Optimization (DPO) has become a widely used training method\nfor the instruction fine-tuning of large language models (LLMs). In this work,\nwe explore an under-investigated aspect of DPO - its dependency on the\nreference model or policy. Such reference policies, typically instantiated as\nthe model to be further fine-tuned, are important since they can impose an\nupper limit on DPO's effectiveness. Therefore, we address three related\nresearch questions in this work. First, we explore the optimal strength of the\nKL-divergence constraint in DPO, which penalizes deviations from the reference\npolicy, and find that DPO is sensitive to this strength. Next, we examine the\nnecessity of reference policies for instruction fine-tuning by providing both\ntheoretical and empirical comparisons between DPO and related learning\nobjectives, demonstrating DPO's superiority. Additionally, we investigate\nwhether DPO benefits from stronger reference policies, finding that a stronger\nreference policy can lead to improved performance, but only when it is similar\nto the model being fine-tuned. Our findings highlight the confounding role of\nreference policies in DPO and offer insights for best practices, while also\nidentifying open research questions for future studies.", "paper_summary_zh": "直接偏好優化（DPO）已成為廣泛使用的訓練方法，用於大型語言模型（LLM）的指令微調。在這項工作中，我們探討了 DPO 一個未經調查的面向 - 它對參考模型或政策的依賴性。此類參考政策通常被例示為要進一步微調的模型，它們很重要，因為它們可以對 DPO 的有效性施加上限。因此，我們在這項工作中解決了三個相關的研究問題。首先，我們探討了 DPO 中 KL-divergence 約束的最佳強度，它會懲罰與參考政策的偏差，並發現 DPO 對此強度很敏感。接下來，我們透過提供 DPO 與相關學習目標之間的理論和實證比較來檢驗指令微調對參考政策的必要性，證明了 DPO 的優越性。此外，我們探討了 DPO 是否受益於更強的參考政策，發現更強的參考政策可以帶來更好的效能，但僅當它類似於要微調的模型時。我們的研究結果突出了參考政策在 DPO 中的混淆作用，並為最佳實務提供了見解，同時也找出未來研究的開放式研究問題。", "author": "Yixin Liu et.al.", "authors": "Yixin Liu, Pengfei Liu, Arman Cohan", "id": "2407.13709v1", "paper_url": "http://arxiv.org/abs/2407.13709v1", "repo": "null"}}