{"2412.07880": {"publish_time": "2024-12-10", "title": "Towards Foundation-model-based Multiagent System to Accelerate AI for Social Impact", "paper_summary": "AI for social impact (AI4SI) offers significant potential for addressing\ncomplex societal challenges in areas such as public health, agriculture,\neducation, conservation, and public safety. However, existing AI4SI research is\noften labor-intensive and resource-demanding, limiting its accessibility and\nscalability; the standard approach is to design a (base-level) system tailored\nto a specific AI4SI problem. We propose the development of a novel meta-level\nmulti-agent system designed to accelerate the development of such base-level\nsystems, thereby reducing the computational cost and the burden on social\nimpact domain experts and AI researchers. Leveraging advancements in foundation\nmodels and large language models, our proposed approach focuses on resource\nallocation problems providing help across the full AI4SI pipeline from problem\nformulation over solution design to impact evaluation. We highlight the ethical\nconsiderations and challenges inherent in deploying such systems and emphasize\nthe importance of a human-in-the-loop approach to ensure the responsible and\neffective application of AI systems.", "paper_summary_zh": "人工智慧對社會影響（AI4SI）提供了巨大的潛力，用於解決複雜的社會挑戰，例如公共衛生、農業、教育、保育和公共安全。然而，現有的 AI4SI 研究通常需要大量人力和資源，這限制了其可及性和可擴展性；標準方法是設計一個針對特定 AI4SI 問題量身打造的（基礎層級）系統。我們建議開發一個新穎的元層級多代理系統，旨在加速此類基礎層級系統的開發，從而降低運算成本和社會影響領域專家與 AI 研究人員的負擔。透過運用基礎模型和大型語言模型的進展，我們建議的方法專注於資源配置問題，提供從問題建構、解決方案設計到影響評估的完整 AI4SI 管線的協助。我們強調部署此類系統時固有的道德考量和挑戰，並強調人機協作方法的重要性，以確保負責任且有效地應用 AI 系統。", "author": "Yunfan Zhao et.al.", "authors": "Yunfan Zhao, Niclas Boehmer, Aparna Taneja, Milind Tambe", "id": "2412.07880v2", "paper_url": "http://arxiv.org/abs/2412.07880v2", "repo": "null"}}