{"2405.15882": {"publish_time": "2024-05-24", "title": "Risk Factor Identification In Osteoporosis Using Unsupervised Machine Learning Techniques", "paper_summary": "In this study, the reliability of identified risk factors associated with\nosteoporosis is investigated using a new clustering-based method on electronic\nmedical records. This study proposes utilizing a new CLustering Iterations\nFramework (CLIF) that includes an iterative clustering framework that can adapt\nany of the following three components: clustering, feature selection, and\nprincipal feature identification. The study proposes using Wasserstein distance\nto identify principal features, borrowing concepts from the optimal transport\ntheory. The study also suggests using a combination of ANOVA and ablation tests\nto select influential features from a data set. Some risk factors presented in\nexisting works are endorsed by our identified significant clusters, while the\nreliability of some other risk factors is weakened.", "paper_summary_zh": "本研究利用電子病歷中基於新群集的方法，探討已識別之骨質疏鬆症相關風險因子的可靠性。本研究提出利用新的群集迭代架構 (CLIF)，其中包含一個迭代群集架構，可調整以下三項組成：群集、特徵選擇和主要特徵識別。本研究提出使用 Wasserstein 距離來識別主要特徵，借用最優傳輸理論中的概念。本研究還建議使用 ANOVA 和消融測試的組合，從資料集中選擇有影響力的特徵。現有研究中呈現的某些風險因子受到我們識別出的顯著群集的認可，而某些其他風險因子的可靠性則被削弱。", "author": "Mikayla Calitis et.al.", "authors": "Mikayla Calitis", "id": "2405.15882v1", "paper_url": "http://arxiv.org/abs/2405.15882v1", "repo": "null"}}