{"2410.23678": {"publish_time": "2024-10-31", "title": "Pseudo-Conversation Injection for LLM Goal Hijacking", "paper_summary": "Goal hijacking is a type of adversarial attack on Large Language Models\n(LLMs) where the objective is to manipulate the model into producing a\nspecific, predetermined output, regardless of the user's original input. In\ngoal hijacking, an attacker typically appends a carefully crafted malicious\nsuffix to the user's prompt, which coerces the model into ignoring the user's\noriginal input and generating the target response. In this paper, we introduce\na novel goal hijacking attack method called Pseudo-Conversation Injection,\nwhich leverages the weaknesses of LLMs in role identification within\nconversation contexts. Specifically, we construct the suffix by fabricating\nresponses from the LLM to the user's initial prompt, followed by a prompt for a\nmalicious new task. This leads the model to perceive the initial prompt and\nfabricated response as a completed conversation, thereby executing the new,\nfalsified prompt. Following this approach, we propose three Pseudo-Conversation\nconstruction strategies: Targeted Pseudo-Conversation, Universal\nPseudo-Conversation, and Robust Pseudo-Conversation. These strategies are\ndesigned to achieve effective goal hijacking across various scenarios. Our\nexperiments, conducted on two mainstream LLM platforms including ChatGPT and\nQwen, demonstrate that our proposed method significantly outperforms existing\napproaches in terms of attack effectiveness.", "paper_summary_zh": "目標劫持是一種針對大型語言模型 (LLM) 的對抗性攻擊類型，其目標是操縱模型產生特定、預先確定的輸出，而不管使用者的原始輸入為何。在目標劫持中，攻擊者通常會將精心製作的惡意字尾附加到使用者的提示中，這會強迫模型忽略使用者的原始輸入並產生目標回應。在本文中，我們介紹了一種稱為偽對話注入的新型目標劫持攻擊方法，它利用了 LLM 在對話語境中角色識別方面的弱點。具體來說，我們通過製造 LLM 對使用者初始提示的回應來構建字尾，然後提示一個惡意新任務。這會導致模型將初始提示和虛構的回應視為已完成的對話，從而執行新的、虛假的提示。遵循這種方法，我們提出了三種偽對話建構策略：目標偽對話、通用偽對話和強健偽對話。這些策略旨在在各種場景中實現有效的目標劫持。我們的實驗在包括 ChatGPT 和 Qwen 在內的兩個主流 LLM 平台上進行，證明我們提出的方法在攻擊有效性方面顯著優於現有方法。", "author": "Zheng Chen et.al.", "authors": "Zheng Chen, Buhui Yao", "id": "2410.23678v1", "paper_url": "http://arxiv.org/abs/2410.23678v1", "repo": "null"}}