{"2408.12163": {"publish_time": "2024-08-22", "title": "Preference-Guided Reflective Sampling for Aligning Language Models", "paper_summary": "Large language models (LLMs) are aligned with human preferences by\nreinforcement learning from human feedback (RLHF). Effective data sampling is\ncrucial for RLHF, as it determines the efficiency of model training, ensuring\nthat models learn from the informative samples. To achieve better data\ngeneration, we propose a new sampling method called Preference-Guided\nReflective Sampling (PRS). PRS frames the response generation as an\noptimization process to the explicitly specified user preference described in\nnatural language. It employs a tree-based generation framework to enable an\nefficient sampling process, which guides the direction of generation through\npreference and better explores the sampling space with adaptive\nself-refinement. Notably, PRS can align LLMs to diverse preferences. We study\npreference-controlled text generation for instruction following and\nkeyword-focused document summarization. Our findings indicate that PRS, across\ndifferent LLM policies, generates training data with much higher rewards than\nstrong baselines. PRS also excels in post-RL training.", "paper_summary_zh": "大型語言模型 (LLM) 透過人類回饋強化學習 (RLHF) 與人類偏好保持一致。有效的資料抽樣對於 RLHF 至關重要，因為它決定了模型訓練的效率，確保模型從有意義的樣本中學習。為了獲得更好的資料生成，我們提出了一種新的抽樣方法，稱為偏好引導反射抽樣 (PRS)。PRS 將回應生成構建為一個最佳化過程，以自然語言描述明確指定的使用者偏好。它採用基於樹狀結構的生成架構，以實現有效率的抽樣過程，透過偏好引導生成方向，並透過適應性自我精進，更好地探索抽樣空間。值得注意的是，PRS 可以將 LLM 與不同的偏好保持一致。我們研究了偏好控制文本生成，用於指令遵循和關鍵字焦點文件摘要。我們的研究結果表明，PRS 在不同的 LLM 政策中，產生的訓練資料獎勵遠高於強大的基準。PRS 在 RL 後訓練中也表現出色。", "author": "Hai Ye et.al.", "authors": "Hai Ye, Hwee Tou Ng", "id": "2408.12163v1", "paper_url": "http://arxiv.org/abs/2408.12163v1", "repo": "null"}}