{"2404.17749": {"publish_time": "2024-04-27", "title": "UMass-BioNLP at MEDIQA-M3G 2024: DermPrompt -- A Systematic Exploration of Prompt Engineering with GPT-4V for Dermatological Diagnosis", "paper_summary": "This paper presents our team's participation in the MEDIQA-ClinicalNLP2024\nshared task B. We present a novel approach to diagnosing clinical dermatology\ncases by integrating large multimodal models, specifically leveraging the\ncapabilities of GPT-4V under a retriever and a re-ranker framework. Our\ninvestigation reveals that GPT-4V, when used as a retrieval agent, can\naccurately retrieve the correct skin condition 85% of the time using\ndermatological images and brief patient histories. Additionally, we empirically\nshow that Naive Chain-of-Thought (CoT) works well for retrieval while Medical\nGuidelines Grounded CoT is required for accurate dermatological diagnosis.\nFurther, we introduce a Multi-Agent Conversation (MAC) framework and show its\nsuperior performance and potential over the best CoT strategy. The experiments\nsuggest that using naive CoT for retrieval and multi-agent conversation for\ncritique-based diagnosis, GPT-4V can lead to an early and accurate diagnosis of\ndermatological conditions. The implications of this work extend to improving\ndiagnostic workflows, supporting dermatological education, and enhancing\npatient care by providing a scalable, accessible, and accurate diagnostic tool.", "paper_summary_zh": "本文介紹了我們團隊參與 MEDIQA-ClinicalNLP2024 共享任務 B 的情況。我們提出了一種診斷臨床皮膚科病例的新方法，方法是整合大型多模態模型，特別是在檢索和重新排序架構下利用 GPT-4V 的功能。我們的調查顯示，GPT-4V 在用作檢索代理時，使用皮膚病學影像和簡要的病歷，可以準確檢索出正確的皮膚狀況，準確率高達 85%。此外，我們經驗性地表明，朴素的思考鏈 (CoT) 適用於檢索，而醫療指導基礎 CoT 則適用於準確的皮膚病學診斷。此外，我們引入了多代理對話 (MAC) 架構，並展示了其優異的效能和潛力，優於最佳的 CoT 策略。實驗表明，使用朴素的 CoT 進行檢索，並使用多代理對話進行基於批判的診斷，GPT-4V 可以對皮膚科狀況進行早期且準確的診斷。這項工作的意義在於改善診斷工作流程、支援皮膚科教育以及透過提供可擴充、可存取且準確的診斷工具來提升病患照護。", "author": "Parth Vashisht et.al.", "authors": "Parth Vashisht, Abhilasha Lodha, Mukta Maddipatla, Zonghai Yao, Avijit Mitra, Zhichao Yang, Junda Wang, Sunjae Kwon, Hong Yu", "id": "2404.17749v1", "paper_url": "http://arxiv.org/abs/2404.17749v1", "repo": "https://github.com/parth166/m3g-clinicaldermatology"}}