{"2410.08069": {"publish_time": "2024-10-10", "title": "Unlearning-based Neural Interpretations", "paper_summary": "Gradient-based interpretations often require an anchor point of comparison to\navoid saturation in computing feature importance. We show that current\nbaselines defined using static functions--constant mapping, averaging or\nblurring--inject harmful colour, texture or frequency assumptions that deviate\nfrom model behaviour. This leads to accumulation of irregular gradients,\nresulting in attribution maps that are biased, fragile and manipulable.\nDeparting from the static approach, we propose UNI to compute an (un)learnable,\ndebiased and adaptive baseline by perturbing the input towards an unlearning\ndirection of steepest ascent. Our method discovers reliable baselines and\nsucceeds in erasing salient features, which in turn locally smooths the\nhigh-curvature decision boundaries. Our analyses point to unlearning as a\npromising avenue for generating faithful, efficient and robust interpretations.", "paper_summary_zh": "基於梯度的詮釋通常需要一個比較錨點來避免在計算特徵重要性時飽和。我們顯示目前使用靜態函數定義的基準線（恆定映射、平均或模糊）會注入有害的顏色、紋理或頻率假設，這些假設會偏離模型行為。這會導致不規則梯度的累積，進而產生有偏差、脆弱且可操縱的歸因圖。我們跳脫靜態方法，提出 UNI 來計算一個（不可）學習、去偏且自適應的基準線，方法是朝向最陡上升的取消學習方向擾動輸入。我們的模型發現可靠的基準線，並成功消除顯著特徵，進而局部平滑高曲率決策邊界。我們的分析指出取消學習是一個有希望的途徑，可以產生忠實、有效且強健的詮釋。", "author": "Ching Lam Choi et.al.", "authors": "Ching Lam Choi, Alexandre Duplessis, Serge Belongie", "id": "2410.08069v1", "paper_url": "http://arxiv.org/abs/2410.08069v1", "repo": "null"}}