{"2408.05738": {"publish_time": "2024-08-11", "title": "Language-Informed Beam Search Decoding for Multilingual Machine Translation", "paper_summary": "Beam search decoding is the de-facto method for decoding auto-regressive\nNeural Machine Translation (NMT) models, including multilingual NMT where the\ntarget language is specified as an input. However, decoding multilingual NMT\nmodels commonly produces ``off-target'' translations -- yielding translation\noutputs not in the intended language. In this paper, we first conduct an error\nanalysis of off-target translations for a strong multilingual NMT model and\nidentify how these decodings are produced during beam search. We then propose\nLanguage-informed Beam Search (LiBS), a general decoding algorithm\nincorporating an off-the-shelf Language Identification (LiD) model into beam\nsearch decoding to reduce off-target translations. LiBS is an inference-time\nprocedure that is NMT-model agnostic and does not require any additional\nparallel data. Results show that our proposed LiBS algorithm on average\nimproves +1.1 BLEU and +0.9 BLEU on WMT and OPUS datasets, and reduces\noff-target rates from 22.9\\% to 7.7\\% and 65.8\\% to 25.3\\% respectively.", "paper_summary_zh": "光束搜尋解碼是解碼自迴歸神經機器翻譯 (NMT) 模型的事實方法，包括多語言 NMT，其中目標語言指定為輸入。然而，解碼多語言 NMT 模型通常會產生「離題」翻譯，產生非預期語言的翻譯輸出。在本文中，我們首先對強大的多語言 NMT 模型的離題翻譯進行錯誤分析，並找出這些解碼是如何在光束搜尋期間產生的。然後，我們提出語言引導光束搜尋 (LiBS)，這是一種通用解碼演算法，將現成的語言識別 (LiD) 模型納入光束搜尋解碼，以減少離題翻譯。LiBS 是一種推論時間程序，與 NMT 模型無關，且不需要任何額外的平行資料。結果顯示，我們提出的 LiBS 演算法平均在 WMT 和 OPUS 資料集上分別提升 +1.1 BLEU 和 +0.9 BLEU，並將離題率從 22.9% 降低到 7.7%，以及從 65.8% 降低到 25.3%。", "author": "Yilin Yang et.al.", "authors": "Yilin Yang, Stefan Lee, Prasad Tadepalli", "id": "2408.05738v1", "paper_url": "http://arxiv.org/abs/2408.05738v1", "repo": "https://github.com/yilinyang7/fairseq_multi_fix"}}