{"2412.20822": {"publish_time": "2024-12-30", "title": "Fine-Tuning TransMorph with Gradient Correlation for Anatomical Alignment", "paper_summary": "Unsupervised deep learning is a promising method in brain MRI registration to\nreduce the reliance on anatomical labels, while still achieving anatomically\naccurate transformations. For the Learn2Reg2024 LUMIR challenge, we propose\nfine-tuning of the pre-trained TransMorph model to improve the convergence\nstability as well as the deformation smoothness. The former is achieved through\nthe FAdam optimizer, and consistency in structural changes is incorporated\nthrough the addition of gradient correlation in the similarity measure,\nimproving anatomical alignment. The results show slight improvements in the\nDice and HdDist95 scores, and a notable reduction in the NDV compared to the\nbaseline TransMorph model. These are also confirmed by inspecting the\nboundaries of the tissue. Our proposed method highlights the effectiveness of\nincluding Gradient Correlation to achieve smoother and structurally consistent\ndeformations for interpatient brain MRI registration.", "paper_summary_zh": "無監督深度學習是一種腦部 MRI 配準中很有前景的方法，它可以減少對解剖標籤的依賴，同時仍能實現解剖學上準確的轉換。對於 Learn2Reg2024 LUMIR 挑戰，我們建議微調預訓練的 TransMorph 模型，以改善收斂穩定性以及變形平滑度。前者是透過 FAdam 最佳化器實現的，而結構變化的一致性則透過在相似性測量中加入梯度相關性來納入，進而改善解剖對齊。結果顯示，與基準 TransMorph 模型相比，Dice 和 HdDist95 分數略有改善，而 NDV 則顯著降低。這些也透過檢查組織的邊界得到證實。我們提出的方法突顯了納入梯度相關性以實現更平滑且結構一致的變形，對於患者間腦部 MRI 配準的有效性。", "author": "Lukas Förner et.al.", "authors": "Lukas Förner, Kartikay Tehlan, Thomas Wendler", "id": "2412.20822v1", "paper_url": "http://arxiv.org/abs/2412.20822v1", "repo": "null"}}