{"2404.17391": {"publish_time": "2024-04-26", "title": "M3BAT: Unsupervised Domain Adaptation for Multimodal Mobile Sensing with Multi-Branch Adversarial Training", "paper_summary": "Over the years, multimodal mobile sensing has been used extensively for\ninferences regarding health and well being, behavior, and context. However, a\nsignificant challenge hindering the widespread deployment of such models in\nreal world scenarios is the issue of distribution shift. This is the phenomenon\nwhere the distribution of data in the training set differs from the\ndistribution of data in the real world, the deployment environment. While\nextensively explored in computer vision and natural language processing, and\nwhile prior research in mobile sensing briefly addresses this concern, current\nwork primarily focuses on models dealing with a single modality of data, such\nas audio or accelerometer readings, and consequently, there is little research\non unsupervised domain adaptation when dealing with multimodal sensor data. To\naddress this gap, we did extensive experiments with domain adversarial neural\nnetworks (DANN) showing that they can effectively handle distribution shifts in\nmultimodal sensor data. Moreover, we proposed a novel improvement over DANN,\ncalled M3BAT, unsupervised domain adaptation for multimodal mobile sensing with\nmulti-branch adversarial training, to account for the multimodality of sensor\ndata during domain adaptation with multiple branches. Through extensive\nexperiments conducted on two multimodal mobile sensing datasets, three\ninference tasks, and 14 source-target domain pairs, including both regression\nand classification, we demonstrate that our approach performs effectively on\nunseen domains. Compared to directly deploying a model trained in the source\ndomain to the target domain, the model shows performance increases up to 12%\nAUC (area under the receiver operating characteristics curves) on\nclassification tasks, and up to 0.13 MAE (mean absolute error) on regression\ntasks.", "paper_summary_zh": "", "author": "Lakmal Meegahapola et.al.", "authors": "Lakmal Meegahapola,Hamza Hassoune,Daniel Gatica-Perez", "id": "2404.17391v1", "paper_url": "http://arxiv.org/abs/2404.17391v1", "repo": "null"}}