{"2412.06581": {"publish_time": "2024-12-09", "title": "EmoSpeech: A Corpus of Emotionally Rich and Contextually Detailed Speech Annotations", "paper_summary": "Advances in text-to-speech (TTS) technology have significantly improved the\nquality of generated speech, closely matching the timbre and intonation of the\ntarget speaker. However, due to the inherent complexity of human emotional\nexpression, the development of TTS systems capable of controlling subtle\nemotional differences remains a formidable challenge. Existing emotional speech\ndatabases often suffer from overly simplistic labelling schemes that fail to\ncapture a wide range of emotional states, thus limiting the effectiveness of\nemotion synthesis in TTS applications. To this end, recent efforts have\nfocussed on building databases that use natural language annotations to\ndescribe speech emotions. However, these approaches are costly and require more\nemotional depth to train robust systems. In this paper, we propose a novel\nprocess aimed at building databases by systematically extracting emotion-rich\nspeech segments and annotating them with detailed natural language descriptions\nthrough a generative model. This approach enhances the emotional granularity of\nthe database and significantly reduces the reliance on costly manual\nannotations by automatically augmenting the data with high-level language\nmodels. The resulting rich database provides a scalable and economically viable\nsolution for developing a more nuanced and dynamic basis for developing\nemotionally controlled TTS systems.", "paper_summary_zh": "文字轉語音 (TTS) 技術的進展顯著提升了合成語音的品質，能緊密貼合目標說話者的音色和語調。然而，由於人類情緒表達的複雜性，開發出能控制細微情緒差異的 TTS 系統仍然是一項艱鉅的挑戰。現有的情緒化語音資料庫常常採用過於簡化的標記方案，無法捕捉廣泛的情緒狀態，因此限制了 TTS 應用中情緒合成的有效性。為了解決這個問題，最近的研究專注於建立使用自然語言註解來描述語音情緒的資料庫。然而，這些方法成本高昂，而且需要更多的情緒深度來訓練強健的系統。在本文中，我們提出一個新的流程，旨在透過系統性地萃取情緒豐富的語音片段，並透過生成模型為其加上詳細的自然語言描述，來建立資料庫。這種方法增強了資料庫的情緒粒度，並透過自動使用高階語言模型來擴充資料，大幅降低了對昂貴的人工註解的依賴。產生的豐富資料庫提供了一個可擴充且經濟可行的解決方案，用於建立一個更細緻且動態的基礎，來開發受情緒控制的 TTS 系統。", "author": "Weizhen Bian et.al.", "authors": "Weizhen Bian, Yubo Zhou, Kaitai Zhang, Xiaohan Gu", "id": "2412.06581v1", "paper_url": "http://arxiv.org/abs/2412.06581v1", "repo": "null"}}