{"2411.08464": {"publish_time": "2024-11-13", "title": "Crystal Structure Generation Based On Material Properties", "paper_summary": "The discovery of new materials is very important to the field of materials\nscience. When researchers explore new materials, they often have expected\nperformance requirements for their crystal structure. In recent years,\ndata-driven methods have made great progress in the direction plane of crystal\nstructure generation, but there is still a lack of methods that can effectively\nmap material properties to crystal structure. In this paper, we propose a\nCrystal DiT model to generate the crystal structure from the expected material\nproperties by embedding the material properties and combining the symmetry\ninformation predicted by the large language model. Experimental verification\nshows that our proposed method has good performance.", "paper_summary_zh": "新材料的發現對於材料科學領域非常重要。當研究人員探索新材料時，他們通常對其晶體結構有預期的性能要求。近年來，數據驅動的方法在晶體結構生成的晶面方向取得了很大進展，但仍然缺乏能夠有效將材料屬性映射到晶體結構的方法。在本文中，我們提出一個 Crystal DiT 模型，通過嵌入材料屬性並結合大型語言模型預測的對稱性信息，從預期的材料屬性生成晶體結構。實驗驗證表明，我們提出的方法具有良好的性能。", "author": "Chao Huang et.al.", "authors": "Chao Huang, JiaHui Chen, HongRui Liang, ChunYan Chen, Chen Chen", "id": "2411.08464v1", "paper_url": "http://arxiv.org/abs/2411.08464v1", "repo": "null"}}