{"2406.03893": {"publish_time": "2024-06-06", "title": "How Good is Zero-Shot MT Evaluation for Low Resource Indian Languages?", "paper_summary": "While machine translation evaluation has been studied primarily for\nhigh-resource languages, there has been a recent interest in evaluation for\nlow-resource languages due to the increasing availability of data and models.\nIn this paper, we focus on a zero-shot evaluation setting focusing on\nlow-resource Indian languages, namely Assamese, Kannada, Maithili, and Punjabi.\nWe collect sufficient Multi-Dimensional Quality Metrics (MQM) and Direct\nAssessment (DA) annotations to create test sets and meta-evaluate a plethora of\nautomatic evaluation metrics. We observe that even for learned metrics, which\nare known to exhibit zero-shot performance, the Kendall Tau and Pearson\ncorrelations with human annotations are only as high as 0.32 and 0.45.\nSynthetic data approaches show mixed results and overall do not help close the\ngap by much for these languages. This indicates that there is still a long way\nto go for low-resource evaluation.", "paper_summary_zh": "儘管機器翻譯評估主要針對高資源語言進行研究，但由於資料和模型的可用性增加，最近開始有人關注低資源語言的評估。在本文中，我們專注於零次評估設定，重點放在低資源印度語言，即阿薩姆語、卡納達語、邁蒂利語和旁遮普語。我們收集足夠的多維度品質指標 (MQM) 和直接評估 (DA) 標註，以建立測試集並對大量自動評估指標進行元評估。我們觀察到，即使對於已學習的指標（已知會表現出零次效能），與人類標註的 Kendall Tau 和 Pearson 相關性也僅高達 0.32 和 0.45。合成資料方法顯示出不同的結果，而且整體而言，對於這些語言並未縮小差距太多。這表示低資源評估仍有很長一段路要走。", "author": "Anushka Singh et.al.", "authors": "Anushka Singh, Ananya B. Sai, Raj Dabre, Ratish Puduppully, Anoop Kunchukuttan, Mitesh M Khapra", "id": "2406.03893v1", "paper_url": "http://arxiv.org/abs/2406.03893v1", "repo": "null"}}