{"2410.23578": {"publish_time": "2024-10-31", "title": "Automating Quantum Software Maintenance: Flakiness Detection and Root Cause Analysis", "paper_summary": "Flaky tests, which pass or fail inconsistently without code changes, are a\nmajor challenge in software engineering in general and in quantum software\nengineering in particular due to their complexity and probabilistic nature,\nleading to hidden issues and wasted developer effort.\n  We aim to create an automated framework to detect flaky tests in quantum\nsoftware and an extended dataset of quantum flaky tests, overcoming the\nlimitations of manual methods.\n  Building on prior manual analysis of 14 quantum software repositories, we\nexpanded the dataset and automated flaky test detection using transformers and\ncosine similarity. We conducted experiments with Large Language Models (LLMs)\nfrom the OpenAI GPT and Meta LLaMA families to assess their ability to detect\nand classify flaky tests from code and issue descriptions.\n  Embedding transformers proved effective: we identified 25 new flaky tests,\nexpanding the dataset by 54%. Top LLMs achieved an F1-score of 0.8871 for\nflakiness detection but only 0.5839 for root cause identification.\n  We introduced an automated flaky test detection framework using machine\nlearning, showing promising results but highlighting the need for improved root\ncause detection and classification in large quantum codebases. Future work will\nfocus on improving detection techniques and developing automatic flaky test\nfixes.", "paper_summary_zh": "不穩定的測試，在沒有代碼變更的情況下通過或失敗，是軟體工程中的一大挑戰，特別是在量子軟體工程中，由於其複雜性和機率性質，導致隱藏的問題和浪費開發人員的精力。\n我們旨在為量子軟體中的不穩定測試創建一個自動化框架和一個擴展的不穩定量子測試資料集，克服手動方法的限制。\n建立在先前對 14 個量子軟體儲存庫的手動分析之上，我們擴展了資料集，並使用Transformer和餘弦相似度自動化了不穩定測試的偵測。我們使用 OpenAI GPT 和 Meta LLaMA 家族的大語言模型 (LLM) 進行了實驗，以評估它們從代碼和問題描述中偵測和分類不穩定測試的能力。\n嵌入Transformer被證明是有效的：我們識別出 25 個新的不穩定測試，將資料集擴展了 54%。頂級 LLM 在不穩定性偵測中達到了 0.8871 的 F1 分數，但在根本原因識別中僅達到了 0.5839。\n我們使用機器學習引入了一個自動化不穩定測試偵測框架，展示了有希望的結果，但強調了在大型量子程式碼庫中改進根本原因偵測和分類的必要性。未來的研究將重點放在改進偵測技術和開發自動化不穩定測試修復上。", "author": "Janakan Sivaloganathan et.al.", "authors": "Janakan Sivaloganathan, Ainaz Jamshidi, Andriy Miranskyy, Lei Zhang", "id": "2410.23578v1", "paper_url": "http://arxiv.org/abs/2410.23578v1", "repo": "null"}}