{"2410.08475": {"publish_time": "2024-10-11", "title": "GIVE: Structured Reasoning with Knowledge Graph Inspired Veracity Extrapolation", "paper_summary": "Existing retrieval-based reasoning approaches for large language models\n(LLMs) heavily rely on the density and quality of the non-parametric knowledge\nsource to provide domain knowledge and explicit reasoning chain. However,\ninclusive knowledge sources are expensive and sometimes infeasible to build for\nscientific or corner domains. To tackle the challenges, we introduce Graph\nInspired Veracity Extrapolation (GIVE), a novel reasoning framework that\nintegrates the parametric and non-parametric memories to enhance both knowledge\nretrieval and faithful reasoning processes on very sparse knowledge graphs. By\nleveraging the external structured knowledge to inspire LLM to model the\ninterconnections among relevant concepts, our method facilitates a more logical\nand step-wise reasoning approach akin to experts' problem-solving, rather than\ngold answer retrieval. Specifically, the framework prompts LLMs to decompose\nthe query into crucial concepts and attributes, construct entity groups with\nrelevant entities, and build an augmented reasoning chain by probing potential\nrelationships among node pairs across these entity groups. Our method\nincorporates both factual and extrapolated linkages to enable comprehensive\nunderstanding and response generation. Extensive experiments on\nreasoning-intense benchmarks on biomedical and commonsense QA demonstrate the\neffectiveness of our proposed method. Specifically, GIVE enables GPT3.5-turbo\nto outperform advanced models like GPT4 without any additional training cost,\nthereby underscoring the efficacy of integrating structured information and\ninternal reasoning ability of LLMs for tackling specialized tasks with limited\nexternal resources.", "paper_summary_zh": "現有的基於檢索的推理方法對於大型語言模型 (LLM) 嚴重依賴非參數知識來源的密度和品質，以提供領域知識和明確的推理鏈。然而，包容性的知識來源很昂貴，有時對於科學或角落領域來說，建立起來也不可行。為了應對這些挑戰，我們引入了圖形啟發真實推斷 (GIVE)，這是一個新穎的推理架構，它整合了參數和非參數記憶體，以增強在非常稀疏的知識圖譜上進行知識檢索和忠實推理過程。透過利用外部結構化知識來激勵 LLM 模擬相關概念之間的相互關聯，我們的技術促進了一種更合乎邏輯且循序漸進的推理方法，類似於專家的問題解決，而不是黃金答案檢索。具體來說，該架構提示 LLM 將查詢分解為關鍵概念和屬性，使用相關實體建構實體群組，並透過探查這些實體群組中節點對之間的潛在關係來建立增強的推理鏈。我們的技術結合了事實和外推關聯，以實現全面的理解和回應產生。在生物醫學和常識問答上對推理密集基準進行的廣泛實驗證明了我們提出的方法的有效性。具體來說，GIVE 使 GPT3.5-turbo 能夠在沒有任何額外訓練成本的情況下優於 GPT4 等進階模型，從而強調了整合結構化資訊和 LLM 內部推理能力對於處理具有有限外部資源的專業任務的效能。", "author": "Jiashu He et.al.", "authors": "Jiashu He, Mingyu Derek Ma, Jinxuan Fan, Dan Roth, Wei Wang, Alejandro Ribeiro", "id": "2410.08475v1", "paper_url": "http://arxiv.org/abs/2410.08475v1", "repo": "null"}}