{"2411.12493": {"publish_time": "2024-11-19", "title": "Bias-Free Sentiment Analysis through Semantic Blinding and Graph Neural Networks", "paper_summary": "This paper introduces the Semantic Propagation Graph Neural Network (SProp\nGNN), a machine learning sentiment analysis (SA) architecture that relies\nexclusively on syntactic structures and word-level emotional cues to predict\nemotions in text. By semantically blinding the model to information about\nspecific words, it is robust to biases such as political or gender bias that\nhave been plaguing previous machine learning-based SA systems. The SProp GNN\nshows performance superior to lexicon-based alternatives such as VADER and\nEmoAtlas on two different prediction tasks, and across two languages.\nAdditionally, it approaches the accuracy of transformer-based models while\nsignificantly reducing bias in emotion prediction tasks. By offering improved\nexplainability and reducing bias, the SProp GNN bridges the methodological gap\nbetween interpretable lexicon approaches and powerful, yet often opaque, deep\nlearning models, offering a robust tool for fair and effective emotion analysis\nin understanding human behavior through text.", "paper_summary_zh": "本文介紹了語義傳播圖神經網路 (SProp GNN)，這是一種機器學習情緒分析 (SA) 架構，專門依賴句法結構和詞彙層級的情緒線索來預測文字中的情緒。透過在語義上讓模型對特定字詞的資訊視而不見，它能有效消除政治或性別偏見等偏誤，這些偏誤一直困擾著先前的機器學習式 SA 系統。SProp GNN 在兩項不同的預測任務和兩種語言上的表現都優於基於詞彙庫的替代方案，例如 VADER 和 EmoAtlas。此外，它在大幅減少情緒預測任務中的偏誤同時，也接近了基於轉換器的模型的準確度。透過提供更好的可解釋性並減少偏誤，SProp GNN 搭起了可詮釋詞彙方法與強大但經常不透明的深度學習模型之間的方法論鴻溝，提供了一個強健的工具，可以透過文字理解人類行為，進行公平且有效的分析。", "author": "Hubert Plisiecki et.al.", "authors": "Hubert Plisiecki", "id": "2411.12493v2", "paper_url": "http://arxiv.org/abs/2411.12493v2", "repo": "null"}}