{"2405.07863": {"publish_time": "2024-05-13", "title": "RLHF Workflow: From Reward Modeling to Online RLHF", "paper_summary": "We present the workflow of Online Iterative Reinforcement Learning from Human\nFeedback (RLHF) in this technical report, which is widely reported to\noutperform its offline counterpart by a large margin in the recent large\nlanguage model (LLM) literature. However, existing open-source RLHF projects\nare still largely confined to the offline learning setting. In this technical\nreport, we aim to fill in this gap and provide a detailed recipe that is easy\nto reproduce for online iterative RLHF. In particular, since online human\nfeedback is usually infeasible for open-source communities with limited\nresources, we start by constructing preference models using a diverse set of\nopen-source datasets and use the constructed proxy preference model to\napproximate human feedback. Then, we discuss the theoretical insights and\nalgorithmic principles behind online iterative RLHF, followed by a detailed\npractical implementation. Our trained LLM, SFR-Iterative-DPO-LLaMA-3-8B-R,\nachieves impressive performance on LLM chatbot benchmarks, including\nAlpacaEval-2, Arena-Hard, and MT-Bench, as well as other academic benchmarks\nsuch as HumanEval and TruthfulQA. We have shown that supervised fine-tuning\n(SFT) and iterative RLHF can obtain state-of-the-art performance with fully\nopen-source datasets. Further, we have made our models, curated datasets, and\ncomprehensive step-by-step code guidebooks publicly available. Please refer to\nhttps://github.com/RLHFlow/RLHF-Reward-Modeling and\nhttps://github.com/RLHFlow/Online-RLHF for more detailed information.", "paper_summary_zh": "<paragraph>我們在這份技術報告中介紹了人類回饋在線迭代強化學習 (RLHF) 的工作流程，據廣泛報導，它在最近的大語言模型 (LLM) 文獻中大幅優於其離線對應項。然而，現有的開源 RLHF 項目在很大程度上仍然局限於離線學習設置。在這份技術報告中，我們旨在填補這一空白，並提供一個易於複製的在線迭代 RLHF 的詳細配方。特別是，由於在線人類回饋通常對於資源有限的開源社區來說不可行，我們首先使用多樣化的開源數據集構建偏好模型，並使用構建的代理偏好模型來近似人類回饋。然後，我們討論在線迭代 RLHF 背後的理論見解和演算法原理，然後進行詳細的實際實作。我們訓練的 LLM，SFR-Iterative-DPO-LLaMA-3-8B-R，在 LLM 聊天機器人基準上取得了令人印象深刻的效能，包括 AlpacaEval-2、Arena-Hard 和 MT-Bench，以及其他學術基準，例如 HumanEval 和 TruthfulQA。我們已經證明，監督微調 (SFT) 和迭代 RLHF 可以使用完全開源數據集獲得最先進的效能。此外，我們已經公開了我們的模型、精選數據集和全面的逐步程式碼指南。有關更多詳細資訊，請參閱 https://github.com/RLHFlow/RLHF-Reward-Modeling 和 https://github.com/RLHFlow/Online-RLHF。</paragraph>", "author": "Hanze Dong et.al.", "authors": "Hanze Dong, Wei Xiong, Bo Pang, Haoxiang Wang, Han Zhao, Yingbo Zhou, Nan Jiang, Doyen Sahoo, Caiming Xiong, Tong Zhang", "id": "2405.07863v1", "paper_url": "http://arxiv.org/abs/2405.07863v1", "repo": "https://github.com/rlhflow/online-rlhf"}}