{"2408.08083": {"publish_time": "2024-08-15", "title": "Confidence-weighted integration of human and machine judgments for superior decision-making", "paper_summary": "Large language models (LLMs) have emerged as powerful tools in various\ndomains. Recent studies have shown that LLMs can surpass humans in certain\ntasks, such as predicting the outcomes of neuroscience studies. What role does\nthis leave for humans in the overall decision process? One possibility is that\nhumans, despite performing worse than LLMs, can still add value when teamed\nwith them. A human and machine team can surpass each individual teammate when\nteam members' confidence is well-calibrated and team members diverge in which\ntasks they find difficult (i.e., calibration and diversity are needed). We\nsimplified and extended a Bayesian approach to combining judgments using a\nlogistic regression framework that integrates confidence-weighted judgments for\nany number of team members. Using this straightforward method, we demonstrated\nin a neuroscience forecasting task that, even when humans were inferior to\nLLMs, their combination with one or more LLMs consistently improved team\nperformance. Our hope is that this simple and effective strategy for\nintegrating the judgments of humans and machines will lead to productive\ncollaborations.", "paper_summary_zh": "大型語言模型 (LLM) 已成為各種領域中強大的工具。最近的研究表明，LLM 在某些任務中可以超越人類，例如預測神經科學研究的結果。這對人類在整體決策過程中扮演什麼角色？一種可能性是，儘管人類的表現不如 LLM，但與 LLM 組隊時仍然可以增加價值。當團隊成員的信心經過良好校準，而且團隊成員發現困難的任務各不相同時，人類和機器團隊可以超越每個個別團隊成員（即需要校準和多樣性）。我們簡化並擴展了一種貝氏方法，使用邏輯迴歸框架結合判斷，該框架整合了任意數量的團隊成員的信心加權判斷。使用這種直接的方法，我們在神經科學預測任務中證明，即使人類不如 LLM，但將其與一個或多個 LLM 結合使用，始終可以改善團隊績效。我們希望這種簡單有效的策略，用於整合人類和機器判斷，將帶來富有成效的協作。", "author": "Felipe Yáñez et.al.", "authors": "Felipe Yáñez, Xiaoliang Luo, Omar Valerio Minero, Bradley C. Love", "id": "2408.08083v1", "paper_url": "http://arxiv.org/abs/2408.08083v1", "repo": "null"}}