{"2501.01458": {"publish_time": "2024-12-31", "title": "GAN-TAT: A Novel Framework Using Protein Interaction Networks in Druggable Gene Identification", "paper_summary": "Identifying druggable genes is essential for developing effective\npharmaceuticals. With the availability of extensive, high-quality data,\ncomputational methods have become a significant asset. Protein Interaction\nNetwork (PIN) is valuable but challenging to implement due to its high\ndimensionality and sparsity. Previous methods relied on indirect integration,\nleading to resolution loss. This study proposes GAN-TAT, a framework utilizing\nan advanced graph embedding technology, ImGAGN, to directly integrate PIN for\ndruggable gene inference work. Tested on three Pharos datasets, GAN-TAT\nachieved the highest AUC-ROC score of 0.951 on Tclin. Further evaluation shows\nthat GAN-TAT's predictions are supported by clinical evidence, highlighting its\npotential practical applications in pharmacogenomics. This research represents\na methodological attempt with the direct utilization of PIN, expanding\npotential new solutions for developing drug targets. The source code of GAN-TAT\nis available at (https://github.com/george-yuanji-wang/GAN-TAT).", "paper_summary_zh": "識別可藥物化基因對於開發有效的藥物至關重要。隨著大量高品質數據的出現，計算方法已成為一項重要的資產。蛋白質交互網絡 (PIN) 很有價值，但由於其高維度和稀疏性，實作起來具有挑戰性。先前的辦法依賴於間接整合，導致解析度降低。本研究提出 GAN-TAT，一個利用先進圖形嵌入技術 ImGAGN 的架構，直接整合 PIN 以進行可藥物化基因推論工作。在三個 Pharos 資料集上進行測試，GAN-TAT 在 Tclin 上達到了最高的 AUC-ROC 分數 0.951。進一步的評估顯示，GAN-TAT 的預測獲得了臨床證據的支持，突顯了其在藥物基因組學中的潛在實際應用。本研究代表了一種直接利用 PIN 的方法論嘗試，擴展了開發藥物靶標的潛在新解決方案。GAN-TAT 的原始碼可在 (https://github.com/george-yuanji-wang/GAN-TAT) 取得。", "author": "George Yuanji Wang et.al.", "authors": "George Yuanji Wang, Srisharan Murugesan, Aditya Prince Rohatgi", "id": "2501.01458v1", "paper_url": "http://arxiv.org/abs/2501.01458v1", "repo": "null"}}