{"2410.08728": {"publish_time": "2024-10-11", "title": "From N-grams to Pre-trained Multilingual Models For Language Identification", "paper_summary": "In this paper, we investigate the use of N-gram models and Large Pre-trained\nMultilingual models for Language Identification (LID) across 11 South African\nlanguages. For N-gram models, this study shows that effective data size\nselection remains crucial for establishing effective frequency distributions of\nthe target languages, that efficiently model each language, thus, improving\nlanguage ranking. For pre-trained multilingual models, we conduct extensive\nexperiments covering a diverse set of massively pre-trained multilingual (PLM)\nmodels -- mBERT, RemBERT, XLM-r, and Afri-centric multilingual models --\nAfriBERTa, Afro-XLMr, AfroLM, and Serengeti. We further compare these models\nwith available large-scale Language Identification tools: Compact Language\nDetector v3 (CLD V3), AfroLID, GlotLID, and OpenLID to highlight the importance\nof focused-based LID. From these, we show that Serengeti is a superior model\nacross models: N-grams to Transformers on average. Moreover, we propose a\nlightweight BERT-based LID model (za_BERT_lid) trained with NHCLT + Vukzenzele\ncorpus, which performs on par with our best-performing Afri-centric models.", "paper_summary_zh": "<paragraph>在本文中，我們探討了在 11 種南非語言中使用 N-gram 模型和大型預訓練多語言模型進行語言識別 (LID) 的方法。對於 N-gram 模型，本研究表明，有效的數據大小選擇對於建立目標語言的有效頻率分佈至關重要，有效地對每種語言進行建模，從而提高語言排名。對於預訓練的多語言模型，我們進行了廣泛的實驗，涵蓋了多樣化的大規模預訓練多語言 (PLM) 模型——mBERT、RemBERT、XLM-r 和以非洲為中心的模型——AfriBERTa、Afro-XLMr、AfroLM 和 Serengeti。我們進一步將這些模型與現有的、大規模的語言識別工具進行比較：Compact Language Detector v3 (CLD V3)、AfroLID、GlotLID 和 OpenLID，以強調基於焦點的 LID 的重要性。從這些模型中，我們表明 Serengeti 是一個優於 N-gram 到 Transformer 的模型。此外，我們提出了一個輕量級的基於 BERT 的 LID 模型 (za_BERT_lid)，該模型使用 NHCLT + Vukzenzele 語料庫進行訓練，其性能與我們性能最好的以非洲為中心的模型相當。</paragraph>", "author": "Thapelo Sindane et.al.", "authors": "Thapelo Sindane, Vukosi Marivate", "id": "2410.08728v1", "paper_url": "http://arxiv.org/abs/2410.08728v1", "repo": "null"}}