{"2405.08603": {"publish_time": "2024-05-14", "title": "A Comprehensive Survey of Large Language Models and Multimodal Large Language Models in Medicine", "paper_summary": "Since the release of ChatGPT and GPT-4, large language models (LLMs) and\nmultimodal large language models (MLLMs) have garnered significant attention\ndue to their powerful and general capabilities in understanding, reasoning, and\ngeneration, thereby offering new paradigms for the integration of artificial\nintelligence with medicine. This survey comprehensively overviews the\ndevelopment background and principles of LLMs and MLLMs, as well as explores\ntheir application scenarios, challenges, and future directions in medicine.\nSpecifically, this survey begins by focusing on the paradigm shift, tracing the\nevolution from traditional models to LLMs and MLLMs, summarizing the model\nstructures to provide detailed foundational knowledge. Subsequently, the survey\ndetails the entire process from constructing and evaluating to using LLMs and\nMLLMs with a clear logic. Following this, to emphasize the significant value of\nLLMs and MLLMs in healthcare, we survey and summarize 6 promising applications\nin healthcare. Finally, the survey discusses the challenges faced by medical\nLLMs and MLLMs and proposes a feasible approach and direction for the\nsubsequent integration of artificial intelligence with medicine. Thus, this\nsurvey aims to provide researchers with a valuable and comprehensive reference\nguide from the perspectives of the background, principles, and clinical\napplications of LLMs and MLLMs.", "paper_summary_zh": "自 ChatGPT 和 GPT-4 發布以來，大型語言模型 (LLM) 和多模態大型語言模型 (MLLM) 因其在理解、推理和生成方面的強大且通用的能力而備受關注，從而為人工智慧與醫學整合提供了新的範例。本綜述全面概述了 LLM 和 MLLM 的發展背景和原理，並探討了它們在醫學中的應用場景、挑戰和未來方向。具體來說，本綜述首先著重於範例轉移，追溯從傳統模型到 LLM 和 MLLM 的演變，總結模型結構以提供詳細的基本知識。隨後，本綜述詳細介紹了從構建和評估到使用 LLM 和 MLLM 的整個過程，邏輯清晰。緊接著，為了強調 LLM 和 MLLM 在醫療保健中的重要價值，我們調查並總結了醫療保健中的 6 個有前景的應用。最後，本綜述討論了醫學 LLM 和 MLLM 面臨的挑戰，並提出了人工智慧與醫學後續整合的可行途徑和方向。因此，本綜述旨在從 LLM 和 MLLM 的背景、原理和臨床應用角度為研究人員提供有價值且全面的參考指南。", "author": "Hanguang Xiao et.al.", "authors": "Hanguang Xiao, Feizhong Zhou, Xingyue Liu, Tianqi Liu, Zhipeng Li, Xin Liu, Xiaoxuan Huang", "id": "2405.08603v1", "paper_url": "http://arxiv.org/abs/2405.08603v1", "repo": "null"}}