{"2412.20662": {"publish_time": "2024-12-30", "title": "Enhancing Table Recognition with Vision LLMs: A Benchmark and Neighbor-Guided Toolchain Reasoner", "paper_summary": "Pre-trained foundation models have recently significantly progressed in\nstructured table understanding and reasoning. However, despite advancements in\nareas such as table semantic understanding and table question answering,\nrecognizing the structure and content of unstructured tables using Vision Large\nLanguage Models (VLLMs) remains under-explored. In this work, we address this\nresearch gap by employing VLLMs in a training-free reasoning paradigm. First,\nwe design a benchmark with various hierarchical dimensions relevant to table\nrecognition. Subsequently, we conduct in-depth evaluations using pre-trained\nVLLMs, finding that low-quality image input is a significant bottleneck in the\nrecognition process. Drawing inspiration from these findings, we propose the\nNeighbor-Guided Toolchain Reasoner (NGTR) framework, which is characterized by\nintegrating multiple lightweight models for low-level visual processing\noperations aimed at mitigating issues with low-quality input images.\nSpecifically, we utilize a neighbor retrieval mechanism to guide the generation\nof multiple tool invocation plans, transferring tool selection experiences from\nsimilar neighbors to the given input, thereby facilitating suitable tool\nselection. Additionally, we introduce a reflection module to supervise the tool\ninvocation process. Extensive experiments on public table recognition datasets\ndemonstrate that our approach significantly enhances the recognition\ncapabilities of the vanilla VLLMs. We believe that the designed benchmark and\nthe proposed NGTR framework could provide an alternative solution in table\nrecognition.", "paper_summary_zh": "预训练基础模型最近在结构化表格理解和推理方面取得了显著进展。然而，尽管在表格语义理解和表格问题解答等领域取得了进步，但使用视觉大语言模型 (VLLM) 识别非结构化表格的结构和内容仍然是探索不足的领域。在这项工作中，我们通过在无训练推理范式中使用 VLLM 来解决这一研究空白。首先，我们设计了一个基准，其中包含与表格识别相关的各种层次维度。随后，我们使用预训练的 VLLM 进行了深入评估，发现低质量的图像输入是识别过程中的一个重大瓶颈。受这些发现的启发，我们提出了邻域引导工具链推理器 (NGTR) 框架，其特点是集成了多个轻量级模型，用于低级视觉处理操作，旨在减轻低质量输入图像的问题。具体来说，我们利用邻域检索机制来指导生成多个工具调用计划，将工具选择经验从相似的邻域转移到给定的输入，从而促进合适的工具选择。此外，我们引入了一个反射模块来监督工具调用过程。在公共表格识别数据集上的大量实验表明，我们的方法显著增强了香草 VLLM 的识别能力。我们相信，设计的基准和提出的 NGTR 框架可以在表格识别中提供一种替代解决方案。", "author": "Yitong Zhou et.al.", "authors": "Yitong Zhou, Mingyue Cheng, Qingyang Mao, Qi Liu, Feiyang Xu, Xin Li, Enhong Chen", "id": "2412.20662v1", "paper_url": "http://arxiv.org/abs/2412.20662v1", "repo": "null"}}