{"2405.20562": {"publish_time": "2024-05-31", "title": "Can Machine Learning Assist in Diagnosis of Primary Immune Thrombocytopenia? A feasibility study", "paper_summary": "Primary Immune thrombocytopenia (ITP) is a rare autoimmune disease\ncharacterised by immune-mediated destruction of peripheral blood platelets in\npatients leading to low platelet counts and bleeding. The diagnosis and\neffective management of ITP is challenging because there is no established test\nto confirm the disease and no biomarker with which one can predict the response\nto treatment and outcome. In this work we conduct a feasibility study to check\nif machine learning can be applied effectively for diagnosis of ITP using\nroutine blood tests and demographic data in a non-acute outpatient setting.\nVarious ML models, including Logistic Regression, Support Vector Machine,\nk-Nearest Neighbor, Decision Tree and Random Forest, were applied to data from\nthe UK Adult ITP Registry and a general hematology clinic. Two different\napproaches were investigated: a demographic-unaware and a demographic-aware\none. We conduct extensive experiments to evaluate the predictive performance of\nthese models and approaches, as well as their bias. The results revealed that\nDecision Tree and Random Forest models were both superior and fair, achieving\nnearly perfect predictive and fairness scores, with platelet count identified\nas the most significant variable. Models not provided with demographic\ninformation performed better in terms of predictive accuracy but showed lower\nfairness score, illustrating a trade-off between predictive performance and\nfairness.", "paper_summary_zh": "原發性免疫性血小板減少症（ITP）是一種罕見的自體免疫疾病\n其特徵在於免疫介導的外周血小板破壞導致患者血小板數量減少和出血。ITP 的診斷和有效管理具有挑戰性，因為沒有既定的檢測方法來確認疾病，也沒有生物標誌物可以預測對治療和結果的反應。在這項工作中，我們進行了一項可行性研究，以檢查機器學習是否可以有效應用於使用非急性門診環境中的常規血液檢查和人口統計數據診斷 ITP。各種 ML 模型，包括邏輯迴歸、支持向量機、k 最近鄰、決策樹和隨機森林，被應用於來自英國成人 ITP 登記處和普通血液學診所的數據。研究了兩種不同的方法：一種是不知道人口統計數據的方法，另一種是知道人口統計數據的方法。我們進行了廣泛的實驗來評估這些模型和方法的預測性能以及它們的偏差。結果表明，決策樹和隨機森林模型都優越且公平，實現了接近完美的預測和公平分數，血小板計數被確定為最重要的變量。未提供人口統計信息的模型在預測準確性方面表現得更好，但公平分數較低，說明了預測性能和公平性之間的權衡。", "author": "Haroon Miah et.al.", "authors": "Haroon Miah, Dimitrios Kollias, Giacinto Luca Pedone, Drew Provan, Frederick Chen", "id": "2405.20562v1", "paper_url": "http://arxiv.org/abs/2405.20562v1", "repo": "null"}}