{"2501.02599": {"publish_time": "2025-01-05", "title": "Empowering Bengali Education with AI: Solving Bengali Math Word Problems through Transformer Models", "paper_summary": "Mathematical word problems (MWPs) involve the task of converting textual\ndescriptions into mathematical equations. This poses a significant challenge in\nnatural language processing, particularly for low-resource languages such as\nBengali. This paper addresses this challenge by developing an innovative\napproach to solving Bengali MWPs using transformer-based models, including\nBasic Transformer, mT5, BanglaT5, and mBART50. To support this effort, the\n\"PatiGonit\" dataset was introduced, containing 10,000 Bengali math problems,\nand these models were fine-tuned to translate the word problems into equations\naccurately. The evaluation revealed that the mT5 model achieved the highest\naccuracy of 97.30%, demonstrating the effectiveness of transformer models in\nthis domain. This research marks a significant step forward in Bengali natural\nlanguage processing, offering valuable methodologies and resources for\neducational AI tools. By improving math education, it also supports the\ndevelopment of advanced problem-solving skills for Bengali-speaking students.", "paper_summary_zh": "數學文字題（MWP）涉及將文字描述轉換為數學方程式的任務。這對自然語言處理構成了重大挑戰，特別是對於孟加拉語等低資源語言。本文通過開發一種使用基於Transformer的模型（包括 Basic Transformer、mT5、BanglaT5 和 mBART50）解決孟加拉語 MWP 的創新方法來應對這一挑戰。為了支持這項工作，引入了「PatiGonit」數據集，其中包含 10,000 個孟加拉語數學問題，並且對這些模型進行了微調，以準確地將文字題轉換為方程式。評估結果表明，mT5 模型達到了 97.30% 的最高準確度，證明了Transformer模型在這個領域的有效性。這項研究標誌著孟加拉語自然語言處理向前邁出了重要一步，為教育 AI 工具提供了有價值的方法和資源。通過改善數學教育，它也支持孟加拉語學生培養高級問題解決能力。", "author": "Jalisha Jashim Era et.al.", "authors": "Jalisha Jashim Era, Bidyarthi Paul, Tahmid Sattar Aothoi, Mirazur Rahman Zim, Faisal Muhammad Shah", "id": "2501.02599v1", "paper_url": "http://arxiv.org/abs/2501.02599v1", "repo": "null"}}