{"2411.03177": {"publish_time": "2024-11-05", "title": "On Improved Conditioning Mechanisms and Pre-training Strategies for Diffusion Models", "paper_summary": "Large-scale training of latent diffusion models (LDMs) has enabled\nunprecedented quality in image generation. However, the key components of the\nbest performing LDM training recipes are oftentimes not available to the\nresearch community, preventing apple-to-apple comparisons and hindering the\nvalidation of progress in the field. In this work, we perform an in-depth study\nof LDM training recipes focusing on the performance of models and their\ntraining efficiency. To ensure apple-to-apple comparisons, we re-implement five\npreviously published models with their corresponding recipes. Through our\nstudy, we explore the effects of (i)~the mechanisms used to condition the\ngenerative model on semantic information (e.g., text prompt) and control\nmetadata (e.g., crop size, random flip flag, etc.) on the model performance,\nand (ii)~the transfer of the representations learned on smaller and\nlower-resolution datasets to larger ones on the training efficiency and model\nperformance. We then propose a novel conditioning mechanism that disentangles\nsemantic and control metadata conditionings and sets a new state-of-the-art in\nclass-conditional generation on the ImageNet-1k dataset -- with FID\nimprovements of 7% on 256 and 8% on 512 resolutions -- as well as text-to-image\ngeneration on the CC12M dataset -- with FID improvements of 8% on 256 and 23%\non 512 resolution.", "paper_summary_zh": "大規模訓練潛在擴散模型 (LDM) 已使影像生成品質達到前所未有的水準。然而，效能最佳的 LDM 訓練配方的關鍵組成部分通常無法提供給研究社群，這使得蘋果對蘋果的比較無法進行，並阻礙了該領域進度的驗證。在這項工作中，我們針對 LDM 訓練配方進行深入研究，重點在於模型的效能及其訓練效率。為了確保蘋果對蘋果的比較，我們重新實作了五個先前發表的模型及其對應配方。透過我們的研究，我們探討了 (i) 用於對生成模型進行語意資訊 (例如，文字提示) 和控制元資料 (例如，裁剪大小、隨機翻轉標記等) 條件化的機制對模型效能的影響，以及 (ii) 在較小且較低解析度的資料集上學習到的表徵轉移到較大的資料集上，對訓練效率和模型效能的影響。接著，我們提出了一種新穎的條件化機制，它解開語意和控制元資料的條件化，並在 ImageNet-1k 資料集上設定了類別條件式生成的最新技術水準，在 256 和 512 解析度上，FID 分別改善了 7% 和 8%，以及在 CC12M 資料集上的文字轉影像生成，在 256 和 512 解析度上，FID 分別改善了 8% 和 23%。", "author": "Tariq Berrada Ifriqi et.al.", "authors": "Tariq Berrada Ifriqi, Pietro Astolfi, Melissa Hall, Reyhane Askari-Hemmat, Yohann Benchetrit, Marton Havasi, Matthew Muckley, Karteek Alahari, Adriana Romero-Soriano, Jakob Verbeek, Michal Drozdzal", "id": "2411.03177v1", "paper_url": "http://arxiv.org/abs/2411.03177v1", "repo": "null"}}