{"2501.06432": {"publish_time": "2025-01-11", "title": "Deep Learning on Hester Davis Scores for Inpatient Fall Prediction", "paper_summary": "Fall risk prediction among hospitalized patients is a critical aspect of\npatient safety in clinical settings, and accurate models can help prevent\nadverse events. The Hester Davis Score (HDS) is commonly used to assess fall\nrisk, with current clinical practice relying on a threshold-based approach. In\nthis method, a patient is classified as high-risk when their HDS exceeds a\npredefined threshold. However, this approach may fail to capture dynamic\npatterns in fall risk over time. In this study, we model the threshold-based\napproach and propose two machine learning approaches for enhanced fall\nprediction: One-step ahead fall prediction and sequence-to-point fall\nprediction. The one-step ahead model uses the HDS at the current timestamp to\npredict the risk at the next timestamp, while the sequence-to-point model\nleverages all preceding HDS values to predict fall risk using deep learning. We\ncompare these approaches to assess their accuracy in fall risk prediction,\ndemonstrating that deep learning can outperform the traditional threshold-based\nmethod by capturing temporal patterns and improving prediction reliability.\nThese findings highlight the potential for data-driven approaches to enhance\npatient safety through more reliable fall prevention strategies.", "paper_summary_zh": "住院患者的跌倒風險預測是臨床環境中患者安全的重要面向，精確的模型有助於預防不良事件。Hester Davis 評分 (HDS) 常用於評估跌倒風險，目前的臨床實務依賴於基於閾值的評估方式。在此方法中，當患者的 HDS 超過預先定義的閾值時，會將其歸類為高風險。然而，此方法可能無法捕捉隨著時間推移而產生的動態跌倒風險模式。在本研究中，我們對基於閾值的評估方式進行建模，並提出兩種機器學習評估方式以加強跌倒預測：單步前瞻跌倒預測和序列對點跌倒預測。單步前瞻模型使用當前時間戳記的 HDS 預測下一個時間戳記的風險，而序列對點模型則利用所有前一個 HDS 值使用深度學習來預測跌倒風險。我們比較這些評估方式以評估其在跌倒風險預測中的準確性，證明深度學習可以透過捕捉時間模式和提升預測可靠性，優於傳統的基於閾值的評估方式。這些發現強調了資料驅動評估方式在透過更可靠的跌倒預防策略來加強患者安全方面的潛力。", "author": "Hojjat Salehinejad et.al.", "authors": "Hojjat Salehinejad, Ricky Rojas, Kingsley Iheasirim, Mohammed Yousufuddin, Bijan Borah", "id": "2501.06432v1", "paper_url": "http://arxiv.org/abs/2501.06432v1", "repo": "null"}}