{"2412.21161": {"publish_time": "2024-12-30", "title": "Open RAN-Enabled Deep Learning-Assisted Mobility Management for Connected Vehicles", "paper_summary": "Connected Vehicles (CVs) can leverage the unique features of 5G and future\n6G/NextG networks to enhance Intelligent Transportation System (ITS) services.\nHowever, even with advancements in cellular network generations, CV\napplications may experience communication interruptions in high-mobility\nscenarios due to frequent changes of serving base station, also known as\nhandovers (HOs). This paper proposes the adoption of Open Radio Access Network\n(Open RAN/O-RAN) and deep learning models for decision-making to prevent\nQuality of Service (QoS) degradation due to HOs and to ensure the timely\nconnectivity needed for CV services. The solution utilizes the O-RAN Software\nCommunity (OSC), an open-source O-RAN platform developed by the collaboration\nbetween the O-RAN Alliance and Linux Foundation, to develop xApps that are\nexecuted in the near-Real-Time RIC of OSC. To demonstrate the proposal's\neffectiveness, an integrated framework combining the OMNeT++ simulator and OSC\nwas created. Evaluations used real-world datasets in urban application\nscenarios, such as video streaming transmission and over-the-air (OTA) updates.\nResults indicate that the proposal achieved superior performance and reduced\nlatency compared to the standard 3GPP HO procedure.", "paper_summary_zh": "連網車輛 (CV) 能運用 5G 和未來 6G/NextG 網路的獨特功能來提升智慧運輸系統 (ITS) 服務。不過，即使在行動網路世代進步之下，CV 應用程式仍可能在高度流動的場景中因頻繁變更服務基地台（又稱交接，HO）而經歷通訊中斷。本文提出採用開放式無線存取網路 (Open RAN/O-RAN) 和深度學習模型來做決策，以防止因交接而造成的服務品質 (QoS) 降低，並確保 CV 服務所需的即時連線。此解決方案利用 O-RAN 軟體社群 (OSC)（一個由 O-RAN 聯盟和 Linux 基金會合作開發的開放原始碼 O-RAN 平台）來開發 xApp，並在 OSC 的近即時 RIC 中執行。為了證明此提案的有效性，建立了一個整合 OMNeT++ 模擬器和 OSC 的整合架構。評估使用都市應用場景中的真實世界資料集，例如串流影片傳輸與無線 (OTA) 更新。結果顯示，與標準 3GPP 交接程序相比，此提案達到了優異的效能並降低了延遲。", "author": "Maria Barbosa et.al.", "authors": "Maria Barbosa, Kelvin Dias", "id": "2412.21161v1", "paper_url": "http://arxiv.org/abs/2412.21161v1", "repo": "null"}}