{"2404.05545": {"publish_time": "2024-04-08", "title": "Evaluating Interventional Reasoning Capabilities of Large Language Models", "paper_summary": "Numerous decision-making tasks require estimating causal effects under\ninterventions on different parts of a system. As practitioners consider using\nlarge language models (LLMs) to automate decisions, studying their causal\nreasoning capabilities becomes crucial. A recent line of work evaluates LLMs\nability to retrieve commonsense causal facts, but these evaluations do not\nsufficiently assess how LLMs reason about interventions. Motivated by the role\nthat interventions play in causal inference, in this paper, we conduct\nempirical analyses to evaluate whether LLMs can accurately update their\nknowledge of a data-generating process in response to an intervention. We\ncreate benchmarks that span diverse causal graphs (e.g., confounding,\nmediation) and variable types, and enable a study of intervention-based\nreasoning. These benchmarks allow us to isolate the ability of LLMs to\naccurately predict changes resulting from their ability to memorize facts or\nfind other shortcuts. Our analysis on four LLMs highlights that while GPT- 4\nmodels show promising accuracy at predicting the intervention effects, they\nremain sensitive to distracting factors in the prompts.", "paper_summary_zh": "許多決策制定任務需要在系統不同部分的干預下估計因果效應。由於實務工作者考慮使用大型語言模型 (LLM) 來自動化決策，研究其因果推理能力變得至關重要。最近一連串的研究評估了 LLM 擷取常識因果事實的能力，但這些評估並未充分評估 LLM 如何對干預進行推理。在因果推論中干預所扮演的角色的啟發下，我們在本文中進行實證分析，以評估 LLM 是否能準確更新其對資料產生程序的了解以回應干預。我們建立了涵蓋各種因果圖形（例如混淆、中介）和變數類型的基準，並能研究基於干預的推理。這些基準讓我們能孤立 LLM 準確預測變化的能力，因為它們能記憶事實或找到其他捷徑。我們對四個 LLM 的分析強調，儘管 GPT-4 模型在預測干預效果方面表現出令人滿意的準確性，但它們仍然對提示中的干擾因素很敏感。", "author": "Tejas Kasetty et.al.", "authors": "Tejas Kasetty, Divyat Mahajan, Gintare Karolina Dziugaite, Alexandre Drouin, Dhanya Sridhar", "id": "2404.05545v1", "paper_url": "http://arxiv.org/abs/2404.05545v1", "repo": "null"}}