{"2407.17291": {"publish_time": "2024-07-24", "title": "How Good (Or Bad) Are LLMs at Detecting Misleading Visualizations?", "paper_summary": "In this study, we address the growing issue of misleading charts, a prevalent\nproblem that undermines the integrity of information dissemination. Misleading\ncharts can distort the viewer's perception of data, leading to\nmisinterpretations and decisions based on false information. The development of\neffective automatic detection methods for misleading charts is an urgent field\nof research. The recent advancement of multimodal Large Language Models (LLMs)\nhas introduced a promising direction for addressing this challenge. We explored\nthe capabilities of these models in analyzing complex charts and assessing the\nimpact of different prompting strategies on the models' analyses. We utilized a\ndataset of misleading charts collected from the internet by prior research and\ncrafted nine distinct prompts, ranging from simple to complex, to test the\nability of four different multimodal LLMs in detecting over 21 different chart\nissues. Through three experiments--from initial exploration to detailed\nanalysis--we progressively gained insights into how to effectively prompt LLMs\nto identify misleading charts and developed strategies to address the\nscalability challenges encountered as we expanded our detection range from the\ninitial five issues to 21 issues in the final experiment. Our findings reveal\nthat multimodal LLMs possess a strong capability for chart comprehension and\ncritical thinking in data interpretation. There is significant potential in\nemploying multimodal LLMs to counter misleading information by supporting\ncritical thinking and enhancing visualization literacy. This study demonstrates\nthe applicability of LLMs in addressing the pressing concern of misleading\ncharts.", "paper_summary_zh": "在這項研究中，我們探討了誤導性圖表日益嚴重的問題，這是一個普遍存在的問題，它破壞了資訊傳播的完整性。誤導性圖表可能會扭曲觀看者對資料的認知，導致誤解和基於錯誤資訊的決策。開發用於誤導性圖表的有效自動偵測方法是一個迫切的研究領域。多模態大型語言模型 (LLM) 的最新進展為解決這個挑戰帶來了有希望的方向。我們探索了這些模型在分析複雜圖表和評估不同提示策略對模型分析的影響方面的能力。我們利用了先前研究從網路上收集的誤導性圖表資料集，並設計了九個不同的提示，從簡單到複雜，以測試四種不同的多模態 LLM 在偵測超過 21 個不同圖表問題的能力。透過三個實驗，從初步探索到詳細分析，我們逐漸深入了解如何有效提示 LLM 識別誤導性圖表，並制定策略來解決我們在將偵測範圍從最初的五個問題擴展到最後實驗中的 21 個問題時遇到的可擴充性挑戰。我們的研究結果揭示了多模態 LLM 具備強大的圖表理解能力和資料詮釋方面的批判性思維能力。利用多模態 LLM 來對抗誤導性資訊，透過支援批判性思維和加強視覺化素養，具有顯著的潛力。這項研究證明了 LLM 在解決誤導性圖表這個迫切問題上的適用性。", "author": "Leo Yu-Ho Lo et.al.", "authors": "Leo Yu-Ho Lo, Huamin Qu", "id": "2407.17291v1", "paper_url": "http://arxiv.org/abs/2407.17291v1", "repo": "null"}}