{"2407.08176": {"publish_time": "2024-07-11", "title": "Foundation Model Engineering: Engineering Foundation Models Just as Engineering Software", "paper_summary": "By treating data and models as the source code, Foundation Models (FMs)\nbecome a new type of software. Mirroring the concept of software crisis, the\nincreasing complexity of FMs making FM crisis a tangible concern in the coming\ndecade, appealing for new theories and methodologies from the field of software\nengineering. In this paper, we outline our vision of introducing Foundation\nModel (FM) engineering, a strategic response to the anticipated FM crisis with\nprincipled engineering methodologies. FM engineering aims to mitigate potential\nissues in FM development and application through the introduction of\ndeclarative, automated, and unified programming interfaces for both data and\nmodel management, reducing the complexities involved in working with FMs by\nproviding a more structured and intuitive process for developers. Through the\nestablishment of FM engineering, we aim to provide a robust, automated, and\nextensible framework that addresses the imminent challenges, and discovering\nnew research opportunities for the software engineering field.", "paper_summary_zh": "透過將資料和模型視為原始碼，基礎模型 (FM) 成為一種新型軟體。呼應軟體危機的概念，FM 的複雜性日益提升，使得 FM 危機在未來十年內成為具體的隱憂，呼籲軟體工程領域提出新的理論和方法。在本文中，我們概述了我們推動基礎模型 (FM) 工程的願景，這是一種策略性的回應，旨在透過有原則的工程方法來應對預期的 FM 危機。FM 工程旨在透過為資料和模型管理導入宣告式、自動化且統一的程式設計介面，來減輕 FM 開發和應用中的潛在問題，並透過為開發人員提供更結構化且直觀的流程，來降低使用 FM 所涉及的複雜性。透過建立 FM 工程，我們旨在提供一個強健、自動化且可擴充的架構，以應對迫在眉睫的挑戰，並為軟體工程領域探索新的研究機會。", "author": "Dezhi Ran et.al.", "authors": "Dezhi Ran, Mengzhou Wu, Wei Yang, Tao Xie", "id": "2407.08176v1", "paper_url": "http://arxiv.org/abs/2407.08176v1", "repo": "null"}}