{"2412.20816": {"publish_time": "2024-12-30", "title": "Length-Aware DETR for Robust Moment Retrieval", "paper_summary": "Video Moment Retrieval (MR) aims to localize moments within a video based on\na given natural language query. Given the prevalent use of platforms like\nYouTube for information retrieval, the demand for MR techniques is\nsignificantly growing. Recent DETR-based models have made notable advances in\nperformance but still struggle with accurately localizing short moments.\nThrough data analysis, we identified limited feature diversity in short\nmoments, which motivated the development of MomentMix. MomentMix employs two\naugmentation strategies: ForegroundMix and BackgroundMix, each enhancing the\nfeature representations of the foreground and background, respectively.\nAdditionally, our analysis of prediction bias revealed that short moments\nparticularly struggle with accurately predicting their center positions of\nmoments. To address this, we propose a Length-Aware Decoder, which conditions\nlength through a novel bipartite matching process. Our extensive studies\ndemonstrate the efficacy of our length-aware approach, especially in localizing\nshort moments, leading to improved overall performance. Our method surpasses\nstate-of-the-art DETR-based methods on benchmark datasets, achieving the\nhighest R1 and mAP on QVHighlights and the highest R1@0.7 on TACoS and\nCharades-STA (such as a 2.46% gain in R1@0.7 and a 2.57% gain in mAP average\nfor QVHighlights). The code is available at\nhttps://github.com/sjpark5800/LA-DETR.", "paper_summary_zh": "影片片段檢索 (MR) 旨在根據給定的自然語言查詢，在影片中找出片段。由於 YouTube 等平台普遍用於資訊檢索，對 MR 技術的需求大幅增加。最近基於 DETR 的模型在效能方面有顯著進步，但仍難以準確找出短片段。透過資料分析，我們發現短片段中的特徵多樣性有限，這促成了 MomentMix 的開發。MomentMix 採用兩種擴增策略：前景混合和背景混合，分別增強前景和背景的特徵表示。此外，我們對預測偏差的分析顯示，短片段特別難以準確預測其片段中心位置。為了解決這個問題，我們提出一個長度感知解碼器，透過新穎的二部匹配程序來設定長度。我們廣泛的研究證明了我們長度感知方法的效力，特別是在找出短片段時，進而改善整體效能。我們的模型在基準資料集上超越了最先進的基於 DETR 的方法，在 QVHighlights 上達到了最高的 R1 和 mAP，在 TACoS 和 Charades-STA 上達到了最高的 R1@0.7（例如在 QVHighlights 上 R1@0.7 提升了 2.46%，mAP 平均提升了 2.57%）。程式碼可於 https://github.com/sjpark5800/LA-DETR 取得。", "author": "Seojeong Park et.al.", "authors": "Seojeong Park, Jiho Choi, Kyungjune Baek, Hyunjung Shim", "id": "2412.20816v1", "paper_url": "http://arxiv.org/abs/2412.20816v1", "repo": "null"}}