{"2411.01647": {"publish_time": "2024-11-03", "title": "Optical Flow Representation Alignment Mamba Diffusion Model for Medical Video Generation", "paper_summary": "Medical video generation models are expected to have a profound impact on the\nhealthcare industry, including but not limited to medical education and\ntraining, surgical planning, and simulation. Current video diffusion models\ntypically build on image diffusion architecture by incorporating temporal\noperations (such as 3D convolution and temporal attention). Although this\napproach is effective, its oversimplification limits spatio-temporal\nperformance and consumes substantial computational resources. To counter this,\nwe propose Medical Simulation Video Generator (MedSora), which incorporates\nthree key elements: i) a video diffusion framework integrates the advantages of\nattention and Mamba, balancing low computational load with high-quality video\ngeneration, ii) an optical flow representation alignment method that implicitly\nenhances attention to inter-frame pixels, and iii) a video variational\nautoencoder (VAE) with frequency compensation addresses the information loss of\nmedical features that occurs when transforming pixel space into latent features\nand then back to pixel frames. Extensive experiments and applications\ndemonstrate that MedSora exhibits superior visual quality in generating medical\nvideos, outperforming the most advanced baseline methods. Further results and\ncode are available at https://wongzbb.github.io/MedSora", "paper_summary_zh": "醫療影片生成模型預計將對醫療保健產業產生深遠的影響，包括但不限於醫學教育和訓練、手術規劃和模擬。目前的影片擴散模型通常建立在影像擴散架構上，並結合時間運算（例如 3D 摺積和時間注意力）。儘管此方法有效，但其過於簡化限制了時空效能，並消耗大量的運算資源。為了解決這個問題，我們提出醫學模擬影片生成器 (MedSora)，它結合了三個關鍵要素：i) 一個影片擴散架構整合了注意力和 Mamba 的優點，在低運算負載和高品質影片生成之間取得平衡，ii) 一個光流表示對齊方法，可以隱含地增強對影格間像素的注意力，以及 iii) 一個具有頻率補償的影片變異自動編碼器 (VAE)，用於解決在將像素空間轉換為潛在特徵，然後再轉回像素影格時發生的醫療特徵資訊遺失問題。廣泛的實驗和應用證明，MedSora 在生成醫療影片方面展現出優異的視覺品質，優於最先進的基準方法。進一步的結果和程式碼可以在 https://wongzbb.github.io/MedSora 取得", "author": "Zhenbin Wang et.al.", "authors": "Zhenbin Wang, Lei Zhang, Lituan Wang, Minjuan Zhu, Zhenwei Zhang", "id": "2411.01647v1", "paper_url": "http://arxiv.org/abs/2411.01647v1", "repo": "null"}}