{"2406.14507": {"publish_time": "2024-06-20", "title": "On Newton's Method to Unlearn Neural Networks", "paper_summary": "Machine unlearning facilitates personal data ownership, including the ``right\nto be forgotten''. The proliferation of applications of \\emph{neural networks}\n(NNs) trained on users' personal data calls for the need to develop algorithms\nto unlearn an NN. Since retraining is costly, efficiency is often achieved\nthrough approximate unlearning which aims to unlearn a trained NN to be close\nto the retrained one (in distribution). Though the Newton's method has been\nused by previous works to approximately unlearn linear models, adapting it for\nunlearning an NN often encounters degenerate Hessians that make computing the\nNewton's update impossible. In this paper, we will first show that when coupled\nwith naive yet often effective solutions to mitigate the degeneracy issue for\nunlearning, the Newton's method surprisingly suffers from catastrophic\nforgetting. To overcome this difficulty, we revise the Newton's method to\ninclude a theoretically justified regularizer and propose a cubic-regularized\nNewton's method for unlearning an NN. The cubic regularizer comes with the\nbenefits of not requiring manual finetuning and affording a natural\ninterpretation. Empirical evaluation on several models and real-world datasets\nshows that our method is more resilient to catastrophic forgetting and performs\nbetter than the baselines, especially in sequential unlearning.", "paper_summary_zh": "機器遺忘有助於個人資料所有權，包括「被遺忘權」。訓練於使用者個人資料的「神經網路」（NN）應用激增，因此需要開發演算法來遺忘 NN。由於重新訓練成本高昂，因此效率通常透過近似遺忘來達成，其目標是遺忘已訓練的 NN 以接近重新訓練的 NN（在分佈上）。儘管先前的研究已使用牛頓法來近似遺忘線性模型，但將其調整為遺忘 NN 時，通常會遇到簡併海森矩陣，導致無法計算牛頓更新。在本文中，我們將首先展示，當與用於減輕遺忘簡併問題的天真但通常有效的方法結合時，牛頓法會意外地遭受災難性遺忘。為了克服這個困難，我們修改牛頓法，加入理論上合理的正則化項，並提出一個三次正則化牛頓法來遺忘 NN。三次正則化項的好處是不需要人工微調，並提供自然的詮釋。對多個模型和真實世界資料集的經驗評估顯示，我們的模型對災難性遺忘更有韌性，並且表現優於基準，特別是在序列遺忘中。", "author": "Nhung Bui et.al.", "authors": "Nhung Bui, Xinyang Lu, See-Kiong Ng, Bryan Kian Hsian Low", "id": "2406.14507v1", "paper_url": "http://arxiv.org/abs/2406.14507v1", "repo": "null"}}