{"2405.09396": {"publish_time": "2024-05-15", "title": "$O_2$ is a multiple context-free grammar: an implementation-, formalisation-friendly proof", "paper_summary": "Classifying formal languages according to the expressiveness of grammars able\nto generate them is a fundamental problem in computational linguistics and,\ntherefore, in the theory of computation. Furthermore, such kind of analysis can\ngive insight into the classification of abstract algebraic structure such as\ngroups, for example through the correspondence given by the word problem. While\nmany such classification problems remain open, others have been settled.\nRecently, it was proved that $n$-balanced languages (i.e., whose strings\ncontain the same occurrences of letters $a_i$ and $A_i$ with $1\\leq i \\leq n$)\ncan be generated by multiple context-free grammars (MCFGs), which are one of\nthe several slight extensions of context free grammars added to the classical\nChomsky hierarchy to make the mentioned classification more precise. This paper\nanalyses the existing proofs from the computational and the proof-theoretical\npoint of views, systematically studying whether each proof can lead to a\nverified (i.e., checked by a proof assistant) algorithm parsing balanced\nlanguages via MCFGs. We conclude that none of the existing proofs is\nrealistically suitable against this practical goal, and proceed to provide a\nradically new, elementary, extremely short proof for the crucial case $n \\leq\n2$. A comparative analysis with respect to the existing proofs is finally\nperformed to justify why the proposed proof is a substantial step towards\nconcretely obtaining a verified parsing algorithm for $O_2$.", "paper_summary_zh": "對形式語言進行分類，根據語法的表現力來產生它們，這是計算語言學中的基本問題，因此，也是計算理論中的基本問題。此外，這種分析可以洞察抽象代數結構的分類，例如群，例如通過字問題給出的對應關係。雖然許多這樣的分類問題仍然懸而未決，但其他問題已經得到解決。最近，證明了 $n$ 平衡語言（即，其字串包含相同出現次數的字母 $a_i$ 和 $A_i$，其中 $1\\leq i \\leq n$）可以由多個上下文無關文法 (MCFG) 產生，這是上下文無關文法在經典喬姆斯基層次結構中新增的幾個輕微擴充之一，用於使所述分類更精確。本文從計算和證明理論的角度分析現有證明，系統地研究每個證明是否可以導致通過 MCFG 解析平衡語言的驗證（即由證明助理檢查）演算法。我們得出結論，現有的證明沒有任何一個現實上適合這個實際目標，並繼續提供一個全新的、基礎的、極短的證明，用於關鍵情況 $n \\leq 2$。最後執行相對於現有證明的比較分析，以證明所提出的證明是朝著具體獲得 $O_2$ 的驗證解析演算法邁出的重要一步。", "author": "Marco B. Caminati et.al.", "authors": "Marco B. Caminati", "id": "2405.09396v1", "paper_url": "http://arxiv.org/abs/2405.09396v1", "repo": "null"}}