{"2502.03568": {"publish_time": "2025-02-05", "title": "Code Simulation as a Proxy for High-order Tasks in Large Language Models", "paper_summary": "Many reasoning, planning, and problem-solving tasks share an intrinsic\nalgorithmic nature: correctly simulating each step is a sufficient condition to\nsolve them correctly. We collect pairs of naturalistic and synthetic reasoning\ntasks to assess the capabilities of Large Language Models (LLM). While\nnaturalistic tasks often require careful human handcrafting, we show that\nsynthetic data is, in many cases, a good proxy that is much easier to collect\nat scale. We leverage common constructs in programming as the counterpart of\nthe building blocks of naturalistic reasoning tasks, such as straight-line\nprograms, code that contains critical paths, and approximate and redundant\ninstructions. We further assess the capabilities of LLMs on sorting problems\nand repeated operations via sorting algorithms and nested loops. Our synthetic\ndatasets further reveal that while the most powerful LLMs exhibit relatively\nstrong execution capabilities, the process is fragile: it is negatively\naffected by memorisation and seems to rely heavily on pattern recognition. Our\ncontribution builds upon synthetically testing the reasoning capabilities of\nLLMs as a scalable complement to handcrafted human-annotated problems.", "paper_summary_zh": "許多推理、規劃和問題解決任務共享一個內在的演算法性質：正確模擬每一步就足以正確解決它們。我們收集自然主義和合成推理任務對，以評估大型語言模型 (LLM) 的功能。雖然自然主義任務通常需要仔細的人工製作，但我們表明在許多情況下，合成資料是一個很好的代理，而且更容易大規模收集。我們利用程式設計中的常見建構，作為自然主義推理任務構建區塊的對應物，例如直線程式、包含關鍵路徑的程式碼，以及近似和冗餘指令。我們進一步評估 LLM 在排序問題和重複運算上的功能，透過排序演算法和巢狀迴圈。我們的合成資料集進一步揭示，雖然最強大的 LLM 表現出相對強大的執行能力，但這個過程很脆弱：它受到記憶的負面影響，而且似乎嚴重依賴模式辨識。我們的貢獻建立在以合成方式測試 LLM 的推理能力之上，作為手工編寫人類標註問題的可擴充補充。", "author": "Emanuele La Malfa et.al.", "authors": "Emanuele La Malfa, Christoph Weinhuber, Orazio Torre, Fangru Lin, X. Angelo Huang, Samuele Marro, Anthony Cohn, Nigel Shadbolt, Michael Wooldridge", "id": "2502.03568v1", "paper_url": "http://arxiv.org/abs/2502.03568v1", "repo": "null"}}