{"2408.12812": {"publish_time": "2024-08-23", "title": "Grounding Fallacies Misrepresenting Scientific Publications in Evidence", "paper_summary": "Health-related misinformation claims often falsely cite a credible biomedical\npublication as evidence, which superficially appears to support the false\nclaim. The publication does not really support the claim, but a reader could\nbelieve it thanks to the use of logical fallacies. Here, we aim to detect and\nto highlight such fallacies, which requires carefully assessing the exact\ncontent of the misrepresented publications. To achieve this, we introduce\nMissciPlus, an extension of the fallacy detection dataset Missci. MissciPlus\nbuilds on Missci by grounding the applied fallacies in real-world passages from\nmisrepresented studies. This creates a realistic test-bed for detecting and\nverbalizing these fallacies under real-world input conditions, and enables\nnovel passage-retrieval tasks. MissciPlus is the first logical fallacy dataset\nwhich pairs the real-world misrepresented evidence with incorrect claims,\nidentical to the input to evidence-based fact-checking models. With MissciPlus,\nwe i) benchmark retrieval models in identifying passages that support claims\nonly when fallacies are applied, ii) evaluate how well LLMs articulate\nfallacious reasoning from misrepresented scientific passages, and iii) assess\nthe effectiveness of fact-checking models in refuting claims that misrepresent\nbiomedical research. Our findings show that current fact-checking models\nstruggle to use relevant passages from misrepresented publications to refute\nmisinformation. Moreover, these passages can mislead LLMs into accepting false\nclaims as true.", "paper_summary_zh": "與健康相關的錯誤訊息聲稱，通常會錯誤地引用可信的生物醫學出版物作為證據，表面上似乎支持錯誤的說法。該出版物並未真正支持該說法，但讀者可能會因為使用邏輯謬誤而相信它。在此，我們旨在檢測並強調此類謬誤，這需要仔細評估被錯誤陳述出版物的確切內容。為此，我們引入了 MissciPlus，這是謬誤檢測資料集 Missci 的延伸。MissciPlus 建立在 Missci 的基礎上，將應用謬誤建立在被錯誤陳述研究的真實世界段落中。這為在現實世界的輸入條件下檢測和表達這些謬誤創造了一個現實的測試環境，並啟用了新的段落檢索任務。MissciPlus 是第一個將真實世界中被錯誤陳述的證據與不正確說法配對的邏輯謬誤資料集，與基於證據的事實查核模型的輸入相同。使用 MissciPlus，我們 i) 對檢索模型進行基準測試，以識別僅在應用謬誤時支持說法的段落，ii) 評估 LLM 如何從被錯誤陳述的科學段落中表達謬誤推理，以及 iii) 評估事實查核模型在駁斥錯誤陳述生物醫學研究的說法方面的有效性。我們的研究結果表明，當前的事實查核模型難以使用被錯誤陳述出版物中的相關段落來駁斥錯誤訊息。此外，這些段落可能會誤導 LLM，使其將錯誤的說法視為真實。", "author": "Max Glockner et.al.", "authors": "Max Glockner, Yufang Hou, Preslav Nakov, Iryna Gurevych", "id": "2408.12812v1", "paper_url": "http://arxiv.org/abs/2408.12812v1", "repo": "null"}}