{"2406.18522": {"publish_time": "2024-06-26", "title": "ChronoMagic-Bench: A Benchmark for Metamorphic Evaluation of Text-to-Time-lapse Video Generation", "paper_summary": "We propose a novel text-to-video (T2V) generation benchmark,\nChronoMagic-Bench, to evaluate the temporal and metamorphic capabilities of the\nT2V models (e.g. Sora and Lumiere) in time-lapse video generation. In contrast\nto existing benchmarks that focus on the visual quality and textual relevance\nof generated videos, ChronoMagic-Bench focuses on the model's ability to\ngenerate time-lapse videos with significant metamorphic amplitude and temporal\ncoherence. The benchmark probes T2V models for their physics, biology, and\nchemistry capabilities, in a free-form text query. For these purposes,\nChronoMagic-Bench introduces 1,649 prompts and real-world videos as references,\ncategorized into four major types of time-lapse videos: biological,\nhuman-created, meteorological, and physical phenomena, which are further\ndivided into 75 subcategories. This categorization comprehensively evaluates\nthe model's capacity to handle diverse and complex transformations. To\naccurately align human preference with the benchmark, we introduce two new\nautomatic metrics, MTScore and CHScore, to evaluate the videos' metamorphic\nattributes and temporal coherence. MTScore measures the metamorphic amplitude,\nreflecting the degree of change over time, while CHScore assesses the temporal\ncoherence, ensuring the generated videos maintain logical progression and\ncontinuity. Based on the ChronoMagic-Bench, we conduct comprehensive manual\nevaluations of ten representative T2V models, revealing their strengths and\nweaknesses across different categories of prompts, and providing a thorough\nevaluation framework that addresses current gaps in video generation research.\nMoreover, we create a large-scale ChronoMagic-Pro dataset, containing 460k\nhigh-quality pairs of 720p time-lapse videos and detailed captions ensuring\nhigh physical pertinence and large metamorphic amplitude.", "paper_summary_zh": "<paragraph>我們提出一個創新的文字轉影片 (T2V) 生成基準，ChronoMagic-Bench，用於評估時序影片生成中 T2V 模型（例如 Sora 和 Lumiere）的時間和變形能力。與現有專注於生成影片的視覺品質和文字相關性的基準不同，ChronoMagic-Bench 專注於模型生成具有顯著變形幅度和時間相干性的時序影片的能力。此基準使用自由形式文字查詢來探測 T2V 模型的物理、生物和化學能力。為此，ChronoMagic-Bench 引入了 1,649 個提示和真實影片作為參考，分為四種類型的時序影片：生物、人造、氣象和物理現象，進一步分為 75 個子類別。此分類全面評估模型處理多樣且複雜轉換的能力。為了準確地將人類偏好與基準對齊，我們引入了兩個新的自動量測標準，MTScore 和 CHScore，以評估影片的變形屬性和時間相干性。MTScore 量測變形幅度，反映時間變化的程度，而 CHScore 評估時間相干性，確保生成的影片維持邏輯進程和連續性。根據 ChronoMagic-Bench，我們對十個具代表性的 T2V 模型進行全面的手動評估，揭示它們在不同類別提示中的優缺點，並提供一個徹底的評估架構來解決影片生成研究中的現有差距。此外，我們建立了一個大型 ChronoMagic-Pro 資料集，其中包含 46 萬對高品質 720p 時序影片和詳細字幕，確保高度物理相關性和大的變形幅度。</paragraph>", "author": "Shenghai Yuan et.al.", "authors": "Shenghai Yuan, Jinfa Huang, Yongqi Xu, Yaoyang Liu, Shaofeng Zhang, Yujun Shi, Ruijie Zhu, Xinhua Cheng, Jiebo Luo, Li Yuan", "id": "2406.18522v1", "paper_url": "http://arxiv.org/abs/2406.18522v1", "repo": "null"}}