{"2407.16840": {"publish_time": "2024-07-23", "title": "Synth4Kws: Synthesized Speech for User Defined Keyword Spotting in Low Resource Environments", "paper_summary": "One of the challenges in developing a high quality custom keyword spotting\n(KWS) model is the lengthy and expensive process of collecting training data\ncovering a wide range of languages, phrases and speaking styles. We introduce\nSynth4Kws - a framework to leverage Text to Speech (TTS) synthesized data for\ncustom KWS in different resource settings. With no real data, we found\nincreasing TTS phrase diversity and utterance sampling monotonically improves\nmodel performance, as evaluated by EER and AUC metrics over 11k utterances of\nthe speech command dataset. In low resource settings, with 50k real utterances\nas a baseline, we found using optimal amounts of TTS data can improve EER by\n30.1% and AUC by 46.7%. Furthermore, we mix TTS data with varying amounts of\nreal data and interpolate the real data needed to achieve various quality\ntargets. Our experiments are based on English and single word utterances but\nthe findings generalize to i18n languages and other keyword types.", "paper_summary_zh": "開發高品質自訂關鍵字辨識 (KWS) 模型時，其中一項挑戰在於收集訓練資料的過程漫長且昂貴，而這些資料必須涵蓋廣泛的語言、詞組和說話風格。我們推出 Synth4Kws，這是一個架構，可利用文字轉語音 (TTS) 合成的資料，在不同的資源設定中進行自訂 KWS。在沒有真實資料的情況下，我們發現增加 TTS 詞組多樣性和語句取樣，會單調地提升模型效能，這點從語音指令資料集 11k 個語句的 EER 和 AUC 指標評估中可見。在低資源設定中，以 50k 個真實語句作為基準，我們發現使用最佳數量的 TTS 資料，可以將 EER 提升 30.1%，AUC 提升 46.7%。此外，我們將 TTS 資料與不同數量的真實資料混合，並插入達到各種品質目標所需的真實資料。我們的實驗基於英文和單字語句，但這些發現可以推廣到 i18n 語言和其他關鍵字類型。", "author": "Pai Zhu et.al.", "authors": "Pai Zhu, Dhruuv Agarwal, Jacob W. Bartel, Kurt Partridge, Hyun Jin Park, Quan Wang", "id": "2407.16840v1", "paper_url": "http://arxiv.org/abs/2407.16840v1", "repo": "null"}}