{"2502.02903": {"publish_time": "2025-02-05", "title": "What is in a name? Mitigating Name Bias in Text Embeddings via Anonymization", "paper_summary": "Text-embedding models often exhibit biases arising from the data on which\nthey are trained. In this paper, we examine a hitherto unexplored bias in\ntext-embeddings: bias arising from the presence of $\\textit{names}$ such as\npersons, locations, organizations etc. in the text. Our study shows how the\npresence of $\\textit{name-bias}$ in text-embedding models can potentially lead\nto erroneous conclusions in assessment of thematic similarity.Text-embeddings\ncan mistakenly indicate similarity between texts based on names in the text,\neven when their actual semantic content has no similarity or indicate\ndissimilarity simply because of the names in the text even when the texts match\nsemantically. We first demonstrate the presence of name bias in different\ntext-embedding models and then propose $\\textit{text-anonymization}$ during\ninference which involves removing references to names, while preserving the\ncore theme of the text. The efficacy of the anonymization approach is\ndemonstrated on two downstream NLP tasks, achieving significant performance\ngains. Our simple and training-optimization-free approach offers a practical\nand easily implementable solution to mitigate name bias.", "paper_summary_zh": "文本嵌入模型通常會表現出由訓練資料產生的偏差。在本文中，我們探討文本嵌入中一個迄今尚未探索的偏差：由文本中出現的人名、地點、組織等「名稱」產生的偏差。我們的研究顯示，文本嵌入模型中存在「名稱偏差」可能會導致主題相似性評估出現錯誤的結論。文本嵌入可能會錯誤地根據文本中的名稱指出文本之間的相似性，即使它們實際的語義內容沒有相似性，或者僅僅因為文本中的名稱而指出差異性，即使文本在語義上匹配。我們首先證明了不同文本嵌入模型中存在名稱偏差，然後在推論期間提出「文本匿名化」，其中涉及刪除對名稱的引用，同時保留文本的核心主題。匿名化方法的有效性在兩個下游 NLP 任務中得到證明，取得了顯著的性能提升。我們簡單且無需訓練優化的方法提供了一個實用且易於實作的解決方案，以減輕名稱偏差。", "author": "Sahil Manchanda et.al.", "authors": "Sahil Manchanda, Pannaga Shivaswamy", "id": "2502.02903v1", "paper_url": "http://arxiv.org/abs/2502.02903v1", "repo": "null"}}