{"2406.02325": {"publish_time": "2024-06-04", "title": "Technical Language Processing for Telecommunications Specifications", "paper_summary": "Large Language Models (LLMs) are continuously being applied in a more diverse\nset of contexts. At their current state, however, even state-of-the-art LLMs\nsuch as Generative Pre-Trained Transformer 4 (GTP-4) have challenges when\nextracting information from real-world technical documentation without a heavy\npreprocessing. One such area with real-world technical documentation is\ntelecommunications engineering, which could greatly benefit from\ndomain-specific LLMs. The unique format and overall structure of\ntelecommunications internal specifications differs greatly from standard\nEnglish and thus it is evident that the application of out-of-the-box Natural\nLanguage Processing (NLP) tools is not a viable option. In this article, we\noutline the limitations of out-of-the-box NLP tools for processing technical\ninformation generated by telecommunications experts, and expand the concept of\nTechnical Language Processing (TLP) to the telecommunication domain.\nAdditionally, we explore the effect of domain-specific LLMs in the work of\nSpecification Engineers, emphasizing the potential benefits of adopting\ndomain-specific LLMs to speed up the training of experts in different\ntelecommunications fields.", "paper_summary_zh": "大型語言模型 (LLM) 持續在更多元化的脈絡中被應用。然而，以其當前狀態來說，即使是像生成式預訓練Transformer 4 (GTP-4) 等最先進的 LLM，在未經大量前處理的情況下，從真實世界的技術文件萃取資訊時仍會遇到挑戰。電信工程便是其中一個擁有真實世界技術文件的領域，而該領域可以從特定領域的 LLM 中獲益良多。電信內部規格的獨特格式和整體結構與標準英語大不相同，因此顯然無法使用現成的自然語言處理 (NLP) 工具。在本文中，我們將概述現成的 NLP 工具在處理電信專家產生的技術資訊時的限制，並將技術語言處理 (TLP) 的概念擴展到電信領域。此外，我們將探討特定領域的 LLM 對規格工程師工作產生的影響，並強調採用特定領域的 LLM 以加速不同電信領域專家培訓的潛在好處。", "author": "Felipe A. Rodriguez Y. et.al.", "authors": "Felipe A. Rodriguez Y.", "id": "2406.02325v1", "paper_url": "http://arxiv.org/abs/2406.02325v1", "repo": "null"}}