{"2504.21457": {"publish_time": "2025-04-30", "title": "xEEGNet: Towards Explainable AI in EEG Dementia Classification", "paper_summary": "This work presents xEEGNet, a novel, compact, and explainable neural network\nfor EEG data analysis. It is fully interpretable and reduces overfitting\nthrough major parameter reduction. As an applicative use case, we focused on\nclassifying common dementia conditions, Alzheimer's and frontotemporal\ndementia, versus controls. xEEGNet is broadly applicable to other neurological\nconditions involving spectral alterations. We initially used ShallowNet, a\nsimple and popular model from the EEGNet-family. Its structure was analyzed and\ngradually modified to move from a \"black box\" to a more transparent model,\nwithout compromising performance. The learned kernels and weights were examined\nfrom a clinical standpoint to assess medical relevance. Model variants,\nincluding ShallowNet and the final xEEGNet, were evaluated using robust\nNested-Leave-N-Subjects-Out cross-validation for unbiased performance\nestimates. Variability across data splits was explained using embedded EEG\nrepresentations, grouped by class and set, with pairwise separability to\nquantify group distinction. Overfitting was assessed through\ntraining-validation loss correlation and training speed. xEEGNet uses only 168\nparameters, 200 times fewer than ShallowNet, yet retains interpretability,\nresists overfitting, achieves comparable median performance (-1.5%), and\nreduces variability across splits. This variability is explained by embedded\nEEG representations: higher accuracy correlates with greater separation between\ntest set controls and Alzheimer's cases, without significant influence from\ntraining data. xEEGNet's ability to filter specific EEG bands, learn\nband-specific topographies, and use relevant spectral features demonstrates its\ninterpretability. While large deep learning models are often prioritized for\nperformance, this study shows smaller architectures like xEEGNet can be equally\neffective in EEG pathology classification.", "paper_summary_zh": "<paragraph>這項工作提出了一個新穎、簡潔且可解釋的神經網路 xEEGNet，用於腦電圖 (EEG) 數據分析。它具有完全的可解釋性，並透過大幅減少參數來降低過擬合的風險。作為應用案例，我們專注於區分常見的失智症類型，阿茲海默症和額顳葉失智症，與對照組進行比較。xEEGNet 廣泛適用於其他涉及頻譜改變的神經系統疾病。我們最初使用了 ShallowNet，一個來自 EEGNet 家族的簡單且流行的模型。我們分析並逐步修改其結構，使其從一個「黑盒子」轉變為更透明的模型，且不影響其性能。從臨床角度檢查學習到的核心和權重，以評估其醫學相關性。模型變體，包括 ShallowNet 和最終的 xEEGNet，都使用穩健的 Nested-Leave-N-Subjects-Out 交叉驗證進行評估，以獲得無偏差的性能估計。使用嵌入式 EEG 表示來解釋跨數據分割的變異性，按類別和集合分組，並使用成對可分離性來量化組別區分。透過訓練-驗證損失相關性和訓練速度來評估過擬合。xEEGNet 只使用了 168 個參數，比 ShallowNet 少 200 倍，但仍保持可解釋性，抵抗過擬合，達到相當的中位數性能（-1.5%），並減少跨分割的變異性。這種變異性可以透過嵌入式 EEG 表示來解釋：更高的準確性與測試組對照組和阿茲海默症病例之間更大的分離度相關，而訓練數據沒有顯著影響。xEEGNet 過濾特定 EEG 頻段、學習特定頻段的拓撲結構以及使用相關頻譜特徵的能力證明了其可解釋性。雖然大型深度學習模型通常因其性能而被優先考慮，但这项研究表明，像 xEEGNet 这样的小型架構在 EEG 病理分類中同樣有效。</paragraph>\n", "author": "Andrea Zanola et.al.", "authors": "Andrea Zanola, Louis Fabrice Tshimanga, Federico Del Pup, Marco Baiesi, Manfredo Atzori", "id": "2504.21457v1", "paper_url": "http://arxiv.org/abs/2504.21457v1", "repo": "null"}}