{"2412.17558": {"publish_time": "2024-12-23", "title": "A Survey of Query Optimization in Large Language Models", "paper_summary": "\\textit{Query Optimization} (QO) refers to techniques aimed at enhancing the\nefficiency and quality of Large Language Models (LLMs) in understanding and\nanswering queries, especially complex ones in scenarios like\nRetrieval-Augmented Generation (RAG). Specifically, RAG mitigates the\nlimitations of LLMs by dynamically retrieving and leveraging up-to-date\nrelevant information, which provides a cost-effective solution to the challenge\nof LLMs producing plausible but potentially inaccurate responses. Recently, as\nRAG evolves and incorporates multiple components that influence its\nperformance, QO has emerged as a critical element, playing a pivotal role in\ndetermining the effectiveness of RAG's retrieval stage in accurately sourcing\nthe necessary multiple pieces of evidence to answer queries correctly. In this\npaper, we trace the evolution of QO techniques by summarizing and analyzing\nsignificant studies. Through an organized framework and categorization, we aim\nto consolidate existing QO techniques in RAG, elucidate their technological\nfoundations, and highlight their potential to enhance the versatility and\napplications of LLMs.", "paper_summary_zh": "**查詢最佳化** (QO) 係指旨在提升大型語言模型 (LLM) 理解和回答查詢的效率和品質的技術，特別是像檢索增強生成 (RAG) 等情境中的複雜查詢。具體來說，RAG 透過動態檢索和利用最新的相關資訊來緩解 LLM 的限制，這為 LLM 產生看似合理但潛在不準確的回應的挑戰提供了具成本效益的解決方案。最近，隨著 RAG 的演進並整合影響其效能的多個元件，QO 已成為一個重要的元素，在決定 RAG 檢索階段準確取得回答查詢所需要的多個證據片段的有效性方面扮演關鍵角色。在本文中，我們透過摘要和分析重要的研究來追溯 QO 技術的演進。透過有組織的架構和分類，我們旨在整合 RAG 中現有的 QO 技術，闡明其技術基礎，並強調其提升 LLM 的多功能性和應用程式的潛力。", "author": "Mingyang Song et.al.", "authors": "Mingyang Song, Mao Zheng", "id": "2412.17558v1", "paper_url": "http://arxiv.org/abs/2412.17558v1", "repo": "null"}}