{"2504.20039": {"publish_time": "2025-04-28", "title": "AutoJudge: Judge Decoding Without Manual Annotation", "paper_summary": "We introduce AutoJudge, a framework that accelerates large language model\n(LLM) inference with task-specific lossy speculative decoding. Instead of\nmatching the original model output distribution token-by-token, we identify\nwhich of the generated tokens affect the downstream quality of the generated\nresponse, relaxing the guarantee so that the \"unimportant\" tokens can be\ngenerated faster. Our approach relies on a semi-greedy search algorithm to test\nwhich of the mismatches between target and draft model should be corrected to\npreserve quality, and which ones may be skipped. We then train a lightweight\nclassifier based on existing LLM embeddings to predict, at inference time,\nwhich mismatching tokens can be safely accepted without compromising the final\nanswer quality. We test our approach with Llama 3.2 1B (draft) and Llama 3.1 8B\n(target) models on zero-shot GSM8K reasoning, where it achieves up to 1.5x more\naccepted tokens per verification cycle with under 1% degradation in answer\naccuracy compared to standard speculative decoding and over 2x with small loss\nin accuracy. When applied to the LiveCodeBench benchmark, our approach\nautomatically detects other, programming-specific important tokens and shows\nsimilar speedups, demonstrating its ability to generalize across tasks.", "paper_summary_zh": "<paragraph>我們推出 AutoJudge，這是一個利用針對特定任務的有損推測式解碼來加速大型語言模型 (LLM) 推論的框架。我們並非逐字匹配原始模型的輸出分佈，而是識別哪些生成的詞元會影響生成回應的下游品質，放寬保證，以便可以更快地生成「不重要」的詞元。我們的方法依賴於一種半貪婪搜索算法來測試目標模型和草稿模型之間哪些不匹配需要糾正以保持品質，哪些可以跳過。然後，我們基於現有的 LLM 嵌入訓練一個輕量級分類器，以便在推論時預測哪些不匹配的詞元可以安全接受，而不會影響最終答案的品質。我們使用 Llama 3.2 1B（草稿）和 Llama 3.1 8B（目標）模型在零樣本 GSM8K 推理上測試了我們的方法，與標準推測式解碼相比，它在每個驗證週期中實現了高達 1.5 倍的已接受詞元，且答案準確度下降不到 1%，而在準確度略有損失的情況下則超過 2 倍。當應用於 LiveCodeBench 基準測試時，我們的方法會自動檢測其他特定於編程的重要詞元，並顯示出類似的加速效果，證明了其跨任務泛化的能力。</paragraph>\n", "author": "Roman Garipov et.al.", "authors": "Roman Garipov, Fedor Velikonivtsev, Ruslan Svirschevski, Vage Egiazarian, Max Ryabinin", "id": "2504.20039v1", "paper_url": "http://arxiv.org/abs/2504.20039v1", "repo": "null"}}