{"2503.24379": {"publish_time": "2025-03-31", "title": "Any2Caption:Interpreting Any Condition to Caption for Controllable Video Generation", "paper_summary": "To address the bottleneck of accurate user intent interpretation within the\ncurrent video generation community, we present Any2Caption, a novel framework\nfor controllable video generation under any condition. The key idea is to\ndecouple various condition interpretation steps from the video synthesis step.\nBy leveraging modern multimodal large language models (MLLMs), Any2Caption\ninterprets diverse inputs--text, images, videos, and specialized cues such as\nregion, motion, and camera poses--into dense, structured captions that offer\nbackbone video generators with better guidance. We also introduce Any2CapIns, a\nlarge-scale dataset with 337K instances and 407K conditions for\nany-condition-to-caption instruction tuning. Comprehensive evaluations\ndemonstrate significant improvements of our system in controllability and video\nquality across various aspects of existing video generation models. Project\nPage: https://sqwu.top/Any2Cap/", "paper_summary_zh": "為了改善目前影片生成社群中準確理解使用者意圖的瓶頸，我們提出了 Any2Caption，這是一個在任何條件下都能進行可控影片生成的新穎框架。其核心概念是將各種條件解讀步驟與影片合成步驟分離。藉由利用現代的多模態大型語言模型 (MLLM)，Any2Caption 能夠將不同的輸入——文字、圖像、影片，以及像是區域、動作和攝影機姿勢等特殊提示——解讀成密集、結構化的字幕，為骨幹影片生成器提供更好的指引。我們還推出了 Any2CapIns，這是一個包含 337K 個實例和 407K 個條件的大規模資料集，用於任何條件到字幕的指令微調。全面的評估顯示，我們的系統在現有影片生成模型的各個方面，在可控性和影片品質上都有顯著的提升。專案頁面：https://sqwu.top/Any2Cap/\n", "author": "Shengqiong Wu et.al.", "authors": "Shengqiong Wu, Weicai Ye, Jiahao Wang, Quande Liu, Xintao Wang, Pengfei Wan, Di Zhang, Kun Gai, Shuicheng Yan, Hao Fei, Tat-Seng Chua", "id": "2503.24379v1", "paper_url": "http://arxiv.org/abs/2503.24379v1", "repo": "null"}}