{"2410.21719": {"publish_time": "2024-10-29", "title": "On the Statistical Complexity of Estimating VENDI Scores from Empirical Data", "paper_summary": "Reference-free evaluation metrics for generative models have recently been\nstudied in the machine learning community. As a reference-free metric, the\nVENDI score quantifies the diversity of generative models using matrix-based\nentropy from information theory. The VENDI score is usually computed through\nthe eigendecomposition of an $n \\times n$ kernel matrix for $n$ generated\nsamples. However, due to the high computational cost of eigendecomposition for\nlarge $n$, the score is often computed on sample sizes limited to a few tens of\nthousands. In this paper, we explore the statistical convergence of the VENDI\nscore and demonstrate that for kernel functions with an infinite feature map\ndimension, the evaluated score for a limited sample size may not converge to\nthe matrix-based entropy statistic. We introduce an alternative statistic\ncalled the $t$-truncated VENDI statistic. We show that the existing Nystr\\\"om\nmethod and the FKEA approximation method for the VENDI score will both converge\nto the defined truncated VENDI statistic given a moderate sample size. We\nperform several numerical experiments to illustrate the concentration of the\nempirical VENDI score around the truncated VENDI statistic and discuss how this\nstatistic correlates with the visual diversity of image data.", "paper_summary_zh": "生成模型的无参考评估指标最近已在机器学习社区中得到研究。作为无参考指标，VENDI 分数使用信息论中的基于矩阵的熵量化生成模型的多样性。VENDI 分数通常通过对 $n$ 个生成样本的 $n \\times n$ 核矩阵进行特征分解来计算。然而，由于特征分解对于较大的 $n$ 的高计算成本，因此该分数通常计算在仅限于几万个的样本量上。在本文中，我们探讨了 VENDI 分数的统计收敛性，并证明对于具有无限特征映射维度的核函数，有限样本量评估的分数可能不会收敛到基于矩阵的熵统计量。我们引入了一种称为 $t$-截断 VENDI 统计量的替代统计量。我们表明，现有的 Nystr\\\"om 方法和 VENDI 分数的 FKEA 近似方法在给定中等样本量的情况下都会收敛到定义的截断 VENDI 统计量。我们执行了几次数值实验来说明经验 VENDI 分数围绕截断 VENDI 统计量的集中度，并讨论该统计量如何与图像数据的视觉多样性相关。", "author": "Azim Ospanov et.al.", "authors": "Azim Ospanov, Farzan Farnia", "id": "2410.21719v1", "paper_url": "http://arxiv.org/abs/2410.21719v1", "repo": "null"}}