{"2411.12697": {"publish_time": "2024-11-19", "title": "Attribute Inference Attacks for Federated Regression Tasks", "paper_summary": "Federated Learning (FL) enables multiple clients, such as mobile phones and\nIoT devices, to collaboratively train a global machine learning model while\nkeeping their data localized. However, recent studies have revealed that the\ntraining phase of FL is vulnerable to reconstruction attacks, such as attribute\ninference attacks (AIA), where adversaries exploit exchanged messages and\nauxiliary public information to uncover sensitive attributes of targeted\nclients. While these attacks have been extensively studied in the context of\nclassification tasks, their impact on regression tasks remains largely\nunexplored. In this paper, we address this gap by proposing novel model-based\nAIAs specifically designed for regression tasks in FL environments. Our\napproach considers scenarios where adversaries can either eavesdrop on\nexchanged messages or directly interfere with the training process. We\nbenchmark our proposed attacks against state-of-the-art methods using\nreal-world datasets. The results demonstrate a significant increase in\nreconstruction accuracy, particularly in heterogeneous client datasets, a\ncommon scenario in FL. The efficacy of our model-based AIAs makes them better\ncandidates for empirically quantifying privacy leakage for federated regression\ntasks.", "paper_summary_zh": "聯邦學習 (FL) 能讓多個用戶端，例如行動電話和 IoT 裝置，在保持其資料在地化的同時，合作訓練一個全球機器學習模型。然而，最近的研究顯示，FL 的訓練階段容易受到重建攻擊，例如屬性推論攻擊 (AIA)，其中對手利用交換的訊息和輔助公開資訊，揭露目標用戶端的敏感屬性。雖然這些攻擊在分類任務的背景下已廣泛研究，但其對迴歸任務的影響仍未廣泛探討。在本文中，我們透過提出專門針對 FL 環境中的迴歸任務設計的新穎基於模型的 AIA，來解決這個差距。我們的做法考慮了對手可以竊聽交換訊息或直接干擾訓練過程的場景。我們使用真實世界的資料集，針對現有方法評量我們提出的攻擊。結果顯示重建精準度大幅提升，特別是在異質用戶端資料集，這是 FL 中常見的場景。我們的基於模型的 AIA 的功效，讓它們成為經驗量化聯邦迴歸任務中隱私外洩的更佳候選者。", "author": "Francesco Diana et.al.", "authors": "Francesco Diana, Othmane Marfoq, Chuan Xu, Giovanni Neglia, Frédéric Giroire, Eoin Thomas", "id": "2411.12697v1", "paper_url": "http://arxiv.org/abs/2411.12697v1", "repo": "null"}}