{"2411.17924": {"publish_time": "2024-11-26", "title": "AI2T: Building Trustable AI Tutors by Interactively Teaching a Self-Aware Learning Agent", "paper_summary": "AI2T is an interactively teachable AI for authoring intelligent tutoring\nsystems (ITSs). Authors tutor AI2T by providing a few step-by-step solutions\nand then grading AI2T's own problem-solving attempts. From just 20-30 minutes\nof interactive training, AI2T can induce robust rules for step-by-step solution\ntracking (i.e., model-tracing). As AI2T learns it can accurately estimate its\ncertainty of performing correctly on unseen problem steps using STAND: a\nself-aware precondition learning algorithm that outperforms state-of-the-art\nmethods like XGBoost. Our user study shows that authors can use STAND's\ncertainty heuristic to estimate when AI2T has been trained on enough diverse\nproblems to induce correct and complete model-tracing programs. AI2T-induced\nprograms are more reliable than hallucination-prone LLMs and prior\nauthoring-by-tutoring approaches. With its self-aware induction of hierarchical\nrules, AI2T offers a path toward trustable data-efficient authoring-by-tutoring\nfor complex ITSs that normally require as many as 200-300 hours of programming\nper hour of instruction.", "paper_summary_zh": "AI2T 是一種互動式可教授 AI，用於編寫智慧型教學系統 (ITS)。作者透過提供一些逐步解決方案並評分 AI2T 自行解決問題的嘗試，來指導 AI2T。AI2T 只需 20-30 分鐘的互動式訓練，就能推演出用於逐步解決方案追蹤（即模型追蹤）的穩健規則。隨著 AI2T 學習，它可以使用 STAND 準確估計它在未見問題步驟中正確執行任務的確定性：一種自我感知的前置條件學習演算法，其表現優於 XGBoost 等現有技術。我們的使用者研究顯示，作者可以使用 STAND 的確定性啟發法來估計 AI2T 是否已在足夠多樣化的問題上接受訓練，以推演出正確且完整的模型追蹤程式。AI2T 推演出程式比容易產生幻覺的 LLM 和先前的指導編寫方法更可靠。透過其自我感知的階層式規則推演，AI2T 提供了一條可信賴、資料有效率的指導編寫途徑，用於複雜的 ITS，這些 ITS 通常每小時教學需要長達 200-300 小時的編程。", "author": "Daniel Weitekamp et.al.", "authors": "Daniel Weitekamp, Erik Harpstead, Kenneth Koedinger", "id": "2411.17924v1", "paper_url": "http://arxiv.org/abs/2411.17924v1", "repo": "null"}}