{"2411.13181": {"publish_time": "2024-11-20", "title": "Cross-Camera Distracted Driver Classification through Feature Disentanglement and Contrastive Learning", "paper_summary": "The classification of distracted drivers is pivotal for ensuring safe\ndriving. Previous studies demonstrated the effectiveness of neural networks in\nautomatically predicting driver distraction, fatigue, and potential hazards.\nHowever, recent research has uncovered a significant loss of accuracy in these\nmodels when applied to samples acquired under conditions that differ from the\ntraining data. In this paper, we introduce a robust model designed to withstand\nchanges in camera position within the vehicle. Our Driver Behavior Monitoring\nNetwork (DBMNet) relies on a lightweight backbone and integrates a\ndisentanglement module to discard camera view information from features,\ncoupled with contrastive learning to enhance the encoding of various driver\nactions. Experiments conducted on the daytime and nighttime subsets of the\n100-Driver dataset validate the effectiveness of our approach with an increment\non average of 9\\% in Top-1 accuracy in comparison with the state of the art. In\naddition, cross-dataset and cross-camera experiments conducted on three\nbenchmark datasets, namely AUCDD-V1, EZZ2021 and SFD, demonstrate the superior\ngeneralization capability of the proposed method.", "paper_summary_zh": "分心駕駛的分類對於確保安全駕駛至關重要。先前的研究證明了神經網路在自動預測駕駛分心、疲勞和潛在危險方面的有效性。然而，最近的研究發現，當這些模型應用於在與訓練資料不同的條件下獲取的樣本時，其準確性會大幅下降。在本文中，我們引入了一個強健的模型，旨在承受車輛內攝像機位置的變化。我們的駕駛行為監控網路 (DBMNet) 依賴於輕量級主幹，並整合了一個解糾纏模組，以從特徵中丟棄攝像機視圖資訊，並結合對比學習來增強對各種駕駛動作的編碼。在 100-Driver 資料集的日間和夜間子集上進行的實驗驗證了我們方法的有效性，與現有技術相比，Top-1 準確度平均增加了 9%。此外，在三個基準資料集上進行的跨資料集和跨攝像機實驗，即 AUCDD-V1、EZZ2021 和 SFD，證明了所提出方法的優越泛化能力。", "author": "Simone Bianco et.al.", "authors": "Simone Bianco, Luigi Celona, Paolo Napoletano", "id": "2411.13181v1", "paper_url": "http://arxiv.org/abs/2411.13181v1", "repo": "null"}}