{"2408.00370": {"publish_time": "2024-08-01", "title": "DiM-Gesture: Co-Speech Gesture Generation with Adaptive Layer Normalization Mamba-2 framework", "paper_summary": "Speech-driven gesture generation is an emerging domain within virtual human\ncreation, where current methods predominantly utilize Transformer-based\narchitectures that necessitate extensive memory and are characterized by slow\ninference speeds. In response to these limitations, we propose\n\\textit{DiM-Gestures}, a novel end-to-end generative model crafted to create\nhighly personalized 3D full-body gestures solely from raw speech audio,\nemploying Mamba-based architectures. This model integrates a Mamba-based fuzzy\nfeature extractor with a non-autoregressive Adaptive Layer Normalization\n(AdaLN) Mamba-2 diffusion architecture. The extractor, leveraging a Mamba\nframework and a WavLM pre-trained model, autonomously derives implicit,\ncontinuous fuzzy features, which are then unified into a singular latent\nfeature. This feature is processed by the AdaLN Mamba-2, which implements a\nuniform conditional mechanism across all tokens to robustly model the interplay\nbetween the fuzzy features and the resultant gesture sequence. This innovative\napproach guarantees high fidelity in gesture-speech synchronization while\nmaintaining the naturalness of the gestures. Employing a diffusion model for\ntraining and inference, our framework has undergone extensive subjective and\nobjective evaluations on the ZEGGS and BEAT datasets. These assessments\nsubstantiate our model's enhanced performance relative to contemporary\nstate-of-the-art methods, demonstrating competitive outcomes with the DiTs\narchitecture (Persona-Gestors) while optimizing memory usage and accelerating\ninference speed.", "paper_summary_zh": "語音驅動手勢生成是虛擬人類創造中一個新興領域，其中當前方法主要利用 Transformer 架構，需要大量的記憶體，並且特徵是推論速度慢。為了應對這些限制，我們提出了 \\textit{DiM-Gestures}，這是一個新穎的端到端生成模型，專門用於僅從原始語音音訊建立高度個人化的 3D 全身手勢，使用基於 Mamba 的架構。此模型將基於 Mamba 的模糊特徵萃取器與非自迴歸適應層正規化 (AdaLN) Mamba-2 擴散架構整合在一起。萃取器利用 Mamba 框架和 WavLM 預訓練模型，自主地推導出隱含的、連續的模糊特徵，然後將這些特徵統一成一個單一的潛在特徵。此特徵由 AdaLN Mamba-2 處理，它在所有標記之間實作一個統一的條件機制，以穩健地模擬模糊特徵與結果手勢序列之間的交互作用。這種創新的方法保證了手勢語音同步的高保真度，同時保持手勢的自然性。透過採用擴散模型進行訓練和推論，我們的框架在 ZEGGS 和 BEAT 資料集上進行了廣泛的主觀和客觀評估。這些評估證實了我們的模型相對於當代最先進方法的增強效能，展示了與 DiTs 架構（Persona-Gestors）具有競爭力的成果，同時優化了記憶體使用量並加速了推論速度。", "author": "Fan Zhang et.al.", "authors": "Fan Zhang, Naye Ji, Fuxing Gao, Bozuo Zhao, Jingmei Wu, Yanbing Jiang, Hui Du, Zhenqing Ye, Jiayang Zhu, WeiFan Zhong, Leyao Yan, Xiaomeng Ma", "id": "2408.00370v1", "paper_url": "http://arxiv.org/abs/2408.00370v1", "repo": "null"}}