{"2410.10807": {"publish_time": "2024-10-14", "title": "Hard-Constrained Neural Networks with Universal Approximation Guarantees", "paper_summary": "Incorporating prior knowledge or specifications of input-output relationships\ninto machine learning models has gained significant attention, as it enhances\ngeneralization from limited data and leads to conforming outputs. However, most\nexisting approaches use soft constraints by penalizing violations through\nregularization, which offers no guarantee of constraint satisfaction -- an\nessential requirement in safety-critical applications. On the other hand,\nimposing hard constraints on neural networks may hinder their representational\npower, adversely affecting performance. To address this, we propose HardNet, a\npractical framework for constructing neural networks that inherently satisfy\nhard constraints without sacrificing model capacity. Specifically, we encode\naffine and convex hard constraints, dependent on both inputs and outputs, by\nappending a differentiable projection layer to the network's output. This\narchitecture allows unconstrained optimization of the network parameters using\nstandard algorithms while ensuring constraint satisfaction by construction.\nFurthermore, we show that HardNet retains the universal approximation\ncapabilities of neural networks. We demonstrate the versatility and\neffectiveness of HardNet across various applications: fitting functions under\nconstraints, learning optimization solvers, optimizing control policies in\nsafety-critical systems, and learning safe decision logic for aircraft systems.", "paper_summary_zh": "將先備知識或輸入輸出關係的規格納入機器學習模型已獲得極大的關注，因為它增強了從有限資料中進行概括的能力，並產生符合輸出的結果。然而，現有的方法大多使用軟約束，透過正則化懲罰違規，這無法保證約束滿足——安全關鍵應用程式中的基本需求。另一方面，對神經網路施加硬約束可能會阻礙其表示能力，對效能造成負面影響。為了解決此問題，我們提出 HardNet，這是一個實用的架構，用於建構在不犧牲模型容量的情況下固有地滿足硬約束的神經網路。具體來說，我們透過將可微分投影層附加到網路的輸出，對依賴輸入和輸出的仿射和凸硬約束進行編碼。此架構允許使用標準演算法對網路參數進行無約束最佳化，同時透過建構確保約束滿足。此外，我們證明 HardNet 保留了神經網路的通用逼近能力。我們展示了 HardNet 在各種應用中的多功能性和有效性：在約束下擬合函數、學習最佳化求解器、最佳化安全關鍵系統中的控制策略，以及學習飛機系統的安全決策邏輯。", "author": "Youngjae Min et.al.", "authors": "Youngjae Min, Anoopkumar Sonar, Navid Azizan", "id": "2410.10807v1", "paper_url": "http://arxiv.org/abs/2410.10807v1", "repo": "null"}}