{"2411.08017": {"publish_time": "2024-11-12", "title": "Wavelet Latent Diffusion (Wala): Billion-Parameter 3D Generative Model with Compact Wavelet Encodings", "paper_summary": "Large-scale 3D generative models require substantial computational resources\nyet often fall short in capturing fine details and complex geometries at high\nresolutions. We attribute this limitation to the inefficiency of current\nrepresentations, which lack the compactness required to model the generative\nmodels effectively. To address this, we introduce a novel approach called\nWavelet Latent Diffusion, or WaLa, that encodes 3D shapes into wavelet-based,\ncompact latent encodings. Specifically, we compress a $256^3$ signed distance\nfield into a $12^3 \\times 4$ latent grid, achieving an impressive 2427x\ncompression ratio with minimal loss of detail. This high level of compression\nallows our method to efficiently train large-scale generative networks without\nincreasing the inference time. Our models, both conditional and unconditional,\ncontain approximately one billion parameters and successfully generate\nhigh-quality 3D shapes at $256^3$ resolution. Moreover, WaLa offers rapid\ninference, producing shapes within two to four seconds depending on the\ncondition, despite the model's scale. We demonstrate state-of-the-art\nperformance across multiple datasets, with significant improvements in\ngeneration quality, diversity, and computational efficiency. We open-source our\ncode and, to the best of our knowledge, release the largest pretrained 3D\ngenerative models across different modalities.", "paper_summary_zh": "大型 3D 生成模型需要大量的计算资源，但通常在捕捉精细细节和高分辨率的复杂几何形状方面表现不佳。我们将此限制归因于当前表示形式的低效率，它缺乏对有效建模生成模型所需的紧凑性。为了解决这个问题，我们引入了一种称为小波潜在扩散或 WaLa 的新方法，它将 3D 形状编码为基于小波的紧凑潜在编码。具体来说，我们将 $256^3$ 有符号距离场压缩到 $12^3 \\times 4$ 潜在网格中，以最小的细节损失实现了令人印象深刻的 2427 倍压缩比。这种高水平的压缩允许我们的方法有效地训练大规模生成网络，而不会增加推理时间。我们的模型（条件模型和无条件模型）包含大约十亿个参数，并成功生成分辨率为 $256^3$ 的高质量 3D 形状。此外，WaLa 提供快速推理，根据条件在两到四秒内生成形状，尽管模型的规模很大。我们展示了跨多个数据集的最新性能，在生成质量、多样性和计算效率方面都有显著提高。我们开源我们的代码，并且据我们所知，发布了跨不同模态的最大预训练 3D 生成模型。", "author": "Aditya Sanghi et.al.", "authors": "Aditya Sanghi, Aliasghar Khani, Pradyumna Reddy, Arianna Rampini, Derek Cheung, Kamal Rahimi Malekshan, Kanika Madan, Hooman Shayani", "id": "2411.08017v1", "paper_url": "http://arxiv.org/abs/2411.08017v1", "repo": "null"}}