{"2405.14391": {"publish_time": "2024-05-23", "title": "Explainable Few-shot Knowledge Tracing", "paper_summary": "Knowledge tracing (KT), aiming to mine students' mastery of knowledge by\ntheir exercise records and predict their performance on future test questions,\nis a critical task in educational assessment. While researchers achieved\ntremendous success with the rapid development of deep learning techniques,\ncurrent knowledge tracing tasks fall into the cracks from real-world teaching\nscenarios. Relying heavily on extensive student data and solely predicting\nnumerical performances differs from the settings where teachers assess\nstudents' knowledge state from limited practices and provide explanatory\nfeedback. To fill this gap, we explore a new task formulation: Explainable\nFew-shot Knowledge Tracing. By leveraging the powerful reasoning and generation\nabilities of large language models (LLMs), we then propose a cognition-guided\nframework that can track the student knowledge from a few student records while\nproviding natural language explanations. Experimental results from three widely\nused datasets show that LLMs can perform comparable or superior to competitive\ndeep knowledge tracing methods. We also discuss potential directions and call\nfor future improvements in relevant topics.", "paper_summary_zh": "知識追蹤 (KT) 旨在透過學生的練習紀錄探查其知識掌握度，並預測其在未來考試題目的表現，是教育評量中的一項關鍵任務。儘管研究人員在深度學習技術的快速發展下取得了巨大的成功，但目前的知識追蹤任務卻與真實世界的教學場景格格不入。過度依賴大量的學生資料並僅預測數值表現，有別於教師從有限的練習中評估學生知識狀態並提供說明性回饋的設定。為了填補這個差距，我們探索了一項新的任務表述：可解釋的少量知識追蹤。透過利用大型語言模型 (LLM) 強大的推理和生成能力，我們提出了一個認知導向的架構，可以在從少數學生紀錄中追蹤學生的知識，同時提供自然語言的解釋。來自三個廣泛使用的資料集的實驗結果顯示，LLM 可以執行與競爭性的深度知識追蹤方法相當或更優異的表現。我們也討論了潛在的方向，並呼籲在相關主題中進行未來的改進。", "author": "Haoxuan Li et.al.", "authors": "Haoxuan Li, Jifan Yu, Yuanxin Ouyang, Zhuang Liu, Wenge Rong, Juanzi Li, Zhang Xiong", "id": "2405.14391v1", "paper_url": "http://arxiv.org/abs/2405.14391v1", "repo": "null"}}