{"2412.15563": {"publish_time": "2024-12-20", "title": "In-context Continual Learning Assisted by an External Continual Learner", "paper_summary": "Existing continual learning (CL) methods mainly rely on fine-tuning or\nadapting large language models (LLMs). They still suffer from catastrophic\nforgetting (CF). Little work has been done to exploit in-context learning (ICL)\nto leverage the extensive knowledge within LLMs for CL without updating any\nparameters. However, incrementally learning each new task in ICL necessitates\nadding training examples from each class of the task to the prompt, which\nhampers scalability as the prompt length increases. This issue not only leads\nto excessively long prompts that exceed the input token limit of the underlying\nLLM but also degrades the model's performance due to the overextended context.\nTo address this, we introduce InCA, a novel approach that integrates an\nexternal continual learner (ECL) with ICL to enable scalable CL without CF. The\nECL is built incrementally to pre-select a small subset of likely classes for\neach test instance. By restricting the ICL prompt to only these selected\nclasses, InCA prevents prompt lengths from becoming excessively long, while\nmaintaining high performance. Experimental results demonstrate that InCA\nsignificantly outperforms existing CL baselines, achieving substantial\nperformance gains.", "paper_summary_zh": "現有的持續學習 (CL) 方法主要依賴微調或調整大型語言模型 (LLM)。它們仍然會發生災難性遺忘 (CF)。鮮少有研究利用情境學習 (ICL) 來利用 LLM 中的廣泛知識進行 CL，而無需更新任何參數。然而，在 ICL 中逐步學習每項新任務都需要將每個任務類別的訓練範例新增到提示中，這會隨著提示長度增加而阻礙可擴充性。此問題不僅會導致過長的提示，超過基礎 LLM 的輸入權杖限制，還會因為過長的內容而降低模型的效能。為了解決此問題，我們引進 InCA，這是一種創新的方法，將外部持續學習器 (ECL) 與 ICL 整合，以啟用無 CF 的可擴充 CL。ECL 逐漸建置，以預先選擇每個測試實例中一小部分可能的類別。透過將 ICL 提示限制在這些選定的類別中，InCA 可防止提示長度過長，同時維持高效能。實驗結果證明，InCA 明顯優於現有的 CL 基準，並獲得顯著的效能提升。", "author": "Saleh Momeni et.al.", "authors": "Saleh Momeni, Sahisnu Mazumder, Zixuan Ke, Bing Liu", "id": "2412.15563v1", "paper_url": "http://arxiv.org/abs/2412.15563v1", "repo": "null"}}