{"2405.04324": {"publish_time": "2024-05-07", "title": "Granite Code Models: A Family of Open Foundation Models for Code Intelligence", "paper_summary": "Large Language Models (LLMs) trained on code are revolutionizing the software\ndevelopment process. Increasingly, code LLMs are being integrated into software\ndevelopment environments to improve the productivity of human programmers, and\nLLM-based agents are beginning to show promise for handling complex tasks\nautonomously. Realizing the full potential of code LLMs requires a wide range\nof capabilities, including code generation, fixing bugs, explaining and\ndocumenting code, maintaining repositories, and more. In this work, we\nintroduce the Granite series of decoder-only code models for code generative\ntasks, trained with code written in 116 programming languages. The Granite Code\nmodels family consists of models ranging in size from 3 to 34 billion\nparameters, suitable for applications ranging from complex application\nmodernization tasks to on-device memory-constrained use cases. Evaluation on a\ncomprehensive set of tasks demonstrates that Granite Code models consistently\nreaches state-of-the-art performance among available open-source code LLMs. The\nGranite Code model family was optimized for enterprise software development\nworkflows and performs well across a range of coding tasks (e.g. code\ngeneration, fixing and explanation), making it a versatile all around code\nmodel. We release all our Granite Code models under an Apache 2.0 license for\nboth research and commercial use.", "paper_summary_zh": "大型語言模型 (LLM) 接受過程式碼訓練，正在革新軟體開發流程。程式碼 LLM 愈來愈多地整合到軟體開發環境中，以提升人類程式設計師的生產力，而基於 LLM 的代理程式也開始展現出自主處理複雜任務的希望。要實現程式碼 LLM 的全部潛力，需要廣泛的功能，包括產生程式碼、修正錯誤、說明和記錄程式碼、維護儲存庫等等。在這項工作中，我們引入了 Granite 系列的僅解碼器程式碼模型，用於程式碼產生任務，並使用 116 種程式語言編寫的程式碼進行訓練。Granite Code 模型系列包含大小從 30 億到 340 億個參數不等的模型，適用於從複雜的應用程式現代化任務到裝置記憶體受限使用案例的各種應用程式。對一組全面的任務進行評估，證明 Granite Code 模型在現有的開源程式碼 LLM 中始終達到最先進的效能。Granite Code 模型系列經過最佳化，適用於企業軟體開發工作流程，並且在各種編碼任務（例如產生程式碼、修正和說明）中表現良好，使其成為一款功能強大的全方位程式碼模型。我們根據 Apache 2.0 授權釋出所有 Granite Code 模型，供研究和商業用途。", "author": "Mayank Mishra et.al.", "authors": "Mayank Mishra, Matt Stallone, Gaoyuan Zhang, Yikang Shen, Aditya Prasad, Adriana Meza Soria, Michele Merler, Parameswaran Selvam, Saptha Surendran, Shivdeep Singh, Manish Sethi, Xuan-Hong Dang, Pengyuan Li, Kun-Lung Wu, Syed Zawad, Andrew Coleman, Matthew White, Mark Lewis, Raju Pavuluri, Yan Koyfman, Boris Lublinsky, Maximilien de Bayser, Ibrahim Abdelaziz, Kinjal Basu, Mayank Agarwal, Yi Zhou, Chris Johnson, Aanchal Goyal, Hima Patel, Yousaf Shah, Petros Zerfos, Heiko Ludwig, Asim Munawar, Maxwell Crouse, Pavan Kapanipathi, Shweta Salaria, Bob Calio, Sophia Wen, Seetharami Seelam, Brian Belgodere, Carlos Fonseca, Amith Singhee, Nirmit Desai, David D. Cox, Ruchir Puri, Rameswar Panda", "id": "2405.04324v1", "paper_url": "http://arxiv.org/abs/2405.04324v1", "repo": "https://github.com/ibm-granite/granite-code-models"}}