{"2409.01437": {"publish_time": "2024-09-02", "title": "Kvasir-VQA: A Text-Image Pair GI Tract Dataset", "paper_summary": "We introduce Kvasir-VQA, an extended dataset derived from the HyperKvasir and\nKvasir-Instrument datasets, augmented with question-and-answer annotations to\nfacilitate advanced machine learning tasks in Gastrointestinal (GI)\ndiagnostics. This dataset comprises 6,500 annotated images spanning various GI\ntract conditions and surgical instruments, and it supports multiple question\ntypes including yes/no, choice, location, and numerical count. The dataset is\nintended for applications such as image captioning, Visual Question Answering\n(VQA), text-based generation of synthetic medical images, object detection, and\nclassification. Our experiments demonstrate the dataset's effectiveness in\ntraining models for three selected tasks, showcasing significant applications\nin medical image analysis and diagnostics. We also present evaluation metrics\nfor each task, highlighting the usability and versatility of our dataset. The\ndataset and supporting artifacts are available at\nhttps://datasets.simula.no/kvasir-vqa.", "paper_summary_zh": "我們引進 Kvasir-VQA，一個由 HyperKvasir 和 Kvasir-Instrument 資料集衍生的延伸資料集，並加入問題與解答註解，以促進在胃腸 (GI) 診斷中的進階機器學習任務。此資料集包含 6,500 個註解影像，涵蓋各種 GI 道狀況和手術器械，並且支援包括是非題、選擇題、位置和數字計數等多種類型的問題。此資料集適用於影像標題、視覺問答 (VQA)、合成醫學影像的文字生成、物件偵測和分類等應用程式。我們的實驗證明此資料集在訓練三個選定任務的模型中具有成效，展示了在醫學影像分析和診斷中重要的應用。我們也為每個任務提供評估指標，突顯我們資料集的可用性和多功能性。此資料集和支援工件可於 https://datasets.simula.no/kvasir-vqa 取得。", "author": "Sushant Gautam et.al.", "authors": "Sushant Gautam, Andrea Storås, Cise Midoglu, Steven A. Hicks, Vajira Thambawita, Pål Halvorsen, Michael A. Riegler", "id": "2409.01437v1", "paper_url": "http://arxiv.org/abs/2409.01437v1", "repo": "https://github.com/simula/Kvasir-VQA"}}