{"2501.04437": {"publish_time": "2025-01-08", "title": "Integrating LLMs with ITS: Recent Advances, Potentials, Challenges, and Future Directions", "paper_summary": "Intelligent Transportation Systems (ITS) are crucial for the development and\noperation of smart cities, addressing key challenges in efficiency,\nproductivity, and environmental sustainability. This paper comprehensively\nreviews the transformative potential of Large Language Models (LLMs) in\noptimizing ITS. Initially, we provide an extensive overview of ITS,\nhighlighting its components, operational principles, and overall effectiveness.\nWe then delve into the theoretical background of various LLM techniques, such\nas GPT, T5, CTRL, and BERT, elucidating their relevance to ITS applications.\nFollowing this, we examine the wide-ranging applications of LLMs within ITS,\nincluding traffic flow prediction, vehicle detection and classification,\nautonomous driving, traffic sign recognition, and pedestrian detection. Our\nanalysis reveals how these advanced models can significantly enhance traffic\nmanagement and safety. Finally, we explore the challenges and limitations LLMs\nface in ITS, such as data availability, computational constraints, and ethical\nconsiderations. We also present several future research directions and\npotential innovations to address these challenges. This paper aims to guide\nresearchers and practitioners through the complexities and opportunities of\nintegrating LLMs in ITS, offering a roadmap to create more efficient,\nsustainable, and responsive next-generation transportation systems.", "paper_summary_zh": "智慧型運輸系統 (ITS) 對智慧城市的發展和營運至關重要，能解決效率、生產力和環境永續性的關鍵挑戰。本文全面回顧大型語言模型 (LLM) 在最佳化 ITS 中的轉型潛力。首先，我們提供 ITS 的廣泛概觀，重點說明其組成、運作原理和整體效能。接著深入探討各種 LLM 技術的理論背景，例如 GPT、T5、CTRL 和 BERT，闡明它們與 ITS 應用程式的關聯性。接著，我們探討 LLM 在 ITS 中的廣泛應用，包括交通流量預測、車輛偵測與分類、自動駕駛、交通標誌辨識和行人偵測。我們的分析揭示了這些進階模型如何能大幅提升交通管理和安全性。最後，我們探討 LLM 在 ITS 中面臨的挑戰和限制，例如資料取得、運算限制和道德考量。我們也提出幾個未來的研究方向和潛在創新，以解決這些挑戰。本文旨在引導研究人員和從業人員了解在 ITS 中整合 LLM 的複雜性和機會，提供建立更有效率、永續且靈敏的下一代運輸系統的藍圖。", "author": "Doaa Mahmud et.al.", "authors": "Doaa Mahmud, Hadeel Hajmohamed, Shamma Almentheri, Shamma Alqaydi, Lameya Aldhaheri, Ruhul Amin Khalil, Nasir Saeed", "id": "2501.04437v1", "paper_url": "http://arxiv.org/abs/2501.04437v1", "repo": "null"}}