{"2406.04806": {"publish_time": "2024-06-07", "title": "TEDi Policy: Temporally Entangled Diffusion for Robotic Control", "paper_summary": "Diffusion models have been shown to excel in robotic imitation learning by\nmastering the challenge of modeling complex distributions. However, sampling\nspeed has traditionally not been a priority due to their popularity for image\ngeneration, limiting their application to dynamical tasks. While recent work\nhas improved the sampling speed of diffusion-based robotic policies, they are\nrestricted to techniques from the image generation domain. We adapt Temporally\nEntangled Diffusion (TEDi), a framework specific for trajectory generation, to\nspeed up diffusion-based policies for imitation learning. We introduce TEDi\nPolicy, with novel regimes for training and sampling, and show that it\ndrastically improves the sampling speed while remaining performant when applied\nto state-of-the-art diffusion-based imitation learning policies.", "paper_summary_zh": "擴散模型已證明在機器人模仿學習中表現出色，因為它們掌握了建模複雜分佈的挑戰。然而，由於它們在影像生成方面的普及性，取樣速度傳統上並非優先事項，這限制了它們在動態任務中的應用。儘管最近的研究改進了基於擴散的機器人策略的取樣速度，但它們僅限於影像生成領域的技術。我們調整了時間糾纏擴散 (TEDi)，這是一個專門用於軌跡生成的框架，以加速基於擴散的策略以進行模仿學習。我們引入了 TEDi 策略，並採用了新的訓練和取樣方案，並展示了它在應用於最先進的基於擴散的模仿學習策略時，大幅提升了取樣速度，同時仍保持效能。", "author": "Sigmund H. Høeg et.al.", "authors": "Sigmund H. Høeg, Lars Tingelstad", "id": "2406.04806v1", "paper_url": "http://arxiv.org/abs/2406.04806v1", "repo": "null"}}