{"2405.08760": {"publish_time": "2024-05-14", "title": "Is the Pope Catholic? Yes, the Pope is Catholic. Generative Evaluation of Intent Resolution in LLMs", "paper_summary": "Humans often express their communicative intents indirectly or non-literally,\nwhich requires their interlocutors -- human or AI -- to understand beyond the\nliteral meaning of words. While most existing work has focused on\ndiscriminative evaluations, we present a new approach to generatively evaluate\nlarge language models' (LLMs') intention understanding by examining their\nresponses to non-literal utterances. Ideally, an LLM should respond in line\nwith the true intention of a non-literal utterance, not its literal\ninterpretation. Our findings show that LLMs struggle to generate pragmatically\nrelevant responses to non-literal language, achieving only 50-55% accuracy on\naverage. While explicitly providing oracle intentions significantly improves\nperformance (e.g., 75% for Mistral-Instruct), this still indicates challenges\nin leveraging given intentions to produce appropriate responses. Using\nchain-of-thought to make models spell out intentions yields much smaller gains\n(60% for Mistral-Instruct). These findings suggest that LLMs are not yet\neffective pragmatic interlocutors, highlighting the need for better approaches\nfor modeling intentions and utilizing them for pragmatic generation.", "paper_summary_zh": "人類經常間接或非字面地表達他們的溝通意圖，這需要他們的對話者（人類或 AI）理解超越字面意思。雖然大多數現有工作都專注於區辨性評估，但我們提出了一種生成式評估大型語言模型 (LLM) 意圖理解的新方法，方法是檢查它們對非字面語句的回應。理想情況下，LLM 應根據非字面語句的真正意圖做出回應，而不是其字面解釋。我們的研究結果表明，LLM 難以對非字面語言產生語用相關的回應，平均準確率僅為 50-55%。雖然明確提供神諭意圖顯著提高了效能（例如，Mistral-Instruct 為 75%），但這仍然表明在利用給定的意圖產生適當回應方面存在挑戰。使用思維鏈讓模型拼寫出意圖產生的增益要小得多（Mistral-Instruct 為 60%）。這些發現表明，LLM 尚未成為有效的語用對話者，突顯了對建模意圖和將其用於語用生成的更好方法的需求。", "author": "Akhila Yerukola et.al.", "authors": "Akhila Yerukola, Saujas Vaduguru, Daniel Fried, Maarten Sap", "id": "2405.08760v1", "paper_url": "http://arxiv.org/abs/2405.08760v1", "repo": "https://github.com/Akhila-Yerukola/generative-intention-resolution"}}