{"2407.10743": {"publish_time": "2024-07-15", "title": "Scaling 3D Reasoning with LMMs to Large Robot Mission Environments Using Datagraphs", "paper_summary": "This paper addresses the challenge of scaling Large Multimodal Models (LMMs)\nto expansive 3D environments. Solving this open problem is especially relevant\nfor robot deployment in many first-responder scenarios, such as\nsearch-and-rescue missions that cover vast spaces. The use of LMMs in these\nsettings is currently hampered by the strict context windows that limit the\nLMM's input size. We therefore introduce a novel approach that utilizes a\ndatagraph structure, which allows the LMM to iteratively query smaller sections\nof a large environment. Using the datagraph in conjunction with graph traversal\nalgorithms, we can prioritize the most relevant locations to the query, thereby\nimproving the scalability of 3D scene language tasks. We illustrate the\ndatagraph using 3D scenes, but these can be easily substituted by other dense\nmodalities that represent the environment, such as pointclouds or Gaussian\nsplats. We demonstrate the potential to use the datagraph for two 3D scene\nlanguage task use cases, in a search-and-rescue mission example.", "paper_summary_zh": "本文討論了將大型多模態模型 (LMM) 擴展到廣闊 3D 環境的挑戰。解決這個開放性問題對於機器人在許多第一反應人員場景中的部署特別相關，例如涵蓋廣闊空間的搜救任務。這些設定中使用 LMM 目前受到嚴格的上下文視窗限制，這限制了 LMM 的輸入大小。因此，我們引入了一種新穎的方法，該方法利用資料圖結構，允許 LMM 迭代查詢大型環境的較小部分。透過將資料圖與圖形遍歷演算法結合使用，我們可以優先考慮與查詢最相關的位置，從而提高 3D 場景語言任務的可擴充性。我們使用 3D 場景說明資料圖，但這些場景可以輕鬆地由其他表示環境的密集模式取代，例如點雲或高斯點。我們展示了在搜救任務範例中使用資料圖進行兩個 3D 場景語言任務用例的潛力。", "author": "W. J. Meijer et.al.", "authors": "W. J. Meijer, A. C. Kemmeren, E. H. J. Riemens, J. E. Fransman, M. van Bekkum, G. J. Burghouts, J. D. van Mil", "id": "2407.10743v1", "paper_url": "http://arxiv.org/abs/2407.10743v1", "repo": "null"}}