{"2502.14614": {"publish_time": "2025-02-20", "title": "FIND: Fine-grained Information Density Guided Adaptive Retrieval-Augmented Generation for Disease Diagnosis", "paper_summary": "Retrieval-Augmented Large Language Models (LLMs), which integrate external\nknowledge into LLMs, have shown remarkable performance in various medical\ndomains, including clinical diagnosis. However, existing RAG methods struggle\nto effectively assess task difficulty to make retrieval decisions, thereby\nfailing to meet the clinical requirements for balancing efficiency and\naccuracy. So in this paper, we propose FIND (\\textbf{F}ine-grained\n\\textbf{In}formation \\textbf{D}ensity Guided Adaptive RAG), a novel framework\nthat improves the reliability of RAG in disease diagnosis scenarios. FIND\nincorporates a fine-grained adaptive control module to determine whether\nretrieval is necessary based on the information density of the input. By\noptimizing the retrieval process and implementing a knowledge filtering module,\nFIND ensures that the retrieval is better suited to clinical scenarios.\nExperiments on three Chinese electronic medical record datasets demonstrate\nthat FIND significantly outperforms various baseline methods, highlighting its\neffectiveness in clinical diagnosis tasks.", "paper_summary_zh": "檢索增強大型語言模型 (LLM)，將外部知識整合至 LLM，已於各種醫療領域展現出卓越效能，包括臨床診斷。然而，現有的 RAG 方法難以有效評估任務難度以做出檢索決策，因此無法滿足平衡效率和精確度的臨床需求。因此，我們在本文中提出 FIND（**F**ine-grained **In**formation **D**ensity Guided Adaptive RAG），一種新穎架構，可提升 RAG 在疾病診斷場景中的可靠性。FIND 整合一個細緻化的自適應控制模組，根據輸入的資訊密度判斷是否需要檢索。透過最佳化檢索程序並實作一個知識過濾模組，FIND 確保檢索更適合臨床場景。在三個中文電子病歷資料集上的實驗顯示，FIND 明顯優於各種基線方法，突顯其在臨床診斷任務中的有效性。", "author": "Mingyi Jia et.al.", "authors": "Mingyi Jia, Junwen Duan, Yan Song, Jianxin Wang", "id": "2502.14614v1", "paper_url": "http://arxiv.org/abs/2502.14614v1", "repo": "null"}}