{"2412.18154": {"publish_time": "2024-12-24", "title": "GeneSUM: Large Language Model-based Gene Summary Extraction", "paper_summary": "Emerging topics in biomedical research are continuously expanding, providing\na wealth of information about genes and their function. This rapid\nproliferation of knowledge presents unprecedented opportunities for scientific\ndiscovery and formidable challenges for researchers striving to keep abreast of\nthe latest advancements. One significant challenge is navigating the vast\ncorpus of literature to extract vital gene-related information, a\ntime-consuming and cumbersome task. To enhance the efficiency of this process,\nit is crucial to address several key challenges: (1) the overwhelming volume of\nliterature, (2) the complexity of gene functions, and (3) the automated\nintegration and generation. In response, we propose GeneSUM, a two-stage\nautomated gene summary extractor utilizing a large language model (LLM). Our\napproach retrieves and eliminates redundancy of target gene literature and then\nfine-tunes the LLM to refine and streamline the summarization process. We\nconducted extensive experiments to validate the efficacy of our proposed\nframework. The results demonstrate that LLM significantly enhances the\nintegration of gene-specific information, allowing more efficient\ndecision-making in ongoing research.", "paper_summary_zh": "生物醫學研究中不斷擴展的新興主題，提供了大量關於基因及其功能的資訊。知識的快速擴散為科學發現提供了前所未有的機會，也為努力跟上最新進展的研究人員帶來了巨大的挑戰。其中一項重大挑戰是瀏覽大量的文獻，以提取重要的基因相關資訊，這項任務既耗時又繁瑣。為了提高此流程的效率，必須解決幾個關鍵挑戰：(1) 大量的文獻，(2) 基因功能的複雜性，以及 (3) 自動整合和生成。為了解決這些問題，我們提出了 GeneSUM，這是一個利用大型語言模型 (LLM) 的兩階段自動基因摘要萃取器。我們的做法是擷取並消除目標基因文獻的冗餘，然後微調 LLM 以優化和簡化摘要流程。我們進行了廣泛的實驗，以驗證我們提出的架構的功效。結果表明，LLM 大幅增強了基因特定資訊的整合，讓正在進行的研究能夠更有效率地進行決策。", "author": "Zhijian Chen et.al.", "authors": "Zhijian Chen, Chuan Hu, Min Wu, Qingqing Long, Xuezhi Wang, Yuanchun Zhou, Meng Xiao", "id": "2412.18154v1", "paper_url": "http://arxiv.org/abs/2412.18154v1", "repo": "null"}}