{"2409.17699": {"publish_time": "2024-09-26", "title": "MoJE: Mixture of Jailbreak Experts, Naive Tabular Classifiers as Guard for Prompt Attacks", "paper_summary": "The proliferation of Large Language Models (LLMs) in diverse applications\nunderscores the pressing need for robust security measures to thwart potential\njailbreak attacks. These attacks exploit vulnerabilities within LLMs, endanger\ndata integrity and user privacy. Guardrails serve as crucial protective\nmechanisms against such threats, but existing models often fall short in terms\nof both detection accuracy, and computational efficiency. This paper advocates\nfor the significance of jailbreak attack prevention on LLMs, and emphasises the\nrole of input guardrails in safeguarding these models. We introduce MoJE\n(Mixture of Jailbreak Expert), a novel guardrail architecture designed to\nsurpass current limitations in existing state-of-the-art guardrails. By\nemploying simple linguistic statistical techniques, MoJE excels in detecting\njailbreak attacks while maintaining minimal computational overhead during model\ninference. Through rigorous experimentation, MoJE demonstrates superior\nperformance capable of detecting 90% of the attacks without compromising benign\nprompts, enhancing LLMs security against jailbreak attacks.", "paper_summary_zh": "大型語言模型 (LLM) 在各種應用中激增，這凸顯了對強大安全措施的迫切需求，以阻止潛在的越獄攻擊。這些攻擊會利用 LLM 中的漏洞，危害資料完整性和使用者隱私。防護措施可作為對抗此類威脅的關鍵保護機制，但現有模型在偵測準確性和運算效率方面往往不足。本文主張在 LLM 上預防越獄攻擊的重要性，並強調輸入防護措施在保護這些模型中的作用。我們介紹了 MoJE（越獄專家混合），這是一種新穎的防護措施架構，旨在超越現有最先進防護措施中的當前限制。透過採用簡單的語言統計技術，MoJE 在偵測越獄攻擊方面表現出色，同時在模型推論期間保持最小的運算負擔。透過嚴謹的實驗，MoJE 展示了優異的效能，能夠偵測 90% 的攻擊，而不會影響良性的提示，增強 LLM 對越獄攻擊的安全性。", "author": "Giandomenico Cornacchia et.al.", "authors": "Giandomenico Cornacchia, Giulio Zizzo, Kieran Fraser, Muhammad Zaid Hamed, Ambrish Rawat, Mark Purcell", "id": "2409.17699v1", "paper_url": "http://arxiv.org/abs/2409.17699v1", "repo": "null"}}