{"2410.22304": {"publish_time": "2024-10-29", "title": "Flow-DPO: Improving LLM Mathematical Reasoning through Online Multi-Agent Learning", "paper_summary": "Mathematical reasoning is a crucial capability for Large Language Models\n(LLMs), yet generating detailed and accurate reasoning traces remains a\nsignificant challenge. This paper introduces a novel approach to produce\nhigh-quality reasoning traces for LLM fine-tuning using online learning\n\\textbf{Flows}. Our method employs an incremental output production Flow, where\ncomponent LLMs collaboratively construct solutions through iterative\ncommunication. We train the Flow using online Direct Preference Optimization\n(DPO) learning with rollouts, generating DPO pairs for each training example\nand updating models in real-time. We directly compare the quality of reasoning\ntraces generated by our method with those produced through direct model\ninference, demonstrating the effectiveness of our approach in improving LLM\nperformance in mathematical reasoning tasks.", "paper_summary_zh": "對於大型語言模型 (LLM) 來說，數學推理是一項至關重要的能力，但要產生詳細且準確的推理追蹤仍然是一項重大挑戰。本文介紹了一種新方法，使用在線學習「流程」為 LLM 微調產生高品質的推理追蹤。我們的模型採用增量輸出產生流程，其中組成 LLM 透過反覆溝通協作建構解法。我們使用在線直接偏好最佳化 (DPO) 學習和執行，為每個訓練範例產生 DPO 對，並即時更新模型。我們直接比較我們的模型產生的推理追蹤品質與直接模型推論產生的品質，證明了我們的方法在改善 LLM 在數學推理任務中的效能上具有成效。", "author": "Yihe Deng et.al.", "authors": "Yihe Deng, Paul Mineiro", "id": "2410.22304v1", "paper_url": "http://arxiv.org/abs/2410.22304v1", "repo": "null"}}