{"2409.17596": {"publish_time": "2024-09-26", "title": "Subjective and Objective Quality-of-Experience Evaluation Study for Live Video Streaming", "paper_summary": "In recent years, live video streaming has gained widespread popularity across\nvarious social media platforms. Quality of experience (QoE), which reflects\nend-users' satisfaction and overall experience, plays a critical role for media\nservice providers to optimize large-scale live compression and transmission\nstrategies to achieve perceptually optimal rate-distortion trade-off. Although\nmany QoE metrics for video-on-demand (VoD) have been proposed, there remain\nsignificant challenges in developing QoE metrics for live video streaming. To\nbridge this gap, we conduct a comprehensive study of subjective and objective\nQoE evaluations for live video streaming. For the subjective QoE study, we\nintroduce the first live video streaming QoE dataset, TaoLive QoE, which\nconsists of $42$ source videos collected from real live broadcasts and $1,155$\ncorresponding distorted ones degraded due to a variety of streaming\ndistortions, including conventional streaming distortions such as compression,\nstalling, as well as live streaming-specific distortions like frame skipping,\nvariable frame rate, etc. Subsequently, a human study was conducted to derive\nsubjective QoE scores of videos in the TaoLive QoE dataset. For the objective\nQoE study, we benchmark existing QoE models on the TaoLive QoE dataset as well\nas publicly available QoE datasets for VoD scenarios, highlighting that current\nmodels struggle to accurately assess video QoE, particularly for live content.\nHence, we propose an end-to-end QoE evaluation model, Tao-QoE, which integrates\nmulti-scale semantic features and optical flow-based motion features to\npredicting a retrospective QoE score, eliminating reliance on statistical\nquality of service (QoS) features.", "paper_summary_zh": "<paragraph>近年來，直播影片串流在各種社群媒體平台上獲得廣泛的歡迎。體驗品質 (QoE) 反映了最終使用者的滿意度和整體體驗，對於媒體服務供應商來說扮演了重要的角色，以最佳化大規模的直播壓縮和傳輸策略，以達成在感官上最佳的速率失真權衡。儘管已經提出了許多針對視訊隨選 (VoD) 的 QoE 指標，但對於直播影片串流的 QoE 指標的開發仍有重大的挑戰。為了彌補這個差距，我們對直播影片串流的主觀和客觀 QoE 評量進行了一項全面的研究。對於主觀 QoE 研究，我們引入了第一個直播影片串流 QoE 資料集，TaoLive QoE，其中包含從真實直播中收集的 $42$ 個來源影片和 $1,155$ 個對應的失真影片，這些影片是由於各種串流失真而降低的，包括傳統的串流失真（例如壓縮、停頓），以及直播特定失真（例如跳格、可變幀率等）。隨後，進行了一項人體研究，以得出 TaoLive QoE 資料集中影片的主觀 QoE 分數。對於客觀 QoE 研究，我們在 TaoLive QoE 資料集以及公開可用的 VoD 場景 QoE 資料集上對現有的 QoE 模型進行基準測試，強調目前的模型難以準確評估影片 QoE，特別是對於直播內容。因此，我們提出了一個端對端的 QoE 評量模型 Tao-QoE，它整合了多尺度的語意特徵和基於光流的運動特徵，以預測回顧性的 QoE 分數，消除了對服務品質 (QoS) 統計特徵的依賴。</paragraph>", "author": "Zehao Zhu et.al.", "authors": "Zehao Zhu, Wei Sun, Jun Jia, Wei Wu, Sibin Deng, Kai Li, Ying Chen, Xiongkuo Min, Jia Wang, Guangtao Zhai", "id": "2409.17596v1", "paper_url": "http://arxiv.org/abs/2409.17596v1", "repo": "null"}}