{"2502.11829": {"publish_time": "2025-02-17", "title": "Code-Vision: Evaluating Multimodal LLMs Logic Understanding and Code Generation Capabilities", "paper_summary": "This paper introduces Code-Vision, a benchmark designed to evaluate the\nlogical understanding and code generation capabilities of Multimodal Large\nLanguage Models (MLLMs). It challenges MLLMs to generate a correct program that\nfulfills specific functionality requirements based on a given flowchart, which\nvisually represents the desired algorithm or process. Code-Vision comprises\nthree subsets: HumanEval-V, Algorithm, and MATH, which evaluate MLLMs' coding\nabilities across basic programming, algorithmic, and mathematical\nproblem-solving domains. Our experiments evaluate 12 MLLMs on Code-Vision.\nExperimental results demonstrate that there is a large performance difference\nbetween proprietary and open-source models. On Hard problems, GPT-4o can\nachieve 79.3% pass@1, but the best open-source model only achieves 15%. Further\nexperiments reveal that Code-Vision can pose unique challenges compared to\nother multimodal reasoning benchmarks MMCode and MathVista. We also explore the\nreason for the poor performance of the open-source models. All data and codes\nare available at https://github.com/wanghanbinpanda/CodeVision.", "paper_summary_zh": "本文介绍 Code-Vision，此基准测试旨在评估多模态大型语言模型 (MLLM) 的逻辑理解和代码生成能力。它要求 MLLM 根据给定的流程图生成一个正确的程序，以满足特定的功能需求，而流程图直观地表示所需的算法或流程。Code-Vision 包含三个子集：HumanEval-V、Algorithm 和 MATH，它们评估 MLLM 在基本编程、算法和数学问题解决域中的编码能力。我们的实验对 Code-Vision 上的 12 个 MLLM 进行了评估。实验结果表明，专有模型和开源模型之间的性能差异很大。在困难问题上，GPT-4o 可以达到 79.3% 的 pass@1，但最好的开源模型只能达到 15%。进一步的实验表明，与其他多模态推理基准 MMCode 和 MathVista 相比，Code-Vision 可能会带来独特的挑战。我们还探讨了开源模型性能不佳的原因。所有数据和代码均可在 https://github.com/wanghanbinpanda/CodeVision 中获得。", "author": "Hanbin Wang et.al.", "authors": "Hanbin Wang, Xiaoxuan Zhou, Zhipeng Xu, Keyuan Cheng, Yuxin Zuo, Kai Tian, Jingwei Song, Junting Lu, Wenhui Hu, Xueyang Liu", "id": "2502.11829v1", "paper_url": "http://arxiv.org/abs/2502.11829v1", "repo": "null"}}