{"2412.18194": {"publish_time": "2024-12-24", "title": "VLABench: A Large-Scale Benchmark for Language-Conditioned Robotics Manipulation with Long-Horizon Reasoning Tasks", "paper_summary": "General-purposed embodied agents are designed to understand the users'\nnatural instructions or intentions and act precisely to complete universal\ntasks. Recently, methods based on foundation models especially\nVision-Language-Action models (VLAs) have shown a substantial potential to\nsolve language-conditioned manipulation (LCM) tasks well. However, existing\nbenchmarks do not adequately meet the needs of VLAs and relative algorithms. To\nbetter define such general-purpose tasks in the context of LLMs and advance the\nresearch in VLAs, we present VLABench, an open-source benchmark for evaluating\nuniversal LCM task learning. VLABench provides 100 carefully designed\ncategories of tasks, with strong randomization in each category of task and a\ntotal of 2000+ objects. VLABench stands out from previous benchmarks in four\nkey aspects: 1) tasks requiring world knowledge and common sense transfer, 2)\nnatural language instructions with implicit human intentions rather than\ntemplates, 3) long-horizon tasks demanding multi-step reasoning, and 4)\nevaluation of both action policies and language model capabilities. The\nbenchmark assesses multiple competencies including understanding of\nmesh\\&texture, spatial relationship, semantic instruction, physical laws,\nknowledge transfer and reasoning, etc. To support the downstream finetuning, we\nprovide high-quality training data collected via an automated framework\nincorporating heuristic skills and prior information. The experimental results\nindicate that both the current state-of-the-art pretrained VLAs and the\nworkflow based on VLMs face challenges in our tasks.", "paper_summary_zh": "<paragraph>通用具身代理旨在了解使用者的自然指令或意圖，並準確執行以完成通用任務。最近，基於基礎模型的方法，尤其是視覺語言動作模型 (VLA)，已展現出解決語言條件操作 (LCM) 任務的巨大潛力。然而，現有的基準並未充分滿足 VLA 和相關演算法的需求。為了在 LLM 的背景下更好地定義此類通用任務並推動 VLA 的研究，我們提出了 VLABench，一個用於評估通用 LCM 任務學習的開源基準。VLABench 提供 100 個精心設計的任務類別，每個任務類別都有強大的隨機性，總共有 2000 多個物件。VLABench 在四個關鍵方面優於以前的基準：1) 需要世界知識和常識轉移的任務，2) 具有隱含人類意圖的自然語言指令，而不是範本，3) 要求多步驟推理的長時程任務，以及 4) 動作策略和語言模型能力的評估。該基準評估了多項能力，包括對網格和紋理、空間關係、語義指令、物理定律、知識轉移和推理等的理解。為了支援下游微調，我們透過結合啟發式技能和先驗資訊的自動化框架，提供了高品質的訓練資料。實驗結果表明，目前最先進的預訓練 VLA 和基於 VLM 的工作流程在我們的任務中都面臨挑戰。</paragraph>", "author": "Shiduo Zhang et.al.", "authors": "Shiduo Zhang, Zhe Xu, Peiju Liu, Xiaopeng Yu, Yuan Li, Qinghui Gao, Zhaoye Fei, Zhangyue Yin, Zuxuan Wu, Yu-Gang Jiang, Xipeng Qiu", "id": "2412.18194v1", "paper_url": "http://arxiv.org/abs/2412.18194v1", "repo": "null"}}