{"2312.11747": {"publish_time": "2023-12-18", "title": "Robust Stochastic Graph Generator for Counterfactual Explanations", "paper_summary": "Counterfactual Explanation (CE) techniques have garnered attention as a means\nto provide insights to the users engaging with AI systems. While extensively\nresearched in domains such as medical imaging and autonomous vehicles, Graph\nCounterfactual Explanation (GCE) methods have been comparatively\nunder-explored. GCEs generate a new graph similar to the original one, with a\ndifferent outcome grounded on the underlying predictive model. Among these GCE\ntechniques, those rooted in generative mechanisms have received relatively\nlimited investigation despite demonstrating impressive accomplishments in other\ndomains, such as artistic styles and natural language modelling. The preference\nfor generative explainers stems from their capacity to generate counterfactual\ninstances during inference, leveraging autonomously acquired perturbations of\nthe input graph. Motivated by the rationales above, our study introduces\nRSGG-CE, a novel Robust Stochastic Graph Generator for Counterfactual\nExplanations able to produce counterfactual examples from the learned latent\nspace considering a partially ordered generation sequence. Furthermore, we\nundertake quantitative and qualitative analyses to compare RSGG-CE's\nperformance against SoA generative explainers, highlighting its increased\nability to engendering plausible counterfactual candidates.", "paper_summary_zh": "反事實解釋 (CE) 技術已引起關注，作為一種為與 AI 系統互動的使用者提供見解的方法。雖然在醫學影像和自動駕駛汽車等領域廣泛研究，圖形反事實解釋 (GCE) 方法相對較少被探索。GCE 會產生一個類似於原始圖形的新圖形，並根據基礎預測模型產生不同的結果。在這些 GCE 技術中，儘管在其他領域（例如藝術風格和自然語言建模）中展現出令人印象深刻的成就，但植基於生成機制的技術獲得的關注相對有限。對生成式解釋器的偏好源於它們在推理期間產生反事實實例的能力，利用輸入圖形的自主獲取擾動。基於上述理由，我們的研究引入了 RSGG-CE，一種用於反事實解釋的新型穩健隨機圖形生成器，能夠從學習到的潛在空間中產生反事實範例，考慮部分有序的生成序列。此外，我們進行定量和定性分析，以比較 RSGG-CE 的效能與 SoA 生成式解釋器，強調其增強了產生合理解釋候選的能力。", "author": "Mario Alfonso Prado-Romero et.al.", "authors": "Mario Alfonso Prado-Romero, Bardh Prenkaj, Giovanni Stilo", "id": "2312.11747v2", "paper_url": "http://arxiv.org/abs/2312.11747v2", "repo": "null"}}