{"2407.07330": {"publish_time": "2024-07-10", "title": "Interpretable Differential Diagnosis with Dual-Inference Large Language Models", "paper_summary": "Methodological advancements to automate the generation of differential\ndiagnosis (DDx) to predict a list of potential diseases as differentials given\npatients' symptom descriptions are critical to clinical reasoning and\napplications such as decision support. However, providing reasoning or\ninterpretation for these differential diagnoses is more meaningful.\nFortunately, large language models (LLMs) possess powerful language processing\nabilities and have been proven effective in various related tasks. Motivated by\nthis potential, we investigate the use of LLMs for interpretable DDx. First, we\ndevelop a new DDx dataset with expert-derived interpretation on 570 public\nclinical notes. Second, we propose a novel framework, named Dual-Inf, that\nenables LLMs to conduct bidirectional inference for interpretation. Both human\nand automated evaluation demonstrate the effectiveness of Dual-Inf in\npredicting differentials and diagnosis explanations. Specifically, the\nperformance improvement of Dual-Inf over the baseline methods exceeds 32%\nw.r.t. BERTScore in DDx interpretation. Furthermore, experiments verify that\nDual-Inf (1) makes fewer errors in interpretation, (2) has great\ngeneralizability, (3) is promising for rare disease diagnosis and explanation.", "paper_summary_zh": "方法學的進展自動化生成差異診斷 (DDx)，以預測給定患者症狀描述的潛在疾病清單，對於臨床推理和決策支援等應用至關重要。然而，提供這些差異診斷的推理或解釋更有意義。幸運的是，大型語言模型 (LLM) 擁有強大的語言處理能力，並已被證明在各種相關任務中有效。受此潛力的激勵，我們研究了 LLM 在可解釋的 DDx 中的應用。首先，我們開發了一個新的 DDx 數據集，其中包含專家對 570 個公共臨床筆記的解釋。其次，我們提出了一個名為 Dual-Inf 的新框架，它使 LLM 能夠進行雙向推理以進行解釋。人類和自動化評估都證明了 Dual-Inf 在預測差異和診斷解釋方面的有效性。具體來說，Dual-Inf 在 DDx 解釋中超過基線方法的性能改進超過 32% w.r.t. BERTScore。此外，實驗驗證了 Dual-Inf (1) 在解釋中產生較少的錯誤，(2) 具有很好的概括性，(3) 對罕見疾病的診斷和解釋很有前景。", "author": "Shuang Zhou et.al.", "authors": "Shuang Zhou, Sirui Ding, Jiashuo Wang, Mingquan Lin, Genevieve B. Melton, Rui Zhang", "id": "2407.07330v1", "paper_url": "http://arxiv.org/abs/2407.07330v1", "repo": "null"}}