{"2405.06522": {"publish_time": "2024-05-10", "title": "Heterogeneous Graph Neural Networks with Loss-decrease-aware Curriculum Learning", "paper_summary": "In recent years, heterogeneous graph neural networks (HGNNs) have achieved\nexcellent performance in handling heterogeneous information networks (HINs).\nCurriculum learning is a machine learning strategy where training examples are\npresented to a model in a structured order, starting with easy examples and\ngradually increasing difficulty, aiming to improve learning efficiency and\ngeneralization. To better exploit the rich information in HINs, previous\nmethods have started to explore the use of curriculum learning strategy to\ntrain HGNNs. Specifically, these works utilize the absolute value of the loss\nat each training epoch to evaluate the learning difficulty of each training\nsample. However, the relative loss, rather than the absolute value of loss,\nreveals the learning difficulty. Therefore, we propose a novel\nloss-decrease-aware training schedule (LDTS). LDTS uses the trend of loss\ndecrease between each training epoch to better evaluating the difficulty of\ntraining samples, thereby enhancing the curriculum learning of HGNNs for\ndownstream tasks. Additionally, we propose a sampling strategy to alleviate\ntraining imbalance issues. Our method further demonstrate the efficacy of\ncurriculum learning in enhancing HGNNs capabilities. We call our method\nLoss-decrease-aware Heterogeneous Graph Neural Networks (LDHGNN). The code is\npublic at https://github.com/wangyili00/LDHGNN.", "paper_summary_zh": "近年来，异构图神经网络（HGNN）在处理异构信息网络（HIN）方面取得了优异的性能。课程学习是一种机器学习策略，其中训练示例以结构化顺序呈现给模型，从简单的示例开始，逐渐增加难度，旨在提高学习效率和泛化能力。为了更好地利用 HIN 中丰富的的信息，以前的方法已经开始探索使用课程学习策略来训练 HGNN。具体来说，这些工作利用每个训练 epoch 的损失的绝对值来评估每个训练样本的学习难度。然而，相对损失而不是损失的绝对值揭示了学习难度。因此，我们提出了一种新颖的损失减少感知训练计划（LDTS）。LDTS 使用每个训练 epoch 之间的损失减少趋势来更好地评估训练样本的难度，从而增强 HGNN 对下游任务的课程学习。此外，我们提出了一种采样策略来缓解训练不平衡问题。我们的方法进一步证明了课程学习在增强 HGNN 能力方面的有效性。我们称我们的方法为损失减少感知异构图神经网络（LDHGNN）。代码在 https://github.com/wangyili00/LDHGNN 公开。", "author": "Yili Wang et.al.", "authors": "Yili Wang", "id": "2405.06522v1", "paper_url": "http://arxiv.org/abs/2405.06522v1", "repo": "https://github.com/wangyili00/ldhgnn"}}