{"2409.17126": {"publish_time": "2024-09-25", "title": "Blox-Net: Generative Design-for-Robot-Assembly Using VLM Supervision, Physics Simulation, and a Robot with Reset", "paper_summary": "Generative AI systems have shown impressive capabilities in creating text,\ncode, and images. Inspired by the rich history of research in industrial\n''Design for Assembly'', we introduce a novel problem: Generative\nDesign-for-Robot-Assembly (GDfRA). The task is to generate an assembly based on\na natural language prompt (e.g., ''giraffe'') and an image of available\nphysical components, such as 3D-printed blocks. The output is an assembly, a\nspatial arrangement of these components, and instructions for a robot to build\nthis assembly. The output must 1) resemble the requested object and 2) be\nreliably assembled by a 6 DoF robot arm with a suction gripper. We then present\nBlox-Net, a GDfRA system that combines generative vision language models with\nwell-established methods in computer vision, simulation, perturbation analysis,\nmotion planning, and physical robot experimentation to solve a class of GDfRA\nproblems with minimal human supervision. Blox-Net achieved a Top-1 accuracy of\n63.5% in the ''recognizability'' of its designed assemblies (eg, resembling\ngiraffe as judged by a VLM). These designs, after automated perturbation\nredesign, were reliably assembled by a robot, achieving near-perfect success\nacross 10 consecutive assembly iterations with human intervention only during\nreset prior to assembly. Surprisingly, this entire design process from textual\nword (''giraffe'') to reliable physical assembly is performed with zero human\nintervention.", "paper_summary_zh": "生成式 AI 系統在建立文字、程式碼和影像方面展現出令人印象深刻的能力。受到工業「組裝設計」研究豐富歷史的啟發，我們提出了一個新的問題：生成式機器人組裝設計 (GDfRA)。這項任務是根據自然語言提示（例如「長頸鹿」）和可用實體元件（例如 3D 列印積木）的影像來產生組裝。輸出是一個組裝，這些元件的空間配置，以及機器人組裝此組裝的說明。輸出必須 1) 類似於請求的物件，且 2) 能夠由具有吸盤夾具的 6 DoF 機器手臂可靠地組裝。接著我們提出 Blox-Net，這是一個 GDfRA 系統，結合了生成式視覺語言模型與電腦視覺、模擬、擾動分析、動作規劃和實體機器人實驗中已建立良好的方法，以解決一類 GDfRA 問題，且只需最少的人工監督。在組裝設計的「可辨識性」方面，Blox-Net 達到了 63.5% 的 Top-1 精確度（例如，經由 VLM 判斷類似於長頸鹿）。這些設計在自動擾動重新設計後，由機器人可靠地組裝，在 10 次連續組裝反覆運算中達到近乎完美的成功率，只有在組裝前重設時才需要人工介入。令人驚訝的是，從文字詞彙（「長頸鹿」）到可靠的實體組裝，整個設計過程完全沒有人工介入。", "author": "Andrew Goldberg et.al.", "authors": "Andrew Goldberg, Kavish Kondap, Tianshuang Qiu, Zehan Ma, Letian Fu, Justin Kerr, Huang Huang, Kaiyuan Chen, Kuan Fang, Ken Goldberg", "id": "2409.17126v1", "paper_url": "http://arxiv.org/abs/2409.17126v1", "repo": "null"}}