{"2502.13550": {"publish_time": "2025-02-19", "title": "STaR-SQL: Self-Taught Reasoner for Text-to-SQL", "paper_summary": "Generating step-by-step \"chain-of-thought\" rationales has proven effective\nfor improving the performance of large language models on complex reasoning\ntasks. However, applying such techniques to structured tasks, such as\ntext-to-SQL, remains largely unexplored. In this paper, we introduce\nSelf-Taught Reasoner for text-to-SQL (STaR-SQL), a novel approach that reframes\nSQL query generation as a reasoning-driven process. Our method prompts the LLM\nto produce detailed reasoning steps for SQL queries and fine-tunes it on\nrationales that lead to correct outcomes. Unlike traditional methods, STaR-SQL\ndedicates additional test-time computation to reasoning, thereby positioning\nLLMs as spontaneous reasoners rather than mere prompt-based agents. To further\nscale the inference process, we incorporate an outcome-supervised reward model\n(ORM) as a verifier, which enhances SQL query accuracy. Experimental results on\nthe challenging Spider benchmark demonstrate that STaR-SQL significantly\nimproves text-to-SQL performance, achieving an execution accuracy of 86.6%.\nThis surpasses a few-shot baseline by 31.6% and a baseline fine-tuned to\npredict answers directly by 18.0%. Additionally, STaR-SQL outperforms\nagent-like prompting methods that leverage more powerful yet closed-source\nmodels such as GPT-4. These findings underscore the potential of\nreasoning-augmented training for structured tasks and open the door to\nextending self-improving reasoning models to text-to-SQL generation and beyond.", "paper_summary_zh": "<paragraph>生成逐步的「思維鏈」論述已被證實能有效改善大型語言模型在複雜推理任務中的表現。然而，將此類技術應用於結構化任務（例如文字轉 SQL）仍鮮少被探討。在本文中，我們介紹了文字轉 SQL 的自學推理器 (STaR-SQL)，這是一種新穎的方法，將 SQL 查詢生成重新定義為一個由推理驅動的過程。我們的模型促使 LLM 為 SQL 查詢產生詳細的推理步驟，並針對能產生正確結果的論述進行微調。與傳統方法不同，STaR-SQL 在測試時額外投入運算資源進行推理，因此將 LLM 定位為自發的推理者，而非單純基於提示的代理人。為了進一步擴大推論過程，我們將結果監督回饋模型 (ORM) 納入其中作為驗證器，以提升 SQL 查詢的準確度。在具有挑戰性的 Spider 基準測試中的實驗結果證明，STaR-SQL 大幅提升了文字轉 SQL 的表現，執行準確度達到 86.6%。這比少次學習的基準高出 31.6%，比直接預測答案的微調基準高出 18.0%。此外，STaR-SQL 也優於利用功能更強大但封閉原始碼模型（例如 GPT-4）的代理提示方法。這些發現突顯了推理增強訓練在結構化任務中的潛力，並為將自我提升推理模型擴展到文字轉 SQL 生成及其他領域開啟了大門。</paragraph>", "author": "Mingqian He et.al.", "authors": "Mingqian He, Yongliang Shen, Wenqi Zhang, Qiuying Peng, Jun Wang, Weiming Lu", "id": "2502.13550v1", "paper_url": "http://arxiv.org/abs/2502.13550v1", "repo": "null"}}