{"2501.11786": {"publish_time": "2025-01-20", "title": "Synthetic Data Can Mislead Evaluations: Membership Inference as Machine Text Detection", "paper_summary": "Recent work shows membership inference attacks (MIAs) on large language\nmodels (LLMs) produce inconclusive results, partly due to difficulties in\ncreating non-member datasets without temporal shifts. While researchers have\nturned to synthetic data as an alternative, we show this approach can be\nfundamentally misleading. Our experiments indicate that MIAs function as\nmachine-generated text detectors, incorrectly identifying synthetic data as\ntraining samples regardless of the data source. This behavior persists across\ndifferent model architectures and sizes, from open-source models to commercial\nones such as GPT-3.5. Even synthetic text generated by different, potentially\nlarger models is classified as training data by the target model. Our findings\nhighlight a serious concern: using synthetic data in membership evaluations may\nlead to false conclusions about model memorization and data leakage. We caution\nthat this issue could affect other evaluations using model signals such as loss\nwhere synthetic or machine-generated translated data substitutes for real-world\nsamples.", "paper_summary_zh": "最近的研究顯示，針對大型語言模型 (LLM) 的會員推論攻擊 (MIA) 會產生不確定的結果，部分原因是難以在沒有時間變動的情況下建立非會員資料集。儘管研究人員已轉向合成資料作為替代方案，但我們證明這種方法可能會產生根本性的誤導。我們的實驗表明，MIA 會作為機器產生的文字偵測器，不正確地將合成資料識別為訓練樣本，無論資料來源為何。這種行為會持續存在於不同的模型架構和規模中，從開源模型到商業模型，例如 GPT-3.5。即使是由不同且潛在更大的模型產生的合成文字，也會被目標模型分類為訓練資料。我們的發現凸顯了一個嚴重的問題：在會員評估中使用合成資料可能會導致關於模型記憶和資料外洩的錯誤結論。我們謹慎提醒，這個問題可能會影響其他使用模型訊號的評估，例如損失，其中合成或機器產生的翻譯資料會取代真實世界的樣本。", "author": "Ali Naseh et.al.", "authors": "Ali Naseh, Niloofar Mireshghallah", "id": "2501.11786v1", "paper_url": "http://arxiv.org/abs/2501.11786v1", "repo": "null"}}