{"2405.11338": {"publish_time": "2024-05-18", "title": "EyeFound: A Multimodal Generalist Foundation Model for Ophthalmic Imaging", "paper_summary": "Artificial intelligence (AI) is vital in ophthalmology, tackling tasks like\ndiagnosis, classification, and visual question answering (VQA). However,\nexisting AI models in this domain often require extensive annotation and are\ntask-specific, limiting their clinical utility. While recent developments have\nbrought about foundation models for ophthalmology, they are limited by the need\nto train separate weights for each imaging modality, preventing a comprehensive\nrepresentation of multi-modal features. This highlights the need for versatile\nfoundation models capable of handling various tasks and modalities in\nophthalmology. To address this gap, we present EyeFound, a multimodal\nfoundation model for ophthalmic images. Unlike existing models, EyeFound learns\ngeneralizable representations from unlabeled multimodal retinal images,\nenabling efficient model adaptation across multiple applications. Trained on\n2.78 million images from 227 hospitals across 11 ophthalmic modalities,\nEyeFound facilitates generalist representations and diverse multimodal\ndownstream tasks, even for detecting challenging rare diseases. It outperforms\nprevious work RETFound in diagnosing eye diseases, predicting systemic disease\nincidents, and zero-shot multimodal VQA. EyeFound provides a generalizable\nsolution to improve model performance and lessen the annotation burden on\nexperts, facilitating widespread clinical AI applications from retinal imaging.", "paper_summary_zh": "人工智慧（AI）對於眼科至關重要，它能處理診斷、分類和視覺問題解答（VQA）等任務。然而，這個領域現有的 AI 模型通常需要大量的註解，而且特定於任務，這限制了它們的臨床效用。雖然最近的發展為眼科帶來了基礎模型，但它們受到為每個影像模式訓練獨立權重的需求限制，這阻礙了多模式特徵的全面表示。這凸顯了需要能夠處理眼科中各種任務和模式的多功能基礎模型。為了解決這個差距，我們提出了 EyeFound，一個用於眼科影像的多模式基礎模型。與現有模型不同，EyeFound 從未標記的多模式視網膜影像中學習可概括的表示，從而能夠跨多個應用程式有效地調整模型。EyeFound 訓練了來自 11 種眼科模式的 227 家醫院的 278 萬張影像，它促進了通才表示和多樣化的多模式下游任務，甚至可以偵測具有挑戰性的罕見疾病。它在診斷眼疾、預測全身疾病事件和零次學習多模式 VQA 方面優於先前的 RETFound。EyeFound 提供了一個可概括的解決方案，以改善模型效能並減輕專家的註解負擔，從而促進視網膜影像的廣泛臨床 AI 應用。", "author": "Danli Shi et.al.", "authors": "Danli Shi, Weiyi Zhang, Xiaolan Chen, Yexin Liu, Jianchen Yang, Siyu Huang, Yih Chung Tham, Yingfeng Zheng, Mingguang He", "id": "2405.11338v1", "paper_url": "http://arxiv.org/abs/2405.11338v1", "repo": "null"}}