{"2410.03736": {"publish_time": "2024-09-30", "title": "CliMB: An AI-enabled Partner for Clinical Predictive Modeling", "paper_summary": "Despite its significant promise and continuous technical advances, real-world\napplications of artificial intelligence (AI) remain limited. We attribute this\nto the \"domain expert-AI-conundrum\": while domain experts, such as clinician\nscientists, should be able to build predictive models such as risk scores, they\nface substantial barriers in accessing state-of-the-art (SOTA) tools. While\nautomated machine learning (AutoML) has been proposed as a partner in clinical\npredictive modeling, many additional requirements need to be fulfilled to make\nmachine learning accessible for clinician scientists.\n  To address this gap, we introduce CliMB, a no-code AI-enabled partner\ndesigned to empower clinician scientists to create predictive models using\nnatural language. CliMB guides clinician scientists through the entire medical\ndata science pipeline, thus empowering them to create predictive models from\nreal-world data in just one conversation. CliMB also creates structured reports\nand interpretable visuals. In evaluations involving clinician scientists and\nsystematic comparisons against a baseline GPT-4, CliMB consistently\ndemonstrated superior performance in key areas such as planning, error\nprevention, code execution, and model performance. Moreover, in blinded\nassessments involving 45 clinicians from diverse specialties and career stages,\nmore than 80% preferred CliMB over GPT-4. Overall, by providing a no-code\ninterface with clear guidance and access to SOTA methods in the fields of\ndata-centric AI, AutoML, and interpretable ML, CliMB empowers clinician\nscientists to build robust predictive models.", "paper_summary_zh": "儘管人工智能 (AI) 承諾重大且技術持續進步，但實際世界中的人工智慧應用仍有限。我們將此歸因於「領域專家-AI-難題」：儘管領域專家（例如臨床科學家）應能建立預測模型（例如風險評分），但他們在取得最先進 (SOTA) 工具時面臨重大障礙。儘管已提出自動機器學習 (AutoML) 作為臨床預測模型的合作夥伴，但仍需要滿足許多額外需求，才能讓臨床科學家使用機器學習。\n為了解決此差距，我們引入了 CliMB，這是一個免編碼、AI 驅動的合作夥伴，旨在讓臨床科學家能夠使用自然語言建立預測模型。CliMB 引導臨床科學家完成整個醫學數據科學流程，從而讓他們能夠在一次對話中從真實世界資料建立預測模型。CliMB 也會建立結構化報告和可解釋的視覺化。在涉及臨床科學家和系統性比較基準 GPT-4 的評估中，CliMB 在規劃、錯誤預防、程式碼執行和模型效能等關鍵領域持續展現出卓越的效能。此外，在涉及來自不同專科和職業階段的 45 位臨床醫生的盲測評估中，超過 80% 的人偏好 CliMB 勝過 GPT-4。整體而言，透過提供免編碼介面、明確指南，並取得資料為中心 AI、AutoML 和可解釋 ML 領域的 SOTA 方法，CliMB 能讓臨床科學家建立穩健的預測模型。", "author": "Evgeny Saveliev et.al.", "authors": "Evgeny Saveliev, Tim Schubert, Thomas Pouplin, Vasilis Kosmoliaptsis, Mihaela van der Schaar", "id": "2410.03736v1", "paper_url": "http://arxiv.org/abs/2410.03736v1", "repo": "null"}}