{"2406.17888": {"publish_time": "2024-06-25", "title": "CTBench: A Comprehensive Benchmark for Evaluating Language Model Capabilities in Clinical Trial Design", "paper_summary": "CTBench is introduced as a benchmark to assess language models (LMs) in\naiding clinical study design. Given study-specific metadata, CTBench evaluates\nAI models' ability to determine the baseline features of a clinical trial (CT),\nwhich include demographic and relevant features collected at the trial's start\nfrom all participants. These baseline features, typically presented in CT\npublications (often as Table 1), are crucial for characterizing study cohorts\nand validating results. Baseline features, including confounders and\ncovariates, are also necessary for accurate treatment effect estimation in\nstudies involving observational data. CTBench consists of two datasets:\n\"CT-Repo,\" containing baseline features from 1,690 clinical trials sourced from\nclinicaltrials.gov, and \"CT-Pub,\" a subset of 100 trials with more\ncomprehensive baseline features gathered from relevant publications. Two\nLM-based evaluation methods are developed to compare the actual baseline\nfeature lists against LM-generated responses. \"ListMatch-LM\" and\n\"ListMatch-BERT\" use GPT-4o and BERT scores (at various thresholds),\nrespectively, for evaluation. To establish baseline results, advanced prompt\nengineering techniques using LLaMa3-70B-Instruct and GPT-4o in zero-shot and\nthree-shot learning settings are applied to generate potential baseline\nfeatures. The performance of GPT-4o as an evaluator is validated through\nhuman-in-the-loop evaluations on the CT-Pub dataset, where clinical experts\nconfirm matches between actual and LM-generated features. The results highlight\na promising direction with significant potential for improvement, positioning\nCTBench as a useful tool for advancing research on AI in CT design and\npotentially enhancing the efficacy and robustness of CTs.", "paper_summary_zh": "CTBench 被引入作為一個基準，用於評估語言模型 (LM) 在幫助臨床研究設計中的作用。CTBench 會評估 AI 模型在給定特定研究的元數據後，決定臨床試驗 (CT) 基線特徵的能力，其中包括在試驗開始時從所有參與者收集的人口統計和相關特徵。這些基線特徵通常會在 CT 出版物中呈現（通常是表格 1），對於表徵研究群組和驗證結果至關重要。基線特徵（包括混淆因子和協變量）對於準確估計涉及觀察數據的研究中的治療效果也很有必要。CTBench 包含兩個數據集：「CT-Repo」，其中包含來自 clinicaltrials.gov 的 1,690 個臨床試驗的基線特徵，以及「CT-Pub」，一個包含 100 個試驗的子集，其中包含從相關出版物收集的更全面的基線特徵。開發了兩種基於 LM 的評估方法，用於比較實際的基線特徵列表和 LM 生成的回應。「ListMatch-LM」和「ListMatch-BERT」分別使用 GPT-4o 和 BERT 分數（在各種閾值下）進行評估。為了建立基線結果，在零次學習和三次學習設置中使用 LLaMa3-70B-Instruct 和 GPT-4o 的進階提示工程技術，用於生成潛在的基線特徵。GPT-4o 作為評估器的性能通過在 CT-Pub 數據集上進行人機交互評估得到驗證，在該評估中，臨床專家確認實際特徵和 LM 生成的特徵之間的匹配。結果突顯了一個有希望的方向，具有顯著的改進潛力，將 CTBench 定位為促進 CT 設計中 AI 研究的有用工具，並有可能提高 CT 的功效和穩健性。", "author": "Nafis Neehal et.al.", "authors": "Nafis Neehal, Bowen Wang, Shayom Debopadhaya, Soham Dan, Keerthiram Murugesan, Vibha Anand, Kristin P. Bennett", "id": "2406.17888v1", "paper_url": "http://arxiv.org/abs/2406.17888v1", "repo": "null"}}