{"2405.02957": {"publish_time": "2024-05-05", "title": "Agent Hospital: A Simulacrum of Hospital with Evolvable Medical Agents", "paper_summary": "In this paper, we introduce a simulacrum of hospital called Agent Hospital\nthat simulates the entire process of treating illness. All patients, nurses,\nand doctors are autonomous agents powered by large language models (LLMs). Our\ncentral goal is to enable a doctor agent to learn how to treat illness within\nthe simulacrum. To do so, we propose a method called MedAgent-Zero. As the\nsimulacrum can simulate disease onset and progression based on knowledge bases\nand LLMs, doctor agents can keep accumulating experience from both successful\nand unsuccessful cases. Simulation experiments show that the treatment\nperformance of doctor agents consistently improves on various tasks. More\ninterestingly, the knowledge the doctor agents have acquired in Agent Hospital\nis applicable to real-world medicare benchmarks. After treating around ten\nthousand patients (real-world doctors may take over two years), the evolved\ndoctor agent achieves a state-of-the-art accuracy of 93.06% on a subset of the\nMedQA dataset that covers major respiratory diseases. This work paves the way\nfor advancing the applications of LLM-powered agent techniques in medical\nscenarios.", "paper_summary_zh": "在本文中，我們介紹了一個名為 Agent Hospital 的醫院模擬器，它模擬了治療疾病的整個過程。所有患者、護士和醫生都是由大型語言模型 (LLM) 驅動的自主代理。我們的核心目標是讓醫生代理學習如何在模擬器中治療疾病。為此，我們提出了一種名為 MedAgent-Zero 的方法。由於模擬器可以根據知識庫和 LLM 模擬疾病的發作和進展，因此醫生代理可以持續累積來自成功和失敗案例的經驗。模擬實驗表明，醫生代理的治療表現持續改善各種任務。更有趣的是，醫生代理在 Agent Hospital 中獲得的知識適用於現實世界的醫療基準。在治療大約一萬名患者後（現實世界的醫生可能需要兩年以上），進化的醫生代理在涵蓋主要呼吸道疾病的 MedQA 數據集子集中達到了 93.06% 的最新準確度。這項工作為推進 LLM 驅動的代理技術在醫療場景中的應用鋪平了道路。", "author": "Junkai Li et.al.", "authors": "Junkai Li, Siyu Wang, Meng Zhang, Weitao Li, Yunghwei Lai, Xinhui Kang, Weizhi Ma, Yang Liu", "id": "2405.02957v1", "paper_url": "http://arxiv.org/abs/2405.02957v1", "repo": "null"}}