{"2409.12192": {"publish_time": "2024-09-18", "title": "DynaMo: In-Domain Dynamics Pretraining for Visuo-Motor Control", "paper_summary": "Imitation learning has proven to be a powerful tool for training complex\nvisuomotor policies. However, current methods often require hundreds to\nthousands of expert demonstrations to handle high-dimensional visual\nobservations. A key reason for this poor data efficiency is that visual\nrepresentations are predominantly either pretrained on out-of-domain data or\ntrained directly through a behavior cloning objective. In this work, we present\nDynaMo, a new in-domain, self-supervised method for learning visual\nrepresentations. Given a set of expert demonstrations, we jointly learn a\nlatent inverse dynamics model and a forward dynamics model over a sequence of\nimage embeddings, predicting the next frame in latent space, without\naugmentations, contrastive sampling, or access to ground truth actions.\nImportantly, DynaMo does not require any out-of-domain data such as Internet\ndatasets or cross-embodied datasets. On a suite of six simulated and real\nenvironments, we show that representations learned with DynaMo significantly\nimprove downstream imitation learning performance over prior self-supervised\nlearning objectives, and pretrained representations. Gains from using DynaMo\nhold across policy classes such as Behavior Transformer, Diffusion Policy, MLP,\nand nearest neighbors. Finally, we ablate over key components of DynaMo and\nmeasure its impact on downstream policy performance. Robot videos are best\nviewed at https://dynamo-ssl.github.io", "paper_summary_zh": "模仿學習已被證明是訓練複雜視覺運動策略的強大工具。然而，目前的方法通常需要數百到數千個專家示範才能處理高維度視覺觀察。造成此數據效率不佳的一個關鍵原因是視覺表示主要預先訓練於領域外數據或直接透過行為複製目標進行訓練。在這項工作中，我們提出 DynaMo，一種新的領域內自監督方法，用於學習視覺表示。給定一組專家示範，我們共同學習一個潛在逆動態模型和一個正向動態模型，在影像嵌入序列上預測潛在空間中的下一幀，而無需擴充、對比取樣或存取地面真實動作。重要的是，DynaMo 不需要任何領域外數據，例如網際網路資料集或跨體態資料集。在一組六個模擬和真實環境中，我們展示了使用 DynaMo 學習的表示顯著改善了下游模仿學習效能，優於先前的自監督學習目標和預先訓練的表示。使用 DynaMo 的好處適用於各種策略類別，例如行為轉換器、擴散策略、MLP 和最近鄰。最後，我們對 DynaMo 的關鍵組成部分進行消融，並衡量其對下游策略效能的影響。機器人影片最適合在 https://dynamo-ssl.github.io 觀看", "author": "Zichen Jeff Cui et.al.", "authors": "Zichen Jeff Cui, Hengkai Pan, Aadhithya Iyer, Siddhant Haldar, Lerrel Pinto", "id": "2409.12192v1", "paper_url": "http://arxiv.org/abs/2409.12192v1", "repo": "null"}}