{"2503.14411": {"publish_time": "2025-03-18", "title": "Unifying Text Semantics and Graph Structures for Temporal Text-attributed Graphs with Large Language Models", "paper_summary": "Temporal graph neural networks (TGNNs) have shown remarkable performance in\ntemporal graph modeling. However, real-world temporal graphs often possess rich\ntextual information, giving rise to temporal text-attributed graphs (TTAGs).\nSuch combination of dynamic text semantics and evolving graph structures\nintroduces heightened complexity. Existing TGNNs embed texts statically and\nrely heavily on encoding mechanisms that biasedly prioritize structural\ninformation, overlooking the temporal evolution of text semantics and the\nessential interplay between semantics and structures for synergistic\nreinforcement. To tackle these issues, we present \\textbf{{Cross}}, a novel\nframework that seamlessly extends existing TGNNs for TTAG modeling. The key\nidea is to employ the advanced large language models (LLMs) to extract the\ndynamic semantics in text space and then generate expressive representations\nunifying both semantics and structures. Specifically, we propose a Temporal\nSemantics Extractor in the {Cross} framework, which empowers the LLM to offer\nthe temporal semantic understanding of node's evolving contexts of textual\nneighborhoods, facilitating semantic dynamics. Subsequently, we introduce the\nSemantic-structural Co-encoder, which collaborates with the above Extractor for\nsynthesizing illuminating representations by jointly considering both semantic\nand structural information while encouraging their mutual reinforcement.\nExtensive experimental results on four public datasets and one practical\nindustrial dataset demonstrate {Cross}'s significant effectiveness and\nrobustness.", "paper_summary_zh": "<paragraph>時序圖神經網路 (TGNNs) 在時序圖建模中展現了卓越的性能。然而，現實世界的時序圖通常包含豐富的文本資訊，從而產生了時序文本屬性圖 (TTAGs)。這種動態文本語義和演變圖結構的組合引入了更高的複雜性。現有的 TGNNs 靜態地嵌入文本，並且嚴重依賴於編碼機制，這些機制偏向於優先考慮結構資訊，而忽略了文本語義的時間演變以及語義和結構之間的必要相互作用以產生協同增強作用。為了應對這些問題，我們提出了 **Cross**，這是一個將現有 TGNNs 無縫擴展到 TTAG 建模的新穎框架。其關鍵思想是利用先進的大型語言模型 (LLMs) 來提取文本空間中的動態語義，然後生成融合語義和結構的表達性表示。具體來說，我們在 Cross 框架中提出了一個時序語義提取器，它使 LLM 能夠提供對節點文本鄰域演變上下文的時序語義理解，從而促進語義動態。隨後，我們引入了語義結構聯合編碼器，它與上述提取器協作，通過共同考慮語義和結構資訊，同時促進它們的相互增強，來合成具有啟發性的表示。在四個公共數據集和一個實際工業數據集上的大量實驗結果證明了 Cross 的顯著有效性和穩健性。</paragraph>\n", "author": "Siwei Zhang et.al.", "authors": "Siwei Zhang, Yun Xiong, Yateng Tang, Xi Chen, Zian Jia, Zehao Gu, Jiarong Xu, Jiawei Zhang", "id": "2503.14411v1", "paper_url": "http://arxiv.org/abs/2503.14411v1", "repo": "null"}}