{"2412.03025": {"publish_time": "2024-12-04", "title": "Human Variability vs. Machine Consistency: A Linguistic Analysis of Texts Generated by Humans and Large Language Models", "paper_summary": "The rapid advancements in large language models (LLMs) have significantly\nimproved their ability to generate natural language, making texts generated by\nLLMs increasingly indistinguishable from human-written texts. Recent research\nhas predominantly focused on using LLMs to classify text as either\nhuman-written or machine-generated. In our study, we adopt a different approach\nby profiling texts spanning four domains based on 250 distinct linguistic\nfeatures. We select the M4 dataset from the Subtask B of SemEval 2024 Task 8.\nWe automatically calculate various linguistic features with the LFTK tool and\nadditionally measure the average syntactic depth, semantic similarity, and\nemotional content for each document. We then apply a two-dimensional PCA\nreduction to all the calculated features. Our analyses reveal significant\ndifferences between human-written texts and those generated by LLMs,\nparticularly in the variability of these features, which we find to be\nconsiderably higher in human-written texts. This discrepancy is especially\nevident in text genres with less rigid linguistic style constraints. Our\nfindings indicate that humans write texts that are less cognitively demanding,\nwith higher semantic content, and richer emotional content compared to texts\ngenerated by LLMs. These insights underscore the need for incorporating\nmeaningful linguistic features to enhance the understanding of textual outputs\nof LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 的快速進展顯著提升了它們生成自然語言的能力，讓 LLM 生成的文字越來越難以與人類寫的文字區分。最近的研究主要集中於使用 LLM 將文字分類為人類寫的或機器生成的。在我們的研究中，我們採用不同的方法，根據 250 個不同的語言特徵對跨越四個領域的文字進行分析。我們從 SemEval 2024 任務 8 的子任務 B 中選取 M4 資料集。我們使用 LFTK 工具自動計算各種語言特徵，並另外測量每個文件的平均句法深度、語義相似度和情緒內容。然後，我們對所有計算出的特徵應用二維 PCA 降維。我們的分析揭示了人類寫的文字和 LLM 生成的文字之間的顯著差異，特別是在這些特徵的可變性方面，我們發現人類寫的文字的可變性顯著較高。這種差異在語言風格約束較少的文字類型中尤其明顯。我們的研究結果表明，人類寫的文字認知要求較低，語義內容較高，與 LLM 生成的文字相比，情緒內容也更豐富。這些見解強調了納入有意義的語言特徵以增強對 LLM 文本輸出的理解的必要性。", "author": "Sergio E. Zanotto et.al.", "authors": "Sergio E. Zanotto, Segun Aroyehun", "id": "2412.03025v1", "paper_url": "http://arxiv.org/abs/2412.03025v1", "repo": "null"}}