{"2410.14157": {"publish_time": "2024-10-18", "title": "Beyond Autoregression: Discrete Diffusion for Complex Reasoning and Planning", "paper_summary": "Autoregressive language models, despite their impressive capabilities,\nstruggle with complex reasoning and long-term planning tasks. We introduce\ndiscrete diffusion models as a novel solution to these challenges. Through the\nlens of subgoal imbalance, we demonstrate how diffusion models effectively\nlearn difficult subgoals that elude autoregressive approaches. We propose\nMulti-granularity Diffusion Modeling (MDM), which prioritizes subgoals based on\ndifficulty during learning. On complex tasks like Countdown, Sudoku, and\nBoolean Satisfiability Problems, MDM significantly outperforms autoregressive\nmodels without using search techniques. For instance, MDM achieves 91.5\\% and\n100\\% accuracy on Countdown and Sudoku, respectively, compared to 45.8\\% and\n20.7\\% for autoregressive models. Our work highlights the potential of\ndiffusion-based approaches in advancing AI capabilities for sophisticated\nlanguage understanding and problem-solving tasks.", "paper_summary_zh": "儘管自迴歸語言模型功能強大，\n但在複雜推理和長期規劃任務上仍有困難。我們提出離散擴散模型作為解決這些挑戰的新穎方法。透過子目標失衡的觀點，我們展示擴散模型如何有效學習自迴歸方法無法達成的困難子目標。我們提出多粒度擴散模型 (MDM)，在學習過程中根據難度對子目標進行優先排序。在倒數、數獨和布林可滿足性問題等複雜任務中，MDM 在不使用搜尋技術的情況下明顯優於自迴歸模型。例如，MDM 在倒數和數獨中的準確率分別達到 91.5% 和 100%，而自迴歸模型的準確率分別為 45.8% 和 20.7%。我們的研究突顯了基於擴散的方法在提升 AI 能力以進行精密的語言理解和問題解決任務方面的潛力。", "author": "Jiacheng Ye et.al.", "authors": "Jiacheng Ye, Jiahui Gao, Shansan Gong, Lin Zheng, Xin Jiang, Zhenguo Li, Lingpeng Kong", "id": "2410.14157v1", "paper_url": "http://arxiv.org/abs/2410.14157v1", "repo": "null"}}