{"2407.10873": {"publish_time": "2024-07-15", "title": "Understanding the Importance of Evolutionary Search in Automated Heuristic Design with Large Language Models", "paper_summary": "Automated heuristic design (AHD) has gained considerable attention for its\npotential to automate the development of effective heuristics. The recent\nadvent of large language models (LLMs) has paved a new avenue for AHD, with\ninitial efforts focusing on framing AHD as an evolutionary program search (EPS)\nproblem. However, inconsistent benchmark settings, inadequate baselines, and a\nlack of detailed component analysis have left the necessity of integrating LLMs\nwith search strategies and the true progress achieved by existing LLM-based EPS\nmethods to be inadequately justified. This work seeks to fulfill these research\nqueries by conducting a large-scale benchmark comprising four LLM-based EPS\nmethods and four AHD problems across nine LLMs and five independent runs. Our\nextensive experiments yield meaningful insights, providing empirical grounding\nfor the importance of evolutionary search in LLM-based AHD approaches, while\nalso contributing to the advancement of future EPS algorithmic development. To\nfoster accessibility and reproducibility, we have fully open-sourced our\nbenchmark and corresponding results.", "paper_summary_zh": "自動啟發式設計 (AHD) 因其自動化有效啟發式開發的潛力而備受關注。大型語言模型 (LLM) 的最新出現為 AHD 開闢了一條新途徑，最初的努力集中於將 AHD 構建為演化程式搜尋 (EPS) 問題。然而，不一致的基準設定、不足的基準線以及缺乏詳細的組件分析，使得將 LLM 與搜尋策略整合的必要性以及現有基於 LLM 的 EPS 方法取得的真正進展，缺乏充分的證明。這項工作旨在透過進行大規模基準測試來滿足這些研究查詢，其中包含四種基於 LLM 的 EPS 方法和四個 AHD 問題，涵蓋九個 LLM 和五次獨立執行。我們廣泛的實驗產生有意義的見解，為基於 LLM 的 AHD 方法中演化搜尋的重要性提供經驗依據，同時也有助於推進未來的 EPS 演算法開發。為了促進可及性和可複製性，我們已完全開放原始碼我們的基準測試和對應結果。", "author": "Rui Zhang et.al.", "authors": "Rui Zhang, Fei Liu, Xi Lin, Zhenkun Wang, Zhichao Lu, Qingfu Zhang", "id": "2407.10873v1", "paper_url": "http://arxiv.org/abs/2407.10873v1", "repo": "null"}}