{"2501.07957": {"publish_time": "2025-01-14", "title": "AI Guide Dog: Egocentric Path Prediction on Smartphone", "paper_summary": "This paper introduces AI Guide Dog (AIGD), a lightweight egocentric\nnavigation assistance system for visually impaired individuals, designed for\nreal-time deployment on smartphones. AIGD addresses key challenges in blind\nnavigation by employing a vision-only, multi-label classification approach to\npredict directional commands, ensuring safe traversal across diverse\nenvironments. We propose a novel technique to enable goal-based outdoor\nnavigation by integrating GPS signals and high-level directions, while also\naddressing uncertain multi-path predictions for destination-free indoor\nnavigation. Our generalized model is the first navigation assistance system to\nhandle both goal-oriented and exploratory navigation scenarios across indoor\nand outdoor settings, establishing a new state-of-the-art in blind navigation.\nWe present methods, datasets, evaluations, and deployment insights to encourage\nfurther innovations in assistive navigation systems.", "paper_summary_zh": "本篇論文介紹 AI 導盲犬 (AIGD)，這是一種輕量級的第一人稱導航輔助系統，專門為視障人士設計，可在智慧型手機上即時部署。AIGD 透過採用僅視覺的多標籤分類方法來預測方向指令，解決盲人導航中的關鍵挑戰，確保在不同的環境中安全穿越。我們提出了一種新技術，透過整合 GPS 訊號和高階方向，實現以目標為基礎的戶外導航，同時也解決了目的地不明確的室內導航中的多路徑預測不確定性。我們的廣義模型是第一個導航輔助系統，可以在室內和室外環境中處理以目標為導向和探索性的導航場景，在盲人導航領域建立了新的技術水準。我們提出方法、資料集、評估和部署見解，以鼓勵輔助導航系統進一步創新。", "author": "Aishwarya Jadhav et.al.", "authors": "Aishwarya Jadhav, Jeffery Cao, Abhishree Shetty, Urvashi Priyam Kumar, Aditi Sharma, Ben Sukboontip, Jayant Sravan Tamarapalli, Jingyi Zhang, Anirudh Koul", "id": "2501.07957v1", "paper_url": "http://arxiv.org/abs/2501.07957v1", "repo": "null"}}