{"2409.15977": {"publish_time": "2024-09-24", "title": "StyleSinger 2: Zero-Shot Singing Voice Synthesis with Style Transfer and Multi-Level Style Control", "paper_summary": "Zero-shot singing voice synthesis (SVS) with style transfer and style control\naims to generate high-quality singing voices with unseen timbres and styles\n(including singing method, emotion, rhythm, technique, and pronunciation) from\naudio and text prompts. However, the multifaceted nature of singing styles\nposes a significant challenge for effective modeling, transfer, and control.\nFurthermore, current SVS models often fail to generate singing voices rich in\nstylistic nuances for unseen singers. To address these challenges, we introduce\nStyleSinger 2, the first zero-shot SVS model for style transfer across\ncross-lingual speech and singing styles, along with multi-level style control.\nSpecifically, StyleSinger 2 proposes three primary modules: 1) the clustering\nstyle encoder employs a clustering vector quantization model to stably condense\nstyle information into a compact latent space; 2) the Style and Duration\nLanguage Model (S\\&D-LM) concurrently predicts style information and phoneme\nduration, which benefits both; 3) the style adaptive decoder uses a novel\nmel-style adaptive normalization method to generate singing voices with\nenhanced details. Experimental results show that StyleSinger 2 outperforms all\nbaseline models in synthesis quality, singer similarity, and style\ncontrollability across various tasks, including zero-shot style transfer,\nmulti-level style control, cross-lingual style transfer, and speech-to-singing\nstyle transfer. Singing voice samples can be accessed at\nhttps://stylesinger2.github.io/.", "paper_summary_zh": "零樣本歌唱聲音合成 (SVS)，具備風格轉移和風格控制，旨在根據音訊和文字提示生成具有未見音色和風格（包括歌唱方式、情緒、節奏、技巧和發音）的高品質歌唱聲音。然而，歌唱風格的多樣性對有效的建模、轉移和控制構成了重大挑戰。此外，目前的 SVS 模型通常無法為未見歌手生成富有風格細微差别的歌唱聲音。為了應對這些挑戰，我們引入了 StyleSinger 2，這是第一個跨語言語音和歌唱風格進行風格轉移的零樣本 SVS 模型，並具備多級風格控制。具體來說，StyleSinger 2 提出三個主要模組：1) 聚類風格編碼器採用聚類向量量化模型，將風格資訊穩定地濃縮到一個緊湊的潛在空間；2) 風格和持續時間語言模型 (S&D-LM) 同時預測風格資訊和音素持續時間，這對兩者都有利；3) 風格自適應解碼器使用一種新穎的 mel 風格自適應正規化方法，以生成具有增強細節的歌唱聲音。實驗結果表明，在零樣本風格轉移、多級風格控制、跨語言風格轉移和語音到歌唱風格轉移等各種任務中，StyleSinger 2 在合成品質、歌手相似性和風格可控性方面都優於所有基線模型。可以在 https://stylesinger2.github.io/ 訪問歌唱聲音範例。", "author": "Yu Zhang et.al.", "authors": "Yu Zhang, Ziyue Jiang, Ruiqi Li, Changhao Pan, Jinzheng He, Rongjie Huang, Chuxin Wang, Zhou Zhao", "id": "2409.15977v1", "paper_url": "http://arxiv.org/abs/2409.15977v1", "repo": "https://github.com/AaronZ345/StyleSinger2"}}