{"2408.15172": {"publish_time": "2024-08-27", "title": "X-Reflect: Cross-Reflection Prompting for Multimodal Recommendation", "paper_summary": "Large Language Models (LLMs) and Large Multimodal Models (LMMs) have been\nshown to enhance the effectiveness of enriching item descriptions, thereby\nimproving the accuracy of recommendation systems. However, most existing\napproaches either rely on text-only prompting or employ basic multimodal\nstrategies that do not fully exploit the complementary information available\nfrom both textual and visual modalities. This paper introduces a novel\nframework, Cross-Reflection Prompting, termed X-Reflect, designed to address\nthese limitations by prompting LMMs to explicitly identify and reconcile\nsupportive and conflicting information between text and images. By capturing\nnuanced insights from both modalities, this approach generates more\ncomprehensive and contextually richer item representations. Extensive\nexperiments conducted on two widely used benchmarks demonstrate that our method\noutperforms existing prompting baselines in downstream recommendation accuracy.\nAdditionally, we evaluate the generalizability of our framework across\ndifferent LMM backbones and the robustness of the prompting strategies,\noffering insights for optimization. This work underscores the importance of\nintegrating multimodal information and presents a novel solution for improving\nitem understanding in multimodal recommendation systems.", "paper_summary_zh": "大型語言模型 (LLM) 和大型多模態模型 (LMM) 已被證明可以提高豐富商品說明的有效性，從而提高推薦系統的準確性。然而，現有的方法大多依賴於純文字提示，或採用基本的模態策略，無法充分利用文本和視覺模態中可用的互補資訊。本文介紹了一個創新的框架，稱為交叉反射提示 (X-Reflect)，旨在透過提示 LMM 明確找出和調和文本和影像之間的支持和衝突資訊來解決這些限制。透過擷取兩種模態的細微見解，此方法產生更全面且內容更豐富的商品表示。在兩個廣泛使用的基準上進行的廣泛實驗證明，我們的模型在下游推薦準確度方面優於現有的提示基準。此外，我們評估了我們的框架在不同 LMM 主幹中的概括性以及提示策略的穩健性，為最佳化提供見解。這項研究強調了整合多模態資訊的重要性，並提出了一種創新的解決方案，用於改善多模態推薦系統中的商品理解。", "author": "Hanjia Lyu et.al.", "authors": "Hanjia Lyu, Ryan Rossi, Xiang Chen, Md Mehrab Tanjim, Stefano Petrangeli, Somdeb Sarkhel, Jiebo Luo", "id": "2408.15172v1", "paper_url": "http://arxiv.org/abs/2408.15172v1", "repo": "null"}}