{"2410.20981": {"publish_time": "2024-10-28", "title": "EEG-Driven 3D Object Reconstruction with Color Consistency and Diffusion Prior", "paper_summary": "EEG-based visual perception reconstruction has become a current research\nhotspot. Neuroscientific studies have shown that humans can perceive various\ntypes of visual information, such as color, shape, and texture, when observing\nobjects. However, existing technical methods often face issues such as\ninconsistencies in texture, shape, and color between the visual stimulus images\nand the reconstructed images. In this paper, we propose a method for\nreconstructing 3D objects with color consistency based on EEG signals. The\nmethod adopts a two-stage strategy: in the first stage, we train an implicit\nneural EEG encoder with the capability of perceiving 3D objects, enabling it to\ncapture regional semantic features; in the second stage, based on the latent\nEEG codes obtained in the first stage, we integrate a diffusion model, neural\nstyle loss, and NeRF to implicitly decode the 3D objects. Finally, through\nexperimental validation, we demonstrate that our method can reconstruct 3D\nobjects with color consistency using EEG.", "paper_summary_zh": "基於腦電圖的視覺感知重建已成為當前研究熱點。神經科學研究表明，人類在觀察物體時，可以感知各種類型的視覺資訊，例如顏色、形狀和紋理。然而，現有的技術方法經常面臨視覺刺激圖像和重建圖像之間的紋理、形狀和顏色不一致等問題。在本文中，我們提出了一種基於腦電圖訊號重建具有顏色一致性的 3D 物體的方法。該方法採用兩階段策略：在第一階段，我們訓練一個具有感知 3D 物體能力的隱式神經腦電圖編碼器，使其能夠捕獲區域語義特徵；在第二階段，基於第一階段獲得的潛在腦電圖編碼，我們整合一個擴散模型、神經風格損失和 NeRF 來隱式解碼 3D 物體。最後，通過實驗驗證，我們證明了我們的方法可以使用腦電圖重建具有顏色一致性的 3D 物體。", "author": "Xin Xiang et.al.", "authors": "Xin Xiang, Wenhui Zhou, Guojun Dai", "id": "2410.20981v2", "paper_url": "http://arxiv.org/abs/2410.20981v2", "repo": "null"}}