{"2406.17697": {"publish_time": "2024-06-25", "title": "HGTDP-DTA: Hybrid Graph-Transformer with Dynamic Prompt for Drug-Target Binding Affinity Prediction", "paper_summary": "Drug target binding affinity (DTA) is a key criterion for drug screening.\nExisting experimental methods are time-consuming and rely on limited structural\nand domain information. While learning-based methods can model sequence and\nstructural information, they struggle to integrate contextual data and often\nlack comprehensive modeling of drug-target interactions. In this study, we\npropose a novel DTA prediction method, termed HGTDP-DTA, which utilizes dynamic\nprompts within a hybrid Graph-Transformer framework. Our method generates\ncontext-specific prompts for each drug-target pair, enhancing the model's\nability to capture unique interactions. The introduction of prompt tuning\nfurther optimizes the prediction process by filtering out irrelevant noise and\nemphasizing task-relevant information, dynamically adjusting the input features\nof the molecular graph. The proposed hybrid Graph-Transformer architecture\ncombines structural information from Graph Convolutional Networks (GCNs) with\nsequence information captured by Transformers, facilitating the interaction\nbetween global and local information. Additionally, we adopted the multi-view\nfeature fusion method to project molecular graph views and affinity subgraph\nviews into a common feature space, effectively combining structural and\ncontextual information. Experiments on two widely used public datasets, Davis\nand KIBA, show that HGTDP-DTA outperforms state-of-the-art DTA prediction\nmethods in both prediction performance and generalization ability.", "paper_summary_zh": "藥物標靶結合親和力 (DTA) 是藥物篩選的一個關鍵標準。\n現有的實驗方法耗時，且依賴有限的結構和結構域資訊。雖然基於學習的方法可以建模序列和結構資訊，但它們難以整合脈絡資料，且往往缺乏對藥物標靶交互作用的全面建模。在此研究中，我們提出一個新的 DTA 預測方法，稱為 HGTDP-DTA，它在混合圖形轉換器框架中使用動態提示。我們的模型為每對藥物標靶產生特定於脈絡的提示，增強模型捕捉獨特交互作用的能力。提示調整的引入進一步最佳化預測流程，透過濾除無關雜訊和強調與任務相關的資訊，動態調整分子圖形的輸入特徵。所提出的混合圖形轉換器架構結合了來自圖形卷積網路 (GCN) 的結構資訊和轉換器捕捉的序列資訊，促進了全域和局部資訊之間的交互作用。此外，我們採用多視圖特徵融合方法，將分子圖形視圖和親和力子圖視圖投影到一個共同的特徵空間，有效地結合了結構和脈絡資訊。在兩個廣泛使用的公共資料集 Davis 和 KIBA 上的實驗表明，HGTDP-DTA 在預測效能和泛化能力方面都優於最先進的 DTA 預測方法。", "author": "Xi Xiao et.al.", "authors": "Xi Xiao, Wentao Wang, Jiacheng Xie, Lijing Zhu, Gaofei Chen, Zhengji Li, Tianyang Wang, Min Xu", "id": "2406.17697v1", "paper_url": "http://arxiv.org/abs/2406.17697v1", "repo": "null"}}