{"2408.01119": {"publish_time": "2024-08-02", "title": "Task Prompt Vectors: Effective Initialization through Multi-Task Soft-Prompt Transfer", "paper_summary": "Prompt tuning is a modular and efficient solution for training large language\nmodels (LLMs). One of its main advantages is task modularity, making it\nsuitable for multi-task problems. However, current soft-prompt-based methods\noften sacrifice multi-task modularity, requiring the training process to be\nfully or partially repeated for each newly added task. While recent work on\ntask vectors applied arithmetic operations on full model weights to achieve the\ndesired multi-task performance, a similar approach for soft-prompts is still\nmissing. To this end, we introduce Task Prompt Vectors, created by element-wise\ndifference between weights of tuned soft-prompts and their random\ninitialization. Experimental results on 12 NLU datasets show that task prompt\nvectors can be used in low-resource settings to effectively initialize prompt\ntuning on similar tasks. In addition, we show that task prompt vectors are\nindependent of the random initialization of prompt tuning. This allows prompt\narithmetics with the pre-trained vectors from different tasks. In this way, by\narithmetic addition of task prompt vectors from multiple tasks, we are able to\noutperform a state-of-the-art baseline in some cases.", "paper_summary_zh": "提示調整是一種訓練大型語言模型 (LLM) 的模組化且有效率的解決方案。它的主要優勢之一是任務模組化，使其適用於多任務問題。然而，目前的軟提示方法通常會犧牲多任務模組化，需要針對每個新增加的任務完全或部分重複訓練過程。雖然最近關於任務向量的研究對完整的模型權重應用算術運算以達成所需的任務效能，但軟提示的類似方法仍然付之闕如。為此，我們引入了任務提示向量，它是透過調整過的軟提示權重與其隨機初始化之間的元素差異所建立的。在 12 個 NLU 資料集上的實驗結果顯示，任務提示向量可用於低資源設定中，以有效初始化類似任務的提示調整。此外，我們顯示任務提示向量與提示調整的隨機初始化無關。這允許使用來自不同任務的預先訓練向量進行提示運算。藉由這種方式，透過多個任務的任務提示向量的算術加法，我們有能力在某些情況下優於最先進的基準。", "author": "Robert Belanec et.al.", "authors": "Robert Belanec, Simon Ostermann, Ivan Srba, Maria Bielikova", "id": "2408.01119v1", "paper_url": "http://arxiv.org/abs/2408.01119v1", "repo": "null"}}