{"2409.15924": {"publish_time": "2024-09-24", "title": "Multilingual Transfer and Domain Adaptation for Low-Resource Languages of Spain", "paper_summary": "This article introduces the submission status of the Translation into\nLow-Resource Languages of Spain task at (WMT 2024) by Huawei Translation\nService Center (HW-TSC). We participated in three translation tasks: spanish to\naragonese (es-arg), spanish to aranese (es-arn), and spanish to asturian\n(es-ast). For these three translation tasks, we use training strategies such as\nmultilingual transfer, regularized dropout, forward translation and back\ntranslation, labse denoising, transduction ensemble learning and other\nstrategies to neural machine translation (NMT) model based on training deep\ntransformer-big architecture. By using these enhancement strategies, our\nsubmission achieved a competitive result in the final evaluation.", "paper_summary_zh": "這篇文章介紹了華為翻譯服務中心 (HW-TSC) 在 (WMT 2024) 的西班牙語翻譯成低資源語言任務的提交狀態。我們參與了三個翻譯任務：西班牙語翻譯成亞拉岡語 (es-arg)、西班牙語翻譯成阿蘭語 (es-arn) 和西班牙語翻譯成阿斯圖里亞語 (es-ast)。對於這三個翻譯任務，我們使用多語言轉移、正規化中斷、前向翻譯和反向翻譯、labse 去噪、轉換集合學習等訓練策略，以及基於訓練深度變換器大架構的神經機器翻譯 (NMT) 模型。藉由使用這些增強策略，我們的提交在最終評估中獲得了有競爭力的結果。", "author": "Yuanchang Luo et.al.", "authors": "Yuanchang Luo, Zhanglin Wu, Daimeng Wei, Hengchao Shang, Zongyao Li, Jiaxin Guo, Zhiqiang Rao, Shaojun Li, Jinlong Yang, Yuhao Xie, Jiawei Zheng Bin Wei, Hao Yang", "id": "2409.15924v1", "paper_url": "http://arxiv.org/abs/2409.15924v1", "repo": "null"}}