{"2406.18116": {"publish_time": "2024-06-26", "title": "BADGE: BADminton report Generation and Evaluation with LLM", "paper_summary": "Badminton enjoys widespread popularity, and reports on matches generally\ninclude details such as player names, game scores, and ball types, providing\naudiences with a comprehensive view of the games. However, writing these\nreports can be a time-consuming task. This challenge led us to explore whether\na Large Language Model (LLM) could automate the generation and evaluation of\nbadminton reports. We introduce a novel framework named BADGE, designed for\nthis purpose using LLM. Our method consists of two main phases: Report\nGeneration and Report Evaluation. Initially, badminton-related data is\nprocessed by the LLM, which then generates a detailed report of the match. We\ntested different Input Data Types, In-Context Learning (ICL), and LLM, finding\nthat GPT-4 performs best when using CSV data type and the Chain of Thought\nprompting. Following report generation, the LLM evaluates and scores the\nreports to assess their quality. Our comparisons between the scores evaluated\nby GPT-4 and human judges show a tendency to prefer GPT-4 generated reports.\nSince the application of LLM in badminton reporting remains largely unexplored,\nour research serves as a foundational step for future advancements in this\narea. Moreover, our method can be extended to other sports games, thereby\nenhancing sports promotion. For more details, please refer to\nhttps://github.com/AndyChiangSH/BADGE.", "paper_summary_zh": "羽球運動廣受歡迎，而比賽報導通常會包含球員姓名、比賽比分和球類等細節，為觀眾提供比賽的全面視角。然而，撰寫這些報導可能是一項耗時的任務。這個挑戰讓我們開始探討大型語言模型 (LLM) 是否可以自動生成和評估羽球比賽報導。我們介紹了一個名為 BADGE 的創新框架，專為使用 LLM 的這個目的而設計。我們的做法包含兩個主要階段：比賽報導生成與比賽報導評估。最初，羽球相關數據由 LLM 處理，然後生成比賽的詳細報導。我們測試了不同的輸入資料類型、情境內學習 (ICL) 和 LLM，發現 GPT-4 在使用 CSV 資料類型和思考鏈提示時表現最佳。在比賽報導生成後，LLM 會評估並評分比賽報導以評估其品質。我們在 GPT-4 和人類評審評估的分數之間的比較顯示出偏好 GPT-4 所生成比賽報導的趨勢。由於 LLM 在羽球報導中的應用仍然很大程度上未被探索，我們的研究作為這個領域未來進展的基礎步驟。此外，我們的方法可以延伸到其他運動比賽，從而加強體育推廣。更多詳情，請參閱 https://github.com/AndyChiangSH/BADGE。", "author": "Shang-Hsuan Chiang et.al.", "authors": "Shang-Hsuan Chiang, Lin-Wei Chao, Kuang-Da Wang, Chih-Chuan Wang, Wen-Chih Peng", "id": "2406.18116v1", "paper_url": "http://arxiv.org/abs/2406.18116v1", "repo": "https://github.com/andychiangsh/badge"}}