{"2503.04697": {"publish_time": "2025-03-06", "title": "L1: Controlling How Long A Reasoning Model Thinks With Reinforcement Learning", "paper_summary": "Reasoning language models have shown an uncanny ability to improve\nperformance at test-time by ``thinking longer''-that is, by generating longer\nchain-of-thought sequences and hence using more compute. However, the length of\ntheir chain-of-thought reasoning is not controllable, making it impossible to\nallocate test-time compute to achieve a desired level of performance. We\nintroduce Length Controlled Policy Optimization (LCPO), a simple reinforcement\nlearning method that optimizes for accuracy and adherence to user-specified\nlength constraints. We use LCPO to train L1, a reasoning language model that\nproduces outputs satisfying a length constraint given in its prompt. L1's\nlength control allows for smoothly trading off computational cost and accuracy\non a wide range of tasks, and outperforms the state-of-the-art S1 method for\nlength control. Furthermore, we uncover an unexpected short chain-of-thought\ncapability in models trained with LCPO. For instance, our 1.5B L1 model\nsurpasses GPT-4o at equal reasoning lengths. Overall, LCPO enables precise\ncontrol over reasoning length, allowing for fine-grained allocation of\ntest-time compute and accuracy. We release code and models at\nhttps://www.cmu-l3.github.io/l1", "paper_summary_zh": "<paragraph>推理語言模型展現了一種驚人的能力，可以透過「更長時間的思考」來提高測試時的效能——也就是說，透過產生更長的思維鏈序列，從而使用更多的計算資源。然而，它們的思維鏈長度是不可控的，這使得我們無法分配測試時的計算資源來達到預期的效能水準。我們引入了長度控制策略優化 (LCPO)，這是一種簡單的強化學習方法，用於優化準確性和遵守使用者指定的長度限制。我們使用 LCPO 來訓練 L1，這是一個推理語言模型，它可以產生滿足提示中給定長度限制的輸出。L1 的長度控制允許在各種任務上平滑地權衡計算成本和準確性，並且在長度控制方面優於最先進的 S1 方法。此外，我們在使用 LCPO 訓練的模型中發現了一種意想不到的短思維鏈能力。例如，我們的 1.5B L1 模型在相同的推理長度下超越了 GPT-4o。總體而言，LCPO 可以精確控制推理長度，從而可以精細地分配測試時計算資源和準確性。我們在 https://www.cmu-l3.github.io/l1 發布程式碼和模型</paragraph>\n", "author": "Pranjal Aggarwal et.al.", "authors": "Pranjal Aggarwal, Sean Welleck", "id": "2503.04697v1", "paper_url": "http://arxiv.org/abs/2503.04697v1", "repo": "null"}}