{"2410.14202": {"publish_time": "2024-10-18", "title": "Rationale Behind Essay Scores: Enhancing S-LLM's Multi-Trait Essay Scoring with Rationale Generated by LLMs", "paper_summary": "Existing automated essay scoring (AES) has solely relied on essay text\nwithout using explanatory rationales for the scores, thereby forgoing an\nopportunity to capture the specific aspects evaluated by rubric indicators in a\nfine-grained manner. This paper introduces Rationale-based Multiple Trait\nScoring (RMTS), a novel approach for multi-trait essay scoring that integrates\nprompt-engineering-based large language models (LLMs) with a fine-tuning-based\nessay scoring model using a smaller large language model (S-LLM). RMTS uses an\nLLM-based trait-wise rationale generation system where a separate LLM agent\ngenerates trait-specific rationales based on rubric guidelines, which the\nscoring model uses to accurately predict multi-trait scores. Extensive\nexperiments on benchmark datasets, including ASAP, ASAP++, and Feedback Prize,\nshow that RMTS significantly outperforms state-of-the-art models and vanilla\nS-LLMs in trait-specific scoring. By assisting quantitative assessment with\nfine-grained qualitative rationales, RMTS enhances the trait-wise reliability,\nproviding partial explanations about essays.", "paper_summary_zh": "現有的自動化論文評分（AES）僅依賴論文文本，而不使用評分的說明性依據，從而放棄了以細緻的方式擷取評分指標中評估的特定面向的機會。本文介紹了基於依據的多特質評分（RMTS），這是一種多特質論文評分的新方法，它將基於提示工程的大型語言模型（LLM）與使用較小型大型語言模型（S-LLM）的基於微調的論文評分模型整合在一起。RMTS 使用基於 LLM 的特質明智依據生成系統，其中一個獨立的 LLM 代理根據評分準則生成特定特質的依據，評分模型使用這些依據準確預測多特質評分。在基準資料集（包括 ASAP、ASAP++ 和 Feedback Prize）上進行的廣泛實驗表明，RMTS 在特定特質評分方面顯著優於最先進的模型和香草 S-LLM。通過使用細緻的定性依據協助量化評估，RMTS 增強了特質明智的可靠性，提供了關於論文的部分說明。", "author": "SeongYeub Chu et.al.", "authors": "SeongYeub Chu, JongWoo Kim, Bryan Wong, MunYong Yi", "id": "2410.14202v1", "paper_url": "http://arxiv.org/abs/2410.14202v1", "repo": "null"}}