{"2410.15446": {"publish_time": "2024-10-20", "title": "Concept Complement Bottleneck Model for Interpretable Medical Image Diagnosis", "paper_summary": "Models based on human-understandable concepts have received extensive\nattention to improve model interpretability for trustworthy artificial\nintelligence in the field of medical image analysis. These methods can provide\nconvincing explanations for model decisions but heavily rely on the detailed\nannotation of pre-defined concepts. Consequently, they may not be effective in\ncases where concepts or annotations are incomplete or low-quality. Although\nsome methods automatically discover effective and new visual concepts rather\nthan using pre-defined concepts or could find some human-understandable\nconcepts via large Language models, they are prone to veering away from medical\ndiagnostic evidence and are challenging to understand. In this paper, we\npropose a concept complement bottleneck model for interpretable medical image\ndiagnosis with the aim of complementing the existing concept set and finding\nnew concepts bridging the gap between explainable models. Specifically, we\npropose to use concept adapters for specific concepts to mine the concept\ndifferences and score concepts in their own attention channels to support\nalmost fairly concept learning. Then, we devise a concept complement strategy\nto learn new concepts while jointly using known concepts to improve model\nperformance. Comprehensive experiments on medical datasets demonstrate that our\nmodel outperforms the state-of-the-art competitors in concept detection and\ndisease diagnosis tasks while providing diverse explanations to ensure model\ninterpretability effectively.", "paper_summary_zh": "<paragraph>基於人類可理解概念的模型已廣受關注，以改善醫療影像分析領域中可信賴人工智慧的模型可解釋性。這些方法可以提供令人信服的模型決策說明，但嚴重依賴預定義概念的詳細註解。因此，在概念或註解不完整或品質低落的情況下，它們可能無效。儘管一些方法會自動發現有效且新的視覺概念，而不是使用預定義概念，或者可以透過大型語言模型找到一些人類可理解的概念，但它們容易偏離醫療診斷證據，且難以理解。在本文中，我們提出一個概念補完瓶頸模型，用於可解釋的醫療影像診斷，目的是補充現有的概念集，並找到新的概念，彌合可解釋模型之間的差距。具體來說，我們建議針對特定概念使用概念適配器，以挖掘概念差異，並在它們自己的注意力通道中評分概念，以支援幾乎公平的概念學習。然後，我們設計一個概念補完策略，在共同使用已知概念改善模型效能的同時，學習新概念。在醫療資料集上進行的綜合實驗證明，我們的模型在概念偵測和疾病診斷任務中優於最先進的競爭對手，同時提供多樣化的說明，以有效確保模型的可解釋性。</paragraph>", "author": "Hongmei Wang et.al.", "authors": "Hongmei Wang, Junlin Hou, Hao Chen", "id": "2410.15446v1", "paper_url": "http://arxiv.org/abs/2410.15446v1", "repo": "null"}}