{"2405.05959": {"publish_time": "2024-05-09", "title": "Self-Supervised Learning of Time Series Representation via Diffusion Process and Imputation-Interpolation-Forecasting Mask", "paper_summary": "Time Series Representation Learning (TSRL) focuses on generating informative\nrepresentations for various Time Series (TS) modeling tasks. Traditional\nSelf-Supervised Learning (SSL) methods in TSRL fall into four main categories:\nreconstructive, adversarial, contrastive, and predictive, each with a common\nchallenge of sensitivity to noise and intricate data nuances. Recently,\ndiffusion-based methods have shown advanced generative capabilities. However,\nthey primarily target specific application scenarios like imputation and\nforecasting, leaving a gap in leveraging diffusion models for generic TSRL. Our\nwork, Time Series Diffusion Embedding (TSDE), bridges this gap as the first\ndiffusion-based SSL TSRL approach. TSDE segments TS data into observed and\nmasked parts using an Imputation-Interpolation-Forecasting (IIF) mask. It\napplies a trainable embedding function, featuring dual-orthogonal Transformer\nencoders with a crossover mechanism, to the observed part. We train a reverse\ndiffusion process conditioned on the embeddings, designed to predict noise\nadded to the masked part. Extensive experiments demonstrate TSDE's superiority\nin imputation, interpolation, forecasting, anomaly detection, classification,\nand clustering. We also conduct an ablation study, present embedding\nvisualizations, and compare inference speed, further substantiating TSDE's\nefficiency and validity in learning representations of TS data.", "paper_summary_zh": "時間序列表示學習 (TSRL) 專注於為各種時間序列 (TS) 建模任務產生有意義的表示。TSRL 中的傳統自監督學習 (SSL) 方法分為四種類型：重建、對抗、對比和預測，每種類型都面臨對雜訊和複雜資料細微差別敏感的共同挑戰。最近，基於擴散的方法已展現出先進的生成能力。然而，它們主要針對特定應用場景，例如填補和預測，在利用擴散模型進行通用 TSRL 方面存在差距。我們的作品時間序列擴散嵌入 (TSDE) 作為第一個基於擴散的 SSL TSRL 方法，彌補了這一差距。TSDE 使用填補-插值-預測 (IIF) 蒙版將 TS 資料分割為觀察部分和遮蔽部分。它將可訓練的嵌入函數應用到觀察部分，該函數具有帶有交叉機制的雙正交 Transformer 編碼器。我們訓練一個反向擴散過程，以嵌入為條件，旨在預測添加到遮蔽部分的雜訊。廣泛的實驗證明了 TSDE 在填補、插值、預測、異常偵測、分類和聚類方面的優越性。我們還進行了消融研究，展示了嵌入視覺化，並比較了推理速度，進一步證實了 TSDE 在學習 TS 資料表示方面的效率和有效性。", "author": "Zineb Senane et.al.", "authors": "Zineb Senane, Lele Cao, Valentin Leonhard Buchner, Yusuke Tashiro, Lei You, Pawel Herman, Mats Nordahl, Ruibo Tu, Vilhelm von Ehrenheim", "id": "2405.05959v1", "paper_url": "http://arxiv.org/abs/2405.05959v1", "repo": "https://github.com/eqtpartners/tsde"}}