{"2410.04968": {"publish_time": "2024-10-07", "title": "Collaboration! Towards Robust Neural Methods for Routing Problems", "paper_summary": "Despite enjoying desirable efficiency and reduced reliance on domain\nexpertise, existing neural methods for vehicle routing problems (VRPs) suffer\nfrom severe robustness issues -- their performance significantly deteriorates\non clean instances with crafted perturbations. To enhance robustness, we\npropose an ensemble-based Collaborative Neural Framework (CNF) w.r.t. the\ndefense of neural VRP methods, which is crucial yet underexplored in the\nliterature. Given a neural VRP method, we adversarially train multiple models\nin a collaborative manner to synergistically promote robustness against\nattacks, while boosting standard generalization on clean instances. A neural\nrouter is designed to adeptly distribute training instances among models,\nenhancing overall load balancing and collaborative efficacy. Extensive\nexperiments verify the effectiveness and versatility of CNF in defending\nagainst various attacks across different neural VRP methods. Notably, our\napproach also achieves impressive out-of-distribution generalization on\nbenchmark instances.", "paper_summary_zh": "儘管現有的神經方法對於車輛路徑問題 (VRP) 具有令人滿意的效率，且減少了對領域專業知識的依賴，但它們仍有嚴重的穩健性問題，其效能會在經過精心擾動的乾淨個體上大幅下降。為了增強穩健性，我們提出了一個基於整體的協作神經架構 (CNF)，以防禦神經 VRP 方法，這在文獻中至關重要，但尚未被充分探討。給定一個神經 VRP 方法，我們以對抗的方式訓練多個模型，以協作的方式促進對抗攻擊的穩健性，同時提升在乾淨個體上的標準泛化。神經路由器被設計成能夠靈巧地在模型之間分配訓練個體，增強整體負載平衡和協作效能。廣泛的實驗驗證了 CNF 在防禦不同神經 VRP 方法的各種攻擊方面的有效性和多功能性。值得注意的是，我們的做法在基準個體上也達到了令人印象深刻的非分佈泛化。", "author": "Jianan Zhou et.al.", "authors": "Jianan Zhou, Yaoxin Wu, Zhiguang Cao, Wen Song, Jie Zhang, Zhiqi Shen", "id": "2410.04968v1", "paper_url": "http://arxiv.org/abs/2410.04968v1", "repo": "null"}}