{"2501.12085": {"publish_time": "2025-01-21", "title": "Scalable Whole Slide Image Representation Using K-Mean Clustering and Fisher Vector Aggregation", "paper_summary": "Whole slide images (WSIs) are high-resolution, gigapixel sized images that\npose significant computational challenges for traditional machine learning\nmodels due to their size and heterogeneity.In this paper, we present a scalable\nand efficient methodology for WSI classification by leveraging patch-based\nfeature extraction, clustering, and Fisher vector encoding. Initially, WSIs are\ndivided into fixed size patches, and deep feature embeddings are extracted from\neach patch using a pre-trained convolutional neural network (CNN). These\npatch-level embeddings are subsequently clustered using K-means clustering,\nwhere each cluster aggregates semantically similar regions of the WSI. To\neffectively summarize each cluster, Fisher vector representations are computed\nby modeling the distribution of patch embeddings in each cluster as a\nparametric Gaussian mixture model (GMM). The Fisher vectors from each cluster\nare concatenated into a high-dimensional feature vector, creating a compact and\ninformative representation of the entire WSI. This feature vector is then used\nby a classifier to predict the WSI's diagnostic label. Our method captures\nlocal and global tissue structures and yields robust performance for\nlarge-scale WSI classification, demonstrating superior accuracy and scalability\ncompared to other approaches.", "paper_summary_zh": "全玻片影像（WSI）是高解析度、千兆像素大小的影像，由于其大小和异质性，对传统机器学习模型造成重大的计算挑战。在本文中，我们提出一种可扩展且有效的方法，通过利用基于贴片的特征提取、聚类和 Fisher 向量编码来进行 WSI 分类。最初，WSI 被分成固定大小的贴片，并使用预先训练过的卷积神经网络 (CNN) 从每个贴片中提取深度特征嵌入。这些贴片级别的嵌入随后使用 K 均值聚类进行聚类，其中每个聚类都聚合了 WSI 中语义相似的区域。为了有效地总结每个聚类，通过将每个聚类中贴片嵌入的分布建模为参数化高斯混合模型 (GMM) 来计算 Fisher 向量表示。来自每个聚类的 Fisher 向量被连接成一个高维特征向量，创建整个 WSI 的紧凑且信息丰富的表示。然后，分类器使用此特征向量来预测 WSI 的诊断标签。我们的方法捕捉局部和全局组织结构，并产生大规模 WSI 分类的高鲁棒性性能，与其他方法相比，展示出卓越的准确性和可扩展性。", "author": "Ravi Kant Gupta et.al.", "authors": "Ravi Kant Gupta, Shounak Das, Ardhendu Sekhar, Amit Sethi", "id": "2501.12085v1", "paper_url": "http://arxiv.org/abs/2501.12085v1", "repo": "null"}}