{"2501.17132": {"publish_time": "2025-01-28", "title": "ASTRAL: Automated Safety Testing of Large Language Models", "paper_summary": "Large Language Models (LLMs) have recently gained attention due to their\nability to understand and generate sophisticated human-like content. However,\nensuring their safety is paramount as they might provide harmful and unsafe\nresponses. Existing LLM testing frameworks address various safety-related\nconcerns (e.g., drugs, terrorism, animal abuse) but often face challenges due\nto unbalanced and obsolete datasets. In this paper, we present ASTRAL, a tool\nthat automates the generation and execution of test cases (i.e., prompts) for\ntesting the safety of LLMs. First, we introduce a novel black-box coverage\ncriterion to generate balanced and diverse unsafe test inputs across a diverse\nset of safety categories as well as linguistic writing characteristics (i.e.,\ndifferent style and persuasive writing techniques). Second, we propose an\nLLM-based approach that leverages Retrieval Augmented Generation (RAG),\nfew-shot prompting strategies and web browsing to generate up-to-date test\ninputs. Lastly, similar to current LLM test automation techniques, we leverage\nLLMs as test oracles to distinguish between safe and unsafe test outputs,\nallowing a fully automated testing approach. We conduct an extensive evaluation\non well-known LLMs, revealing the following key findings: i) GPT3.5 outperforms\nother LLMs when acting as the test oracle, accurately detecting unsafe\nresponses, and even surpassing more recent LLMs (e.g., GPT-4), as well as LLMs\nthat are specifically tailored to detect unsafe LLM outputs (e.g., LlamaGuard);\nii) the results confirm that our approach can uncover nearly twice as many\nunsafe LLM behaviors with the same number of test inputs compared to currently\nused static datasets; and iii) our black-box coverage criterion combined with\nweb browsing can effectively guide the LLM on generating up-to-date unsafe test\ninputs, significantly increasing the number of unsafe LLM behaviors.", "paper_summary_zh": "<paragraph>大型語言模型（LLM）最近因其理解和生成複雜的人類內容的能力而備受關注。然而，確保它們的安全至關重要，因為它們可能會提供有害和不安全的回應。現有的 LLM 測試框架解決了各種與安全相關的問題（例如，藥物、恐怖主義、虐待動物），但由於數據集不平衡和過時，它們常常面臨挑戰。在本文中，我們介紹 ASTRAL，這是一個工具，可以自動生成和執行測試用例（即提示），以測試 LLM 的安全性。首先，我們引入了一個新穎的黑盒覆蓋標準，以生成跨越不同安全類別以及語言寫作特徵（即不同風格和說服性寫作技巧）的平衡且多樣化的不安全測試輸入。其次，我們提出了一種基於 LLM 的方法，該方法利用檢索增強生成（RAG）、少次提示策略和網絡瀏覽來生成最新的測試輸入。最後，與當前的 LLM 測試自動化技術類似，我們利用 LLM 作為測試預言來區分安全和不安全的測試輸出，從而允許完全自動化的測試方法。我們對眾所周知的 LLM 進行了廣泛的評估，揭示了以下關鍵發現：i) GPT3.5 在充當測試預言時優於其他 LLM，準確檢測不安全的響應，甚至超越了更新的 LLM（例如，GPT-4），以及專門定制為檢測不安全的 LLM 輸出的 LLM（例如，LlamaGuard）；ii) 結果證實，與當前使用的靜態數據集相比，我們的方案可以用相同數量的測試輸入發現幾乎多一倍的不安全 LLM 行為；iii) 我們的黑盒覆蓋標準與網絡瀏覽相結合，可以有效地指導 LLM 生成最新的不安全測試輸入，從而顯著增加不安全 LLM 行為的數量。</paragraph>", "author": "Miriam Ugarte et.al.", "authors": "Miriam Ugarte, Pablo Valle, José Antonio Parejo, Sergio Segura, Aitor Arrieta", "id": "2501.17132v1", "paper_url": "http://arxiv.org/abs/2501.17132v1", "repo": "null"}}