{"2410.12836": {"publish_time": "2024-10-03", "title": "EditRoom: LLM-parameterized Graph Diffusion for Composable 3D Room Layout Editing", "paper_summary": "Given the steep learning curve of professional 3D software and the\ntime-consuming process of managing large 3D assets, language-guided 3D scene\nediting has significant potential in fields such as virtual reality, augmented\nreality, and gaming. However, recent approaches to language-guided 3D scene\nediting either require manual interventions or focus only on appearance\nmodifications without supporting comprehensive scene layout changes. In\nresponse, we propose Edit-Room, a unified framework capable of executing a\nvariety of layout edits through natural language commands, without requiring\nmanual intervention. Specifically, EditRoom leverages Large Language Models\n(LLMs) for command planning and generates target scenes using a diffusion-based\nmethod, enabling six types of edits: rotate, translate, scale, replace, add,\nand remove. To address the lack of data for language-guided 3D scene editing,\nwe have developed an automatic pipeline to augment existing 3D scene synthesis\ndatasets and introduced EditRoom-DB, a large-scale dataset with 83k editing\npairs, for training and evaluation. Our experiments demonstrate that our\napproach consistently outperforms other baselines across all metrics,\nindicating higher accuracy and coherence in language-guided scene layout\nediting.", "paper_summary_zh": "由於專業 3D 軟體的學習曲線陡峭，以及管理大型 3D 資產的耗時程序，語言導向的 3D 場景編輯在虛擬實境、擴增實境和遊戲等領域具有顯著的潛力。然而，最近對語言導向的 3D 場景編輯方法，要不是需要手動干預，就是只專注於外觀修改，而不支援全面的場景佈局變更。為了解決這個問題，我們提出 Edit-Room，一個統一的架構，能夠透過自然語言指令執行各種佈局編輯，而不需要手動干預。具體來說，EditRoom 採用大型語言模型 (LLM) 進行指令規劃，並使用基於擴散的方法產生目標場景，支援六種類型的編輯：旋轉、平移、縮放、替換、新增和移除。為了解決語言導向的 3D 場景編輯缺乏資料的問題，我們開發了一個自動化管道，以擴充現有的 3D 場景合成資料集，並引入了 EditRoom-DB，一個包含 83k 編輯對的大規模資料集，用於訓練和評估。我們的實驗表明，我們的做法在所有指標上都持續優於其他基準，表示在語言導向的場景佈局編輯中具有更高的準確性和一致性。", "author": "Kaizhi Zheng et.al.", "authors": "Kaizhi Zheng, Xiaotong Chen, Xuehai He, Jing Gu, Linjie Li, Zhengyuan Yang, Kevin Lin, Jianfeng Wang, Lijuan Wang, Xin Eric Wang", "id": "2410.12836v1", "paper_url": "http://arxiv.org/abs/2410.12836v1", "repo": "null"}}