{"2412.07042": {"publish_time": "2024-12-09", "title": "Generative AI Impact on Labor Market: Analyzing ChatGPT's Demand in Job Advertisements", "paper_summary": "The rapid advancement of Generative AI (Gen AI) technologies, particularly\ntools like ChatGPT, is significantly impacting the labor market by reshaping\njob roles and skill requirements. This study examines the demand for\nChatGPT-related skills in the U.S. labor market by analyzing job advertisements\ncollected from major job platforms between May and December 2023. Using text\nmining and topic modeling techniques, we extracted and analyzed the Gen\nAI-related skills that employers are hiring for. Our analysis identified five\ndistinct ChatGPT-related skill sets: general familiarity, creative content\ngeneration, marketing, advanced functionalities (such as prompt engineering),\nand product development. In addition, the study provides insights into job\nattributes such as occupation titles, degree requirements, salary ranges, and\nother relevant job characteristics. These findings highlight the increasing\nintegration of Gen AI across various industries, emphasizing the growing need\nfor both foundational knowledge and advanced technical skills. The study offers\nvaluable insights into the evolving demands of the labor market, as employers\nseek candidates equipped to leverage generative AI tools to improve\nproductivity, streamline processes, and drive innovation.", "paper_summary_zh": "生成式 AI (Gen AI) 技術的快速進步，尤其是 ChatGPT 等工具，透過重塑工作職能和技能需求，對勞動市場產生重大影響。本研究透過分析 2023 年 5 月至 12 月間從主要求職平台收集的求職廣告，探討美國勞動市場對 ChatGPT 相關技能的需求。我們利用文本探勘和主題建模技術，萃取和分析雇主招聘的 Gen AI 相關技能。我們的分析找出五種不同的 ChatGPT 相關技能組：一般熟悉度、創意內容產生、行銷、進階功能（例如提示工程）和產品開發。此外，本研究提供對工作屬性的見解，例如職稱、學位要求、薪資範圍和其他相關工作特徵。這些發現突顯出 Gen AI 在各產業的整合度日益提升，強調對基礎知識和進階技術技能日益增長的需求。本研究提供對勞動市場不斷變化的需求有價值的見解，因為雇主尋求具備利用生成式 AI 工具來提升生產力、簡化流程和推動創新的求職者。", "author": "Mahdi Ahmadi et.al.", "authors": "Mahdi Ahmadi, Neda Khosh Kheslat, Adebola Akintomide", "id": "2412.07042v1", "paper_url": "http://arxiv.org/abs/2412.07042v1", "repo": "null"}}