{"2409.09318": {"publish_time": "2024-09-14", "title": "ODE: Open-Set Evaluation of Hallucinations in Multimodal Large Language Models", "paper_summary": "Hallucination poses a significant challenge for multimodal large language\nmodels (MLLMs). However, existing benchmarks for evaluating hallucinations are\nstatic, which can lead to potential data contamination. This paper introduces\nODE, an open-set, dynamic protocol for evaluating object existence\nhallucinations in MLLMs. Our framework employs graph structures to model\nassociations between real-word concepts and generates novel samples for both\ngeneral and domain-specific scenarios. The dynamic combination of concepts,\nalong with various combination principles, ensures a broad sample distribution.\nExperimental results show that MLLMs exhibit higher hallucination rates with\nODE-generated samples, effectively avoiding data contamination. Moreover, these\nsamples can also be used for fine-tuning to improve MLLM performance on\nexisting benchmarks.", "paper_summary_zh": "幻覺對多模態大型語言模型 (MLLM) 構成重大挑戰。然而，現有的評估幻覺基準是靜態的，這可能導致潛在的資料污染。本文介紹了 ODE，一種開放式、動態的協定，用於評估 MLLM 中的物件存在幻覺。我們的架構採用圖形結構來建模真實世界概念之間的關聯，並為一般和特定領域情境產生新的範例。概念的動態組合，以及各種組合原則，確保了廣泛的範例分佈。實驗結果顯示，MLLM 在 ODE 生成的範例中表現出較高的幻覺率，有效避免了資料污染。此外，這些範例也可被用於微調，以改善 MLLM 在現有基準上的效能。", "author": "Yahan Tu et.al.", "authors": "Yahan Tu, Rui Hu, Jitao Sang", "id": "2409.09318v1", "paper_url": "http://arxiv.org/abs/2409.09318v1", "repo": "null"}}