{"2412.03537": {"publish_time": "2024-12-04", "title": "Evaluating Gender Bias Transfer between Pre-trained and Prompt-Adapted Language Models", "paper_summary": "Large language models (LLMs) are increasingly being adapted to achieve\ntask-specificity for deployment in real-world decision systems. Several\nprevious works have investigated the bias transfer hypothesis (BTH) by studying\nthe effect of the fine-tuning adaptation strategy on model fairness to find\nthat fairness in pre-trained masked language models have limited effect on the\nfairness of models when adapted using fine-tuning. In this work, we expand the\nstudy of BTH to causal models under prompt adaptations, as prompting is an\naccessible, and compute-efficient way to deploy models in real-world systems.\nIn contrast to previous works, we establish that intrinsic biases in\npre-trained Mistral, Falcon and Llama models are strongly correlated (rho >=\n0.94) with biases when the same models are zero- and few-shot prompted, using a\npronoun co-reference resolution task. Further, we find that bias transfer\nremains strongly correlated even when LLMs are specifically prompted to exhibit\nfair or biased behavior (rho >= 0.92), and few-shot length and stereotypical\ncomposition are varied (rho >= 0.97). Our findings highlight the importance of\nensuring fairness in pre-trained LLMs, especially when they are later used to\nperform downstream tasks via prompt adaptation.", "paper_summary_zh": "大型语言模型 (LLM) 正越来越多地被调整为实现任务特异性，以便部署在现实世界的决策系统中。一些以前的作品通过研究微调调整策略对模型公平性的影响来调查偏差转移假设 (BTH)，发现预先训练的掩蔽语言模型中的公平性对使用微调调整后的模型公平性影响有限。在这项工作中，我们将 BTH 的研究扩展到提示调整下的因果模型，因为提示是一种可访问且计算高效的方法，可以将模型部署到现实世界系统中。与以前的作品相反，我们确定预先训练的 Mistral、Falcon 和 Llama 模型中的内在偏差与使用代词共指解析任务对相同模型进行零次和少次提示时的偏差密切相关（rho >= 0.94）。此外，我们发现，即使 LLM 被明确提示表现出公平或有偏差的行为（rho >= 0.92），并且少次提示长度和刻板印象成分有所不同（rho >= 0.97），偏差转移仍然密切相关。我们的研究结果突出了确保预先训练的 LLM 公平性的重要性，尤其是在它们后来通过提示调整用于执行下游任务时。", "author": "Natalie Mackraz et.al.", "authors": "Natalie Mackraz, Nivedha Sivakumar, Samira Khorshidi, Krishna Patel, Barry-John Theobald, Luca Zappella, Nicholas Apostoloff", "id": "2412.03537v1", "paper_url": "http://arxiv.org/abs/2412.03537v1", "repo": "null"}}