{"2410.19238": {"publish_time": "2024-10-25", "title": "Designing LLM-Agents with Personalities: A Psychometric Approach", "paper_summary": "This research introduces a novel methodology for assigning quantifiable,\ncontrollable and psychometrically validated personalities to Large Language\nModels-Based Agents (Agents) using the Big Five personality framework. It seeks\nto overcome the constraints of human subject studies, proposing Agents as an\naccessible tool for social science inquiry. Through a series of four studies,\nthis research demonstrates the feasibility of assigning psychometrically valid\npersonality traits to Agents, enabling them to replicate complex human-like\nbehaviors. The first study establishes an understanding of personality\nconstructs and personality tests within the semantic space of an LLM. Two\nsubsequent studies -- using empirical and simulated data -- illustrate the\nprocess of creating Agents and validate the results by showing strong\ncorrespondence between human and Agent answers to personality tests. The final\nstudy further corroborates this correspondence by using Agents to replicate\nknown human correlations between personality traits and decision-making\nbehaviors in scenarios involving risk-taking and ethical dilemmas, thereby\nvalidating the effectiveness of the psychometric approach to design Agents and\nits applicability to social and behavioral research.", "paper_summary_zh": "本研究為大型語言模型代理（代理）引入了一種創新的方法，用於分配可量化、可控且經過心理測量驗證的人格，並使用五大性格架構。它旨在克服人類受試者研究的限制，提出代理作為社會科學探究的可及工具。通過一系列四項研究，本研究展示了將心理測量學上有效的人格特質分配給代理的可行性，使他們能夠複製複雜的人類行為。第一項研究建立了對 LLM 語義空間內人格結構和人格測試的理解。兩項後續研究——使用經驗和模擬數據——說明了創建代理的過程，並通過展示人類和代理對人格測試的答案之間的強烈對應關係來驗證結果。最後一項研究通過使用代理複製人格特質與風險承擔和道德困境情境中的決策行為之間已知的人類相關性，進一步證實了這種對應關係，從而驗證了心理測量方法在設計代理方面的有效性及其對社會和行為研究的適用性。", "author": "Muhua Huang et.al.", "authors": "Muhua Huang, Xijuan Zhang, Christopher Soto, James Evans", "id": "2410.19238v1", "paper_url": "http://arxiv.org/abs/2410.19238v1", "repo": "null"}}