{"2406.14284": {"publish_time": "2024-06-20", "title": "VAIYAKARANA : A Benchmark for Automatic Grammar Correction in Bangla", "paper_summary": "Bangla (Bengali) is the fifth most spoken language globally and, yet, the\nproblem of automatic grammar correction in Bangla is still in its nascent\nstage. This is mostly due to the need for a large corpus of grammatically\nincorrect sentences, with their corresponding correct counterparts. The present\nstate-of-the-art techniques to curate a corpus for grammatically wrong\nsentences involve random swapping, insertion and deletion of words.\nHowever,these steps may not always generate grammatically wrong sentences in\nBangla. In this work, we propose a pragmatic approach to generate grammatically\nwrong sentences in Bangla. We first categorize the different kinds of errors in\nBangla into 5 broad classes and 12 finer classes. We then use these to generate\ngrammatically wrong sentences systematically from a correct sentence. This\napproach can generate a large number of wrong sentences and can, thus, mitigate\nthe challenge of lacking a large corpus for neural networks. We provide a\ndataset, Vaiyakarana, consisting of 92,830 grammatically incorrect sentences as\nwell as 18,426 correct sentences. We also collected 619 human-generated\nsentences from essays written by Bangla native speakers. This helped us to\nunderstand errors that are more frequent. We evaluated our corpus against\nneural models and LLMs and also benchmark it against human evaluators who are\nnative speakers of Bangla. Our analysis shows that native speakers are far more\naccurate than state-of-the-art models to detect whether the sentence is\ngrammatically correct. Our methodology of generating erroneous sentences can be\napplied for most other Indian languages as well.", "paper_summary_zh": "孟加拉語（孟加拉語）是全球第五大語言，但孟加拉語的自動語法糾正問題仍處於起步階段。這主要是因為需要大量的語法錯誤句子及其相應的正確對應項。目前用於整理語法錯誤句子的最先進技術包括隨機交換、插入和刪除單詞。然而，這些步驟並不總能產生孟加拉語的語法錯誤句子。在這項工作中，我們提出了一種實用的方法來生成孟加拉語的語法錯誤句子。我們首先將孟加拉語的不同類型的錯誤分類為 5 個廣義類別和 12 個更精細的類別。然後，我們使用這些類別從正確的句子中系統地生成語法錯誤的句子。這種方法可以生成大量的錯誤句子，從而可以緩解神經網路缺乏大型語料庫的挑戰。我們提供了一個名為 Vaiyakarana 的數據集，其中包含 92,830 個語法錯誤句子和 18,426 個正確句子。我們還從孟加拉語母語人士撰寫的論文中收集了 619 個人工生成的句子。這幫助我們了解更常見的錯誤。我們根據神經模型和 LLM 評估了我們的語料庫，並根據孟加拉語母語的人類評估員對其進行了基準測試。我們的分析表明，母語人士比最先進的模型更準確地檢測句子是否語法正確。我們生成錯誤句子的方法也可以應用於大多數其他印度語言。", "author": "Pramit Bhattacharyya et.al.", "authors": "Pramit Bhattacharyya, Arnab Bhattacharya", "id": "2406.14284v1", "paper_url": "http://arxiv.org/abs/2406.14284v1", "repo": "null"}}