{"2407.18689": {"publish_time": "2024-07-26", "title": "The BIAS Detection Framework: Bias Detection in Word Embeddings and Language Models for European Languages", "paper_summary": "The project BIAS: Mitigating Diversity Biases of AI in the Labor Market is a\nfour-year project funded by the European commission and supported by the Swiss\nState Secretariat for Education, Research and Innovation (SERI). As part of the\nproject, novel bias detection methods to identify societal bias in language\nmodels and word embeddings in European languages are developed, with particular\nattention to linguistic and geographic particularities. This technical report\ndescribes the overall architecture and components of the BIAS Detection\nFramework. The code described in this technical report is available and will be\nupdated and expanded continuously with upcoming results from the BIAS project.\nThe details about the datasets for the different languages are described in\ncorresponding papers at scientific venues.", "paper_summary_zh": "BIAS 專案：減輕勞動市場中 AI 的多元化偏見，是一個為期四年的專案，由歐洲委員會資助，並獲得瑞士教育、研究和創新國家秘書處 (SERI) 的支援。作為該專案的一部分，開發了新的偏見偵測方法，以識別歐洲語言中的語言模型和字詞嵌入中的社會偏見，特別注意語言和地理的特殊性。此技術報告描述了 BIAS 偵測架構的整體架構和組成部分。本技術報告中描述的程式碼已公開，並將持續更新和擴充，以納入 BIAS 專案的最新成果。不同語言的資料集詳細資訊已在科學場域的對應論文中說明。", "author": "Alexandre Puttick et.al.", "authors": "Alexandre Puttick, Leander Rankwiler, Catherine Ikae, Mascha Kurpicz-Briki", "id": "2407.18689v1", "paper_url": "http://arxiv.org/abs/2407.18689v1", "repo": "null"}}