{"2501.04299": {"publish_time": "2025-01-08", "title": "Circuit Complexity Bounds for Visual Autoregressive Model", "paper_summary": "Understanding the expressive ability of a specific model is essential for\ngrasping its capacity limitations. Recently, several studies have established\ncircuit complexity bounds for Transformer architecture. Besides, the Visual\nAutoRegressive (VAR) model has risen to be a prominent method in the field of\nimage generation, outperforming previous techniques, such as Diffusion\nTransformers, in generating high-quality images. We investigate the circuit\ncomplexity of the VAR model and establish a bound in this study. Our primary\nresult demonstrates that the VAR model is equivalent to a simulation by a\nuniform $\\mathsf{TC}^0$ threshold circuit with hidden dimension $d \\leq O(n)$\nand $\\mathrm{poly}(n)$ precision. This is the first study to rigorously\nhighlight the limitations in the expressive power of VAR models despite their\nimpressive performance. We believe our findings will offer valuable insights\ninto the inherent constraints of these models and guide the development of more\nefficient and expressive architectures in the future.", "paper_summary_zh": "了解特定模型的表達能力對於掌握其容量限制至關重要。最近，一些研究已經為 Transformer 架構建立了電路複雜度界限。此外，視覺自迴歸 (VAR) 模型已成為影像生成領域的顯著方法，在產生高品質影像方面優於先前的技術，例如擴散式 Transformer。我們在研究中調查 VAR 模型的電路複雜度並建立界限。我們的初步結果表明，VAR 模型等於一個均勻的 $\\mathsf{TC}^0$ 閾值電路模擬，其隱藏維度 $d \\leq O(n)$，且精度為 $\\mathrm{poly}(n)$。儘管 VAR 模型有令人印象深刻的效能，但這是第一個嚴謹地強調其表達能力限制的研究。我們相信我們的發現將提供有價值的見解，了解這些模型的內在限制，並在未來引導開發更有效率且更具表達力的架構。", "author": "Yekun Ke et.al.", "authors": "Yekun Ke, Xiaoyu Li, Yingyu Liang, Zhenmei Shi, Zhao Song", "id": "2501.04299v1", "paper_url": "http://arxiv.org/abs/2501.04299v1", "repo": "null"}}