{"2405.20649": {"publish_time": "2024-05-31", "title": "Reward-based Input Construction for Cross-document Relation Extraction", "paper_summary": "Relation extraction (RE) is a fundamental task in natural language\nprocessing, aiming to identify relations between target entities in text. While\nmany RE methods are designed for a single sentence or document, cross-document\nRE has emerged to address relations across multiple long documents. Given the\nnature of long documents in cross-document RE, extracting document embeddings\nis challenging due to the length constraints of pre-trained language models.\nTherefore, we propose REward-based Input Construction (REIC), the first\nlearning-based sentence selector for cross-document RE. REIC extracts sentences\nbased on relational evidence, enabling the RE module to effectively infer\nrelations. Since supervision of evidence sentences is generally unavailable, we\ntrain REIC using reinforcement learning with RE prediction scores as rewards.\nExperimental results demonstrate the superiority of our method over heuristic\nmethods for different RE structures and backbones in cross-document RE. Our\ncode is publicly available at https://github.com/aailabkaist/REIC.", "paper_summary_zh": "關係抽取 (RE) 是自然語言處理中一項基本任務，旨在找出文字中目標實體之間的關係。儘管許多 RE 方法是針對單一句子或文件設計，跨文件 RE 已應運而生，用於處理跨多個長文件的關係。考量到跨文件 RE 中長文件的性質，由於預訓練語言模型的長度限制，提取文件嵌入相當具有挑戰性。因此，我們提出基於 RE 獎勵的輸入建構 (REIC)，這是第一個用於跨文件 RE 的基於學習的句子選擇器。REIC 基於關係證據提取句子，讓 RE 模組能夠有效推論關係。由於證據句子的監督通常不可用，我們使用強化學習訓練 REIC，並以 RE 預測分數作為獎勵。實驗結果證明，在跨文件 RE 中，我們的模型優於不同 RE 結構和主幹的啟發式方法。我們的程式碼已公開發布於 https://github.com/aailabkaist/REIC。", "author": "Byeonghu Na et.al.", "authors": "Byeonghu Na, Suhyeon Jo, Yeongmin Kim, Il-Chul Moon", "id": "2405.20649v1", "paper_url": "http://arxiv.org/abs/2405.20649v1", "repo": "https://github.com/aailabkaist/reic"}}