{"2412.14170": {"publish_time": "2024-12-18", "title": "E-CAR: Efficient Continuous Autoregressive Image Generation via Multistage Modeling", "paper_summary": "Recent advances in autoregressive (AR) models with continuous tokens for\nimage generation show promising results by eliminating the need for discrete\ntokenization. However, these models face efficiency challenges due to their\nsequential token generation nature and reliance on computationally intensive\ndiffusion-based sampling. We present ECAR (Efficient Continuous Auto-Regressive\nImage Generation via Multistage Modeling), an approach that addresses these\nlimitations through two intertwined innovations: (1) a stage-wise continuous\ntoken generation strategy that reduces computational complexity and provides\nprogressively refined token maps as hierarchical conditions, and (2) a\nmultistage flow-based distribution modeling method that transforms only\npartial-denoised distributions at each stage comparing to complete denoising in\nnormal diffusion models. Holistically, ECAR operates by generating tokens at\nincreasing resolutions while simultaneously denoising the image at each stage.\nThis design not only reduces token-to-image transformation cost by a factor of\nthe stage number but also enables parallel processing at the token level. Our\napproach not only enhances computational efficiency but also aligns naturally\nwith image generation principles by operating in continuous token space and\nfollowing a hierarchical generation process from coarse to fine details.\nExperimental results demonstrate that ECAR achieves comparable image quality to\nDiT Peebles & Xie [2023] while requiring 10$\\times$ FLOPs reduction and\n5$\\times$ speedup to generate a 256$\\times$256 image.", "paper_summary_zh": "<paragraph>最近在具有連續圖像生成代幣的自迴歸 (AR) 模型中取得的進展，透過消除離散代幣化的需求，展示了令人振奮的成果。然而，這些模型由於其順序代幣生成特性和依賴於計算密集型擴散式採樣，而面臨效率挑戰。我們提出了 ECAR（透過多階段建模實現高效連續自迴歸圖像生成），這是一種透過兩項相互交織的創新來解決這些限制的方法：(1) 一種階段性的連續代幣生成策略，可降低運算複雜度，並提供逐漸精煉的代幣映射作為分層條件，以及 (2) 一種多階段基於流的分布建模方法，與在一般擴散模型中進行完整去噪相比，它僅轉換每個階段的部分去噪分布。整體而言，ECAR 的運作方式是在每個階段同時產生不同解析度的代幣，並去噪影像。這種設計不僅將代幣到影像轉換成本降低了階段數倍，還可以在代幣層級進行並行處理。我們的方法不僅增強了運算效率，還透過在連續代幣空間中運作並遵循從粗略到精細細節的分層生成過程，自然地與影像生成原理保持一致。實驗結果表明，ECAR 達到了與 DiT Peebles & Xie [2023] 相當的影像品質，同時將產生 256×256 影像所需的浮點運算次數 (FLOP) 減少了 10 倍，並將速度提升了 5 倍。</paragraph>", "author": "Zhihang Yuan et.al.", "authors": "Zhihang Yuan, Yuzhang Shang, Hanling Zhang, Tongcheng Fang, Rui Xie, Bingxin Xu, Yan Yan, Shengen Yan, Guohao Dai, Yu Wang", "id": "2412.14170v1", "paper_url": "http://arxiv.org/abs/2412.14170v1", "repo": "null"}}