{"2502.03771": {"publish_time": "2025-02-06", "title": "Adaptive Semantic Prompt Caching with VectorQ", "paper_summary": "Semantic prompt caches reduce the latency and cost of large language model\n(LLM) inference by reusing cached LLM-generated responses for semantically\nsimilar prompts. Vector similarity metrics assign a numerical score to quantify\nthe similarity between an embedded prompt and its nearest neighbor in the\ncache. Existing systems rely on a static threshold to classify whether the\nsimilarity score is sufficiently high to result in a cache hit. We show that\nthis one-size-fits-all threshold is insufficient across different prompts. We\npropose VectorQ, a framework to learn embedding-specific threshold regions that\nadapt to the complexity and uncertainty of an embedding. Through evaluations on\na combination of four diverse datasets, we show that VectorQ consistently\noutperforms state-of-the-art systems across all static thresholds, achieving up\nto 12x increases in cache hit rate and error rate reductions up to 92%.", "paper_summary_zh": "語意提示快取透過重複使用快取的 LLM 生成的回應來降低大型語言模型 (LLM) 推論的延遲和成本，以取得語意上相似的提示。向量相似度量數會指派一個數值分數，以量化嵌入式提示與快取中最近鄰居之間的相似度。現有的系統依賴靜態閾值來分類相似度分數是否足夠高以產生快取命中。我們顯示這個一體適用的閾值不足以涵蓋不同的提示。我們提出 VectorQ，一個架構來學習適應嵌入式複雜性和不確定性的嵌入式特定閾值區域。透過評估四個不同資料集的組合，我們顯示 VectorQ 在所有靜態閾值上持續優於最先進的系統，快取命中率增加多達 12 倍，錯誤率降低多達 92%。", "author": "Luis Gaspar Schroeder et.al.", "authors": "Luis Gaspar Schroeder, Shu Liu, Alejandro Cuadron, Mark Zhao, Stephan Krusche, Alfons Kemper, Matei Zaharia, Joseph E. Gonzalez", "id": "2502.03771v1", "paper_url": "http://arxiv.org/abs/2502.03771v1", "repo": "null"}}