{"2502.03387": {"publish_time": "2025-02-05", "title": "LIMO: Less is More for Reasoning", "paper_summary": "We present a fundamental discovery that challenges our understanding of how\ncomplex reasoning emerges in large language models. While conventional wisdom\nsuggests that sophisticated reasoning tasks demand extensive training data\n(>100,000 examples), we demonstrate that complex mathematical reasoning\nabilities can be effectively elicited with surprisingly few examples. Through\ncomprehensive experiments, our proposed model LIMO demonstrates unprecedented\nperformance in mathematical reasoning. With merely 817 curated training\nsamples, LIMO achieves 57.1% accuracy on AIME and 94.8% on MATH, improving from\nprevious SFT-based models' 6.5% and 59.2% respectively, while only using 1% of\nthe training data required by previous approaches. LIMO demonstrates\nexceptional out-of-distribution generalization, achieving 40.5% absolute\nimprovement across 10 diverse benchmarks, outperforming models trained on 100x\nmore data, challenging the notion that SFT leads to memorization rather than\ngeneralization. Based on these results, we propose the Less-Is-More Reasoning\nHypothesis (LIMO Hypothesis): In foundation models where domain knowledge has\nbeen comprehensively encoded during pre-training, sophisticated reasoning\ncapabilities can emerge through minimal but precisely orchestrated\ndemonstrations of cognitive processes. This hypothesis posits that the\nelicitation threshold for complex reasoning is determined by two key factors:\n(1) the completeness of the model's encoded knowledge foundation during\npre-training, and (2) the effectiveness of post-training examples as \"cognitive\ntemplates\" that show the model how to utilize its knowledge base to solve\ncomplex reasoning tasks. To facilitate reproducibility and future research in\ndata-efficient reasoning, we release LIMO as a comprehensive open-source suite\nat https://github.com/GAIR-NLP/LIMO.", "paper_summary_zh": "<paragraph>我們提出了一項基本發現，挑戰了我們對大型語言模型中複雜推理如何出現的理解。雖然傳統智慧表明，複雜的推理任務需要大量的訓練數據（>100,000 個範例），但我們證明了複雜的數學推理能力可以用驚人的少數範例有效地引發。通過全面的實驗，我們提出的模型 LIMO 在數學推理中展示了前所未有的表現。LIMO 僅使用 817 個精心策劃的訓練樣本，在 AIME 上達到了 57.1% 的準確度，在 MATH 上達到了 94.8%，分別比以前的基於 SFT 的模型提高了 6.5% 和 59.2%，同時僅使用了以前方法所需訓練數據的 1%。LIMO 展示了出色的分布外泛化能力，在 10 個不同的基準測試中取得了 40.5% 的絕對改進，優於在 100 倍更多數據上訓練的模型，挑戰了 SFT 導致記憶而不是泛化的觀念。基於這些結果，我們提出了少即是多推理假設（LIMO 假設）：在預訓練過程中已全面編碼領域知識的基礎模型中，複雜的推理能力可以通過對認知過程進行最少的但精確安排的演示而出現。這個假設假設複雜推理的引發閾值是由兩個關鍵因素決定的：(1) 預訓練期間模型編碼知識基礎的完整性，以及 (2) 訓練後範例作為「認知模板」的有效性，向模型展示如何利用其知識庫來解決複雜的推理任務。為了促進數據有效推理的可複製性和未來研究，我們在 https://github.com/GAIR-NLP/LIMO 上發布 LIMO 作為一個全面的開源套件。</paragraph>", "author": "Yixin Ye et.al.", "authors": "Yixin Ye, Zhen Huang, Yang Xiao, Ethan Chern, Shijie Xia, Pengfei Liu", "id": "2502.03387v1", "paper_url": "http://arxiv.org/abs/2502.03387v1", "repo": "null"}}