{"2405.06354": {"publish_time": "2024-05-10", "title": "KeepOriginalAugment: Single Image-based Better Information-Preserving Data Augmentation Approach", "paper_summary": "Advanced image data augmentation techniques play a pivotal role in enhancing\nthe training of models for diverse computer vision tasks. Notably, SalfMix and\nKeepAugment have emerged as popular strategies, showcasing their efficacy in\nboosting model performance. However, SalfMix reliance on duplicating salient\nfeatures poses a risk of overfitting, potentially compromising the model's\ngeneralization capabilities. Conversely, KeepAugment, which selectively\npreserves salient regions and augments non-salient ones, introduces a domain\nshift that hinders the exchange of crucial contextual information, impeding\noverall model understanding. In response to these challenges, we introduce\nKeepOriginalAugment, a novel data augmentation approach. This method\nintelligently incorporates the most salient region within the non-salient area,\nallowing augmentation to be applied to either region. Striking a balance\nbetween data diversity and information preservation, KeepOriginalAugment\nenables models to leverage both diverse salient and non-salient regions,\nleading to enhanced performance. We explore three strategies for determining\nthe placement of the salient region minimum, maximum, or random and investigate\nswapping perspective strategies to decide which part (salient or non-salient)\nundergoes augmentation. Our experimental evaluations, conducted on\nclassification datasets such as CIFAR-10, CIFAR-100, and TinyImageNet,\ndemonstrate the superior performance of KeepOriginalAugment compared to\nexisting state-of-the-art techniques.", "paper_summary_zh": "先進的影像資料擴充技術在增強模型訓練以執行各種電腦視覺任務方面扮演著關鍵角色。值得注意的是，SalfMix 和 KeepAugment 已成為廣受歡迎的策略，展示了它們在提升模型效能方面的效力。然而，SalfMix 依賴於複製顯著特徵，這會造成過度擬合的風險，潛在會損害模型的概化能力。相反地，KeepAugment 選擇性地保留顯著區域並擴充非顯著區域，會造成領域轉移，這會阻礙關鍵脈絡資訊的交換，並妨礙整體模型理解。為了應對這些挑戰，我們引進 KeepOriginalAugment，這是一種新穎的資料擴充方法。此方法在非顯著區域內智慧地整合最顯著的區域，允許將擴充套用至任一區域。KeepOriginalAugment 在資料多樣性和資訊保留之間取得平衡，使模型能同時利用多樣化的顯著和非顯著區域，進而提升效能。我們探討了三種策略，以決定顯著區域最小值、最大值或隨機放置的位置，並研究交換觀點策略，以決定哪個部分（顯著或非顯著）會進行擴充。我們在 CIFAR-10、CIFAR-100 和 TinyImageNet 等分類資料集上進行的實驗評估，證明 KeepOriginalAugment 的效能優於現有的最先進技術。", "author": "Teerath Kumar et.al.", "authors": "Teerath Kumar, Alessandra Mileo, Malika Bendechache", "id": "2405.06354v1", "paper_url": "http://arxiv.org/abs/2405.06354v1", "repo": "null"}}