{"2406.02876": {"publish_time": "2024-06-05", "title": "LCS: A Language Converter Strategy for Zero-Shot Neural Machine Translation", "paper_summary": "Multilingual neural machine translation models generally distinguish\ntranslation directions by the language tag (LT) in front of the source or\ntarget sentences. However, current LT strategies cannot indicate the desired\ntarget language as expected on zero-shot translation, i.e., the off-target\nissue. Our analysis reveals that the indication of the target language is\nsensitive to the placement of the target LT. For example, when placing the\ntarget LT on the decoder side, the indication would rapidly degrade along with\ndecoding steps, while placing the target LT on the encoder side would lead to\ncopying or paraphrasing the source input. To address the above issues, we\npropose a simple yet effective strategy named Language Converter Strategy\n(LCS). By introducing the target language embedding into the top encoder\nlayers, LCS mitigates confusion in the encoder and ensures stable language\nindication for the decoder. Experimental results on MultiUN, TED, and OPUS-100\ndatasets demonstrate that LCS could significantly mitigate the off-target\nissue, with language accuracy up to 95.28%, 96.21%, and 85.35% meanwhile\noutperforming the vanilla LT strategy by 3.07, 3,3, and 7.93 BLEU scores on\nzero-shot translation, respectively.", "paper_summary_zh": "多语言神经机器翻译模型通常通过源语言或目标语言前面的语言标签 (LT) 来区分翻译方向。然而，当前的 LT 策略无法如预期的那样在零次翻译中指示所需的翻译语言，即离题问题。我们的分析表明，目标语言的指示对目标 LT 的位置敏感。例如，当将目标 LT 放置在解码器端时，指示将随着解码步骤迅速降低，而将目标 LT 放置在编码器端会导致复制或解释源输入。为了解决上述问题，我们提出了一种简单但有效的策略，称为语言转换策略 (LCS)。通过将目标语言嵌入引入到顶层编码器层，LCS 减轻了编码器的混乱，并确保了解码器的稳定语言指示。在 MultiUN、TED 和 OPUS-100 数据集上的实验结果表明，LCS 可以显著减轻离题问题，语言准确率高达 95.28%、96.21% 和 85.35%，同时在零次翻译中分别比香草 LT 策略高出 3.07、3、3 和 7.93 BLEU 分数。", "author": "Zengkui Sun et.al.", "authors": "Zengkui Sun, Yijin Liu, Fandong Meng, Jinan Xu, Yufeng Chen, Jie Zhou", "id": "2406.02876v2", "paper_url": "http://arxiv.org/abs/2406.02876v2", "repo": "https://github.com/acerkoo/lcs"}}