{"2408.01346": {"publish_time": "2024-08-02", "title": "Prompt Refinement or Fine-tuning? Best Practices for using LLMs in Computational Social Science Tasks", "paper_summary": "Large Language Models are expressive tools that enable complex tasks of text\nunderstanding within Computational Social Science. Their versatility, while\nbeneficial, poses a barrier for establishing standardized best practices within\nthe field. To bring clarity on the values of different strategies, we present\nan overview of the performance of modern LLM-based classification methods on a\nbenchmark of 23 social knowledge tasks. Our results point to three best\npractices: select models with larger vocabulary and pre-training corpora; avoid\nsimple zero-shot in favor of AI-enhanced prompting; fine-tune on task-specific\ndata, and consider more complex forms instruction-tuning on multiple datasets\nonly when only training data is more abundant.", "paper_summary_zh": "大型語言模型是一種表現力強大的工具，可以在計算社會科學中執行複雜的文本理解任務。它們的多功能性雖然有益，但對建立該領域的標準化最佳實務構成了障礙。為了釐清不同策略的價值，我們針對 23 項社會知識任務的基準，概述了基於現代 LLM 的分類方法的效能。我們的結果指出了三項最佳實務：選擇具有較大詞彙量和預訓練語料庫的模型；避免使用簡單的零次學習，而改用 AI 增強提示；針對特定任務的資料進行微調，並且僅在訓練資料更豐富時，才考慮對多個資料集進行更複雜形式的指令調整。", "author": "Anders Giovanni Møller et.al.", "authors": "Anders Giovanni Møller, Luca Maria Aiello", "id": "2408.01346v1", "paper_url": "http://arxiv.org/abs/2408.01346v1", "repo": "null"}}