{"2502.13873": {"publish_time": "2025-02-19", "title": "NVR: Vector Runahead on NPUs for Sparse Memory Access", "paper_summary": "Deep Neural Networks are increasingly leveraging sparsity to reduce the\nscaling up of model parameter size. However, reducing wall-clock time through\nsparsity and pruning remains challenging due to irregular memory access\npatterns, leading to frequent cache misses. In this paper, we present NPU\nVector Runahead (NVR), a prefetching mechanism tailored for NPUs to address\ncache miss problems in sparse DNN workloads. Rather than optimising memory\npatterns with high overhead and poor portability, NVR adapts runahead execution\nto the unique architecture of NPUs. NVR provides a general micro-architectural\nsolution for sparse DNN workloads without requiring compiler or algorithmic\nsupport, operating as a decoupled, speculative, lightweight hardware sub-thread\nalongside the NPU, with minimal hardware overhead (under 5%). NVR achieves an\naverage 90% reduction in cache misses compared to SOTA prefetching in\ngeneral-purpose processors, delivering 4x average speedup on sparse workloads\nversus NPUs without prefetching. Moreover, we investigate the advantages of\nincorporating a small cache (16KB) into the NPU combined with NVR. Our\nevaluation shows that expanding this modest cache delivers 5x higher\nperformance benefits than increasing the L2 cache size by the same amount.", "paper_summary_zh": "深度神经网络越来越多地利用稀疏性来减少模型参数大小的扩展。然而，由于不规则的内存访问模式，通过稀疏性和剪枝来减少时钟时间仍然具有挑战性，导致频繁的缓存未命中。在本文中，我们提出了 NPU 矢量超前 (NVR)，这是一种针对 NPU 量身定制的预取机制，以解决稀疏 DNN 工作负载中的缓存未命中问题。NVR 不会通过高开销和较差的可移植性来优化内存模式，而是将超前执行调整为 NPU 的独特架构。NVR 为稀疏 DNN 工作负载提供了一种通用的微架构解决方案，无需编译器或算法支持，作为 NPU 旁路的一个解耦的、推测性的、轻量级的硬件子线程运行，且硬件开销极小（低于 5%）。与通用处理器中的 SOTA 预取相比，NVR 将缓存未命中率平均降低了 90%，在没有预取的 NPU 上，稀疏工作负载的平均加速比为 4 倍。此外，我们研究了将一个小缓存（16KB）与 NVR 结合到 NPU 中的优势。我们的评估表明，扩展此适度缓存提供的性能优势比将 L2 缓存大小增加相同量高 5 倍。", "author": "Hui Wang et.al.", "authors": "Hui Wang, Zhengpeng Zhao, Jing Wang, Yushu Du, Yuan Cheng, Bing Guo, He Xiao, Chenhao Ma, Xiaomeng Han, Dean You, Jiapeng Guan, Ran Wei, Dawei Yang, Zhe Jiang", "id": "2502.13873v1", "paper_url": "http://arxiv.org/abs/2502.13873v1", "repo": "null"}}