{"2406.08957": {"publish_time": "2024-06-13", "title": "Tool Wear Prediction in CNC Turning Operations using Ultrasonic Microphone Arrays and CNNs", "paper_summary": "This paper introduces a novel method for predicting tool wear in CNC turning\noperations, combining ultrasonic microphone arrays and convolutional neural\nnetworks (CNNs). High-frequency acoustic emissions between 0 kHz and 60 kHz are\nenhanced using beamforming techniques to improve the signal- to-noise ratio.\nThe processed acoustic data is then analyzed by a CNN, which predicts the\nRemaining Useful Life (RUL) of cutting tools. Trained on data from 350\nworkpieces machined with a single carbide insert, the model can accurately\npredict the RUL of the carbide insert. Our results demonstrate the potential\ngained by integrating advanced ultrasonic sensors with deep learning for\naccurate predictive maintenance tasks in CNC machining.", "paper_summary_zh": "本文提出了一種新穎的方法，用於預測 CNC 車削操作中的刀具磨損，結合超音波麥克風陣列和卷積神經網路 (CNN)。使用波束成形技術增強 0 kHz 至 60 kHz 之間的高頻聲發射，以改善訊噪比。然後由 CNN 分析處理過的聲學資料，預測切削刀具的剩餘使用壽命 (RUL)。該模型以使用單一硬質合金刀片加工的 350 個工件的資料進行訓練，可以準確預測硬質合金刀片的 RUL。我們的結果證明了將先進的超音波感測器與深度學習整合，在 CNC 加工中進行準確的預測性維護任務所獲得的潛力。", "author": "Jan Steckel et.al.", "authors": "Jan Steckel, Arne Aerts, Erik Verreycken, Dennis Laurijssen, Walter Daems", "id": "2406.08957v1", "paper_url": "http://arxiv.org/abs/2406.08957v1", "repo": "null"}}