{"2410.08811": {"publish_time": "2024-10-11", "title": "PoisonBench: Assessing Large Language Model Vulnerability to Data Poisoning", "paper_summary": "Preference learning is a central component for aligning current LLMs, but\nthis process can be vulnerable to data poisoning attacks. To address this\nconcern, we introduce PoisonBench, a benchmark for evaluating large language\nmodels' susceptibility to data poisoning during preference learning. Data\npoisoning attacks can manipulate large language model responses to include\nhidden malicious content or biases, potentially causing the model to generate\nharmful or unintended outputs while appearing to function normally. We deploy\ntwo distinct attack types across eight realistic scenarios, assessing 21\nwidely-used models. Our findings reveal concerning trends: (1) Scaling up\nparameter size does not inherently enhance resilience against poisoning\nattacks; (2) There exists a log-linear relationship between the effects of the\nattack and the data poison ratio; (3) The effect of data poisoning can\ngeneralize to extrapolated triggers that are not included in the poisoned data.\nThese results expose weaknesses in current preference learning techniques,\nhighlighting the urgent need for more robust defenses against malicious models\nand data manipulation.", "paper_summary_zh": "偏好學習是調整當前大型語言模型的中心組成部分，但這個過程可能容易受到資料中毒攻擊。為了解決這個問題，我們引入了 PoisonBench，一個用於評估大型語言模型在偏好學習過程中對資料中毒的敏感性的基準。資料中毒攻擊可以操縱大型語言模型的回應，包括隱藏的惡意內容或偏見，可能導致模型在看似正常運作時產生有害或意外的輸出。我們在八個實際場景中部署了兩種不同的攻擊類型，評估了 21 個廣泛使用的模型。我們的發現揭示了令人擔憂的趨勢：(1) 擴大參數規模並不能從本質上增強對中毒攻擊的韌性；(2) 攻擊的影響與資料中毒率之間存在對數線性關係；(3) 資料中毒的影響可以推廣到未包含在中毒資料中的外推觸發器。這些結果暴露了當前偏好學習技術中的弱點，強調了對抗惡意模型和資料操縱的更強大防禦措施的迫切需要。", "author": "Tingchen Fu et.al.", "authors": "Tingchen Fu, Mrinank Sharma, Philip Torr, Shay B. Cohen, David Krueger, Fazl Barez", "id": "2410.08811v1", "paper_url": "http://arxiv.org/abs/2410.08811v1", "repo": "null"}}