{"2501.01243": {"publish_time": "2025-01-02", "title": "Face-Human-Bench: A Comprehensive Benchmark of Face and Human Understanding for Multi-modal Assistants", "paper_summary": "Faces and humans are crucial elements in social interaction and are widely\nincluded in everyday photos and videos. Therefore, a deep understanding of\nfaces and humans will enable multi-modal assistants to achieve improved\nresponse quality and broadened application scope. Currently, the multi-modal\nassistant community lacks a comprehensive and scientific evaluation of face and\nhuman understanding abilities. In this paper, we first propose a hierarchical\nability taxonomy that includes three levels of abilities. Then, based on this\ntaxonomy, we collect images and annotations from publicly available datasets in\nthe face and human community and build a semi-automatic data pipeline to\nproduce problems for the new benchmark. Finally, the obtained Face-Human-Bench\ncomprises a development set with 900 problems and a test set with 1800\nproblems, supporting both English and Chinese. We conduct evaluations over 25\nmainstream multi-modal large language models (MLLMs) with our Face-Human-Bench,\nfocusing on the correlation between abilities, the impact of the relative\nposition of targets on performance, and the impact of Chain of Thought (CoT)\nprompting on performance. Moreover, inspired by multi-modal agents, we also\nexplore which abilities of MLLMs need to be supplemented by specialist models.", "paper_summary_zh": "臉部和人類是社交互動中至關重要的元素，並廣泛包含在日常照片和影片中。因此，對臉部和人類的深入了解將使多模態助理能夠獲得更好的回應品質和更廣泛的應用範圍。目前，多模態助理社群缺乏對臉部和人類理解能力的全面且科學的評估。在本文中，我們首先提出一個分層能力分類法，其中包含三級能力。然後，基於此分類法，我們從人臉和人類社群中公開可用的資料集收集影像和註解，並建立一個半自動化資料管道，以產生新基準的問題。最後，獲得的 Face-Human-Bench 包含一個有 900 個問題的開發集和一個有 1800 個問題的測試集，同時支援英文和中文。我們使用我們的 Face-Human-Bench 對 25 個主流多模態大型語言模型 (MLLM) 進行評估，重點關注能力之間的關聯性、目標的相對位置對效能的影響，以及思考鏈 (CoT) 提示對效能的影響。此外，受到多模態代理的啟發，我們也探討了哪些 MLLM 的能力需要由專家模型補充。", "author": "Lixiong Qin et.al.", "authors": "Lixiong Qin, Shilong Ou, Miaoxuan Zhang, Jiangning Wei, Yuhang Zhang, Xiaoshuai Song, Yuchen Liu, Mei Wang, Weiran Xu", "id": "2501.01243v1", "paper_url": "http://arxiv.org/abs/2501.01243v1", "repo": "null"}}