{"2407.07488": {"publish_time": "2024-07-10", "title": "FUNAvg: Federated Uncertainty Weighted Averaging for Datasets with Diverse Labels", "paper_summary": "Federated learning is one popular paradigm to train a joint model in a\ndistributed, privacy-preserving environment. But partial annotations pose an\nobstacle meaning that categories of labels are heterogeneous over clients. We\npropose to learn a joint backbone in a federated manner, while each site\nreceives its own multi-label segmentation head. By using Bayesian techniques we\nobserve that the different segmentation heads although only trained on the\nindividual client's labels also learn information about the other labels not\npresent at the respective site. This information is encoded in their predictive\nuncertainty. To obtain a final prediction we leverage this uncertainty and\nperform a weighted averaging of the ensemble of distributed segmentation heads,\nwhich allows us to segment \"locally unknown\" structures. With our method, which\nwe refer to as FUNAvg, we are even on-par with the models trained and tested on\nthe same dataset on average. The code is publicly available at\nhttps://github.com/Cardio-AI/FUNAvg.", "paper_summary_zh": "联邦学习是一种流行的范例，用于在分布式、保护隐私的环境中训练联合模型。但是，部分注释构成了一个障碍，这意味着标签类别在客户端之间是异构的。我们建议以联邦方式学习联合主干，同时每个站点接收自己的多标签分割头。通过使用贝叶斯技术，我们观察到不同的分割头虽然只针对各个客户端的标签进行训练，但也会学习有关其他标签的信息，而这些标签并不存在于各个站点中。此信息编码在它们的预测不确定性中。为了获得最终预测，我们利用这种不确定性，并对分布式分割头的集合执行加权平均，这使我们能够分割“局部未知”结构。通过我们的方法（我们称之为 FUNAvg），我们甚至可以与在同一数据集上平均训练和测试的模型相提并论。代码已公开发布在 https://github.com/Cardio-AI/FUNAvg。", "author": "Malte Tölle et.al.", "authors": "Malte Tölle, Fernando Navarro, Sebastian Eble, Ivo Wolf, Bjoern Menze, Sandy Engelhardt", "id": "2407.07488v1", "paper_url": "http://arxiv.org/abs/2407.07488v1", "repo": "https://github.com/cardio-ai/funavg"}}