{"2503.05203": {"publish_time": "2025-03-07", "title": "Path Pooling: Train-Free Structure Enhancement for Efficient Knowledge Graph Retrieval-Augmented Generation", "paper_summary": "Although Large Language Models achieve strong success in many tasks, they\nstill suffer from hallucinations and knowledge deficiencies in real-world\napplications. Many knowledge graph-based retrieval-augmented generation\n(KG-RAG) methods enhance the quality and credibility of LLMs by leveraging\nstructure and semantic information in KGs as external knowledge bases. However,\nthese methods struggle to effectively incorporate structure information, either\nincurring high computational costs or underutilizing available knowledge.\nInspired by smoothing operations in graph representation learning, we propose\npath pooling, a simple, train-free strategy that introduces structure\ninformation through a novel path-centric pooling operation. It seamlessly\nintegrates into existing KG-RAG methods in a plug-and-play manner, enabling\nricher structure information utilization. Extensive experiments demonstrate\nthat incorporating the path pooling into the state-of-the-art KG-RAG method\nconsistently improves performance across various settings while introducing\nnegligible additional cost. Code is coming soon at\nhttps://github.com/hrwang00/path-pooling.", "paper_summary_zh": "<paragraph>雖然大型語言模型 (LLM) 在許多任務中取得了巨大的成功，但在實際應用中仍然存在幻覺和知識不足的問題。許多基於知識圖譜的檢索增強生成 (KG-RAG) 方法，藉由利用知識圖譜中的結構和語義資訊作為外部知識庫來提高大型語言模型的品質和可信度。然而，這些方法難以有效地整合結構資訊，要麼產生高昂的計算成本，要麼未充分利用現有知識。受圖形表示學習中平滑操作的啟發，我們提出了路徑池化 (path pooling)，這是一種簡單的、無需訓練的策略，它透過一種新穎的以路徑為中心的池化操作來引入結構資訊。它可以以隨插即用的方式無縫整合到現有的 KG-RAG 方法中，從而實現更豐富的結構資訊利用。大量實驗表明，將路徑池化整合到最先進的 KG-RAG 方法中，可以在各種設定下持續提高效能，同時只增加微不足道的額外成本。程式碼即將在 https://github.com/hrwang00/path-pooling 發佈。</paragraph>\n", "author": "Hairu Wang et.al.", "authors": "Hairu Wang, Yuan Feng, Xike Xie, S Kevin Zhou", "id": "2503.05203v1", "paper_url": "http://arxiv.org/abs/2503.05203v1", "repo": "null"}}