{"2412.11936": {"publish_time": "2024-12-16", "title": "A Survey of Mathematical Reasoning in the Era of Multimodal Large Language Model: Benchmark, Method & Challenges", "paper_summary": "Mathematical reasoning, a core aspect of human cognition, is vital across\nmany domains, from educational problem-solving to scientific advancements. As\nartificial general intelligence (AGI) progresses, integrating large language\nmodels (LLMs) with mathematical reasoning tasks is becoming increasingly\nsignificant. This survey provides the first comprehensive analysis of\nmathematical reasoning in the era of multimodal large language models (MLLMs).\nWe review over 200 studies published since 2021, and examine the\nstate-of-the-art developments in Math-LLMs, with a focus on multimodal\nsettings. We categorize the field into three dimensions: benchmarks,\nmethodologies, and challenges. In particular, we explore multimodal\nmathematical reasoning pipeline, as well as the role of (M)LLMs and the\nassociated methodologies. Finally, we identify five major challenges hindering\nthe realization of AGI in this domain, offering insights into the future\ndirection for enhancing multimodal reasoning capabilities. This survey serves\nas a critical resource for the research community in advancing the capabilities\nof LLMs to tackle complex multimodal reasoning tasks.", "paper_summary_zh": "數學推理是人類認知的核心面向，在許多領域中至關重要，從教育問題解決到科學進步。隨著人工通用智慧 (AGI) 的進展，將大型語言模型 (LLM) 與數學推理任務整合變得越來越重要。這項調查提供了第一個對多模態大型語言模型 (MLLM) 時代數學推理的全面分析。我們回顧了自 2021 年以來發表的 200 多項研究，並檢視了數學 LLM 的最新發展，重點放在多模態設定上。我們將該領域分為三個面向：基準、方法和挑戰。特別是，我們探討了多模態數學推理管道，以及 (M)LLM 和相關方法的角色。最後，我們找出阻礙在這個領域實現 AGI 的五項主要挑戰，並提供對未來加強多模態推理能力方向的見解。這項調查可作為研究社群推進 LLM 解決複雜多模態推理任務能力的重要資源。", "author": "Yibo Yan et.al.", "authors": "Yibo Yan, Jiamin Su, Jianxiang He, Fangteng Fu, Xu Zheng, Yuanhuiyi Lyu, Kun Wang, Shen Wang, Qingsong Wen, Xuming Hu", "id": "2412.11936v1", "paper_url": "http://arxiv.org/abs/2412.11936v1", "repo": "null"}}