{"2407.12504": {"publish_time": "2024-07-17", "title": "Case2Code: Learning Inductive Reasoning with Synthetic Data", "paper_summary": "Complex reasoning is an impressive ability shown by large language models\n(LLMs). Most LLMs are skilled in deductive reasoning, such as chain-of-thought\nprompting or iterative tool-using to solve challenging tasks step-by-step. In\nthis paper, we hope to focus on evaluating and teaching LLMs to conduct\ninductive reasoning, that is, LLMs are supposed to infer underlying rules by\nobserving examples or sequential transformations. However, collecting\nlarge-scale and diverse human-generated inductive data is challenging. We focus\non data synthesis in the code domain and propose a \\textbf{Case2Code} task by\nexploiting the expressiveness and correctness of programs. Specifically, we\ncollect a diverse set of executable programs, synthesize input-output\ntransformations for each program, and force LLMs to infer the underlying code\nimplementations based on the synthetic I/O cases. We first evaluate\nrepresentative LLMs on the synthesized Case2Code task and demonstrate that the\nCase-to-code induction is challenging for LLMs. Then, we synthesize large-scale\nCase2Code training samples to train LLMs to perform inductive reasoning.\nExperimental results show that such induction training benefits not only in\ndistribution Case2Code performance but also enhances various coding abilities\nof trained LLMs, demonstrating the great potential of learning inductive\nreasoning via synthetic data.", "paper_summary_zh": "大型語言模型 (LLM) 展現出令人印象深刻的複雜推理能力。大多數 LLM 都擅長演繹推理，例如思考鏈條提示或反覆使用工具來逐步解決具有挑戰性的任務。在本文中，我們希望專注於評估和指導 LLM 進行歸納推理，也就是說，LLM 應該透過觀察範例或順序轉換來推論底層規則。然而，收集大規模且多樣化的人類產生的歸納數據是一項挑戰。我們專注於程式碼領域的資料合成，並透過利用程式的表現力和正確性來提出一個 **Case2Code** 任務。具體來說，我們收集了一組多樣化的可執行程式，為每個程式合成輸入輸出轉換，並強迫 LLM 根據合成的 I/O 案例推論底層程式碼實作。我們首先在合成的 Case2Code 任務上評估具代表性的 LLM，並證明案例到程式碼的歸納對 LLM 來說具有挑戰性。然後，我們合成大規模的 Case2Code 訓練樣本，以訓練 LLM 執行歸納推理。實驗結果表明，這種歸納訓練不僅有利於分配 Case2Code 效能，還能增強訓練 LLM 的各種編碼能力，證明了透過合成資料學習歸納推理的巨大潛力。", "author": "Yunfan Shao et.al.", "authors": "Yunfan Shao, Linyang Li, Yichuan Ma, Peiji Li, Demin Song, Qinyuan Cheng, Shimin Li, Xiaonan Li, Pengyu Wang, Qipeng Guo, Hang Yan, Xipeng Qiu, Xuanjing Huang, Dahua Lin", "id": "2407.12504v1", "paper_url": "http://arxiv.org/abs/2407.12504v1", "repo": "null"}}