{"2501.05730": {"publish_time": "2025-01-10", "title": "Element-wise Attention Is All You Need", "paper_summary": "The self-attention (SA) mechanism has demonstrated superior performance\nacross various domains, yet it suffers from substantial complexity during both\ntraining and inference. The next-generation architecture, aiming at retaining\nthe competitive performance of SA while achieving low-cost inference and\nefficient long-sequence training, primarily focuses on three approaches: linear\nattention, linear RNNs, and state space models. Although these approaches\nachieve reduced complexity than SA, they all have built-in performance\ndegradation factors, such as diminished “spikiness” and compression of\nhistorical information. In contrast to these approaches, we propose a novel\nelement-wise attention mechanism, which uses the element-wise squared Euclidean\ndistance, instead of the dot product operation, to compute similarity and\napproximates the quadratic complexity term $\\exp(q_{ic}k_{jc})$ with a Taylor\npolynomial. This design achieves remarkable efficiency: during training, the\nelement-wise attention has a complexity of $\\mathcal{O}(tLD)$, making\nlong-sequence training both computationally and memory efficient, where $L$ is\nthe sequence length, $D$ is the feature dimension, and $t$ is the highest order\nof the polynomial; during inference, it can be reformulated as recurrent neural\nnetworks, achieving a inference complexity of $\\mathcal{O}(tD)$. Furthermore,\nthe element-wise attention circumvents the performance degradation factors\npresent in these approaches and achieves performance comparable to SA in both\ncausal and non-causal forms.", "paper_summary_zh": "自注意力 (SA) 機制在各個領域都展現出卓越的效能，然而在訓練和推論期間都飽受複雜性的困擾。新一代架構旨在保留 SA 的競爭效能，同時實現低成本推論和高效長序列訓練，主要專注於三種方法：線性注意力、線性遞迴神經網路和狀態空間模型。儘管這些方法達到了比 SA 更低的複雜性，但它們都有內建的效能降低因素，例如降低的「尖峰性」和歷史資訊的壓縮。與這些方法相反，我們提出了一種新穎的逐元素注意力機制，它使用逐元素平方歐幾里得距離（而非點積運算）來計算相似度，並使用泰勒多項式逼近二次複雜度項 $\\exp(q_{ic}k_{jc})$。此設計達到了顯著的效率：在訓練期間，逐元素注意力具有 $\\mathcal{O}(tLD)$ 的複雜度，使得長序列訓練在計算和記憶體方面都更有效率，其中 $L$ 是序列長度，$D$ 是特徵維度，而 $t$ 是多項式的最高階次；在推論期間，它可以被重新表述為遞迴神經網路，達到 $\\mathcal{O}(tD)$ 的推論複雜度。此外，逐元素注意力迴避了這些方法中存在的效能降低因素，並在因果和非因果形式中都達到了與 SA 相當的效能。", "author": "Guoxin Feng et.al.", "authors": "Guoxin Feng", "id": "2501.05730v1", "paper_url": "http://arxiv.org/abs/2501.05730v1", "repo": "null"}}