{"2406.10273": {"publish_time": "2024-06-11", "title": "Beyond Words: On Large Language Models Actionability in Mission-Critical Risk Analysis", "paper_summary": "Context. Risk analysis assesses potential risks in specific scenarios. Risk\nanalysis principles are context-less; the same methodology can be applied to a\nrisk connected to health and information technology security. Risk analysis\nrequires a vast knowledge of national and international regulations and\nstandards and is time and effort-intensive. A large language model can quickly\nsummarize information in less time than a human and can be fine-tuned to\nspecific tasks. Aim. Our empirical study aims to investigate the effectiveness\nof Retrieval-Augmented Generation and fine-tuned LLM in Risk analysis. To our\nknowledge, no prior study has explored its capabilities in risk analysis.\nMethod. We manually curated \\totalscenarios unique scenarios leading to\n\\totalsamples representative samples from over 50 mission-critical analyses\narchived by the industrial context team in the last five years. We compared the\nbase GPT-3.5 and GPT-4 models versus their Retrieval-Augmented Generation and\nfine-tuned counterparts. We employ two human experts as competitors of the\nmodels and three other three human experts to review the models and the former\nhuman expert's analysis. The reviewers analyzed 5,000 scenario analyses.\nResults and Conclusions. HEs demonstrated higher accuracy, but LLMs are quicker\nand more actionable. Moreover, our findings show that RAG-assisted LLMs have\nthe lowest hallucination rates, effectively uncovering hidden risks and\ncomplementing human expertise. Thus, the choice of model depends on specific\nneeds, with FTMs for accuracy, RAG for hidden risks discovery, and base models\nfor comprehensiveness and actionability. Therefore, experts can leverage LLMs\nfor an effective complementing companion in risk analysis within a condensed\ntimeframe. They can also save costs by averting unnecessary expenses associated\nwith implementing unwarranted countermeasures.", "paper_summary_zh": "<paragraph>背景。風險分析評估特定情境中的潛在風險。風險分析原則與情境無關；相同的分析方法可以應用於與健康和資訊技術安全相關的風險。風險分析需要具備廣泛的國家和國際法規及標準知識，而且需要耗費大量時間和精力。大型語言模型可以在比人類更短的時間內快速摘要資訊，並且可以針對特定任務進行微調。目標。我們的實證研究旨在探討檢索增強式生成和微調 LLM 在風險分析中的有效性。據我們所知，沒有先前的研究探討其在風險分析中的能力。方法。我們手動策劃了 \\totalscenarios 個導致 \\totalsamples 個代表性樣本的獨特情境，這些樣本來自產業情境小組在過去五年中歸檔的 50 多項任務關鍵分析。我們比較了基本 GPT-3.5 和 GPT-4 模型與其檢索增強式生成和微調的對應模型。我們聘請兩位人類專家作為模型的競爭者，並聘請另外三位人類專家來審查模型和前一位人類專家的分析。審查人員分析了 5,000 個情境分析。結果和結論。人類專家展現出較高的準確度，但 LLM 較快且更具可操作性。此外，我們的研究結果顯示，RAG 輔助的 LLM 具有最低的幻覺率，能有效揭露隱藏風險並補充人類專業知識。因此，模型的選擇取決於特定需求，FTM 適用於準確性，RAG 適用於隱藏風險發現，而基本模型適用於全面性和可操作性。因此，專家可以在風險分析中利用 LLM 作為一個有效的補充夥伴，並在縮短的時間範圍內。他們還可以透過避免與實施不必要的對策相關的不必要開支來節省成本。</paragraph>", "author": "Matteo Esposito et.al.", "authors": "Matteo Esposito, Francesco Palagiano, Valentina Lenarduzzi", "id": "2406.10273v1", "paper_url": "http://arxiv.org/abs/2406.10273v1", "repo": "null"}}