{"2411.14254": {"publish_time": "2024-11-21", "title": "BERT-Based Approach for Automating Course Articulation Matrix Construction with Explainable AI", "paper_summary": "Course Outcome (CO) and Program Outcome (PO)/Program-Specific Outcome (PSO)\nalignment is a crucial task for ensuring curriculum coherence and assessing\neducational effectiveness. The construction of a Course Articulation Matrix\n(CAM), which quantifies the relationship between COs and POs/PSOs, typically\ninvolves assigning numerical values (0, 1, 2, 3) to represent the degree of\nalignment. In this study, We experiment with four models from the BERT family:\nBERT Base, DistilBERT, ALBERT, and RoBERTa, and use multiclass classification\nto assess the alignment between CO and PO/PSO pairs. We first evaluate\ntraditional machine learning classifiers, such as Decision Tree, Random Forest,\nand XGBoost, and then apply transfer learning to evaluate the performance of\nthe pretrained BERT models. To enhance model interpretability, we apply\nExplainable AI technique, specifically Local Interpretable Model-agnostic\nExplanations (LIME), to provide transparency into the decision-making process.\nOur system achieves accuracy, precision, recall, and F1-score values of 98.66%,\n98.67%, 98.66%, and 98.66%, respectively. This work demonstrates the potential\nof utilizing transfer learning with BERT-based models for the automated\ngeneration of CAMs, offering high performance and interpretability in\neducational outcome assessment.", "paper_summary_zh": "課程成果 (CO) 與計畫成果 (PO)/計畫特定成果 (PSO)\n對齊對於確保課程架構一致性及評量教育成效至關重要。課程關聯矩陣 (CAM) 的建構量化 CO 與 PO/PSO 之間的關係，通常\n會指派數值 (0、1、2、3) 來表示對齊程度。在本研究中，我們實驗 BERT 家族中的四個模型：BERT Base、DistilBERT、ALBERT 和 RoBERTa，並使用多類別分類來評估 CO 和 PO/PSO 成對之間的對齊。我們首先評估傳統機器學習分類器，例如決策樹、隨機森林，\n以及 XGBoost，然後應用遷移學習來評估預訓練 BERT 模型的效能。為了增強模型可解釋性，我們應用可解釋 AI 技術，特別是局部可解釋模型不可知解釋 (LIME)，以提供決策制定過程的透明度。\n我們的系統達到準確率、精準度、召回率和 F1 分數值分別為 98.66%、98.67%、98.66% 和 98.66%。這項工作展示了利用遷移學習與 BERT 為基礎的模型進行 CAM 自動產生的潛力，在教育成果評量中提供高性能和可解釋性。", "author": "Natenaile Asmamaw Shiferaw et.al.", "authors": "Natenaile Asmamaw Shiferaw, Simpenzwe Honore Leandre, Aman Sinha, Dillip Rout", "id": "2411.14254v1", "paper_url": "http://arxiv.org/abs/2411.14254v1", "repo": "https://github.com/natenaile/bert-based-approach-for-automating-course-articulation-matrix-construction-with-explainable-ai"}}