{"2410.13458": {"publish_time": "2024-10-17", "title": "MedINST: Meta Dataset of Biomedical Instructions", "paper_summary": "The integration of large language model (LLM) techniques in the field of\nmedical analysis has brought about significant advancements, yet the scarcity\nof large, diverse, and well-annotated datasets remains a major challenge.\nMedical data and tasks, which vary in format, size, and other parameters,\nrequire extensive preprocessing and standardization for effective use in\ntraining LLMs. To address these challenges, we introduce MedINST, the Meta\nDataset of Biomedical Instructions, a novel multi-domain, multi-task\ninstructional meta-dataset. MedINST comprises 133 biomedical NLP tasks and over\n7 million training samples, making it the most comprehensive biomedical\ninstruction dataset to date. Using MedINST as the meta dataset, we curate\nMedINST32, a challenging benchmark with different task difficulties aiming to\nevaluate LLMs' generalization ability. We fine-tune several LLMs on MedINST and\nevaluate on MedINST32, showcasing enhanced cross-task generalization.", "paper_summary_zh": "大型語言模型 (LLM) 技術在醫學分析領域的整合帶來了顯著的進展，但缺乏大型、多樣且標註完善的資料集仍然是一項重大挑戰。\n醫療資料和任務在格式、大小和其他參數上有所不同，需要廣泛的預處理和標準化才能在訓練 LLM 中有效使用。為了應對這些挑戰，我們引入了 MedINST，即生物醫學指令的元資料集，這是一個新穎的多領域、多任務指令元資料集。MedINST 包含 133 個生物醫學 NLP 任務和超過 700 萬個訓練樣本，使其成為迄今為止最全面的生物醫學指令資料集。使用 MedINST 作為元資料集，我們策劃了 MedINST32，這是一個具有不同任務難度的具有挑戰性的基準，旨在評估 LLM 的泛化能力。我們在 MedINST 上微調了多個 LLM，並在 MedINST32 上進行評估，展示了增強的跨任務泛化。", "author": "Wenhan Han et.al.", "authors": "Wenhan Han, Meng Fang, Zihan Zhang, Yu Yin, Zirui Song, Ling Chen, Mykola Pechenizkiy, Qingyu Chen", "id": "2410.13458v1", "paper_url": "http://arxiv.org/abs/2410.13458v1", "repo": "https://github.com/aialt/medinst"}}