{"2505.00675": {"publish_time": "2025-05-01", "title": "Rethinking Memory in AI: Taxonomy, Operations, Topics, and Future Directions", "paper_summary": "Memory is a fundamental component of AI systems, underpinning large language\nmodels (LLMs) based agents. While prior surveys have focused on memory\napplications with LLMs, they often overlook the atomic operations that underlie\nmemory dynamics. In this survey, we first categorize memory representations\ninto parametric, contextual structured, and contextual unstructured and then\nintroduce six fundamental memory operations: Consolidation, Updating, Indexing,\nForgetting, Retrieval, and Compression. We systematically map these operations\nto the most relevant research topics across long-term, long-context, parametric\nmodification, and multi-source memory. By reframing memory systems through the\nlens of atomic operations and representation types, this survey provides a\nstructured and dynamic perspective on research, benchmark datasets, and tools\nrelated to memory in AI, clarifying the functional interplay in LLMs based\nagents while outlining promising directions for future research\\footnote{The\npaper list, datasets, methods and tools are available at\n\\href{https://github.com/Elvin-Yiming-Du/Survey_Memory_in_AI}{https://github.com/Elvin-Yiming-Du/Survey\\_Memory\\_in\\_AI}.}.", "paper_summary_zh": "記憶體是人工智慧系統的基礎組成部分，支撐著基於大型語言模型 (LLM) 的代理。雖然之前的綜述文章都專注於 LLM 的記憶體應用，但它們經常忽略了記憶體動態背後的原子操作。在本綜述中，我們首先將記憶體表示分類為參數式、上下文結構化和上下文非結構化，然後介紹六種基本的記憶體操作：整合、更新、索引、遺忘、檢索和壓縮。我們系統地將這些操作映射到長期記憶體、長上下文記憶體、參數修改和多源記憶體中最相關的研究主題。通過原子操作和表示類型的視角重新構建記憶體系統，本綜述為人工智慧中與記憶體相關的研究、基準數據集和工具提供了一個結構化和動態的視角，闡明了基於 LLM 的代理中的功能交互，同時概述了未來研究的 promising 方向\\footnote{論文列表、數據集、方法和工具可在 \\href{https://github.com/Elvin-Yiming-Du/Survey_Memory_in_AI}{https://github.com/Elvin-Yiming-Du/Survey\\_Memory\\_in\\_AI} 找到。}。\n", "author": "Yiming Du et.al.", "authors": "Yiming Du, Wenyu Huang, Danna Zheng, Zhaowei Wang, Sebastien Montella, Mirella Lapata, Kam-Fai Wong, Jeff Z. Pan", "id": "2505.00675v1", "paper_url": "http://arxiv.org/abs/2505.00675v1", "repo": "null"}}