{"2409.02343": {"publish_time": "2024-09-04", "title": "NUDGE: Lightweight Non-Parametric Fine-Tuning of Embeddings for Retrieval", "paper_summary": "$k$-Nearest Neighbor search on dense vector embeddings ($k$-NN retrieval)\nfrom pre-trained embedding models is the predominant retrieval method for text\nand images, as well as Retrieval-Augmented Generation (RAG) pipelines. In\npractice, application developers often fine-tune the embeddings to improve\ntheir accuracy on the dataset and query workload in hand. Existing approaches\neither fine-tune the pre-trained model itself or, more efficiently, but at the\ncost of accuracy, train adaptor models to transform the output of the\npre-trained model. We present NUDGE, a family of novel non-parametric embedding\nfine-tuning approaches that are significantly more accurate and efficient than\nboth sets of existing approaches. NUDGE directly modifies the embeddings of\ndata records to maximize the accuracy of $k$-NN retrieval. We present a\nthorough theoretical and experimental study of NUDGE's non-parametric approach.\nWe show that even though the underlying problem is NP-Hard, constrained\nvariations can be solved efficiently. These constraints additionally ensure\nthat the changes to the embeddings are modest, avoiding large distortions to\nthe semantics learned during pre-training. In experiments across five\npre-trained models and nine standard text and image retrieval datasets, NUDGE\nruns in minutes and often improves NDCG@10 by more than 10% over existing\nfine-tuning methods. On average, NUDGE provides 3.3x and 4.3x higher increase\nin accuracy and runs 200x and 3x faster, respectively, over fine-tuning the\npre-trained model and training adaptors.", "paper_summary_zh": "預先訓練嵌入模型的稠密向量嵌入上的 $k$-最近鄰搜尋（$k$-NN 檢索）是文本和圖像以及檢索增強生成（RAG）管線的主要檢索方法。在實務上，應用程式開發人員經常微調嵌入，以提高其在手邊的資料集和查詢工作負載上的準確度。現有方法會微調預先訓練模型本身，或者更有效率，但以準確度為代價，訓練適配器模型來轉換預先訓練模型的輸出。我們提出 NUDGE，這是一系列新穎的非參數嵌入微調方法，其準確度和效率都顯著高於兩組現有方法。NUDGE 直接修改資料記錄的嵌入，以最大化 $k$-NN 檢索的準確度。我們提出對 NUDGE 的非參數方法進行徹底的理論和實驗研究。我們表明，即使基礎問題是 NP-Hard，約束變異也可以有效解決。這些約束另外確保嵌入的變更適度，避免對預訓練期間學習到的語義造成大幅失真。在五個預先訓練模型和九個標準文本和圖像檢索資料集的實驗中，NUDGE 在幾分鐘內執行，並且經常將 NDCG@10 提升超過 10%，優於現有的微調方法。平均而言，與微調預先訓練模型和訓練適配器相比，NUDGE 分別提供了 3.3 倍和 4.3 倍更高的準確度提升，並且執行速度分別快了 200 倍和 3 倍。", "author": "Sepanta Zeighami et.al.", "authors": "Sepanta Zeighami, Zac Wellmer, Aditya Parameswaran", "id": "2409.02343v1", "paper_url": "http://arxiv.org/abs/2409.02343v1", "repo": "null"}}