{"2405.19139": {"publish_time": "2024-05-29", "title": "DGRC: An Effective Fine-tuning Framework for Distractor Generation in Chinese Multi-choice Reading Comprehension", "paper_summary": "When evaluating a learner's knowledge proficiency, the multiple-choice\nquestion is an efficient and widely used format in standardized tests.\nNevertheless, generating these questions, particularly plausible distractors\n(incorrect options), poses a considerable challenge. Generally, the distractor\ngeneration can be classified into cloze-style distractor generation (CDG) and\nnatural questions distractor generation (NQDG). In contrast to the CDG,\nutilizing pre-trained language models (PLMs) for NQDG presents three primary\nchallenges: (1) PLMs are typically trained to generate ``correct'' content,\nlike answers, while rarely trained to generate ``plausible\" content, like\ndistractors; (2) PLMs often struggle to produce content that aligns well with\nspecific knowledge and the style of exams; (3) NQDG necessitates the model to\nproduce longer, context-sensitive, and question-relevant distractors. In this\nstudy, we introduce a fine-tuning framework named DGRC for NQDG in Chinese\nmulti-choice reading comprehension from authentic examinations. DGRC comprises\nthree major components: hard chain-of-thought, multi-task learning, and\ngeneration mask patterns. The experiment results demonstrate that DGRC\nsignificantly enhances generation performance, achieving a more than 2.5-fold\nimprovement in BLEU scores.", "paper_summary_zh": "在評估學習者的知識能力時，多選題是一種標準化考試中有效且廣泛使用的格式。儘管如此，產生這些問題，尤其是合理的干擾項（錯誤選項），是一個相當大的挑戰。一般來說，干擾項產生可以分為填空式干擾項產生（CDG）和自然問題干擾項產生（NQDG）。與 CDG 相比，利用預先訓練的語言模型（PLM）進行 NQDG 會產生三個主要挑戰：（1）PLM 通常被訓練來產生「正確」的內容，例如答案，而很少被訓練來產生「合理的」內容，例如干擾項；（2）PLM 經常難以產生與特定知識和考試風格相符的內容；（3）NQDG 需要模型產生更長、與上下文相關且與問題相關的干擾項。在這項研究中，我們引入了一個名為 DGRC 的微調框架，用於從真實考試中進行中文多選題閱讀理解的 NQDG。DGRC 包含三個主要組成部分：硬鏈式思考、多任務學習和生成遮罩模式。實驗結果表明，DGRC 大大增強了生成性能，BLEU 分數提高了 2.5 倍以上。", "author": "Runfeng Lin et.al.", "authors": "Runfeng Lin, Dacheng Xu, Huijiang Wang, Zebiao Chen, Yating Wang, Shouqiang Liu", "id": "2405.19139v1", "paper_url": "http://arxiv.org/abs/2405.19139v1", "repo": "null"}}