{"2405.10918": {"publish_time": "2024-05-17", "title": "GenToC: Leveraging Partially-Labeled Data for Product Attribute-Value Identification", "paper_summary": "In the e-commerce domain, the accurate extraction of attribute-value pairs\nfrom product listings (e.g., Brand: Apple) is crucial for enhancing search and\nrecommendation systems. The automation of this extraction process is\nchallenging due to the vast diversity of product categories and their\nrespective attributes, compounded by the lack of extensive, accurately\nannotated training datasets and the demand for low latency to meet the\nreal-time needs of e-commerce platforms. To address these challenges, we\nintroduce GenToC, a novel two-stage model for extracting attribute-value pairs\nfrom product titles. GenToC is designed to train with partially-labeled data,\nleveraging incomplete attribute-value pairs and obviating the need for a fully\nannotated dataset. Moreover, we introduce a bootstrapping method that enables\nGenToC to progressively refine and expand its training dataset. This\nenhancement substantially improves the quality of data available for training\nother neural network models that are typically faster but are inherently less\ncapable than GenToC in terms of their capacity to handle partially-labeled\ndata. By supplying an enriched dataset for training, GenToC significantly\nadvances the performance of these alternative models, making them more suitable\nfor real-time deployment. Our results highlight the unique capability of GenToC\nto learn from a limited set of labeled data and to contribute to the training\nof more efficient models, marking a significant leap forward in the automated\nextraction of attribute-value pairs from product titles. GenToC has been\nsuccessfully integrated into India's largest B2B e-commerce platform,\nIndiaMART.com, achieving a significant increase of 21.1% in recall over the\nexisting deployed system while maintaining a high precision of 89.5% in this\nchallenging task.", "paper_summary_zh": "在電子商務領域中，從產品清單中準確提取屬性-值對（例如，品牌：Apple）對於增強搜尋和推薦系統至關重要。由於產品類別及其各自屬性的種類繁多，加上缺乏廣泛且準確標註的訓練資料集，以及滿足電子商務平台的即時需求而對低延遲性的要求，使得此提取程序的自動化面臨挑戰。為了應對這些挑戰，我們引入了 GenToC，這是一個用於從產品標題中提取屬性-值對的新穎兩階段模型。GenToC 旨在使用部分標記的資料進行訓練，利用不完整的屬性-值對，並消除了對完全標註資料集的需求。此外，我們引入了一種自舉法，使 GenToC 能夠逐步優化和擴展其訓練資料集。此增強功能大幅提升了可用於訓練其他神經網路模型的資料品質，這些模型通常較快，但就其處理部分標記資料的能力而言，本質上不如 GenToC。透過提供豐富的資料集進行訓練，GenToC 大幅提升了這些替代模型的效能，使其更適合於即時部署。我們的結果突顯了 GenToC 從有限的標記資料集中學習並有助於訓練更有效率的模型的獨特能力，標誌著從產品標題中自動提取屬性-值對向前邁出了一大步。GenToC 已成功整合到印度最大的 B2B 電子商務平台 IndiaMART.com 中，在保持此項艱鉅任務中 89.5% 的高精度下，召回率比現有已部署系統大幅提升了 21.1%。", "author": "D. Subhalingam et.al.", "authors": "D. Subhalingam, Keshav Kolluru, Mausam, Saurabh Singal", "id": "2405.10918v1", "paper_url": "http://arxiv.org/abs/2405.10918v1", "repo": "null"}}