{"2408.05794": {"publish_time": "2024-08-11", "title": "HateSieve: A Contrastive Learning Framework for Detecting and Segmenting Hateful Content in Multimodal Memes", "paper_summary": "Amidst the rise of Large Multimodal Models (LMMs) and their widespread\napplication in generating and interpreting complex content, the risk of\npropagating biased and harmful memes remains significant. Current safety\nmeasures often fail to detect subtly integrated hateful content within\n``Confounder Memes''. To address this, we introduce \\textsc{HateSieve}, a new\nframework designed to enhance the detection and segmentation of hateful\nelements in memes. \\textsc{HateSieve} features a novel Contrastive Meme\nGenerator that creates semantically paired memes, a customized triplet dataset\nfor contrastive learning, and an Image-Text Alignment module that produces\ncontext-aware embeddings for accurate meme segmentation. Empirical experiments\non the Hateful Meme Dataset show that \\textsc{HateSieve} not only surpasses\nexisting LMMs in performance with fewer trainable parameters but also offers a\nrobust mechanism for precisely identifying and isolating hateful content.\n\\textcolor{red}{Caution: Contains academic discussions of hate speech; viewer\ndiscretion advised.}", "paper_summary_zh": "隨著大型多模態模型 (LMM) 的興起及其在生成和詮釋複雜內容中的廣泛應用，傳播有偏見和有害迷因的風險仍然很大。目前的安全性措施通常無法偵測到巧妙整合在「混淆迷因」中的仇恨內容。為了解決這個問題，我們引入了 \\textsc{HateSieve}，一個新的架構，旨在加強偵測和區隔迷因中具有仇恨性的元素。\\textsc{HateSieve} 具備一個新穎的對比迷因生成器，可建立語義配對的迷因、一個自訂的三元組資料集，用於對比學習，以及一個影像文字對齊模組，可產生具有情境感知的嵌入，以進行精確的迷因區隔。在 Hateful Meme Dataset 上的實證實驗顯示，\\textsc{HateSieve} 不僅以較少的可訓練參數超越現有的 LMM，還提供了一個強健的機制來精確識別和隔離仇恨內容。\n\\textcolor{red}{注意：包含仇恨言論的學術討論；建議觀眾自行斟酌。}", "author": "Xuanyu Su et.al.", "authors": "Xuanyu Su, Yansong Li, Diana Inkpen, Nathalie Japkowicz", "id": "2408.05794v1", "paper_url": "http://arxiv.org/abs/2408.05794v1", "repo": "null"}}