{"2412.03187": {"publish_time": "2024-12-04", "title": "Weighted-Reward Preference Optimization for Implicit Model Fusion", "paper_summary": "While fusing heterogeneous open-source LLMs with varying architectures and\nsizes can potentially integrate the strengths of different models, existing\nfusion methods face significant challenges, such as vocabulary alignment and\nmerging distribution matrices. These procedures are not only complex but also\nprone to introducing noise and errors. In this paper, we propose an implicit\nfusion method, Weighted-Reward Preference Optimization (WRPO), which leverages\npreference optimization between the source LLMs and the target LLM to transfer\ntheir capabilities effectively. WRPO eliminates the need for vocabulary\nalignment and matrix fusion and can be efficiently scaled to accommodate\nvarious LLMs. To address distributional deviations between the source and\ntarget LLMs, WRPO introduces a progressive adaptation strategy that gradually\nshifts reliance on preferred examples from the target LLM to the source LLMs.\nExtensive experiments on the MT-Bench, AlpacaEval-2, and Arena-Hard benchmarks\ndemonstrate that WRPO consistently outperforms existing knowledge fusion\nmethods and various fine-tuning baselines. When applied to LLaMA3-8B-Instruct\nas the target model, WRPO achieves a length-controlled win rate of 55.9%\nagainst GPT-4-Preview-1106 on AlpacaEval-2 and a win rate of 46.2% against\nGPT-4-0314 on Arena-Hard. Our code is available at\n\\url{https://github.com/SLIT-AI/WRPO}.", "paper_summary_zh": "<paragraph>雖然融合異質開放原始碼 LLM，其架構和規模各異，有整合不同模型優勢的潛力，現有的融合方法卻面臨諸多挑戰，例如詞彙比對和合併分佈矩陣。這些程序不僅複雜，還容易引入雜訊和錯誤。在本文中，我們提出了一種隱式融合方法，即加權獎勵偏好最佳化 (WRPO)，它利用原始 LLM 和目標 LLM 之間的偏好最佳化來有效轉移它們的能力。WRPO 消除了詞彙比對和矩陣融合的需要，並且可以有效擴展以容納各種 LLM。為了解決原始和目標 LLM 之間的分配偏差，WRPO 引入了一種漸進適應策略，逐漸將對目標 LLM 的偏好範例的依賴轉移到原始 LLM。在 MT-Bench、AlpacaEval-2 和 Arena-Hard 基準上的廣泛實驗表明，WRPO 持續優於現有的知識融合方法和各種微調基準。當應用於 LLaMA3-8B-Instruct 作為目標模型時，WRPO 在 AlpacaEval-2 上對 GPT-4-Preview-1106 達到了 55.9% 的長度控制獲勝率，在 Arena-Hard 上對 GPT-4-0314 達到了 46.2% 的獲勝率。我們的程式碼可在以下網址取得：\\url{https://github.com/SLIT-AI/WRPO}。</paragraph>", "author": "Ziyi Yang et.al.", "authors": "Ziyi Yang, Fanqi Wan, Longguang Zhong, Tianyuan Shi, Xiaojun Quan", "id": "2412.03187v1", "paper_url": "http://arxiv.org/abs/2412.03187v1", "repo": "https://github.com/SLIT-AI/WRPO"}}