{"2407.08192": {"publish_time": "2024-07-11", "title": "ARCO:Adaptive Multi-Agent Reinforcement Learning-Based Hardware/Software Co-Optimization Compiler for Improved Performance in DNN Accelerator Design", "paper_summary": "This paper presents ARCO, an adaptive Multi-Agent Reinforcement Learning\n(MARL)-based co-optimizing compilation framework designed to enhance the\nefficiency of mapping machine learning (ML) models - such as Deep Neural\nNetworks (DNNs) - onto diverse hardware platforms. The framework incorporates\nthree specialized actor-critic agents within MARL, each dedicated to a distinct\naspect of compilation/optimization at an abstract level: one agent focuses on\nhardware, while two agents focus on software optimizations. This integration\nresults in a collaborative hardware/software co-optimization strategy that\nimproves the precision and speed of DNN deployments. Concentrating on\nhigh-confidence configurations simplifies the search space and delivers\nsuperior performance compared to current optimization methods. The ARCO\nframework surpasses existing leading frameworks, achieving a throughput\nincrease of up to 37.95% while reducing the optimization time by up to 42.2%\nacross various DNNs.", "paper_summary_zh": "本文提出 ARCO，一種基於適應性多智能體強化學習 (MARL) 的共同最佳化編譯架構，旨在提升將機器學習 (ML) 模型（例如深度神經網路 (DNN)) 對應到不同硬體平台的效率。此架構在 MARL 中整合了三個專門的動作-評論智能體，每個智能體在抽象層面上專注於編譯/最佳化的不同面向：一個智能體專注於硬體，而另外兩個智能體則專注於軟體最佳化。這種整合產生一種協作式硬體/軟體共同最佳化策略，可提升 DNN 部署的精準度和速度。專注於高信心的組態可簡化搜尋空間，並提供優於現有最佳化方法的卓越效能。ARCO 架構超越現有的領先架構，在各種 DNN 中實現吞吐量增加高達 37.95%，同時將最佳化時間減少高達 42.2%。", "author": "Arya Fayyazi et.al.", "authors": "Arya Fayyazi, Mehdi Kamal, Massoud Pedram", "id": "2407.08192v1", "paper_url": "http://arxiv.org/abs/2407.08192v1", "repo": "null"}}