{"2409.04720": {"publish_time": "2024-09-07", "title": "A Comprehensive Survey on Evidential Deep Learning and Its Applications", "paper_summary": "Reliable uncertainty estimation has become a crucial requirement for the\nindustrial deployment of deep learning algorithms, particularly in high-risk\napplications such as autonomous driving and medical diagnosis. However,\nmainstream uncertainty estimation methods, based on deep ensembling or Bayesian\nneural networks, generally impose substantial computational overhead. To\naddress this challenge, a novel paradigm called Evidential Deep Learning (EDL)\nhas emerged, providing reliable uncertainty estimation with minimal additional\ncomputation in a single forward pass. This survey provides a comprehensive\noverview of the current research on EDL, designed to offer readers a broad\nintroduction to the field without assuming prior knowledge. Specifically, we\nfirst delve into the theoretical foundation of EDL, the subjective logic\ntheory, and discuss its distinctions from other uncertainty estimation\nframeworks. We further present existing theoretical advancements in EDL from\nfour perspectives: reformulating the evidence collection process, improving\nuncertainty estimation via OOD samples, delving into various training\nstrategies, and evidential regression networks. Thereafter, we elaborate on its\nextensive applications across various machine learning paradigms and downstream\ntasks. In the end, an outlook on future directions for better performances and\nbroader adoption of EDL is provided, highlighting potential research avenues.", "paper_summary_zh": "可靠的不確定性估計已成為深度學習演算法產業部署的關鍵需求，特別是在高風險應用中，例如自動駕駛和醫療診斷。然而，基於深度集成或貝氏神經網路的主流不確定性估計方法通常會造成大量的計算負擔。為了應對這項挑戰，一種稱為證據深度學習 (EDL) 的新範例應運而生，它在單次前向傳遞中以最少的額外運算提供可靠的不確定性估計。這項調查對 EDL 的現有研究提供全面的概述，旨在為讀者提供該領域的廣泛介紹，而無需假設先備知識。具體來說，我們首先深入探討 EDL 的理論基礎，即主觀邏輯理論，並討論其與其他不確定性估計架構的區別。我們進一步從四個角度介紹 EDL 中現有的理論進展：重新制定證據收集過程、透過 OOD 樣本改善不確定性估計、深入探討各種訓練策略以及證據回歸網路。此後，我們詳細說明它在各種機器學習範例和下游任務中的廣泛應用。最後，我們提供了對未來方向的展望，以期獲得更好的效能和更廣泛地採用 EDL，並重點介紹潛在的研究途徑。", "author": "Junyu Gao et.al.", "authors": "Junyu Gao, Mengyuan Chen, Liangyu Xiang, Changsheng Xu", "id": "2409.04720v1", "paper_url": "http://arxiv.org/abs/2409.04720v1", "repo": "null"}}