{"2412.03161": {"publish_time": "2024-12-04", "title": "Physics-Informed Deep Inverse Operator Networks for Solving PDE Inverse Problems", "paper_summary": "Inverse problems involving partial differential equations (PDEs) can be seen\nas discovering a mapping from measurement data to unknown quantities, often\nframed within an operator learning approach. However, existing methods\ntypically rely on large amounts of labeled training data, which is impractical\nfor most real-world applications. Moreover, these supervised models may fail to\ncapture the underlying physical principles accurately. To address these\nlimitations, we propose a novel architecture called Physics-Informed Deep\nInverse Operator Networks (PI-DIONs), which can learn the solution operator of\nPDE-based inverse problems without labeled training data. We extend the\nstability estimates established in the inverse problem literature to the\noperator learning framework, thereby providing a robust theoretical foundation\nfor our method. These estimates guarantee that the proposed model, trained on a\nfinite sample and grid, generalizes effectively across the entire domain and\nfunction space. Extensive experiments are conducted to demonstrate that\nPI-DIONs can effectively and accurately learn the solution operators of the\ninverse problems without the need for labeled data.", "paper_summary_zh": "涉及偏微分方程 (PDE) 的反問題可以視為從測量數據中找出對應未知數的對應關係，通常會在運算子學習方法中建構。不過，現有方法通常仰賴大量標籤訓練資料，這在多數真實世界的應用中並不切實際。此外，這些監督式模型可能無法精準捕捉到底層的物理原理。為了解決這些限制，我們提出了一種稱為物理訊息深度反運算子網路 (PI-DION) 的新架構，它可以在沒有標籤訓練資料的情況下學習基於 PDE 的反問題的解運算子。我們將反問題文獻中已建立的穩定性估計值延伸到運算子學習架構中，進而為我們的模型提供穩健的理論基礎。這些估計值保證了所提出的模型在有限樣本和網格上訓練後，可以在整個網域和函數空間中有效地進行概化。我們進行了大量的實驗，以證明 PI-DION 可以有效且精準地學習反問題的解運算子，而且不需要標籤資料。", "author": "Sung Woong Cho et.al.", "authors": "Sung Woong Cho, Hwijae Son", "id": "2412.03161v1", "paper_url": "http://arxiv.org/abs/2412.03161v1", "repo": "null"}}