{"2409.04964": {"publish_time": "2024-09-08", "title": "Evaluation of Google Translate for Mandarin Chinese translation using sentiment and semantic analysis", "paper_summary": "Machine translation using large language models (LLMs) is having a\nsignificant global impact, making communication easier. Mandarin Chinese is the\nofficial language used for communication by the government, education\ninstitutes, and media in China. In this study, we provide an automated\nassessment of machine translation models with human experts using sentiment and\nsemantic analysis. In order to demonstrate our framework, we select classic\nearly twentieth-century novel 'The True Story of Ah Q' with selected Mandarin\nChinese to English translations. We also us Google Translate to generate the\ngiven text into English and then conduct a chapter-wise sentiment analysis and\nsemantic analysis to compare the extracted sentiments across the different\ntranslations. We utilise LLMs for semantic and sentiment analysis. Our results\nindicate that the precision of Google Translate differs both in terms of\nsemantic and sentiment analysis when compared to human expert translations. We\nfind that Google Translate is unable to translate some of the specific words or\nphrases in Chinese, such as Chinese traditional allusions. The mistranslations\nhave to its lack of contextual significance and historical knowledge of China.\nThus, this framework brought us some new insights about machine translation for\nChinese Mandarin. The future work can explore other languages or types of texts\nwith this framework.", "paper_summary_zh": "使用大型語言模型 (LLM) 的機器翻譯具有重大全球影響，讓溝通變得更輕鬆。中文是中國政府、教育機構和媒體用於溝通的官方語言。在本研究中，我們使用情緒和語義分析，提供由人類專家進行的機器翻譯模型自動評估。為了展示我們的架構，我們選擇了 20 世紀初的經典小說《阿 Q 正傳》，並選取了中文對應的英文翻譯。我們還使用 Google 翻譯將給定的文字轉換為英文，然後進行逐章情緒分析和語義分析，以比較不同翻譯中提取的情緒。我們利用 LLM 進行語義和情緒分析。我們的結果表明，與人類專家翻譯相比，Google 翻譯在語義和情緒分析方面的準確度不同。我們發現 Google 翻譯無法翻譯中文中的某些特定字詞或短語，例如中國傳統典故。翻譯錯誤是因為它缺乏中國的背景意義和歷史知識。因此，這個架構為我們帶來了關於中文機器翻譯的一些新見解。未來的研究可以利用這個架構探討其他語言或類型的文本。", "author": "Xuechun Wang et.al.", "authors": "Xuechun Wang, Rodney Beard, Rohitash Chandra", "id": "2409.04964v1", "paper_url": "http://arxiv.org/abs/2409.04964v1", "repo": "null"}}