{"2407.21652": {"publish_time": "2024-07-31", "title": "Spatial Transformer Network YOLO Model for Agricultural Object Detection", "paper_summary": "Object detection plays a crucial role in the field of computer vision by\nautonomously identifying and locating objects of interest. The You Only Look\nOnce (YOLO) model is an effective single-shot detector. However, YOLO faces\nchallenges in cluttered or partially occluded scenes and can struggle with\nsmall, low-contrast objects. We propose a new method that integrates spatial\ntransformer networks (STNs) into YOLO to improve performance. The proposed\nSTN-YOLO aims to enhance the model's effectiveness by focusing on important\nareas of the image and improving the spatial invariance of the model before the\ndetection process. Our proposed method improved object detection performance\nboth qualitatively and quantitatively. We explore the impact of different\nlocalization networks within the STN module as well as the robustness of the\nmodel across different spatial transformations. We apply the STN-YOLO on\nbenchmark datasets for Agricultural object detection as well as a new dataset\nfrom a state-of-the-art plant phenotyping greenhouse facility. Our code and\ndataset are publicly available.", "paper_summary_zh": "目標偵測在電腦視覺領域中扮演著關鍵角色，它能自主辨識並定位感興趣的目標。You Only Look Once (YOLO) 模型是一個有效的單次偵測器。然而，YOLO 在雜亂或部分遮擋的場景中會面臨挑戰，並且在處理小而對比度低的目標時會遇到困難。我們提出了一種新的方法，將空間轉換網路 (STN) 整合到 YOLO 中以提升效能。所提出的 STN-YOLO 旨在透過在偵測過程前專注於影像的重要區域並改善模型的空間不變性，來提升模型的效能。我們提出的方法在質量和數量上都改善了目標偵測效能。我們探討了 STN 模組中不同定位網路的影響，以及模型在不同空間轉換中的穩健性。我們將 STN-YOLO 應用於農業目標偵測的基準資料集，以及來自最先進的植物表型溫室設施的新資料集。我們的程式碼和資料集已公開。", "author": "Yash Zambre et.al.", "authors": "Yash Zambre, Ekdev Rajkitkul, Akshatha Mohan, Joshua Peeples", "id": "2407.21652v1", "paper_url": "http://arxiv.org/abs/2407.21652v1", "repo": "null"}}