{"2412.15803": {"publish_time": "2024-12-20", "title": "WebLLM: A High-Performance In-Browser LLM Inference Engine", "paper_summary": "Advancements in large language models (LLMs) have unlocked remarkable\ncapabilities. While deploying these models typically requires server-grade GPUs\nand cloud-based inference, the recent emergence of smaller open-source models\nand increasingly powerful consumer devices have made on-device deployment\npractical. The web browser as a platform for on-device deployment is\nuniversally accessible, provides a natural agentic environment, and\nconveniently abstracts out the different backends from diverse device vendors.\nTo address this opportunity, we introduce WebLLM, an open-source JavaScript\nframework that enables high-performance LLM inference entirely within web\nbrowsers. WebLLM provides an OpenAI-style API for seamless integration into web\napplications, and leverages WebGPU for efficient local GPU acceleration and\nWebAssembly for performant CPU computation. With machine learning compilers\nMLC-LLM and Apache TVM, WebLLM leverages optimized WebGPU kernels, overcoming\nthe absence of performant WebGPU kernel libraries. Evaluations show that WebLLM\ncan retain up to 80% native performance on the same device, with room to\nfurther close the gap. WebLLM paves the way for universally accessible,\nprivacy-preserving, personalized, and locally powered LLM applications in web\nbrowsers. The code is available at: https://github.com/mlc-ai/web-llm.", "paper_summary_zh": "大型語言模型 (LLM) 的進步已經解鎖了非凡的能力。雖然部署這些模型通常需要伺服器級 GPU 和基於雲端的推論，但近期出現了較小的開源模型和越來越強大的消費性裝置，讓裝置上部署變得切合實際。網路瀏覽器作為裝置上部署的平台，具有普遍的可存取性，提供了一個自然的代理環境，並便利地抽象化了來自不同裝置供應商的不同後端。為了應對這個機會，我們引入了 WebLLM，一個開源的 JavaScript 框架，可以在網路瀏覽器中完全進行高性能 LLM 推論。WebLLM 提供了一個 OpenAI 風格的 API，可以無縫整合到網路應用程式中，並利用 WebGPU 進行高效的本地 GPU 加速，以及利用 WebAssembly 進行高效的 CPU 計算。透過機器學習編譯器 MLC-LLM 和 Apache TVM，WebLLM 利用了最佳化的 WebGPU 核，克服了沒有高效能 WebGPU 核函式庫的問題。評估顯示 WebLLM 可以保留高達 80% 的原生效能，並有進一步縮小差距的空間。WebLLM 為網路瀏覽器中普遍可存取、注重隱私、個人化且由本地驅動的 LLM 應用程式鋪平了道路。程式碼可在 https://github.com/mlc-ai/web-llm 取得。", "author": "Charlie F. Ruan et.al.", "authors": "Charlie F. Ruan, Yucheng Qin, Xun Zhou, Ruihang Lai, Hongyi Jin, Yixin Dong, Bohan Hou, Meng-Shiun Yu, Yiyan Zhai, Sudeep Agarwal, Hangrui Cao, Siyuan Feng, Tianqi Chen", "id": "2412.15803v1", "paper_url": "http://arxiv.org/abs/2412.15803v1", "repo": "https://github.com/mlc-ai/web-llm"}}