{"2410.18639": {"publish_time": "2024-10-24", "title": "Diffusion Attribution Score: Evaluating Training Data Influence in Diffusion Model", "paper_summary": "As diffusion models become increasingly popular, the misuse of copyrighted\nand private images has emerged as a major concern. One promising solution to\nmitigate this issue is identifying the contribution of specific training\nsamples in generative models, a process known as data attribution. Existing\ndata attribution methods for diffusion models typically quantify the\ncontribution of a training sample by evaluating the change in diffusion loss\nwhen the sample is included or excluded from the training process. However, we\nargue that the direct usage of diffusion loss cannot represent such a\ncontribution accurately due to the calculation of diffusion loss. Specifically,\nthese approaches measure the divergence between predicted and ground truth\ndistributions, which leads to an indirect comparison between the predicted\ndistributions and cannot represent the variances between model behaviors. To\naddress these issues, we aim to measure the direct comparison between predicted\ndistributions with an attribution score to analyse the training sample\nimportance, which is achieved by Diffusion Attribution Score (DAS). Underpinned\nby rigorous theoretical analysis, we elucidate the effectiveness of DAS.\nAdditionally, we explore strategies to accelerate DAS calculations,\nfacilitating its application to large-scale diffusion models. Our extensive\nexperiments across various datasets and diffusion models demonstrate that DAS\nsignificantly surpasses previous benchmarks in terms of the linear\ndata-modelling score, establishing new state-of-the-art performance.", "paper_summary_zh": "<paragraph>隨著擴散模型越來越受歡迎，對受版權保護和私人影像的濫用已成為一個主要問題。一個有希望的解決方案是找出生成模型中特定訓練範例的貢獻，這個過程稱為資料歸因。現有的擴散模型資料歸因方法通常會透過評估在訓練過程中包含或排除範例時擴散損失的變化，來量化訓練範例的貢獻。然而，我們認為由於擴散損失的計算，直接使用擴散損失無法準確地表示這種貢獻。具體來說，這些方法測量預測分佈和真實分佈之間的差異，這導致預測分佈之間的間接比較，無法表示模型行為之間的差異。為了解決這些問題，我們旨在透過歸因分數來測量預測分佈之間的直接比較，以分析訓練範例的重要性，這透過擴散歸因分數 (DAS) 來實現。在嚴謹的理論分析的基礎上，我們闡明了 DAS 的有效性。此外，我們探索了加速 DAS 計算的策略，促進其應用於大規模擴散模型。我們在各種資料集和擴散模型上進行的廣泛實驗表明，DAS 在線性資料建模分數方面顯著超越了先前的基準，建立了新的最先進的效能。</paragraph>", "author": "Jinxu Lin et.al.", "authors": "Jinxu Lin, Linwei Tao, Minjing Dong, Chang Xu", "id": "2410.18639v2", "paper_url": "http://arxiv.org/abs/2410.18639v2", "repo": "null"}}