{"2408.13184": {"publish_time": "2024-08-23", "title": "Can LLM be a Good Path Planner based on Prompt Engineering? Mitigating the Hallucination for Path Planning", "paper_summary": "Spatial reasoning in Large Language Models (LLMs) is the foundation for\nembodied intelligence. However, even in simple maze environments, LLMs still\nencounter challenges in long-term path-planning, primarily influenced by their\nspatial hallucination and context inconsistency hallucination by long-term\nreasoning. To address this challenge, this study proposes an innovative model,\nSpatial-to-Relational Transformation and Curriculum Q-Learning (S2RCQL). To\naddress the spatial hallucination of LLMs, we propose the Spatial-to-Relational\napproach, which transforms spatial prompts into entity relations and paths\nrepresenting entity relation chains. This approach fully taps the potential of\nLLMs in terms of sequential thinking. As a result, we design a path-planning\nalgorithm based on Q-learning to mitigate the context inconsistency\nhallucination, which enhances the reasoning ability of LLMs. Using the Q-value\nof state-action as auxiliary information for prompts, we correct the\nhallucinations of LLMs, thereby guiding LLMs to learn the optimal path.\nFinally, we propose a reverse curriculum learning technique based on LLMs to\nfurther mitigate the context inconsistency hallucination. LLMs can rapidly\naccumulate successful experiences by reducing task difficulty and leveraging\nthem to tackle more complex tasks. We performed comprehensive experiments based\non Baidu's self-developed LLM: ERNIE-Bot 4.0. The results showed that our\nS2RCQL achieved a 23%--40% improvement in both success and optimality rates\ncompared with advanced prompt engineering.", "paper_summary_zh": "大型語言模型 (LLM) 中的空間推理是具身智能的基礎。然而，即使在簡單的迷宮環境中，LLM 仍然在長期路徑規劃中遇到挑戰，這主要是受其長期推理產生的空間幻覺和語境不一致幻覺影響。為了應對這一挑戰，本研究提出了一種創新的模型，即空間到關係轉換和課程 Q 學習 (S2RCQL)。為了解決 LLM 的空間幻覺，我們提出了空間到關係方法，它將空間提示轉換為表示實體關係鏈的實體關係和路徑。這種方法充分發揮了 LLM 在順序思考方面的潛力。因此，我們設計了一個基於 Q 學習的路徑規劃演算法，以減輕語境不一致幻覺，從而增強 LLM 的推理能力。利用狀態動作的 Q 值作為提示的輔助資訊，我們糾正了 LLM 的幻覺，從而引導 LLM 學習最佳路徑。最後，我們提出了一種基於 LLM 的反向課程學習技術，以進一步減輕語境不一致幻覺。LLM 可以通過降低任務難度並利用它們來應對更複雜的任務，從而快速累積成功的經驗。我們基於百度自研的 LLM：ERNIE-Bot 4.0 進行了全面的實驗。結果表明，與先進的提示工程相比，我們的 S2RCQL 在成功率和最優率方面都取得了 23%--40% 的提升。", "author": "Hourui Deng et.al.", "authors": "Hourui Deng, Hongjie Zhang, Jie Ou, Chaosheng Feng", "id": "2408.13184v1", "paper_url": "http://arxiv.org/abs/2408.13184v1", "repo": "null"}}