{"2406.17246": {"publish_time": "2024-06-25", "title": "Beyond Silence: Bias Analysis through Loss and Asymmetric Approach in Audio Anti-Spoofing", "paper_summary": "Current trends in audio anti-spoofing detection research strive to improve\nmodels' ability to generalize across unseen attacks by learning to identify a\nvariety of spoofing artifacts. This emphasis has primarily focused on the spoof\nclass. Recently, several studies have noted that the distribution of silence\ndiffers between the two classes, which can serve as a shortcut. In this paper,\nwe extend class-wise interpretations beyond silence. We employ loss analysis\nand asymmetric methodologies to move away from traditional attack-focused and\nresult-oriented evaluations towards a deeper examination of model behaviors.\nOur investigations highlight the significant differences in training dynamics\nbetween the two classes, emphasizing the need for future research to focus on\nrobust modeling of the bonafide class.", "paper_summary_zh": "當前音訊防偽偵測的研究趨勢致力於提升模型對未見攻擊的概化能力，方法是學習識別各種偽造人工製品。這種重點主要集中在偽造類別上。最近，多項研究指出，兩種類別之間的靜默分佈不同，這可以作為捷徑。在本文中，我們將類別解釋延伸到靜默之外。我們採用損失分析和非對稱方法，從傳統以攻擊為重點和以結果為導向的評估轉向更深入地探討模型行為。我們的調查強調了兩個類別之間訓練動態的顯著差異，強調未來研究需要專注於真實類別的穩健建模。", "author": "Hye-jin Shim et.al.", "authors": "Hye-jin Shim, Md Sahidullah, Jee-weon Jung, Shinji Watanabe, Tomi Kinnunen", "id": "2406.17246v1", "paper_url": "http://arxiv.org/abs/2406.17246v1", "repo": "null"}}