{"2412.18161": {"publish_time": "2024-12-24", "title": "VISION: A Modular AI Assistant for Natural Human-Instrument Interaction at Scientific User Facilities", "paper_summary": "Scientific user facilities, such as synchrotron beamlines, are equipped with\na wide array of hardware and software tools that require a codebase for\nhuman-computer-interaction. This often necessitates developers to be involved\nto establish connection between users/researchers and the complex\ninstrumentation. The advent of generative AI presents an opportunity to bridge\nthis knowledge gap, enabling seamless communication and efficient experimental\nworkflows. Here we present a modular architecture for the Virtual Scientific\nCompanion (VISION) by assembling multiple AI-enabled cognitive blocks that each\nscaffolds large language models (LLMs) for a specialized task. With VISION, we\nperformed LLM-based operation on the beamline workstation with low latency and\ndemonstrated the first voice-controlled experiment at an X-ray scattering\nbeamline. The modular and scalable architecture allows for easy adaptation to\nnew instrument and capabilities. Development on natural language-based\nscientific experimentation is a building block for an impending future where a\nscience exocortex -- a synthetic extension to the cognition of scientists --\nmay radically transform scientific practice and discovery.", "paper_summary_zh": "科學使用者設施，例如同步加速器光束線，配備了廣泛的硬體和軟體工具，需要一個用於人機互動的程式碼庫。這通常需要開發人員參與，才能在使用者/研究人員和複雜的儀器之間建立連接。生成式 AI 的出現提供了一個彌合知識差距的機會，實現無縫的溝通和高效的實驗工作流程。在此，我們提出了一個虛擬科學伴侶 (VISION) 的模組化架構，通過組裝多個 AI 驅動的認知區塊，每個區塊都為特定任務提供大型語言模型 (LLM) 的支架。使用 VISION，我們在光束線工作站上執行了基於 LLM 的操作，具有低延遲，並展示了在 X 射線散射光束線上進行的首次語音控制實驗。模組化和可擴充的架構允許輕鬆適應新的儀器和功能。基於自然語言的科學實驗的開發是一個即將到來的未來的基石，在這個未來中，科學外皮層（科學家認知的合成延伸）可能會徹底改變科學實踐和發現。", "author": "Shray Mathur et.al.", "authors": "Shray Mathur, Noah van der Vleuten, Kevin Yager, Esther Tsai", "id": "2412.18161v1", "paper_url": "http://arxiv.org/abs/2412.18161v1", "repo": "null"}}