{"2410.22695": {"publish_time": "2024-10-30", "title": "Permutation Invariant Learning with High-Dimensional Particle Filters", "paper_summary": "Sequential learning in deep models often suffers from challenges such as\ncatastrophic forgetting and loss of plasticity, largely due to the permutation\ndependence of gradient-based algorithms, where the order of training data\nimpacts the learning outcome. In this work, we introduce a novel\npermutation-invariant learning framework based on high-dimensional particle\nfilters. We theoretically demonstrate that particle filters are invariant to\nthe sequential ordering of training minibatches or tasks, offering a principled\nsolution to mitigate catastrophic forgetting and loss-of-plasticity. We develop\nan efficient particle filter for optimizing high-dimensional models, combining\nthe strengths of Bayesian methods with gradient-based optimization. Through\nextensive experiments on continual supervised and reinforcement learning\nbenchmarks, including SplitMNIST, SplitCIFAR100, and ProcGen, we empirically\nshow that our method consistently improves performance, while reducing variance\ncompared to standard baselines.", "paper_summary_zh": "深度模型中的顺序學習通常會遇到災難性遺忘和可塑性喪失等挑戰，這在很大程度上是由於基於梯度的演算法的排列依賴性，其中訓練資料的順序會影響學習結果。在這項工作中，我們介紹了一個基於高維粒子濾波器的新穎排列不變學習框架。我們從理論上證明粒子濾波器對訓練小批次或任務的順序排列不變，提供了一個原則性的解決方案來減輕災難性遺忘和可塑性喪失。我們開發了一個用於最佳化高維模型的有效粒子濾波器，結合了貝氏方法和基於梯度的最佳化的優點。透過在持續監督和強化學習基準（包括 SplitMNIST、SplitCIFAR100 和 ProcGen）上進行廣泛的實驗，我們憑經驗表明，與標準基準相比，我們的模型持續改善效能，同時降低變異。", "author": "Akhilan Boopathy et.al.", "authors": "Akhilan Boopathy, Aneesh Muppidi, Peggy Yang, Abhiram Iyer, William Yue, Ila Fiete", "id": "2410.22695v1", "paper_url": "http://arxiv.org/abs/2410.22695v1", "repo": "null"}}