{"2406.02078": {"publish_time": "2024-06-04", "title": "A Toolbox for Supporting Research on AI in Water Distribution Networks", "paper_summary": "Drinking water is a vital resource for humanity, and thus, Water Distribution\nNetworks (WDNs) are considered critical infrastructures in modern societies.\nThe operation of WDNs is subject to diverse challenges such as water leakages\nand contamination, cyber/physical attacks, high energy consumption during pump\noperation, etc. With model-based methods reaching their limits due to various\nuncertainty sources, AI methods offer promising solutions to those challenges.\nIn this work, we introduce a Python toolbox for complex scenario modeling \\&\ngeneration such that AI researchers can easily access challenging problems from\nthe drinking water domain. Besides providing a high-level interface for the\neasy generation of hydraulic and water quality scenario data, it also provides\neasy access to popular event detection benchmarks and an environment for\ndeveloping control algorithms.", "paper_summary_zh": "飲用水是人類至關重要的資源，因此，配水網路 (WDN) 被視為現代社會中的關鍵基礎設施。\nWDN 的運作會受到各種挑戰，例如漏水和汙染、網路/實體攻擊、抽水運作時的高能耗等。由於各種不確定性來源，基於模型的方法已達到極限，而 AI 方法為這些挑戰提供了有希望的解決方案。\n在這項工作中，我們介紹了一種 Python 工具箱，用於複雜情境建模和生成，讓 AI 研究人員可以輕鬆存取飲用水領域的挑戰性問題。除了提供高階介面，以輕鬆產生水力與水質情境資料外，它還提供了熱門事件偵測基準和開發控制演算法的環境。", "author": "André Artelt et.al.", "authors": "André Artelt, Marios S. Kyriakou, Stelios G. Vrachimis, Demetrios G. Eliades, Barbara Hammer, Marios M. Polycarpou", "id": "2406.02078v1", "paper_url": "http://arxiv.org/abs/2406.02078v1", "repo": "null"}}