{"2406.11801": {"publish_time": "2024-06-17", "title": "Safety Arithmetic: A Framework for Test-time Safety Alignment of Language Models by Steering Parameters and Activations", "paper_summary": "Ensuring the safe alignment of large language models (LLMs) with human values\nis critical as they become integral to applications like translation and\nquestion answering. Current alignment methods struggle with dynamic user\nintentions and complex objectives, making models vulnerable to generating\nharmful content. We propose Safety Arithmetic, a training-free framework\nenhancing LLM safety across different scenarios: Base models, Supervised\nfine-tuned models (SFT), and Edited models. Safety Arithmetic involves Harm\nDirection Removal to avoid harmful content and Safety Alignment to promote safe\nresponses. Additionally, we present NoIntentEdit, a dataset highlighting edit\ninstances that could compromise model safety if used unintentionally. Our\nexperiments show that Safety Arithmetic significantly improves safety measures,\nreduces over-safety, and maintains model utility, outperforming existing\nmethods in ensuring safe content generation.", "paper_summary_zh": "確保大型語言模型 (LLM) 與人類價值觀安全一致，對於它們成為翻譯和問答等應用程式不可或缺的一部分至關重要。目前的對齊方式方法難以應對動態使用者意圖和複雜目標，使得模型容易產生有害內容。我們提出安全算術，這是一個免訓練框架，可增強 LLM 在不同場景中的安全性：基礎模型、監督微調模型 (SFT) 和編輯模型。安全算術涉及危害方向移除，以避免有害內容，以及安全對齊，以促進安全回應。此外，我們提出 NoIntentEdit，這是一個資料集，重點標示出如果無意中使用，可能會損害模型安全性的編輯實例。我們的實驗表明，安全算術顯著改善了安全措施，減少了過度安全性，並維持模型效用，在確保安全內容生成方面優於現有方法。", "author": "Rima Hazra et.al.", "authors": "Rima Hazra, Sayan Layek, Somnath Banerjee, Soujanya Poria", "id": "2406.11801v1", "paper_url": "http://arxiv.org/abs/2406.11801v1", "repo": "https://github.com/declare-lab/safety-arithmetic"}}