{"2411.02948": {"publish_time": "2024-11-05", "title": "Grounding Natural Language to SQL Translation with Data-Based Self-Explanations", "paper_summary": "Natural Language Interfaces for Databases empower non-technical users to\ninteract with data using natural language (NL). Advanced approaches, utilizing\neither neural sequence-to-sequence or more recent sophisticated large-scale\nlanguage models, typically implement NL to SQL (NL2SQL) translation in an\nend-to-end fashion. However, like humans, these end-to-end translation models\nmay not always generate the best SQL output on their first try. In this paper,\nwe propose CycleSQL, an iterative framework designed for end-to-end translation\nmodels to autonomously generate the best output through self-evaluation. The\nmain idea of CycleSQL is to introduce data-grounded NL explanations of query\nresults as self-provided feedback, and use the feedback to validate the\ncorrectness of the translation iteratively, hence improving the overall\ntranslation accuracy. Extensive experiments, including quantitative and\nqualitative evaluations, are conducted to study CycleSQL by applying it to\nseven existing translation models on five widely used benchmarks. The results\nshow that 1) the feedback loop introduced in CycleSQL can consistently improve\nthe performance of existing models, and in particular, by applying CycleSQL to\nRESDSQL, obtains a translation accuracy of 82.0% (+2.6%) on the validation set,\nand 81.6% (+3.2%) on the test set of Spider benchmark; 2) the generated NL\nexplanations can also provide insightful information for users, aiding in the\ncomprehension of translation results and consequently enhancing the\ninterpretability of NL2SQL translation.", "paper_summary_zh": "<paragraph>資料庫的自然語言介面讓非技術使用者能使用自然語言 (NL) 與資料互動。進階方法利用神經序列對序列或更新、更精密的、大規模語言模型，通常以端對端的方式實作 NL 至 SQL (NL2SQL) 翻譯。然而，如同人類，這些端對端翻譯模型在第一次嘗試時可能無法總是產生最佳的 SQL 輸出。在本文中，我們提出 CycleSQL，一種反覆運算架構，設計用於讓端對端翻譯模型透過自我評估自主產生最佳輸出。CycleSQL 的主要概念是引入資料為基礎的 NL 查詢結果說明作為自我提供的回饋，並使用回饋反覆驗證翻譯的正確性，因此提升整體翻譯準確度。我們進行廣泛的實驗，包括量化和質化評估，透過將 CycleSQL 套用到五個廣泛使用的基準上的七種現有翻譯模型來研究 CycleSQL。結果顯示 1) CycleSQL 中引入的回饋迴路能夠持續提升現有模型的效能，特別是，透過將 CycleSQL 套用到 RESDSQL，在 Spider 基準的驗證組上取得 82.0% (+2.6%) 的翻譯準確度，以及在測試組上取得 81.6% (+3.2%) 的翻譯準確度；2) 生成的 NL 說明也能提供有用的資訊給使用者，協助理解翻譯結果，進而提升 NL2SQL 翻譯的可解釋性。</paragraph>", "author": "Yuankai Fan et.al.", "authors": "Yuankai Fan, Tonghui Ren, Can Huang, Zhenying He, X. Sean Wang", "id": "2411.02948v1", "paper_url": "http://arxiv.org/abs/2411.02948v1", "repo": "https://github.com/Kaimary/CycleSQL"}}