{"2408.01431": {"publish_time": "2024-07-18", "title": "Building an Ethical and Trustworthy Biomedical AI Ecosystem for the Translational and Clinical Integration of Foundational Models", "paper_summary": "Foundational Models (FMs) are emerging as the cornerstone of the biomedical\nAI ecosystem due to their ability to represent and contextualize multimodal\nbiomedical data. These capabilities allow FMs to be adapted for various tasks,\nincluding biomedical reasoning, hypothesis generation, and clinical\ndecision-making. This review paper examines the foundational components of an\nethical and trustworthy AI (ETAI) biomedical ecosystem centered on FMs,\nhighlighting key challenges and solutions. The ETAI biomedical ecosystem is\ndefined by seven key components which collectively integrate FMs into clinical\nsettings: Data Lifecycle Management, Data Processing, Model Development, Model\nEvaluation, Clinical Translation, AI Governance and Regulation, and Stakeholder\nEngagement. While the potential of biomedical AI is immense, it requires\nheightened ethical vigilance and responsibility. For instance, biases can arise\nfrom data, algorithms, and user interactions, necessitating techniques to\nassess and mitigate bias prior to, during, and after model development.\nMoreover, interpretability, explainability, and accountability are key to\nensuring the trustworthiness of AI systems, while workflow transparency in\ntraining, testing, and evaluation is crucial for reproducibility. Safeguarding\npatient privacy and security involves addressing challenges in data access,\ncloud data privacy, patient re-identification, membership inference attacks,\nand data memorization. Additionally, AI governance and regulation are essential\nfor ethical AI use in biomedicine, guided by global standards. Furthermore,\nstakeholder engagement is essential at every stage of the AI pipeline and\nlifecycle for clinical translation. By adhering to these principles, we can\nharness the transformative potential of AI and develop an ETAI ecosystem.", "paper_summary_zh": "基礎模型 (FM) 由於能表示和語境化多模態生物醫學數據的能力，而成為生物醫學 AI 生態系統的基石。這些能力讓 FM 能適應各種任務，包括生物醫學推理、假設產生和臨床決策制定。這篇評論論文探討了以 FM 為中心的道德和可信賴 AI (ETAI) 生物醫學生態系統的基本組成部分，重點說明了關鍵挑戰和解決方案。ETAI 生物醫學生態系統由七個關鍵組成部分定義，這些組成部分共同將 FM 整合到臨床環境中：資料生命週期管理、資料處理、模型開發、模型評估、臨床轉譯、AI 治理和法規，以及利害關係人參與。儘管生物醫學 AI 的潛力巨大，但它需要高度的道德警覺性和責任感。例如，偏見可能來自資料、演算法和使用者互動，因此需要在模型開發之前、期間和之後評估和減輕偏見的技術。此外，可解釋性、可說明性和問責制是確保 AI 系統可信賴性的關鍵，而訓練、測試和評估中的工作流程透明度對於可複製性至關重要。保障病患隱私和安全涉及解決資料存取、雲端資料隱私、病患再識別、成員推論攻擊和資料記憶化等挑戰。此外，AI 治理和法規對於在生物醫學中使用道德 AI 至關重要，並以全球標準為指導。此外，利害關係人參與在 AI 管線和臨床轉譯的生命週期中每個階段都至關重要。透過遵守這些原則，我們可以利用 AI 的轉型潛力，並開發一個 ETAI 生態系統。", "author": "Simha Sankar Baradwaj et.al.", "authors": "Simha Sankar Baradwaj, Destiny Gilliland, Jack Rincon, Henning Hermjakob, Yu Yan, Irsyad Adam, Gwyneth Lemaster, Dean Wang, Karol Watson, Alex Bui, Wei Wang, Peipei Ping", "id": "2408.01431v1", "paper_url": "http://arxiv.org/abs/2408.01431v1", "repo": "null"}}