{"2407.00326": {"publish_time": "2024-06-29", "title": "Teola: Towards End-to-End Optimization of LLM-based Applications", "paper_summary": "Large language model (LLM)-based applications consist of both LLM and non-LLM\ncomponents, each contributing to the end-to-end latency. Despite great efforts\nto optimize LLM inference, end-to-end workflow optimization has been\noverlooked. Existing frameworks employ coarse-grained orchestration with task\nmodules, which confines optimizations to within each module and yields\nsuboptimal scheduling decisions. We propose fine-grained end-to-end\norchestration, which utilizes task primitives as the basic units and represents\neach query's workflow as a primitive-level dataflow graph. This explicitly\nexposes a much larger design space, enables optimizations in parallelization\nand pipelining across primitives of different modules, and enhances scheduling\nto improve application-level performance. We build Teola, a novel orchestration\nframework for LLM-based applications that implements this scheme. Comprehensive\nexperiments show that Teola can achieve up to 2.09x speedup over existing\nsystems across various popular LLM applications.", "paper_summary_zh": "大型語言模型 (LLM) 應用程式由 LLM 和非 LLM 元件組成，每個元件都會影響端對端延遲。儘管已針對最佳化 LLM 推論做出許多努力，但端對端工作流程最佳化卻遭到忽略。現有架構採用粗略的編排與任務模組，將最佳化限制在每個模組內，並產生次佳的排程決策。我們提出細緻的端對端編排，它使用任務原語作為基本單位，並將每個查詢的工作流程表示為原語層級資料流圖。這明確地揭露了更大的設計空間，在不同模組的原語之間啟用平行化和管線最佳化，並加強排程以改善應用程式層級效能。我們建構 Teola，一個實作此架構的 LLM 應用程式創新編排架構。全面的實驗顯示，Teola 能在各種熱門 LLM 應用程式中，比現有系統快上 2.09 倍。", "author": "Xin Tan et.al.", "authors": "Xin Tan, Yimin Jiang, Yitao Yang, Hong Xu", "id": "2407.00326v1", "paper_url": "http://arxiv.org/abs/2407.00326v1", "repo": "null"}}