{"2410.04759": {"publish_time": "2024-10-07", "title": "Driving with Regulation: Interpretable Decision-Making for Autonomous Vehicles with Retrieval-Augmented Reasoning via LLM", "paper_summary": "This work presents an interpretable decision-making framework for autonomous\nvehicles that integrates traffic regulations, norms, and safety guidelines\ncomprehensively and enables seamless adaptation to different regions. While\ntraditional rule-based methods struggle to incorporate the full scope of\ntraffic rules, we develop a Traffic Regulation Retrieval (TRR) Agent based on\nRetrieval-Augmented Generation (RAG) to automatically retrieve relevant traffic\nrules and guidelines from extensive regulation documents and relevant records\nbased on the ego vehicle's situation. Given the semantic complexity of the\nretrieved rules, we also design a reasoning module powered by a Large Language\nModel (LLM) to interpret these rules, differentiate between mandatory rules and\nsafety guidelines, and assess actions on legal compliance and safety.\nAdditionally, the reasoning is designed to be interpretable, enhancing both\ntransparency and reliability. The framework demonstrates robust performance on\nboth hypothesized and real-world cases across diverse scenarios, along with the\nability to adapt to different regions with ease.", "paper_summary_zh": "本研究提出了一個可解釋的決策制定架構，適用於自動駕駛車輛，該架構將交通法規、規範和安全準則全面整合，並能無縫適應不同地區。雖然傳統的基於規則的方法難以納入所有交通規則，但我們開發了一個基於檢索增強生成 (RAG) 的交通法規檢索 (TRR) 代理，以根據自駕車輛的情況從廣泛的法規文件和相關記錄中自動檢索相關交通規則和準則。鑑於檢索規則的語義複雜性，我們還設計了一個由大型語言模型 (LLM) 驅動的推理模組，以解釋這些規則、區分強制性規則和安全準則，並評估法律合規性和安全性方面的行動。此外，推理被設計為可解釋的，既增強了透明度又增強了可靠性。該架構在各種場景中對假設和真實案例都表現出穩健的性能，同時還能輕鬆適應不同地區。", "author": "Tianhui Cai et.al.", "authors": "Tianhui Cai, Yifan Liu, Zewei Zhou, Haoxuan Ma, Seth Z. Zhao, Zhiwen Wu, Jiaqi Ma", "id": "2410.04759v1", "paper_url": "http://arxiv.org/abs/2410.04759v1", "repo": "null"}}