{"2406.16793": {"publish_time": "2024-06-24", "title": "Adam-mini: Use Fewer Learning Rates To Gain More", "paper_summary": "We propose Adam-mini, an optimizer that achieves on-par or better performance\nthan AdamW with 45% to 50% less memory footprint. Adam-mini reduces memory by\ncutting down the number of learning rates in Adam: Instead of assigning an\nindividual learning rate for each parameter using $1/\\sqrt{v}$, Adam-mini uses\nthe average of $v$ within a pre-defined parameter block as the learning rate\nfor that block. Such a design is inspired by two empirical findings. First, the\nHessian of Transformers exhibits a near-block diagonal structure with different\nsizes of dense sub-blocks. Second, for each of these dense sub-blocks, there\nexists a single high-quality learning rate that can outperform Adam, provided\nthat sufficient resources are available to search it out. Adam-mini provides\none cost-effective way to find these good learning rates and manage to cut down\n$\\geq 90% v$ in Adam. Empirically, we verify that Adam-mini performs on par or\nbetter than AdamW on various language models sized from 125M to 7B for\npre-training, supervised fine-tuning, and RLHF. The reduced memory footprint of\nAdam-mini also alleviates communication overheads among GPUs and CPUs, thereby\nincreasing throughput. For instance, Adam-mini achieves 49.6% higher throughput\nthan AdamW when pre-training Llama2-7B on 2x A800-80GB GPUs, which saves 33%\nwall-clock time for pre-training.", "paper_summary_zh": "我們提出 Adam-mini，這是一種優化器，其效能與 AdamW 相當或更好，但記憶體佔用量減少 45% 到 50%。Adam-mini 透過減少 Adam 中的學習率數量來減少記憶體：Adam-mini 不使用 $1/\\sqrt{v}$ 為每個參數指定個別學習率，而是使用預先定義的參數區塊內的 $v$ 平均值作為該區塊的學習率。這種設計的靈感來自兩個經驗發現。首先，Transformers 的 Hessian 呈現出近似區塊對角結構，具有不同大小的密集子區塊。其次，對於這些密集子區塊中的每一個，都存在一個單一的優質學習率，只要有足夠的資源來搜尋它，它就能優於 Adam。Adam-mini 提供了一種經濟有效的方法來找到這些良好的學習率，並設法在 Adam 中減少 $\\geq 90% v$。根據經驗，我們驗證了 Adam-mini 在各種語言模型上的效能與 AdamW 相當或更好，這些語言模型的大小從 125M 到 7B，用於預訓練、監督微調和 RLHF。Adam-mini 減少的記憶體佔用量也減輕了 GPU 和 CPU 之間的通訊負擔，從而增加了處理量。例如，在 2x A800-80GB GPU 上預訓練 Llama2-7B 時，Adam-mini 的處理量比 AdamW 高出 49.6%，這為預訓練節省了 33% 的實際時間。", "author": "Yushun Zhang et.al.", "authors": "Yushun Zhang, Congliang Chen, Ziniu Li, Tian Ding, Chenwei Wu, Yinyu Ye, Zhi-Quan Luo, Ruoyu Sun", "id": "2406.16793v1", "paper_url": "http://arxiv.org/abs/2406.16793v1", "repo": "null"}}