{"2406.03276": {"publish_time": "2024-06-05", "title": "Revisiting Scalable Hessian Diagonal Approximations for Applications in Reinforcement Learning", "paper_summary": "Second-order information is valuable for many applications but challenging to\ncompute. Several works focus on computing or approximating Hessian diagonals,\nbut even this simplification introduces significant additional costs compared\nto computing a gradient. In the absence of efficient exact computation schemes\nfor Hessian diagonals, we revisit an early approximation scheme proposed by\nBecker and LeCun (1989, BL89), which has a cost similar to gradients and\nappears to have been overlooked by the community. We introduce HesScale, an\nimprovement over BL89, which adds negligible extra computation. On small\nnetworks, we find that this improvement is of higher quality than all\nalternatives, even those with theoretical guarantees, such as unbiasedness,\nwhile being much cheaper to compute. We use this insight in reinforcement\nlearning problems where small networks are used and demonstrate HesScale in\nsecond-order optimization and scaling the step-size parameter. In our\nexperiments, HesScale optimizes faster than existing methods and improves\nstability through step-size scaling. These findings are promising for scaling\nsecond-order methods in larger models in the future.", "paper_summary_zh": "二階資訊對許多應用程式來說很有價值，但計算起來卻很困難。許多研究專注於計算或近似 Hessian 對角線，但即使這種簡化與計算梯度相比，也增加了顯著的額外成本。在沒有針對 Hessian 對角線的有效精確計算方案的情況下，我們重新檢視 Becker 和 LeCun（1989 年，BL89）提出的早期近似方案，其成本類似於梯度，而且似乎已被社群所忽略。我們引入了 HesScale，這是 BL89 的改進版，增加了可忽略的額外計算。在小型網路中，我們發現這種改進比所有替代方案的品質都更高，即使是那些具有理論保證（例如無偏性）的方案也是如此，而且計算成本低得多。我們在使用小型網路的強化學習問題中使用這種見解，並在二階最佳化和縮放步長參數中展示 HesScale。在我們的實驗中，HesScale 最佳化的速度比現有方法快，並透過步長縮放改善穩定性。這些發現對於未來在較大型模型中縮放二階方法很有前景。", "author": "Mohamed Elsayed et.al.", "authors": "Mohamed Elsayed, Homayoon Farrahi, Felix Dangel, A. Rupam Mahmood", "id": "2406.03276v1", "paper_url": "http://arxiv.org/abs/2406.03276v1", "repo": "null"}}