{"2407.02302": {"publish_time": "2024-07-02", "title": "Towards Human Understanding of Paraphrase Types in ChatGPT", "paper_summary": "Paraphrases represent a human's intuitive ability to understand expressions\npresented in various different ways. Current paraphrase evaluations of language\nmodels primarily use binary approaches, offering limited interpretability of\nspecific text changes. Atomic paraphrase types (APT) decompose paraphrases into\ndifferent linguistic changes and offer a granular view of the flexibility in\nlinguistic expression (e.g., a shift in syntax or vocabulary used). In this\nstudy, we assess the human preferences towards ChatGPT in generating English\nparaphrases with ten APTs and five prompting techniques. We introduce APTY\n(Atomic Paraphrase TYpes), a dataset of 500 sentence-level and word-level\nannotations by 15 annotators. The dataset also provides a human preference\nranking of paraphrases with different types that can be used to fine-tune\nmodels with RLHF and DPO methods. Our results reveal that ChatGPT can generate\nsimple APTs, such as additions and deletions, but struggle with complex\nstructures (e.g., subordination changes). This study contributes to\nunderstanding which aspects of paraphrasing language models have already\nsucceeded at understanding and what remains elusive. In addition, our curated\ndatasets can be used to develop language models with specific linguistic\ncapabilities.", "paper_summary_zh": "同義改寫代表人類直覺理解各種不同表達方式的能力。目前的語言模型同義改寫評量主要使用二元方法，提供有限的特定文字變更的可解釋性。原子同義改寫類型 (APT) 將同義改寫分解成不同的語言變化，並提供語言表達靈活性（例如，用法的句法或詞彙轉換）的細部觀點。在本研究中，我們評估人類偏好 ChatGPT 使用十種 APT 和五種提示技巧來產生英文同義改寫。我們介紹 APTY（原子同義改寫類型），一個由 15 位註解者註解的 500 個句子層級和字詞層級的資料集。此資料集也提供人類偏好排名，包含不同類型的同義改寫，可用於微調具有 RLHF 和 DPO 方法的模型。我們的結果顯示 ChatGPT 可以產生簡單的 APT，例如增刪，但難以處理複雜的結構（例如，從屬變更）。本研究有助於了解語言模型中的哪些同義改寫面向已經成功理解，哪些仍然難以捉摸。此外，我們整理的資料集可用於開發具有特定語言能力的語言模型。", "author": "Dominik Meier et.al.", "authors": "Dominik Meier, Jan Philip Wahle, Terry Ruas, Bela Gipp", "id": "2407.02302v1", "paper_url": "http://arxiv.org/abs/2407.02302v1", "repo": "null"}}