{"2501.02754": {"publish_time": "2025-01-06", "title": "MBTSAD: Mitigating Backdoors in Language Models Based on Token Splitting and Attention Distillation", "paper_summary": "In recent years, attention-based models have excelled across various domains\nbut remain vulnerable to backdoor attacks, often from downloading or\nfine-tuning on poisoned datasets. Many current methods to mitigate backdoors in\nNLP models rely on the pre-trained (unfine-tuned) weights, but these methods\nfail in scenarios where the pre-trained weights are not available. In this\nwork, we propose MBTSAD, which can mitigate backdoors in the language model by\nutilizing only a small subset of clean data and does not require pre-trained\nweights. Specifically, MBTSAD retrains the backdoored model on a dataset\ngenerated by token splitting. Then MBTSAD leverages attention distillation, the\nretrained model is the teacher model, and the original backdoored model is the\nstudent model. Experimental results demonstrate that MBTSAD achieves comparable\nbackdoor mitigation performance as the methods based on pre-trained weights\nwhile maintaining the performance on clean data. MBTSAD does not rely on\npre-trained weights, enhancing its utility in scenarios where pre-trained\nweights are inaccessible. In addition, we simplify the min-max problem of\nadversarial training and visualize text representations to discover that the\ntoken splitting method in MBTSAD's first step generates Out-of-Distribution\n(OOD) data, leading the model to learn more generalized features and eliminate\nbackdoor patterns.", "paper_summary_zh": "近年來，基於注意力的模型在各個領域都表現出色，但仍然容易受到後門攻擊，通常是從下載或微調中毒數據集而來。許多當前用於減輕 NLP 模型中後門的方法依賴於預先訓練的（未微調）權重，但這些方法在預先訓練的權重不可用的情況下會失敗。在這項工作中，我們提出了 MBTSAD，它可以通過僅使用一小部分乾淨數據來減輕語言模型中的後門，並且不需要預先訓練的權重。具體來說，MBTSAD 在通過令牌分割生成的數據集上重新訓練後門模型。然後，MBTSAD 利用注意力蒸餾，重新訓練的模型是教師模型，原始後門模型是學生模型。實驗結果表明，MBTSAD 達到了與基於預先訓練權重的方法相當的後門減輕性能，同時保持了對乾淨數據的性能。MBTSAD 不依賴於預先訓練的權重，增強了其在預先訓練的權重無法訪問的情況下的效用。此外，我們簡化了對抗訓練的 min-max 問題，並可視化文本表示，以發現 MBTSAD 第一步中的令牌分割方法生成了 Out-of-Distribution (OOD) 數據，導致模型學習更廣泛的特徵並消除後門模式。", "author": "Yidong Ding et.al.", "authors": "Yidong Ding, Jiafei Niu, Ping Yi", "id": "2501.02754v1", "paper_url": "http://arxiv.org/abs/2501.02754v1", "repo": "null"}}