{"2407.07026": {"publish_time": "2024-07-09", "title": "Resolving Sentiment Discrepancy for Multimodal Sentiment Detection via Semantics Completion and Decomposition", "paper_summary": "With the proliferation of social media posts in recent years, the need to\ndetect sentiments in multimodal (image-text) content has grown rapidly. Since\nposts are user-generated, the image and text from the same post can express\ndifferent or even contradictory sentiments, leading to potential\n\\textbf{sentiment discrepancy}. However, existing works mainly adopt a\nsingle-branch fusion structure that primarily captures the consistent sentiment\nbetween image and text. The ignorance or implicit modeling of discrepant\nsentiment results in compromised unimodal encoding and limited performances. In\nthis paper, we propose a semantics Completion and Decomposition (CoDe) network\nto resolve the above issue. In the semantics completion module, we complement\nimage and text representations with the semantics of the OCR text embedded in\nthe image, helping bridge the sentiment gap. In the semantics decomposition\nmodule, we decompose image and text representations with exclusive projection\nand contrastive learning, thereby explicitly capturing the discrepant sentiment\nbetween modalities. Finally, we fuse image and text representations by\ncross-attention and combine them with the learned discrepant sentiment for\nfinal classification. Extensive experiments conducted on four multimodal\nsentiment datasets demonstrate the superiority of CoDe against SOTA methods.", "paper_summary_zh": "隨著近年來社群媒體貼文的激增，偵測多模態（圖像文字）內容的情緒的需求也迅速增長。由於貼文是由使用者產生的，來自同一個貼文的圖像和文字可能表達出不同甚至矛盾的情緒，導致潛在的**情緒差異**。然而，現有的作品主要採用單分支融合結構，主要擷取圖像和文字之間一致的情緒。對矛盾情緒的忽略或隱式建模導致受損的單模態編碼和有限的效能。在本文中，我們提出語義完成和分解 (CoDe) 網路來解決上述問題。在語義完成模組中，我們以嵌入在圖像中的 OCR 文字的語義來補充圖像和文字表示，有助於縮小情緒差距。在語義分解模組中，我們使用獨家投影和對比學習來分解圖像和文字表示，從而明確擷取模態之間的矛盾情緒。最後，我們透過交叉注意力融合圖像和文字表示，並將它們與學習到的矛盾情緒結合起來進行最終分類。在四個多模態情緒資料集上進行的廣泛實驗證明了 CoDe 優於 SOTA 方法。", "author": "Daiqing Wu et.al.", "authors": "Daiqing Wu, Dongbao Yang, Huawen Shen, Can Ma, Yu Zhou", "id": "2407.07026v1", "paper_url": "http://arxiv.org/abs/2407.07026v1", "repo": "null"}}