{"2410.22615": {"publish_time": "2024-10-30", "title": "CoGS: Model Agnostic Causality Constrained Counterfactual Explanations using goal-directed ASP", "paper_summary": "Machine learning models are increasingly used in critical areas such as loan\napprovals and hiring, yet they often function as black boxes, obscuring their\ndecision-making processes. Transparency is crucial, as individuals need\nexplanations to understand decisions, primarily if the decisions result in an\nundesired outcome. Our work introduces CoGS (Counterfactual Generation with\ns(CASP)), a model-agnostic framework capable of generating counterfactual\nexplanations for classification models. CoGS leverages the goal-directed Answer\nSet Programming system s(CASP) to compute realistic and causally consistent\nmodifications to feature values, accounting for causal dependencies between\nthem. By using rule-based machine learning algorithms (RBML), notably the\nFOLD-SE algorithm, CoGS extracts the underlying logic of a statistical model to\ngenerate counterfactual solutions. By tracing a step-by-step path from an\nundesired outcome to a desired one, CoGS offers interpretable and actionable\nexplanations of the changes required to achieve the desired outcome. We present\ndetails of the CoGS framework along with its evaluation.", "paper_summary_zh": "機器學習模型在貸款核准和聘用等關鍵領域中日益廣泛地使用，然而它們通常作為黑盒子運作，模糊了其決策制定過程。透明度至關重要，因為個人需要解釋才能理解決策，特別是如果決策導致了不受歡迎的結果。我們的研究引入了 CoGS（反事實生成與 s(CASP)），一個與模型無關的框架，能夠為分類模型生成反事實解釋。CoGS 利用目標導向的 Answer Set Programming 系統 s(CASP) 來計算現實且因果一致的變更，以說明其特徵值，並考慮它們之間的因果關係。透過使用基於規則的機器學習演算法（RBML），尤其是 FOLD-SE 演算法，CoGS 從統計模型中萃取出底層邏輯，以產生反事實解。CoGS 從不受歡迎的結果追蹤到理想的結果，提供了可解釋且可行的解釋，說明了達成理想結果所需的變更。我們提供了 CoGS 框架的詳細資訊，以及其評估。", "author": "Sopam Dasgupta et.al.", "authors": "Sopam Dasgupta, Joaquín Arias, Elmer Salazar, Gopal Gupta", "id": "2410.22615v1", "paper_url": "http://arxiv.org/abs/2410.22615v1", "repo": "null"}}